{
  "id": "10bgzr9",
  "subreddit": "bulimia",
  "author": "adonistoo",
  "created_utc": 1673675771.0,
  "title": "this is as low as i can possibly go…. **TW** **disgusting**",
  "selftext": "i just have to get this off my chest….\n\nbackground: i have reached rock bottom. i didn’t know i could get this low. i have had bulimia for close to 6 years now. EXTENSIVELY in the past 2 years. shit has been bad these past few months, blowing hundreds of dollars a month on B/P food. spending hours every evening ritualistically bingeing and purging. thoughts of food and B/P every other minute of every day. almost no food i’ve eaten in the past few years i have intended to keep in my body. i must be surviving on the calories i can’t fully purge away.\n\nhere it is- my big secret. i have destroyed not only my mind and body but my house too. i’ve destroyed my plumbing system twice because of vomiting too much undigested food- it cost thousands to fix. so i stopped purging into the toilet and instead purged into bags that i used to dump in nearby dumpsters in the dead of night. that’s right, i would put them in boxes in my car and drive them to dumpsters.\n\nonly i’ve gotten depressed and lazy lately and so instead they’ve been sitting on my floor in various rooms of my house, like a disgusting graveyard of my past sins. and some of them have leaked and destroyed my hardwood floors, carpets etc. my kitchen has so many wrappers and plastic and boxes that i’m too depressed to clean up. tonight- i was boiling water (for B/P food) and all those wrappers next to the stovetop finally caught on fire. that’s right, i set my kitchen on fire. by the time i noticed it, it was completely filled with smoke and the fire was climbing up my walls and had set a few things in the kitchen on fire. i ran and grabbed some jugs of water and put it out myself (oh yeah- unrelated but my water is messed up so i just shut it off rather than get a plumber, because i can’t have anyone in my home because it is full of vomit). i had to put the fire out myself because once again, i was too ashamed to CALL THE FIRE DEPARTEMENT and let them in my home. my kitchen is half destroyed, my stove and oven don’t work, i think i blew some electrical things too.\n\nand i can’t do anything about any of it until i get rid of the vomit in my home. but i’m too scared and anxious and ashamed to do anything. i’m paralyzed in this graveyard.\n\ni don’t need anything from anyone, i know how  fucked up everything is. i just had to say it out loud to someone just once\n\nEDIT: deep down some part of me feared posting this because I would get replies telling me what a disgusting freak I was and that I was too far gone for help and who knows what else. I should have known better that this community would show me love and acceptance and well wishes for the future, and stories about how they’ve been there too… I can’t share this shame with anyone but those of us that get it. You can’t talk about habitual vomiting to anyone else and expect them to understand. So thank you, for making me feel seen and less alone… I love you all. I really do. All my fellow broken busted souls, we are connected in some deep way and I have love for you all ❤️",
  "url": "https://www.reddit.com/r/bulimia/comments/10bgzr9/this_is_as_low_as_i_can_possibly_go_tw_disgusting/",
  "score": 270,
  "num_comments": 50,
  "comments": [
    {
      "id": "j4a8cpj",
      "author": "aItereg0",
      "body": "Im sorry this happened to you. \nSmoke inhalation is no joke, I know it might not be possible for a bunch of reasons but if you can you should get yourself looked at, and the cats as well",
      "created_utc": 1673677946.0,
      "score": 63,
      "context": []
    },
    {
      "id": "j4aal2p",
      "author": "OptimalShoe4861",
      "body": "I'm a lady and I've had my eating disorders (anorexia, bulimia (b/p) since I was 12/13 years old. I'm 35 now and Still have these urges, constantly. So more than 20 years, ⅔ of my life have been dedicated to fucking torturing myself with ED's. I know how you feel, I went through all that as well. When I was still living with my parent/s, I messed up the plumbing. There were weird maggot things that started appearing in the toilet. They tried to call me out on it. So I started using ziplock and plastic grocery store bags, they were in a cubby in my room. I had to get Raid/fly traps for my room at the time bc it had a nasty swarm, literal SWARM of fruit flies. Why the fuck did I do that?! Well, bc I love food and hate it, don't want other people to know my struggle and I have extreme body dysmorphia, also bc intense shame I feel about my actions... Sure I enjoy/feel guilty after my relief sessions, I also feel guilty bc food costs money and I'm metaphorically flushing money down the toilet. So wasteful. These days, I live with my bf, I ONLY eat or b/p while he's at work or when he's sleeping. Plus I have insomnia so I'm 'eating' any point between 11:30pm-1am, then recuperating from my sickness for a few hours, lay in bed thinking terrible shit and lying to myself for a couple more hours... Just waiting, then somehow I finally fall asleep from being exhausted. Or I don't sleep bc my life choices haunt me. I've gone to inpatient, outpatient, psychiatrists. I'm tired of it all but somehow, I don't want to let go of that part of me, it's a part that I hate, love, am scared of, ashamed of.... it's fucked up, but it's how I \"live\". So, believe me, you're not alone. I thought I was for most my life, that nobody (even other ED people) was able to understand or even comprehend the thoughts/feelings I was enduring. We're ALL sick... The problem is, is there Really a point when we can accept changing? Leaving behind an addiction? Are any of us ready to look at ourselves in the mirror and truly accept how we look? Lol at another person and Not compare ourselves to them? Can our bravery of wanting to be healthy overcome our debilitating fear of becoming healthy? The questions go on and are dark, morbid, scary... But we can't answer them truthfully, not to ourselves, and not to other people. It's fucked up.",
      "created_utc": 1673679557.0,
      "score": 38,
      "context": []
    },
    {
      "id": "j4aol9i",
      "author": "None",
      "body": "Remember that it’s always okay to start small. It’s okay to start small, without pressure from the future to ‘solve’ the whole problem. You don’t need to ‘solve’ the whole problem. But it’s okay to start small. Just one wrapper thrown away today: that’s okay. Just one spill wiped up tomorrow. It doesn’t need to be every day. You don’t need to feel the pressure of everything all at once. You can start small, and believe in yourself that you can do this, and go EASY on yourself, and forgive yourself. And that’s enough, and one day you’ll have created a better situation for yourself. You can get out of this!",
      "created_utc": 1673690823.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j4b01ax",
      "author": "a-non-eye-moose",
      "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
      "created_utc": 1673699738.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j4ac6s3",
      "author": "Lele926",
      "body": "I'm so sorry, this happened to you. Please know that you are not alone. Because I live in a student dorm, I always purge into bags and sneak them out when I can. My room smells awful and the bags are a constant reminder of the shame.\n\nI know, it is hard, but please take care of yourself. Visit a doctor for the smoke inhalation, they don't have to know the details. \n\nI wish you the best and you are not alone!",
      "created_utc": 1673680774.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j4a68q2",
      "author": "summersunforu",
      "body": "i’m so sorry. i know it’s not easy to do but try not to beat yourself up over this. i am sending you all my love and i hope things get better for you soon. 💕",
      "created_utc": 1673676480.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j4e6dk8",
      "author": "emotionalandscapes",
      "body": "eating disorders often get so romanticized. this is our reality.",
      "created_utc": 1673748169.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j4bw0dy",
      "author": "TATrashpanda",
      "body": "If I could, I would be there in a second to help you in person. To take all those bags and drive them around to different dumpsters to get rid of them. God I remember what that was like. I use to think I was the only one. But I wasn’t alone and you’re not either. Sending all the support possible❤️❤️❤️❤️",
      "created_utc": 1673714756.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j4bt5x7",
      "author": "joellezucker",
      "body": "I’m so sorry this is happening. You’re not disgusting, you’re not well. It’s different. Sending all my love darling <33",
      "created_utc": 1673713632.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j4e05oi",
      "author": "Missveexox13",
      "body": "This hurt my heart to read. Reminds me so much of my drug addiction. How out of control I was and paralyzed by the consequences, unable to pull out of it. Please be kind to yourself.. you don’t have the privilege or advantage most people have/take for granted which is not being captive to addiction. Sending all my love sweetheart",
      "created_utc": 1673745436.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j4bifxk",
      "author": "blarbiegorl",
      "body": "I'm so very sorry things have been so hard.  Trying to dig out of these holes takes so much when we have nothing left to give and it sucks.  Please just know you're not alone. It will get better. You CAN do this. And it's going to be ok.\nKeep hanging on, take it one baby step at a time.  You deserve better than all this pain and it will not always be this way.  Sending you all the love. 💜",
      "created_utc": 1673709184.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j4a5sds",
      "author": "adonistoo",
      "body": "my eyes and lungs are fucking burning from the smoke right now. the thing i feel worst about is some of the smoke will get breathed in by my cats- i had previously closed off the dining room/kitchen/living room from rest of the house so they weren’t near my shame, so the worst of the smoke and such is confined behind that door. but some of it is in our half of the house and i feel horrible their tiny bodies will have to breathe some smoke. they deserve nothing but amazing things and i exposed them to this…",
      "created_utc": 1673676178.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j4ck543",
      "author": "Undercover-Loner",
      "body": "This is a long shot I know, a really really really long shot but just incase- if you live anywhere near the south of England pop me a message, I can drive round and help you clean up while you take a bath or do something for yourself. Vomit bags and dirty houses do not scare me, I just want you to be okay x",
      "created_utc": 1673724201.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4dj44x",
      "author": "Ok-Internet-8003",
      "body": "I just want to send you so much love and compassion. We’ve all had these rock bottom  moments but you are NOT disgusting. You’re a good person going through a bad time. Sending you all the love and hugs I can because I know exactly how you feel and how hard it is ❤️",
      "created_utc": 1673738353.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4dyn9q",
      "author": "maggiebug165",
      "body": "Sending you all the love and hugs. So many of us have been there. You can get through this. Lean on us for support anytime. That’s why this community exists. ❤️",
      "created_utc": 1673744766.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4epeww",
      "author": "MomentNecessary3353",
      "body": "You are not disgusting, you are not a freak. I’m so glad you let all of this out on this platform—that means you at least trust us. We’re all in this together, and one day, I trust, you’ll be able to overcome everything ! ❤️❤️ Sending love\n\nI know it’s super super hard to find the motivation to do anything but try to at least get yourself together, only if you feel like it. If you have the conditions, work on some self-care and harm reduction",
      "created_utc": 1673756883.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4ib0ma",
      "author": "Sxph_dnttll",
      "body": "I’m so so sorry ): this disease will absolutely wreck your life and leave you with nothing! I am praying for your safety right now because this is really scary 💞 please don’t be afraid to get help ❤️‍🩹 also I relate to the plumbing part: a few years ago I blocked my parents whole sink up and they had to call a plumber- so embarrassing 😭",
      "created_utc": 1673822416.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j4kh6ah",
      "author": "ReiMiOne",
      "body": "Agree with starting with getting rid of the bags. We have all been here in some ways. I remember driving around with vombags, looking for a place to get rid of it. Then I get riddled with guilt, anxiety, paranoia— paranoid of getting caught, or someone seeing the bag full of vomit. its bad. So I end up opening the vombag, and flushing it down public restroom.",
      "created_utc": 1673863022.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j6s6k91",
      "author": "GroupSure9134",
      "body": "I feel you❤️ it’s gotten to a point where I’d just stare at the mess i’ve made and be too tired to even clear it.. bulimia has made me so secretive i’m constantly hiding & clearing my ‘crime scene’ so no one would find out, my room always smells horrid, and i’ve told so many lies to explain why plastic bags and containers kept disappearing from the house..\n\nn when the bags leak n it gets all over my hands i just wna kms 💩\n\nknow you’re not alone in this :’)",
      "created_utc": 1675263494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j86rin3",
      "author": "artsyhorrorfan",
      "body": "I’m so sorry, I have had bulimia for almost 2 years now. Being fairly young also doesn’t help. Best wishes.",
      "created_utc": 1676165742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kgvyxrc",
      "author": "Kwinkzi",
      "body": "I hope you're doing better, I see you. I'm so sorry you struggled so deeply. People don't seem to understand how bad it can get, and thus thrust judgement. I hope you found nothing but a warm embrace here. All the love, sweetheart <3",
      "created_utc": 1704718277.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j8bnmyv",
      "author": "None",
      "body": "Sending you love and support. You aren’t disgusting or a freak.",
      "created_utc": 1676256550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j4a9op8",
      "author": "adonistoo",
      "body": "i’m at least going to look up home remedies to help with smoke inhalation, i definitely felt it when i was in that kitchen… it was horrible. i’m just so fucking glad i didn’t pass out or something before being able to put out the fire (i didn’t feel imminent passing out or anything, but terrifying to know it theoretically could have happened while a fire raged on). and if i notice anything serious in the next day or two i will go to urgent care. at least i can go to them and they don’t have to come to my house lol… as for the cats, i’m just praying (i’m not even religious but i’ll try anything) that them being in these mostly closed off rooms and also being low to the ground on account of being so smol and sweet, escaped the worst of it. but i will google too and see if there’s anything to do or look out for. if i have to go broke taking care of them i will",
      "created_utc": 1673678900.0,
      "score": 18,
      "context": [
        {
          "id": "j4a8cpj",
          "author": "aItereg0",
          "body": "Im sorry this happened to you. \nSmoke inhalation is no joke, I know it might not be possible for a bunch of reasons but if you can you should get yourself looked at, and the cats as well",
          "created_utc": 1673677946.0
        }
      ]
    },
    {
      "id": "j4bnh8f",
      "author": "adonistoo",
      "body": "Wow… this is EVERYTHING I have felt for years… ED makes me feel safe, it makes me feel a lot of other things too, mostly terrible. But the strange comfort and safety I feel in this habit is so hard to kick. Recovery and being functional and “normal” and healthy feels way too hard to achieve, like those things were not meant for me, like I was always meant to be this lonely, unwell freak. How to kick habits that have become my coping mechanism and safety net for years… when all goes wrong, I can always find safety and comfort in planning a B/P session. Because as weird as it sounds… I’m good at it. I’m good at purging, and as we all know, it feels good to be empty. Many times I wonder if I’m just meant to be sick like this forever, how can I re-enter society when I feel so fundamentally different than anyone who doesn’t have a brain that runs like mine. 24/7 food and B/P thoughts, how to rewire that. Feels insurmountable, and if it is, why bother trying… In theory I want to be better, but is it for me..? I don’t know. Thank you for making me feel less alone and disgusting. I see others like me and I feel such love for them, but hold myself to different standards and berate myself for the same things I show love to strangers for. Life is hard and confusing huh",
      "created_utc": 1673711320.0,
      "score": 7,
      "context": [
        {
          "id": "j4aal2p",
          "author": "OptimalShoe4861",
          "body": "I'm a lady and I've had my eating disorders (anorexia, bulimia (b/p) since I was 12/13 years old. I'm 35 now and Still have these urges, constantly. So more than 20 years, ⅔ of my life have been dedicated to fucking torturing myself with ED's. I know how you feel, I went through all that as well. When I was still living with my parent/s, I messed up the plumbing. There were weird maggot things that started appearing in the toilet. They tried to call me out on it. So I started using ziplock and plastic grocery store bags, they were in a cubby in my room. I had to get Raid/fly traps for my room at the time bc it had a nasty swarm, literal SWARM of fruit flies. Why the fuck did I do that?! Well, bc I love food and hate it, don't want other people to know my struggle and I have extreme body dysmorphia, also bc intense shame I feel about my actions... Sure I enjoy/feel guilty after my relief sessions, I also feel guilty bc food costs money and I'm metaphorically flushing money down the toilet. So wasteful. These days, I live with my bf, I ONLY eat or b/p while he's at work or when he's sleeping. Plus I have insomnia so I'm 'eating' any point between 11:30pm-1am, then recuperating from my sickness for a few hours, lay in bed thinking terrible shit and lying to myself for a couple more hours... Just waiting, then somehow I finally fall asleep from being exhausted. Or I don't sleep bc my life choices haunt me. I've gone to inpatient, outpatient, psychiatrists. I'm tired of it all but somehow, I don't want to let go of that part of me, it's a part that I hate, love, am scared of, ashamed of.... it's fucked up, but it's how I \"live\". So, believe me, you're not alone. I thought I was for most my life, that nobody (even other ED people) was able to understand or even comprehend the thoughts/feelings I was enduring. We're ALL sick... The problem is, is there Really a point when we can accept changing? Leaving behind an addiction? Are any of us ready to look at ourselves in the mirror and truly accept how we look? Lol at another person and Not compare ourselves to them? Can our bravery of wanting to be healthy overcome our debilitating fear of becoming healthy? The questions go on and are dark, morbid, scary... But we can't answer them truthfully, not to ourselves, and not to other people. It's fucked up.",
          "created_utc": 1673679557.0
        }
      ]
    },
    {
      "id": "j4bmrnf",
      "author": "adonistoo",
      "body": "Thank you dear ❤️ you’re right, i set myself up for failure if I tell myself I need to polish up the entire house immediately or I’ve failed. I need to set small small goals to slowly tackle the enormity I’ve let it all grow to. Just a little bit each day… ❤️",
      "created_utc": 1673711026.0,
      "score": 9,
      "context": [
        {
          "id": "j4aol9i",
          "author": "None",
          "body": "Remember that it’s always okay to start small. It’s okay to start small, without pressure from the future to ‘solve’ the whole problem. You don’t need to ‘solve’ the whole problem. But it’s okay to start small. Just one wrapper thrown away today: that’s okay. Just one spill wiped up tomorrow. It doesn’t need to be every day. You don’t need to feel the pressure of everything all at once. You can start small, and believe in yourself that you can do this, and go EASY on yourself, and forgive yourself. And that’s enough, and one day you’ll have created a better situation for yourself. You can get out of this!",
          "created_utc": 1673690823.0
        }
      ]
    },
    {
      "id": "j4b2te0",
      "author": "a-non-eye-moose",
      "body": "I dealt with the vombags before.. very tricky business \n\nI also have a bathroom that we don't talk about. I clogged up the pipes and now water doesnt drain away ....hopefully the landlord won't notice before we move out. 😅\n\nJust trying to say you're not alone in these fudge ups, they happen. Just need to kick yourself into gear and try to sort out what you can. Trying is the best first move forward. \n\nx",
      "created_utc": 1673701466.0,
      "score": 4,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        }
      ]
    },
    {
      "id": "j4bm7s9",
      "author": "adonistoo",
      "body": "Thank you ❤️ that is definitely mission 1, I have had anxiety nightmares about people coming over to my house and seeing it. I haven’t invited anyone over in months and I panic when I think about a friend or relative desperately needing to come to me for some reason and having to tell them I can’t let them in. I need to slowly clean it all, then call the professionals to fix, and finally feel like my house is a home again. My cats deserve it. Thank you for your support fellow stranger, this sub has made me not feel as much like the disgusting freak i have been feeling…",
      "created_utc": 1673710794.0,
      "score": 2,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        }
      ]
    },
    {
      "id": "j4bmi14",
      "author": "adonistoo",
      "body": "Walking past the bags ignites the worst shame in me, thank you for responding and letting me know I’m not alone in feeling this deep deep shame. Wish us both to kick this some day…",
      "created_utc": 1673710914.0,
      "score": 6,
      "context": [
        {
          "id": "j4ac6s3",
          "author": "Lele926",
          "body": "I'm so sorry, this happened to you. Please know that you are not alone. Because I live in a student dorm, I always purge into bags and sneak them out when I can. My room smells awful and the bags are a constant reminder of the shame.\n\nI know, it is hard, but please take care of yourself. Visit a doctor for the smoke inhalation, they don't have to know the details. \n\nI wish you the best and you are not alone!",
          "created_utc": 1673680774.0
        }
      ]
    },
    {
      "id": "j4a70r4",
      "author": "adonistoo",
      "body": "thank you, i don’t know why but this comment made me finally cry out the emotions i’ve been numbing for god knows how long. i am slowly starting to force myself to acknowledge how far i’ve let this go. it can’t happen again, it can’t. this has to be the moment i turn things around. if this doesn’t change things for me then there is no hope. i will try to take the next few weeks to clean up my home, maybe i can take some time off work too. just really clean and get rid of as much of the shame as i can. once that is done i will buy some large area rugs to cover the worst of the hardwood floor stains. \n\nthen- i will finally be able to call someone to fix my water, and my kitchen i guess. what’s a few weeks without a kitchen eh….",
      "created_utc": 1673677018.0,
      "score": 6,
      "context": [
        {
          "id": "j4a68q2",
          "author": "summersunforu",
          "body": "i’m so sorry. i know it’s not easy to do but try not to beat yourself up over this. i am sending you all my love and i hope things get better for you soon. 💕",
          "created_utc": 1673676480.0
        }
      ]
    },
    {
      "id": "j4gvpiq",
      "author": "adonistoo",
      "body": "so true… it can be messy and dirty and icky. it’s not just glamorous waifish models. it’s normal every day people ritualistically harming themselves every day",
      "created_utc": 1673803270.0,
      "score": 5,
      "context": [
        {
          "id": "j4e6dk8",
          "author": "emotionalandscapes",
          "body": "eating disorders often get so romanticized. this is our reality.",
          "created_utc": 1673748169.0
        }
      ]
    },
    {
      "id": "j4c7jqn",
      "author": "adonistoo",
      "body": "that might be the sweetest goshdarn thing anyone has ever said to me.  you clearly know this secret struggle very, very well. i also used to think i was the only one who was this far gone… gives me a really surprising sense of kinship and comfort to know others have been down this weird twisty road too. when you write it out you really are faced with how outrageous it is, my brain tries to deny it but i guess it’s because i normalized it by doing it for so long. man if a stranger could see inside my world they’d be 😵‍💫😵‍💫😵‍💫",
      "created_utc": 1673719262.0,
      "score": 6,
      "context": [
        {
          "id": "j4bw0dy",
          "author": "TATrashpanda",
          "body": "If I could, I would be there in a second to help you in person. To take all those bags and drive them around to different dumpsters to get rid of them. God I remember what that was like. I use to think I was the only one. But I wasn’t alone and you’re not either. Sending all the support possible❤️❤️❤️❤️",
          "created_utc": 1673714756.0
        }
      ]
    },
    {
      "id": "j4buric",
      "author": "adonistoo",
      "body": "thank you ❤️ i am trying not to use such awful harsh words to describe myself but hard to break that cycle yknow.",
      "created_utc": 1673714272.0,
      "score": 2,
      "context": [
        {
          "id": "j4bt5x7",
          "author": "joellezucker",
          "body": "I’m so sorry this is happening. You’re not disgusting, you’re not well. It’s different. Sending all my love darling <33",
          "created_utc": 1673713632.0
        }
      ]
    },
    {
      "id": "j4gvexh",
      "author": "adonistoo",
      "body": "it truly is an addiction… for a while i never considered myself an addict bc messaging has always been that addictions are drugs, alcohol etc. but B/P is an addiction that fucks your brain chemistry the same way. hard hole to dig out of especially with how secretive we feel we have to be with it. thank you for the love ❤️",
      "created_utc": 1673803162.0,
      "score": 2,
      "context": [
        {
          "id": "j4e05oi",
          "author": "Missveexox13",
          "body": "This hurt my heart to read. Reminds me so much of my drug addiction. How out of control I was and paralyzed by the consequences, unable to pull out of it. Please be kind to yourself.. you don’t have the privilege or advantage most people have/take for granted which is not being captive to addiction. Sending all my love sweetheart",
          "created_utc": 1673745436.0
        }
      ]
    },
    {
      "id": "j4blwui",
      "author": "adonistoo",
      "body": "thank you ❤️ digging myself out of a hole with nothing to give is exactly how I feel, it feels insurmountable right now, I have to keep taking those baby steps though, no matter how long it takes, and very slowly out myself back together. I can’t wait for the day when I get to look back at all this shit and feel proud I kicked it…",
      "created_utc": 1673710669.0,
      "score": 3,
      "context": [
        {
          "id": "j4bifxk",
          "author": "blarbiegorl",
          "body": "I'm so very sorry things have been so hard.  Trying to dig out of these holes takes so much when we have nothing left to give and it sucks.  Please just know you're not alone. It will get better. You CAN do this. And it's going to be ok.\nKeep hanging on, take it one baby step at a time.  You deserve better than all this pain and it will not always be this way.  Sending you all the love. 💜",
          "created_utc": 1673709184.0
        }
      ]
    },
    {
      "id": "j4gw01o",
      "author": "adonistoo",
      "body": "you are fucking amazing ❤️ i am in USA unfortunately, but the offer nonetheless means so much because i can’t think of a single person in real life i could share any part of the above sorry with, let alone dare ask them for help. you’re a gem, thank you for getting me",
      "created_utc": 1673803377.0,
      "score": 2,
      "context": [
        {
          "id": "j4ck543",
          "author": "Undercover-Loner",
          "body": "This is a long shot I know, a really really really long shot but just incase- if you live anywhere near the south of England pop me a message, I can drive round and help you clean up while you take a bath or do something for yourself. Vomit bags and dirty houses do not scare me, I just want you to be okay x",
          "created_utc": 1673724201.0
        }
      ]
    },
    {
      "id": "j4gvtqg",
      "author": "adonistoo",
      "body": "thank you ❤️ this community is amazing, i keep coming back and reading the comments to try to convince myself to stop hiding and take those baby steps i need to take to start fixing my life and myself",
      "created_utc": 1673803313.0,
      "score": 1,
      "context": [
        {
          "id": "j4dj44x",
          "author": "Ok-Internet-8003",
          "body": "I just want to send you so much love and compassion. We’ve all had these rock bottom  moments but you are NOT disgusting. You’re a good person going through a bad time. Sending you all the love and hugs I can because I know exactly how you feel and how hard it is ❤️",
          "created_utc": 1673738353.0
        }
      ]
    },
    {
      "id": "j4gw6re",
      "author": "adonistoo",
      "body": "thank you ❤️ i’ve avoided coming to this sub in the past fearing that it would trigger me, but the fact of the matter is that i don’t need triggering to engage in B/P behaviors because it’s become second nature, it’s a cycle in fully in. joining a community of those who can understand and support can only do good considering where i am right now.",
      "created_utc": 1673803448.0,
      "score": 2,
      "context": [
        {
          "id": "j4dyn9q",
          "author": "maggiebug165",
          "body": "Sending you all the love and hugs. So many of us have been there. You can get through this. Lean on us for support anytime. That’s why this community exists. ❤️",
          "created_utc": 1673744766.0
        }
      ]
    },
    {
      "id": "j4gwk47",
      "author": "adonistoo",
      "body": "thank you ❤️ it’s been amazing to hear from so many people who have been in similar positions as me. i have no friends in my life who can possibly understand. and i fear joining real life support groups for a number of reasons. one of which is i am a man, and i know there are very few of us, and i would feel even more exposed being in a group where i am an outsider in some way. i am trying to keep reminding myself not to use such harsh language with myself but it’s tough ❤️",
      "created_utc": 1673803586.0,
      "score": 1,
      "context": [
        {
          "id": "j4epeww",
          "author": "MomentNecessary3353",
          "body": "You are not disgusting, you are not a freak. I’m so glad you let all of this out on this platform—that means you at least trust us. We’re all in this together, and one day, I trust, you’ll be able to overcome everything ! ❤️❤️ Sending love\n\nI know it’s super super hard to find the motivation to do anything but try to at least get yourself together, only if you feel like it. If you have the conditions, work on some self-care and harm reduction",
          "created_utc": 1673756883.0
        }
      ]
    },
    {
      "id": "j4vwytk",
      "author": "adonistoo",
      "body": "terrifying and humiliating to live like this 😭 but so hard to crawl out of… knowing i’m not the only one who lives and operates a double life like this brings me some degree of comfort ❤️",
      "created_utc": 1674061706.0,
      "score": 1,
      "context": [
        {
          "id": "j4ib0ma",
          "author": "Sxph_dnttll",
          "body": "I’m so so sorry ): this disease will absolutely wreck your life and leave you with nothing! I am praying for your safety right now because this is really scary 💞 please don’t be afraid to get help ❤️‍🩹 also I relate to the plumbing part: a few years ago I blocked my parents whole sink up and they had to call a plumber- so embarrassing 😭",
          "created_utc": 1673822416.0
        }
      ]
    },
    {
      "id": "j4vx8je",
      "author": "adonistoo",
      "body": "this is exactly me! ughhh it’s a big part of why i let it build up… the fear that what if my car breaks down randomly or i get pulled over and get caught dumping it etc. the shame would be so great i would just collapse in on myself and combust. i have to build up the strength and courage to take that first step, and very soon. i’ve been dragging my feet since i posted this",
      "created_utc": 1674061804.0,
      "score": 1,
      "context": [
        {
          "id": "j4kh6ah",
          "author": "ReiMiOne",
          "body": "Agree with starting with getting rid of the bags. We have all been here in some ways. I remember driving around with vombags, looking for a place to get rid of it. Then I get riddled with guilt, anxiety, paranoia— paranoid of getting caught, or someone seeing the bag full of vomit. its bad. So I end up opening the vombag, and flushing it down public restroom.",
          "created_utc": 1673863022.0
        }
      ]
    },
    {
      "id": "kvkja9g",
      "author": "adonistoo",
      "body": "i am doing so much better. SOOO much better. i am months into recovery with no slip ups. i tried to post a life update the other day but something i said accidentally triggered auto remove so i have to edit and repost. but somehow i crawled out and rejoined normal society and i have a death grip on this new life and nothing will bring me back to the darkness, i’d sooner die",
      "created_utc": 1710851962.0,
      "score": 1,
      "context": [
        {
          "id": "kgvyxrc",
          "author": "Kwinkzi",
          "body": "I hope you're doing better, I see you. I'm so sorry you struggled so deeply. People don't seem to understand how bad it can get, and thus thrust judgement. I hope you found nothing but a warm embrace here. All the love, sweetheart <3",
          "created_utc": 1704718277.0
        }
      ]
    },
    {
      "id": "j4aa21s",
      "author": "aItereg0",
      "body": "Just do what you feel you can and keep watch on yours and your cats breathing for a day or so. You've been through a lot and it's obvious how much you care about them. Please take care of yourself as well, you deserve it.",
      "created_utc": 1673679166.0,
      "score": 5,
      "context": [
        {
          "id": "j4a8cpj",
          "author": "aItereg0",
          "body": "Im sorry this happened to you. \nSmoke inhalation is no joke, I know it might not be possible for a bunch of reasons but if you can you should get yourself looked at, and the cats as well",
          "created_utc": 1673677946.0
        },
        {
          "id": "j4a9op8",
          "author": "adonistoo",
          "body": "i’m at least going to look up home remedies to help with smoke inhalation, i definitely felt it when i was in that kitchen… it was horrible. i’m just so fucking glad i didn’t pass out or something before being able to put out the fire (i didn’t feel imminent passing out or anything, but terrifying to know it theoretically could have happened while a fire raged on). and if i notice anything serious in the next day or two i will go to urgent care. at least i can go to them and they don’t have to come to my house lol… as for the cats, i’m just praying (i’m not even religious but i’ll try anything) that them being in these mostly closed off rooms and also being low to the ground on account of being so smol and sweet, escaped the worst of it. but i will google too and see if there’s anything to do or look out for. if i have to go broke taking care of them i will",
          "created_utc": 1673678900.0
        }
      ]
    },
    {
      "id": "j4cro2v",
      "author": "OptimalShoe4861",
      "body": "It's about insecurities, coping, control. We use our (B) sessions to indulge in the things we feel others would shame or judge us for, and bc we do it alone we feel like there is no judgement (other than yourself) and we can have 'our cake and eat it too' literally. But then comes the self-judgement, I hear, \"WTF is wrong with me? Why do I keep doing this? This is the last time. You're such a stupid girl. I'll fix it. I'm so tired, I don't want to have to do this... But I have to. Why did I have so much?! I could've just had a small amount and gone on with my day.\" That leads to hateful (P). Or I feel self conscious, and when others make me feel like shit, my (P) session is more like \"Nobody can tell me what to do! /I'll fuckin show them!/ I'm gonna get all pretty and make them regret fucking with me./ Etc.\". There's a common thing with people with ED's. We crave control, control of our lives, what goes in our body and what even gets to stay in our body. But it all stems from 'trauma/s' that we had to go thru at some point in life. My father passed away when I was 2, I never got to know him. I was born without a thyroid (Congenital Hypothyroidism), As a kid...my family moved me to a new town, so I was maliciously bullied, I was abused and almost killed multiple times by my own brother who was always in and out of prison. My parents got divorced (stepfather) bc he was cheating on her, i lost my job bc I almost died there bc I was diagnosed with severe Epilepsy. My license was a bitch to keep cuz of the Epilepsy. Every boyfriend I've had was fucked up and cheated on me (except the one I'm currently with), my mother verbally and physically abused me (she has stabbed, punched/slapped, spit at me, ran after me with a knife, thrown heavy objects. She also consistently told me I was ugly, nasty looking, that any bf I have would be grossed out by my body), then I was a severely extreme alcoholic...I drank so much I didn't know how I ended up in another place the next day. With different men sexually assaulting me, I was raped. I lost so much will to go on. My drinking finally caught up with me and I was rushed to the hospital and had to stay for 2 weeks bc my pancreas failed and I was dying (yet again). I became sober (8 years now). There's more... But I'm sure you get it. All these things I've gone thru led to me feel alone, ugly, depressed, and like I have no control over my own life. And that where I always counted on my B/P. I know it's one part of my life, of myself, that I am in control of (even tho it's completely out of control tbh). Restriction, B/P, makes me feel like even tho everything else is terrible... THIS is MINE, I get to decide, I have the power over this one aspect. I'm not necessarily 'proud' of it, But I feel good having something ONLY I can change.",
      "created_utc": 1673727251.0,
      "score": 4,
      "context": [
        {
          "id": "j4aal2p",
          "author": "OptimalShoe4861",
          "body": "I'm a lady and I've had my eating disorders (anorexia, bulimia (b/p) since I was 12/13 years old. I'm 35 now and Still have these urges, constantly. So more than 20 years, ⅔ of my life have been dedicated to fucking torturing myself with ED's. I know how you feel, I went through all that as well. When I was still living with my parent/s, I messed up the plumbing. There were weird maggot things that started appearing in the toilet. They tried to call me out on it. So I started using ziplock and plastic grocery store bags, they were in a cubby in my room. I had to get Raid/fly traps for my room at the time bc it had a nasty swarm, literal SWARM of fruit flies. Why the fuck did I do that?! Well, bc I love food and hate it, don't want other people to know my struggle and I have extreme body dysmorphia, also bc intense shame I feel about my actions... Sure I enjoy/feel guilty after my relief sessions, I also feel guilty bc food costs money and I'm metaphorically flushing money down the toilet. So wasteful. These days, I live with my bf, I ONLY eat or b/p while he's at work or when he's sleeping. Plus I have insomnia so I'm 'eating' any point between 11:30pm-1am, then recuperating from my sickness for a few hours, lay in bed thinking terrible shit and lying to myself for a couple more hours... Just waiting, then somehow I finally fall asleep from being exhausted. Or I don't sleep bc my life choices haunt me. I've gone to inpatient, outpatient, psychiatrists. I'm tired of it all but somehow, I don't want to let go of that part of me, it's a part that I hate, love, am scared of, ashamed of.... it's fucked up, but it's how I \"live\". So, believe me, you're not alone. I thought I was for most my life, that nobody (even other ED people) was able to understand or even comprehend the thoughts/feelings I was enduring. We're ALL sick... The problem is, is there Really a point when we can accept changing? Leaving behind an addiction? Are any of us ready to look at ourselves in the mirror and truly accept how we look? Lol at another person and Not compare ourselves to them? Can our bravery of wanting to be healthy overcome our debilitating fear of becoming healthy? The questions go on and are dark, morbid, scary... But we can't answer them truthfully, not to ourselves, and not to other people. It's fucked up.",
          "created_utc": 1673679557.0
        },
        {
          "id": "j4bnh8f",
          "author": "adonistoo",
          "body": "Wow… this is EVERYTHING I have felt for years… ED makes me feel safe, it makes me feel a lot of other things too, mostly terrible. But the strange comfort and safety I feel in this habit is so hard to kick. Recovery and being functional and “normal” and healthy feels way too hard to achieve, like those things were not meant for me, like I was always meant to be this lonely, unwell freak. How to kick habits that have become my coping mechanism and safety net for years… when all goes wrong, I can always find safety and comfort in planning a B/P session. Because as weird as it sounds… I’m good at it. I’m good at purging, and as we all know, it feels good to be empty. Many times I wonder if I’m just meant to be sick like this forever, how can I re-enter society when I feel so fundamentally different than anyone who doesn’t have a brain that runs like mine. 24/7 food and B/P thoughts, how to rewire that. Feels insurmountable, and if it is, why bother trying… In theory I want to be better, but is it for me..? I don’t know. Thank you for making me feel less alone and disgusting. I see others like me and I feel such love for them, but hold myself to different standards and berate myself for the same things I show love to strangers for. Life is hard and confusing huh",
          "created_utc": 1673711320.0
        }
      ]
    },
    {
      "id": "j4bmd3g",
      "author": "adonistoo",
      "body": "It makes me feel better that my greatest shame, that no one in my real life could EVER comprehend (seriously can you imagine trying to explain vombags to outsiders…), has been experienced by strangers. I feel less like a monster.",
      "created_utc": 1673710857.0,
      "score": 6,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        },
        {
          "id": "j4b2te0",
          "author": "a-non-eye-moose",
          "body": "I dealt with the vombags before.. very tricky business \n\nI also have a bathroom that we don't talk about. I clogged up the pipes and now water doesnt drain away ....hopefully the landlord won't notice before we move out. 😅\n\nJust trying to say you're not alone in these fudge ups, they happen. Just need to kick yourself into gear and try to sort out what you can. Trying is the best first move forward. \n\nx",
          "created_utc": 1673701466.0
        }
      ]
    },
    {
      "id": "j4mwr8w",
      "author": "a-non-eye-moose",
      "body": "It happens. We all spiral a little too far sometimes.\n\nThe amount of times I've had a knock on my door and felt sheer dread! Swooped the binge mess into a blindspot while yelling 'just a sec, let me put clothes on' so they'll wait longer and wonder further into in the hallway (it's all apartment buildings over here). Only opening the door a crack while hoping the person on the other side cant smell the vomit or notice the food/ vomit on my face I haven't cleaned off yet. \n\nAnd that's just an interruption to the standard bp cycle, not even crisis level.\n\nThis is a very shameful and secretive disorder we share. \n\nYou are definitely not alone! x",
      "created_utc": 1673903322.0,
      "score": 3,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        },
        {
          "id": "j4bm7s9",
          "author": "adonistoo",
          "body": "Thank you ❤️ that is definitely mission 1, I have had anxiety nightmares about people coming over to my house and seeing it. I haven’t invited anyone over in months and I panic when I think about a friend or relative desperately needing to come to me for some reason and having to tell them I can’t let them in. I need to slowly clean it all, then call the professionals to fix, and finally feel like my house is a home again. My cats deserve it. Thank you for your support fellow stranger, this sub has made me not feel as much like the disgusting freak i have been feeling…",
          "created_utc": 1673710794.0
        }
      ]
    },
    {
      "id": "j4a9z87",
      "author": "summersunforu",
      "body": "let it out!! it’s a good thing you can acknowledge that and that you want to change and get better. that’s a wonderful first step! take some time off work and take care of yourself and your home. start slowly if it’s overwhelming. you deserve a home you feel comfortable in. you deserve a good life. you deserve to recover. i know i’m a stranger on the internet but i am truly rooting for you and i truly hope things get easier for you.",
      "created_utc": 1673679109.0,
      "score": 7,
      "context": [
        {
          "id": "j4a68q2",
          "author": "summersunforu",
          "body": "i’m so sorry. i know it’s not easy to do but try not to beat yourself up over this. i am sending you all my love and i hope things get better for you soon. 💕",
          "created_utc": 1673676480.0
        },
        {
          "id": "j4a70r4",
          "author": "adonistoo",
          "body": "thank you, i don’t know why but this comment made me finally cry out the emotions i’ve been numbing for god knows how long. i am slowly starting to force myself to acknowledge how far i’ve let this go. it can’t happen again, it can’t. this has to be the moment i turn things around. if this doesn’t change things for me then there is no hope. i will try to take the next few weeks to clean up my home, maybe i can take some time off work too. just really clean and get rid of as much of the shame as i can. once that is done i will buy some large area rugs to cover the worst of the hardwood floor stains. \n\nthen- i will finally be able to call someone to fix my water, and my kitchen i guess. what’s a few weeks without a kitchen eh….",
          "created_utc": 1673677018.0
        }
      ]
    },
    {
      "id": "j4f0vqp",
      "author": "OptimalShoe4861",
      "body": "If you ever need to talk. Whether it be advice, questions, just talking about random shit, anything, etc... You can message me, I'm usually awake...I have insomnia.",
      "created_utc": 1673763244.0,
      "score": 4,
      "context": [
        {
          "id": "j4aal2p",
          "author": "OptimalShoe4861",
          "body": "I'm a lady and I've had my eating disorders (anorexia, bulimia (b/p) since I was 12/13 years old. I'm 35 now and Still have these urges, constantly. So more than 20 years, ⅔ of my life have been dedicated to fucking torturing myself with ED's. I know how you feel, I went through all that as well. When I was still living with my parent/s, I messed up the plumbing. There were weird maggot things that started appearing in the toilet. They tried to call me out on it. So I started using ziplock and plastic grocery store bags, they were in a cubby in my room. I had to get Raid/fly traps for my room at the time bc it had a nasty swarm, literal SWARM of fruit flies. Why the fuck did I do that?! Well, bc I love food and hate it, don't want other people to know my struggle and I have extreme body dysmorphia, also bc intense shame I feel about my actions... Sure I enjoy/feel guilty after my relief sessions, I also feel guilty bc food costs money and I'm metaphorically flushing money down the toilet. So wasteful. These days, I live with my bf, I ONLY eat or b/p while he's at work or when he's sleeping. Plus I have insomnia so I'm 'eating' any point between 11:30pm-1am, then recuperating from my sickness for a few hours, lay in bed thinking terrible shit and lying to myself for a couple more hours... Just waiting, then somehow I finally fall asleep from being exhausted. Or I don't sleep bc my life choices haunt me. I've gone to inpatient, outpatient, psychiatrists. I'm tired of it all but somehow, I don't want to let go of that part of me, it's a part that I hate, love, am scared of, ashamed of.... it's fucked up, but it's how I \"live\". So, believe me, you're not alone. I thought I was for most my life, that nobody (even other ED people) was able to understand or even comprehend the thoughts/feelings I was enduring. We're ALL sick... The problem is, is there Really a point when we can accept changing? Leaving behind an addiction? Are any of us ready to look at ourselves in the mirror and truly accept how we look? Lol at another person and Not compare ourselves to them? Can our bravery of wanting to be healthy overcome our debilitating fear of becoming healthy? The questions go on and are dark, morbid, scary... But we can't answer them truthfully, not to ourselves, and not to other people. It's fucked up.",
          "created_utc": 1673679557.0
        },
        {
          "id": "j4bnh8f",
          "author": "adonistoo",
          "body": "Wow… this is EVERYTHING I have felt for years… ED makes me feel safe, it makes me feel a lot of other things too, mostly terrible. But the strange comfort and safety I feel in this habit is so hard to kick. Recovery and being functional and “normal” and healthy feels way too hard to achieve, like those things were not meant for me, like I was always meant to be this lonely, unwell freak. How to kick habits that have become my coping mechanism and safety net for years… when all goes wrong, I can always find safety and comfort in planning a B/P session. Because as weird as it sounds… I’m good at it. I’m good at purging, and as we all know, it feels good to be empty. Many times I wonder if I’m just meant to be sick like this forever, how can I re-enter society when I feel so fundamentally different than anyone who doesn’t have a brain that runs like mine. 24/7 food and B/P thoughts, how to rewire that. Feels insurmountable, and if it is, why bother trying… In theory I want to be better, but is it for me..? I don’t know. Thank you for making me feel less alone and disgusting. I see others like me and I feel such love for them, but hold myself to different standards and berate myself for the same things I show love to strangers for. Life is hard and confusing huh",
          "created_utc": 1673711320.0
        },
        {
          "id": "j4cro2v",
          "author": "OptimalShoe4861",
          "body": "It's about insecurities, coping, control. We use our (B) sessions to indulge in the things we feel others would shame or judge us for, and bc we do it alone we feel like there is no judgement (other than yourself) and we can have 'our cake and eat it too' literally. But then comes the self-judgement, I hear, \"WTF is wrong with me? Why do I keep doing this? This is the last time. You're such a stupid girl. I'll fix it. I'm so tired, I don't want to have to do this... But I have to. Why did I have so much?! I could've just had a small amount and gone on with my day.\" That leads to hateful (P). Or I feel self conscious, and when others make me feel like shit, my (P) session is more like \"Nobody can tell me what to do! /I'll fuckin show them!/ I'm gonna get all pretty and make them regret fucking with me./ Etc.\". There's a common thing with people with ED's. We crave control, control of our lives, what goes in our body and what even gets to stay in our body. But it all stems from 'trauma/s' that we had to go thru at some point in life. My father passed away when I was 2, I never got to know him. I was born without a thyroid (Congenital Hypothyroidism), As a kid...my family moved me to a new town, so I was maliciously bullied, I was abused and almost killed multiple times by my own brother who was always in and out of prison. My parents got divorced (stepfather) bc he was cheating on her, i lost my job bc I almost died there bc I was diagnosed with severe Epilepsy. My license was a bitch to keep cuz of the Epilepsy. Every boyfriend I've had was fucked up and cheated on me (except the one I'm currently with), my mother verbally and physically abused me (she has stabbed, punched/slapped, spit at me, ran after me with a knife, thrown heavy objects. She also consistently told me I was ugly, nasty looking, that any bf I have would be grossed out by my body), then I was a severely extreme alcoholic...I drank so much I didn't know how I ended up in another place the next day. With different men sexually assaulting me, I was raped. I lost so much will to go on. My drinking finally caught up with me and I was rushed to the hospital and had to stay for 2 weeks bc my pancreas failed and I was dying (yet again). I became sober (8 years now). There's more... But I'm sure you get it. All these things I've gone thru led to me feel alone, ugly, depressed, and like I have no control over my own life. And that where I always counted on my B/P. I know it's one part of my life, of myself, that I am in control of (even tho it's completely out of control tbh). Restriction, B/P, makes me feel like even tho everything else is terrible... THIS is MINE, I get to decide, I have the power over this one aspect. I'm not necessarily 'proud' of it, But I feel good having something ONLY I can change.",
          "created_utc": 1673727251.0
        }
      ]
    },
    {
      "id": "j4mxb2b",
      "author": "a-non-eye-moose",
      "body": "I threw a vombag out of the 6th floor window once.... the neighbours were not happy\n\nBut it was the middle  of the night and my lights were out so ..who knows who it did it, right? 😅🙈",
      "created_utc": 1673903524.0,
      "score": 1,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        },
        {
          "id": "j4b2te0",
          "author": "a-non-eye-moose",
          "body": "I dealt with the vombags before.. very tricky business \n\nI also have a bathroom that we don't talk about. I clogged up the pipes and now water doesnt drain away ....hopefully the landlord won't notice before we move out. 😅\n\nJust trying to say you're not alone in these fudge ups, they happen. Just need to kick yourself into gear and try to sort out what you can. Trying is the best first move forward. \n\nx",
          "created_utc": 1673701466.0
        },
        {
          "id": "j4bmd3g",
          "author": "adonistoo",
          "body": "It makes me feel better that my greatest shame, that no one in my real life could EVER comprehend (seriously can you imagine trying to explain vombags to outsiders…), has been experienced by strangers. I feel less like a monster.",
          "created_utc": 1673710857.0
        }
      ]
    },
    {
      "id": "j4vxnq0",
      "author": "adonistoo",
      "body": "you definitely get me, 100%. everything you just typed is so familiar. there’s this part of me that just wants to completely give up and reveal the state of my home and me to someone and beg them to help me fix things, but i would die of shame. my worst fear is being found out, it’s exhausting living this double life and not feeling authentic, but how do you casually let anyone know any degree of what you do. if they aren’t like us, they can’t possibly comprehend",
      "created_utc": 1674061959.0,
      "score": 1,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        },
        {
          "id": "j4bm7s9",
          "author": "adonistoo",
          "body": "Thank you ❤️ that is definitely mission 1, I have had anxiety nightmares about people coming over to my house and seeing it. I haven’t invited anyone over in months and I panic when I think about a friend or relative desperately needing to come to me for some reason and having to tell them I can’t let them in. I need to slowly clean it all, then call the professionals to fix, and finally feel like my house is a home again. My cats deserve it. Thank you for your support fellow stranger, this sub has made me not feel as much like the disgusting freak i have been feeling…",
          "created_utc": 1673710794.0
        },
        {
          "id": "j4mwr8w",
          "author": "a-non-eye-moose",
          "body": "It happens. We all spiral a little too far sometimes.\n\nThe amount of times I've had a knock on my door and felt sheer dread! Swooped the binge mess into a blindspot while yelling 'just a sec, let me put clothes on' so they'll wait longer and wonder further into in the hallway (it's all apartment buildings over here). Only opening the door a crack while hoping the person on the other side cant smell the vomit or notice the food/ vomit on my face I haven't cleaned off yet. \n\nAnd that's just an interruption to the standard bp cycle, not even crisis level.\n\nThis is a very shameful and secretive disorder we share. \n\nYou are definitely not alone! x",
          "created_utc": 1673903322.0
        }
      ]
    },
    {
      "id": "j4x7vr7",
      "author": "a-non-eye-moose",
      "body": "I've had this for more than half my life now so a fair few people know. \n\nThose outside my immediate circle who know (ie old school friends I grew up with, ex housemate who had his own demons) will lend an ear but are pretty indifferent about it all. I guess they have their own lives and I'm a lost cause they wouldn't know how to help if they tried. At this stage in the game, it's just what I do and they're probably tired of hearing about it.\n\nThose closest who know (ie partner), well, I still feel the need to hide at all costs there. I think it saddens and frustrates him. We both know he doesn't deserve to have to deal with this and to a degree, i think he's a bit scared of coming home to a heart attack on the sofa one day. \n\nThe shame is always there in our moments of weakness and every bp, whether meticulously planned or momentary compulsion, feels like weakness. \n\nI like to think the trick is to try and abstain a little longer each time and try experimenting with foods you like and can accept to keep in. If you pull yourself onto the first stepping stone, its easier to reach out and talk to someone. It also helps give that someone (who just doesn't get the problem) a point to pull you back onto.",
      "created_utc": 1674079555.0,
      "score": 1,
      "context": [
        {
          "id": "j4b01ax",
          "author": "a-non-eye-moose",
          "body": "Get the vomathon out of your house! Start there. Mission 1. \n\nOnce that is out of the way you'll  feel much more capable to deal with the fallout. Get rid of the food wrappers, cover up floor stains or whatever you feel you need to do to call the plumber/ electrician/ whoever. Remember, contractors really don't give a crap about the state of your house, they're there to work and get paid. \n\nMore importantly, go outside. Break the chain of events, even if it is only for an afternoon spent by yourself doing something seemingly pointless. Change your environment for a few hours. If you can go spend time with someone, even better. If you can confide in someone, that's ideal. (If you can go to a doctor or shrink, do that too!)\n\nRock bottom is dreadful, but you Need to wriggle yourself back up before you rot down there! I've been there, it's hard, but you need to be your own slap in the face to make that first step. PM me if you want, maybe a sympathetic ear is helpful? x",
          "created_utc": 1673699738.0
        },
        {
          "id": "j4bm7s9",
          "author": "adonistoo",
          "body": "Thank you ❤️ that is definitely mission 1, I have had anxiety nightmares about people coming over to my house and seeing it. I haven’t invited anyone over in months and I panic when I think about a friend or relative desperately needing to come to me for some reason and having to tell them I can’t let them in. I need to slowly clean it all, then call the professionals to fix, and finally feel like my house is a home again. My cats deserve it. Thank you for your support fellow stranger, this sub has made me not feel as much like the disgusting freak i have been feeling…",
          "created_utc": 1673710794.0
        },
        {
          "id": "j4mwr8w",
          "author": "a-non-eye-moose",
          "body": "It happens. We all spiral a little too far sometimes.\n\nThe amount of times I've had a knock on my door and felt sheer dread! Swooped the binge mess into a blindspot while yelling 'just a sec, let me put clothes on' so they'll wait longer and wonder further into in the hallway (it's all apartment buildings over here). Only opening the door a crack while hoping the person on the other side cant smell the vomit or notice the food/ vomit on my face I haven't cleaned off yet. \n\nAnd that's just an interruption to the standard bp cycle, not even crisis level.\n\nThis is a very shameful and secretive disorder we share. \n\nYou are definitely not alone! x",
          "created_utc": 1673903322.0
        },
        {
          "id": "j4vxnq0",
          "author": "adonistoo",
          "body": "you definitely get me, 100%. everything you just typed is so familiar. there’s this part of me that just wants to completely give up and reveal the state of my home and me to someone and beg them to help me fix things, but i would die of shame. my worst fear is being found out, it’s exhausting living this double life and not feeling authentic, but how do you casually let anyone know any degree of what you do. if they aren’t like us, they can’t possibly comprehend",
          "created_utc": 1674061959.0
        }
      ]
    }
  ]
}