{
  "id": "10t0ohk",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1675472100.0,
  "title": "substance ab*se to control bulimic behaviours?",
  "selftext": "i physically cannot afford to be bulimic. i’ve been actively struggling for 10 years and i’m 22 now. food prices are insanely high… i used to steal food in order to b/p but my *new year’s resolution* was to stop stealing. \n\ni’ve found myself abusing medications in order to sleep instead of binging. i’ll sleep for 16+ hours a day just to avoid being awake because i know if i’m up long enough, i’ll binge, and i can’t afford to do it. \n\nam i crazy? i know i have an addictive personality type which i believe comes with bulimia. every day is just so awful. i’m so terrified of myself.",
  "url": "https://www.reddit.com/r/bulimia/comments/10t0ohk/substance_abse_to_control_bulimic_behaviours/",
  "score": 83,
  "num_comments": 22,
  "comments": [
    {
      "id": "j74rutm",
      "author": "nomeancity29",
      "body": "You are not alone. I have addictive personality. Most of my wages goes on food that I crave. I indulge, then purge. It’s just horrible.",
      "created_utc": 1675475012.0,
      "score": 33,
      "context": []
    },
    {
      "id": "j74z9b1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1675478570.0,
      "score": 30,
      "context": []
    },
    {
      "id": "j7604wb",
      "author": "None",
      "body": "Substance abuse is common with bulimia. At my worst, I would be constantly high to avoid eating or feel better after purging. It’s a vicious cycle but it’s possible to overcome it.",
      "created_utc": 1675503119.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j754izp",
      "author": "yestermorrowday",
      "body": "I’m so sorry that things have been so hard for you lately. ❤️ You are not crazy, but this road you’re on is dangerous and scary. It sounds like this has become unmanageable for you, and you may not be able to dig yourself out without help.\n\nI know you may not be ready for that yet, or help may not be readily available to you, but if it is, please consider it. I’ve been there. It’s frightening when it feels like you have no hands on the wheel. I hope things get better for you soon. You’re not alone.",
      "created_utc": 1675481204.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j75vnu1",
      "author": "Curious_Insurance694",
      "body": "I know how you feel. In about two months I wasted all my savings, 27k. On just food delivery. On ubering to the store and back late cause I ate something of my boyfriend and needed to replace it. I've wasted so much money in such a short amount of time and I have nothing to show for it. I will tell myself to stop. Then immediately on impulse just buy things to purge. \n\nAnd I know what's wrong, what I need to do to change, just can't bring myself to do it. I seem to be so content in the fucking chaos I'm constantly creating for myself.\n\nLike just go for a walk and make some friends. Keep myself busy. Find other forms of stimulus. Or regulate my emotions! \n\nBut no, I just had to reorder groceries 3 times the same day because every time it gets delivered I can't control myself and I re eat and purge it all again. So much time wasted.",
      "created_utc": 1675499216.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j75nhyv",
      "author": "fsk1116",
      "body": "I also sleep to avoid binges, meals and drinking! I’m sorry. It really sucks! Make sure to get some time in the sun everyday!",
      "created_utc": 1675492620.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j75uvin",
      "author": "Accomplished_Goal763",
      "body": "At first my habit made me lose 55lbs that needed to come off badly. I was happy. Then I started eating on it. I just couldn’t control my binging. I stopped purging for a while and now I’m back at it. I am looking into a weight loss program because my weight goes up and down by 50-60lbs constantly and I need some intervention. Some kind of discipline when it comes to food. I also wanted to consult a therapist that specializes in eating disorders and none in my area are accepting new patients. Sigh. Anyway I feel you. I don’t know what to do so I can’t give you advice but you’re not alone.\n\nEdit: I should mention I spend an insane amount of money on DoorDash as I order about 2-3 times per day. I have a dash pass too. I just wish I could stop using food to comfort myself.",
      "created_utc": 1675498542.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j76wo6u",
      "author": "dogloophole",
      "body": "Been there, stealing binge foods and taking meds to fall asleep earlier and avoid the nighttime b/p. Just know you are not a lost cause, I’ve been able to get away from all of it and you can too. First step is let yourself eat adequately in the first place, then when you do binge don’t purge after, you will not want to binge forever. It will be very difficult, you will likely fail multiple times, and you will have to accept weight fluctuations as a part of the process, but you can do it! What is more valuable to you, being thin or a life free of this shit?",
      "created_utc": 1675524209.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j78o03r",
      "author": "pippja",
      "body": "You are not alone!\n\nI am either spending £££’s on drugs and not eating. Or eating obscene quantities just to purge after. If I ate like a normal person I would spend at least two thirds less on food a week. \n\nWhy are both my comforting habits so destructive to my health and bank account. I know what I need to do to get better, but I can’t take the steps.",
      "created_utc": 1675550718.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j793f5h",
      "author": "lostinth3Abyss",
      "body": "Definitely food issues transfer over into substances. I’m not 100% over my ED but my depression has improved and this has allowed me to enjoy alcohol and the occasional joint without over using. But I totally understand food is sooo expensive and I have wasted so much money on food being bulimic 😭not sure if this is helpful at all but I have literally had to e-transfer all the money in my bank account to my mom in order to keep myself from binging. I don’t know if that’s an option for you but maybe there are some things you could put in place so you don’t lose all your money. This disease will take everything from you😕dms are always open",
      "created_utc": 1675557824.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j763dg6",
      "author": "Sad111Suit",
      "body": "Can you work instead of sleep?",
      "created_utc": 1675505969.0,
      "score": 0,
      "context": []
    },
    {
      "id": "j75zl5h",
      "author": "Battery_acid1",
      "body": "I used to do the same thing to avoid eating altogether I still do sometimes stay strong 🖤",
      "created_utc": 1675502625.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j76bm4i",
      "author": "ed_mayo_onlyfans",
      "body": "You’re definitely not alone. I have an addictive personality and have been addicted to alcohol and benzodiazepines. I don’t find that either helped with my bulimia at all though. She’s a tough bitch :/",
      "created_utc": 1675512821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j76fxdb",
      "author": "kawaiikittenboy",
      "body": "You just described my life... Like. This is EXACTLY  what I'm trying to recover from. It's been a week now. I do feel better but my eating impulses are harder to control on 3 hours of sleep a night..",
      "created_utc": 1675515778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j77w1cp",
      "author": "Goth_Lizard",
      "body": "I used to do that. I used to take Benadryl so I could sleep and I couldn’t eat. Lol.",
      "created_utc": 1675538593.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j79qfmn",
      "author": "Sweetnspicy77",
      "body": "You’re not crazy at all as I seriously consider this all the time",
      "created_utc": 1675569482.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j7oe3e2",
      "author": "None",
      "body": "I picked up smoking.\n\nthe height of my ED I was paying up to $1500 a month on food. When I started therapy I was paying around 800 to $1,000 a month and food in general and since that's decreased to $400 roughly let's assume I was spending still at least $500 a month on binging and purging food. \n\nI still indulge in it but it's more like 6 times months now not 20 times a week. God with the food prices, I don't think I'd be able to afford it anymore.\n\nIf disposable vapes get banned in Australia and I'm forced onto cigarettes ($40/packet maybe 2.5 days) it would probably cost just as much as binging and purging but the disposable vapes that I go through equal out to like $50 a week.\n\n So that's $200 a month when my alternative is $500 a month on binging and purging food.",
      "created_utc": 1675837616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j7tn5rx",
      "author": "None",
      "body": "As somebody who's had a pretty bad substance abuse problem in the past it's a very bad Idea to even consider this. It makes me really sad to see somebody so damn beautiful struggling. I've never had an eating disorder so I can't say I really understand it but I do understand addiction and I totally understand wanting to look good/lean. I'm actually pretty obsessed with my physique and some people might consider that a disorder although i would have to disagree. I don't know what substances you are using but be careful. Maybe this is private stuff for you so I'm not going to pry but If you ever need somebody to unload your problems on I'll listen.",
      "created_utc": 1675933274.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j7vwoin",
      "author": "Herknificent",
      "body": "Don’t abuse substances to “control” your bulimic behaviors.  You will just be substituting one problem for another.  Instead seek help w/ the bulimia.  Instead of abusing substances try finding a productive hobby to keep your mind focused on.",
      "created_utc": 1675972652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j7770ee",
      "author": "zebraprintt",
      "body": "this is so real",
      "created_utc": 1675528508.0,
      "score": 2,
      "context": [
        {
          "id": "j74z9b1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1675478570.0
        }
      ]
    },
    {
      "id": "j78hrom",
      "author": "None",
      "body": "I was going to say the same, but you’ve said it better than I could ❤️",
      "created_utc": 1675547905.0,
      "score": 2,
      "context": [
        {
          "id": "j754izp",
          "author": "yestermorrowday",
          "body": "I’m so sorry that things have been so hard for you lately. ❤️ You are not crazy, but this road you’re on is dangerous and scary. It sounds like this has become unmanageable for you, and you may not be able to dig yourself out without help.\n\nI know you may not be ready for that yet, or help may not be readily available to you, but if it is, please consider it. I’ve been there. It’s frightening when it feels like you have no hands on the wheel. I hope things get better for you soon. You’re not alone.",
          "created_utc": 1675481204.0
        }
      ]
    },
    {
      "id": "j75vrbb",
      "author": "Curious_Insurance694",
      "body": "But also I used to be a drug addict. And with my Autism have an addictive personality, I've realized I replace my addictions with other ones. I think with us we just need to be addicted to the right things? Or idk, just find better things to do than this.",
      "created_utc": 1675499297.0,
      "score": 6,
      "context": [
        {
          "id": "j75vnu1",
          "author": "Curious_Insurance694",
          "body": "I know how you feel. In about two months I wasted all my savings, 27k. On just food delivery. On ubering to the store and back late cause I ate something of my boyfriend and needed to replace it. I've wasted so much money in such a short amount of time and I have nothing to show for it. I will tell myself to stop. Then immediately on impulse just buy things to purge. \n\nAnd I know what's wrong, what I need to do to change, just can't bring myself to do it. I seem to be so content in the fucking chaos I'm constantly creating for myself.\n\nLike just go for a walk and make some friends. Keep myself busy. Find other forms of stimulus. Or regulate my emotions! \n\nBut no, I just had to reorder groceries 3 times the same day because every time it gets delivered I can't control myself and I re eat and purge it all again. So much time wasted.",
          "created_utc": 1675499216.0
        }
      ]
    },
    {
      "id": "j78oeqe",
      "author": "None",
      "body": "i’m unable to because of health conditions my ed has caused and my doctor recommends i don’t. i’m on disability which is embarrassing. i’d love to work but i can’t :(",
      "created_utc": 1675550902.0,
      "score": 2,
      "context": [
        {
          "id": "j763dg6",
          "author": "Sad111Suit",
          "body": "Can you work instead of sleep?",
          "created_utc": 1675505969.0
        }
      ]
    }
  ]
}