{
  "id": "116r3ii",
  "subreddit": "bulimia",
  "author": "tallchild498",
  "created_utc": 1676848522.0,
  "title": "my s/o's cat was waiting for me outside of the bathroom and it made me bawl my eyes out",
  "selftext": "tw for anyone that may need it: i mention omad, binging and purging, nothing graphic tho \n\nso, my s/o is traveling for a few days and asked if i could take care of their cat while they're gone. i obviously accepted, for a few reasons, one of them being i love cats and i love their cat specially, and also because i already did this a while ago for a few weeks so me and Cat are pals already, she's a sweetie. \n\nwell, the thing is, these days my bulimia has gotten worse along with my mental health overall, it's been really fucking tough. today i did fight my binge urges (!) but still felt incredibly guilty from eating dinner, aka my stupid one and only meal of the day. then i had to fight purge urges but lost it. \n\nthe cat follows me everywhere and so she naturally followed me to the bathroom. i told her to get out and locked the door. i spent several minutes trying to purge but nothing came up, which made me feel like smashing my head on the wall violently. well, i gave up, washed my face and when i opened the door, the cat was there, sitting and waiting for me.\n\nthe sight of her there was like the final straw for me, i sat on the floor by her side and cried so much, im still crying as i write this. so i stayed there, crying like a baby while petting her. it made my heart beat slower. it made my head go quieter. \n\nidk, it was a moment ill surely remember years from now. i thought of sharing it here because im probably not gonna share it with anyone else. my s/o knows about my ed but im still very ashamed of it. \n\n(also thanks for reading and sorry for any grammar mistakes",
  "url": "https://www.reddit.com/r/bulimia/comments/116r3ii/my_sos_cat_was_waiting_for_me_outside_of_the/",
  "score": 67,
  "num_comments": 9,
  "comments": [
    {
      "id": "j986of2",
      "author": "Zilestel",
      "body": "My own cat has helped me get through some really tough times. Animals can be so incredibly intuitive, more so than a lot of humans it seems. I can really relate to your post.. there are times when I'll finish whatever I'm doing and just completely break down crying. It's like a tsunami of emotions! \n\nI hope you can give yourself credit for not binging today, that's a win!",
      "created_utc": 1676851883.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j98efbg",
      "author": "yeurjjdusielaos",
      "body": "my dog was right next to me as I puked my guts up. Those big brown eyes and a wagging tail... she was my reason to stop tonight.",
      "created_utc": 1676855514.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j998uth",
      "author": "None",
      "body": "When my old dog was alive, my first one, she'd look up at me as if waiting for me to stop. I always felt so guilty, like she knew exactly what I was doing. Sometimes I'd stop just because of that",
      "created_utc": 1676871630.0,
      "score": 13,
      "context": []
    },
    {
      "id": "j99v8i9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1676889242.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j98ai3s",
      "author": "None",
      "body": "Aw. It sounds like you have a good friend! One of my service dogs is trained to come with me to the bathroom and he will just sit beside the toilet and stare at me and whine. It oddly really helps, although I wish any of my family cared that much lol. In any case, I'm glad you have your kitty friend.",
      "created_utc": 1676853665.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j9awmew",
      "author": "eriklehnshrr",
      "body": "this is a bit diff but one time i was attempting to run away from home for ed reasons, and usually my dog barks SO MUCH whenever a door opens. i feel like he knew, and he didn't bark at all. he just tip toed, watched me, and let me leave. i think he wanted to help me. i didn't end up running away. i felt so awful",
      "created_utc": 1676909877.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j9alrcc",
      "author": "tallchild498",
      "body": "animals are the most beautiful things, im glad to hear youve a little buddy to help you through the hard parts <3\n\nand i know what you mean, sometimes it feels like i have sort of a reality check, like, why me? what am i doing? it's sad and i feel pathetic when i think of it.. \n\nbut i did feel a bit proud of myself, thankyou! hopefully today will be better",
      "created_utc": 1676905353.0,
      "score": 2,
      "context": [
        {
          "id": "j986of2",
          "author": "Zilestel",
          "body": "My own cat has helped me get through some really tough times. Animals can be so incredibly intuitive, more so than a lot of humans it seems. I can really relate to your post.. there are times when I'll finish whatever I'm doing and just completely break down crying. It's like a tsunami of emotions! \n\nI hope you can give yourself credit for not binging today, that's a win!",
          "created_utc": 1676851883.0
        }
      ]
    },
    {
      "id": "j9am1mf",
      "author": "tallchild498",
      "body": "sending hugs from here, to both you and your dog <3 hope it gets better for us",
      "created_utc": 1676905480.0,
      "score": 3,
      "context": [
        {
          "id": "j98efbg",
          "author": "yeurjjdusielaos",
          "body": "my dog was right next to me as I puked my guts up. Those big brown eyes and a wagging tail... she was my reason to stop tonight.",
          "created_utc": 1676855514.0
        }
      ]
    },
    {
      "id": "j9amjof",
      "author": "tallchild498",
      "body": "it does feel like they know sometimes.. and im trying to hold on to the feeling of having her look at me after all that, to remind myself im not hopeless \n\n the bond we can build with animals is so pure <3 wish all the best to you!",
      "created_utc": 1676905699.0,
      "score": 4,
      "context": [
        {
          "id": "j998uth",
          "author": "None",
          "body": "When my old dog was alive, my first one, she'd look up at me as if waiting for me to stop. I always felt so guilty, like she knew exactly what I was doing. Sometimes I'd stop just because of that",
          "created_utc": 1676871630.0
        }
      ]
    },
    {
      "id": "j9an5ys",
      "author": "tallchild498",
      "body": "thankyou for sharing it, its making my heart warm to hear others sharing these moments. i really hope we can all heal from this\n\nsending love back to you <3",
      "created_utc": 1676905965.0,
      "score": 3,
      "context": [
        {
          "id": "j99v8i9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1676889242.0
        }
      ]
    }
  ]
}