{
  "id": "11p9ehy",
  "subreddit": "bulimia",
  "author": "SweetInstincts",
  "created_utc": 1678609723.0,
  "title": "Y’all ever just kinda purge??",
  "selftext": "I was under my calorie limit for the day but ate my last meal of the day super fast and just purged a lil bit to get rid of the bloat icky feeling??? Just to get a bit off the top. Like why not just wait a bit for the sensation to dissipate a bit??? I literally haven’t purged in a year to a year and a half (I don’t know exactly). Why on earth would I open this door??? As soon as I do it once I know it’s 200x easier to do it again so why? Also like how fucking stupid, it wasn’t a full purge so?? I literally stared at the toilet on my knees for a full 2 min (someone even knocked on the bathroom door) and still went through with it. Idk what’s wrong with me. I feel so fucking dumb, like bruh.",
  "url": "https://www.reddit.com/r/bulimia/comments/11p9ehy/yall_ever_just_kinda_purge/",
  "score": 86,
  "num_comments": 12,
  "comments": [
    {
      "id": "jbwxqom",
      "author": "looking_for_star1117",
      "body": "i do this too sometimes\nits like i know it wont help me lose weight i just feel like it :/",
      "created_utc": 1678616646.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jbwzhy1",
      "author": "LongboardingLifeAway",
      "body": "I do the same sometimes so I feel you. Idk why tho.\n\nDon't lose hope though, I know it's 200x easier to fall back into purging after doing it again (once) but you can still try your best not to let it escalate again",
      "created_utc": 1678618146.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jbxf5om",
      "author": "HeyitsmeBeae",
      "body": "Yeah. I haven’t done it in a while, then yesterday…BOOM, I purged three times. The first was just to remove the uncomfortable full feeling and the second two times was “why not?!” It’s so damn easy to fall back. I’m trying not to today. I was doing to well.",
      "created_utc": 1678628950.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jbxfb26",
      "author": "Cokezerowh0re",
      "body": "I feel ya",
      "created_utc": 1678629029.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jby6qza",
      "author": "blondiesdiary",
      "body": "Yessssss.",
      "created_utc": 1678641222.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbza5xa",
      "author": "HollyGeldart",
      "body": "I do this on and off all the time I'll go a month without then one day a little a little too full or ate slightly too much of one food ( for some reason if it's a variety for things doesn't feel as bad but one thing feels like a binge) and I'm just kinda like why not and take steps back for a week then wake up the next week back on track.\n\nHonestly no clue why I do it I think it's almost because I want to remind myself that I can?",
      "created_utc": 1678657658.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbzaqcv",
      "author": "trygdesnylter",
      "body": "Relatable",
      "created_utc": 1678657898.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jc01b8c",
      "author": "qweobi",
      "body": "Yeah like I just feel too full and need to get some out",
      "created_utc": 1678669805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jc1j7e1",
      "author": "Honest-Stable5612",
      "body": "Just don’t restrict. If you do that’ll make you fall back into it more easily. If you purge once and let the guilt come over you and restrict the next day, the circle continues. Take good care if you body and your needs",
      "created_utc": 1678705583.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jc9g5cx",
      "author": "None",
      "body": "Yeah. It happens if I eat with a carbonated drink. \n\nI don't count it against me because the intent isn't to purge but to feel better.",
      "created_utc": 1678861352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jc0ltgs",
      "author": "_i_hate_food_",
      "body": "its like am addiction",
      "created_utc": 1678679824.0,
      "score": 5,
      "context": [
        {
          "id": "jbwxqom",
          "author": "looking_for_star1117",
          "body": "i do this too sometimes\nits like i know it wont help me lose weight i just feel like it :/",
          "created_utc": 1678616646.0
        }
      ]
    }
  ]
}