{
  "id": "11pqy9b",
  "subreddit": "bulimia",
  "author": "Chomik69",
  "created_utc": 1678657768.0,
  "title": "I'm thin! I'm thin! I'm thin!",
  "selftext": "I feel just as miserable as I used to. Ugly, undervalued, stupid, wasting food, and literally going nowhere.",
  "url": "https://www.reddit.com/r/bulimia/comments/11pqy9b/im_thin_im_thin_im_thin/",
  "score": 77,
  "num_comments": 9,
  "comments": [
    {
      "id": "jbzc0ut",
      "author": "singing-is-life",
      "body": "Yup this is precisely what triggered my bulimia relapse. Counted calories, did the weight loss the “right” way without purging, got to a “good weight” but still wasn’t satisfied, was insanely unhappy, and still hated myself. Everyone told me all my problems would be solved by weight loss — they weren’t. They couldn’t fix the major I hated, people I hated, a society I hated, the suicidal thoughts and depression I felt. Thinness was never the solution and so now I’m stuck in bingeing and purging inadequately, gaining back the weight. I hate it but I never want to stop.",
      "created_utc": 1678658437.0,
      "score": 31,
      "context": []
    },
    {
      "id": "jc0r6dx",
      "author": "Informal-Ad-7356",
      "body": "THIS!!  This is why I finally chose Recovery for the 2nd time.  March 2022.  I had been at that magical low weight, and was still miserable.   So miserable,  but now also had full blown ED and bad labs. Hair falling out, skin drooping.  Ugly.  I made a list of why I was feeling so shitty, and saw my problems could NOT be fixed by my ED.  So I said \"well hell, if I feel this bad now, I might as well be healthy and recovered,  and feel bad.\"  LOL!  That's how I chose Recovery again,  and am still holding steady.  There are difficulties and emotional pain on both sides of either ED or Recovery.   But at least one is \"normal\" and healthy.  Now I gotta figure out how to fix ME: low self-esteem, Shame, past trauma, mistakes,  dissapointments, etc.   Life is hard, but it is HARDER with an ED, just like any addiction.",
      "created_utc": 1678683014.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jc1c1xq",
      "author": "cfitesp",
      "body": "Yep because our weight was never the problem. We just wanted it to be because it's an easy target. But look at the positives! Recovery is now the only choice. If you're gonna feel shit anyway you may as well be healthy :)",
      "created_utc": 1678699748.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jbzfjf1",
      "author": "None",
      "body": "🙌",
      "created_utc": 1678659946.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jc39vou",
      "author": "Queenofwands1212",
      "body": "For some reason though, when I’m thin; I do feel happier and way less miserable. Maybe I’m just fucked and disordered but I’m more able to live with my Ed and I enjoy my life more when I’m thin",
      "created_utc": 1678733551.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jc3zbay",
      "author": "GetYourFixGraham",
      "body": "It was never about the weight to begin with. I had very low self esteem that I'd tied to me being big but, in reality, the number on the scale ticking down didn't make me love myself any more. I had low self esteem and was a normal weight.\n\nTreat the ED. It's a mental illness and a bad coping mechanism. :/ ultimately it brings no joy, it just removes the sadness it brings. \"I feel fat from eating so I purge and I no longer feel fat.\" ... but what if the ED was in remission and you didn't feel big just for eating?\n\nT_T Its not about the weight. We make it about the weight as a distraction from the real problem, the sadness and problematic relationship with food.",
      "created_utc": 1678743390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jc12cqv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1678691335.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jc3xe34",
      "author": "Chomik69",
      "body": "I hated myself when I was healthy weight, equally I hate myself now, when I look like a bag of bones. Maybe it would not be so bad if I had more money so I could dress nicely, do make up, have my hair done and buy clothes I like. \nSo shallow.",
      "created_utc": 1678742623.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jc2ogf9",
      "author": "avoidingmyboss",
      "body": "I am too and somehow I feel uglier?? I’m bony and I feel like I look so gross. When I was even 10lbs heavier I filled out a little more and had some color to my face, my arms didn’t look disgusting, and I had the shape of a beautiful woman. Now I have the shape I had when I was going through puberty. Just thin and awkward. And look, nothing has changed in my brain. Still pretty fucked up in there.",
      "created_utc": 1678725266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jc1q8u9",
      "author": "redditistoo_leftwing",
      "body": "it kinda did for me back then, wouldn't blame them",
      "created_utc": 1678710179.0,
      "score": 2,
      "context": [
        {
          "id": "jc12cqv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1678691335.0
        }
      ]
    }
  ]
}