{
  "id": "11w1bsr",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1679268373.0,
  "title": "Words of encouragement from a former bulimic",
  "selftext": "I was severely bulimic from the ages of 19-25 (binging and purging over 20 times a day at points).  I remember feeling completely hopeless, and that I’d spend the rest of my life in bulimia hell.  The urges to binge were SO powerful.  I thought it would kill me.\n\nI am 34 now and have been living happily bulimia free for almost 10 years.  I want you to know you ABSOLUTELY can recover COMPLETELY.  I haven’t the slightest fear that bulimia will ever come back.  It seems like such a distant memory.  I promise you can do it too.  Here are a few things that helped:\n\n*Self-compassion:  If I had to attribute my recovery to one thing, it would be self- compassion.  It’s SO crucial.  You didn’t become bulimic in one day.  You can’t expect to have a perfect recovery from day one.  Be NICE to yourself.  You’ve gone through enough pain and heartache.  You don’t need to pile on anymore.  Being mean to yourself has never gotten you anywhere.  Recovery takes effort, and give yourself credit for trying!  Give yourself credit for even wanting to try!  It DOES NOT MATTER if today wasn’t perfect.  The whole day isn’t ruined.  Even if you binged and purged 50 times today- give yourself credit for stopping at 50 and not going to 51.  Baby steps.  Remember your end goal: a happy, bulimia free life.  Mistakes can and will happen along the way and you will still get there.  I had sooooo many days during recovery that weren’t perfect, yet I’m still here now almost 10 years later fully recovered!  I was also 1000x more likely to stop the cycle the KINDER I was to myself.  Talk to yourself like you’re a baby learning to walk.  You don’t yell at a baby because she didn’t run a marathon after her first step.  Be your own best friend!  Would you berate your best friend because she wasn’t perfect from day 1?  Or would you remind her of how amazing she is for having the courage to try?  I can’t stress this enough: SELF-COMPASSION IS CRUCIAL AND LEADS TO RECOVERY!\n\n*Understanding that dieting led to my bulimia.  It wasn’t my fault.  I simply started dieting and I couldn’t take it anymore.  This is the natural result of dieting gone too far.  IT’S NOT YOUR FAULT.\n\n*Structured eating: During the first part of recovery I had 6-7 small meals a day spaced 2-3 hours apart.  Smaller meals are easier for you to digest at first.  The goal is to get those awful binge urges (that come as a result of physical and psychological restriction) to calm down and eventually go away.  You don’t have to eat this way forever.  You’ll eventually get attuned to your body and you can eat intuitively.\n\n*Temporary weight fluctuations and bloating is to be expected.  Take it as a sign your body is recovering- it’s a GOOD thing.  It WILL NOT be this way forever.  Your body will learn how to digest food again, your binge urges will go away, and you will be free.  Get yourself some comfy, stretchy clothes and BE KIND TO YOURSELF!  \n\nAlso, I read “The Bulimia Help Method” by Ali Kerr.  She also had severe bulimia and is fully recovered now.  \n\nYOU CAN DO IT!  I am living proof.  \n\nSending lots of love to all of you!  BE KIND TO YOURSELVES!!!",
  "url": "https://www.reddit.com/r/bulimia/comments/11w1bsr/words_of_encouragement_from_a_former_bulimic/",
  "score": 71,
  "num_comments": 10,
  "comments": [
    {
      "id": "jcvxykg",
      "author": "None",
      "body": "Thank you so much for posting this, you beautiful soul. 💗",
      "created_utc": 1679269581.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jcwg05y",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1679277897.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jcwktxp",
      "author": "None",
      "body": "Thank you, this is honestly amazing I’m so glad you’ve managed to recover. \nPersonally I think about myself that I’m not worthy of recovery or I haven’t been through enough but I know how much pain I’ve caused myself yet I still disbelieve that I’m gonna allow myself freedom and happiness. It’s as if that my life isn’t meaningful if I don’t suffer and it’s hell. I want recovery but there’s something there telling me that I’m not suffering enough and I can’t take it anymore. I’m so glad you’re doing okay tho. Sending lots of love!",
      "created_utc": 1679280238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jcx3nhe",
      "author": "AKidNamedMescudi",
      "body": "Thanks, Kendra:)",
      "created_utc": 1679291841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jcxoid5",
      "author": "None",
      "body": "I can’t say thank you enough for this. It truly is helpful. I’m saving this post!! Congratulations on 10 years free of bulimia - that is so inspiring 💜💜",
      "created_utc": 1679309722.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd0bk8w",
      "author": "Spiritual_Worker3062",
      "body": "Cognitively, this makes so much sense, thanks for sharing your experiences. I’ll try to internalise them❤️",
      "created_utc": 1679350881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jcxroxk",
      "author": "None",
      "body": "Absolutely, my love!!❤️❤️❤️",
      "created_utc": 1679311954.0,
      "score": 3,
      "context": [
        {
          "id": "jcvxykg",
          "author": "None",
          "body": "Thank you so much for posting this, you beautiful soul. 💗",
          "created_utc": 1679269581.0
        }
      ]
    },
    {
      "id": "jcxrnm9",
      "author": "None",
      "body": "Good!  Yes, believe in yourself and have hope!  It’s 100% possible and your life is absolutely worth it!\n\nI would say all in all it took a little less than a year to be completely free.  In hindsight, this is NOT a lot of time considering I had been dieting/ restrictive eating/ etc. since I was 12, and my bulimia was very severe.  \n\nThere were encouraging things that happened along the way throughout the process, too.  One day I noticed I barely thought about food unless hungry.  I started to be able to keep all types of foods in the house (and forget about them completely).  I’d have stressful days and not want to binge/ purge to cope.  \n\nI know it seems daunting at first, but I’m so glad I fully committed and kept moving forward.  I was so tired of living in hell.  \n\nYou won’t regret it.  I promise!",
      "created_utc": 1679311930.0,
      "score": 4,
      "context": [
        {
          "id": "jcwg05y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1679277897.0
        }
      ]
    },
    {
      "id": "jcxrpd7",
      "author": "None",
      "body": "Anytime!",
      "created_utc": 1679311962.0,
      "score": 3,
      "context": [
        {
          "id": "jcx3nhe",
          "author": "AKidNamedMescudi",
          "body": "Thanks, Kendra:)",
          "created_utc": 1679291841.0
        }
      ]
    },
    {
      "id": "jcxtbdz",
      "author": "None",
      "body": "I’m so glad it was helpful!!  I wish I could give all of you a hug and let you know YOU 100% CAN DO THIS!\n\nYes, I honestly can’t believe it’s been almost 10 years.  I remember feeling like I was too far gone and beyond hope, but that was just another LIE bulimia was telling me.  \n\nRecovering from bulimia will ultimately give you the strength to face ANYTHING in life.  You are much stronger than you know. \n\nYou deserve freedom.  You deserve peace.  Your life is worth it, my love!!!❤️❤️❤️",
      "created_utc": 1679313003.0,
      "score": 1,
      "context": [
        {
          "id": "jcxoid5",
          "author": "None",
          "body": "I can’t say thank you enough for this. It truly is helpful. I’m saving this post!! Congratulations on 10 years free of bulimia - that is so inspiring 💜💜",
          "created_utc": 1679309722.0
        }
      ]
    }
  ]
}