{
  "id": "124o9vd",
  "subreddit": "bulimia",
  "author": "No-Nose-1264",
  "created_utc": 1680009029.0,
  "title": "2 year streak, broken.",
  "selftext": "Just wanted to share something today, something awfull. \n\nAt a pool party, our friend visiting from Germany was complimenting one of my friends about his weight loss.  His words being\n\n\"You lost all that weight and it transferred to him (me).\"\n\nAnd he said that repeatedly.  \n\nSo, out of pure depression,  I hid behind the resort,  and reignited my bulimia. \n\nKeep in mind, this German friend has the ideal body. Six foot five,  six  pack, everything. \n\nNow i feel like shit. Im scared that I'll return to my old ways. Vomiting everything i eat just to feel less pain than being compared to others. \n\nJust wanted to share  I'm not asking for sympathy or advice.  Just...sharing an unfortunate event. \n\nHoping you guys are faring better than me. ❤️",
  "url": "https://www.reddit.com/r/bulimia/comments/124o9vd/2_year_streak_broken/",
  "score": 73,
  "num_comments": 9,
  "comments": [
    {
      "id": "je0m0og",
      "author": "macnsleaze",
      "body": "I’ve noticed anecdotally that Europeans, at least compared to Americans, speak more harshly to each other as part of their culture’s “banter.” He thought he was being funny, but he wasn’t.\n\nThey’re also more comfortable with nudity, and don’t seem to identify as strongly with their bodies. They seem to view their bodies as more like a vehicle that carries them around. Bodies are more meaningful, private and sacred in American culture. \n\nI’m clearly having a hard time explaining this observation, but it’s no excuse for saying such a d*cky thing, let alone repeatedly. \n\nI’m sorry this happened to you. Take your power back by choosing not to let a loser’s words affect your progress. Giving in is not an excuse to give up. Start a new streak, but even better, stop counting and live your life. Best of luck to you.",
      "created_utc": 1680017956.0,
      "score": 44,
      "context": []
    },
    {
      "id": "je0ld64",
      "author": "alka__seltzer",
      "body": "Sending you strength and positive energy, i hope you never see that person again",
      "created_utc": 1680017707.0,
      "score": 12,
      "context": []
    },
    {
      "id": "je0lziu",
      "author": "chaoticcrybaby",
      "body": "its a slip up but dont let it ruin the progress you’ve made ❤️",
      "created_utc": 1680017944.0,
      "score": 11,
      "context": []
    },
    {
      "id": "je30uss",
      "author": "Available_Cow_8081",
      "body": "Sending love buddy 🥰",
      "created_utc": 1680052319.0,
      "score": 3,
      "context": []
    },
    {
      "id": "je5nvo1",
      "author": "rumbusiness",
      "body": "Don't think in terms of streaks. I've slipped up a few times over the past few months, but I've gone from purging at least once or twice a day, to maybe four times in the past year. \n\n(Admittedly I have substituted other unhealthy habits, but that's a tangent here.)\n\nOne or even a few slip-ups doesn't mean all that progress has gone. I don't do 'streaks' for this exact reason.",
      "created_utc": 1680106778.0,
      "score": 3,
      "context": []
    },
    {
      "id": "je3gqvv",
      "author": "No-Nose-1264",
      "body": "Thank you for the kind words, everyone. I genuinely did not expect any responses. \n\nAnd you guys are right. Relapses happen, but I ultimately am in control. And I'm lucky that i surround myself with friends who know of my struggle.  They stuck with me throughout the night, not letting me alone in case I begin again. \n\nThank you guys again. I'll take your words to heart.",
      "created_utc": 1680059829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "je3reow",
      "author": "D00d0069",
      "body": "Hi I’ve also recently reignited my bulimia after being clean for a long time!! So fun, right? But you know what, everyday is an opportunity to start anew. Don’t beat yourself up if you slip up either. EDs are complicated and feel like the best coping mechanisms sometimes, even when we know better 🫠",
      "created_utc": 1680065966.0,
      "score": 2,
      "context": []
    },
    {
      "id": "je3yyl6",
      "author": "shark_robinson",
      "body": "I wonder if you could try to approach it from a cultural misunderstanding perspective if you don’t want to reveal that you have bulimia but want to make sure he doesn’t make more comments like that. You could try to tell him like “hey I know you just meant it as a joke but in the US you should never comment on people’s weight because it’s considered extremely rude”",
      "created_utc": 1680071397.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jem512l",
      "author": "throwaway293730",
      "body": "remember: recovery isnt linear and purging doesnt diminish the 2 years of progress you’ve made. not even a little. stay strong❤️",
      "created_utc": 1680402819.0,
      "score": 1,
      "context": []
    }
  ]
}