{
  "id": "1291d0z",
  "subreddit": "bulimia",
  "author": "stormiso",
  "created_utc": 1680388782.0,
  "title": "i would give absolutely everything if i could go back in time and stop myself from purging for the first time.",
  "selftext": "i somewhat turned from anorexic into bulimic (i still have times where i only restrict for days or weeks) and i would give ANYTHING to go back. of course i‘d prefer recovery but i would stay anorexic for the rest of my life if it‘d mean i could stop purging instantly. getting out of this hell seems impossible. from the first time i purged this little voice in the back of my head has appeared and it‘ll never go away. how can i forget the knowledge i have now? no matter if i binge or eat one grape.\n\n\"why would u keep ANY food inside when u could simply get rid of it? why would u risk gaining when u know how to prevent it?\"\n\nit doesn’t shut up. it doesn’t leave me alone. it genuinely drives me insane. my health is deteriorating and i‘m not sure how much longer i can keep going like this. as suicidal as i may be, i don‘t want bulimia to kill me. i just don‘t. i don‘t want to be found hanging dead over my toilet. but recovery is absolutely terrifying and at this point i‘d still rather die than recover and gain weight. i also don‘t think i ever CAN. i can‘t shut the voice up. i just can‘t.\n\nwhat am i supposed to do? every option scares the shit out of me. it‘s like i‘m trapped in a burning building and every damn escape is on fire. besides one small window but THAT escape would be eternal and nowadays i‘m considering it more and more. i‘m just so tired. i‘m so done fighting when i lnow that i‘ll NEVER see myself as skinny and pretty no matter how much weight i lose. i‘ll never love myself, i‘ll never be happy. what‘s the freaking point?",
  "url": "https://www.reddit.com/r/bulimia/comments/1291d0z/i_would_give_absolutely_everything_if_i_could_go/",
  "score": 65,
  "num_comments": 10,
  "comments": [
    {
      "id": "jelg6jy",
      "author": "None",
      "body": "bulimia is truly an addiction, for me at least. its ruined so many aspects of my life from family, to relationships, friendships, work, life experiences, and health physically and mentally, and appearance. its overall fking awful. i put it to the same degree of lax abuse: no benefit whatsoever, only negatives. i wish you the best in hopefully recovery from this awful thing. hopefully we all can someday",
      "created_utc": 1680390656.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jep4kis",
      "author": "strangemaryland",
      "body": "the first time i was about to purge after eating i had this one moment of mental clarity like “you know exactly this going to be it if you start this now. it’s all downhill from here”. it didn’t stop me and i would do everything now to travel back in time to slap myself across the face. it was the worst decision ever. fast forward 1 year i landed in hospital at the intense care unit cuz my potassium levels were dangerously low i could’ve died any second and they wondered how i was still alive. bulimia is hell. i wish this upon no one ever",
      "created_utc": 1680464576.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jemgn3e",
      "author": "kathja71",
      "body": "I have been where you are, going from anorexia to bulimia and terrified of recovery...of saying goodbye to an old 'friend' and facing weight gain, etc. I also recall that same feeling, that I would give ANYTHING to have a 'normal' relationship with food.\nAnd you know from this forum that it IS possible. I (for one) am now about fifteen years free of eating disorders (I say 'about' 15, because it kinda left me gradually rather than abruptly.)\nI understand the lows, the occasional suicide wish, the despair, and the self-loathing. If you can, please keep in mind the future you...that strong person poised somewhere marvellous to you! Never give up on giving up. X",
      "created_utc": 1680409175.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jenpd7v",
      "author": "fatale_x",
      "body": "I feel the same!\n\nThe knowledge that you can purge and not have to worry about exercising that day because you ate something 'sinful' is very dangerous. \n\nEven if what I eat is 'safe' foods, the moment I feel bloated or too full, the need to purge just comes.",
      "created_utc": 1680442313.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jelre1p",
      "author": "No-Character8388",
      "body": "U know what you should do? Get up and do some running.",
      "created_utc": 1680396053.0,
      "score": -7,
      "context": []
    },
    {
      "id": "jelv1d4",
      "author": "stormiso",
      "body": "it definitely is.. and exactly. we know it has zero benefits whatsoever but still can‘t stop. it‘s crazy how much control this disorder has. thank u sm :) that means a lot and i hope the same for u as well x",
      "created_utc": 1680397820.0,
      "score": 2,
      "context": [
        {
          "id": "jelg6jy",
          "author": "None",
          "body": "bulimia is truly an addiction, for me at least. its ruined so many aspects of my life from family, to relationships, friendships, work, life experiences, and health physically and mentally, and appearance. its overall fking awful. i put it to the same degree of lax abuse: no benefit whatsoever, only negatives. i wish you the best in hopefully recovery from this awful thing. hopefully we all can someday",
          "created_utc": 1680390656.0
        }
      ]
    },
    {
      "id": "jeq8nsy",
      "author": "manchanluvs",
      "body": "oh my god. this.",
      "created_utc": 1680482469.0,
      "score": 1,
      "context": [
        {
          "id": "jenpd7v",
          "author": "fatale_x",
          "body": "I feel the same!\n\nThe knowledge that you can purge and not have to worry about exercising that day because you ate something 'sinful' is very dangerous. \n\nEven if what I eat is 'safe' foods, the moment I feel bloated or too full, the need to purge just comes.",
          "created_utc": 1680442313.0
        }
      ]
    },
    {
      "id": "jelukym",
      "author": "stormiso",
      "body": "and achieve what exactly?",
      "created_utc": 1680397591.0,
      "score": 3,
      "context": [
        {
          "id": "jelre1p",
          "author": "No-Character8388",
          "body": "U know what you should do? Get up and do some running.",
          "created_utc": 1680396053.0
        }
      ]
    },
    {
      "id": "jem4z49",
      "author": "No-Character8388",
      "body": "This is my experience, but for me, distance running has been a gamechanger in my battle with my eating disorder. Before I started running, I was constantly consumed with thoughts about food and my body. But once I began to run regularly, my mindset shifted. I started to see food as a fuel for my body (something to help me run faster and longer, rather than something to fear or obsess over.) It basically helped me take back control of my life and focus on the things that truly matter like my health, my relationships, and my goals. So if you're tired of purging and ready to make a change, consider lacing up your sneakers and hitting the pavement. You might be surprised at what a difference it can make.",
      "created_utc": 1680402791.0,
      "score": 0,
      "context": [
        {
          "id": "jelre1p",
          "author": "No-Character8388",
          "body": "U know what you should do? Get up and do some running.",
          "created_utc": 1680396053.0
        },
        {
          "id": "jelukym",
          "author": "stormiso",
          "body": "and achieve what exactly?",
          "created_utc": 1680397591.0
        }
      ]
    },
    {
      "id": "jemyyto",
      "author": "trukrdit",
      "body": "Glad this worked for you but the way you phrased your initial comment was pretty blunt and inconsiderate. \nPersonally I’ve been going to the gym every day and integrated cardio into my workouts but my ed has only persisted (gotten worse even since I started). \nExercise helps but its not always the immediate solution to such a complex and layered psychological disorder.",
      "created_utc": 1680422321.0,
      "score": 5,
      "context": [
        {
          "id": "jelre1p",
          "author": "No-Character8388",
          "body": "U know what you should do? Get up and do some running.",
          "created_utc": 1680396053.0
        },
        {
          "id": "jelukym",
          "author": "stormiso",
          "body": "and achieve what exactly?",
          "created_utc": 1680397591.0
        },
        {
          "id": "jem4z49",
          "author": "No-Character8388",
          "body": "This is my experience, but for me, distance running has been a gamechanger in my battle with my eating disorder. Before I started running, I was constantly consumed with thoughts about food and my body. But once I began to run regularly, my mindset shifted. I started to see food as a fuel for my body (something to help me run faster and longer, rather than something to fear or obsess over.) It basically helped me take back control of my life and focus on the things that truly matter like my health, my relationships, and my goals. So if you're tired of purging and ready to make a change, consider lacing up your sneakers and hitting the pavement. You might be surprised at what a difference it can make.",
          "created_utc": 1680402791.0
        }
      ]
    }
  ]
}