{
  "id": "12cz7eb",
  "subreddit": "bulimia",
  "author": "Spiritual_Worker3062",
  "created_utc": 1680731513.0,
  "title": "Give me your worst bulimia horror stories",
  "selftext": "Complications, fucked up situations etc.\nUnfortunately I can’t care about the risks  enough to try and prevent them and I’m sure Im not alone. But let’s do at least a reality check. Bulimia isn’t as glamorized as anorexia, but I the “well it won’t happen to me” mindset is real.",
  "url": "https://www.reddit.com/r/bulimia/comments/12cz7eb/give_me_your_worst_bulimia_horror_stories/",
  "score": 192,
  "num_comments": 179,
  "comments": [
    {
      "id": "jf4azf2",
      "author": "delstranger",
      "body": "I had a temporary fake tooth that was kinda loose in my head and would sometimes come off (bottom middle). I was binging and at some point realized the tooth was gone. I wasn’t set to have a permanent replacement for months, and it was an expensive fake. I decided I needed to purge into plastic bags, put gloves on, and go digging. Never did find it and went without that tooth for a while lol. Took a long hard look at myself that day",
      "created_utc": 1680737534.0,
      "score": 120,
      "context": []
    },
    {
      "id": "jf3yqhn",
      "author": "graamatvede",
      "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
      "created_utc": 1680732112.0,
      "score": 228,
      "context": []
    },
    {
      "id": "jf41prn",
      "author": "None",
      "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
      "created_utc": 1680733395.0,
      "score": 86,
      "context": []
    },
    {
      "id": "jf4rali",
      "author": "5star-my-notebook",
      "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
      "created_utc": 1680744943.0,
      "score": 84,
      "context": []
    },
    {
      "id": "jf4mkrw",
      "author": "turnipkitty112",
      "body": "Oh boy I’ve got so many…\n- being hospitalized for general mental health and they didn’t know about my purging so I b/ped on the psych ward and purged in the shower… shower got clogged, water level RAPIDLY rising, had to unclog this filthy shower with my hands while ankle deep in puke water\n- binging on a jar of natural peanut butter (nothing else) while staying at a friends house, purging in the shower… worst purge of my life, it wouldn’t come out and thought I was gonna die choking. \n- staying up literally all night multiple nights in a row (sleeping most of the day) b/ping 6 times a day and only leaving my apartment to go to the corner store in the middle of the night for food\n- going to said corner store 4x in one day and buying their ENTIRE stock of frozen apple pies (the cashier was confused 💀)\n- b/ping while hospitalized FOR my ED… staff were clueless. Most unhelpful IP experience of my life.\n- purging in a bush in the park in the middle of winter (I live in Canada btw) bc my parents made me eat a strawberry yogurt\n- and just in general over last fall/winter spending almost every night feeling like I was dying (I think it was hypoglycaemia +/- dehydration) and being 100% convinced that my family was going to find my dead body after weeks of not hearing from me (I was living alone) bc I dropped dead in front of the toilet. Dark times.",
      "created_utc": 1680742799.0,
      "score": 61,
      "context": []
    },
    {
      "id": "jf4zho1",
      "author": "deifiedtoad",
      "body": "Peeing myself purging (in a public restroom) was an all time low.",
      "created_utc": 1680748730.0,
      "score": 63,
      "context": []
    },
    {
      "id": "jf55con",
      "author": "beanswort",
      "body": "Oh geez where do I start. Massive TW obvious lmao.\n\nI've accidentally purged on an innocent bug while trying to throw up in a drain to a sump pump in my basement and drowned the fucker in vomit. RIP little man.\n\nAccidentally forgot where I stashed a vomit bag in my basement during COVID and found it almost a year later.  It looked like I was growing an alien specimen.\nI've also done this once in my bedroom closet but it only sat a few months.\n\nI've smuggled a shopping bag filled with smaller zip lock bags out of my house at 3am for a walk of shame to dispose of so no one in my house would catch me.  Well the fucking busted open in my garage bin and soaked it in vomit.  You could smell that shit outside my house for WEEKS.\n\nAlmost choked to death alone at my boyfriends house and dug my own throw up out of my throat thankfully. Scared the piss out of me. Proceeded to have a mental breakdown then binge and purge again later that night.\n\nBacked up plumbing at both my home so badly a plumber had to come in and unclog our pipes and it lead to my mom confronting me about \"being too lazy to walk downstairs to throw food out and not flushing it anymore.\"\n\nClogged my boyfriends shower tub.\n\nI had 17 cavities in one fucking year.\n\nIt's gotten so bad I'll randomly just upchuck if I eat too fast or eat food that doesn't agree with me. Laxative abuse had caused me to shit myself plenty of times. \n\nIt goes on and on and on.  I started at 15. I turn 25 in October.  Almost 10 years of this shit and I regret the day I finally figured out how to make myself purge.   I'll cry and purge and cry and purge, melt down and hold myself in the shower from the pain it causes me, yet I can't stop. I've suffered from strictly binging and restricting but I swear, bulimia is the worst, purging is the absolute fucking worst.\nI just got back from the bathroom. \nThere's nothing beautiful about this eating disorder.  I cannot glamorize it.  It mortifies me. My friends hate going out to eat with me. My boyfriend is terrified to leave me alone.",
      "created_utc": 1680751673.0,
      "score": 59,
      "context": []
    },
    {
      "id": "jf54aqi",
      "author": "Awassya",
      "body": "So, so many. Some, but not all of the highlights would be:\n\n-c/s-ing and spilling the contents of the bag all over myself in public\n-passing out after flushing my stomach 4 times and cracking a tooth on the rim of the toilet\n-falling face first into the toilet mid purge since the floor of the bar restroom was slippery and I purge standing up and I wasn't even tipsy to blame it on, just clumsy\n-choking on binge food so bad I threw up involuntarily and then aspirated some of the vomit, making me choke again\n-tearing my esophagus multiple times in my life, stomach ulcers, 12 cavities, etc.\n-pouring bathroom cleaning products on binge food to stop eating it, eating it anyway and getting poisoned from it\n-throwing up my loved ones' and my own birthday cakes, crying in the bathroom every time it happens\n-at home tube feeding going several shades of wrong (chronically ill unrelated to my ED too and sometimes require it, long story)\n-dislocating my jaw trying to open it far enough so I don't stab myself in the throat with long nails\n\nAnd that's not even taking into account all the weird ass behaviours on the side. I wish I could stop - currently relapsing. I'm holding a candle of undying optimism that one day I'll be free of it. Hang in there.",
      "created_utc": 1680751108.0,
      "score": 38,
      "context": []
    },
    {
      "id": "jf4f01t",
      "author": "gaymofo666",
      "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
      "created_utc": 1680739370.0,
      "score": 62,
      "context": []
    },
    {
      "id": "jf4j08e",
      "author": "wwazbd",
      "body": "husky selective deranged sleep aware boat market dam nail six -- mass edited with redact.dev",
      "created_utc": 1680741175.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jf46mem",
      "author": "jekyllcorvus",
      "body": "This is coming for the perspective of a 35 yr old male that’s been bulimic for 22 years and b/p several times a day for who knows how long. I’m also an alcoholic/addict in recovery. These things are not mutually exclusive. \n\nPhysically: \n\nI’m down to 113 pounds since I got into recovery four months ago. As a “seasoned” bulimic I’ve had fainting spells after purges, I get tired extremely easily, there are times we do breathing exercises and I feel like I barely breathe to begin with. I’m constantly light headed so standing up too fast sometimes gets to be a momentary blackout. My heart flutters and feels weak. I’ve felt the electrolyte imbalance drop and my body shake violently and sweat. From the age of 16 to 35 I’ve spent binging and purging (the drugs and alcohol another issue for another sub) and it’s a wonder how I’m still standing which leads to..\n\nMental: \n\nI’m down to 113 pounds and it’s worrisome because that’s a dangerously low amount and rationally I know this to be the case and in my sick bulimic brain I’m still stuck in my b/p cycle. I’m starting to seek help for it now while I can in my recovery program but it’s hard as hell because it’s such a lonely and isolating disease. \n\nThat’s my worst bulimia story. It’s an addiction like any other and it takes over your life. It’s called a silent killer for a very good reason.",
      "created_utc": 1680735566.0,
      "score": 48,
      "context": []
    },
    {
      "id": "jf4dznh",
      "author": "gomichan",
      "body": "When I went to the fair with my friend and had an awful time because all I could think about was finding a bathroom by myself to purge and ended up purging with my head in a latrine :( it was so nasty",
      "created_utc": 1680738907.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jf4n01t",
      "author": "Pussitron420",
      "body": "Clogging the toilet in a public restroom and then a group of people walk in",
      "created_utc": 1680742990.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jf55pxo",
      "author": "Party-Significance74",
      "body": "One time when I went to hang with friends they were going to shotgun a beer and I wanted to join but I had just eaten, so I went to pee first aka puke and came back and ended up having vomit on my arm bc I didn’t wash my hands up my wrists enough and one of them pointed it out and I was like oh what is that ew where did that come from",
      "created_utc": 1680751868.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jf5rosl",
      "author": "AggressiveVisual7538",
      "body": "\n- picking out chunks of food in my purge and eating it ☹️\n- purging at school and getting caught \n- having bags of vomit in my room for weeks \n- passing out in my own vomit \n- unimaginable tooth pain and all the cavities \n- having people telling me i smell sick \n- shitting blood \n- purging my medication that desolves in ur stomach so i got to taste the most disgusting combination of vomit and chemicals the taste wouldn't leave my mouth it was horrible \n- clogging the shower drain",
      "created_utc": 1680767345.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jf56cy4",
      "author": "StockReporter5",
      "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
      "created_utc": 1680752218.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jf4bh89",
      "author": "Affectionate_Ninja62",
      "body": "Complication wise, after 9 years my teeth are in pretty bad shape. I used to love my smile but now it doesn't look the same and I'm always in pain. But I think a situational worse for me was, this is soooooo embarrassing but I had like 4 vomit bags in my shower and while I was gone my mom texted me and told me she found them and how disgusting I was. I felt so ashamed, didn't even want to come back home. Thankfully she doesn't care or bring it up anymore so I can suffer in silence.",
      "created_utc": 1680737761.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jf61y7l",
      "author": "prostateversace",
      "body": "When I left a bag of vomit in my room for 3 weeks, put the heat on full and shoved my head into the bag every time I wanted to eat as a punishment. Lol I was so ill. Also peeing myself",
      "created_utc": 1680776309.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jf758p2",
      "author": "Curious_Insurance694",
      "body": "While purging my parrot flew to me and fell into the toilet. \nI love my parrot.\nIt was horrible.",
      "created_utc": 1680795869.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jf5tltv",
      "author": "None",
      "body": "My dental appointment today. 1k for fillings and other work due to acid damage. (I cannot afford this)",
      "created_utc": 1680769049.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jf4r819",
      "author": "None",
      "body": "Friend catching me do it, and also getting several cavities that were fortunately filled in. But nothing near as bad as these comments, holy shit I’m sorry you guys.",
      "created_utc": 1680744910.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jf4lubs",
      "author": "Comfortable-Ebb-2859",
      "body": "Telling my mom I had multiple bulimic episodes and her exploding at me.\n\n“What is wrong with you?We’re paying for this treatment for you! Is this what they’re teaching you in therapy!? That you can eat whatever you want?? WHAT THE FUCK IS WRONG WITH YOU!?”\n\nAlso, one time I threw up and completely missed the toilet and getting puke all over the wall.",
      "created_utc": 1680742468.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jf5geh6",
      "author": "ParsleyExisting5933",
      "body": "My mom had taken out the trash and her watch broke off, it wasn't on the ground so, yea, it had probably fallen into the trash. The problem with that though, I used to purge in the trashcan. After a good 2 hour long screaming match between us I had to slap on some gloves and go digging through my own vomit for it, wasn't very pleasant to say the least. Watch wasn't even in there, it had fallen under the car. So yea, dug through at least a gallon or two of vomit for nothing. \n\nOnce slipped on my puke in the bathroom and fractured my tailbone, not sure what to think of that one.\n\nOnce passed out after purging and put a nice big dent in the wall with my big ass head",
      "created_utc": 1680758354.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jf5k0pc",
      "author": "kleptokaja",
      "body": "Purging at two of my three jobs. I’m 17(turning 18 in 4 days), and work at an icecream store, taco restaurant, and as a part time babysitter every few weeks.\n\n I’ve binged and purged while I was supposed to be checking on the 7 year old I watch, and I still can’t get over how disgusting I feel and can’t begin to guess how I’d feel if they found out of the kid burned the house down while I’m making myself sick.\n\nAt the icecream store, I binged in front of my coworkers, and then purged in the bathroom. I thought I’d gotten away with it too but my manager looked at my eyes and said ‘are you okay?’ So I’m sure he sort of knew. \n\nI’m not too far in, but it still feels like an addiction that’s impossible to live without. I gave myself 4 cavities in 5 months. I purged even when I was recovering from wisdom teeth surgery, and have physically fought with my mom when she was trying to block me from food. \n\nIf any of you aren’t in too deep yet, please try your best to kick binging and purging.",
      "created_utc": 1680761021.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jf68bxo",
      "author": "serena_renee",
      "body": "•friend found a zip lock baggy in my glove compartment with vomit in it\n\n•just last week I purged a huge amount out and the vomit hit the toilet water so hard that it splashed back up and into my eyes\n\n•Purged in the shower and vomit clogged the drain so I had to get a cup and clean out vomit shower water myself\n\n•Took a walk to purge fresh out of rehab (it was late at night, couldn’t purge at home bc mom would know) was purging kind of back in some trees and then one of my friends dads saw me🤪🤪🤪",
      "created_utc": 1680780799.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jf4pfcy",
      "author": "FunkoSkunko",
      "body": "I have also burst a blood vessel in my eye from vomiting too forcefully, my mouth is currently in pain because one back molar is broken. The other, the one that gets more directly hit, needed a root canal and crown, but is so worn down that they had to cut away some of my gums to get the crown to stay on. I have acid reflux. I have had to scoop puke out of a toilet with my hands and throw it out a window, because the toilet wouldn't flush and I didn't want anyone to know. I have been splashed in the eye twice with public toilet water, and in the face more times than I can count.",
      "created_utc": 1680744093.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jf5yh5z",
      "author": "Get-Shivved",
      "body": "Wasted a whole months worth of adhd medication because I kept purging them up (they were slow release so stuck around for like 12 hours of the day). Was wondering why they weren't working SMH",
      "created_utc": 1680773399.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jf5w8i3",
      "author": "None",
      "body": "dug through my own vomit in the toilet, purged into my recycling bin multiple times bc the bathroom was occupied, stood over the toilet gagging for half an hour until i had tons of broken capillaries all around my eyes and scratched my throat bc nothing would come up. luckily no serious compilations or anything too bad yet but i’ve only been purging for a couple months so far so we’ll see (hoping to quit but yk how it goes)",
      "created_utc": 1680771397.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jfa6ix5",
      "author": "valerienorma",
      "body": "Both retinas detaching and perforated, unusual at 29, didn’t have any recent head injuries which could have explained it, ophthalmologist said likely from the repeated pressure from purging.  I hadn’t had my eyes dilated and photographed since before I was bulimic (approx 6 years prior) and there was no sign of this in the previous exam. Could have become blind. Had procedures on my eyes for about 6 months after. \n\nOh and $10 000 in dental work shortly after. \n\nI’ve been in recovery for about one year, I’ve gained weight, sometimes feel out of control and I feel uncomfortable and unsure of my self some days without my old coping mechanism around, but every pound is fine if I still have my vision.",
      "created_utc": 1680843798.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jf531k4",
      "author": "InspectorPinkpanther",
      "body": "Well i got hospitalised because i purged out blood, like really alot of blood\nHad to put 3 staples in my oesophagus by the doctor\nWas in pain for a week \nSo, its not worth it guys",
      "created_utc": 1680750466.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jf5cgsv",
      "author": "prettycynicist",
      "body": "Ended up in the hospital with a pretty bad T-Wave anomaly and some other heart stuff, was told if I’d kept purging at the rate I was, I’d have done irreversible cardiac damage within the month.",
      "created_utc": 1680755756.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jf69eh2",
      "author": "Safetychick92",
      "body": "I’m 31 and my bones are shot. My spine is curved now and my knees and hips kill. I work a physically demanding job at an oil refinery and everyday is a struggle.",
      "created_utc": 1680781452.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf6bivf",
      "author": "NatalieALx",
      "body": "i ended up in hospital with dangerously low potassium levels, was basically about to have a heart attack and die. had to have it corrected with ivs. i feel like it’s probably quite common but what’s so scary about it is that you literally don’t know like mine was caught as a result of having routine bloods for another issue but if i hadn’t had that maybe i wouldn’t be typing this now. \n\ni also used to purge using objects rather than hands/fingers which my therapist was always incredibly worried about as i almost swallowed said objects/choked on multiple occasions. \n\npurged in public places many a time, which always felt like hitting a new low, i always tried not to do it at friends houses though. \n\neye blood vessels popping and then going to the opticians a while after but it still being noticeable and having them ask if i knew what caused it as they’d never seen it before… which is just like really awkward.",
      "created_utc": 1680782681.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jf7u2ep",
      "author": "Kind-Resident-3460",
      "body": "My long term bulimia has caused ATROCIOUS oral health. I've had 11 cavities at one time and I've had full dental work to fix/fill those cavities. Since then, I have regained cavities in the EXACT same places as my fillings.... I currently have no dental insurance (in the US) and have basically no money to fix/fill these cavities. So now I'm forced to deal with the fact that I may lose MULTIPLE back teeth (which are obviously needed for chewing food) simply due to the fact that I'm bulimic and refuse to brush my teeth after vomiting (because I want to avoid brushing leftover acid on my teeth). So, basically, bulimia DESTROYS teeth and prolonged bulimia may cost you THOUSANDS of dollars just to \"upkeep\"",
      "created_utc": 1680805488.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jf5hlz9",
      "author": "perfrctlines",
      "body": "i puked in my parents car like usual but i almost always do it into a garbage bag but i didnt have one so i just used a fast food bag cause it almost always works fine but ended up purging WAY too much and the bag broke and the puke got on the steering wheel, in between the seats and basically like…everywhere. i spent a good 2 hours or so buying cleanjng supplies then sitting in the parking lot cleaning it and thank god there was a towel in the car to help but even after that i went through like 3 rolls of paper towel to get it out. i was convinced i’d get caught cause it was SO hard to get everything but it was a year ago and no questions about it thusfar. my worst mistake ever and i havent done it in the car since. i still wanna cry thinking about it",
      "created_utc": 1680759217.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf6adlq",
      "author": "clairebearruns",
      "body": "Idk how I still have people in my life:\n•I used to sift through my purge to make sure I got everything and once I was so desperate I re-ate some that wasn’t chewed all the way so I could purge again. \nI’ve also eaten out of the trash in my own house and strangers houses. \n•I was too scared to make noise puking into a toilet at a party so I puked in the sink thinking I could just scoop it out into the toilet? Idk what I was thinking but it stopped up the sink and embarrassed my aunt. \n•I used to keep purge in ziplocks and dump them after I was convinced I had gotten everything out, which usually took about a month to fully convince myself. \n•I had an insurance check from an accident and I literally b/p the check in three days before my husband realized I’d gotten it. That’s the most I’d ever spent on flush food and idk if he ever found out. (It was like $1500)\n•I missed something at my kid’s school bc I had purged myself into a hard nap \n\nI’m sure there’s more, but I don’t want to think about it 😭😬",
      "created_utc": 1680782026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf81yt7",
      "author": "Lumplebee",
      "body": "I have severe stomach pain from purging so much and treating my stomach like trash for years. I’m only drinking liquids right now and can’t purge probably ever again without causing a pain flare at least.",
      "created_utc": 1680808620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf5lsjq",
      "author": "kilobytess",
      "body": "i used to take old antibiotics without food and fuck my system up for a day or two. easy excuse to fast after a binge",
      "created_utc": 1680762411.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf6yhsv",
      "author": "aerinz",
      "body": "gallbladder removal, bleeding from my nose and throat because the force of purging and acid literally broke the blood vessels, my literal uterus and bladder are trying to run away from me so I also piss myself a lot and can feel my uterus slipping down if I laugh too hard, I can’t eat fruit because it is usually chilled and it hurts my teeth so bad, my teeth are see through at the end from enamel loss with tons of chips in them. I got my first significant chip when I was fucking 16 purging the SCHOOL BATHROOM. it is so horrific and sad and I am sending so much love to all of you and hoping for healing.",
      "created_utc": 1680793202.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf7e5ak",
      "author": "ThankYourMedic",
      "body": "vomited in the shower and it got stuck in the plug hole so I had to push it down with my hands but it wouldn’t go down so I had to pick it up and transfer it to the toilet on the other side of the room .",
      "created_utc": 1680799320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf80kvr",
      "author": "kristine0711",
      "body": "I got a lip piercing (vertical labret) and the jewellery comes lose at times. Naturally it had to happen once while I was purging, and to make matters worse I didn’t have any extra. So what did I do? I went digging for it in the fucking toilet bowl… gave it one hell of a good cleaning, put it back on and ordered multiple backups so I wouldn’t have to do that shit again.\n\nAlso the obligatory throwing up blood. Not fun at all. \n\nBut the worst was probably when I collapsed in the waiting room at the doctors office due to electrolyte imbalances",
      "created_utc": 1680808070.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf93ji1",
      "author": "noonelikesUwhenUR23",
      "body": "I have $20,000 of medical debt from treatment lmao, horror story enough for you? I’ve also publicly shit myself and gotten vomit in my hair in public 😶",
      "created_utc": 1680824233.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfa6viv",
      "author": "Fluffykittty",
      "body": "Puking at a music festival in the gross at portopotties😂\n\nNot having a period for years but now mine is irregular af\n\nLately after 7 years, I’ve been feeling sick constantly, nauseous, light headed, my vision is almost constantly blurry, and I feel like I can’t breathe. Honestly the absolute worst few months of my life feeling like I’m dying",
      "created_utc": 1680844029.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfcisz9",
      "author": "Undercover-Loner",
      "body": "Shit myself while puking \nChest pain while puking (scary I thought I was gonna die with my head down the toilet) \nPeeling skin around chin from stomach acid (foundation making it looks worse and I’m a makeup girl!) \nToo many trips to local stores and too embarrassed to go in them at the moment \nGoing out with vomit splash back in my hair and on my clothes \nScooping vomit out my throat when it gets stuck (scary) mostly stuff like oats and PB do this.",
      "created_utc": 1680891209.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jff51em",
      "author": "Elen-gold",
      "body": "I was bingeing for 4 hours in a row and after some time I managed to fall asleep,despite the difficulty I had in breathing.\nSuddenly,I just woke up at 4:00 am,I was feeling my stomach like 'shaking' and I threw up on the floor a huge amount of undigested food.\nIt was the first time something like that happened to me.Not the worst story compared to the other ones I read in this forum, but to me it was so scary! \nI felt that my body was struggling so much to get rid of that extra food.\nThis disorder is so tormenting.",
      "created_utc": 1680939367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfjpduf",
      "author": "Several-Giraffe1930",
      "body": "Currently bulimic. going on 5 years. in those 5 years, i have probably kept down less than 10 “meals”. no exaggeration. i don’t even keep down water if i chug enough of it from being so thirsty. but i won’t purge a sugar free soda/energy drink. i have severe kidney issues which causes me to pee foamy, coke colored urine and sometimes blood even. potassium is life threateningly low (1.9-2.1), i’ve been hospitalized for it but deny i’m throwing up to the DEATH. i’m ashamed. my husband of 6 years doesn’t even know. i have severe anemia, bruise just by being touched, get questioned about my weight loss weekly which scares me, hair loss, but the bigger problem has been kidneys. it’s a serious problem and my god i wish i could stop, but my fear of gaining weight controls me.",
      "created_utc": 1681026652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jirp4oh",
      "author": "None",
      "body": "when i, a long time very passionate vegan for ethical reasons, binged a shit ton of stuff with dairy in it in my parent’s house bc i literally couldnt control myself. that was a wake up call because sacrificing my morals for an instantaneous selfish sensation is crossing a horrible line and i loathed myself 10x more than i normally do on binges",
      "created_utc": 1683159610.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jixw91u",
      "author": "Maddiesin",
      "body": "I clogged the toilet in a flat i shared with 2 other girls. ( of course my ed was my secret)  The toilet was so clogged that eventually we had to call a mechanic to come fix it for us. However, it took him 3 days to come and fix it. So for 3 days all of us had to use the toilets at friends houses or at the university. U cant imagine how much i hated myself for this. But hey, a clogged toilet couldnt stop my terrible b/p urges. So i decided to puke into a huge plastic bag in the bathroom ( toilet was in a seperate room) NOW COMES THE WORST PART\n\nBIG TRIGGER WARNING\n\nOne time I was ready to puke into the plastic bag... when my laxatives started kicking in. I PANICED SO HARD. Why was i that stupid... using laxs when u literally have NO toilet in your flat. Oh my god. I just took a bucket standing in the corner of the bathroom we usually used for cleaning... shat into it while I puked into that plastic bag and felt my soul just shatter into a thousend pieces. That was the most degrading moment of my life so far I think. When I was done I stood there in disbelieve what I just had done to myself. All of this.... for what?\nI put the bucket into the baf and zipped it. When I tried to snug out of the bathroom OF COURSE one of my flatmates saw me, looking at my with a questioning expression while I just awkwardly smiled at her.\nI walked down 5 floors with a bag full of shit and puke. Made it to the groundfloor where I finally gor rid of that bag, my pride and hope that Ill ever recover.\n\nThis happened 6 years ago. Im better now. Still not good though.\n\nPlease. Please please please. Seek help.",
      "created_utc": 1683277699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf5i50z",
      "author": "being-weird",
      "body": "Well, I've been sick for two weeks so far because I can't keep my meds down. I've already done two courses of antibiotics. Don't know what even happens after this.",
      "created_utc": 1680759605.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf60nax",
      "author": "None",
      "body": "Not any big horror story, but one time I purged in a public toilet. The cubicles were gross and not in good condition, and a few weeks later I got pin worms and I personally strongly believe I caught them from the public toilets.\n\n\nAlso going to school woth vomit in my hair.\n\n\nAlso, going from a bmi of 22 to 26.5 after struggling with my ed for ages",
      "created_utc": 1680775258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6bykg",
      "author": "icantaffordacabbage",
      "body": "Emotional horror = I was stealing my flatmates ice lolly’s for binges when I didn’t have food in the house and he realised and wrote a note on them 🫣\n\nPhysical horror = I now have terrible acid reflux and needed a gastroscopy to investigate it (don’t recommend) and take omeprazole daily 🥲",
      "created_utc": 1680782919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6fn9n",
      "author": "coffeeandascone",
      "body": "Gave myself a hiatal hernia after 17 years of purging. Basically part of my upper stomach has been squeezed through the hole in my diaphragm and it's stuck there. It makes it hard to fully swallow sometimes (especially pills for some reason), or I get severe pain sometimes in my lower chest from whatever is going wrong with it for a bit. It's a daily reminder when I take my meds and they get stuck.",
      "created_utc": 1680784899.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6tr2a",
      "author": "AdFull3965",
      "body": "I once laid on the floor puking and having diarrhea after b/p because I got hypoglycemic shock after puking when I was sitting on the toilet. Not fun to clean up. I’ve learn drinking to much sugar free drinks is the same as taking laxative…",
      "created_utc": 1680791299.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6vtax",
      "author": "pinkrynnn",
      "body": "• purged in hospital with a feeding tube in only for it to come out of my nose (burned so bad) \n\n• b/p nonstop for 8 hours+ and ate everything to the point where i was mixing greek yoghurt and slim fast shake powder\n\n• pissing myself whilst purging because of the effort\n\n• purging in a hotel room that i shared with my sleeping grandma\n\n• purging into a box that i kept under my wardrobe during recovery that i tried to empty mid b/p into diet coke cans that spilled all over my carpet which i then had to scoop with my hands into any available container",
      "created_utc": 1680792131.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6z9mr",
      "author": "SubtleVegan",
      "body": "Purging quickly before work and wearing a thong only to completely shit myself and need to shower",
      "created_utc": 1680793512.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf7vc43",
      "author": "ProofNewspaper2720",
      "body": "I purged into a plastic bag in the bathroom  of my college apartment. Don't remember why. The bag broke and I was unable to get the stain out of the carpet.\n\nA lot of my most shameful stories involve stealing because food was expensive and I manged to stuff my guilt down with more food.\n\nI lost my first job because I broke into a room in which Meals on Wheels supplies were stored.\n\nI stole from food shelf collection areas in random churches. Would walk right in when the church appeared quiet and snatch food.\n\nI stole from roommates, who were forced to padlock their snacks.\n\nI was arrested my final year of college because I broke into a locked dorm kitchen and stole food. Spent a night in jail. This was when I dropped out.\n\nOver a decade later I still feel ashamed and try not to dwell on it. I have a husband,  child, and successful freelance career now...occasional chew and spit episodes but I always pay for the food myself.",
      "created_utc": 1680805985.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf7vhq8",
      "author": "oohyeahgetitiguess",
      "body": "-going on a run but after 1 minute I ran to the store, stole food, and b/p in the bathroom. It was -10 out and showing and I still had to run the mile back to my car",
      "created_utc": 1680806045.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf8gv2w",
      "author": "missnastia",
      "body": "i have 7 cavities . even with expensive insurance it’ll be 500$ a tooth to fix it . oh , and a hiatal hernia",
      "created_utc": 1680814520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf8hj4t",
      "author": "lol_omg_sksk",
      "body": "Purging so much blood😭",
      "created_utc": 1680814784.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf8ix05",
      "author": "destinaaa",
      "body": "i had beautiful teeth and now they’re destroyed and eroding. i’m too embarrassed to see a dentist :(",
      "created_utc": 1680815347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf8lvcy",
      "author": "Miss-Bunnii",
      "body": "Threw up two palm sized jelly things. I freaked the fuck out for about an hour wondering what the hell just happened.\nTurns out it was the fibre appetite suppressants that swell in your stomach I had taken 5 hours prior. \nAlso surviving the 3am laxative induced cramps that have you sweating and begging for mercy on the toilet while your insides pour out… I don’t miss laxatives at all.",
      "created_utc": 1680816555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf8uhzf",
      "author": "rando1727728181",
      "body": "probably throwing up through my nose DAWG THAT SHIT IS TRAUMATIC!? legit felt like i was gonna die 😭",
      "created_utc": 1680820216.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf9ks1e",
      "author": "None",
      "body": "I had a realllly bad tonic-clonic seizure in the produce section of walmart, infront of a bunch of people.. Lost consciousness for just under 5 min, peed myself, gave myself a bad concussion and apparently went crazy and broke out of the gurney restraints while fighting the 5 paramedics until they could heavily sedate me(extreme aggression is normal after these kind of seizures). I blacked out for 8 hrs and woke up in the ER with no recollection of what happened. To top it all off I was hospitalized for a week until I was able to discharge myself against docs orders 🙃\n\nAnd yes, the seizure was caused by bulimia.. My blood sugar was extremely low and my electrolytes, vitamin and mineral levels were all totally out of whack and dangerously low.. I was forced to stay in the hospital until my blood sugar levels stabilized and they gave me several vitamin injections. I can honestly say that was the scariest thing I’ve ever experienced.. Not only my GP, but the neurologist and several others doctors at the hospital said that I was lucky to be alive.",
      "created_utc": 1680832134.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf9tcdg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1680836289.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfav79o",
      "author": "Deadman-ceo-ofifunny",
      "body": "One time I choked on vomit so I sat in the bathroom panicking bc I didn’t know how to do the Heimlich fun times",
      "created_utc": 1680863635.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfd21a0",
      "author": "soaphys",
      "body": "i babysit as a job since i’m not old enough for an actual job. i hate to say this but i have binged a total of 10 times in OTHER PEOPLES HOUSES. and even have thrown up 3 times IN OTHER PEOPLES BATHROOMS. it’s disgusting and i hate to talk about it.\n\n+i think 1 house knows what i did since i used to babysit there regularly, but after that day they never asked me again :/ makes me feel so shitty about myself",
      "created_utc": 1680899117.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfmedgb",
      "author": "Ddjawson",
      "body": "My landlord showing me his sump pump clogged with my vomit . He assumed I was pouring leftovers down the drain instead of in the garbage. English isn’t his first language and he’s in his 60s and probably doesn’t know bulimia exists and if I did tell him the truth he’d think I’m even more of an idiot than someone who pours food in the toilet intentionally.  So i agreed with the excuse he made for me and said I didn’t want the trash to smell. it sounds like I got off easy but I really wish he didn’t show me the the clog . My face gets hot just thinking about it",
      "created_utc": 1681076996.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jiifawu",
      "author": "None",
      "body": "not that bad but i accidentally stabbed my throat with my fingers once. Started bleeding a little.",
      "created_utc": 1682992495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jirpazd",
      "author": "None",
      "body": "also.. chewing and spitting in front of my friends when im too drunk to care :,)",
      "created_utc": 1683159688.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jm4cdja",
      "author": "likpinklady",
      "body": "Recently went to the beach with my partner. \nI’ve been super restricting lately, I don’t tend to binge, more just purge the like one meal I eat a day in the evening. He’d noticed and insisted I eat in this cafe. He bought me a kids meal. \n\nAfterwards I went into the arcade next to this cafe, there was one toilet, like one large bathroom thing. \nI went in to purge and the splashback was so bad, I got it all in my fringe/ bangs. I have like a full straight cut Betty bangs type thing going on. Got puke all in my hair. Spent 30 minutes purging and washing my hair in the sink and then trying to dry it under the hand dryer.. then I flushed and the toilet got blocked and the water and vomit poured out into the floor.. it didn’t go well. \n\nCame out and there was a queue of like 10 people waiting to use this one toilet. I look like shit, the bathroom floor is covered in water and puke. \n\nNever felt so humiliated.",
      "created_utc": 1685395270.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jxr5puw",
      "author": "RueJeanie",
      "body": "i purged in a sink while on a family holiday, ended up clogging it and in a panic used my dads razor to try to u clog it but i was holding it by the blade and cut my hand, the razor fell down the sink and i had to admit all of it to my parents while they unscrewed the whole sink to get the razor back. my hand was a bit fucked and i’ve never seen more dissapointed parents in my life :)",
      "created_utc": 1693001238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ki8ifsf",
      "author": "Hannarambe",
      "body": "One time I binged on a ton of food and was mid-binge frenzy and my senior dog fainted/had a seizure. He seemed to settle down but my mom and I rushed to get him in the car, and instead of going with to the vet I stayed home because I HAD to purge. My dog died and I didn’t get to say bye because I was busy vomiting,… because that was more important. That’s probably my guiltiest worst outcome from this illness. Other than that, vomit coming out of my nose, missing the toilet and getting it all over me, having to heave and like jump to get thicker food like bread out of me.. those experiences are always humbling. Plotting where you can purge and finding safe public restrooms and friends houses is depressing. I have been binging and purging on and off since I was 15, I turn 25 next year. I’ve done lots of therapy and treatments, and my symptoms are down to maybe once a month I relapse compared to daily. My eating disorder has always remained, but fluctuated as I stacked on drug addiction and abusive relationships. I literally don’t understand how I haven’t had more medical repercussions. I really have only experienced extreme weight loss, gain, some minor oral health issues, puffy face, fainting, exhaustion, dehydration, sore throat and the soft extra layers of hair that grow when you are underweight, and honestly I consider that lucky. My heart goes out to every one of these posts. I can’t even think about what medical issues I have that I don’t know about or will have when I get older, and I just pray everyone gets through this disease and can save themselves and heal. From drugs to this, I don’t wish bulimia on anyone and forever regret the day I managed to get myself to throw up. You can abstain from drugs, alcohol, sex… etc, anything with support and therapy, but food? You have to face that every day, forever. Bulimia fighters are the strongest people out there. Sending everyone hugs and strength. 🥺",
      "created_utc": 1705465826.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kymncau",
      "author": "Asleep_Coach430",
      "body": "I have had so many vile unforgettable experiences in this ed that have scared me into recovering and am hoping you can all find peace with food and your body, and not have to be threatened with the risks of bulimia in order to start getting help.\n\nObviously huge TW (very graphic and disgusting) Some of the worst stories I can remember were:\n- waking up on the bathroom floor staring at maggots who must’ve been attracted to the vomit (will never forget how this made me feel)\n- stealing food from my friends and money from my parents\n- binging on fish? The texture when I purged was grainy and tasted like chemicals\n- in my lowest I drank borax to get myself to throw up because my gag reflex had worn off. Do not ever do this. First of all It didn’t work. Second of all you’ll most likely die of poisoning. All that happened was my mouth and throat were burning for hours and I thought I was going to die - probably almost did. \n- having a spaghetti noodle stuck right in the back of my throat for what felt like hours and it wouldn’t come up or go down\n- have spent over $2000 in less than a year on binge food\n- have gained close to 60lbs in only 7 months\n- I’ve gotten Bursitis on my knee as a result of bulimia (painful swelling and inflammation of fluid-filled pads, called bursae, that act as cushions to the joints). Some of the worst pain I’ve ever felt. Doctors described it resembling how a dislocation feels. The pain was so gruesome I woke up screaming, fainted, and couldn’t walk for weeks\n\nI’m recovering currently after years of several eating disorders and never want to go back to that dark place.",
      "created_utc": 1712589291.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l63raen",
      "author": "col_der",
      "body": "Was house sitting/pet care sitting for a friend of a friend. Had a wild binge and purge episode, lots of back and forth trips to the pantry and fridge and bathroom. After it was ~ over ~ I sat on the couch to take a breather. They had a camera set up the whole time. Still have no clue what they’ve seen.",
      "created_utc": 1716942087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzg7e8m",
      "author": "Livdonna",
      "body": "Tbh I have too many to count & I’ll post more another time BUT something just happened last night that was embarrassing af.\n\nSo I came home from work and ordered $74 worth of food from Doordash to B/P on and I was at it for like 3 hours.  Well, I finished up and decided to go outside to smoke a cigarette (yeah idk now that’s become a thing with me - smoking after an episode 🤠).  \n\nAnyway, so it was like 9 at night and dark out and I was pretty disoriented after dehydrating myself to no end and I fucking tripped and fell outside, scraped my hand really Fuckin badly (like right near my knuckle) and a huge chunk of skin came off.  It started gushing blood & I mean GUSHING like so much that it dripped all the way down my arm & I looked like I came straight outta a horror movie.  So when I got back inside (mind you — I still fucking stayed out there to smoke with my hand gushing blood like a totally NORMAL person), I had to treat the big ass cut & because it was in such an awkward spot, the only way to keep the bandage staying on was to wrap my entire hand in medical tape.\n\nSooo needless to say, I can’t bend my hand at all now & practically every customer at work asked in horror WHAT HAPPENED TO YOUR HAND?!?  So I’ve had to make up this nonchalant “oh yeah I tripped cause I’m a klutz lol” \n\nBut like yeah… pretty sure this wouldn’t have happened if I wasn’t b/ping for three hours straight!!!  Don’t do it!",
      "created_utc": 1713046915.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4i85nk",
      "author": "Traditional-Tart1604",
      "body": "Probably coming home from work and binging and purging until 5am. Also low potassium, tearing my esophagus, clogging many a drain, a heart flutter plus chest pain and nearly passing out when I get up and try to walk. That last one is probably the one that scares me the worst \n\nOh, I also used to make this concoction and take appetite suppressants with it so that I could only fit so many calories into my stomach (a low amount per day) before my body decides to puke on its own from the irritation. After that I’d be in so much pain that I can’t go for a second round +. I just didn’t want to keep buying and eating so much food but it really wasn’t smart because my stomach issues got quite a bit worse at that time.",
      "created_utc": 1715977023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4i8m8x",
      "author": "Traditional-Tart1604",
      "body": "Oh, also I’m sure people will find this one part funny. If anyone remembers that South Park episode where they literally start shitting our do their mouthes, just know that that’s exactly what purging a box of thin mints is like",
      "created_utc": 1715977192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7qwaiy",
      "author": "Abonsell22",
      "body": "I struggle with addiction at the same time and Dr.’s said I thinned the lining of my stomach with drug use. Then had an ulcer from the bulimia burst and it tore a hole through my stomach lining so I went into septic shock and almost died. Had emergency stomach surgery and was in hospital for 10 days. As soon as I got home I began binging and purging with 20 staples in my stomach and in extreme pain. Caused an infection from the pull on all my staples. Can relate to many of the other horrors as well. Clogging showers, ruining plumbing system in the house, splashing vomit back in my face and broken blood vessels in eyes. I’ve had door dash come to my house 4x in one day on many occasions and I know my neighbors have to notice that plus me carrying in 4-5 bags of groceries on a DAILY basis . I shock myself at the levels of horrors I’m willing to subject myself to.",
      "created_utc": 1717891382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lb54qdc",
      "author": "None",
      "body": "Threw up clogged the toilet family members were waiting outside the washroom I took the vomit out with my bare hands and shoved it in a poopy diaper that was in the trash. It's disgusting I know...",
      "created_utc": 1719848980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhhpmzt",
      "author": "None",
      "body": "- clogging the toilet multiple times\n\n\n- projectile vomited and spent 10 whole minutes cleaning up the mess",
      "created_utc": 1723323009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf7py9d",
      "author": "None",
      "body": "I purged so many times I gave myself a tooth infection. Twice. In the same month. Last time I did it, my body also broke out into a giant chicken pox like rash. \n\nAnother one is when I purged my very expensive medication, so I picked it out and took it again 🙃",
      "created_utc": 1680803880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jft4ryk",
      "author": "Nearby_Button",
      "body": "A binge of $71 in ONE DAY",
      "created_utc": 1681207337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjtpmvp",
      "author": "None",
      "body": "Disgusting destroyed teeth. After years of laxative abuse, you take a guess how my bowels are lmao",
      "created_utc": 1683859275.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jli610d",
      "author": "m6ndaymay",
      "body": "You all deserve so much better than this.",
      "created_utc": 1684975991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo05k5m",
      "author": "depressedandbulimic",
      "body": "\n* took a shit in a toilet mid purging because nothing would come up and i was hoping the shit in the toilet would help me because it was disgusting – it didn’t help though – i was just kneeling over my turds\n\n* threw up out of my window and it all hit the wall so my mother had to repaint the wall\n\n* girlfriend found my vomit bucket under my bed\n\n* clogged the bathtub so i had to transfer the puke manually into the toilet",
      "created_utc": 1686671450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jodsmqx",
      "author": "Beforechrist-Anthrax",
      "body": "Throwing up through your nose\nGot done purging wiped my nose and I thought \n\"Is- Is that... fish? I didn't think that was possible but that's a bloody peice of fish\"",
      "created_utc": 1686941209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jodvazh",
      "author": "Beforechrist-Anthrax",
      "body": "I can no longer drink anything fizzy and most things I drink I unintentionally puke",
      "created_utc": 1686942349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jodvfqe",
      "author": "Beforechrist-Anthrax",
      "body": "The feeling of your fingers after Purging just nlo",
      "created_utc": 1686942405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jopxioi",
      "author": "None",
      "body": "Purging after I binged way too much because I was high and after I was done, I passed out in the washroom and got into my senses like an hour later 💀.",
      "created_utc": 1687191676.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ju32zf2",
      "author": "th3girlwithoceaneyes",
      "body": "threw up every day/night into the (same and reused) empty crisp packet for about 6 months and chucked the sick out of my window. my room smelt of sick 0/10 do not recommend",
      "created_utc": 1690732238.0,
      "score": 1,
      "context": []
    },
    {
      "id": "juq5whm",
      "author": "None",
      "body": "oh my god trying to purge after eating mexican food. never again will i ever be binging mexican food. at least tortillas. they ball up like glue and are just about the only thing i’ve had trouble with. i was mireble after i was so full to the point i was in so much pain and my back hurt so bad and i was pretty much rolling around on the floor crying all night it hurt so bad",
      "created_utc": 1691128612.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jyevw7y",
      "author": "anicaodha",
      "body": "My potassium got critically low 4 times and i was hospitalised for it. One time was placed in ressus to have my heart monitored and constant care in case it stopped.\n\nAll my front teeth are wearing away, i no longer smile with my teeth. Oh also lost two teeth due to damage.",
      "created_utc": 1693421577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kd57438",
      "author": "coffee--beans",
      "body": "Not really a nasty one but once I was purging at a restaurant and there was only one stall and urinal and whatever. A guy walked in and I panicked really hard lol and I was just like \"ummm um um sorry\" and he was like \"nah dw\" and left.\n\nIt went the best it could have, but I still feel really awkward about it",
      "created_utc": 1702444953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kd7f6i6",
      "author": "Necessary_Ad_743",
      "body": "I wasn’t allowed to use the restroom by myself so when I was able to purge I would stay in my room puke into plastic bags and hide them in a giant storage container in my closet. I opened my closet one day and saw a trail of ants going to and from. The smell lingered into the entire house and I knew exactly what it was when my mom asked what it was",
      "created_utc": 1702489210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgk3rc8",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1704527481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf61239",
      "author": "Spiritual_Worker3062",
      "body": "God that must have been a really fucking shit experience. And not finding it makes it even worse.",
      "created_utc": 1680775596.0,
      "score": 24,
      "context": [
        {
          "id": "jf4azf2",
          "author": "delstranger",
          "body": "I had a temporary fake tooth that was kinda loose in my head and would sometimes come off (bottom middle). I was binging and at some point realized the tooth was gone. I wasn’t set to have a permanent replacement for months, and it was an expensive fake. I decided I needed to purge into plastic bags, put gloves on, and go digging. Never did find it and went without that tooth for a while lol. Took a long hard look at myself that day",
          "created_utc": 1680737534.0
        }
      ]
    },
    {
      "id": "jf4jxed",
      "author": "None",
      "body": "jesus. christ.",
      "created_utc": 1680741594.0,
      "score": 37,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jf54bpo",
      "author": "Heatherrrbee",
      "body": "THIS. Purging peanut butter is the worst. But I love it (the peanut butter~ not purging)",
      "created_utc": 1680751122.0,
      "score": 35,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jf4891v",
      "author": "user565774",
      "body": "How long have you been purging before loosing your tooth ?",
      "created_utc": 1680736299.0,
      "score": 20,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jf9sj2e",
      "author": "sunsetsandbouquets",
      "body": "Omg same here!!!",
      "created_utc": 1680835876.0,
      "score": 3,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "m127gks",
      "author": "EmmaPinkscroll",
      "body": "Something very similar happened to me. At the beginning of 2023 I fell into a B/P cycle, for the entire 5 months I was binge eating and vomiting EVERY DAY. Finally the veins in my eye couldn't take it anymore. It didn't hurt but I felt very uncomfortable lying that I didn't know why it happened. It healed in 3 weeks and helped me \"get over it\" a bit and I stopped doing BP as often. I have a photo of this.",
      "created_utc": 1733680031.0,
      "score": 2,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "kzznjax",
      "author": "ShunsukeOtosaka69",
      "body": "What",
      "created_utc": 1713363590.0,
      "score": 1,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jf5zuv3",
      "author": "Spiritual_Worker3062",
      "body": "Fuck that’s horrible. Peanut butter is a real bitch, but bro the blood vessel. And the tooth and kidney failure. My teeth are basically rotting, breaking off, thinning, I don’t know when will they give up . Im so sorry you had to go through all that . I hope ur doing better xx",
      "created_utc": 1680774598.0,
      "score": 1,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jfys13z",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1681308814.0,
      "score": 1,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        }
      ]
    },
    {
      "id": "jf7vjrc",
      "author": "ProofNewspaper2720",
      "body": "Stole food so many times and also was caught quite often. I am still way more ashamed of that than the actual b/p.",
      "created_utc": 1680806067.0,
      "score": 7,
      "context": [
        {
          "id": "jf41prn",
          "author": "None",
          "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
          "created_utc": 1680733395.0
        }
      ]
    },
    {
      "id": "jf4f8lj",
      "author": "SirIzzy1",
      "body": "had a similar experience 🙃",
      "created_utc": 1680739476.0,
      "score": 5,
      "context": [
        {
          "id": "jf41prn",
          "author": "None",
          "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
          "created_utc": 1680733395.0
        }
      ]
    },
    {
      "id": "jf6kkcf",
      "author": "coldbrewkweeen",
      "body": "This happened to me and I was drunk to boot. Not a good time.",
      "created_utc": 1680787287.0,
      "score": 5,
      "context": [
        {
          "id": "jf41prn",
          "author": "None",
          "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
          "created_utc": 1680733395.0
        }
      ]
    },
    {
      "id": "jf4mo8v",
      "author": "jadeeeeeeeeeeeeeee",
      "body": "yup",
      "created_utc": 1680742842.0,
      "score": 2,
      "context": [
        {
          "id": "jf41prn",
          "author": "None",
          "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
          "created_utc": 1680733395.0
        }
      ]
    },
    {
      "id": "jf60u2o",
      "author": "Spiritual_Worker3062",
      "body": "And then you just stand there like. Wtf should I say?!?! When I got caught they were so bitchy about it, which I understand, but it was just some pastry xd anyway I just played dumb cuz I had no idea how to react . \nI heavily judged stealing anything, but over the course of my eating disorder I lost all my morality and became a skilled liar and thief. What a win.",
      "created_utc": 1680775414.0,
      "score": 2,
      "context": [
        {
          "id": "jf41prn",
          "author": "None",
          "body": "Probably getting caught shoplifting while I was young and unemployed and didn’t have the means to buy food 🤷‍♀️I was very good and sneaky for the time that I did do it (practically daily) but yea getting caught in the middle of my bulimia process was earth shattering and oh man oh man the shame",
          "created_utc": 1680733395.0
        }
      ]
    },
    {
      "id": "jf8xhem",
      "author": "wallace1313525",
      "body": "Gas station bathrooms are the worst 😵‍💫",
      "created_utc": 1680821531.0,
      "score": 9,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        }
      ]
    },
    {
      "id": "jfa4ywb",
      "author": "Fluffykittty",
      "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
      "created_utc": 1680842804.0,
      "score": 5,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        }
      ]
    },
    {
      "id": "jt3rnww",
      "author": "Mission-Couple5121",
      "body": "The last sentence I strongly relate to",
      "created_utc": 1690106752.0,
      "score": 2,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        }
      ]
    },
    {
      "id": "lgyv7yk",
      "author": "Specialist-Steak4385",
      "body": "Never related to anything more than this omg",
      "created_utc": 1723050731.0,
      "score": 1,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        }
      ]
    },
    {
      "id": "jfjpk9k",
      "author": "Several-Giraffe1930",
      "body": "same. hospitalized for severely low electrolytes and i denied bulimia til my face turned blue. continued to purge the hospital food while in the hospital",
      "created_utc": 1681026798.0,
      "score": 11,
      "context": [
        {
          "id": "jf4mkrw",
          "author": "turnipkitty112",
          "body": "Oh boy I’ve got so many…\n- being hospitalized for general mental health and they didn’t know about my purging so I b/ped on the psych ward and purged in the shower… shower got clogged, water level RAPIDLY rising, had to unclog this filthy shower with my hands while ankle deep in puke water\n- binging on a jar of natural peanut butter (nothing else) while staying at a friends house, purging in the shower… worst purge of my life, it wouldn’t come out and thought I was gonna die choking. \n- staying up literally all night multiple nights in a row (sleeping most of the day) b/ping 6 times a day and only leaving my apartment to go to the corner store in the middle of the night for food\n- going to said corner store 4x in one day and buying their ENTIRE stock of frozen apple pies (the cashier was confused 💀)\n- b/ping while hospitalized FOR my ED… staff were clueless. Most unhelpful IP experience of my life.\n- purging in a bush in the park in the middle of winter (I live in Canada btw) bc my parents made me eat a strawberry yogurt\n- and just in general over last fall/winter spending almost every night feeling like I was dying (I think it was hypoglycaemia +/- dehydration) and being 100% convinced that my family was going to find my dead body after weeks of not hearing from me (I was living alone) bc I dropped dead in front of the toilet. Dark times.",
          "created_utc": 1680742799.0
        }
      ]
    },
    {
      "id": "jf61xze",
      "author": "Spiritual_Worker3062",
      "body": "Purging in a public toilet feels desperate and shit, let alone this.. im so sorry",
      "created_utc": 1680776304.0,
      "score": 37,
      "context": [
        {
          "id": "jf4zho1",
          "author": "deifiedtoad",
          "body": "Peeing myself purging (in a public restroom) was an all time low.",
          "created_utc": 1680748730.0
        }
      ]
    },
    {
      "id": "jf63e4b",
      "author": "bb_lia",
      "body": "literally one of the worst feelings ever and its just so unnecessarily embarrassing 💔",
      "created_utc": 1680777422.0,
      "score": 6,
      "context": [
        {
          "id": "jf4zho1",
          "author": "deifiedtoad",
          "body": "Peeing myself purging (in a public restroom) was an all time low.",
          "created_utc": 1680748730.0
        }
      ]
    },
    {
      "id": "jgxps2p",
      "author": "Greggstyrone",
      "body": "Oof, thats rough. Big hug coming your way 🫂  I started at 15 and I'm 31 now. This comment unlocked my purge bag memories. We didn't have a lock on our bathroom door. It was the only way :') all my love dude. We will overcome and we will win the war that is bulimia.",
      "created_utc": 1681940889.0,
      "score": 4,
      "context": [
        {
          "id": "jf55con",
          "author": "beanswort",
          "body": "Oh geez where do I start. Massive TW obvious lmao.\n\nI've accidentally purged on an innocent bug while trying to throw up in a drain to a sump pump in my basement and drowned the fucker in vomit. RIP little man.\n\nAccidentally forgot where I stashed a vomit bag in my basement during COVID and found it almost a year later.  It looked like I was growing an alien specimen.\nI've also done this once in my bedroom closet but it only sat a few months.\n\nI've smuggled a shopping bag filled with smaller zip lock bags out of my house at 3am for a walk of shame to dispose of so no one in my house would catch me.  Well the fucking busted open in my garage bin and soaked it in vomit.  You could smell that shit outside my house for WEEKS.\n\nAlmost choked to death alone at my boyfriends house and dug my own throw up out of my throat thankfully. Scared the piss out of me. Proceeded to have a mental breakdown then binge and purge again later that night.\n\nBacked up plumbing at both my home so badly a plumber had to come in and unclog our pipes and it lead to my mom confronting me about \"being too lazy to walk downstairs to throw food out and not flushing it anymore.\"\n\nClogged my boyfriends shower tub.\n\nI had 17 cavities in one fucking year.\n\nIt's gotten so bad I'll randomly just upchuck if I eat too fast or eat food that doesn't agree with me. Laxative abuse had caused me to shit myself plenty of times. \n\nIt goes on and on and on.  I started at 15. I turn 25 in October.  Almost 10 years of this shit and I regret the day I finally figured out how to make myself purge.   I'll cry and purge and cry and purge, melt down and hold myself in the shower from the pain it causes me, yet I can't stop. I've suffered from strictly binging and restricting but I swear, bulimia is the worst, purging is the absolute fucking worst.\nI just got back from the bathroom. \nThere's nothing beautiful about this eating disorder.  I cannot glamorize it.  It mortifies me. My friends hate going out to eat with me. My boyfriend is terrified to leave me alone.",
          "created_utc": 1680751673.0
        }
      ]
    },
    {
      "id": "me8qs1t",
      "author": "imminentheartburn",
      "body": "Hope you’re doing better now 🖤",
      "created_utc": 1740263130.0,
      "score": 1,
      "context": [
        {
          "id": "jf54aqi",
          "author": "Awassya",
          "body": "So, so many. Some, but not all of the highlights would be:\n\n-c/s-ing and spilling the contents of the bag all over myself in public\n-passing out after flushing my stomach 4 times and cracking a tooth on the rim of the toilet\n-falling face first into the toilet mid purge since the floor of the bar restroom was slippery and I purge standing up and I wasn't even tipsy to blame it on, just clumsy\n-choking on binge food so bad I threw up involuntarily and then aspirated some of the vomit, making me choke again\n-tearing my esophagus multiple times in my life, stomach ulcers, 12 cavities, etc.\n-pouring bathroom cleaning products on binge food to stop eating it, eating it anyway and getting poisoned from it\n-throwing up my loved ones' and my own birthday cakes, crying in the bathroom every time it happens\n-at home tube feeding going several shades of wrong (chronically ill unrelated to my ED too and sometimes require it, long story)\n-dislocating my jaw trying to open it far enough so I don't stab myself in the throat with long nails\n\nAnd that's not even taking into account all the weird ass behaviours on the side. I wish I could stop - currently relapsing. I'm holding a candle of undying optimism that one day I'll be free of it. Hang in there.",
          "created_utc": 1680751108.0
        }
      ]
    },
    {
      "id": "jf4fp06",
      "author": "gaymofo666",
      "body": "and this is coming from a girl that has nipples pierced and gave birth. 😩",
      "created_utc": 1680739682.0,
      "score": 30,
      "context": [
        {
          "id": "jf4f01t",
          "author": "gaymofo666",
          "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
          "created_utc": 1680739370.0
        }
      ]
    },
    {
      "id": "jf61jne",
      "author": "Spiritual_Worker3062",
      "body": "Omg nooo I’m so sorry this sounds fuckinkg terrible. Im glad you made it to the hospital, but it’s heartbreaking to see how bulimia can destroy your body in soooo many ways. I m proud of you for fighting and making it through that and I really hope you’re doing better xx",
      "created_utc": 1680775986.0,
      "score": 11,
      "context": [
        {
          "id": "jf4f01t",
          "author": "gaymofo666",
          "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
          "created_utc": 1680739370.0
        }
      ]
    },
    {
      "id": "jf5sl8v",
      "author": "SquidneyClimbs",
      "body": "Wow I did not realize bulimia could cause pancreatitis !! So scary",
      "created_utc": 1680768139.0,
      "score": 9,
      "context": [
        {
          "id": "jf4f01t",
          "author": "gaymofo666",
          "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
          "created_utc": 1680739370.0
        }
      ]
    },
    {
      "id": "jf78e25",
      "author": "TinyStudio7881",
      "body": "Oh man yeah drugs and bulimia are a horrible combo. I've been really into ketamine and I took a huge line after a whole day of binging and purging. I don't understand how I survived that... I was so sure that I would die.",
      "created_utc": 1680797097.0,
      "score": 6,
      "context": [
        {
          "id": "jf46mem",
          "author": "jekyllcorvus",
          "body": "This is coming for the perspective of a 35 yr old male that’s been bulimic for 22 years and b/p several times a day for who knows how long. I’m also an alcoholic/addict in recovery. These things are not mutually exclusive. \n\nPhysically: \n\nI’m down to 113 pounds since I got into recovery four months ago. As a “seasoned” bulimic I’ve had fainting spells after purges, I get tired extremely easily, there are times we do breathing exercises and I feel like I barely breathe to begin with. I’m constantly light headed so standing up too fast sometimes gets to be a momentary blackout. My heart flutters and feels weak. I’ve felt the electrolyte imbalance drop and my body shake violently and sweat. From the age of 16 to 35 I’ve spent binging and purging (the drugs and alcohol another issue for another sub) and it’s a wonder how I’m still standing which leads to..\n\nMental: \n\nI’m down to 113 pounds and it’s worrisome because that’s a dangerously low amount and rationally I know this to be the case and in my sick bulimic brain I’m still stuck in my b/p cycle. I’m starting to seek help for it now while I can in my recovery program but it’s hard as hell because it’s such a lonely and isolating disease. \n\nThat’s my worst bulimia story. It’s an addiction like any other and it takes over your life. It’s called a silent killer for a very good reason.",
          "created_utc": 1680735566.0
        }
      ]
    },
    {
      "id": "jfa5xhn",
      "author": "Fluffykittty",
      "body": "I have the same health issues as u when it comes to not being able to breathe, fainting, heart issue and feeling sick a lot. I’ve been bulimic for 7 years. What do you do for your health condition cuz honestly I’m scared. I gained weight tho so I’m not sure why I’m not feeling any better. I gained 15 in a month and I still feel sicker and sicker every day",
      "created_utc": 1680843411.0,
      "score": 3,
      "context": [
        {
          "id": "jf46mem",
          "author": "jekyllcorvus",
          "body": "This is coming for the perspective of a 35 yr old male that’s been bulimic for 22 years and b/p several times a day for who knows how long. I’m also an alcoholic/addict in recovery. These things are not mutually exclusive. \n\nPhysically: \n\nI’m down to 113 pounds since I got into recovery four months ago. As a “seasoned” bulimic I’ve had fainting spells after purges, I get tired extremely easily, there are times we do breathing exercises and I feel like I barely breathe to begin with. I’m constantly light headed so standing up too fast sometimes gets to be a momentary blackout. My heart flutters and feels weak. I’ve felt the electrolyte imbalance drop and my body shake violently and sweat. From the age of 16 to 35 I’ve spent binging and purging (the drugs and alcohol another issue for another sub) and it’s a wonder how I’m still standing which leads to..\n\nMental: \n\nI’m down to 113 pounds and it’s worrisome because that’s a dangerously low amount and rationally I know this to be the case and in my sick bulimic brain I’m still stuck in my b/p cycle. I’m starting to seek help for it now while I can in my recovery program but it’s hard as hell because it’s such a lonely and isolating disease. \n\nThat’s my worst bulimia story. It’s an addiction like any other and it takes over your life. It’s called a silent killer for a very good reason.",
          "created_utc": 1680735566.0
        }
      ]
    },
    {
      "id": "jf69roa",
      "author": "Spiritual_Worker3062",
      "body": "Noo cuz the ibuprofen I usually take was the same. It’s very rare that I don’t get everything out, no matter the acidity, density etc. But bro I just couldn’t. But all of this sounds insanely traumatising and just horrible. I swear bulimia is like a drug addiction, takes away all your dignity, I hate it \nReally hope you are doing better but if not, dms are always open <3",
      "created_utc": 1680781671.0,
      "score": 7,
      "context": [
        {
          "id": "jf5rosl",
          "author": "AggressiveVisual7538",
          "body": "\n- picking out chunks of food in my purge and eating it ☹️\n- purging at school and getting caught \n- having bags of vomit in my room for weeks \n- passing out in my own vomit \n- unimaginable tooth pain and all the cavities \n- having people telling me i smell sick \n- shitting blood \n- purging my medication that desolves in ur stomach so i got to taste the most disgusting combination of vomit and chemicals the taste wouldn't leave my mouth it was horrible \n- clogging the shower drain",
          "created_utc": 1680767345.0
        }
      ]
    },
    {
      "id": "jf8yft3",
      "author": "wallace1313525",
      "body": "Honestly I accidentally spit my pills into a little bit of water and thought \"oh I'll just drink it\". WORST. DECISION. EVER. Tasted so horrible I can't get the feeling out of my mouth 😵‍💫",
      "created_utc": 1680821955.0,
      "score": 3,
      "context": [
        {
          "id": "jf5rosl",
          "author": "AggressiveVisual7538",
          "body": "\n- picking out chunks of food in my purge and eating it ☹️\n- purging at school and getting caught \n- having bags of vomit in my room for weeks \n- passing out in my own vomit \n- unimaginable tooth pain and all the cavities \n- having people telling me i smell sick \n- shitting blood \n- purging my medication that desolves in ur stomach so i got to taste the most disgusting combination of vomit and chemicals the taste wouldn't leave my mouth it was horrible \n- clogging the shower drain",
          "created_utc": 1680767345.0
        }
      ]
    },
    {
      "id": "lfn2yrr",
      "author": "Visible_Educator_737",
      "body": "Sorry to hear,  did you say you picked out food from your puke to eat it or did you write that wrong?",
      "created_utc": 1722343550.0,
      "score": 1,
      "context": [
        {
          "id": "jf5rosl",
          "author": "AggressiveVisual7538",
          "body": "\n- picking out chunks of food in my purge and eating it ☹️\n- purging at school and getting caught \n- having bags of vomit in my room for weeks \n- passing out in my own vomit \n- unimaginable tooth pain and all the cavities \n- having people telling me i smell sick \n- shitting blood \n- purging my medication that desolves in ur stomach so i got to taste the most disgusting combination of vomit and chemicals the taste wouldn't leave my mouth it was horrible \n- clogging the shower drain",
          "created_utc": 1680767345.0
        }
      ]
    },
    {
      "id": "jf56i2t",
      "author": "StockReporter5",
      "body": "and as a result lost my job and housing at the same time and had 5 hours to leave",
      "created_utc": 1680752294.0,
      "score": 15,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        }
      ]
    },
    {
      "id": "jf7uyup",
      "author": "oohyeahgetitiguess",
      "body": "How much did they catch you stealing?",
      "created_utc": 1680805839.0,
      "score": 1,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        }
      ]
    },
    {
      "id": "jf7v1ss",
      "author": "oohyeahgetitiguess",
      "body": "Cause I have gotten into very bad shoplifting habits",
      "created_utc": 1680805872.0,
      "score": 1,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        }
      ]
    },
    {
      "id": "kbg2vck",
      "author": "ImmediateCockroach51",
      "body": "omg…🥺",
      "created_utc": 1701373616.0,
      "score": 2,
      "context": [
        {
          "id": "jf758p2",
          "author": "Curious_Insurance694",
          "body": "While purging my parrot flew to me and fell into the toilet. \nI love my parrot.\nIt was horrible.",
          "created_utc": 1680795869.0
        }
      ]
    },
    {
      "id": "jf6912t",
      "author": "Spiritual_Worker3062",
      "body": "That’s just devastating to hear. Like you (and your wallet) hadn’t suffered enough already",
      "created_utc": 1680781222.0,
      "score": 2,
      "context": [
        {
          "id": "jf5tltv",
          "author": "None",
          "body": "My dental appointment today. 1k for fillings and other work due to acid damage. (I cannot afford this)",
          "created_utc": 1680769049.0
        }
      ]
    },
    {
      "id": "jf5lhlu",
      "author": "MiaMiaPP",
      "body": "Being truthful with people is never helpful in my experience. I’ve never been judged / embarrassed / abused more than for my ED.",
      "created_utc": 1680762169.0,
      "score": 13,
      "context": [
        {
          "id": "jf4lubs",
          "author": "Comfortable-Ebb-2859",
          "body": "Telling my mom I had multiple bulimic episodes and her exploding at me.\n\n“What is wrong with you?We’re paying for this treatment for you! Is this what they’re teaching you in therapy!? That you can eat whatever you want?? WHAT THE FUCK IS WRONG WITH YOU!?”\n\nAlso, one time I threw up and completely missed the toilet and getting puke all over the wall.",
          "created_utc": 1680742468.0
        }
      ]
    },
    {
      "id": "jf7w2g9",
      "author": "ProofNewspaper2720",
      "body": "My dad used to call my group therapy sessions \"puking parties\"",
      "created_utc": 1680806269.0,
      "score": 8,
      "context": [
        {
          "id": "jf4lubs",
          "author": "Comfortable-Ebb-2859",
          "body": "Telling my mom I had multiple bulimic episodes and her exploding at me.\n\n“What is wrong with you?We’re paying for this treatment for you! Is this what they’re teaching you in therapy!? That you can eat whatever you want?? WHAT THE FUCK IS WRONG WITH YOU!?”\n\nAlso, one time I threw up and completely missed the toilet and getting puke all over the wall.",
          "created_utc": 1680742468.0
        }
      ]
    },
    {
      "id": "jf6e3xm",
      "author": "Spiritual_Worker3062",
      "body": "The bping at your job💀💀💀i used to work at a bagel shop, we were preparing all the toppings, Id always volunteer to do that and Id binge on the toppings while I made them. Also would purposefully get the order wrong, so there was a free extra, which i took. Same when someone else made the mistake. All the scraps, leftovers, half spoiled, shit. Definitely didn’t ring up anything I ate, I wouldn’t have gotten any money if I did. And the “wow, you’re still eating“ “everytime I see you, you’re eating” “how do you stay skinny and eat this much”. Just embarrassing",
      "created_utc": 1680784094.0,
      "score": 8,
      "context": [
        {
          "id": "jf5k0pc",
          "author": "kleptokaja",
          "body": "Purging at two of my three jobs. I’m 17(turning 18 in 4 days), and work at an icecream store, taco restaurant, and as a part time babysitter every few weeks.\n\n I’ve binged and purged while I was supposed to be checking on the 7 year old I watch, and I still can’t get over how disgusting I feel and can’t begin to guess how I’d feel if they found out of the kid burned the house down while I’m making myself sick.\n\nAt the icecream store, I binged in front of my coworkers, and then purged in the bathroom. I thought I’d gotten away with it too but my manager looked at my eyes and said ‘are you okay?’ So I’m sure he sort of knew. \n\nI’m not too far in, but it still feels like an addiction that’s impossible to live without. I gave myself 4 cavities in 5 months. I purged even when I was recovering from wisdom teeth surgery, and have physically fought with my mom when she was trying to block me from food. \n\nIf any of you aren’t in too deep yet, please try your best to kick binging and purging.",
          "created_utc": 1680761021.0
        }
      ]
    },
    {
      "id": "jf7q0pk",
      "author": "S4MSTERD4M",
      "body": "God, i've had the vomit splashback in my eyes as well it's so humiliating & it fucking STINGS",
      "created_utc": 1680803907.0,
      "score": 4,
      "context": [
        {
          "id": "jf68bxo",
          "author": "serena_renee",
          "body": "•friend found a zip lock baggy in my glove compartment with vomit in it\n\n•just last week I purged a huge amount out and the vomit hit the toilet water so hard that it splashed back up and into my eyes\n\n•Purged in the shower and vomit clogged the drain so I had to get a cup and clean out vomit shower water myself\n\n•Took a walk to purge fresh out of rehab (it was late at night, couldn’t purge at home bc mom would know) was purging kind of back in some trees and then one of my friends dads saw me🤪🤪🤪",
          "created_utc": 1680780799.0
        }
      ]
    },
    {
      "id": "k65s76q",
      "author": "Designer_Fish_8578",
      "body": "I have adhd as well and have stopped taking my medication because I couldn’t handle the chemical test when purging",
      "created_utc": 1698095413.0,
      "score": 1,
      "context": [
        {
          "id": "jf5yh5z",
          "author": "Get-Shivved",
          "body": "Wasted a whole months worth of adhd medication because I kept purging them up (they were slow release so stuck around for like 12 hours of the day). Was wondering why they weren't working SMH",
          "created_utc": 1680773399.0
        }
      ]
    },
    {
      "id": "jf68kps",
      "author": "Spiritual_Worker3062",
      "body": "Ughhh you really went in head first 😭they way this disorder just takes over… i just really hope you get the help u need, it always just gets shittier. Best of luck xxx",
      "created_utc": 1680780950.0,
      "score": 3,
      "context": [
        {
          "id": "jf5w8i3",
          "author": "None",
          "body": "dug through my own vomit in the toilet, purged into my recycling bin multiple times bc the bathroom was occupied, stood over the toilet gagging for half an hour until i had tons of broken capillaries all around my eyes and scratched my throat bc nothing would come up. luckily no serious compilations or anything too bad yet but i’ve only been purging for a couple months so far so we’ll see (hoping to quit but yk how it goes)",
          "created_utc": 1680771397.0
        }
      ]
    },
    {
      "id": "lfnllb0",
      "author": "Visible_Educator_737",
      "body": "Glad to hear you’ve stuck with your recovery! Good job! ❤️🙂",
      "created_utc": 1722350312.0,
      "score": 2,
      "context": [
        {
          "id": "jfa6ix5",
          "author": "valerienorma",
          "body": "Both retinas detaching and perforated, unusual at 29, didn’t have any recent head injuries which could have explained it, ophthalmologist said likely from the repeated pressure from purging.  I hadn’t had my eyes dilated and photographed since before I was bulimic (approx 6 years prior) and there was no sign of this in the previous exam. Could have become blind. Had procedures on my eyes for about 6 months after. \n\nOh and $10 000 in dental work shortly after. \n\nI’ve been in recovery for about one year, I’ve gained weight, sometimes feel out of control and I feel uncomfortable and unsure of my self some days without my old coping mechanism around, but every pound is fine if I still have my vision.",
          "created_utc": 1680843798.0
        }
      ]
    },
    {
      "id": "jonvc7t",
      "author": "Lopsided_Pop9674",
      "body": "Oh god, that is awful, i'm sorry. I'm worried too, I've damaged my bones and spine somehow from doing  it for so long, cause I have a permanent slouch/pain...Can't find much on the web which is equally worrying me.",
      "created_utc": 1687144992.0,
      "score": 1,
      "context": [
        {
          "id": "jf69eh2",
          "author": "Safetychick92",
          "body": "I’m 31 and my bones are shot. My spine is curved now and my knees and hips kill. I work a physically demanding job at an oil refinery and everyday is a struggle.",
          "created_utc": 1680781452.0
        }
      ]
    },
    {
      "id": "jfmrjfg",
      "author": "Several-Giraffe1930",
      "body": "same with the low K. hospitalized 4 times for it. level was between 1.9-2.1 each time. i still denied bulimia to the death. but everyone fucking knew. i know it",
      "created_utc": 1681082914.0,
      "score": 3,
      "context": [
        {
          "id": "jf6bivf",
          "author": "NatalieALx",
          "body": "i ended up in hospital with dangerously low potassium levels, was basically about to have a heart attack and die. had to have it corrected with ivs. i feel like it’s probably quite common but what’s so scary about it is that you literally don’t know like mine was caught as a result of having routine bloods for another issue but if i hadn’t had that maybe i wouldn’t be typing this now. \n\ni also used to purge using objects rather than hands/fingers which my therapist was always incredibly worried about as i almost swallowed said objects/choked on multiple occasions. \n\npurged in public places many a time, which always felt like hitting a new low, i always tried not to do it at friends houses though. \n\neye blood vessels popping and then going to the opticians a while after but it still being noticeable and having them ask if i knew what caused it as they’d never seen it before… which is just like really awkward.",
          "created_utc": 1680782681.0
        }
      ]
    },
    {
      "id": "jf8zaiu",
      "author": "wallace1313525",
      "body": "I'm glad you don't brush right after; Try swishing your mouth with baking soda and water. It's basic and should neutralize the acid!",
      "created_utc": 1680822344.0,
      "score": 2,
      "context": [
        {
          "id": "jf7u2ep",
          "author": "Kind-Resident-3460",
          "body": "My long term bulimia has caused ATROCIOUS oral health. I've had 11 cavities at one time and I've had full dental work to fix/fill those cavities. Since then, I have regained cavities in the EXACT same places as my fillings.... I currently have no dental insurance (in the US) and have basically no money to fix/fill these cavities. So now I'm forced to deal with the fact that I may lose MULTIPLE back teeth (which are obviously needed for chewing food) simply due to the fact that I'm bulimic and refuse to brush my teeth after vomiting (because I want to avoid brushing leftover acid on my teeth). So, basically, bulimia DESTROYS teeth and prolonged bulimia may cost you THOUSANDS of dollars just to \"upkeep\"",
          "created_utc": 1680805488.0
        }
      ]
    },
    {
      "id": "jf6a3ek",
      "author": "Spiritual_Worker3062",
      "body": "That must have been awful, so much suffering for making yourself suffer more. The ed is ed-ing",
      "created_utc": 1680781865.0,
      "score": 1,
      "context": [
        {
          "id": "jf5lsjq",
          "author": "kilobytess",
          "body": "i used to take old antibiotics without food and fuck my system up for a day or two. easy excuse to fast after a binge",
          "created_utc": 1680762411.0
        }
      ]
    },
    {
      "id": "jf9lr0j",
      "author": "None",
      "body": "Omg I relateee lol I was at a fancy restaurant at a staff party and I got vomit on my white pants.. Tried scrubbing it out but just ended up with a huge stain and wet patch on my pant leg, also absolutely wreaked of puke when I went back to the table😭",
      "created_utc": 1680832596.0,
      "score": 2,
      "context": [
        {
          "id": "jf93ji1",
          "author": "noonelikesUwhenUR23",
          "body": "I have $20,000 of medical debt from treatment lmao, horror story enough for you? I’ve also publicly shit myself and gotten vomit in my hair in public 😶",
          "created_utc": 1680824233.0
        }
      ]
    },
    {
      "id": "jfys065",
      "author": "Fluffykittty",
      "body": "What has  been your kidney issues. Mine lately has been pressure on the kidneys, dull back pain that keeps me up at night and constantly nausea, extreme fatigue . But the doctors said I don’t have a kidney infection so could it be flat out failure",
      "created_utc": 1681308803.0,
      "score": 1,
      "context": [
        {
          "id": "jfjpduf",
          "author": "Several-Giraffe1930",
          "body": "Currently bulimic. going on 5 years. in those 5 years, i have probably kept down less than 10 “meals”. no exaggeration. i don’t even keep down water if i chug enough of it from being so thirsty. but i won’t purge a sugar free soda/energy drink. i have severe kidney issues which causes me to pee foamy, coke colored urine and sometimes blood even. potassium is life threateningly low (1.9-2.1), i’ve been hospitalized for it but deny i’m throwing up to the DEATH. i’m ashamed. my husband of 6 years doesn’t even know. i have severe anemia, bruise just by being touched, get questioned about my weight loss weekly which scares me, hair loss, but the bigger problem has been kidneys. it’s a serious problem and my god i wish i could stop, but my fear of gaining weight controls me.",
          "created_utc": 1681026652.0
        }
      ]
    },
    {
      "id": "jf6eh6p",
      "author": "Spiritual_Worker3062",
      "body": "Ahhh that sounds like shit, im so sorry. i have my mom give me my morning meds, a few hours before I get up, so I dont throw it up. Maybe if you set an alarm for before you get up?",
      "created_utc": 1680784289.0,
      "score": 1,
      "context": [
        {
          "id": "jf5i50z",
          "author": "being-weird",
          "body": "Well, I've been sick for two weeks so far because I can't keep my meds down. I've already done two courses of antibiotics. Don't know what even happens after this.",
          "created_utc": 1680759605.0
        }
      ]
    },
    {
      "id": "jf8azh7",
      "author": "Axxeptance",
      "body": "Just wanted to let you know just incase drs haven’t told you, that long term use of omeprazole can cause osteoporosis and gallstones amongst other things. Famotadine is seen as generally less risky now for long term use. They didn’t tell me until one Dr took me off it because I’d been on it for years.",
      "created_utc": 1680812181.0,
      "score": 5,
      "context": [
        {
          "id": "jf6bykg",
          "author": "icantaffordacabbage",
          "body": "Emotional horror = I was stealing my flatmates ice lolly’s for binges when I didn’t have food in the house and he realised and wrote a note on them 🫣\n\nPhysical horror = I now have terrible acid reflux and needed a gastroscopy to investigate it (don’t recommend) and take omeprazole daily 🥲",
          "created_utc": 1680782919.0
        }
      ]
    },
    {
      "id": "lchj1cx",
      "author": "GlitteringAd3056",
      "body": "Bit of an invasion of privacy. I know it's not the point but I would refuse to stay in an air bnb that had cameras in each room, yuck!",
      "created_utc": 1720603995.0,
      "score": 1,
      "context": [
        {
          "id": "jf9tcdg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1680836289.0
        }
      ]
    },
    {
      "id": "ki8ipza",
      "author": "Hannarambe",
      "body": "Also forgot honorable mentions of wrecking my car speeding to get food, 100s of $ in food wasted, lying to everyone around me, and eating my housemates food and having them confront me about it and just think the worst of me 🙏🏻😊 worst mental illness and you can’t even justify the things you do or use it as an excuse but all of these actions are crazed under the control of the disorder.",
      "created_utc": 1705465955.0,
      "score": 1,
      "context": [
        {
          "id": "ki8ifsf",
          "author": "Hannarambe",
          "body": "One time I binged on a ton of food and was mid-binge frenzy and my senior dog fainted/had a seizure. He seemed to settle down but my mom and I rushed to get him in the car, and instead of going with to the vet I stayed home because I HAD to purge. My dog died and I didn’t get to say bye because I was busy vomiting,… because that was more important. That’s probably my guiltiest worst outcome from this illness. Other than that, vomit coming out of my nose, missing the toilet and getting it all over me, having to heave and like jump to get thicker food like bread out of me.. those experiences are always humbling. Plotting where you can purge and finding safe public restrooms and friends houses is depressing. I have been binging and purging on and off since I was 15, I turn 25 next year. I’ve done lots of therapy and treatments, and my symptoms are down to maybe once a month I relapse compared to daily. My eating disorder has always remained, but fluctuated as I stacked on drug addiction and abusive relationships. I literally don’t understand how I haven’t had more medical repercussions. I really have only experienced extreme weight loss, gain, some minor oral health issues, puffy face, fainting, exhaustion, dehydration, sore throat and the soft extra layers of hair that grow when you are underweight, and honestly I consider that lucky. My heart goes out to every one of these posts. I can’t even think about what medical issues I have that I don’t know about or will have when I get older, and I just pray everyone gets through this disease and can save themselves and heal. From drugs to this, I don’t wish bulimia on anyone and forever regret the day I managed to get myself to throw up. You can abstain from drugs, alcohol, sex… etc, anything with support and therapy, but food? You have to face that every day, forever. Bulimia fighters are the strongest people out there. Sending everyone hugs and strength. 🥺",
          "created_utc": 1705465826.0
        }
      ]
    },
    {
      "id": "l63xg8k",
      "author": "Spiritual_Worker3062",
      "body": "Oh shit i am so sorry, such an uncomfortable situation. Getting the urge at other people’s houses… not fun",
      "created_utc": 1716944537.0,
      "score": 1,
      "context": [
        {
          "id": "l63raen",
          "author": "col_der",
          "body": "Was house sitting/pet care sitting for a friend of a friend. Had a wild binge and purge episode, lots of back and forth trips to the pantry and fridge and bathroom. After it was ~ over ~ I sat on the couch to take a breather. They had a camera set up the whole time. Still have no clue what they’ve seen.",
          "created_utc": 1716942087.0
        }
      ]
    },
    {
      "id": "kgkfjq3",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1704536327.0,
      "score": 1,
      "context": [
        {
          "id": "kgk3rc8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704527481.0
        }
      ]
    },
    {
      "id": "jf690be",
      "author": "Safetychick92",
      "body": "Definitely have done the bags. Keeping them in my closet till garbage day.",
      "created_utc": 1680781209.0,
      "score": 18,
      "context": [
        {
          "id": "jf4azf2",
          "author": "delstranger",
          "body": "I had a temporary fake tooth that was kinda loose in my head and would sometimes come off (bottom middle). I was binging and at some point realized the tooth was gone. I wasn’t set to have a permanent replacement for months, and it was an expensive fake. I decided I needed to purge into plastic bags, put gloves on, and go digging. Never did find it and went without that tooth for a while lol. Took a long hard look at myself that day",
          "created_utc": 1680737534.0
        },
        {
          "id": "jf61239",
          "author": "Spiritual_Worker3062",
          "body": "God that must have been a really fucking shit experience. And not finding it makes it even worse.",
          "created_utc": 1680775596.0
        }
      ]
    },
    {
      "id": "lqwg0y2",
      "author": "Queenofwands1212",
      "body": "Why is it so fucked up to purge it ? :( is there something in harm reduction that could lessen the severity of purging nut butter?",
      "created_utc": 1728367621.0,
      "score": 1,
      "context": [
        {
          "id": "jf3yqhn",
          "author": "graamatvede",
          "body": "alright. once binged on peanut butter. it got stuck in my throat when i tried to purge, and blood vessels in my eyes broke, making several red spots in my eyewhites. I looked like from a horror movie. then, lost my front tooth from the amount of acid. have vomitted blood. had kidney failure.",
          "created_utc": 1680732112.0
        },
        {
          "id": "jf54bpo",
          "author": "Heatherrrbee",
          "body": "THIS. Purging peanut butter is the worst. But I love it (the peanut butter~ not purging)",
          "created_utc": 1680751122.0
        }
      ]
    },
    {
      "id": "jodtyev",
      "author": "Beforechrist-Anthrax",
      "body": "But you Purge anyway because then it makes you feel more nauseous",
      "created_utc": 1686941771.0,
      "score": 3,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jf8xhem",
          "author": "wallace1313525",
          "body": "Gas station bathrooms are the worst 😵‍💫",
          "created_utc": 1680821531.0
        }
      ]
    },
    {
      "id": "jfapg97",
      "author": "sunsetsandbouquets",
      "body": "Same. I feel like I’m having a heart attack",
      "created_utc": 1680858731.0,
      "score": 2,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jfa4ywb",
          "author": "Fluffykittty",
          "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
          "created_utc": 1680842804.0
        }
      ]
    },
    {
      "id": "jfdit5q",
      "author": "5star-my-notebook",
      "body": "Going for light walks has helped with the feeling like I can’t breathe, because it gets more oxygen flowing throughout my body (I have high CO2 due to low Chloride, which is an electrolyte). With fainting, I get up slowly and I make myself sit down and consume something with sugar if I start to feel lightheaded. I don’t really have much good advice, unfortunately. I’m young so I’ve been mostly fortunate with a lack of physical consequences for my actions",
      "created_utc": 1680906248.0,
      "score": 2,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jfa4ywb",
          "author": "Fluffykittty",
          "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
          "created_utc": 1680842804.0
        }
      ]
    },
    {
      "id": "jf6qdji",
      "author": "deifiedtoad",
      "body": "Thank you, I've been free from bulimia for a year and a half now, and am doing very well. :)",
      "created_utc": 1680789890.0,
      "score": 8,
      "context": [
        {
          "id": "jf4zho1",
          "author": "deifiedtoad",
          "body": "Peeing myself purging (in a public restroom) was an all time low.",
          "created_utc": 1680748730.0
        },
        {
          "id": "jf61xze",
          "author": "Spiritual_Worker3062",
          "body": "Purging in a public toilet feels desperate and shit, let alone this.. im so sorry",
          "created_utc": 1680776304.0
        }
      ]
    },
    {
      "id": "jf6x69a",
      "author": "gaymofo666",
      "body": "yeah it was hell, but I'm better now and scared of purging again. because it happened again after the first time.",
      "created_utc": 1680792676.0,
      "score": 4,
      "context": [
        {
          "id": "jf4f01t",
          "author": "gaymofo666",
          "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
          "created_utc": 1680739370.0
        },
        {
          "id": "jf61jne",
          "author": "Spiritual_Worker3062",
          "body": "Omg nooo I’m so sorry this sounds fuckinkg terrible. Im glad you made it to the hospital, but it’s heartbreaking to see how bulimia can destroy your body in soooo many ways. I m proud of you for fighting and making it through that and I really hope you’re doing better xx",
          "created_utc": 1680775986.0
        }
      ]
    },
    {
      "id": "jf61pi5",
      "author": "Spiritual_Worker3062",
      "body": "One of the reasons I posted this is to show that the list of consequences are so much longer than you’d expect, it fucking sucks",
      "created_utc": 1680776114.0,
      "score": 18,
      "context": [
        {
          "id": "jf4f01t",
          "author": "gaymofo666",
          "body": "soo one day I went on a party and wanted to purge the meal I ate before... I had a stomach ache which wasn't that unusual after a purge. I brushed it off and continued to drink and smoke weed. I went to my friends house but the stomach pain was getting worse, even with laying down. it was unbearable, then I started puking more and more. couldn't walk... they rushed me into the hospital, i had hypothermia but they had no idea what it was, yet. I blacked out after getting IUV and pain meds. I slept for a few days not knowing what happened, but I had pancreatitis which led to sepsis and I wasn't allowed to eat for 2 weeks. It was the most excruciating pain in my life.",
          "created_utc": 1680739370.0
        },
        {
          "id": "jf5sl8v",
          "author": "SquidneyClimbs",
          "body": "Wow I did not realize bulimia could cause pancreatitis !! So scary",
          "created_utc": 1680768139.0
        }
      ]
    },
    {
      "id": "lfhhbi1",
      "author": "itstanyaxx",
      "body": "I know this is a while ago, and I hope you are doing better. I was bulimic for 6 years and its been 2 months of recovery and low on iron, vitamin D lots of infections in my mouth, always got sick with flus,  colds and anything that was going around I got it. 3 UTI'S in the space of 2.5 months since I decided to recover and I am already  noticing small changes and it's only been 2 months on Thursday and some days are harder than others but with being positive I know recovery is possible and reading others stories from their recovery I know it is possible. I have palpitations, racing heart at times but i used to feel it 24/7 now it is becoming less and less. My iron was critically low for a while coming up over a year but at first I fainted, felt weak that even walking felt like I was dragging my body and feeling like I would never wake up if I b/p again, and one day I just decided I needed to recover or else things could get worse fast if I didn't decide their and then that I wanted to healthy instead of the fear that my loved ones will soon have to witness and Bury me which is what ultimately led me to decide to recover. My point in all this is as hard as it is, recovery is possible, and my motto is taking it hour by hour, day by day but if I can do it, believe me you can too. Sending so much love and hugs. X\n\nI focus on eating 3 meals a day, and snacks as and when i needed to fuel my body. I still haven't got ym appetite back but i'm trying to nourish my body again, sipping 2 litres of water everyday, my kidneys badly needed plenty of hydration after all the abuse I put it through,  started probiotics for my gut and also my woman's area for the uti's, started the gym but going because I want to heal my body not abuse it. Stopped taking any  unnecessary pain medications because the longer I am in recovery I realised I am not in much pain as I once was, and if I am in pain I try alternatives for it before I resort to pain medications like hot water bottles, acupressure, yoga and all the natural stuff as possible and if all else fails then I will allow myself to take pain pills then. Its all a learning thing and learning to trust my own instincts.\nI am nowhere near done yet as I still have joint pain, still low in Vitamin D and Iron but i am working towards healing and with the help of my GP, and pyschiatry team I am so much closer than I was before I started recovery.\nP.s. All the symptoms whilst i was thick in bulimia was scary but I didn't care because I also was very depressed and anxious especially in regards to the health of others ironically not myself. But in recovery, I put myself first for once because I can't help others if I am sick. What helps me also in recovery is how I want to become a registered nurse in the near future as a focus and motivation to get better and a nurse that focuses on eating disorder recovery to help others who been through the same things I have.",
      "created_utc": 1722260040.0,
      "score": 1,
      "context": [
        {
          "id": "jf46mem",
          "author": "jekyllcorvus",
          "body": "This is coming for the perspective of a 35 yr old male that’s been bulimic for 22 years and b/p several times a day for who knows how long. I’m also an alcoholic/addict in recovery. These things are not mutually exclusive. \n\nPhysically: \n\nI’m down to 113 pounds since I got into recovery four months ago. As a “seasoned” bulimic I’ve had fainting spells after purges, I get tired extremely easily, there are times we do breathing exercises and I feel like I barely breathe to begin with. I’m constantly light headed so standing up too fast sometimes gets to be a momentary blackout. My heart flutters and feels weak. I’ve felt the electrolyte imbalance drop and my body shake violently and sweat. From the age of 16 to 35 I’ve spent binging and purging (the drugs and alcohol another issue for another sub) and it’s a wonder how I’m still standing which leads to..\n\nMental: \n\nI’m down to 113 pounds and it’s worrisome because that’s a dangerously low amount and rationally I know this to be the case and in my sick bulimic brain I’m still stuck in my b/p cycle. I’m starting to seek help for it now while I can in my recovery program but it’s hard as hell because it’s such a lonely and isolating disease. \n\nThat’s my worst bulimia story. It’s an addiction like any other and it takes over your life. It’s called a silent killer for a very good reason.",
          "created_utc": 1680735566.0
        },
        {
          "id": "jfa5xhn",
          "author": "Fluffykittty",
          "body": "I have the same health issues as u when it comes to not being able to breathe, fainting, heart issue and feeling sick a lot. I’ve been bulimic for 7 years. What do you do for your health condition cuz honestly I’m scared. I gained weight tho so I’m not sure why I’m not feeling any better. I gained 15 in a month and I still feel sicker and sicker every day",
          "created_utc": 1680843411.0
        }
      ]
    },
    {
      "id": "lgroy73",
      "author": "AggressiveVisual7538",
      "body": "Nope, i did just that. Not proud of it but yk",
      "created_utc": 1722951114.0,
      "score": 2,
      "context": [
        {
          "id": "jf5rosl",
          "author": "AggressiveVisual7538",
          "body": "\n- picking out chunks of food in my purge and eating it ☹️\n- purging at school and getting caught \n- having bags of vomit in my room for weeks \n- passing out in my own vomit \n- unimaginable tooth pain and all the cavities \n- having people telling me i smell sick \n- shitting blood \n- purging my medication that desolves in ur stomach so i got to taste the most disgusting combination of vomit and chemicals the taste wouldn't leave my mouth it was horrible \n- clogging the shower drain",
          "created_utc": 1680767345.0
        },
        {
          "id": "lfn2yrr",
          "author": "Visible_Educator_737",
          "body": "Sorry to hear,  did you say you picked out food from your puke to eat it or did you write that wrong?",
          "created_utc": 1722343550.0
        }
      ]
    },
    {
      "id": "jf91nr5",
      "author": "StockReporter5",
      "body": "$34 of food, but it was at a really expensive touristy general store bc of where i was working/living so it wasn’t as much food as it sounds like… still a lot tho let’s be real",
      "created_utc": 1680823392.0,
      "score": 3,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        },
        {
          "id": "jf7uyup",
          "author": "oohyeahgetitiguess",
          "body": "How much did they catch you stealing?",
          "created_utc": 1680805839.0
        }
      ]
    },
    {
      "id": "jf7ebsa",
      "author": "None",
      "body": "For the love of all things holy… take care of your teeth. I do have a GoFundMe, but things are looking grim.",
      "created_utc": 1680799391.0,
      "score": 3,
      "context": [
        {
          "id": "jf5tltv",
          "author": "None",
          "body": "My dental appointment today. 1k for fillings and other work due to acid damage. (I cannot afford this)",
          "created_utc": 1680769049.0
        },
        {
          "id": "jf6912t",
          "author": "Spiritual_Worker3062",
          "body": "That’s just devastating to hear. Like you (and your wallet) hadn’t suffered enough already",
          "created_utc": 1680781222.0
        }
      ]
    },
    {
      "id": "jf7wix2",
      "author": "ProofNewspaper2720",
      "body": "A few understanding people exist. The rare times you find them, hang on for dear life.\n\nMy husband is one. He has always accepted me. Hides junk food or takes it to work with him so I can treat myself in moderation. Tells me I am beautiful when I am obviously bloated.",
      "created_utc": 1680806446.0,
      "score": 4,
      "context": [
        {
          "id": "jf4lubs",
          "author": "Comfortable-Ebb-2859",
          "body": "Telling my mom I had multiple bulimic episodes and her exploding at me.\n\n“What is wrong with you?We’re paying for this treatment for you! Is this what they’re teaching you in therapy!? That you can eat whatever you want?? WHAT THE FUCK IS WRONG WITH YOU!?”\n\nAlso, one time I threw up and completely missed the toilet and getting puke all over the wall.",
          "created_utc": 1680742468.0
        },
        {
          "id": "jf5lhlu",
          "author": "MiaMiaPP",
          "body": "Being truthful with people is never helpful in my experience. I’ve never been judged / embarrassed / abused more than for my ED.",
          "created_utc": 1680762169.0
        }
      ]
    },
    {
      "id": "jf7w4ut",
      "author": "Comfortable-Ebb-2859",
      "body": "Holy shit",
      "created_utc": 1680806296.0,
      "score": 3,
      "context": [
        {
          "id": "jf4lubs",
          "author": "Comfortable-Ebb-2859",
          "body": "Telling my mom I had multiple bulimic episodes and her exploding at me.\n\n“What is wrong with you?We’re paying for this treatment for you! Is this what they’re teaching you in therapy!? That you can eat whatever you want?? WHAT THE FUCK IS WRONG WITH YOU!?”\n\nAlso, one time I threw up and completely missed the toilet and getting puke all over the wall.",
          "created_utc": 1680742468.0
        },
        {
          "id": "jf7w2g9",
          "author": "ProofNewspaper2720",
          "body": "My dad used to call my group therapy sessions \"puking parties\"",
          "created_utc": 1680806269.0
        }
      ]
    },
    {
      "id": "jf847pt",
      "author": "None",
      "body": "yeah it went downhill fast 🥲 thank u love <3",
      "created_utc": 1680809509.0,
      "score": 1,
      "context": [
        {
          "id": "jf5w8i3",
          "author": "None",
          "body": "dug through my own vomit in the toilet, purged into my recycling bin multiple times bc the bathroom was occupied, stood over the toilet gagging for half an hour until i had tons of broken capillaries all around my eyes and scratched my throat bc nothing would come up. luckily no serious compilations or anything too bad yet but i’ve only been purging for a couple months so far so we’ll see (hoping to quit but yk how it goes)",
          "created_utc": 1680771397.0
        },
        {
          "id": "jf68kps",
          "author": "Spiritual_Worker3062",
          "body": "Ughhh you really went in head first 😭they way this disorder just takes over… i just really hope you get the help u need, it always just gets shittier. Best of luck xxx",
          "created_utc": 1680780950.0
        }
      ]
    },
    {
      "id": "lfnsjzr",
      "author": "valerienorma",
      "body": "Thanks :)",
      "created_utc": 1722352589.0,
      "score": 1,
      "context": [
        {
          "id": "jfa6ix5",
          "author": "valerienorma",
          "body": "Both retinas detaching and perforated, unusual at 29, didn’t have any recent head injuries which could have explained it, ophthalmologist said likely from the repeated pressure from purging.  I hadn’t had my eyes dilated and photographed since before I was bulimic (approx 6 years prior) and there was no sign of this in the previous exam. Could have become blind. Had procedures on my eyes for about 6 months after. \n\nOh and $10 000 in dental work shortly after. \n\nI’ve been in recovery for about one year, I’ve gained weight, sometimes feel out of control and I feel uncomfortable and unsure of my self some days without my old coping mechanism around, but every pound is fine if I still have my vision.",
          "created_utc": 1680843798.0
        },
        {
          "id": "lfnllb0",
          "author": "Visible_Educator_737",
          "body": "Glad to hear you’ve stuck with your recovery! Good job! ❤️🙂",
          "created_utc": 1722350312.0
        }
      ]
    },
    {
      "id": "jfocma0",
      "author": "NatalieALx",
      "body": "yeah i don’t think i really got into too much of a discussion as to why it was so low with the doctors but i did get a visit from psych at some point during that admission so maybe i didn’t need to say too much!",
      "created_utc": 1681118518.0,
      "score": 1,
      "context": [
        {
          "id": "jf6bivf",
          "author": "NatalieALx",
          "body": "i ended up in hospital with dangerously low potassium levels, was basically about to have a heart attack and die. had to have it corrected with ivs. i feel like it’s probably quite common but what’s so scary about it is that you literally don’t know like mine was caught as a result of having routine bloods for another issue but if i hadn’t had that maybe i wouldn’t be typing this now. \n\ni also used to purge using objects rather than hands/fingers which my therapist was always incredibly worried about as i almost swallowed said objects/choked on multiple occasions. \n\npurged in public places many a time, which always felt like hitting a new low, i always tried not to do it at friends houses though. \n\neye blood vessels popping and then going to the opticians a while after but it still being noticeable and having them ask if i knew what caused it as they’d never seen it before… which is just like really awkward.",
          "created_utc": 1680782681.0
        },
        {
          "id": "jfmrjfg",
          "author": "Several-Giraffe1930",
          "body": "same with the low K. hospitalized 4 times for it. level was between 1.9-2.1 each time. i still denied bulimia to the death. but everyone fucking knew. i know it",
          "created_utc": 1681082914.0
        }
      ]
    },
    {
      "id": "jfb9twx",
      "author": "icantaffordacabbage",
      "body": "Interesting thanks! I’ve only been on it 4 months but good to know for the long term.",
      "created_utc": 1680872693.0,
      "score": 1,
      "context": [
        {
          "id": "jf6bykg",
          "author": "icantaffordacabbage",
          "body": "Emotional horror = I was stealing my flatmates ice lolly’s for binges when I didn’t have food in the house and he realised and wrote a note on them 🫣\n\nPhysical horror = I now have terrible acid reflux and needed a gastroscopy to investigate it (don’t recommend) and take omeprazole daily 🥲",
          "created_utc": 1680782919.0
        },
        {
          "id": "jf8azh7",
          "author": "Axxeptance",
          "body": "Just wanted to let you know just incase drs haven’t told you, that long term use of omeprazole can cause osteoporosis and gallstones amongst other things. Famotadine is seen as generally less risky now for long term use. They didn’t tell me until one Dr took me off it because I’d been on it for years.",
          "created_utc": 1680812181.0
        }
      ]
    },
    {
      "id": "jfgmxnv",
      "author": "Fluffykittty",
      "body": "Have you also had like stomach pain and chest pain and side pains sometimes. I eat but it doesn’t help that gnawing feeling anymore. It’s sucks. I just google all my symptoms and worry that I’m dying",
      "created_utc": 1680971457.0,
      "score": 1,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jfa4ywb",
          "author": "Fluffykittty",
          "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
          "created_utc": 1680842804.0
        },
        {
          "id": "jfdit5q",
          "author": "5star-my-notebook",
          "body": "Going for light walks has helped with the feeling like I can’t breathe, because it gets more oxygen flowing throughout my body (I have high CO2 due to low Chloride, which is an electrolyte). With fainting, I get up slowly and I make myself sit down and consume something with sugar if I start to feel lightheaded. I don’t really have much good advice, unfortunately. I’m young so I’ve been mostly fortunate with a lack of physical consequences for my actions",
          "created_utc": 1680906248.0
        }
      ]
    },
    {
      "id": "jf78yut",
      "author": "three_d0wn",
      "body": "That’s incredible! I hope things continue in that direction for you 💗",
      "created_utc": 1680797317.0,
      "score": 2,
      "context": [
        {
          "id": "jf4zho1",
          "author": "deifiedtoad",
          "body": "Peeing myself purging (in a public restroom) was an all time low.",
          "created_utc": 1680748730.0
        },
        {
          "id": "jf61xze",
          "author": "Spiritual_Worker3062",
          "body": "Purging in a public toilet feels desperate and shit, let alone this.. im so sorry",
          "created_utc": 1680776304.0
        },
        {
          "id": "jf6qdji",
          "author": "deifiedtoad",
          "body": "Thank you, I've been free from bulimia for a year and a half now, and am doing very well. :)",
          "created_utc": 1680789890.0
        }
      ]
    },
    {
      "id": "jf9kz6p",
      "author": "oohyeahgetitiguess",
      "body": "No judgement here, I steal like $25 worth of food a day, sometimes more. It’s so easy where I live unfortunately",
      "created_utc": 1680832229.0,
      "score": 3,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        },
        {
          "id": "jf7uyup",
          "author": "oohyeahgetitiguess",
          "body": "How much did they catch you stealing?",
          "created_utc": 1680805839.0
        },
        {
          "id": "jf91nr5",
          "author": "StockReporter5",
          "body": "$34 of food, but it was at a really expensive touristy general store bc of where i was working/living so it wasn’t as much food as it sounds like… still a lot tho let’s be real",
          "created_utc": 1680823392.0
        }
      ]
    },
    {
      "id": "jfjgd70",
      "author": "5star-my-notebook",
      "body": "My stomach hurts all the time and my joints almost always ache but I’m so used to it that I just tune it out most of the time. The pain is pretty mild though so I’m lucky",
      "created_utc": 1681019608.0,
      "score": 1,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jfa4ywb",
          "author": "Fluffykittty",
          "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
          "created_utc": 1680842804.0
        },
        {
          "id": "jfdit5q",
          "author": "5star-my-notebook",
          "body": "Going for light walks has helped with the feeling like I can’t breathe, because it gets more oxygen flowing throughout my body (I have high CO2 due to low Chloride, which is an electrolyte). With fainting, I get up slowly and I make myself sit down and consume something with sugar if I start to feel lightheaded. I don’t really have much good advice, unfortunately. I’m young so I’ve been mostly fortunate with a lack of physical consequences for my actions",
          "created_utc": 1680906248.0
        },
        {
          "id": "jfgmxnv",
          "author": "Fluffykittty",
          "body": "Have you also had like stomach pain and chest pain and side pains sometimes. I eat but it doesn’t help that gnawing feeling anymore. It’s sucks. I just google all my symptoms and worry that I’m dying",
          "created_utc": 1680971457.0
        }
      ]
    },
    {
      "id": "jfm3rg1",
      "author": "StockReporter5",
      "body": "yeah dude $25/day was me for so so long… every cent i earned at work went to binge food, so frustrating",
      "created_utc": 1681072428.0,
      "score": 2,
      "context": [
        {
          "id": "jf56cy4",
          "author": "StockReporter5",
          "body": "i got charged with a misdemeanor for stealing food💀 that’s probably one of my worst ones",
          "created_utc": 1680752218.0
        },
        {
          "id": "jf7uyup",
          "author": "oohyeahgetitiguess",
          "body": "How much did they catch you stealing?",
          "created_utc": 1680805839.0
        },
        {
          "id": "jf91nr5",
          "author": "StockReporter5",
          "body": "$34 of food, but it was at a really expensive touristy general store bc of where i was working/living so it wasn’t as much food as it sounds like… still a lot tho let’s be real",
          "created_utc": 1680823392.0
        },
        {
          "id": "jf9kz6p",
          "author": "oohyeahgetitiguess",
          "body": "No judgement here, I steal like $25 worth of food a day, sometimes more. It’s so easy where I live unfortunately",
          "created_utc": 1680832229.0
        }
      ]
    },
    {
      "id": "jfl4o01",
      "author": "Fluffykittty",
      "body": "I’m worried it may be ulcers. Sounds like it",
      "created_utc": 1681057668.0,
      "score": 1,
      "context": [
        {
          "id": "jf4rali",
          "author": "5star-my-notebook",
          "body": "Extreme fatigue to the point where I fall asleep during lectures/class at least twice a week and I get lightheaded and nauseous if I talk for too long because I don’t have enough oxygen going to my brain.\n\nFainting/possibly having seizures twice after purging. My vision went completely white and my whole body shook involuntarily for about ten seconds and I couldn’t stand.\n\nShitting myself while running down my driveway. Shitting blood every time for 6 months in a row because I was so constipated that the poop scraped my insides.\n\nPurging in an outhouse completely full of flies. I’m talking THOUSANDS of flies. I was terrified that 1 would fly into my mouth while purging but I somehow managed to avoid it. B/ping at friends’ and relatives houses, purging in gas station bathrooms, portable toilets, digging holes in my backyard with my hands to purge in, accidentally projectile vomiting and having to catch it in my hands to avoid ruining the carpet, the list goes on.\n\nWasting at least $100 every month on b/p food and taking food from wherever I can get it at school, including the campus food pantry, even though I have food at home. Eating food meant for other people.\n\nI’ve been bingeing and purging every day for 4 years and I’ve had an ED for over 5 years. The only times I wasn’t b/ping, I was either restricting or just plain bingeing, even while in treatment. It’s a trap. I feel like I’ll never get out of this.",
          "created_utc": 1680744943.0
        },
        {
          "id": "jfa4ywb",
          "author": "Fluffykittty",
          "body": "What do you do about your general health issues? I also have problems with feeling light headed, feeling like I can’t breathe, and fainting",
          "created_utc": 1680842804.0
        },
        {
          "id": "jfdit5q",
          "author": "5star-my-notebook",
          "body": "Going for light walks has helped with the feeling like I can’t breathe, because it gets more oxygen flowing throughout my body (I have high CO2 due to low Chloride, which is an electrolyte). With fainting, I get up slowly and I make myself sit down and consume something with sugar if I start to feel lightheaded. I don’t really have much good advice, unfortunately. I’m young so I’ve been mostly fortunate with a lack of physical consequences for my actions",
          "created_utc": 1680906248.0
        },
        {
          "id": "jfgmxnv",
          "author": "Fluffykittty",
          "body": "Have you also had like stomach pain and chest pain and side pains sometimes. I eat but it doesn’t help that gnawing feeling anymore. It’s sucks. I just google all my symptoms and worry that I’m dying",
          "created_utc": 1680971457.0
        },
        {
          "id": "jfjgd70",
          "author": "5star-my-notebook",
          "body": "My stomach hurts all the time and my joints almost always ache but I’m so used to it that I just tune it out most of the time. The pain is pretty mild though so I’m lucky",
          "created_utc": 1681019608.0
        }
      ]
    }
  ]
}