{
  "id": "12xvtf3",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1682369140.0,
  "title": "what is the most shameful thing your ed has made you do?",
  "selftext": "personally, mine is when i lied to my dad and told him i was struggling with rent. he doesn’t have much money but he sent me $100. i spent it all on b/p food. there is so much more but this one has stuck with me",
  "url": "https://www.reddit.com/r/bulimia/comments/12xvtf3/what_is_the_most_shameful_thing_your_ed_has_made/",
  "score": 148,
  "num_comments": 83,
  "comments": [
    {
      "id": "jhkgx0t",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1682369537.0,
      "score": 84,
      "context": []
    },
    {
      "id": "jhl2nmi",
      "author": "gothbreadbowl",
      "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
      "created_utc": 1682378900.0,
      "score": 59,
      "context": []
    },
    {
      "id": "jhl5enz",
      "author": "ThrowRA9202019",
      "body": "Compare myself to how I looked when I was 5-8 years old.",
      "created_utc": 1682380393.0,
      "score": 59,
      "context": []
    },
    {
      "id": "jhlaecj",
      "author": "Mokele-mbembe-woods",
      "body": "Tell my husband to go do something fun. He didn’t want to and then I manipulated him in going anyway. I just wanted to b/p and had a whole stack of food hidden for myself. I ate and purged for hours and then I had to hide everything before he came back. I felt like a horrible person to make him leave his home, just so I could stuff my face.",
      "created_utc": 1682382620.0,
      "score": 53,
      "context": []
    },
    {
      "id": "jhls5d2",
      "author": "proudchristianmommy",
      "body": "Went to eat at my friend's restaurant with my bf to celebrate being in recovery. Came out of the bathroom stall after a massive messy ..unloading to see my friend stood there horrified. Panicked, started crying and told her I'm pregnant so that's why I was sick, begged her to not tell anyone because my bf never wanted kids and he'd leave me if he knew. He never said that and since that day my friends think I had to get rid of it to stay with him and he's none the wiser as to why those people don't talk to him anymore and I avoid the place like the plague. Even more shameful that I'm pretty sure I can't even have kids because of my ED :\\",
      "created_utc": 1682390593.0,
      "score": 61,
      "context": []
    },
    {
      "id": "jhkx3bk",
      "author": "astrolink8",
      "body": "mine is spending an inordinate amount on delivery food, making it so that i can't even afford groceries (and doing that every paycheck for years) and then lying to my loved ones and telling them i had been doing better. i think about all the money i could have saved and the healthier food i could have consumed and the trust i could have established.\n\nhowever, i think feeling shame is apart of the disease and can keep us enthralled in it, but we don't need to carry that shame for things we've done while actively struggling with it. just a reminder that you're a lovely person, even if it's hard to believe at times! sending love your way.",
      "created_utc": 1682376383.0,
      "score": 40,
      "context": []
    },
    {
      "id": "jhlpzry",
      "author": "littlegh0stbunny",
      "body": "ordering enough food for a family of 6 from a chinese restaurant to eat all to myself alone in my bedroom, which I did. quickly hiding 90% of it under pillows and blankets every time I heard footsteps. walking from the front door back to my room already felt enough like the walk of shame 🫠",
      "created_utc": 1682389603.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jhlq5zq",
      "author": "None",
      "body": "everything that has been said is so relatable… i’m so glad i’m not alone in this way",
      "created_utc": 1682389683.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jhlzlvt",
      "author": "elvensnowfae",
      "body": "Went to a really really really expensive restaurant with my mom and husband. I paid bc I love them and wanted to treat them bc they deserved it. Long story short it ended with me feeling stupid and anxious me barfing in the bathroom. For over a decade I remember places my the bathrooms I’ve barfed in all across town and neighboring towns ugh",
      "created_utc": 1682394344.0,
      "score": 27,
      "context": []
    },
    {
      "id": "jhlybc6",
      "author": "Obvious_Penalty6974",
      "body": "Spending SO MUCH money on binge food, lying, hiding vomit, hiding food...I think the lying is what makes me feel the worst, though.",
      "created_utc": 1682393653.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jhmdg91",
      "author": "No_Panic1775",
      "body": "i got super sick freshman year of college—i would b/p almost every night. my roommates and i never spoke about it about but i knew they could hear me. one of them started showing signs of disordered eating but i didn’t stop, i felt like i couldn’t—i was so stuck in my own sickness. one night i heard her making herself throw up in the bathroom and i felt so much shame and guilt that i didn’t say anything when i should’ve. she did it several more times and i could tell she was sick. i tried to bring it up once a year later, after she seemed to have gotten better, and she admitted that she should’ve gone to treatment but denied that she was purging, which made me feel like she could still be doing it. 2 years later, i still hate myself for triggering her so badly that she became bulimic like me. we don’t talk anymore and i often worry that i’ve doomed her to struggling with this for the rest of her life. i’ll never forgive myself.",
      "created_utc": 1682402964.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jhlvuj5",
      "author": "None",
      "body": "Hiding all binge food to my room. My room was full of pasta, junk food and with bags of cookies I made myself. My mum found all of them (not once) and i lied but that was so stupid.  I mean what can i say? Once i purged and it stuck in toilet and i didn't notice. My mom called me and i went then she called my dad. My dad grabbed the things that are stuck and showed me and i felt like im gonna faint. I was shaking. They asked me what are you doing and what is that? I made up the world's most ridiculous lie. They didn't believe of course. Another one my mom (always) found all the empty packs i hide in my room. She warned me that this is harmful and not to eat so much junk food. But im bulimic 💀.  I have too much shameful things bc of my ed. My relationship with my family would be so much better if i wasn't bulimic. This is so embarassing.",
      "created_utc": 1682392369.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jhlblad",
      "author": "None",
      "body": "I ate dry cat food sitting on the floor of my bathroom",
      "created_utc": 1682383148.0,
      "score": 40,
      "context": []
    },
    {
      "id": "jhmjfdx",
      "author": "_BTGGF_",
      "body": "Was being monitored for bathroom/toilet noises after meals, so I puked into a container in my closet, and then carefully poured it into empty Gatorade bottles for safe storage until I could dispose them at a later time. The puke was chunky though, so it kept getting stuck and I had to mash the chunks into the bottles with my fingers. Was not as easy as I thought it would be.",
      "created_utc": 1682407857.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jhm5fs1",
      "author": "Kdoterin",
      "body": "Ran up like thousands in a few months bingeing in my car during a depressive episode",
      "created_utc": 1682397642.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jhmle7h",
      "author": "FumikoH",
      "body": "Ate a bunch of delicious food on my birthday just to rush and throw it up. Always took time away from family on the holidays. I remember this birthday purge so well bc it was when I realized I had a problem and it was out of control. My parents paid for an expensive dinner and my mom bought me a fancy birthday cake and I still remember my horror/shame/guilt when throwing it up. I started recovering from that day forward. It often takes a rock bottom catalyst to finally seek change.",
      "created_utc": 1682409562.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jhmrn2n",
      "author": "DependentPaper1330",
      "body": "Ughh where do I start....\n\nI'd say the worst I feel is when someone (family/friend/partner at the time) buys my meal at a special occasion.. for me to rush home to throw it up.\n\nI used to live with my ex, and I'd b/p while he was at work or as SOON as he left to play golf with his friends. I'd time it, too, and was usually right on time. He'd usually come home to me cleaning the kitchen. Everything spotless- vomit disposed.\n..He caught me mid-purge once when he got home earlier than usual. He didn't see it as I was behind the breakfast bar. I told him not to come closer and he just ran to the bathroom saying \"whatever\"\nHe later admitted to me he knew I was purging in the kitchen when he and the cats were asleep :(\n\n\nSpecial honors goes to my fast food and gas station trips late night after work DAILY. I would buy enough food for 2 sessions. Oh yeah, when I was feeling shamless.. my frequent Walmart trips with cart FULL of shit. Multiple times a week. Sooo embarrassing as employees wherever I went wonder why I buy so much food since I look appear as a nice looking girl in nice clothes. I'm 28.. my car trips started at 20... I watch gas station clerks stare at me when I get to my car, so I don't dare take a bite until I'm on the road, which is hard to do. \n\nSPECIAL THANKS to my frequent trips to the dumpster disposing my puke bucket. Neighbors all around wondering wtf this lady has in a mop bucket 🪣 that she can't carry in a single bag. The bag will burst on it's own... I've had it happen in front of a Neighbors apt. \n\nI get funny looks wherever I go unless I'm buying fucking water or like one thing. I hate people.",
      "created_utc": 1682415213.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jhmhcsq",
      "author": "NatureNo6852",
      "body": "missing out on family plans and parties because I knew i couldn’t b/p and instead stayed home. telling my parents i’m doing better and then going straight to the washroom after. eating whatever i could in the pantry and my parents and brother wondering the next day where (whatever item) went, and i could never tell them i ate it during a binge.",
      "created_utc": 1682406099.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jhnqfl8",
      "author": "RushWild",
      "body": "I've eaten ice-cream, purged it and eaten the vomit. I've broken promises to my family to take care of myself so many times, on birthdays, anniversaries. \n\nMy day revolves around bulimia, I purge at work, I purge at home, I purge in public bathrooms, I wish I felt a sense of shame but I don't. I've wasted all the love and opportunities I didn't deserve to be given, yet all I care about is food.",
      "created_utc": 1682434403.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jhm3ddq",
      "author": "kindasusdude",
      "body": "I ate icecream out the trash and then.vommed it",
      "created_utc": 1682396446.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jhlzqzf",
      "author": "None",
      "body": "i have two. first one was throwing up in my friends basement and this wasn’t even when i was actively relapsing this was just a one time thing and then i was fine??? but it was her bday party and i was just like “nope not today” idk i don’t know how to explain how bizarre it was but i felt really bad. second one is i had a big container of pasta and i didn’t finish all of it there was a little bit left but then my ed went away for a while and i was so scared of finishing the pasta and it stayed in my fridge for literal months i had to deep clean the entire thing when i finally opened it",
      "created_utc": 1682394423.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jhmmuno",
      "author": "unknown-bulimic",
      "body": "threw up in an airplane bathroom and when i walked out, there were like four people waiting in line.",
      "created_utc": 1682410877.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jhmq6tm",
      "author": "krolikzajchik",
      "body": "I stole food to binge on. Not the most shameful thing I guess but the one I can think of rn",
      "created_utc": 1682413903.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jhnturw",
      "author": "None",
      "body": "when i lived with my mom i ruined the septic system so that was a $9k repair, THEN she offered a solution where i could purge into 6x6 ft holes she dug in the property but i did that so much she told me to just outright stop. i did not. i started purging into bags and burying them myself, but i got caught, so i started collecting my vom in those huge Tupperwares you would put old Xmas decorations in lol and carrying it to a dead end down the road and dumping it or taking it to the dumpster at work.\n\nI also got caught by the police while dumpster diving and it was suuuuper awkward \n\nall in all i was really gross during this time in my life lmao\n\nedit: if anyone was on /that website/ around 2018 or so you may have seen video proof of this fiasco 😣",
      "created_utc": 1682435779.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jhnb4s2",
      "author": "New_Championship3870",
      "body": "I was not be present in a 2 1/2 year romantic relationship with my ex whom I’m still in love with.",
      "created_utc": 1682427742.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jhnu99x",
      "author": "o0SinnQueen0o",
      "body": "Once I dropped my cake so in my binge insanity I ate it from the floor one day after my grandpa shit on said floor.",
      "created_utc": 1682435938.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jhong0c",
      "author": "notsickenough",
      "body": "It’s a long list with tons of other things but I always feel the most guilt when it’s food someone else paid for. It makes me feel like such a pos. Because it’s like wow I really just ruined this nice memory of spending time with this person and wasting their money by doing that.",
      "created_utc": 1682447132.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jhmutg1",
      "author": "aleksandraslavvv",
      "body": "stealing food, money for food and hoarding trash bags with puke. those were the worst i think",
      "created_utc": 1682417875.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhncmji",
      "author": "Quintilyn",
      "body": "I lie too everyone I know (including my therapist) about me throwing up after eating, so I’ll get approved for my next schoolyear",
      "created_utc": 1682428461.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jhobj7w",
      "author": "turnipkitty112",
      "body": "I can’t believe I’m admitting to this but… took money from my parents. Like I’d steal a $20 now and then from their wallet to spend on b/p food. God, I feel so awful",
      "created_utc": 1682442556.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhq1q7t",
      "author": "LJUJRJ",
      "body": "I have many. I’m sitting here crying reading all of these, it’s have really hit me and I feel the pain of each and every one I really wish this disease didn’t exist. \n\n- I’m pretty sure I’ve ruined the pipes in mine and my fiancé’s house I’m too scared to call a plumber because I’m embarrassed at what they’d find there’s a stain on our roof where the pipe is leaking. \n- When I lived with my parents I used to binge then go for a run, I’d run to a cutting that backed onto someone else’s house and purge there one day the man came out and yelled out asking what I was doing. I’m assuming the days on end of me returning there would have began to smell and he’d realised something was going on I told him I lived a long way away and I was at a friends house then ran away.\n-When I go out to eat at restaurants I take a bathroom break almost immediately after eating to go purge. \n- I will go shopping and binge in the food court then find a public toilet. \n- I would binge and purge at work and the building manager had so many complaints about the filth in the toilets that they had office managers from each office talk to all staff about it. It was me. \n- My fiance has caught me numerous times purging and I’ve cried and got defensive told him I’m fine, we are now doing IVF because I’ve screwed up my body so much that it’s effected my fertility and I still cannot stop. \n- When I lived with my parents I used to purge in a lined bucket in my room and stupidly threw the bags in the trash, they knew what I was doing and confronted me, which I of course denied. So I started throwing up in the same bucket unlined leaving it in my room come back downstairs act normal then later pour it into the toilet and wash out the bucket in our bathtub. \n- I used to babysit my nephew and he picked up on the noises my purge would make and start imitating them to my absolute fucking horror! \n\nThe help that I am getting is not helping and I’m so frustrated with myself.",
      "created_utc": 1682468111.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhmqnfi",
      "author": "PoldiL",
      "body": "Would throw up in my bedroom into bags // bowls and would have to wait until everyone had left the house before I sorted them out… \nSo literally had bags of sick chilling in my room :))))\n\nAnd my parents (now I’ve moved out) have had to re carpet the room :)))))))",
      "created_utc": 1682414328.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhnh4al",
      "author": "ed_mayo_onlyfans",
      "body": "I did that a lot too. I would also steal food from other people m",
      "created_utc": 1682430515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhnvhka",
      "author": "None",
      "body": "omg i already commented but i just remembered, when i worked at a skilled nursing facility and was picking up the meal trays from patients i would eat all of their leftover food 🤮 and steal the uneaten diabetic snacks that we were supposed to hand out. horrible",
      "created_utc": 1682436421.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhohx1y",
      "author": "None",
      "body": "After my mum caught that I was bulimic she forbid me from going to the bathroom after meals, if I really needed to go she went in after me and checked if it smelled or if there was leftover stomach acid in the toilet water. I started puking in zip bags in my room and hiding them under my bed for hours, and then I offered to take the rubbish out at night and dumped them in the street public bins.",
      "created_utc": 1682444998.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhp1xwk",
      "author": "ll1m9",
      "body": "Comparing my body to 10yr olds, taping my body, vomiting in a bag whilst watching TV, crying over calories, hiding binge foods in my room, wasted food my parents have made or anyone, wasted tons of money on food",
      "created_utc": 1682452781.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhufclt",
      "author": "piximiqote",
      "body": "Get into 1000s of debt. I’m so ashamed. Haven’t told anyone in my life about it. Debt and mental illnesses go hand in hand sometimes and both make each other worse.",
      "created_utc": 1682547709.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhq9zwv",
      "author": "Playful_Vehicle_8850",
      "body": "Went for a super long run (that was my purge) after going on a very intense hike, and restricted so much that day that I almost passed out on my way back from said run. Then I weighed myself and binged my lunches for the week.",
      "created_utc": 1682471896.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jj1yz8z",
      "author": "daisypoppy12",
      "body": "Went out to a fancy restaurant w friends for my bday, $700 dinner . . .that all ended up in the restaurant toilet. Even worse, when I was done the waiter had brought me a surprise dessert",
      "created_utc": 1683348839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhr1osl",
      "author": "glassofblood",
      "body": "picked a gnat off of my food and continued eating it",
      "created_utc": 1682486535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhw7r3e",
      "author": "nicee-c0ck",
      "body": "throwing up in many 7/11 gas stations and public locations that were just NASTY",
      "created_utc": 1682582347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjfsple",
      "author": "KaleidoscopeKooky391",
      "body": "Puke in my boyfriend toilet and then lied to him saying I puked from alcohol (I barely drank)",
      "created_utc": 1683612622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjmar4u",
      "author": "Profes8",
      "body": "blaming other people in my house for missing food, eating from the garbage, lying to good friends about why i was absent or can’t hang out🫦",
      "created_utc": 1683735049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jk0hvcz",
      "author": "whoneedskneecaps",
      "body": "Almost made myself throw up in the hallway of a psychiatric hospital,in front  of everyone.",
      "created_utc": 1683994705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jl4qwlb",
      "author": "why_idontknow-",
      "body": "I was in the hospital for three months after jumping off a building and severing my spine. I used to b/p liquids when there was nothing else.. I kept binging cranberry juice with ginger ale and purging through the suction tube (idk what it’s called). It’s what you cough into when your lungs are full of phlegm/learning to breathe right again. \n\nIt’s certainly not the “grossest” thing this addiction has lead me too.. but it’s by far the most desperate I’ve been for an escape.",
      "created_utc": 1684742697.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhllonh",
      "author": "Pretend_Ad8702",
      "body": "You thought I’m the only one :/",
      "created_utc": 1682387703.0,
      "score": 21,
      "context": [
        {
          "id": "jhkgx0t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682369537.0
        }
      ]
    },
    {
      "id": "jhmcdqq",
      "author": "Diane9779",
      "body": "Going through the trash was the worst.",
      "created_utc": 1682402154.0,
      "score": 19,
      "context": [
        {
          "id": "jhkgx0t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682369537.0
        }
      ]
    },
    {
      "id": "jhmq3ju",
      "author": "DependentPaper1330",
      "body": "I live alone... I always throw up in my living room in a bucket lined by a bag. Idk why. I used to do it by the sink. I think bc I could lean on the couch. Or after a reaaally bad binge I'd be too weak to lean over on my own, so I'd sit and do it on the edge of my couch until I could stand w/o pain.",
      "created_utc": 1682413820.0,
      "score": 15,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        }
      ]
    },
    {
      "id": "jhlqaj8",
      "author": "None",
      "body": "i’ve done all of these :( <3",
      "created_utc": 1682389741.0,
      "score": 9,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        }
      ]
    },
    {
      "id": "jhm5hqv",
      "author": "Kdoterin",
      "body": "Damn forgot about my trash donut phase",
      "created_utc": 1682397675.0,
      "score": 10,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        }
      ]
    },
    {
      "id": "jhmup35",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1682417778.0,
      "score": 4,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        }
      ]
    },
    {
      "id": "jhm788l",
      "author": "Traditional_Use_4543",
      "body": "Ok this tho I have old ballet recital clothes that I'll \"try on\" and feel so much shame if doesn't fit perfectly how I want it to (I quit dance 4th grade) but then also the fact that I'm able to get it on at all makes me feel like I was just so fat as a kid and that's why",
      "created_utc": 1682398709.0,
      "score": 13,
      "context": [
        {
          "id": "jhl5enz",
          "author": "ThrowRA9202019",
          "body": "Compare myself to how I looked when I was 5-8 years old.",
          "created_utc": 1682380393.0
        }
      ]
    },
    {
      "id": "jhlvobk",
      "author": "gothbreadbowl",
      "body": "Oh my god I’m so sorry",
      "created_utc": 1682392283.0,
      "score": 22,
      "context": [
        {
          "id": "jhls5d2",
          "author": "proudchristianmommy",
          "body": "Went to eat at my friend's restaurant with my bf to celebrate being in recovery. Came out of the bathroom stall after a massive messy ..unloading to see my friend stood there horrified. Panicked, started crying and told her I'm pregnant so that's why I was sick, begged her to not tell anyone because my bf never wanted kids and he'd leave me if he knew. He never said that and since that day my friends think I had to get rid of it to stay with him and he's none the wiser as to why those people don't talk to him anymore and I avoid the place like the plague. Even more shameful that I'm pretty sure I can't even have kids because of my ED :\\",
          "created_utc": 1682390593.0
        }
      ]
    },
    {
      "id": "jhmuo9h",
      "author": "Realistic-Concept782",
      "body": "Have u recovered?",
      "created_utc": 1682417760.0,
      "score": -2,
      "context": [
        {
          "id": "jhkx3bk",
          "author": "astrolink8",
          "body": "mine is spending an inordinate amount on delivery food, making it so that i can't even afford groceries (and doing that every paycheck for years) and then lying to my loved ones and telling them i had been doing better. i think about all the money i could have saved and the healthier food i could have consumed and the trust i could have established.\n\nhowever, i think feeling shame is apart of the disease and can keep us enthralled in it, but we don't need to carry that shame for things we've done while actively struggling with it. just a reminder that you're a lovely person, even if it's hard to believe at times! sending love your way.",
          "created_utc": 1682376383.0
        }
      ]
    },
    {
      "id": "jhnts08",
      "author": "None",
      "body": "They always include multiple forks when I order food....when it's just me 😭",
      "created_utc": 1682435749.0,
      "score": 13,
      "context": [
        {
          "id": "jhlpzry",
          "author": "littlegh0stbunny",
          "body": "ordering enough food for a family of 6 from a chinese restaurant to eat all to myself alone in my bedroom, which I did. quickly hiding 90% of it under pillows and blankets every time I heard footsteps. walking from the front door back to my room already felt enough like the walk of shame 🫠",
          "created_utc": 1682389603.0
        }
      ]
    },
    {
      "id": "jhnukmm",
      "author": "None",
      "body": "omg i feel this. i went to a really expensive restaurant and instantly needed to find a bathroom despite just spending hundreds 😡",
      "created_utc": 1682436062.0,
      "score": 6,
      "context": [
        {
          "id": "jhlzlvt",
          "author": "elvensnowfae",
          "body": "Went to a really really really expensive restaurant with my mom and husband. I paid bc I love them and wanted to treat them bc they deserved it. Long story short it ended with me feeling stupid and anxious me barfing in the bathroom. For over a decade I remember places my the bathrooms I’ve barfed in all across town and neighboring towns ugh",
          "created_utc": 1682394344.0
        }
      ]
    },
    {
      "id": "jhocf6p",
      "author": "downhillbaby",
      "body": "i totally understand why you’re feeling this way, i feel similar because when i had a bad drinking problem my roomate in college who never drank started getting bad with it and i felt like it was all my fault. please try not to be too hard on yourself because it’s not your fault at all. you were very sick and couldn’t care for yourself, how could you care for someone else? she likely has deeper issues and would’ve ended up having some kind of problem even if she never lived with you. i hope you can learn to think that way, it’s so not easy and i really feel where you’re coming from <3 i hope you both are doing better",
      "created_utc": 1682442895.0,
      "score": 7,
      "context": [
        {
          "id": "jhmdg91",
          "author": "No_Panic1775",
          "body": "i got super sick freshman year of college—i would b/p almost every night. my roommates and i never spoke about it about but i knew they could hear me. one of them started showing signs of disordered eating but i didn’t stop, i felt like i couldn’t—i was so stuck in my own sickness. one night i heard her making herself throw up in the bathroom and i felt so much shame and guilt that i didn’t say anything when i should’ve. she did it several more times and i could tell she was sick. i tried to bring it up once a year later, after she seemed to have gotten better, and she admitted that she should’ve gone to treatment but denied that she was purging, which made me feel like she could still be doing it. 2 years later, i still hate myself for triggering her so badly that she became bulimic like me. we don’t talk anymore and i often worry that i’ve doomed her to struggling with this for the rest of her life. i’ll never forgive myself.",
          "created_utc": 1682402964.0
        }
      ]
    },
    {
      "id": "jhnubwf",
      "author": "None",
      "body": "I have eaten the canned wet dog food before and it was actually not bad. I put it on stolen couscous 🥶",
      "created_utc": 1682435968.0,
      "score": 7,
      "context": [
        {
          "id": "jhlblad",
          "author": "None",
          "body": "I ate dry cat food sitting on the floor of my bathroom",
          "created_utc": 1682383148.0
        }
      ]
    },
    {
      "id": "jhyjcpl",
      "author": "New_Championship3870",
      "body": "This made me smile because I was recently being monitored for bathroom/toilet noises or perhaps I was being too paranoid, I have many times binged in my room but began to also purge leaned over my bed into plastic bags and would tie them up and keep them in my wardrobe or under the bed until I was able to dispose of it them. I held this one bag in my closet for over a week and it kinda seeped through the bag and onto the floor underneath and it smelt funky as fuck.",
      "created_utc": 1682623997.0,
      "score": 2,
      "context": [
        {
          "id": "jhmjfdx",
          "author": "_BTGGF_",
          "body": "Was being monitored for bathroom/toilet noises after meals, so I puked into a container in my closet, and then carefully poured it into empty Gatorade bottles for safe storage until I could dispose them at a later time. The puke was chunky though, so it kept getting stuck and I had to mash the chunks into the bottles with my fingers. Was not as easy as I thought it would be.",
          "created_utc": 1682407857.0
        }
      ]
    },
    {
      "id": "jhmqg7j",
      "author": "DependentPaper1330",
      "body": "YES. THIS!! I would go to different fast foods and gas stations, would eat in my car bc I'm hungry and shaking with excitement from the horrible binge foods/trying to get home and not eat, but can't control myself. Ughhh\n\nCrazy thing is I live alone. I only have to hide from my cat (which she was affected really bad by my recent relapse)",
      "created_utc": 1682414143.0,
      "score": 4,
      "context": [
        {
          "id": "jhm5fs1",
          "author": "Kdoterin",
          "body": "Ran up like thousands in a few months bingeing in my car during a depressive episode",
          "created_utc": 1682397642.0
        }
      ]
    },
    {
      "id": "jhn1peq",
      "author": "xo_lily_xo",
      "body": "I relate to that so much. I remember my 25th birthday acting all happy but secretly purging everything up, even our meal out and it's tainted the memory.",
      "created_utc": 1682422633.0,
      "score": 3,
      "context": [
        {
          "id": "jhmle7h",
          "author": "FumikoH",
          "body": "Ate a bunch of delicious food on my birthday just to rush and throw it up. Always took time away from family on the holidays. I remember this birthday purge so well bc it was when I realized I had a problem and it was out of control. My parents paid for an expensive dinner and my mom bought me a fancy birthday cake and I still remember my horror/shame/guilt when throwing it up. I started recovering from that day forward. It often takes a rock bottom catalyst to finally seek change.",
          "created_utc": 1682409562.0
        }
      ]
    },
    {
      "id": "jhneo99",
      "author": "hallowmean",
      "body": "I feel like I'm a neighbourhood curiosity because I'm always in the same grocery stores buying ridiculous amounts of food. I try to mix up my stores and break up my purchases as much as possible, but there's only so much I can do, you know? I tend to go at the same time each day too, so it's the same staff working the same shifts and it's mortifying, but it doesn't stop me.",
      "created_utc": 1682429414.0,
      "score": 9,
      "context": [
        {
          "id": "jhmrn2n",
          "author": "DependentPaper1330",
          "body": "Ughh where do I start....\n\nI'd say the worst I feel is when someone (family/friend/partner at the time) buys my meal at a special occasion.. for me to rush home to throw it up.\n\nI used to live with my ex, and I'd b/p while he was at work or as SOON as he left to play golf with his friends. I'd time it, too, and was usually right on time. He'd usually come home to me cleaning the kitchen. Everything spotless- vomit disposed.\n..He caught me mid-purge once when he got home earlier than usual. He didn't see it as I was behind the breakfast bar. I told him not to come closer and he just ran to the bathroom saying \"whatever\"\nHe later admitted to me he knew I was purging in the kitchen when he and the cats were asleep :(\n\n\nSpecial honors goes to my fast food and gas station trips late night after work DAILY. I would buy enough food for 2 sessions. Oh yeah, when I was feeling shamless.. my frequent Walmart trips with cart FULL of shit. Multiple times a week. Sooo embarrassing as employees wherever I went wonder why I buy so much food since I look appear as a nice looking girl in nice clothes. I'm 28.. my car trips started at 20... I watch gas station clerks stare at me when I get to my car, so I don't dare take a bite until I'm on the road, which is hard to do. \n\nSPECIAL THANKS to my frequent trips to the dumpster disposing my puke bucket. Neighbors all around wondering wtf this lady has in a mop bucket 🪣 that she can't carry in a single bag. The bag will burst on it's own... I've had it happen in front of a Neighbors apt. \n\nI get funny looks wherever I go unless I'm buying fucking water or like one thing. I hate people.",
          "created_utc": 1682415213.0
        }
      ]
    },
    {
      "id": "jjf72xe",
      "author": "16bitidiot",
      "body": "i finally found someone who does the same thing!! i feel so shameful binging at my house because living with parents means we share a cupboard. I feel like i waste all this food for o reason. I'm actually able to talk myself out of binges because of this reason (it is insanely hard to do though..)",
      "created_utc": 1683600027.0,
      "score": 1,
      "context": [
        {
          "id": "jhmhcsq",
          "author": "NatureNo6852",
          "body": "missing out on family plans and parties because I knew i couldn’t b/p and instead stayed home. telling my parents i’m doing better and then going straight to the washroom after. eating whatever i could in the pantry and my parents and brother wondering the next day where (whatever item) went, and i could never tell them i ate it during a binge.",
          "created_utc": 1682406099.0
        }
      ]
    },
    {
      "id": "jhqoa2n",
      "author": "None",
      "body": "i understand this completely.. somehow reassuring that i’m not the only one who has eaten their vomit. sending so much love <3",
      "created_utc": 1682478633.0,
      "score": 3,
      "context": [
        {
          "id": "jhnqfl8",
          "author": "RushWild",
          "body": "I've eaten ice-cream, purged it and eaten the vomit. I've broken promises to my family to take care of myself so many times, on birthdays, anniversaries. \n\nMy day revolves around bulimia, I purge at work, I purge at home, I purge in public bathrooms, I wish I felt a sense of shame but I don't. I've wasted all the love and opportunities I didn't deserve to be given, yet all I care about is food.",
          "created_utc": 1682434403.0
        }
      ]
    },
    {
      "id": "jhxeago",
      "author": "Ill-Presentation-242",
      "body": "This could be me sadly",
      "created_utc": 1682607950.0,
      "score": 1,
      "context": [
        {
          "id": "jhnqfl8",
          "author": "RushWild",
          "body": "I've eaten ice-cream, purged it and eaten the vomit. I've broken promises to my family to take care of myself so many times, on birthdays, anniversaries. \n\nMy day revolves around bulimia, I purge at work, I purge at home, I purge in public bathrooms, I wish I felt a sense of shame but I don't. I've wasted all the love and opportunities I didn't deserve to be given, yet all I care about is food.",
          "created_utc": 1682434403.0
        }
      ]
    },
    {
      "id": "jhnv747",
      "author": "None",
      "body": "i once got caught stealing a rotisserie chicken 😭 and when i lived on a military base i got caught stealing donuts i thought they were gonna get my ass!!!! funny how they never caught me when I was stealing $200+ worth of food",
      "created_utc": 1682436307.0,
      "score": 2,
      "context": [
        {
          "id": "jhmq6tm",
          "author": "krolikzajchik",
          "body": "I stole food to binge on. Not the most shameful thing I guess but the one I can think of rn",
          "created_utc": 1682413903.0
        }
      ]
    },
    {
      "id": "jhn50ij",
      "author": "gothbreadbowl",
      "body": "I get bored when doing it so I needed the tv lol",
      "created_utc": 1682424552.0,
      "score": 13,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        },
        {
          "id": "jhmq3ju",
          "author": "DependentPaper1330",
          "body": "I live alone... I always throw up in my living room in a bucket lined by a bag. Idk why. I used to do it by the sink. I think bc I could lean on the couch. Or after a reaaally bad binge I'd be too weak to lean over on my own, so I'd sit and do it on the edge of my couch until I could stand w/o pain.",
          "created_utc": 1682413820.0
        }
      ]
    },
    {
      "id": "jhmfuz3",
      "author": "gothbreadbowl",
      "body": "Trash cookie for me lol…and it was in school, the other kids saw me and I was so embarrassed I hid outside the class in the hallway and cried lol",
      "created_utc": 1682404880.0,
      "score": 10,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        },
        {
          "id": "jhm5hqv",
          "author": "Kdoterin",
          "body": "Damn forgot about my trash donut phase",
          "created_utc": 1682397675.0
        }
      ]
    },
    {
      "id": "jhndz54",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1682429091.0,
      "score": 2,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        },
        {
          "id": "jhmup35",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1682417778.0
        }
      ]
    },
    {
      "id": "jhm0502",
      "author": "proudchristianmommy",
      "body": "Thank you, really not my proudest moment but I'm hoping even though recovery isn't linear I'll never feel like I have to sink that low again",
      "created_utc": 1682394638.0,
      "score": 22,
      "context": [
        {
          "id": "jhls5d2",
          "author": "proudchristianmommy",
          "body": "Went to eat at my friend's restaurant with my bf to celebrate being in recovery. Came out of the bathroom stall after a massive messy ..unloading to see my friend stood there horrified. Panicked, started crying and told her I'm pregnant so that's why I was sick, begged her to not tell anyone because my bf never wanted kids and he'd leave me if he knew. He never said that and since that day my friends think I had to get rid of it to stay with him and he's none the wiser as to why those people don't talk to him anymore and I avoid the place like the plague. Even more shameful that I'm pretty sure I can't even have kids because of my ED :\\",
          "created_utc": 1682390593.0
        },
        {
          "id": "jhlvobk",
          "author": "gothbreadbowl",
          "body": "Oh my god I’m so sorry",
          "created_utc": 1682392283.0
        }
      ]
    },
    {
      "id": "jhq7n1a",
      "author": "astrolink8",
      "body": "i have not! still actively struggling sadly. just have had a bit better of control over ordering food these days.",
      "created_utc": 1682470812.0,
      "score": 3,
      "context": [
        {
          "id": "jhkx3bk",
          "author": "astrolink8",
          "body": "mine is spending an inordinate amount on delivery food, making it so that i can't even afford groceries (and doing that every paycheck for years) and then lying to my loved ones and telling them i had been doing better. i think about all the money i could have saved and the healthier food i could have consumed and the trust i could have established.\n\nhowever, i think feeling shame is apart of the disease and can keep us enthralled in it, but we don't need to carry that shame for things we've done while actively struggling with it. just a reminder that you're a lovely person, even if it's hard to believe at times! sending love your way.",
          "created_utc": 1682376383.0
        },
        {
          "id": "jhmuo9h",
          "author": "Realistic-Concept782",
          "body": "Have u recovered?",
          "created_utc": 1682417760.0
        }
      ]
    },
    {
      "id": "jhoqoz7",
      "author": "elvensnowfae",
      "body": "Omg yeah, it’s the worst! Idk how much “money” I’ve vomited up through the years 🙄 I try to tell myself now that food is fuel for my body and that it’s okay to keep food down. My heart needs it to survive and so do my other body parts and also I find fruit and vegetables not “triggering” to me so eating healthy helps! I hope you’re doing better and I’m sorry you did it too!<3",
      "created_utc": 1682448397.0,
      "score": 5,
      "context": [
        {
          "id": "jhlzlvt",
          "author": "elvensnowfae",
          "body": "Went to a really really really expensive restaurant with my mom and husband. I paid bc I love them and wanted to treat them bc they deserved it. Long story short it ended with me feeling stupid and anxious me barfing in the bathroom. For over a decade I remember places my the bathrooms I’ve barfed in all across town and neighboring towns ugh",
          "created_utc": 1682394344.0
        },
        {
          "id": "jhnukmm",
          "author": "None",
          "body": "omg i feel this. i went to a really expensive restaurant and instantly needed to find a bathroom despite just spending hundreds 😡",
          "created_utc": 1682436062.0
        }
      ]
    },
    {
      "id": "jhoih35",
      "author": "No_Panic1775",
      "body": "thank you so much for this comment, you are so kind for taking the time to respond to me(,: your words are so healing for me and it made my day seeing them. i hope you can also recognize the same thing in yourself—that it’s not your fault. like you said, it is so hard but maybe one day we’ll both be able to release this guilt((: again, thank you—i hope you are doing well too<3",
      "created_utc": 1682445210.0,
      "score": 3,
      "context": [
        {
          "id": "jhmdg91",
          "author": "No_Panic1775",
          "body": "i got super sick freshman year of college—i would b/p almost every night. my roommates and i never spoke about it about but i knew they could hear me. one of them started showing signs of disordered eating but i didn’t stop, i felt like i couldn’t—i was so stuck in my own sickness. one night i heard her making herself throw up in the bathroom and i felt so much shame and guilt that i didn’t say anything when i should’ve. she did it several more times and i could tell she was sick. i tried to bring it up once a year later, after she seemed to have gotten better, and she admitted that she should’ve gone to treatment but denied that she was purging, which made me feel like she could still be doing it. 2 years later, i still hate myself for triggering her so badly that she became bulimic like me. we don’t talk anymore and i often worry that i’ve doomed her to struggling with this for the rest of her life. i’ll never forgive myself.",
          "created_utc": 1682402964.0
        },
        {
          "id": "jhocf6p",
          "author": "downhillbaby",
          "body": "i totally understand why you’re feeling this way, i feel similar because when i had a bad drinking problem my roomate in college who never drank started getting bad with it and i felt like it was all my fault. please try not to be too hard on yourself because it’s not your fault at all. you were very sick and couldn’t care for yourself, how could you care for someone else? she likely has deeper issues and would’ve ended up having some kind of problem even if she never lived with you. i hope you can learn to think that way, it’s so not easy and i really feel where you’re coming from <3 i hope you both are doing better",
          "created_utc": 1682442895.0
        }
      ]
    },
    {
      "id": "jho2fcn",
      "author": "9NUMBERS9",
      "body": "why did you eat wet dog food?",
      "created_utc": 1682439119.0,
      "score": -3,
      "context": [
        {
          "id": "jhlblad",
          "author": "None",
          "body": "I ate dry cat food sitting on the floor of my bathroom",
          "created_utc": 1682383148.0
        },
        {
          "id": "jhnubwf",
          "author": "None",
          "body": "I have eaten the canned wet dog food before and it was actually not bad. I put it on stolen couscous 🥶",
          "created_utc": 1682435968.0
        }
      ]
    },
    {
      "id": "jhoa9ob",
      "author": "DependentPaper1330",
      "body": "Omfg yess my walmart is a grocery one, so it's smaller,  and I've seen all of the same staff, and they all know me by now 😭 they see me buy RIDICULOUS amounts of stuff frequently. I just try to look down and be nice lmao. When I feel I'm too obvious, I do multiple gas station runs after work. I rotate the two smh.\n\nI'm trying to recover for good now...🙏 5 days clean..",
      "created_utc": 1682442061.0,
      "score": 4,
      "context": [
        {
          "id": "jhmrn2n",
          "author": "DependentPaper1330",
          "body": "Ughh where do I start....\n\nI'd say the worst I feel is when someone (family/friend/partner at the time) buys my meal at a special occasion.. for me to rush home to throw it up.\n\nI used to live with my ex, and I'd b/p while he was at work or as SOON as he left to play golf with his friends. I'd time it, too, and was usually right on time. He'd usually come home to me cleaning the kitchen. Everything spotless- vomit disposed.\n..He caught me mid-purge once when he got home earlier than usual. He didn't see it as I was behind the breakfast bar. I told him not to come closer and he just ran to the bathroom saying \"whatever\"\nHe later admitted to me he knew I was purging in the kitchen when he and the cats were asleep :(\n\n\nSpecial honors goes to my fast food and gas station trips late night after work DAILY. I would buy enough food for 2 sessions. Oh yeah, when I was feeling shamless.. my frequent Walmart trips with cart FULL of shit. Multiple times a week. Sooo embarrassing as employees wherever I went wonder why I buy so much food since I look appear as a nice looking girl in nice clothes. I'm 28.. my car trips started at 20... I watch gas station clerks stare at me when I get to my car, so I don't dare take a bite until I'm on the road, which is hard to do. \n\nSPECIAL THANKS to my frequent trips to the dumpster disposing my puke bucket. Neighbors all around wondering wtf this lady has in a mop bucket 🪣 that she can't carry in a single bag. The bag will burst on it's own... I've had it happen in front of a Neighbors apt. \n\nI get funny looks wherever I go unless I'm buying fucking water or like one thing. I hate people.",
          "created_utc": 1682415213.0
        },
        {
          "id": "jhneo99",
          "author": "hallowmean",
          "body": "I feel like I'm a neighbourhood curiosity because I'm always in the same grocery stores buying ridiculous amounts of food. I try to mix up my stores and break up my purchases as much as possible, but there's only so much I can do, you know? I tend to go at the same time each day too, so it's the same staff working the same shifts and it's mortifying, but it doesn't stop me.",
          "created_utc": 1682429414.0
        }
      ]
    },
    {
      "id": "jhxeiic",
      "author": "Ill-Presentation-242",
      "body": "I really thought I was the only one because of how messed up that is. Are things ever going to get better or is this like a no turning back point. Mich love for you too",
      "created_utc": 1682608039.0,
      "score": 2,
      "context": [
        {
          "id": "jhnqfl8",
          "author": "RushWild",
          "body": "I've eaten ice-cream, purged it and eaten the vomit. I've broken promises to my family to take care of myself so many times, on birthdays, anniversaries. \n\nMy day revolves around bulimia, I purge at work, I purge at home, I purge in public bathrooms, I wish I felt a sense of shame but I don't. I've wasted all the love and opportunities I didn't deserve to be given, yet all I care about is food.",
          "created_utc": 1682434403.0
        },
        {
          "id": "jhqoa2n",
          "author": "None",
          "body": "i understand this completely.. somehow reassuring that i’m not the only one who has eaten their vomit. sending so much love <3",
          "created_utc": 1682478633.0
        }
      ]
    },
    {
      "id": "jhnxoev",
      "author": "krolikzajchik",
      "body": "Nooooo I’m so sorry! Hopefully you’re doing better 💞",
      "created_utc": 1682437274.0,
      "score": 2,
      "context": [
        {
          "id": "jhmq6tm",
          "author": "krolikzajchik",
          "body": "I stole food to binge on. Not the most shameful thing I guess but the one I can think of rn",
          "created_utc": 1682413903.0
        },
        {
          "id": "jhnv747",
          "author": "None",
          "body": "i once got caught stealing a rotisserie chicken 😭 and when i lived on a military base i got caught stealing donuts i thought they were gonna get my ass!!!! funny how they never caught me when I was stealing $200+ worth of food",
          "created_utc": 1682436307.0
        }
      ]
    },
    {
      "id": "jhom94f",
      "author": "notsickenough",
      "body": "Omg I did that with a brownie and was so scared and sure someone saw me. Idk if anyone did and was nice enough to not blab but yeah",
      "created_utc": 1682446674.0,
      "score": 3,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        },
        {
          "id": "jhm5hqv",
          "author": "Kdoterin",
          "body": "Damn forgot about my trash donut phase",
          "created_utc": 1682397675.0
        },
        {
          "id": "jhmfuz3",
          "author": "gothbreadbowl",
          "body": "Trash cookie for me lol…and it was in school, the other kids saw me and I was so embarrassed I hid outside the class in the hallway and cried lol",
          "created_utc": 1682404880.0
        }
      ]
    },
    {
      "id": "jhqet8f",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1682474096.0,
      "score": 1,
      "context": [
        {
          "id": "jhkx3bk",
          "author": "astrolink8",
          "body": "mine is spending an inordinate amount on delivery food, making it so that i can't even afford groceries (and doing that every paycheck for years) and then lying to my loved ones and telling them i had been doing better. i think about all the money i could have saved and the healthier food i could have consumed and the trust i could have established.\n\nhowever, i think feeling shame is apart of the disease and can keep us enthralled in it, but we don't need to carry that shame for things we've done while actively struggling with it. just a reminder that you're a lovely person, even if it's hard to believe at times! sending love your way.",
          "created_utc": 1682376383.0
        },
        {
          "id": "jhmuo9h",
          "author": "Realistic-Concept782",
          "body": "Have u recovered?",
          "created_utc": 1682417760.0
        },
        {
          "id": "jhq7n1a",
          "author": "astrolink8",
          "body": "i have not! still actively struggling sadly. just have had a bit better of control over ordering food these days.",
          "created_utc": 1682470812.0
        }
      ]
    },
    {
      "id": "jho2q7h",
      "author": "None",
      "body": "we didn’t have other food 😭",
      "created_utc": 1682439239.0,
      "score": 4,
      "context": [
        {
          "id": "jhlblad",
          "author": "None",
          "body": "I ate dry cat food sitting on the floor of my bathroom",
          "created_utc": 1682383148.0
        },
        {
          "id": "jhnubwf",
          "author": "None",
          "body": "I have eaten the canned wet dog food before and it was actually not bad. I put it on stolen couscous 🥶",
          "created_utc": 1682435968.0
        },
        {
          "id": "jho2fcn",
          "author": "9NUMBERS9",
          "body": "why did you eat wet dog food?",
          "created_utc": 1682439119.0
        }
      ]
    },
    {
      "id": "jlglrft",
      "author": "seanfucksdogs",
      "body": "I work at an ice cream shop, I chew and spit the leftover ice cream in the buckets and bits of left over waffle cone. I thought I was the only one who ate from the trash. I got caught and haven’t done it since ..",
      "created_utc": 1684953543.0,
      "score": 2,
      "context": [
        {
          "id": "jhl2nmi",
          "author": "gothbreadbowl",
          "body": "Eat food out of my trash, eat pieces of butter dipped in sugar lol, stole binge foods, threw up in my living room into a bag while watching tv lmao…the list goes on",
          "created_utc": 1682378900.0
        },
        {
          "id": "jhm5hqv",
          "author": "Kdoterin",
          "body": "Damn forgot about my trash donut phase",
          "created_utc": 1682397675.0
        },
        {
          "id": "jhmfuz3",
          "author": "gothbreadbowl",
          "body": "Trash cookie for me lol…and it was in school, the other kids saw me and I was so embarrassed I hid outside the class in the hallway and cried lol",
          "created_utc": 1682404880.0
        },
        {
          "id": "jhom94f",
          "author": "notsickenough",
          "body": "Omg I did that with a brownie and was so scared and sure someone saw me. Idk if anyone did and was nice enough to not blab but yeah",
          "created_utc": 1682446674.0
        }
      ]
    },
    {
      "id": "jhqetvf",
      "author": "Realistic-Concept782",
      "body": "Good luck!",
      "created_utc": 1682474104.0,
      "score": 2,
      "context": [
        {
          "id": "jhkx3bk",
          "author": "astrolink8",
          "body": "mine is spending an inordinate amount on delivery food, making it so that i can't even afford groceries (and doing that every paycheck for years) and then lying to my loved ones and telling them i had been doing better. i think about all the money i could have saved and the healthier food i could have consumed and the trust i could have established.\n\nhowever, i think feeling shame is apart of the disease and can keep us enthralled in it, but we don't need to carry that shame for things we've done while actively struggling with it. just a reminder that you're a lovely person, even if it's hard to believe at times! sending love your way.",
          "created_utc": 1682376383.0
        },
        {
          "id": "jhmuo9h",
          "author": "Realistic-Concept782",
          "body": "Have u recovered?",
          "created_utc": 1682417760.0
        },
        {
          "id": "jhq7n1a",
          "author": "astrolink8",
          "body": "i have not! still actively struggling sadly. just have had a bit better of control over ordering food these days.",
          "created_utc": 1682470812.0
        },
        {
          "id": "jhqet8f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682474096.0
        }
      ]
    }
  ]
}