{
  "id": "12z61a7",
  "subreddit": "bulimia",
  "author": "smoothbitch420",
  "created_utc": 1682482435.0,
  "title": "He found out",
  "selftext": "My bf was being distant to me for the past few weeks. No intimacy, short conversations, hardly texting me. I finally put my foot down and confronted him. He kept biting his lip and I begged him to tell me what was on his mind.\n\nHe asked if I was sure, that it was heavy stuff. My heart sank and I was certain it was another woman, but I pressed for the information. \n\nHe confessed he’s known about my purging for months. That he thought it was gross so he didn’t kiss me. Felt weird that I threw up meals he made for us. Overall was uncomfortable, but scared for my health. And didn’t want to invade my privacy but wanted me to get better. \n\nWhy am I relieved? And him putting my purging into his perspective really.. helped. It *is* gross. I wouldn’t want to kiss vomit mouth… why am I so okay with throwing up all the time?? What is wrong with me?? Am I really so comfortable with vomiting all of my meals that I forgot how unnatural and weird it is to others? How did my disorder become so normal that I forgot him finding out was even an option? \n\nYour partners may and probably have an idea of what you’re doing. Whether you think so or not. It’s only been a few hours and I’m still having trouble digesting the issue. It doesn’t feel real. He knows my deepest darkest secret… and my secret is no longer precious to me.",
  "url": "https://www.reddit.com/r/bulimia/comments/12z61a7/he_found_out/",
  "score": 111,
  "num_comments": 12,
  "comments": [
    {
      "id": "jhrsdt4",
      "author": "None",
      "body": "It’s not your fault. This disorder will make you do things that seem crazy in outside perspective but the last thing you need to do is beat yourself up for it. It’s an addiction. \n\nI used to babysit all the time and have gotten sick in the homes of families I watched for. I used to look back on these situations and feel absolutely humiliated that I had “the audacity” to do that. \n\nI’ve crashed my car after a really bad purge episode that caused me to drive like a drunk driver afterwards. \n\nI’ve gotten a speeding ticket trying to race home cause I got nervous about binging. \n\nI was rushed to the hospital from a really high blood pressure and low oxygen level reading.\n\nAm I continuing to b/p even after so many wake up calls? Yes. \n\nBut is beating myself up afterwards the last thing I need? Absolutely. \n\nComparing my disorder to any other addiction like drugs/alcohol/etc has made me come more to terms with it. I’ve also learned that my bulimia probably stemmed from unresolved trauma - and it could be the same for you.\n\nEven if the cycle for you continues, and it most likely will, coming to some acceptance of it that you have it might help. Even when you have slip ups, forgive yourself ❤️",
      "created_utc": 1682508255.0,
      "score": 47,
      "context": []
    },
    {
      "id": "jhruwqa",
      "author": "pinoplacentile",
      "body": "i’m happy that at least he cares, after reading so many situations where the SO doesn’t even care, or my own who turns a blind eye to it.",
      "created_utc": 1682509798.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jhsoxo2",
      "author": "ana1571",
      "body": "i’m sorry but “having trouble digesting the issue” heh nice one (but srsly i feel this and i’m glad he communicated how he felt w you)",
      "created_utc": 1682523338.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jhslpyq",
      "author": "Ladybarometer",
      "body": "I told my partner and then if I relapsed, he learned what to look for. I think it helped my too to realize that it's not normal. Well, it reminded me anyway. It helped me want to get better and gave me a little accountability. Mostly, I didn't want to have to deal with the awkwardness of being confronted about it 😬\n\nLike someone else said - it's best to look at it as an addiction. It's something you can seek help for and can stop. Your SO sounds like he wants you to get better. After all, this is something that can have long term health issues. This is something that can result in death. His fear is very valid. \n\nIt's not just partners - as much as we try to hide this, people aren't stupid. They may not immediately make the connection, but they're aware something is wrong.",
      "created_utc": 1682522076.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jhr3nrf",
      "author": "Branch-Much",
      "body": "Oh, my lord 😔. \n\nYes, I suppose purging is gross. Still, I think it’s harsh that he doesn’t want to kiss you because of it- mouth wash and toothpaste exist. It’s an addiction, a mental illness and I’m glad he just wants you to get better. I’m sorry, that sounds like such a confronting experience 😖",
      "created_utc": 1682487968.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jhw6s22",
      "author": "islandrebel",
      "body": "Not wanting to kiss a mouth that tastes like vomit is extremely valid, but he needs to work on his “meals that he made for us” issue. This is not about him and is definitely not a personal slight at him, and he needs to move forward from thinking about it that way.",
      "created_utc": 1682581492.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jhwbqcy",
      "author": "MarriedToAnExJW",
      "body": "I hope this can give you the will you heal and avoid binge/purge. My husband found out about my suicidal thoughts and wanting to self harm and he expressed how much it hurt him. It encouraged me to find new ways to heal and a new therapist and to commit to refraining from behaviour that made me worse.",
      "created_utc": 1682585920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhx6rel",
      "author": "jeweledmoon",
      "body": "Ugh I’m sorry. I feel this in my heart! It seems like he was a little insensitive but like, I understand not understanding bulimia because my family didn’t. They were so cruel over it! \n\nFunny story. I once dated a guy who took me out for omelettes. When I went to the bathroom, he asked if I threw up because he could smell it. I literally didn’t and I was so embarrassed. We ate eggs for Christ sakes! Lol\n\nMy current partner knows I have dealt with this but never brought the issue of “not wanting to kissing me”up (but I’m very adamant on brushing my teeth each and every time) but I’ve recovered off and on for periods of time between 16 years of this. \n\nNow your post has me thinking from his perspective as I slip into another “just one more time-“ kind of month. So thank you for making me think a little outside of my usual box today! \n\nTry not to worry that he knows, it’s not a secret anymore and it couldn’t be forever, anyways! Maybe this will be good for you guys. I hope you feel better!💜",
      "created_utc": 1682604841.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhyq5w2",
      "author": "blondiesdiary",
      "body": "This. \n\nI’ve done so many things that I look back on now & I’m so appalled that I could do such a thing (morally or just weird/gross things). \n\n& it’s weird because I KNOW I did it. I KNOW it happened. But I can’t fathom that I could possibly do something so shameful or gross. \n\nBut I also know A LOT of people can relate to these gross things I’ve done because I’ve seen countless others on here talking about the same things. \n\nAlthough sometimes they feel intertwined, I feel like our ED’s and our true self are two different people. & in the moment, sometimes the ED takes over. But sometimes I can fight it & I’m sure you can relate. \n\nEasier said than done, but try not to be so hard on yourSELF. Just like depression, ED’s aren’t a choice & it’s not as simple as ‘just’ eating, ‘just’ not bingeing, or ‘just’ not purging etc.",
      "created_utc": 1682626603.0,
      "score": 2,
      "context": [
        {
          "id": "jhrsdt4",
          "author": "None",
          "body": "It’s not your fault. This disorder will make you do things that seem crazy in outside perspective but the last thing you need to do is beat yourself up for it. It’s an addiction. \n\nI used to babysit all the time and have gotten sick in the homes of families I watched for. I used to look back on these situations and feel absolutely humiliated that I had “the audacity” to do that. \n\nI’ve crashed my car after a really bad purge episode that caused me to drive like a drunk driver afterwards. \n\nI’ve gotten a speeding ticket trying to race home cause I got nervous about binging. \n\nI was rushed to the hospital from a really high blood pressure and low oxygen level reading.\n\nAm I continuing to b/p even after so many wake up calls? Yes. \n\nBut is beating myself up afterwards the last thing I need? Absolutely. \n\nComparing my disorder to any other addiction like drugs/alcohol/etc has made me come more to terms with it. I’ve also learned that my bulimia probably stemmed from unresolved trauma - and it could be the same for you.\n\nEven if the cycle for you continues, and it most likely will, coming to some acceptance of it that you have it might help. Even when you have slip ups, forgive yourself ❤️",
          "created_utc": 1682508255.0
        }
      ]
    },
    {
      "id": "jhvfibd",
      "author": "randoacc123789",
      "body": "How would they know? I feel like no one in my house knows hahahh well they do, but not about my relapse🥶",
      "created_utc": 1682564050.0,
      "score": 1,
      "context": [
        {
          "id": "jhslpyq",
          "author": "Ladybarometer",
          "body": "I told my partner and then if I relapsed, he learned what to look for. I think it helped my too to realize that it's not normal. Well, it reminded me anyway. It helped me want to get better and gave me a little accountability. Mostly, I didn't want to have to deal with the awkwardness of being confronted about it 😬\n\nLike someone else said - it's best to look at it as an addiction. It's something you can seek help for and can stop. Your SO sounds like he wants you to get better. After all, this is something that can have long term health issues. This is something that can result in death. His fear is very valid. \n\nIt's not just partners - as much as we try to hide this, people aren't stupid. They may not immediately make the connection, but they're aware something is wrong.",
          "created_utc": 1682522076.0
        }
      ]
    },
    {
      "id": "jiml3md",
      "author": "smoothbitch420",
      "body": "I totally get where he’s coming from though because I read on edtwt that using mouthwash/brushing teeth after purging makes your teeth WORSE… but also now I think why tf was I believing strangers on twitter??!! Was I that delusional?? I’m five days purge free now. I feel amazing.",
      "created_utc": 1683069031.0,
      "score": 1,
      "context": [
        {
          "id": "jhr3nrf",
          "author": "Branch-Much",
          "body": "Oh, my lord 😔. \n\nYes, I suppose purging is gross. Still, I think it’s harsh that he doesn’t want to kiss you because of it- mouth wash and toothpaste exist. It’s an addiction, a mental illness and I’m glad he just wants you to get better. I’m sorry, that sounds like such a confronting experience 😖",
          "created_utc": 1682487968.0
        }
      ]
    },
    {
      "id": "jin7xtm",
      "author": "Branch-Much",
      "body": "Aww congratulations!! Five days is a huge effort. \n\nAlso, I think using mouthwash and brushing your teeth is inadvisable for 20 mins immediately after purging, but afterwards is fine.",
      "created_utc": 1683079133.0,
      "score": 1,
      "context": [
        {
          "id": "jhr3nrf",
          "author": "Branch-Much",
          "body": "Oh, my lord 😔. \n\nYes, I suppose purging is gross. Still, I think it’s harsh that he doesn’t want to kiss you because of it- mouth wash and toothpaste exist. It’s an addiction, a mental illness and I’m glad he just wants you to get better. I’m sorry, that sounds like such a confronting experience 😖",
          "created_utc": 1682487968.0
        },
        {
          "id": "jiml3md",
          "author": "smoothbitch420",
          "body": "I totally get where he’s coming from though because I read on edtwt that using mouthwash/brushing teeth after purging makes your teeth WORSE… but also now I think why tf was I believing strangers on twitter??!! Was I that delusional?? I’m five days purge free now. I feel amazing.",
          "created_utc": 1683069031.0
        }
      ]
    }
  ]
}