{
  "id": "1362fbf",
  "subreddit": "bulimia",
  "author": "Minute-Ad-629",
  "created_utc": 1683066469.0,
  "title": "Do you guys lose weight from purging?",
  "selftext": "I know its different for everyone but i feel like no matter how often i purge i just wont lose weight anymore. Its so frustrating because if i dont purge i gain weight and when i do purge im just staying at my weight so its a continuous cycle all the time. From the last 3 years of purging i did lose a good amount of weight but i just cant lose weight anymore and it sucksssss. Anyone else feel this way🥲",
  "url": "https://www.reddit.com/r/bulimia/comments/1362fbf/do_you_guys_lose_weight_from_purging/",
  "score": 76,
  "num_comments": 89,
  "comments": [
    {
      "id": "jimhego",
      "author": "addblocc",
      "body": "I've never lost weight from purging. At my most frequent times of purging I've only maintained. Since becoming bulimic my weight has only gradually increased. Wish whatever part of my brain that holds the eating disorder would wake up and realize purging isn't worth it.",
      "created_utc": 1683067389.0,
      "score": 90,
      "context": []
    },
    {
      "id": "jimx1wd",
      "author": "J3Ess1cA",
      "body": "Initially at the height of my ED I lost heaps of weight. But then at some point I stopped losing,  now I’m stuck losing and gaining the same 3kg, no matter how much I purge.",
      "created_utc": 1683074394.0,
      "score": 52,
      "context": []
    },
    {
      "id": "jioliqq",
      "author": "Mundane-Jeweler6728",
      "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
      "created_utc": 1683112582.0,
      "score": 38,
      "context": []
    },
    {
      "id": "jimuvyp",
      "author": "None",
      "body": "for some reason i always do but it’s ruined my life.",
      "created_utc": 1683073431.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jin45h2",
      "author": "Longjumping_Tea4361",
      "body": "I typically gained weight from bingeing and purging. I would eat so much and stretch out my stomach. So even after purging I was usually hungry again that day and then especially the next day. \nI also would typically eat carbs and desserts so would crave that more in the days after my purge as well. It is such a vicious cycle. I wish you luck.",
      "created_utc": 1683077499.0,
      "score": 30,
      "context": []
    },
    {
      "id": "jimw5h9",
      "author": "None",
      "body": "Yes and no. When I was heavily restricting in conjunction with the binges, yes and a lot. Other than that, for me it's more preventative for gaining weight, so i guess it just depends how you eat otherwise",
      "created_utc": 1683073994.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jinjfhb",
      "author": "Pure_Zebra1604",
      "body": "I have and that’s part of what makes it so hard to stop.",
      "created_utc": 1683084444.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jinrimd",
      "author": "None",
      "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
      "created_utc": 1683088830.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jip1yjb",
      "author": "little-pinkie",
      "body": "No I never lost weight while purging but I did lose my sanity",
      "created_utc": 1683121208.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jioju8b",
      "author": "None",
      "body": "I'm currently sucked back into this purging thing. I've never binged, even on normal days when I'm not purging, I'm in a calorie deficient, but these days I am back to purging again and I'm losing weight rapidly. It's getting really dangerous. My stomach and throat hurt all the time. I wish I could stop.",
      "created_utc": 1683111452.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jimvn66",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1683073768.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jimuwfk",
      "author": "wearenotreal1",
      "body": "I have! Not saying this to encourage the behavior in any way, my health is compromised, but I have. It's definitely different for everyone.",
      "created_utc": 1683073437.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jinqrzp",
      "author": "SinfullySinatra",
      "body": "I don’t usually purge, I mostly am in a binge-restrict cycle but I rarely loose much weight from it and I often gain it back.",
      "created_utc": 1683088435.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jio0z46",
      "author": "KnowledgeJazzlike803",
      "body": "Yes and it’s hard to stop",
      "created_utc": 1683095371.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jio51uz",
      "author": "Sea_Jellyfish_2380",
      "body": "Yeah. I started purging regular meals that were part of my daily intake but then also purging my 2x a week binges. I was losing weight after these binges when usually in the past I would maintain! I think it’s because I overestimate how many calories im binging on and underestimate how much im actually throwing up. It’s so dangerous though and literally consumes so much of your time & psychical energy I am not the person I used to be! </3",
      "created_utc": 1683098748.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jiowihh",
      "author": "Ladybarometer",
      "body": "Recently started losing slowly as I get more and more consistent with recovery. Even in the worst part of my illness I was just losing and gaining the same 15-20lbs over and over. Now I'm eating normally, on medication, and don't let myself feel deprived - my weight seems to be more steady now. Literally my entire body is feeling better, because it's getting what it needs. I'm trying to improve my metabolism with good sleep and exercise so I can see a loss . I stopping weighing everyday too, since that was triggering. Whatever is immediately on the scale that day or even the next day is not real. It's not fat. It's water weight/retention OR dehydration. \n\nNot losing weight is still frustrating for me, but I don't feel like I'm dying anymore or dealing with the anxiety that maybe \\*this\\* time would be the time I destroy my self permanently or worse - I'm happy with that trade.",
      "created_utc": 1683118663.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ka1beh7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1700499532.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jinl8kt",
      "author": "imzslv",
      "body": "Not really, though. If anything, I’ve been maintaining!",
      "created_utc": 1683085391.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jioe3m6",
      "author": "ed_mayo_onlyfans",
      "body": "No I gain weight when in b/p cycle",
      "created_utc": 1683106942.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jioj79l",
      "author": "nizzhof1",
      "body": "Unfortunately the whole reason we are all here is because humans have adapted to survive starving to death. If you deprive a human being calories our bodies will store whatever calories they do ingest so purging usually just ends up making the next meal stick around that much more. Sure, if you were diligent enough about not consuming calories you would lose weight but since that isn’t always realistic the next meal or binge will likely make up for the lost calories from the previous purge. The only real way to do it is eating enough healthy food and that sucks because I’m deeply mentally broken lol.",
      "created_utc": 1683111011.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jj9hfkl",
      "author": "None",
      "body": "Yes, lost weight... initially. Also lost my health, my dignity, my self respect, my husband, my friends. It was NEVER worth it.",
      "created_utc": 1683497069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "le9ei7a",
      "author": "InevitableBright5946",
      "body": "Christ loves you beyond comprehension turn to him ",
      "created_utc": 1721586016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lict7u2",
      "author": "FairBackground5306",
      "body": "Ive been bulimic for over 3 years now and all of the sudden ive lost a little bit over  10 kg in the past few months.The only time I lost some weight was after I’ve started purging bc I heavily binged the weeks before starting.Sorry for my bad English ",
      "created_utc": 1723781717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8cjfdi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1699446291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0i87n8",
      "author": "brattyappledrops",
      "body": "I would assume it’s because everyone is different I personally go up and down with weight lose and gain",
      "created_utc": 1713647271.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbq2ce3",
      "author": "zozo352",
      "body": "I’d say probably yes? I have lost quite a lot of weight over the past months while binging and purging multiple times a week. But I do also heavily restrict outside of my b/p episodes, so I’m not sure how much of the weight loss is really due to purging",
      "created_utc": 1720174686.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llj6x6c",
      "author": "Confident-Light3924",
      "body": "I lost a concerning amount of weight. I still don’t really understand how since everyone keeps saying purging doesn’t get rid of all the cals. At my lowest i was laying half dead in the hospital bc my bmi was too low for inpatient, i was so out of it that i was adement i had a binge eating disorder. Not to mention my heart was starting to fail because of my potassium being fawked. -1000000/10 i would never wish ana b/p on my worst enemy, god bless recovery🫂",
      "created_utc": 1725486046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lozg25n",
      "author": "Proud_Court_2652",
      "body": "Idk I did lose weight from purging but only because I think my “binges” were small (a whole chocolate bar or a family size bag of chips) you know like 500-1400 calories but combined with working out everyday and being a literal heroine addict -at first just Adderall but eventually you still get hungry on uppers like that and you just eat more because you have no impulse control. - I def got extremely under weight. The only problem was my ED was so bad if I ate anything I would feel like the whole day was ruined and I couldnt leave the house. I lost my job. My friends. My whole life. And dont even get me started on the drug addiction… the irony is when it was all over and I finally got clean I gained it all back in 2 months and realized I shouldve never bothered with trying to lose any crazy weight like that in the first place bc, in the end, your body knows where it wants to be and if you listen to it, it will maintain a healthy weight.",
      "created_utc": 1727333900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqs7tmq",
      "author": "Kay_567",
      "body": "Yes I did. I never weighed myself through the process because I knew that using a scale would just make things worse. But it must have been around 20+ lbs (at least that’s what multiple people told me) from February to May. I also went from a medium to an extra small in shirt size, for reference. Not only did I loose some weight but I also started loosing my hair, i lost my good grades in school, i lost my feminine cycle, i become unintentionally distant with my friends and my partner, i almost lost my 2 year relationship, i was in a “bad mood” 25/8, my nails would take forever to grow, i lost all the undertones in my face i looked pale/grey, i had under eye bags that would never cover (no matter how much concealer I would use). Also what was unfortunate in my case was my weight distribution, so i did loose belly fat but that was the basically the last place i was loosing from and which is why i did this for so long. I became underweight and had the bmi of about 13 (I’m 5’8). At some point i did stop loosing (july). I also forced myself to semi recover because I wanted to stop being so mean to the people that loved me most ( my family and my boyfriend). Not only that but people started to notice we’re making comments to my mom at family outings (some people didn’t think it was an ed and thought I had cancer) that was when I knew I had to stop. But I cant stop, it doesn’t ever just stop, the feeling of always needing to loose weight and being thin always outgrows my want to get better. Of course some days are worse than others but I have stopped b/p as much as I used to. And I still haven’t gotten my period back (if you have any tips to help with this please let me know!!). I think this process would have went by quicker if i did get professional help but I didn’t want to put my schooling on pause (especially now that I’m in my last year). Wishing you all the best and hope you all get better one day. Please don’t let this take over your life.",
      "created_utc": 1728312175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsyi2xx",
      "author": "Jealous-Raspberry-77",
      "body": "Yes i did, went from 70 kg to 44 kg in like 3 months",
      "created_utc": 1729484349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv5ph3f",
      "author": "Weak_Extent_2386",
      "body": "yes, i lost 5 kg less than a week",
      "created_utc": 1730629856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmu7swm",
      "author": "Realistic-Bug-7734",
      "body": "I weighed yesterday and I had lost 20 pounds in the last year. It’s been a noticeable amount and it was through pure purging bc I have been so fatigued and low energy all I basically do is work, sleep, and purge (I’m in a stress induced relapse after years of not purging and actively trying to get better). I’ve been stagnant in my weight for years so it’s making me shed easily like when I was a teenager (I’m 27 for reference)",
      "created_utc": 1744513859.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqs4lf4",
      "author": "chloexhensey",
      "body": "I’m really late to this thread but if I’m purging and not binging at all will I loose weight? I’m walking everyday for an hour on a treadmill and purging surely I’ll have to loose weight right?",
      "created_utc": 1746481538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jio1asd",
      "author": "prostateversace",
      "body": "At first. then gained it all back and some more lol",
      "created_utc": 1683095634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jio47rc",
      "author": "burntbroccoliass",
      "body": "I do but now I have Barrett’s Esophagus and Gastroparesis so my digestive system is screwed up because of it",
      "created_utc": 1683098030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jioe2ph",
      "author": "None",
      "body": "I did at first, but very soon, it started making me gain a ton. By the time that happened, I was stuck in the cycle and couldn't stop. It has been the bane of my existence that I wasted my life doing something that gives me the opposite effect that I wanted.",
      "created_utc": 1683106920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiofutm",
      "author": "me0woof",
      "body": "Is it really accurate that b/p’ing causes weight gain? I have ednos (currently~) and I feel I’m gaining weight but my people near me tell me I’m losing. Is it possible to be losing. I’m\nSo lost.",
      "created_utc": 1683108434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiolfjv",
      "author": "vbgirl24",
      "body": "At best I maintain my weight with binging and purging, but I easily gain if I get lazy with it. I lose weight if I restrict outside of my BP episodes",
      "created_utc": 1683112526.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jioopk8",
      "author": "Several-Giraffe1930",
      "body": "i am now 136 from 220 when my disorder began. (previously 360 but i lost 140 the right way- disorder began once i hit 220) i continue to lose weight B&Ping. last week i was 139. i’ve been bulimic for almost 5 years. the weight loss slowed DRASTICALLY after i hit about 160. it’s taken at least a year to get from 160 to 136 BPibg.",
      "created_utc": 1683114530.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiorgm4",
      "author": "zbordesoare",
      "body": "Everyday somebody asks this.",
      "created_utc": 1683116081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jip0vrz",
      "author": "turnipkitty112",
      "body": "I lost quite a bit of weight and got underweight while b/ping multiple times a day, but then after a while it stalled. Partially bc the frequency of b/p kept increasing. I’ve been gradually decreasing b/p frequency over the past few months and had been losing and gaining the same 2kg. I think part of it was also that my intake (outside of b/p) had gotten very low so when I increased it there was a bit of weight gain while my body adjusted. And I went through a little phase where I was trying to quit while simultaneously increasing my cal intake and had some extreme hunger episodes, after which I’d purge but bc it wasn’t planned I ended up absorbing quite a lot of food from them. Now I do seem to be losing weight again with the OCCASIONAL b/p but it is slower than expected and if I b/p more than about 3-4x a week I maintain. The other problem is that the constant quitting-then-giving-in-again cycle is causing recurrent water retention.\n\nHonestly though, even if you do lose weight from b/p that doesn’t make it worth it AT ALL. The health effects, and overall impact on your life is so awful.",
      "created_utc": 1683120720.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jip4d68",
      "author": "dizziestbaby",
      "body": "depends, if all i ever do is b/p i usually maintain but there’s those sometimes i gain a pound. sometimes i lose weight if i didn’t eat that much to begin with but it’s just not worth it hate purging bro. it’s the worst the side effects are terrible and u don’t even lose weight lol",
      "created_utc": 1683122256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jipiqq4",
      "author": "randomismysecondname",
      "body": "I used to lose a lot of weight, yeah. But now all I do is gaining weight which is super frustrating and triggers another b&p and so it goes on and on",
      "created_utc": 1683128039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiqnuzc",
      "author": "duskmoon222",
      "body": "nope. the only reason i do it is because my stomach feels smaller due to my new weight, and i unknowingly eat too much, so i feel uncomfortable till i purge :/",
      "created_utc": 1683143965.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiqv2l4",
      "author": "CABGPatchRN",
      "body": "I steadily gained almost 15-20 pounds over my 17 years of bulimia (granted some of this is body development, so probably closer to 15) and it rapidly increased the last few years.\n\nI’ve been a little over 30 days “clean” of bulimia and I’ve noticed my bloat going down. I am trying to not weigh myself because part of my recovery plan is to focus first on avoiding the binges and purges, the rest I will sort out later. \n\nLong story short I think when you’re younger you don’t notice much weight gain or maybe even lose (younger metabolism, plus I worked out a LOT more because I had more time when younger).",
      "created_utc": 1683146767.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jiuex03",
      "author": "Glittering-Pair-3887",
      "body": "throwing up makes me so depressed the day after and it makes my stomach bloated face bloated and everything  hurts wish i would just stop over eating",
      "created_utc": 1683215708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0j8hg3",
      "author": "InternationalPeach2k",
      "body": "Do you do it on every meal?",
      "created_utc": 1694689169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kb88gn0",
      "author": "throwRAgrrr",
      "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
      "created_utc": 1701237728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jipdxyn",
      "author": "atreyu947",
      "body": "Same. But my dumb brain thinks eating all the food I want (and don’t want) without gaining weight is worth it 😔\nEdit: also when I purged constantly I did lose weight but it wasn’t even noticeable lol.",
      "created_utc": 1683126158.0,
      "score": 13,
      "context": [
        {
          "id": "jimhego",
          "author": "addblocc",
          "body": "I've never lost weight from purging. At my most frequent times of purging I've only maintained. Since becoming bulimic my weight has only gradually increased. Wish whatever part of my brain that holds the eating disorder would wake up and realize purging isn't worth it.",
          "created_utc": 1683067389.0
        }
      ]
    },
    {
      "id": "jir5oy8",
      "author": "Honest-Stable5612",
      "body": "Probably because your metabolism is fucked. I gained weight back pretty quickly when i started recovery but i was kind of mentally prepared and kept being active so i didn’t feel unhealthy or anything. My body needed that weight. Now my metabolism is almost back to normal i think and i feel very good the best ive ever felt in terms of body image.",
      "created_utc": 1683151000.0,
      "score": 13,
      "context": [
        {
          "id": "jimx1wd",
          "author": "J3Ess1cA",
          "body": "Initially at the height of my ED I lost heaps of weight. But then at some point I stopped losing,  now I’m stuck losing and gaining the same 3kg, no matter how much I purge.",
          "created_utc": 1683074394.0
        }
      ]
    },
    {
      "id": "jiop574",
      "author": "Luckypenny4683",
      "body": "I see you sis",
      "created_utc": 1683114783.0,
      "score": 3,
      "context": [
        {
          "id": "jimx1wd",
          "author": "J3Ess1cA",
          "body": "Initially at the height of my ED I lost heaps of weight. But then at some point I stopped losing,  now I’m stuck losing and gaining the same 3kg, no matter how much I purge.",
          "created_utc": 1683074394.0
        }
      ]
    },
    {
      "id": "kul238o",
      "author": "Desperate_Fault3506",
      "body": "dude me too let me know if you find out how to stop",
      "created_utc": 1710279950.0,
      "score": 3,
      "context": [
        {
          "id": "jimx1wd",
          "author": "J3Ess1cA",
          "body": "Initially at the height of my ED I lost heaps of weight. But then at some point I stopped losing,  now I’m stuck losing and gaining the same 3kg, no matter how much I purge.",
          "created_utc": 1683074394.0
        }
      ]
    },
    {
      "id": "jis3hxc",
      "author": "BodyRewind",
      "body": "omg girl we are the same i feel you it’s so comforting to see we’re not alone",
      "created_utc": 1683165943.0,
      "score": 12,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        }
      ]
    },
    {
      "id": "kbksk70",
      "author": "Aggressive-Thanks-60",
      "body": "Have you gotten medical issues being at that bmi?",
      "created_utc": 1701454186.0,
      "score": 3,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        }
      ]
    },
    {
      "id": "l4bqgh0",
      "author": "Conscious_Area_8397",
      "body": "Per day? How are you able to do that?",
      "created_utc": 1715876450.0,
      "score": 2,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        }
      ]
    },
    {
      "id": "jioov9f",
      "author": "Several-Giraffe1930",
      "body": "this. it’s taken me 5 years of being bulimic to realize that being thin was never the answer.",
      "created_utc": 1683114624.0,
      "score": 10,
      "context": [
        {
          "id": "jinrimd",
          "author": "None",
          "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
          "created_utc": 1683088830.0
        }
      ]
    },
    {
      "id": "lvjhqqc",
      "author": "Practical-Oil-8717",
      "body": "how are you now",
      "created_utc": 1730822850.0,
      "score": 1,
      "context": [
        {
          "id": "jioju8b",
          "author": "None",
          "body": "I'm currently sucked back into this purging thing. I've never binged, even on normal days when I'm not purging, I'm in a calorie deficient, but these days I am back to purging again and I'm losing weight rapidly. It's getting really dangerous. My stomach and throat hurt all the time. I wish I could stop.",
          "created_utc": 1683111452.0
        }
      ]
    },
    {
      "id": "kx8llob",
      "author": "Glittering_Agency244",
      "body": "how much/how fast?",
      "created_utc": 1711796980.0,
      "score": 1,
      "context": [
        {
          "id": "jimuwfk",
          "author": "wearenotreal1",
          "body": "I have! Not saying this to encourage the behavior in any way, my health is compromised, but I have. It's definitely different for everyone.",
          "created_utc": 1683073437.0
        }
      ]
    },
    {
      "id": "kb55ltx",
      "author": "Ok-Ad4217",
      "body": "Have you gotten your thyroid checked out?",
      "created_utc": 1701193341.0,
      "score": 2,
      "context": [
        {
          "id": "ka1beh7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1700499532.0
        }
      ]
    },
    {
      "id": "kbdkwrp",
      "author": "Embarrassed-Date7376",
      "body": "Shut the fuck up",
      "created_utc": 1701329330.0,
      "score": 5,
      "context": [
        {
          "id": "k8cjfdi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699446291.0
        }
      ]
    },
    {
      "id": "kccfird",
      "author": "None",
      "body": "This is not pro-recovery. This is just encouraging weight loss even tho 1200 calories is way too small",
      "created_utc": 1701939737.0,
      "score": 3,
      "context": [
        {
          "id": "k8cjfdi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699446291.0
        }
      ]
    },
    {
      "id": "kcdafby",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1701959615.0,
      "score": 3,
      "context": [
        {
          "id": "k8cjfdi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699446291.0
        }
      ]
    },
    {
      "id": "kb54dum",
      "author": "Ok-Ad4217",
      "body": "Yup ! That’s exactly what I’m doing but I do allow myself to have a good snack as long as I stay within the 1200 cal deficit and getting a ninja creamy has been a game changer!",
      "created_utc": 1701192912.0,
      "score": 1,
      "context": [
        {
          "id": "k8cjfdi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699446291.0
        }
      ]
    },
    {
      "id": "mfhhw0l",
      "author": "Mental_Cry7167",
      "body": "how long did you do it for??? and would you throw up after every meal?? did you binge?? did you workout??",
      "created_utc": 1740859377.0,
      "score": 1,
      "context": [
        {
          "id": "llj6x6c",
          "author": "Confident-Light3924",
          "body": "I lost a concerning amount of weight. I still don’t really understand how since everyone keeps saying purging doesn’t get rid of all the cals. At my lowest i was laying half dead in the hospital bc my bmi was too low for inpatient, i was so out of it that i was adement i had a binge eating disorder. Not to mention my heart was starting to fail because of my potassium being fawked. -1000000/10 i would never wish ana b/p on my worst enemy, god bless recovery🫂",
          "created_utc": 1725486046.0
        }
      ]
    },
    {
      "id": "mabudi5",
      "author": "Typical_Ad_7291",
      "body": "What was your job",
      "created_utc": 1738386089.0,
      "score": 1,
      "context": [
        {
          "id": "lozg25n",
          "author": "Proud_Court_2652",
          "body": "Idk I did lose weight from purging but only because I think my “binges” were small (a whole chocolate bar or a family size bag of chips) you know like 500-1400 calories but combined with working out everyday and being a literal heroine addict -at first just Adderall but eventually you still get hungry on uppers like that and you just eat more because you have no impulse control. - I def got extremely under weight. The only problem was my ED was so bad if I ate anything I would feel like the whole day was ruined and I couldnt leave the house. I lost my job. My friends. My whole life. And dont even get me started on the drug addiction… the irony is when it was all over and I finally got clean I gained it all back in 2 months and realized I shouldve never bothered with trying to lose any crazy weight like that in the first place bc, in the end, your body knows where it wants to be and if you listen to it, it will maintain a healthy weight.",
          "created_utc": 1727333900.0
        }
      ]
    },
    {
      "id": "mabumeg",
      "author": "Typical_Ad_7291",
      "body": "Did your period come back ? If not a gyno can help with a med that kickstarts",
      "created_utc": 1738386198.0,
      "score": 1,
      "context": [
        {
          "id": "lqs7tmq",
          "author": "Kay_567",
          "body": "Yes I did. I never weighed myself through the process because I knew that using a scale would just make things worse. But it must have been around 20+ lbs (at least that’s what multiple people told me) from February to May. I also went from a medium to an extra small in shirt size, for reference. Not only did I loose some weight but I also started loosing my hair, i lost my good grades in school, i lost my feminine cycle, i become unintentionally distant with my friends and my partner, i almost lost my 2 year relationship, i was in a “bad mood” 25/8, my nails would take forever to grow, i lost all the undertones in my face i looked pale/grey, i had under eye bags that would never cover (no matter how much concealer I would use). Also what was unfortunate in my case was my weight distribution, so i did loose belly fat but that was the basically the last place i was loosing from and which is why i did this for so long. I became underweight and had the bmi of about 13 (I’m 5’8). At some point i did stop loosing (july). I also forced myself to semi recover because I wanted to stop being so mean to the people that loved me most ( my family and my boyfriend). Not only that but people started to notice we’re making comments to my mom at family outings (some people didn’t think it was an ed and thought I had cancer) that was when I knew I had to stop. But I cant stop, it doesn’t ever just stop, the feeling of always needing to loose weight and being thin always outgrows my want to get better. Of course some days are worse than others but I have stopped b/p as much as I used to. And I still haven’t gotten my period back (if you have any tips to help with this please let me know!!). I think this process would have went by quicker if i did get professional help but I didn’t want to put my schooling on pause (especially now that I’m in my last year). Wishing you all the best and hope you all get better one day. Please don’t let this take over your life.",
          "created_utc": 1728312175.0
        }
      ]
    },
    {
      "id": "m6ny7l0",
      "author": "Intrepid-Bass-3683",
      "body": "please tell me how",
      "created_utc": 1736641618.0,
      "score": 1,
      "context": [
        {
          "id": "lsyi2xx",
          "author": "Jealous-Raspberry-77",
          "body": "Yes i did, went from 70 kg to 44 kg in like 3 months",
          "created_utc": 1729484349.0
        }
      ]
    },
    {
      "id": "m2khqnp",
      "author": "Fun-Permit-983",
      "body": "pls tell me how🙏",
      "created_utc": 1734475498.0,
      "score": 1,
      "context": [
        {
          "id": "lv5ph3f",
          "author": "Weak_Extent_2386",
          "body": "yes, i lost 5 kg less than a week",
          "created_utc": 1730629856.0
        }
      ]
    },
    {
      "id": "jiop0ma",
      "author": "Several-Giraffe1930",
      "body": "i feel this so deeply. it’s taken me 5 years of being bulimic to realize that the being thin was never the answer.",
      "created_utc": 1683114711.0,
      "score": 1,
      "context": [
        {
          "id": "jioe2ph",
          "author": "None",
          "body": "I did at first, but very soon, it started making me gain a ton. By the time that happened, I was stuck in the cycle and couldn't stop. It has been the bane of my existence that I wasted my life doing something that gives me the opposite effect that I wanted.",
          "created_utc": 1683106920.0
        }
      ]
    },
    {
      "id": "mabuwf5",
      "author": "Typical_Ad_7291",
      "body": "Why dinner",
      "created_utc": 1738386326.0,
      "score": 1,
      "context": [
        {
          "id": "kb88gn0",
          "author": "throwRAgrrr",
          "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
          "created_utc": 1701237728.0
        }
      ]
    },
    {
      "id": "lzzhafz",
      "author": "Nevaeh_Angel",
      "body": "What do u think",
      "created_utc": 1733111809.0,
      "score": 7,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        },
        {
          "id": "kbksk70",
          "author": "Aggressive-Thanks-60",
          "body": "Have you gotten medical issues being at that bmi?",
          "created_utc": 1701454186.0
        }
      ]
    },
    {
      "id": "l97rls9",
      "author": "Mundane-Jeweler6728",
      "body": "I was very very very sick back then and I was forced into inpatient treatment not long after I wrote that comment... Honestly, I don't know how I was able to it for so long - it's just the illness that makes you keep going...Now  I'm in recovery and trying to fight this evil disorder... I've gained weight and no longer have a BMI in the 12s... Honestly I don't know what my weight is now because I don't weigh myself anymore, but I'm pretty sure it's under BMI 18... It's hard for me to accept my \"new\" body, and people keep telling me it will get better... But I honestly doubt it. It has been 6 months and I still can't cope being in this body... I honestly just want to go back... I don't think I will ever get better, my mind is still obsessed with the thought of losing weight... I still b/p every single day... I walk around 13.000-15.000 steps a day, but I really want to get more steps in, but I can't because I live in a residential home for people with eating disorders. I've lived here for about 1.5 years and I'm so lonely and unhappy and I don't think I want to keep going... I hate my life\n\nI'm sorry... It wasn't supposed to be so long... I hope I make sense, English is not my mother language...",
      "created_utc": 1718745299.0,
      "score": 8,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        },
        {
          "id": "l4bqgh0",
          "author": "Conscious_Area_8397",
          "body": "Per day? How are you able to do that?",
          "created_utc": 1715876450.0
        }
      ]
    },
    {
      "id": "jiowozg",
      "author": "Ladybarometer",
      "body": "Exactly. There are worse things than gaining weight, especially when an ED is involved. MUCH worse.",
      "created_utc": 1683118753.0,
      "score": 6,
      "context": [
        {
          "id": "jinrimd",
          "author": "None",
          "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
          "created_utc": 1683088830.0
        },
        {
          "id": "jioov9f",
          "author": "Several-Giraffe1930",
          "body": "this. it’s taken me 5 years of being bulimic to realize that being thin was never the answer.",
          "created_utc": 1683114624.0
        }
      ]
    },
    {
      "id": "lzr4abr",
      "author": "redsweater56",
      "body": "so late to this thread😭 i truly think i would be so much happier in my dream body, like genuinely even if it sounds ironic or untrue. i’m tired of obsessing over old pictures of myself when i was slightly skinnier and psychoanalyzing my body in the mirror and counting calories and constantly doing research on how to lose weight or have a thinner waist. it’s all i think about atp and i just want to get there so it won’t be on my mind anymore",
      "created_utc": 1732993435.0,
      "score": 2,
      "context": [
        {
          "id": "jinrimd",
          "author": "None",
          "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
          "created_utc": 1683088830.0
        },
        {
          "id": "jioov9f",
          "author": "Several-Giraffe1930",
          "body": "this. it’s taken me 5 years of being bulimic to realize that being thin was never the answer.",
          "created_utc": 1683114624.0
        }
      ]
    },
    {
      "id": "lkhk7ow",
      "author": "GlitterMagicSong",
      "body": "Not me thinking \"nah they're all wrong, I'm not like the others, I'm different and once I'm skinny I'll be the happiest I ever been\" 💀 You were right it sucks, And shittiest part is I dug myself a hole I can't even climb out of. I still have my body dysmorphia, same as it was when I was overweight.",
      "created_utc": 1724931921.0,
      "score": 1,
      "context": [
        {
          "id": "jinrimd",
          "author": "None",
          "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
          "created_utc": 1683088830.0
        },
        {
          "id": "jioov9f",
          "author": "Several-Giraffe1930",
          "body": "this. it’s taken me 5 years of being bulimic to realize that being thin was never the answer.",
          "created_utc": 1683114624.0
        }
      ]
    },
    {
      "id": "lvjnza3",
      "author": "None",
      "body": "Hey, I’m actually doing pretty well now! I eat normally, and no more purging. I’m feeling good :3",
      "created_utc": 1730824682.0,
      "score": 1,
      "context": [
        {
          "id": "jioju8b",
          "author": "None",
          "body": "I'm currently sucked back into this purging thing. I've never binged, even on normal days when I'm not purging, I'm in a calorie deficient, but these days I am back to purging again and I'm losing weight rapidly. It's getting really dangerous. My stomach and throat hurt all the time. I wish I could stop.",
          "created_utc": 1683111452.0
        },
        {
          "id": "lvjhqqc",
          "author": "Practical-Oil-8717",
          "body": "how are you now",
          "created_utc": 1730822850.0
        }
      ]
    },
    {
      "id": "kx8vs1a",
      "author": "wearenotreal1",
      "body": "30lbs in about 3-4 months\nPeriods of gaining and losing prolonged the time but yh",
      "created_utc": 1711802860.0,
      "score": 1,
      "context": [
        {
          "id": "jimuwfk",
          "author": "wearenotreal1",
          "body": "I have! Not saying this to encourage the behavior in any way, my health is compromised, but I have. It's definitely different for everyone.",
          "created_utc": 1683073437.0
        },
        {
          "id": "kx8llob",
          "author": "Glittering_Agency244",
          "body": "how much/how fast?",
          "created_utc": 1711796980.0
        }
      ]
    },
    {
      "id": "maf7w01",
      "author": "throwRAgrrr",
      "body": "Because I didn't want my boyfriend to know. I'm only purging dinner now because it's the biggest meal of the day and I don't want my coworkers to know.",
      "created_utc": 1738437152.0,
      "score": 1,
      "context": [
        {
          "id": "kb88gn0",
          "author": "throwRAgrrr",
          "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
          "created_utc": 1701237728.0
        },
        {
          "id": "mabuwf5",
          "author": "Typical_Ad_7291",
          "body": "Why dinner",
          "created_utc": 1738386326.0
        }
      ]
    },
    {
      "id": "l9aflia",
      "author": "Conscious_Area_8397",
      "body": "Wow, even if you don't feel good right now, recovery is the way. I really hope you get better soon, and enough to get out of there. You are brave even if you don't feel like you are.",
      "created_utc": 1718793510.0,
      "score": 4,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        },
        {
          "id": "l4bqgh0",
          "author": "Conscious_Area_8397",
          "body": "Per day? How are you able to do that?",
          "created_utc": 1715876450.0
        },
        {
          "id": "l97rls9",
          "author": "Mundane-Jeweler6728",
          "body": "I was very very very sick back then and I was forced into inpatient treatment not long after I wrote that comment... Honestly, I don't know how I was able to it for so long - it's just the illness that makes you keep going...Now  I'm in recovery and trying to fight this evil disorder... I've gained weight and no longer have a BMI in the 12s... Honestly I don't know what my weight is now because I don't weigh myself anymore, but I'm pretty sure it's under BMI 18... It's hard for me to accept my \"new\" body, and people keep telling me it will get better... But I honestly doubt it. It has been 6 months and I still can't cope being in this body... I honestly just want to go back... I don't think I will ever get better, my mind is still obsessed with the thought of losing weight... I still b/p every single day... I walk around 13.000-15.000 steps a day, but I really want to get more steps in, but I can't because I live in a residential home for people with eating disorders. I've lived here for about 1.5 years and I'm so lonely and unhappy and I don't think I want to keep going... I hate my life\n\nI'm sorry... It wasn't supposed to be so long... I hope I make sense, English is not my mother language...",
          "created_utc": 1718745299.0
        }
      ]
    },
    {
      "id": "lc08hh0",
      "author": "Cosimono",
      "body": "I'm so sorry to hear that, thanks for your honesty it means a lot",
      "created_utc": 1720333448.0,
      "score": 1,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        },
        {
          "id": "l4bqgh0",
          "author": "Conscious_Area_8397",
          "body": "Per day? How are you able to do that?",
          "created_utc": 1715876450.0
        },
        {
          "id": "l97rls9",
          "author": "Mundane-Jeweler6728",
          "body": "I was very very very sick back then and I was forced into inpatient treatment not long after I wrote that comment... Honestly, I don't know how I was able to it for so long - it's just the illness that makes you keep going...Now  I'm in recovery and trying to fight this evil disorder... I've gained weight and no longer have a BMI in the 12s... Honestly I don't know what my weight is now because I don't weigh myself anymore, but I'm pretty sure it's under BMI 18... It's hard for me to accept my \"new\" body, and people keep telling me it will get better... But I honestly doubt it. It has been 6 months and I still can't cope being in this body... I honestly just want to go back... I don't think I will ever get better, my mind is still obsessed with the thought of losing weight... I still b/p every single day... I walk around 13.000-15.000 steps a day, but I really want to get more steps in, but I can't because I live in a residential home for people with eating disorders. I've lived here for about 1.5 years and I'm so lonely and unhappy and I don't think I want to keep going... I hate my life\n\nI'm sorry... It wasn't supposed to be so long... I hope I make sense, English is not my mother language...",
          "created_utc": 1718745299.0
        }
      ]
    },
    {
      "id": "lcmdb64",
      "author": "Boymom223",
      "body": "How is your recovery going now? Are you still purging? \nI wish you the best in all this. I hope you get better. \n\nPurging is an addictive, lonely, guilty, shameful road to be on. It’s a drastic change. It makes sense you don’t like it. It takes time to rewire the brain.",
      "created_utc": 1720668145.0,
      "score": 1,
      "context": [
        {
          "id": "jioliqq",
          "author": "Mundane-Jeweler6728",
          "body": "Yes\n\nI b/p daily 3-5 times a day... my binges are huge... at least 5000-7000 calories per binge...\n\nMy BMI is in the 12s",
          "created_utc": 1683112582.0
        },
        {
          "id": "l4bqgh0",
          "author": "Conscious_Area_8397",
          "body": "Per day? How are you able to do that?",
          "created_utc": 1715876450.0
        },
        {
          "id": "l97rls9",
          "author": "Mundane-Jeweler6728",
          "body": "I was very very very sick back then and I was forced into inpatient treatment not long after I wrote that comment... Honestly, I don't know how I was able to it for so long - it's just the illness that makes you keep going...Now  I'm in recovery and trying to fight this evil disorder... I've gained weight and no longer have a BMI in the 12s... Honestly I don't know what my weight is now because I don't weigh myself anymore, but I'm pretty sure it's under BMI 18... It's hard for me to accept my \"new\" body, and people keep telling me it will get better... But I honestly doubt it. It has been 6 months and I still can't cope being in this body... I honestly just want to go back... I don't think I will ever get better, my mind is still obsessed with the thought of losing weight... I still b/p every single day... I walk around 13.000-15.000 steps a day, but I really want to get more steps in, but I can't because I live in a residential home for people with eating disorders. I've lived here for about 1.5 years and I'm so lonely and unhappy and I don't think I want to keep going... I hate my life\n\nI'm sorry... It wasn't supposed to be so long... I hope I make sense, English is not my mother language...",
          "created_utc": 1718745299.0
        }
      ]
    },
    {
      "id": "m3ztica",
      "author": "Worth_End_2825",
      "body": "That’s how I feel too. I feel like I would genuinely like myself a lot better if I was skinnier like I used to be. I know this mindset is toxic but I’ve weighed more than I’d like for about 2 years now and I’m fed up with hating how I look every time I see myself in the mirror. Sorry I don’t mean to rant I just want to lyk that I agree with u",
      "created_utc": 1735279194.0,
      "score": 1,
      "context": [
        {
          "id": "jinrimd",
          "author": "None",
          "body": "I have purging type, so yeah I have. And 10/10 don’t recommend. It’s ruined my life. I’m going to miss  the growth of my kitten, I could possibly miss a concert in NYC because of it. Also being thinner hasn’t made me happier.",
          "created_utc": 1683088830.0
        },
        {
          "id": "jioov9f",
          "author": "Several-Giraffe1930",
          "body": "this. it’s taken me 5 years of being bulimic to realize that being thin was never the answer.",
          "created_utc": 1683114624.0
        },
        {
          "id": "lzr4abr",
          "author": "redsweater56",
          "body": "so late to this thread😭 i truly think i would be so much happier in my dream body, like genuinely even if it sounds ironic or untrue. i’m tired of obsessing over old pictures of myself when i was slightly skinnier and psychoanalyzing my body in the mirror and counting calories and constantly doing research on how to lose weight or have a thinner waist. it’s all i think about atp and i just want to get there so it won’t be on my mind anymore",
          "created_utc": 1732993435.0
        }
      ]
    },
    {
      "id": "kx9k1u0",
      "author": "Glittering_Agency244",
      "body": "tysm currently going thru the fluctuation period and wanted to know there’s still hope lol",
      "created_utc": 1711812959.0,
      "score": 1,
      "context": [
        {
          "id": "jimuwfk",
          "author": "wearenotreal1",
          "body": "I have! Not saying this to encourage the behavior in any way, my health is compromised, but I have. It's definitely different for everyone.",
          "created_utc": 1683073437.0
        },
        {
          "id": "kx8llob",
          "author": "Glittering_Agency244",
          "body": "how much/how fast?",
          "created_utc": 1711796980.0
        },
        {
          "id": "kx8vs1a",
          "author": "wearenotreal1",
          "body": "30lbs in about 3-4 months\nPeriods of gaining and losing prolonged the time but yh",
          "created_utc": 1711802860.0
        }
      ]
    },
    {
      "id": "magcf9p",
      "author": "Typical_Ad_7291",
      "body": "Are you single now?",
      "created_utc": 1738449720.0,
      "score": 1,
      "context": [
        {
          "id": "kb88gn0",
          "author": "throwRAgrrr",
          "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
          "created_utc": 1701237728.0
        },
        {
          "id": "mabuwf5",
          "author": "Typical_Ad_7291",
          "body": "Why dinner",
          "created_utc": 1738386326.0
        },
        {
          "id": "maf7w01",
          "author": "throwRAgrrr",
          "body": "Because I didn't want my boyfriend to know. I'm only purging dinner now because it's the biggest meal of the day and I don't want my coworkers to know.",
          "created_utc": 1738437152.0
        }
      ]
    },
    {
      "id": "kx9k8ln",
      "author": "wearenotreal1",
      "body": "The only hope is recovery lol but good luck 🙏🏽",
      "created_utc": 1711813029.0,
      "score": 8,
      "context": [
        {
          "id": "jimuwfk",
          "author": "wearenotreal1",
          "body": "I have! Not saying this to encourage the behavior in any way, my health is compromised, but I have. It's definitely different for everyone.",
          "created_utc": 1683073437.0
        },
        {
          "id": "kx8llob",
          "author": "Glittering_Agency244",
          "body": "how much/how fast?",
          "created_utc": 1711796980.0
        },
        {
          "id": "kx8vs1a",
          "author": "wearenotreal1",
          "body": "30lbs in about 3-4 months\nPeriods of gaining and losing prolonged the time but yh",
          "created_utc": 1711802860.0
        },
        {
          "id": "kx9k1u0",
          "author": "Glittering_Agency244",
          "body": "tysm currently going thru the fluctuation period and wanted to know there’s still hope lol",
          "created_utc": 1711812959.0
        }
      ]
    },
    {
      "id": "mage7n1",
      "author": "throwRAgrrr",
      "body": "No he just is aware. Don't ask don't tell essentially",
      "created_utc": 1738450293.0,
      "score": 1,
      "context": [
        {
          "id": "kb88gn0",
          "author": "throwRAgrrr",
          "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
          "created_utc": 1701237728.0
        },
        {
          "id": "mabuwf5",
          "author": "Typical_Ad_7291",
          "body": "Why dinner",
          "created_utc": 1738386326.0
        },
        {
          "id": "maf7w01",
          "author": "throwRAgrrr",
          "body": "Because I didn't want my boyfriend to know. I'm only purging dinner now because it's the biggest meal of the day and I don't want my coworkers to know.",
          "created_utc": 1738437152.0
        },
        {
          "id": "magcf9p",
          "author": "Typical_Ad_7291",
          "body": "Are you single now?",
          "created_utc": 1738449720.0
        }
      ]
    },
    {
      "id": "magg27e",
      "author": "throwRAgrrr",
      "body": "Not really a relationship honestly it's a situationship at best",
      "created_utc": 1738450890.0,
      "score": 1,
      "context": [
        {
          "id": "kb88gn0",
          "author": "throwRAgrrr",
          "body": "I'm not binging any more than normal, but I've started purging. I've always been throw upy if I ate too much or my tummy hurt. I'd immediately throw up. A few times a month normally. Recently, it's been more often nearly every day. The only meal I haven't been purging is dinner.",
          "created_utc": 1701237728.0
        },
        {
          "id": "mabuwf5",
          "author": "Typical_Ad_7291",
          "body": "Why dinner",
          "created_utc": 1738386326.0
        },
        {
          "id": "maf7w01",
          "author": "throwRAgrrr",
          "body": "Because I didn't want my boyfriend to know. I'm only purging dinner now because it's the biggest meal of the day and I don't want my coworkers to know.",
          "created_utc": 1738437152.0
        },
        {
          "id": "magcf9p",
          "author": "Typical_Ad_7291",
          "body": "Are you single now?",
          "created_utc": 1738449720.0
        }
      ]
    }
  ]
}