{
  "id": "13hffqf",
  "subreddit": "bulimia",
  "author": "False_Literature_193",
  "created_utc": 1684078883.0,
  "title": "purging and wanting to eat again after",
  "selftext": "hi, i just purged like 15 minutes ago (a normal meal/my safe food tbh) and now i‘m craving mc donalds already.. does anybody feel the same with the wanting to eat more already short after purging? i hate food at this point.",
  "url": "https://www.reddit.com/r/bulimia/comments/13hffqf/purging_and_wanting_to_eat_again_after/",
  "score": 75,
  "num_comments": 28,
  "comments": [
    {
      "id": "jk4q280",
      "author": "mom0xx",
      "body": "yes, at my worst i would b/p the whole day because i couldn't control myself anymore, i usually ate expired food or plain pasta at the end of the day to just b/p",
      "created_utc": 1684080745.0,
      "score": 64,
      "context": []
    },
    {
      "id": "jk51qgc",
      "author": "Informal-Ad-7356",
      "body": "It's 100% natural.   Your body wants nutrients to survive.",
      "created_utc": 1684085807.0,
      "score": 45,
      "context": []
    },
    {
      "id": "jk4p7f6",
      "author": "shlanmeister",
      "body": "Yes, this happens to me super often. Like probably most times after I purge",
      "created_utc": 1684080367.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jk5ernf",
      "author": "Honest-Stable5612",
      "body": "All these comments are saying that you should drink something but actually your body is craving nutrients and energy. \n\nThis can be extremely difficult and probably needs some tries and work to actually get through with it - but you should allow yourself to have a healthy normal sized meal even after a binge. Of course only if you want to pursue recovery. This really helps once you get a hang of it. Frequent eating brings your metabolism to a more normal rate again. \n\nHaving a b/p episode does not mean that you are not allowed to eat afterwards. Your body needs it. Having a b/p episode does not equal having a meal. \n\nAllow yourself a time healthy normal sized meal after an episode and go for a walk afterwards or distract yourself from further cravings in some way. Also remind yourself that you are still allowed to eat later again - reminding myself that i can eat another meal later again helped me control my cravings. Even if all i could think about was my next meal and preparing my next meal. \n\nIt gets better. For me it got better and i believe it can get better for everyone. Be kind to yourself.",
      "created_utc": 1684091541.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jk6gle2",
      "author": "royceriel",
      "body": "i'll get hungry and then i'll eat and then i'll think \"damn do i have to purge this too?\"",
      "created_utc": 1684108654.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jk5ksvh",
      "author": "turtle__enthusiast",
      "body": "yeah, that's just how the body works. purging causes low blood sugar and low blood sugar causes hunger.",
      "created_utc": 1684094220.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jk5wroe",
      "author": "Basic_tomatillo4444",
      "body": "Yes nearly every time I purged I would immediately crave more food. It was insane.",
      "created_utc": 1684099330.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jk5abtb",
      "author": "piximiqote",
      "body": "Yeah, it is so hard to deal with... I hate that I'm addicted to it (food).",
      "created_utc": 1684089566.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jk6tama",
      "author": "prettyboy-gizmo",
      "body": "Yeah its a painful cycle",
      "created_utc": 1684115271.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jk55xb4",
      "author": "AcceptableBelt",
      "body": "Yes, makes me feel like a failure.",
      "created_utc": 1684087619.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jk8n5e3",
      "author": "772219353",
      "body": "I do this, and did it tonight. I was diagnosed with bpd and c-ptsd and the cherry on top ✨ body dysmorphia ✨ There’s this drug  called Lisdexamfetamine dimesylate (Vyvanse), a drug for attention-deficit hyperactivity disorder, is the first FDA-approved medication to treat moderate to severe binge-eating disorder in adults. This is something you could ask your doctor about. Like you, I’m not even hungry when I binge. It’s a coping mechanism. You probably have some undiagnosed mental disorder that triggers this. Could be ptsd, bpd, body dysmorphia…etc. OR sometimes it could be a medical condition..you really need to investigate it, otherwise it will be a never ending emotionally draining cycle. 🌹",
      "created_utc": 1684159602.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jk7d3p1",
      "author": "elvis__depressly",
      "body": "When BP desire is really strong I end up doing it like 3-4 times in a row and then I figure out a safe food with nutrients to \"sit with\" meaning I'll eat it and can cope with it staying down. This is a constant battle within me.",
      "created_utc": 1684126812.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jk7m9hg",
      "author": "denialphanta",
      "body": "Yeah, if it’s really bad I end up in a stupid cycle that eventually ends when I pass out of exhaustion at 3-4 am and restarts when I wake up until I start a f4st. It’s counterproductive and I do not encourage nor recommend it. It happens mostly on the days where I have breakfast that I didn’t count for because then in my head I failed horribly so may as well give up today. Even if you binged, you shouldn’t “compensate” because that would only lead to a b/p episode. It’s easier to control a painful binge when you know that purging afterwards isn’t an option.",
      "created_utc": 1684133877.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jk5ww97",
      "author": "Responsible-Storm882",
      "body": "Yes literally purged a whole thing of brownies yesterday and felt so hungry after so I ate more brownies :(",
      "created_utc": 1684099381.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jk5zs57",
      "author": "annaeatk",
      "body": "I’m usually hungrier after I purge within like 15 min. It sucks, I try to just eat something healthy and filling afterwards and drink a lot of water to kind of curb the hunger.",
      "created_utc": 1684100622.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jk68exo",
      "author": "RichApprehensive1116",
      "body": "oh yeah this happens to me a lot that’s why i stopped purging cuz i’d legit just undo it 10 mins later haha",
      "created_utc": 1684104570.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jk61005",
      "author": "None",
      "body": "Allll the time! I have to stop myself sometimes cause my body can’t take it. :(",
      "created_utc": 1684101156.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jk7uep7",
      "author": "FallMedical",
      "body": "Yes, this happens to me. Every time.",
      "created_utc": 1684141264.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jk9kb5w",
      "author": "Undercover-Loner",
      "body": "Yea I b/p over and over and over again some days and it’s horrible. I am in so much pain after and so hungry but keep doing it!",
      "created_utc": 1684175055.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jk51ppq",
      "author": "blondiesdiary",
      "body": "Yes yes yes. 🙃🥲",
      "created_utc": 1684085799.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jk7t94g",
      "author": "Curious-Jellyfish108",
      "body": "Yes but perso I purge in a trash on my room and I lock ms in so I'll not go in the kitchen to eat more",
      "created_utc": 1684140205.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jk50ove",
      "author": "Caramel4life",
      "body": "Have a malt drink that will stop your hunger.",
      "created_utc": 1684085371.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfvq3mh",
      "author": "Ok-Maximum2228",
      "body": "It’s because our brains our trained to think that way unfortunately",
      "created_utc": 1722462203.0,
      "score": 1,
      "context": [
        {
          "id": "jk6gle2",
          "author": "royceriel",
          "body": "i'll get hungry and then i'll eat and then i'll think \"damn do i have to purge this too?\"",
          "created_utc": 1684108654.0
        }
      ]
    },
    {
      "id": "jk5ezji",
      "author": "False_Literature_193",
      "body": "yes, it‘s literally all i think about all day",
      "created_utc": 1684091638.0,
      "score": 8,
      "context": [
        {
          "id": "jk5abtb",
          "author": "piximiqote",
          "body": "Yeah, it is so hard to deal with... I hate that I'm addicted to it (food).",
          "created_utc": 1684089566.0
        }
      ]
    },
    {
      "id": "jn6lca9",
      "author": "plummflower",
      "body": "You’re not a failure. Your body is having a totally normal reaction to being hungry! When you purge, it basically gets rid of all the nutrients and calories you just ate, so your body is at a net zero (even if you physically/mentally/emotionally ate the food, your body didn’t “get” it). So your body sends a hunger response, asking for more food that it gets to “keep” this time. It’s okay to allow yourself to have a full, normal meal after a purge. It’ll also mitigate the permanent effects on your metabolism. \n\nYou’re not alone and I’m sorry you’re going through this. You deserve food and nutrition and energy and love no matter what.",
      "created_utc": 1686091828.0,
      "score": 2,
      "context": [
        {
          "id": "jk55xb4",
          "author": "AcceptableBelt",
          "body": "Yes, makes me feel like a failure.",
          "created_utc": 1684087619.0
        }
      ]
    },
    {
      "id": "jk8ngu1",
      "author": "772219353",
      "body": "I really feel for everyone that suffers from this. It’s the WORST knowing you are heading to the bathroom to make yourself sick. I put the tap/ music on. I hope whoever reads this…just know you aren’t alone…we are all battling our demons together in spirit 💜",
      "created_utc": 1684159775.0,
      "score": 3,
      "context": [
        {
          "id": "jk8n5e3",
          "author": "772219353",
          "body": "I do this, and did it tonight. I was diagnosed with bpd and c-ptsd and the cherry on top ✨ body dysmorphia ✨ There’s this drug  called Lisdexamfetamine dimesylate (Vyvanse), a drug for attention-deficit hyperactivity disorder, is the first FDA-approved medication to treat moderate to severe binge-eating disorder in adults. This is something you could ask your doctor about. Like you, I’m not even hungry when I binge. It’s a coping mechanism. You probably have some undiagnosed mental disorder that triggers this. Could be ptsd, bpd, body dysmorphia…etc. OR sometimes it could be a medical condition..you really need to investigate it, otherwise it will be a never ending emotionally draining cycle. 🌹",
          "created_utc": 1684159602.0
        }
      ]
    }
  ]
}