{
  "id": "13q34pk",
  "subreddit": "bulimia",
  "author": "nicee-c0ck",
  "created_utc": 1684881243.0,
  "title": "1x 2x 3x 4.. yay i spent like 200 dollars on one day of binging :)",
  "selftext": "today was kinda a “planned” binge day. and my stomach now hurts, my head hurts and i wasted the whole day gorging on food i only half enjoyed and puking it all up. i swear the only part of a binge that’s worth it is the beginning. anything after that just sickens me. started with 4 baked goods, a bundt cake, milkshake, whole loaf of bread, toaster strudels, muffins, plantain chips and a whopping 4 starbucks drinks. oh OH not to mention the whole pizza hut pepperoni pizza. none of this food was kept down and i’m only praying to the bulimia gods that not a lot was absorbed. pray for my stomach lining and teeth and sanity.",
  "url": "https://www.reddit.com/r/bulimia/comments/13q34pk/1x_2x_3x_4_yay_i_spent_like_200_dollars_on_one/",
  "score": 86,
  "num_comments": 16,
  "comments": [
    {
      "id": "jld0u2m",
      "author": "PoldiL",
      "body": "Sending strength to your stomach and teeth 😭😭\n\nBut seriously I get this a lot \n\nThe planning \n\nAnd then not actually enjoying it \n\nThen think ‘wtf am I doing I hate this’ \n\nAnd then carry on \n\nLike \n\nNo \n\nWhy \n\nI’ve been clean for a little while now, and every time I think about it I think ‘teeth’ ‘puffy face’ ‘bloated asf’ and how much I actually dislike it…. And realise that it’s not worth it and I can find something else to do to fill in that hole… \n\nI know it’s not easy to stop or reduce it \n\nBut little reminders kinda help \n\nSometimes when I have a night out planned it’s like ‘I do not want a swollen face and sore glands’ and that can do enough to put me off for the sake of vanity lol",
      "created_utc": 1684886848.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jle3m6a",
      "author": "apologeticdoormouse",
      "body": "🫡 purging that much bread is intense holy smokes. im sorry and i hope you can get good rest, you deserve it. 100% accurate about the first part of binging, that hurt me",
      "created_utc": 1684906559.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jldfqfc",
      "author": "Informal-Ad-7356",
      "body": "It's weird but true.  Only the beginning was enjoyed.  Most of the Binge used to be horrible.   Then I would have guilt/shame.  Nice reminder why I want to stay in Recovery.",
      "created_utc": 1684893485.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jlfimm3",
      "author": "YeahNoYeahMaybeNo",
      "body": "Dont you kinda enjoy the tiredness that comes after? When I do try to behave normal I sleep actually worse",
      "created_utc": 1684938698.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jld20ug",
      "author": "_yvngfiggy_",
      "body": "one whole pizza box isn’t that bad i’ve consumed 4 within 2 hours and purged mid eating just to eat the rest, there will be better days i promise",
      "created_utc": 1684887412.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jleixbg",
      "author": "772219353",
      "body": "I find that if you eat bread of any kind it’s hard to bring back up, like chips. Binge days that aren’t planned suck because you normally start mid day late afternoon…eating everything you can before 12am hits.",
      "created_utc": 1684918672.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jldbw9c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1684891761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jlg7wab",
      "author": "blondiesdiary",
      "body": "Been there too.. sending good wishes!!!",
      "created_utc": 1684948451.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jlipf0i",
      "author": "None",
      "body": "I hope this is taken as helpful, rather than harmful, and won't be offended if the MODs delete this, but I wanted to share my experience.\n\nI've had an ED for as long as I can remember... ARFID before it was an actual diagnosis, then BN for almost two decades, and in recent (several) months, I dabble between AN and BN, because I find being full to be extremely triggering, so I have to make a really concerted effort to make judgements with every single bite I take, so that I don't trigger a B/P episode.\n\nYou mentioned that you weigh yourself after, to see if you're less than when you started.\n\nI'm sure you've been told this, but I'm going to reiterate it just in case you, or someone else hasn't...\n\nYou cannot reliably use your weight as a measurement when you are binging and purging. You are losing water weight, your body is clinging to the calories that it can, and it's not even remotely an accurate judgement of your weight. I know the numbers can be everything, but they honestly mean nothing. Unless you are weighing yourself once, max 2x a week, at the same time of day (first thing in the morning is best), you can not put any weight, no pun intended, into it meaning anything, as your weight can fluctuate drastically throughout the day.\n\nSo... the part I'm concerned about sharing. I have been working VERY hard at keeping food down in recent months, eating what I consider \"healthy, nourishing\" food, and using that as my justification to not continue eating, even if I do feel a bit uncomfortable, and in turn let it turn into a B/P episode. Because then my efforts are for naught, and my nutritious food went to waste.\n\nAnecdotally, when I started forcing myself to eat and not let it turn into a B/P (again, what I consider to be healthy and nutritious food), I was (am) trying to eat small portions, quite frequently, so I never technically had a proper \"meal\", which would absolutely trigger me, but that I was satiated and felt like I was doing my body some good.\n\nWhen I did this consistently, I actually lost weight. BUT - let me tell you why...\n\nI don't know if others are in the same boat, but based on some of the things OP mentioned, I think I'm likely not alone... when I go in on a proper binge/purge episode, I eat absolute shit food. Junk food, fried food, fat-laden food. Despite my purging efforts (and I have some tricks to make sure I'm as empty as I'm going to get, which I'm not going to elaborate on), my body, and everyone's, hangs on to some of that food. So essentially, we are consuming high fat shitty calories, that our body is desperate for, because at the end of the day, it's fuel.\n\nWhen I was making an effort to eat healthy food and nourish myself, I wasn't eating \"shit\" food. In turn, my body actually responded in losing weight. Now I am NOT condoning anyone losing weight, I'm just trying to point out that comparing your weight from before and after a binge is completely irrelevant in terms of what calories your body is retaining.\n\nFWIW, I had been at a fairly low point in my weight before, similar to where I was when I was eating healthier, but previously, I could barely function. I couldn't walk my dog, I literally couldn't do anything. After basically re-feeding, while my weight didn't skyrocket, my energy did, and I felt really good.\n\nTo be clear, I am not, and was not eating enough calories - YET. But I'm working my way towards it albeit slowly, so that I don't trigger myself and go back down that hole.\n\nI've been in your shoes. It's an awful place to be. But you CAN get better. I don't honestly believe we will ever be completely free of this disease, but I think you, and everyone, has the ability to fight back.\n\nAs my counsellor said to me not that long ago, which was a slap in the face...\n\n\"In the \\~13+ years I've been seeing ED patients, never once have I seen someone age out of it.\"\n\nThat's what I needed to hear, to realize no one can fight this battle for me, except me.\n\nETA: Whoops, sorry for the novel!",
      "created_utc": 1684984979.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jld7pqo",
      "author": "Aggravating_Kale_188",
      "body": "Bro binging is legit so expensive. I used to buy all my food at a dollar store when I got my first job. Rinsing your mouth with baking soda+water (stir well) will help reduce the acid damage to your teeth, and regular dental routines (done say a half an hour after the baking soda wash) can help, if done thoroughly and gently (your gums should bleed very little or not at all, that's how gentle you should be with your mouth and its eating tools when you are binging and purging). However, even when food is \"absorbed\" into the body, it takes more than one binge once in a while to actually screw you over and make you gain any weight that isn't water weight. You'll be okay.",
      "created_utc": 1684889920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jldbqfx",
      "author": "nicee-c0ck",
      "body": "literally this. unplanned binges are the worst because sometime you need to purge bad and there’s no where to do it. but planned binges also suck because you end up continuing to binge because it’s the day to do it. i don’t know which is worse",
      "created_utc": 1684891689.0,
      "score": 14,
      "context": [
        {
          "id": "jld0u2m",
          "author": "PoldiL",
          "body": "Sending strength to your stomach and teeth 😭😭\n\nBut seriously I get this a lot \n\nThe planning \n\nAnd then not actually enjoying it \n\nThen think ‘wtf am I doing I hate this’ \n\nAnd then carry on \n\nLike \n\nNo \n\nWhy \n\nI’ve been clean for a little while now, and every time I think about it I think ‘teeth’ ‘puffy face’ ‘bloated asf’ and how much I actually dislike it…. And realise that it’s not worth it and I can find something else to do to fill in that hole… \n\nI know it’s not easy to stop or reduce it \n\nBut little reminders kinda help \n\nSometimes when I have a night out planned it’s like ‘I do not want a swollen face and sore glands’ and that can do enough to put me off for the sake of vanity lol",
          "created_utc": 1684886848.0
        }
      ]
    },
    {
      "id": "jliv71k",
      "author": "nicee-c0ck",
      "body": "bread, pastries, and ice cream tend to be my binge foods. overall I am fine with purging unless it’s something spicy. like bread can be hard to bring up but when it does it comes in a clump and then it’s over. icecream is obviously elite tho",
      "created_utc": 1684988204.0,
      "score": 3,
      "context": [
        {
          "id": "jle3m6a",
          "author": "apologeticdoormouse",
          "body": "🫡 purging that much bread is intense holy smokes. im sorry and i hope you can get good rest, you deserve it. 100% accurate about the first part of binging, that hurt me",
          "created_utc": 1684906559.0
        }
      ]
    },
    {
      "id": "jliuzbl",
      "author": "nicee-c0ck",
      "body": "honestly yes, at times I actually enjoy the process and I definitely enjoy the exhaustion afterwards because at times I’m an insomniac and can’t sleep",
      "created_utc": 1684988078.0,
      "score": 3,
      "context": [
        {
          "id": "jlfimm3",
          "author": "YeahNoYeahMaybeNo",
          "body": "Dont you kinda enjoy the tiredness that comes after? When I do try to behave normal I sleep actually worse",
          "created_utc": 1684938698.0
        }
      ]
    },
    {
      "id": "jldc5i8",
      "author": "nicee-c0ck",
      "body": "it never stops, i also purge just to eat again",
      "created_utc": 1684891876.0,
      "score": 4,
      "context": [
        {
          "id": "jld20ug",
          "author": "_yvngfiggy_",
          "body": "one whole pizza box isn’t that bad i’ve consumed 4 within 2 hours and purged mid eating just to eat the rest, there will be better days i promise",
          "created_utc": 1684887412.0
        }
      ]
    },
    {
      "id": "jldc36d",
      "author": "nicee-c0ck",
      "body": "it rlly depends but maybe 10-20 min. and i purge until 2 things. 1. until only avid or nothing comes out and 2. until i weigh less then when i started",
      "created_utc": 1684891847.0,
      "score": 2,
      "context": [
        {
          "id": "jldbw9c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1684891761.0
        }
      ]
    },
    {
      "id": "jp67j6x",
      "author": "Winter-Platypus-2828",
      "body": "Rly helpful advice tysm",
      "created_utc": 1687485729.0,
      "score": 2,
      "context": [
        {
          "id": "jld7pqo",
          "author": "Aggravating_Kale_188",
          "body": "Bro binging is legit so expensive. I used to buy all my food at a dollar store when I got my first job. Rinsing your mouth with baking soda+water (stir well) will help reduce the acid damage to your teeth, and regular dental routines (done say a half an hour after the baking soda wash) can help, if done thoroughly and gently (your gums should bleed very little or not at all, that's how gentle you should be with your mouth and its eating tools when you are binging and purging). However, even when food is \"absorbed\" into the body, it takes more than one binge once in a while to actually screw you over and make you gain any weight that isn't water weight. You'll be okay.",
          "created_utc": 1684889920.0
        }
      ]
    },
    {
      "id": "jldclt7",
      "author": "PoldiL",
      "body": "I feel like the ‘planned’ binges make me feel worse, like I don’t want to do it but ‘i have given myself permission to purge’ so I have to…\nAnd the last one, i stopped half way through and thought why tf am I doing this I don’t like it, i feel shit, my body feels shit, my brain, everything \n\nAnd when it came to the next ‘urge’ I re dined myself that I did stop, i can stop and that I don’t actually enjoy it and it gives me no positives, only negatives…\n\nThe planned ones helped me stop",
      "created_utc": 1684892078.0,
      "score": 8,
      "context": [
        {
          "id": "jld0u2m",
          "author": "PoldiL",
          "body": "Sending strength to your stomach and teeth 😭😭\n\nBut seriously I get this a lot \n\nThe planning \n\nAnd then not actually enjoying it \n\nThen think ‘wtf am I doing I hate this’ \n\nAnd then carry on \n\nLike \n\nNo \n\nWhy \n\nI’ve been clean for a little while now, and every time I think about it I think ‘teeth’ ‘puffy face’ ‘bloated asf’ and how much I actually dislike it…. And realise that it’s not worth it and I can find something else to do to fill in that hole… \n\nI know it’s not easy to stop or reduce it \n\nBut little reminders kinda help \n\nSometimes when I have a night out planned it’s like ‘I do not want a swollen face and sore glands’ and that can do enough to put me off for the sake of vanity lol",
          "created_utc": 1684886848.0
        },
        {
          "id": "jldbqfx",
          "author": "nicee-c0ck",
          "body": "literally this. unplanned binges are the worst because sometime you need to purge bad and there’s no where to do it. but planned binges also suck because you end up continuing to binge because it’s the day to do it. i don’t know which is worse",
          "created_utc": 1684891689.0
        }
      ]
    }
  ]
}