{
  "id": "13woamp",
  "subreddit": "bulimia",
  "author": "Wonderful-Balance693",
  "created_utc": 1685544531.0,
  "title": "Scary stories?",
  "selftext": "Hey if anyone has some scary / horrifying bulimia stories and feels comfortable telling it please do - I kinda want to scare myself out of doing the deed, feel like thats the only thing that really stops me.\n\nEdit: Wow - thank you everyone a ton for sharing your stories. It must be hard to talk about that, so thank you.",
  "url": "https://www.reddit.com/r/bulimia/comments/13woamp/scary_stories/",
  "score": 86,
  "num_comments": 67,
  "comments": [
    {
      "id": "jmck2xt",
      "author": "three_d0wn",
      "body": "I was in a small shared flat with my family for a holiday, and I had eaten myself sick on cheese. When everyone was asleep I got up and purged into a bag in a dark storage cupboard because it was the only place where I wouldn’t wake anyone. The smell was rancid, and there were several litres of vomit in the bag. It was so heavy it leaked when I lifted it. I had to sneak another larger bag to put it into before it split completely. It was around 2am at this point, and bear in mind we’re staying in a mountain village in the middle of winter. I then stole out of the flat in my (pretty light) pyjamas and wandered barefoot around a strange town in a foreign country at the dead of night in freezing temperatures looking for a place to dispose of my sack of vomit. I will never forget that night.",
      "created_utc": 1685546369.0,
      "score": 75,
      "context": []
    },
    {
      "id": "jmchsn5",
      "author": "DazzlingInjury9129",
      "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
      "created_utc": 1685545485.0,
      "score": 45,
      "context": []
    },
    {
      "id": "jmdkxbq",
      "author": "Evergreenpoppy",
      "body": "I had multiple tears in my esophagus from purging, but still couldn’t stop, so I was forced inpatient. About a year later I was going to see an eye doctor because of all the new floaters in my vision, turns out both of my retinas are partially detached from the pressure from purging so much. If they would have completely detached/tore I would be blind",
      "created_utc": 1685560192.0,
      "score": 42,
      "context": []
    },
    {
      "id": "jmci71b",
      "author": "Branch-Much",
      "body": "I got an endoscopy after it hurt to swallow anything- I was okay in the end, but oesophageal strictures are a real thing. It’s super rare, but there is potential for oesophageal cancer too. \n\nIn 2019, I b/p-ed like a motherfucker (it was a tough year, emotionally). I gained ten kilos/22lbs 😦. I wish I was kidding. My gag reflex just stopped working, and yet I kept trying. I purge very occasionally now, and have lost about six of those kilos.\n\nThere’s also the thousands of dollars literally flushed down the toilet, throat pain, face swelling, poor digestion, isolation and all that fun stuff 🫠🫠. I also have to remember the scariness to stop myself purging! It’s the only thing that stops me.",
      "created_utc": 1685545641.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jmd0dld",
      "author": "makeupyourworld",
      "body": "I had a heart attack at 14, have been in kidney failure at least 3 times, became severely septic, been in the ICU, had my entire body and face swell until I couldn't even walk or move. Shat blood at disney world... list goes on",
      "created_utc": 1685552504.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jmd3l1t",
      "author": "Few_Ad_6447",
      "body": "I recently read a case study about a bulimic teen where the stomach got so dilated and full that it compressed the aorta and blood flow to legs and other organs. She ended up losing most of her intestines and spent months in the hospital.",
      "created_utc": 1685553708.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jmeeoou",
      "author": "gorewhored",
      "body": "one of my close online friend's sisters choked on her own vomit and died alone in her bathroom on christmas eve. when she was purging a large piece of food got stuck in her throat and she was too embarrassed to ask for help until it was already too late. found out a week later from her horrified mother was the one who found her daughter splayed out on her bathroom floor, dead, covered in vomit on christmas morning. i think she was only 21-23. my friend said she was in her very early 20's when we were talking in a vc one time. \n\nshe doesn't talk about it often, but when she does it's super fucking dark.",
      "created_utc": 1685571411.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jmedejm",
      "author": "re_Claire",
      "body": "I’ve lost two teeth and have fillings in most of my molars because of purging. \nI am fully recovered now but I used to cycle between anorexic behaviours (wasn’t ever underweight so atypical anorexia) and bulimia. I ended up having gallstones due to the constant rapid weight loss and gain, and had some really horrific gallstones attacks that landed me in hospital several times before I had my gallbladder removed (I’m in the UK so it takes a few months to get it sorted). Nothing super severe but it’s had a huge impact on my health nevertheless.",
      "created_utc": 1685570896.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jmcvjbz",
      "author": "saradascream",
      "body": "Not super scary,but due to extreme exercise I have chronic shin splints.I love dancing and being in nature and work out, but I always have to think about not doing much,I feel very limited and not free to do what I really want.",
      "created_utc": 1685550710.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jmf66af",
      "author": "clumsycouture",
      "body": "I’ve basically ruined all my teeth and have had gut issues since I was 16. I had like 6 extractions and all my teeth filled last year from puking so much. I also had Russes Sign (callouses on knuckles) I quit when I was 21 and I’m 33 now and still have rough knuckles. I luckily stopped when I started seeing blood in my puke but it could have been so much worse. I was actively bulimic for 5 years and I probably would be dead today if I didn’t quit.",
      "created_utc": 1685583481.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jmkh0mw",
      "author": "Elllliiiizzzaabeth",
      "body": "I’ve been pretty lucky with my health in that I haven’t had any major health scares- but purging has humiliated me beyond belief sooo many times. \n\nOne of the worst times was in college, when I had a communal bathroom where I often got walked in on when purging in. My solution was to purge in my room (my roommate was abroad that semester). In order to do it, I would purge into a garbage bag and then throw it in the trash can in the hallway. I thought I was fine, until my ENTIRE dorm (3 floors and hundreds of students) got an email from admin describing the “concerningly large amounts of vomit” (actual quote) they were finding in the hallway. Immediately I stopped, but the email got reposted on our school’s barstool and everyone was talking about it for weeks. \n\nIf that wasn’t bad enough, the worst was yet to come. I went back to using the bathroom, but the toilets were weird so sometimes 2 flushes weren’t enough but I couldn’t keep flushing them because they wouldn’t fill up fast enough to flush again completely so sometimes there would be stuff left behind but our bathrooms were cleaned daily and my ED- mangled brain thought it would go unnoticed or would be chalked up to college kids partying too hard. I didn’t think much of it, until months later when my class dean (who had met with me on a couple occasions because of unspecified concerns over my well-being) accidentally forwarded me an email chain between a bunch of admin, custodial staff and other staff at the school. The email was documenting every single time that they had found vomit in the trashcans (detailing the # of bags, amount of vomit, and the time), and anytime they had found residue of vomit in or around any bathroom in my building, or report of a student getting sick there (also with the date, and any other details about the incident). It went back MONTHS and I was pretty sick at that time so you can imagine how many days and times that included. Also within this email chain, they stated my name as being the suspected student responsible based on a report from my RA and their tracking of residents entering and leaving the building with their keycards. The chain included a discussion of whether or not I should face disciplinary action but luckily, the dean advocated against it and suggested she meet with me again before they pursued any actions, to discuss concerns over my weight/health and address the situation that way. I cannot express the utter humiliation I felt. I’ve never been so mortified in my entire life, & I felt terrible for the impact my selfish actions had on the janitorial staff. The dean quickly sent me a follow up telling me to disregard & delete the email because she sent it by mistake, but obviously the damage was done. I didn’t face any disciplinary actions, but I also ended up confessing everything to her and agreeing to meet with the school’s nutritionist, and a therapist weekly because i knew that was probably the only way to take responsibility for everything I did. I also majorly changed my approach to covering up/cleaning my b/p episodes, bc even though I wasn’t ready for recovery, I def couldn’t allow the janitors to clean up my mess ever again. I ended up becoming super close to the dean & I almost think she sent me the email on purpose so I was aware of the seriousness of the situation but I’ll never really know for sure. \n\nThat was only my sophomore year and for the rest of my college experience, I felt so ashamed and was paranoid that everyone who worked for the school knew who I was & what I did. I never told any of my friends about it, even after we graduated because of how ashamed I was. \n\nDef keep that in mind when you feel like you want to purge, bc sometimes your Ed can make the damage to your physical and mental health seem insignificant, but maybe the added potential social annihilation will discourage you\n\nif I had known that could happen, I would’ve avoided the worst experience of my life.",
      "created_utc": 1685676154.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jmfk5ne",
      "author": "None",
      "body": "I have been struggling with anorexia and bulimia consistently for the better part of 4 or 5 years now. The horror stories are innumerable. But the truth is, any embarrassing moments had in interactions with family, friends, and doctors don’t even factor. \n\nMy horror story is this: My hair falling out in clumps and leaving patches of scalp exposed to the sun for months at a time. The total disintegration of my enamel and the financial burden it has become to fix. The erosion of my esophageal tissue that has lead to painful ulcers and horribly uncomfortable acid reflux. Constant headaches. Constant food guilt. \n\nYou don’t want this. There are options for you besides this. You can only go so far before what you’ve done becomes permanent. \n\nPlease feel free to talk to me if you need to.",
      "created_utc": 1685590191.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jmfo8ii",
      "author": "erraticella",
      "body": "I forgot about about a bag of vom in my closet (I rarely use my closet, it’s just used to hang winter clothes and dresses) and went to get a jumper because it was randomly really cold in the summer and literally 10-20 cockroaches crawled out and scared the shit out of me. I threw the bag out immediately and sprayed so much bug spray. I think I cried my eyes out after this happened because like fuck what the fuck",
      "created_utc": 1685592391.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jmfojw5",
      "author": "savannahsmyles",
      "body": "There’s a pretty famous story about a girl who’s stomach split open mid purge and she died.",
      "created_utc": 1685592564.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jmfvd38",
      "author": "burntbroccoliass",
      "body": "Last October I was clearing my throat a lot. This was during a period where I was purging multiple times a day. One day, I cleared my throat and there was brown-ish blood mixed into the mucus I cleared. My doctor referred me to GI and I had an endoscopy done in December. They found Barrett’s Esophagus. It’s not curable. I’ll be on medication for the rest of my life and will have to have endoscopies done every 3 years to make sure it doesn’t mutate into cancer. In February, I couldn’t stop vomiting every time I’d eat (I wasn’t doing it on purpose). Eating anything made me extremely sick. I got diagnosed with Gastroparesis. This is also something that there’s no cure for. My body struggles to digest food. I’ll have Barrett’s and Gastroparesis until the day I die and both conditions were caused by 18 years of purging on/off.",
      "created_utc": 1685596708.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jmgjjui",
      "author": "send-help-im-dying",
      "body": "My abusive ex came home from work in the middle of the night during my nightly binge purge routine as I was vomiting in the shower. He proceeded to berate me as I sobbed, attempting to shovel handfuls of my vomit from the tub into the toilet because the drain became clogged (which of course had never happened before that night). It was humiliating and dehumanizing, and I still think about it from time to time after years of recovery.",
      "created_utc": 1685615803.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jmf657w",
      "author": "Fairy_Sweet_22",
      "body": "Oh boy. I’ve got some stories but the two that stick out to me the most are these: \n\nOnce, I was mid purge and obviously didn’t consume enough liquids during to bring everything to a decent consistency. The worlds most massive lump of potato chips forms inside of my esophagus and I could NOT get it out. I was alone in the house and had no way of calling for help in an appropriate  amount of time and I probably honestly wouldn’t have gotten help anyway because Ed logic would have me saying I’d rather die than get caught. I did get it out on a massive cough…. And then proceeded to keep going. \n\nSecond, not directly related to purging but sort of. When I used to go on fasting streaks for days at a time…. I had just ended a 7 day fast and binged with the intent of purging. I didn’t even eat that much and still am not positive of what happened but I had the absolute worst stomach and chest pains of my life. I could t stand straight. Still tried to purge. Ended up failing and laying on my side for three hours. \nSo anyway. Ed glamour. 🫥",
      "created_utc": 1685583468.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jmg9l11",
      "author": "None",
      "body": "had a very big b/p sesh lasting multiple days, purging every thing i put in for two weeks. the last time i purged i started coughing and couldnt breathe. my heart hurt for weeks. thought i was going to die in my sleep after waking up with vomit in my mouth.",
      "created_utc": 1685607667.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jmidu92",
      "author": "cuigseseacht",
      "body": "Found out recently that oesophageal cancer is extremely prevalent in a side of my family I don’t have contact with (hence me not knowing until recently). After years of purging too — meaning my already higher chances of getting cancer have now increased even more",
      "created_utc": 1685644449.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jmg1j5c",
      "author": "None",
      "body": "Im in a horror movie rn!! My trash can is so full of vomit i can barely lift it! So like unless im tryna rip open a bunch of bags of vomit and pour it down my sink- idk what to fckn do 😓\n, im aware of my own *at this point* criminal stupidity lol\nI do not have my own bathroom, i share one with 3 other ppl on my floor and it is gross in there already  and will be even more gross for everyone if i bring my \"habit\" over there :)(",
      "created_utc": 1685601098.0,
      "score": 3,
      "context": []
    },
    {
      "id": "joq1ugm",
      "author": "Throwaway817263626",
      "body": "Throwaway for privacy—\n\nOne of my worst experiences was throwing up in the shower and then clogging the tub. I ended up standing ankle deep in vomit tub water, trying to scoop it into the toilet to remedy the problem. Trying to mute my sobbing  because I didn’t want my roommate to hear anything at all. I have flashbacks to this more than I’d like to admit. I’ve never shared this story with anyone before. \n\nMost embarrassing was definitely when I was at a friends house and didn’t want to purge in her place so I went outside to the parking lot to throw up in a trash bag. I thought I was hidden between cars and a half-wall, and when I was done purging I looked up to see people sitting in a car staring at me. I just looked away as fast as I could, threw my bag in the dumpster and ran away. I still feel so guilty about that, on so many levels. \n\nScariest times were all the times I really thought I was having a heart attack, but “lucky” for me it turned out to be strained intercostal muscles. \n\nThe worst part is that I’ve been purge-free for 7 years and my body will still kind of start to purge on its own if I am stressed and have food in me. How can I blame my body, though, when I betrayed her for so long? I just do all I can to make the right choices every day. \n\nFWIW my treatment was very…DIYish and all outpatient, and I sometimes wish I took the offers for inpatient when I had the chance.",
      "created_utc": 1687193434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kwr2saa",
      "author": "Fragrant-Choice151",
      "body": "My big brother used to have an imaginary brother and he would always play with him but sometimes he would say “stop leave me alone” or “no I don’t wanna go to my room to play” my mom would ask him “what’s going on??” And he would say “he won’t leave me alone” of course my mom had no idea what he was talking about and thought it was just him being a kid with an imaginary friend. Well a day after my brothers birthday he had these balloons and keep in mind my brother is just a little kid and he’s obviously not tall so he couldn’t reach the plates, knifes, forks etc. It was around 10-11 pm and my mom heard the balloons pop so she went outside and my brother looked really scared so my mom asked him “what’s happened?? Did you pop the balloons” and my brother said freaking out “no it was him” pointing 2 his imaginary friend that my mom obviously couldn’t see. My mom saw the knife next to the balloons and immediately knew that he was 2 short to reach any of those things so she said “GET OUT OF MY HOUSE” 2 my brothers imaginary friend. Since my mom couldn’t see him she asked my brother if he left already and he said he had left and thanked my mom. Later [about 10-15 mins later] my cousins came over and my cousin said that he saw a woman in all white with her hair in front of her face in the front door. My brother said that that was his mom and she opened the door *my cousins were already inside* and asked my brother if she was still there and my brother said yes and that she was mad. She started to yell for her to get out and then she asked my brother if she was still here and he said no. My brother is now 19 and says he still sometimes sees him in his mirror.",
      "created_utc": 1711511835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kxawvi6",
      "author": "redsharkgaming",
      "body": "Once, when I was under 10 but older than 5, I don't remeber how old i was, but I was visiting my grandparents  it doesn't happen anymore when I visit  but it becuase I close the door from the hallway.this story is called*scary hallway* so when I was little  I visited my grandparents I was with my dad and my sister my sister got the feeling too but at night or even the day it's scary when you alone they have a basement it's scary no matter how many people there's cracks in the ground holes in the walls so this is a different story so when I was down there they had or have a little office down there that they don't use atleast not anymore and so I went down there cause my grandma was getting somthing for me and my family she got these cookies and at the corner of my eye in the office I saw something like a figure starring at us then I looked fully there and it was gone the figure had  sharp claws I saw but now I'm older I think it was just my imagination but who knows It could have been a spider  anyway at night I slept on a bunkbed with my sister and she had the top bunk and my dad had the normal bed so basically we were going to sleep I looked  into the hallway with an unpleasant chill going down my spine  my mind started to race  the hallway has a bush with a nomb or a Santa or a Easter bunny when we come to there house once you get to the very top  of the stairs and a desk workspace that I don't even think they use anymore  and at the very end is there room to the right and in the middle is scary sculptures of animals and like a merry go round so I'm ready to go to bed I look into the hallway when I open my eyes cause it's right in front of me once I saw a figure or a shadow run to this one room that was my dad's brother's room  I got up and went into the hallway everyone else was asleep and I looked to my left the Santa  thing was still there looking the same direction then I look to my right into the room and a bear sculpture was looking at me weird and creepy so I moved it to look at the bed and then I go to the end of the hallway  and check and then I hear a noise downstairs in the family room I go down the stairs  and go down the other stairs then peek and look and I saw someone was watching TV so I went back upstairs and went to the room and laid down I looked back into the hallway  and I saw  somthing like a shadow run down the hallway again then the noise of the TV stops I hear creeking going up the stairs  or down  and then the lights in the hallway turn off then the person watching to who I forgot  was there going to bed  in the room where I saw shadows run into to a guest room I'm pretty sure it was my mom cause she had some work then she was going to come to visit to and she was there before we went to bed  then I felt a cough coming  up my throat to my mouth my head felt l light and a wierd feeling I was a little sick so I went to the kitchen cause my dad bought medicine  and I heard the stairs creeking  and I was scared it was like creek a shiver went down my spine\nCreek, I felt a panic in my chest\nCreek, I kept on panting \nCreek, something looked into the kitchen  and came towards me. Once I saw my dad come from the pitch darkness, I knew I was scared of another he asked me what are  you doing\" I told him I was taking medicine he said okay and told me go to sleep  after I took the pills  then he went back upstairs I took the medicine and went back upstairs then I finally went back to sleep.\n\n\n\n\n\n\n\n\nPart 2*the basement*\nLike I told you in the other story into the basement, my grandma  went to go get cookies, and here's the full story.\nAs I was walking down the stairs, I saw walls that looked really old with cracks and holes  with a tiny spiderweb in one of them with Saint Patrick's day decor on the stairs in bags and one with a plushie standing at the bottom of the stairs starring into my soul*that was sarcasm* I went into the downstairs I saw a  scary looking shadow figure with sharp claws at the corner of my eyes   I looked it was gone  as my grandma opened the fridge I went exploring I went  behind all the  decor and stuff in the basement * I'm getting tired of typing  so I'm just going to put less details* in one of the rooms we're files my grandparents didn't even know about and I saw a window  that looked up to the front  of the house and I saw a figure and I didn't tell my grandparent I still haven't told them and they probably  just covered that room with more decor for holidays \n\n\nLike or reply or whatever for a part 3",
      "created_utc": 1711831006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbvy4yw",
      "author": "PutJazzlike8798",
      "body": "I had a dream of my dead family and friends,I don't know how or why,but they said\"prepare for an upcoming event\"......Should I be concerned?",
      "created_utc": 1720270435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhaj6zn",
      "author": "AideLegitimate9747",
      "body": "[https://www.youtube.com/watch?v=YXyz0eZnzQc&t=208s](https://www.youtube.com/watch?v=YXyz0eZnzQc&t=208s)",
      "created_utc": 1723218520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lipat47",
      "author": "Dramatic-Boat-8253",
      "body": "Late one night, Sarah heard the faint sound of her grandmother’s voice calling her from the kitchen. It was odd, as her grandmother had passed away months ago. Curiosity and a deep sense of dread pushed Sarah to investigate. She tiptoed down the hallway, the wooden floorboards creaking under her feet.\n\nAs she approached the kitchen, the voice grew louder, more insistent. “Sarah, come here.”\n\nWhen she reached the doorway, she saw her grandmother standing by the stove, just as she had in life. But something was off—her skin was too pale, her smile too wide.\n\n“Grandma?” Sarah whispered.\n\nThe figure turned slowly, its eyes black and hollow. “You shouldn’t have come, Sarah.”\n\nBefore she could scream, everything went dark.\n\nThe next morning, Sarah’s family found the kitchen empty, except for the old rocking chair, gently swaying back and forth. No one ever saw Sarah again.",
      "created_utc": 1723981024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lipcvoh",
      "author": "Dramatic-Boat-8253",
      "body": "The storm hit the small fishing village with a vengeance, sending waves crashing against the cliffs and winds howling through the narrow streets. Daniel, a seasoned fisherman, had never seen anything like it. He was alone on his boat, far from shore, struggling to keep it from capsizing. The sea was merciless, and every wave felt like a punch, each one stronger than the last.\n\nAs he fought to steer the boat, Daniel caught sight of something in the water. At first, he thought it was just debris, but then it moved against the current. A dark shape, large and menacing, circled the boat. His heart pounded as the realization set in—it wasn’t debris. It was something alive.\n\nSuddenly, the boat jolted, nearly throwing him overboard. The creature had rammed the hull. Daniel scrambled for the harpoon, but another hit knocked him off balance. He fell hard, gasping as icy water surged over the deck.\n\nThe shape rose from the depths, and for a moment, Daniel saw it clearly. A massive, serpentine body, scales glistening in the lightning flashes, and eyes—intelligent, ancient eyes—staring straight at him. It reared up, and in that split second, Daniel knew he was facing something beyond human understanding, something the sea had kept hidden for centuries.\n\nThe boat lurched again, and this time, it didn’t recover. The last thing Daniel saw before he was swallowed by the waves was the creature diving back into the abyss, dragging the boat down with it. Silence followed, save for the storm’s roar, as if the sea itself had closed over the horror it had unleashed.\n\nBy dawn, the storm had passed, and the villagers found the wreckage washed up on the shore. But of Daniel, there was no sign. Only the twisted remains of his boat and the deep gouges in the wood hinted at the nightmare he had faced. The sea was calm again, deceptively peaceful, as if nothing had ever happened. But the villagers knew better. They had seen the marks and the look in the eyes of those who had gone too far out and returned with stories no one believed.\n\nNo one ventured far from shore after that. And at night, when the wind howled and the waves crashed against the cliffs, they locked their doors and whispered prayers, hoping the sea would keep its secrets buried deep.",
      "created_utc": 1723982132.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lod0v20",
      "author": "None",
      "body": "This is very short but i thought of it and creeped myself out.\n\nA woman woke up in the middle of the night. As her vision adjusted to the dark bedroom she noticed a figure ontop of her. Without eyes they were holes. A grin so widely impossible. She was used to this kinda stuff knowing she was having sleep paralysis. So she closed her eyes and turned on her side.\n\nExplanation for the people that didn't understand: sleep paralysis means you cant move. She did. That means she wasnt dreaming",
      "created_utc": 1727013062.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpjvsql",
      "author": "Peculiariatics",
      "body": "This was about 9 or 10 years ago when I had just started high school. When I started high school I was very cautious of the time because I had to get up earlier than I would normally and I would always wake up in the middle of the night and would check my phone to see what time it was. This one night the same thing happened and I checked the time. I can't remember but I think it was about 4am. I went to turn over but heard shouting outside that sounded to be right at the top of the road outside my house. I opened my curtains and stared down the road and vaguely saw 2 or 3 people beating the life out of some other guy. I could hear him screaming for his life and I just sit there staring waiting for it to be over. When It was over I could see them clearly leaving the guy on the road most likely dead. It was then I heard my dad getting up for work because he gets up really early and I ran out to him telling him to look out the window. He looked out and there was nothing there. I couldn't believe it. It was like something out of a horror movie he had just vanished. I was absolutely sure he was there. My dad and mom never believed me but I know it happened.",
      "created_utc": 1727643461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmjf7k0",
      "author": "NocturnalTwitch",
      "body": "Mine is pretty basic but I started throwing up blood & It really scared me I still do it time to time but ever since I threw up blood I don’t do it on a daily basis.",
      "created_utc": 1685658922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp74mda",
      "author": "Reasonable_You3036",
      "body": "When I was 9 years old, my mother and I went to the bathhouse, which was with my grandparents on the site of their house. I'm from Russia, so few people will understand which bathhouse I'm talking about, it was made of wood and it's been very old. I went to this bathhouse with my mother almost from birth. At first everything was as usual, we came in and started washing, suddenly we began to swear in elevated tones and quarreled and went into the dressing room. After 2 minutes, we hear that the basins that were on the shelf in the bath itself with a roar fly in the other direction and fight against the wall, my mother and I were very scared then hahahahahaha, we didn't quarrel in the bath anymore:)",
      "created_utc": 1687506972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqbb4f3",
      "author": "MetalKey6387",
      "body": "So i was around 7 or 8 and i made popsicle stick characters of my family. Then one day my grandma died and you wont belive what happened, the grandma stick figure was gone. Now today im scared because all of the sick characters are gone. Wish me luck.",
      "created_utc": 1688250403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqbj4bd",
      "author": "Dragon_knukles45",
      "body": "When I was about 7 years old, me and my brother were bored to death and just sitting on the couch, when my brother suggested to play hide and seek! At the time my grandma lived with us and didn't have a very good relationship with my mother, and they were fighting when I decided to play. I grabbed two glowsticks from my bedroom and handed one to my brother, and it wasn't even dark, it just made it a bit scarier!\n\n I forgot to add that I'm the kid to listen to horror stories when I sleep, I just love the extra adrenaline rush! Anyway, of course I was it, so I counted to 60 and went on my way! My Grandma's room was off limits and my Mom didn't really care if we went in her room, so I checked in there first. (He wasn't there) So I went to my room next. Now to get the next part you're going to have to understand the lay out of my room. The door you walk through has a TV on the same wall to the right of you, on the right wall there was a bunkbed, in front of you another bunk bed, and to your left a bathroom.\n\nI walked into my room and my brother was obviously behind the TV, although what I saw next was the scariest thing I have ever seen in my life, and no I'm not schizophrenic! There was a head at the top of the bathroom doorway, it had a long neck and long hair, but I was more focused on getting out of there! Even though I was about to shit my pants I knew I had to get my crying brother out of the room, so I grabbed his arm and left the room! And yeah i slept in the living room that night and never saw that... Thing ever again!",
      "created_utc": 1688254190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jse42qu",
      "author": "SturdyGhostgirl",
      "body": "Okay so it was a long time ago when i was like 7 i was going to the bathroom and i had got up to leave the bathroom and as i was flushing the toilet i see 2 black hands come out of the shower curtain and of course as a 7 year old i ran out sreaming and and told my dad and so my dad ran into the bathroom and then he came out and was like nobody is in there. Still to this day i'm scared to go to the bathroom.",
      "created_utc": 1689639622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jubuwd4",
      "author": "PipZaxy",
      "body": "I know everything…\n\nSo at first I thought it was cool and all but then the horrors started.\n\nA couple of weeks ago i got crushed by a bookshelf and i got knocked out and woke up with the superpowers I then thought. I realized I knew everything that will ever going on and already what has I knew the future I knew if there is extraterrestrial life or not.\n\nI went home and I knew my dog chewed up one of my shoes and I yelled at him. Then I realized I knew what he felt. So I tried to see if he learns better from yelling or being nice and just taking away things but it ended up he didn’t care at all.\n\nThen I went to bed and didn’t have any dreams. The next day I woke up and I realized I knew when I would die how and how others would so my best friend would die in a day from a car accident so I told him to stay in his house and he Listened. so then told the doctors the cure to cancer and it worked but the government needed to keep that classified I don’t know why but they did.\n\nAnyway after I got a call from my best friend due to unknown causes he was perfect fine and in tip top shape. I guess he was just meant to die that day and i didn’t even know for some reason.\n\nSo I was basically just a normal person and I decided to keep my power to myself unless there would be a situation that I could help with. There was finally but it wasn’t good, so a flood was about to happen and I some was able to talk the people into leaving. I guess my powers also gave me social skills too?\n\nAnyway we are all in an old warehouse keep in mind there is like 200 people in my town so it wasn’t super crowded but then we were resting. Then I heard blood curdling screams of people asking for help I went over there and this guy was slumped over dead and people are dying left and right I just curl up in a ball in the corner and I ball my eyes out.  finally it all stopped.\n\nI look around they are all dead now I am starting to fade.",
      "created_utc": 1690889329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jwagjya",
      "author": "No_Swan7182",
      "body": "I remember 2 years ago me and my cousin were at our grandma and were watching TikTok together, and  a moment I saw in the room next to ours something semi-translucent running fast, and I also felt little breeze. I thought that I was going crazy and I looked at my cousin who was staring at me at asked \"Have you also seen this?\". I was fucking scared. After that moment nothing strange happened, but I continue to ask myself \"wtf was that?\".",
      "created_utc": 1692110183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7chw94",
      "author": "Affectionate-Fan6977",
      "body": "6 years ago I had a very different and creepy experience, I have 3 kids and at the time my younger daughter was 6 and my eldest daughter was 12. One night when everyone was sleeping, I woke up with my eldest daughter standing right beside my bed. I woke up feeling groggy and freaked out, asked her what she was doing, she replied saying mum Lilly is sitting at my bedroom door, her bedroom was right next to mine and my eldest was opposite mine. I looked at my opened door and saw Lilly standing there but facing the wall. I said too her \" go back to bed Lilly\" she did not answer me so I said it again, when I finally woke up properly I saw that what I thought was Lilly was in fact NOT her, it was a little girl spirit I guess you could say floating above the ground wearing a white dress....I freaked out and my eldest daughter and I slowly walked to my door.......the little ghost girl vanished. I walked into Lilly's room and she was fast asleep in her bed. I have no idea what happened. Both me and my eldest daughter did not sleep for the rest of the night 😐😐😐😐😐.",
      "created_utc": 1698833999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7lkgdt",
      "author": "Idonotsleepatnight",
      "body": "A few months back I had this nightmare.. gosh it's like it's burned into my brain I'll never forget it... Okay so in this nightmare I was at my house and there was a bridge with a rode that went on and on like it went forever? I'm not sure. I was talking to my stepdad then my mom.... My mom turned into a demon it was tall? The memory is burnt in but it's just so blurry... A tall demon red glowing eyes it was hunched over it was so skinny it's legs and arms were long and it's head? It was unhuman. This thing then turned into a old lady that was familiar I don't know why. It repeated the words \"remember.\" No it shouted \"remember! Remember! REMEMBER!\" It got progressively louder than it contorted back into the demon and one of my old bullies was there I'll call him Liz. Liz, me, and my stepdad ran to his truck me and Liz got into a bag attached to the truck and drove down the bridge while it chased after us me and Liz fell out it didn't hurt but I should've woken up but something was preventing me... We fell out my stepdad drove away we started to push it off the bridge it came back up and then turned into Liz's little sister we kept pushing. Once, twice, then the third time it fell I suddenly felt a rush of guilt then I woke up.",
      "created_utc": 1698978276.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kasl1ex",
      "author": "SubstantialPirateee",
      "body": "i woke up around 1-12 am to get a drink at 8 and i saw a figure with red eyes staring at me from my living room i ran in my room closed the door and went on my bed telling myself it didn’t happen a week later i was making a video at 6 in the morning on a Sunday (i’m a morning person) an i saw the same guy behind me except eyes less glowing and legs gone and his limps for legs looked like falling sand and he was just staring straight dead eyes i saw it and again ran i didn’t get it on camera but the next day i went to this after school program and my friend told me the exact same thing happened to her before i could tell her it happened to me in the exact same details but she yelled at the first guy and he just faded away LIKE SAND and his eyes fell out explaining the second guy!",
      "created_utc": 1700971357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdsanfn",
      "author": "None",
      "body": "So when i was about 7 or 8 years old i lived near an dominos, \\[about 100 meter walk\\] i would go there often with my parents and we would take the pizza home, but one day is an day that kinda just got me scared and sleepless. so we were going to get pizza that day and i saw an man walk in fully black, first i tought nothing about it but he kept following us and staring at me, i was scared to talk so i just kept my mouth shut. when we got to the dominos we ordered pizza and i saw that same man staring at me trough the window, the only thing that i could see was him looking me in the eyes. i didnt really see his face because it was really dark. i was really scared and he walked away. as we got the pizza i still didnt say anything. and we walked home again. so when we got home i actualy saw him again looking trough the living room window but we walked away fast. few days later i think i saw him again walking trough the park near us and i have not seem him after. i never told anyone this accept now..",
      "created_utc": 1702838916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ki7h2vu",
      "author": "Moathmohad",
      "body": "THE STORY OF THE THREE KNOCKS:\n\nWhen I used to live with my family one day late at night I went to the kitchen to get some food and when I was done walking out of the Kitchen I heard Three knocks on the door it's not something normal where i used to live for someone to knock on your door later at night I lived in a very isolated place because we lived near a cement factory, and the closest gas station to my house was about 9 kilometers away ‏ so I kept asking (who is it) again and again and again but I got no answer I was afraid if it was some attacker that wanted to rob us or anything like that so I couldn't open the door I wanted to but I was so scared that I couldn't do it so I ran upstairs to my parents room and I woke up my mother to tell her what happened and she told me that it might have been the monkeys that did that because where i used to live there was a lot of monkeys in my neighbourhood but I didn't believe her because I knew what I heard it was three knocks it was so clear to me that i had no doubt in my mind that it wasn't anything other than that\n\nI told the story to a lot of people and it was nothing to them but to me every time I get back to that house to visit my family at vacations I sometimes stare at that door later at night thinking that maybe at the next second I will hear that three knocks again.",
      "created_utc": 1705450961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krah52g",
      "author": "Impossible_Smoke_700",
      "body": "As a person who listen to scary stories with my siblings at nights where we can't sleep, I find it hard to concentrate to the story whilst reading it. Cuz when I'm listening to my Big Brother reading it, I can close my eyes and imagine the scene. But Unfortunately, I can't do that while reading these stories cuz I actually have to keep my eyes open to read it.\n\nMy solution: Copy and paste it on google translate and it can read it to me.",
      "created_utc": 1708436668.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kriegaq",
      "author": "Jealous_Ad_9338",
      "body": " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIdk what to say im looking for random things",
      "created_utc": 1708550652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmcwnpa",
      "author": "YeahNoYeahMaybeNo",
      "body": "I read bear and thought you almost got slaughtered by one",
      "created_utc": 1685551130.0,
      "score": 14,
      "context": [
        {
          "id": "jmck2xt",
          "author": "three_d0wn",
          "body": "I was in a small shared flat with my family for a holiday, and I had eaten myself sick on cheese. When everyone was asleep I got up and purged into a bag in a dark storage cupboard because it was the only place where I wouldn’t wake anyone. The smell was rancid, and there were several litres of vomit in the bag. It was so heavy it leaked when I lifted it. I had to sneak another larger bag to put it into before it split completely. It was around 2am at this point, and bear in mind we’re staying in a mountain village in the middle of winter. I then stole out of the flat in my (pretty light) pyjamas and wandered barefoot around a strange town in a foreign country at the dead of night in freezing temperatures looking for a place to dispose of my sack of vomit. I will never forget that night.",
          "created_utc": 1685546369.0
        }
      ]
    },
    {
      "id": "jmebnkl",
      "author": "No-Expression-399",
      "body": "That’s the WORST.. I can’t stand it when the bag breaks. I’m so sick (literally) of doing this.",
      "created_utc": 1685570203.0,
      "score": 8,
      "context": [
        {
          "id": "jmck2xt",
          "author": "three_d0wn",
          "body": "I was in a small shared flat with my family for a holiday, and I had eaten myself sick on cheese. When everyone was asleep I got up and purged into a bag in a dark storage cupboard because it was the only place where I wouldn’t wake anyone. The smell was rancid, and there were several litres of vomit in the bag. It was so heavy it leaked when I lifted it. I had to sneak another larger bag to put it into before it split completely. It was around 2am at this point, and bear in mind we’re staying in a mountain village in the middle of winter. I then stole out of the flat in my (pretty light) pyjamas and wandered barefoot around a strange town in a foreign country at the dead of night in freezing temperatures looking for a place to dispose of my sack of vomit. I will never forget that night.",
          "created_utc": 1685546369.0
        }
      ]
    },
    {
      "id": "k4yrjvn",
      "author": "Accomplished-Can-600",
      "body": "You can share your stories with the Youtuber The Story Buffet which is new but it's turning personal scary True stories people send into videos so feel free to do that.",
      "created_utc": 1697370388.0,
      "score": 1,
      "context": [
        {
          "id": "jmck2xt",
          "author": "three_d0wn",
          "body": "I was in a small shared flat with my family for a holiday, and I had eaten myself sick on cheese. When everyone was asleep I got up and purged into a bag in a dark storage cupboard because it was the only place where I wouldn’t wake anyone. The smell was rancid, and there were several litres of vomit in the bag. It was so heavy it leaked when I lifted it. I had to sneak another larger bag to put it into before it split completely. It was around 2am at this point, and bear in mind we’re staying in a mountain village in the middle of winter. I then stole out of the flat in my (pretty light) pyjamas and wandered barefoot around a strange town in a foreign country at the dead of night in freezing temperatures looking for a place to dispose of my sack of vomit. I will never forget that night.",
          "created_utc": 1685546369.0
        }
      ]
    },
    {
      "id": "jmcup05",
      "author": "Vickycff_1",
      "body": "Hey i'm really sorry to hear this, i hope you're okay now, i u don't mind me asking, how old were you at the time and now?",
      "created_utc": 1685550395.0,
      "score": 10,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        }
      ]
    },
    {
      "id": "jmebr8m",
      "author": "No-Expression-399",
      "body": "What were your symptoms prior to the cardiac arrest?",
      "created_utc": 1685570243.0,
      "score": 4,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        }
      ]
    },
    {
      "id": "jmlyehn",
      "author": "Several-Giraffe1930",
      "body": "i have always wondered how people with bulimia aren’t mentioning low K more. i have severely low K. usually around 1.8-2. i have been hospitalized for it more times than i can count. my kidneys are shit too.",
      "created_utc": 1685711766.0,
      "score": 3,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        }
      ]
    },
    {
      "id": "jmecg2d",
      "author": "No-Expression-399",
      "body": "My jaw dropped reading this.. this shocked me so much. I’ve felt pressure behind my eyes after purging too but I didn’t know it could go this bad.\n\nThat’s terrifying.. thanks for sharing! 💕\nIt really gives me something to think about",
      "created_utc": 1685570521.0,
      "score": 15,
      "context": [
        {
          "id": "jmdkxbq",
          "author": "Evergreenpoppy",
          "body": "I had multiple tears in my esophagus from purging, but still couldn’t stop, so I was forced inpatient. About a year later I was going to see an eye doctor because of all the new floaters in my vision, turns out both of my retinas are partially detached from the pressure from purging so much. If they would have completely detached/tore I would be blind",
          "created_utc": 1685560192.0
        }
      ]
    },
    {
      "id": "jmec78l",
      "author": "No-Expression-399",
      "body": "I’m the same way.. it takes a lot to discourage myself from doing stupid stuff. It’s the thing I hate the most about myself, the curiosity just overcomes me.\n\nI’ve lost my ability to purge before as well.. my stomach also stopped working completely. If I eat then I would have that same meal in my stomach or intestine for 2-3 days straight; yet I’d still feel hungry because my body wasn’t aware I had even eaten anything since it probably just thought I’d vomit it up.\n\nIt’s really hard to slow down, much less stop completely. It’s so weird how we end up gaining weight despite puking it all up?\n\nI’m so confused about that part haha",
      "created_utc": 1685570421.0,
      "score": 3,
      "context": [
        {
          "id": "jmci71b",
          "author": "Branch-Much",
          "body": "I got an endoscopy after it hurt to swallow anything- I was okay in the end, but oesophageal strictures are a real thing. It’s super rare, but there is potential for oesophageal cancer too. \n\nIn 2019, I b/p-ed like a motherfucker (it was a tough year, emotionally). I gained ten kilos/22lbs 😦. I wish I was kidding. My gag reflex just stopped working, and yet I kept trying. I purge very occasionally now, and have lost about six of those kilos.\n\nThere’s also the thousands of dollars literally flushed down the toilet, throat pain, face swelling, poor digestion, isolation and all that fun stuff 🫠🫠. I also have to remember the scariness to stop myself purging! It’s the only thing that stops me.",
          "created_utc": 1685545641.0
        }
      ]
    },
    {
      "id": "jmeogez",
      "author": "AKidNamedMescudi",
      "body": "How did you overcome your ED?",
      "created_utc": 1685575563.0,
      "score": 5,
      "context": [
        {
          "id": "jmd0dld",
          "author": "makeupyourworld",
          "body": "I had a heart attack at 14, have been in kidney failure at least 3 times, became severely septic, been in the ICU, had my entire body and face swell until I couldn't even walk or move. Shat blood at disney world... list goes on",
          "created_utc": 1685552504.0
        }
      ]
    },
    {
      "id": "jmfgw19",
      "author": "Fairy_Sweet_22",
      "body": "Holy shit I need a link",
      "created_utc": 1685588529.0,
      "score": 2,
      "context": [
        {
          "id": "jmd3l1t",
          "author": "Few_Ad_6447",
          "body": "I recently read a case study about a bulimic teen where the stomach got so dilated and full that it compressed the aorta and blood flow to legs and other organs. She ended up losing most of her intestines and spent months in the hospital.",
          "created_utc": 1685553708.0
        }
      ]
    },
    {
      "id": "jmfjc1f",
      "author": "Fairy_Sweet_22",
      "body": "Oof I just posted a story like this here too. Literally choked and was too embarrassed. Reading this now I feel like I was touched by something sacred… sounds corny but I don’t know how I lived",
      "created_utc": 1685589767.0,
      "score": 6,
      "context": [
        {
          "id": "jmeeoou",
          "author": "gorewhored",
          "body": "one of my close online friend's sisters choked on her own vomit and died alone in her bathroom on christmas eve. when she was purging a large piece of food got stuck in her throat and she was too embarrassed to ask for help until it was already too late. found out a week later from her horrified mother was the one who found her daughter splayed out on her bathroom floor, dead, covered in vomit on christmas morning. i think she was only 21-23. my friend said she was in her very early 20's when we were talking in a vc one time. \n\nshe doesn't talk about it often, but when she does it's super fucking dark.",
          "created_utc": 1685571411.0
        }
      ]
    },
    {
      "id": "jmfovcs",
      "author": "erraticella",
      "body": "Incredibly proud of you!!!",
      "created_utc": 1685592743.0,
      "score": 1,
      "context": [
        {
          "id": "jmf66af",
          "author": "clumsycouture",
          "body": "I’ve basically ruined all my teeth and have had gut issues since I was 16. I had like 6 extractions and all my teeth filled last year from puking so much. I also had Russes Sign (callouses on knuckles) I quit when I was 21 and I’m 33 now and still have rough knuckles. I luckily stopped when I started seeing blood in my puke but it could have been so much worse. I was actively bulimic for 5 years and I probably would be dead today if I didn’t quit.",
          "created_utc": 1685583481.0
        }
      ]
    },
    {
      "id": "joq2hnx",
      "author": "Throwaway817263626",
      "body": "I’m still so traumatized from my DIY plumbing incident, 9 years later. Bulimia is so violent. My heart goes out to you.",
      "created_utc": 1687193694.0,
      "score": 2,
      "context": [
        {
          "id": "jmgjjui",
          "author": "send-help-im-dying",
          "body": "My abusive ex came home from work in the middle of the night during my nightly binge purge routine as I was vomiting in the shower. He proceeded to berate me as I sobbed, attempting to shovel handfuls of my vomit from the tub into the toilet because the drain became clogged (which of course had never happened before that night). It was humiliating and dehumanizing, and I still think about it from time to time after years of recovery.",
          "created_utc": 1685615803.0
        }
      ]
    },
    {
      "id": "k7ci0wb",
      "author": "Affectionate-Fan6977",
      "body": "Oh i didnt reas the top part sorry not a vomit story haha",
      "created_utc": 1698834093.0,
      "score": 1,
      "context": [
        {
          "id": "k7chw94",
          "author": "Affectionate-Fan6977",
          "body": "6 years ago I had a very different and creepy experience, I have 3 kids and at the time my younger daughter was 6 and my eldest daughter was 12. One night when everyone was sleeping, I woke up with my eldest daughter standing right beside my bed. I woke up feeling groggy and freaked out, asked her what she was doing, she replied saying mum Lilly is sitting at my bedroom door, her bedroom was right next to mine and my eldest was opposite mine. I looked at my opened door and saw Lilly standing there but facing the wall. I said too her \" go back to bed Lilly\" she did not answer me so I said it again, when I finally woke up properly I saw that what I thought was Lilly was in fact NOT her, it was a little girl spirit I guess you could say floating above the ground wearing a white dress....I freaked out and my eldest daughter and I slowly walked to my door.......the little ghost girl vanished. I walked into Lilly's room and she was fast asleep in her bed. I have no idea what happened. Both me and my eldest daughter did not sleep for the rest of the night 😐😐😐😐😐.",
          "created_utc": 1698833999.0
        }
      ]
    },
    {
      "id": "jmj4ltu",
      "author": "three_d0wn",
      "body": "Oml this made me laugh. Tbh I was in such a state I probably wouldn’t have given a shit. This illness has literally driven me insane lol",
      "created_utc": 1685654553.0,
      "score": 4,
      "context": [
        {
          "id": "jmck2xt",
          "author": "three_d0wn",
          "body": "I was in a small shared flat with my family for a holiday, and I had eaten myself sick on cheese. When everyone was asleep I got up and purged into a bag in a dark storage cupboard because it was the only place where I wouldn’t wake anyone. The smell was rancid, and there were several litres of vomit in the bag. It was so heavy it leaked when I lifted it. I had to sneak another larger bag to put it into before it split completely. It was around 2am at this point, and bear in mind we’re staying in a mountain village in the middle of winter. I then stole out of the flat in my (pretty light) pyjamas and wandered barefoot around a strange town in a foreign country at the dead of night in freezing temperatures looking for a place to dispose of my sack of vomit. I will never forget that night.",
          "created_utc": 1685546369.0
        },
        {
          "id": "jmcwnpa",
          "author": "YeahNoYeahMaybeNo",
          "body": "I read bear and thought you almost got slaughtered by one",
          "created_utc": 1685551130.0
        }
      ]
    },
    {
      "id": "jmcw5mh",
      "author": "DazzlingInjury9129",
      "body": "for the first one i was 17 and the second one i was 18 and now i’m 20",
      "created_utc": 1685550941.0,
      "score": 11,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        },
        {
          "id": "jmcup05",
          "author": "Vickycff_1",
          "body": "Hey i'm really sorry to hear this, i hope you're okay now, i u don't mind me asking, how old were you at the time and now?",
          "created_utc": 1685550395.0
        }
      ]
    },
    {
      "id": "jmebvkb",
      "author": "DazzlingInjury9129",
      "body": "not really sure because both times happened in my sleep",
      "created_utc": 1685570292.0,
      "score": 9,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        },
        {
          "id": "jmebr8m",
          "author": "No-Expression-399",
          "body": "What were your symptoms prior to the cardiac arrest?",
          "created_utc": 1685570243.0
        }
      ]
    },
    {
      "id": "jmnet65",
      "author": "makeupyourworld",
      "body": "Just one day i started eating and cutting the laxatives down. It was after the sepsis last july. I was using about 200 a day. Of dulcolax. I'm down to 36 a day, which is way better. I really hate my body and still count calories, but its really nice to not vomit and poop blood all day. I also really try to eat a lot of fiber. Naturally i get hungry now which i have to remind myself is normal and means i'm a human being. \n\nGI system still gets extreme bloating and I can definitely look \"heavier\" than people the same weight due to swelling in my stomach, calves, and face. I wear loose clothes, make my own food, and another thing that helps me is verbalizing my anxiety. Saying out loud \"i feel fat and disgusting. Eating this is hard,\" helps. But you have to counteract it with like \"yeah this cheese has fat, but the spinach has a lot of fiber and is nutritious,\" \"the starbucks barista would not sabotage me by adding cream to my drink cause she doesn't care enough to do that,\" and \"you can't work tomorrow if you take 100 laxatives tonight, cause you'll be vomiting.\"",
      "created_utc": 1685732634.0,
      "score": 4,
      "context": [
        {
          "id": "jmd0dld",
          "author": "makeupyourworld",
          "body": "I had a heart attack at 14, have been in kidney failure at least 3 times, became severely septic, been in the ICU, had my entire body and face swell until I couldn't even walk or move. Shat blood at disney world... list goes on",
          "created_utc": 1685552504.0
        },
        {
          "id": "jmeogez",
          "author": "AKidNamedMescudi",
          "body": "How did you overcome your ED?",
          "created_utc": 1685575563.0
        }
      ]
    },
    {
      "id": "jmfknsa",
      "author": "Few_Ad_6447",
      "body": "https://www.frontiersin.org/articles/10.3389/fpsyt.2020.00741/full\n\nhttps://jamanetwork.com/journals/jamasurgery/article-abstract/592563\n\nhttps://www.cureus.com/articles/118677-acute-gastric-dilatation-complicated-by-necrosis-and-perforation-following-a-binge-eating-episode\n\nhttps://jamanetwork.com/journals/jamasurgery/article-abstract/592563",
      "created_utc": 1685590455.0,
      "score": 4,
      "context": [
        {
          "id": "jmd3l1t",
          "author": "Few_Ad_6447",
          "body": "I recently read a case study about a bulimic teen where the stomach got so dilated and full that it compressed the aorta and blood flow to legs and other organs. She ended up losing most of her intestines and spent months in the hospital.",
          "created_utc": 1685553708.0
        },
        {
          "id": "jmfgw19",
          "author": "Fairy_Sweet_22",
          "body": "Holy shit I need a link",
          "created_utc": 1685588529.0
        }
      ]
    },
    {
      "id": "jmfkyf0",
      "author": "gorewhored",
      "body": "dw i've choked on my own vomit a few times. it's bound to happen to purgers at least once. just stay safe, learn how to save yourself from choking with youtube tutorials, and know when to ask for help no matter how embarrassing it is. stay safe friend 🫶🏻",
      "created_utc": 1685590613.0,
      "score": 5,
      "context": [
        {
          "id": "jmeeoou",
          "author": "gorewhored",
          "body": "one of my close online friend's sisters choked on her own vomit and died alone in her bathroom on christmas eve. when she was purging a large piece of food got stuck in her throat and she was too embarrassed to ask for help until it was already too late. found out a week later from her horrified mother was the one who found her daughter splayed out on her bathroom floor, dead, covered in vomit on christmas morning. i think she was only 21-23. my friend said she was in her very early 20's when we were talking in a vc one time. \n\nshe doesn't talk about it often, but when she does it's super fucking dark.",
          "created_utc": 1685571411.0
        },
        {
          "id": "jmfjc1f",
          "author": "Fairy_Sweet_22",
          "body": "Oof I just posted a story like this here too. Literally choked and was too embarrassed. Reading this now I feel like I was touched by something sacred… sounds corny but I don’t know how I lived",
          "created_utc": 1685589767.0
        }
      ]
    },
    {
      "id": "jmfw05t",
      "author": "dubioushamster",
      "body": "how frequently did/had you been purging?",
      "created_utc": 1685597141.0,
      "score": 5,
      "context": [
        {
          "id": "jmchsn5",
          "author": "DazzlingInjury9129",
          "body": "i had 2 separate cardiac arrest because of low potassium from the purging and now i have a pacemaker/defibrillator implant to regulate my BPM and the defibrillator will shock my heart if it stops again :/ my first cardiac arrest the EMS told my mom i was technically dead for 4 mins",
          "created_utc": 1685545485.0
        },
        {
          "id": "jmebr8m",
          "author": "No-Expression-399",
          "body": "What were your symptoms prior to the cardiac arrest?",
          "created_utc": 1685570243.0
        },
        {
          "id": "jmebvkb",
          "author": "DazzlingInjury9129",
          "body": "not really sure because both times happened in my sleep",
          "created_utc": 1685570292.0
        }
      ]
    },
    {
      "id": "jmnf9ft",
      "author": "makeupyourworld",
      "body": "Last random caveat sorry i'm rambling. \nI'm really good at cooking and have found my friends and loved ones are far more impressed with my ability to cook than they ever were with my abilities to starve.",
      "created_utc": 1685732812.0,
      "score": 7,
      "context": [
        {
          "id": "jmd0dld",
          "author": "makeupyourworld",
          "body": "I had a heart attack at 14, have been in kidney failure at least 3 times, became severely septic, been in the ICU, had my entire body and face swell until I couldn't even walk or move. Shat blood at disney world... list goes on",
          "created_utc": 1685552504.0
        },
        {
          "id": "jmeogez",
          "author": "AKidNamedMescudi",
          "body": "How did you overcome your ED?",
          "created_utc": 1685575563.0
        },
        {
          "id": "jmnet65",
          "author": "makeupyourworld",
          "body": "Just one day i started eating and cutting the laxatives down. It was after the sepsis last july. I was using about 200 a day. Of dulcolax. I'm down to 36 a day, which is way better. I really hate my body and still count calories, but its really nice to not vomit and poop blood all day. I also really try to eat a lot of fiber. Naturally i get hungry now which i have to remind myself is normal and means i'm a human being. \n\nGI system still gets extreme bloating and I can definitely look \"heavier\" than people the same weight due to swelling in my stomach, calves, and face. I wear loose clothes, make my own food, and another thing that helps me is verbalizing my anxiety. Saying out loud \"i feel fat and disgusting. Eating this is hard,\" helps. But you have to counteract it with like \"yeah this cheese has fat, but the spinach has a lot of fiber and is nutritious,\" \"the starbucks barista would not sabotage me by adding cream to my drink cause she doesn't care enough to do that,\" and \"you can't work tomorrow if you take 100 laxatives tonight, cause you'll be vomiting.\"",
          "created_utc": 1685732634.0
        }
      ]
    }
  ]
}