{
  "id": "1429yew",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1686043159.0,
  "title": "i cant eat normal meals anymore",
  "selftext": "for a while now, just eating the slightest bit of food sends me into these crazy binges and i feel like i have no control, so to avoid feeling gross i try to fast but due to health reasons i can't fast for too long without ACTUALLY needed to eat and like i said before i can't control myself:( and i end up purging and its never ending. my self esteem has never ever been worse.",
  "url": "https://www.reddit.com/r/bulimia/comments/1429yew/i_cant_eat_normal_meals_anymore/",
  "score": 64,
  "num_comments": 7,
  "comments": [
    {
      "id": "jn3ksnz",
      "author": "PoldiL",
      "body": "IM WITH YOU ON THIS. \n\nI’ve got to a point where a normal sized meal, to me, feels like a ‘binge’ - rationally I know it’s not but food in my stomach feels so strange and wrong… (I’m an ana/purging sub type) \n\nDon’t fast, don’t restrict \n\nFind ‘safe foods’ or ‘non trigger foods’ \nTry not to limit them tho… variety is good \n\nThis helps me not purge, sticking to safe foods :)\n\nAnd little by little you can reintroduced other foods with a little help :)\n\nIt’s a long process, it’s not an easy one but I believe in you :) I’ve been clean for well, I don’t even remember the last time I purged, you will get to a point where you don’t remember the last time it happened.\n\nSending lots of love and hugs xxx",
      "created_utc": 1686043677.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jn3khz5",
      "author": "kawaiikittenboy",
      "body": "I haven’t actually kept food down since 2016. This disorder has messed things up so bad",
      "created_utc": 1686043423.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jn5wmzi",
      "author": "that_one_artsy_chick",
      "body": "Stuck in the cycle of binging and purging too. Even a normal meal makes me feel “too full”. This disorder is hell",
      "created_utc": 1686082024.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo6mtyt",
      "author": "purplebunnies_",
      "body": "I do the same goddamn thing and it SUCKS\nLike.. in my mind I know a binge is WAY worse than eating a small meal but my body is like nope it’s the same so I end up just binging after I eat rlly anything because like.. I’ve already eaten so it doesn’t matter",
      "created_utc": 1686798483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jn7i4m2",
      "author": "None",
      "body": "I'm the same, I'm ana-subtype-bulimia, and I can not eat a full meal without it triggering a binge/purge - I can't handle feeling full. My attempt to remedy this was to just eat small amounts, often, so I never hit that threshold of discomfort. \n\nThis unfortunately leaves me far too low on calories, and often leads to a binge/purge that day, or the next.\n\nI cycle between full-blown B/P for a time, and then restricting/minimal food to avoid feeling full for a time. It's so frustrating when I'm wanting so much to be eating, but nothing is safe for for me in the moment. \n\nTo OP...\n\nMy one remaining trick to force myself to not purge, is to eat something I consider safe and nutritious, in a small but reasonable quantity, and then I go out. I'll either have plans made in advance, or errands to do, or when I have neither of those to do, I will literally take my laptop and go to a coffee shop and dick around on my computer for an hour or two. The goal being that I know I've digested at least SOMETHING nutritious and that will contribute to my health in a positive way, and usually any of those activities distracts me enough that I don't think about eating more, and I'm out of my home and not in a position where I even could if I wanted to (I'm a Celiac so can't eat anything at the coffee shop). \n\nIt may be uncomfortable the first few times, but I promise, it has become something I actually look forward to, and could become that for you. It could be particularly helpful for you in terms of you mentioning you can't go too long without eating - could be one way to tackle that time of day that you really have to have something.",
      "created_utc": 1686106938.0,
      "score": 2,
      "context": [
        {
          "id": "jn3ksnz",
          "author": "PoldiL",
          "body": "IM WITH YOU ON THIS. \n\nI’ve got to a point where a normal sized meal, to me, feels like a ‘binge’ - rationally I know it’s not but food in my stomach feels so strange and wrong… (I’m an ana/purging sub type) \n\nDon’t fast, don’t restrict \n\nFind ‘safe foods’ or ‘non trigger foods’ \nTry not to limit them tho… variety is good \n\nThis helps me not purge, sticking to safe foods :)\n\nAnd little by little you can reintroduced other foods with a little help :)\n\nIt’s a long process, it’s not an easy one but I believe in you :) I’ve been clean for well, I don’t even remember the last time I purged, you will get to a point where you don’t remember the last time it happened.\n\nSending lots of love and hugs xxx",
          "created_utc": 1686043677.0
        }
      ]
    },
    {
      "id": "jn3klia",
      "author": "None",
      "body": "literally, my health is declining and i can't seem to stop either its a living hell",
      "created_utc": 1686043507.0,
      "score": 3,
      "context": [
        {
          "id": "jn3khz5",
          "author": "kawaiikittenboy",
          "body": "I haven’t actually kept food down since 2016. This disorder has messed things up so bad",
          "created_utc": 1686043423.0
        }
      ]
    },
    {
      "id": "jn3kpro",
      "author": "kawaiikittenboy",
      "body": "I’m having tests for liver kidney and heart failure, neuropathy and osteoarthritis. This sort of restriction and electrolyte deprivation is ad",
      "created_utc": 1686043606.0,
      "score": 4,
      "context": [
        {
          "id": "jn3khz5",
          "author": "kawaiikittenboy",
          "body": "I haven’t actually kept food down since 2016. This disorder has messed things up so bad",
          "created_utc": 1686043423.0
        },
        {
          "id": "jn3klia",
          "author": "None",
          "body": "literally, my health is declining and i can't seem to stop either its a living hell",
          "created_utc": 1686043507.0
        }
      ]
    }
  ]
}