{
  "id": "14909wz",
  "subreddit": "bulimia",
  "author": "princessss_peachhh",
  "created_utc": 1686723470.0,
  "title": "I haven’t purged in 6 years",
  "selftext": "I was reflecting today and realized it’s been 6 years since I purged. I had a 7 year long battle with eating disorders and I just wanted to let y’all know that it’s possible. You can overcome this. I believe in every one of you.\n\nEdit: Some of y’all have asked how I’ve stayed binge and purge free for so long. Here are some tips I’ve gone by. \n\n1. Get the mirror out of your room. I can’t stress this enough. Looking at yourself in the mirror multiple times a day causes you to pick yourself apart. You look at all your flaws and start seeing issues with yourself that aren’t there. Removing the mirror from my bedroom changed my life. I only look at myself now when I do my makeup or I need to check my outfit. Overcoming body dysmorphia is a huge part of overcoming an eating disorder. Choose to love yourself and your body.\n2. Get busy. I used to fill my extra time with binging and purging. It’s all I wanted to do… it’s all I felt like I needed to do. Being busy and away from home helps you to not think about food as much. It helps occupy all the space in your brain so you don’t think about binging. Get out and go places that have public bathrooms so you’re less likely to purge. \n3. Get a hobby. Find something you enjoy, like a sport or a project. Find a hobby you can have some control over- crocheting, paper machete, soccer, piano, etc. Work towards a goal. Eating disorders are rooted in a need for control over your life. It’ll help to have a hobby you can control. \n4. Share a bathroom if you can. Part of the reason I stopped purging was because I went off to college. I shared a room with another girl. This room was connected to a bathroom which we shared with two other girls in another room. The bathroom also didn’t have any locks. I had so much fear that someone was going to walk in on me purging, so I only ever did it when I knew for a fact no one was in their room, which was VERY rare. I wasn’t purging as much and this helped me gain control of my eating disorder.\n5. Get rid of your scale. I used to weigh myself all the time looking to drop even a pound of weight, and I used to beat myself up for gaining a pound of weight. I stopped weighing myself and I would panic because I didn’t know if I was gaining weight. I had so much stress and anxiety about it, but I didn’t give in. I think I only weighed myself once in 4 months.\n6. DON’T go to the restroom after dinner. Sit with your family or friends and talk for a while after you eat. Fight against that nagging voice telling you to purge. \n7. If you’re trying to recover, DON’T tell yourself “this is the last time” when binging and purging. Giving in this time will lead to giving in next time. Stop now.\n8. Stop counting calories. You don’t need to only eat 500 calories. You need nourishment. It’s normal and healthy to eat 2,000 + calories. Your body will thank you.\n9. Exercise, even if it’s a short walk around the block. It’ll help you feel good and give you happy endorphins. Exercise is great, but don’t overdo it. Create a limit for yourself- an hour of exercise max.\n10. Make sure you have something to sip on. I always felt the need to eat something, so I would drink something instead. I liked Diet Coke because there weren’t any calories and I didn’t have any guilt about it. This will keep your mouth busy throughout the day.\n11. Buy snacks that are in individual packages. Don’t buy a whole box of crackers- you know you’re going to eat that whole box in 10 minutes. Only get snacks that come in serving sizes. \n12. Plan your meals. This helps you have control over your eating. Eat the same thing every day and the same amount every day. Changing it up creates unnecessary stress. Get comfortable with certain foods. It doesn’t have to be all foods at one time. Baby steps are okay.\n13. This one isn’t really a tip, but having faith and praying and believing that God can get me through this gave me strength. I don’t think there’s any way I could’ve done this without my faith.\n\nI hope this helps. One day you won’t have the urge to binge and purge. One day you’ll finally see how amazing and beautiful you really are. You’ll see what everyone else sees when they look at you. One day you’ll love your body. One day you’ll have a healthy relationship with food. Take it day by day. You can do this.\n\nI also want to add that I didn’t stop in one day. I fell many times, but I got back up. At one point I was a year into my recovery when I purged. It doesn’t mean all is lost. Get back up and remind yourself why you’re recovering.",
  "url": "https://www.reddit.com/r/bulimia/comments/14909wz/i_havent_purged_in_6_years/",
  "score": 80,
  "num_comments": 13,
  "comments": [
    {
      "id": "jo30sx5",
      "author": "Fit-Smoke9375",
      "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
      "created_utc": 1686733959.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jo49nte",
      "author": "crestedlizardpoison",
      "body": "I am so happy for you!! I am working on recovering too, I am doing so much better than I was. It really is possible <3",
      "created_utc": 1686759463.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jositkx",
      "author": "breathe3333",
      "body": "Thank you for this. Been in a relapse for a few years now. So tiring. Thanks for sharing the step by step. It helps.",
      "created_utc": 1687234028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lq0rrhf",
      "author": "KoiFish270",
      "body": "I just read this verse yesterday ll Corinthians 10:5-6 and I ate a lot after dinner and kept it all down, even with some candy before bed too. But this morning I made a pretty big meal and focused way too much on the calories even though it was healthy and really high protein, and ended up b/ping. Not only did I waste the good big meal, but I feel like i can’t get ahold of myself. I hope I can look back and be proud of myself like you can. I literally layed down and listened to the Bible after I ate the meal but I still ended up binging anyway. My flesh haunts me!! God please help me, I know this phone is stupid and I should be in your word but Lord I need you to guide me and be my strength because I am not strong right now. I’m sorry that I waste food and am selfish with your blessings, please hold my hand and help me rip this off of my soul once and for all, amen amen amen.",
      "created_utc": 1727895962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo3pgyn",
      "author": "maemaemo",
      "body": "Thank you",
      "created_utc": 1686750544.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo3pmt2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1686750623.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo3qvjw",
      "author": "xo_lily_xo",
      "body": "I'm so happy for you 🥲 May I ask what helped? I'm trying to recover and going through the missing it stage again?",
      "created_utc": 1686751213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo3n9nj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1686749450.0,
      "score": 10,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        }
      ]
    },
    {
      "id": "jo45z9x",
      "author": "princessss_peachhh",
      "body": "Purging and giving in one time doesn’t mean you have to relapse. This exact thing happened to me. Before I stopped purging for good I had some hiccups. It can take time to stop for good. Initially, I stopped purging for a day, then a week, then a month, then three months, then a year, then 6 years. You’re not losing progress. You said it was just a normal lunch. This statement itself is amazing because you acknowledge the fact that there was nothing wrong with the meal size. You also didn’t binge.",
      "created_utc": 1686757897.0,
      "score": 5,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        }
      ]
    },
    {
      "id": "jo46gh1",
      "author": "hallowmean",
      "body": "It's impossible to destroy the progress you made in the last 15 months. Whatever happens, you'll always have the coping mechanisms and experiences and memories you made in those months that you wouldn't have had you been engaging in disordered behaviours.",
      "created_utc": 1686758098.0,
      "score": 4,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        }
      ]
    },
    {
      "id": "jo463cn",
      "author": "princessss_peachhh",
      "body": "I posted an edit with some tips!",
      "created_utc": 1686757944.0,
      "score": 2,
      "context": [
        {
          "id": "jo3pmt2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1686750623.0
        }
      ]
    },
    {
      "id": "jo466xz",
      "author": "princessss_peachhh",
      "body": "Thank you! I posted an edit with some tips!",
      "created_utc": 1686757986.0,
      "score": 2,
      "context": [
        {
          "id": "jo3qvjw",
          "author": "xo_lily_xo",
          "body": "I'm so happy for you 🥲 May I ask what helped? I'm trying to recover and going through the missing it stage again?",
          "created_utc": 1686751213.0
        }
      ]
    },
    {
      "id": "jo7c4t3",
      "author": "Fit-Smoke9375",
      "body": "Thank you thank you thank you I was so afraid but I'm finding a lot of strength in your supportive comments xxxxx",
      "created_utc": 1686817113.0,
      "score": 1,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        },
        {
          "id": "jo3n9nj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1686749450.0
        }
      ]
    },
    {
      "id": "jo7btzk",
      "author": "Fit-Smoke9375",
      "body": "Thank you so much for the encouragement!! And congratulations on your incredible achievements. We are stronger than this! We are not at its mercy!",
      "created_utc": 1686816835.0,
      "score": 1,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        },
        {
          "id": "jo45z9x",
          "author": "princessss_peachhh",
          "body": "Purging and giving in one time doesn’t mean you have to relapse. This exact thing happened to me. Before I stopped purging for good I had some hiccups. It can take time to stop for good. Initially, I stopped purging for a day, then a week, then a month, then three months, then a year, then 6 years. You’re not losing progress. You said it was just a normal lunch. This statement itself is amazing because you acknowledge the fact that there was nothing wrong with the meal size. You also didn’t binge.",
          "created_utc": 1686757897.0
        }
      ]
    },
    {
      "id": "jo7awfk",
      "author": "Fit-Smoke9375",
      "body": "Thank you! I'll hold on to that!!",
      "created_utc": 1686815995.0,
      "score": 2,
      "context": [
        {
          "id": "jo30sx5",
          "author": "Fit-Smoke9375",
          "body": "Thank you. I needed to see this. \n\nI went without purging for 1 year and 3 months. Last Friday however, I purged a normal lunch where I just overate a little. \n\nI am very scared I might relapse again and destroy all the progress over the last 15 months.",
          "created_utc": 1686733959.0
        },
        {
          "id": "jo46gh1",
          "author": "hallowmean",
          "body": "It's impossible to destroy the progress you made in the last 15 months. Whatever happens, you'll always have the coping mechanisms and experiences and memories you made in those months that you wouldn't have had you been engaging in disordered behaviours.",
          "created_utc": 1686758098.0
        }
      ]
    }
  ]
}