{
  "id": "14f0mjl",
  "subreddit": "bulimia",
  "author": "mermaid_songs",
  "created_utc": 1687332099.0,
  "title": "When did your ED “actually” start?",
  "selftext": "I started purging food in my 20s, but I realized that bulimia is a symptom of depression and anxiety and that I coped with it using food all my life. \n\nMy mother fat shamed me as I started to gain weight quickly in middle school. I would hide in the closet after our fights and eat in secret, sometimes steal money from her wallet to buy snacks. I remember she stopped cooking dinners because she knew I was going to eat alone anyways. If she caught me eating junk she would dump the food in water and throw it in the trash- I remember eating the food out of the trash. \n\nI thought I was a pig. I wasn’t a pig, I was just scared. \n\nToday is my 10th day purge free which is the longest I’ve lasted in years. Bulimia is anything but superficial.",
  "url": "https://www.reddit.com/r/bulimia/comments/14f0mjl/when_did_your_ed_actually_start/",
  "score": 76,
  "num_comments": 47,
  "comments": [
    {
      "id": "joxqwxq",
      "author": "SinfullySinatra",
      "body": "It is hard to tell. I have never had a healthy relationship with food",
      "created_utc": 1687335490.0,
      "score": 14,
      "context": []
    },
    {
      "id": "joxoyy8",
      "author": "not_samantha1",
      "body": "I had always been pretty self conscious about myself since I was about 5. As I got older I lost quite a bit of that weight because I played soccer. Once I was in middle school I downloaded social media and started seeing everyone looking so skinny. It only made me feel worse about myself, longing to look like them.I was only 12 when I first forced myself to throw up and by now I can do it on command. Also I go throw long periods of time trying to restrict myself from eating then weeks where I give up and binge (which I feel ashamed after). But yea I think it overall started at 12.",
      "created_utc": 1687333811.0,
      "score": 10,
      "context": []
    },
    {
      "id": "joxqlzg",
      "author": "Cautious_Bandicoot_4",
      "body": "I was 8. Up until then, I thought getting taller and gaining weight were good things because I couldn’t wait to grow up. Everything changed that year. I don’t believe I developed a diagnosable ED until I was 11, but that’s when my eating became disordered. 37 now and stillllll in it.",
      "created_utc": 1687335228.0,
      "score": 3,
      "context": []
    },
    {
      "id": "joxqyhr",
      "author": "snapped_weenie",
      "body": "I remember throwing up on the playground when I was 10. I've had multiple people tell me they don't believe me but I have people I'm still friends with who caught me doing it. By then I was also often restricting and I was in 3-4 hours of dance classes a week. I've gotten better and relapsed and gotten better and relapsed over and over. 20 now. Had a binge phase in late high school, gained weight, restricting and purging again.",
      "created_utc": 1687335528.0,
      "score": 3,
      "context": []
    },
    {
      "id": "joz2jaw",
      "author": "272829474920",
      "body": "i was 9 and people were constantly commenting on my body and how i was the ‘skinny sibling’ and the second i thought i had gained even 1 pound, i started restricting. i remember playing with one of my friends and thinking how skinny she was while we were both having a snack so instead of finishing my snack, i ‘dropped’ it on the ground. i later on became exercise bulimic.",
      "created_utc": 1687362459.0,
      "score": 3,
      "context": []
    },
    {
      "id": "joxwz1m",
      "author": "None",
      "body": "Ive always had a bad relationship with food, because I stim eat. Even as a kid, I would hide and eat.",
      "created_utc": 1687340727.0,
      "score": 2,
      "context": []
    },
    {
      "id": "joy4ios",
      "author": "AbundantiaTheWitch",
      "body": "ARFID my whole life\nAN at 14/15\nBN at 19",
      "created_utc": 1687346284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "joz5dkn",
      "author": "Corndogsketchup",
      "body": "5th grade. I googled “how to lose weight fast” accidentally stumbled upon an ED forum. Tried B/P once and was successful, it became addicting . I’m 25 now and go through relapses every so often",
      "created_utc": 1687363567.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jp00xv6",
      "author": "Additional_Bear_4336",
      "body": "I’ve never had a healthy relationship with food, I used it as a comfort item and even as young as 4-5 I remember climbing on the kitchen counters to steal food out the cupboards and hide it. I’ve always been overweight and my mum took me to slimming world with her when I was 9 which is when I first remember having disordered thoughts",
      "created_utc": 1687376003.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jp02il9",
      "author": "Tatianndavis",
      "body": "I feel you story is different than everyone else’s here. Growing up Hispanic, being thick was ok but after I gained a lot of weight due to birth control, my mom and my bf at the time told me I was fat ( I didn’t know it was because of the bc) so when we broke up and I got off it, I dropped about 30lbs. That’s when I got a lot of attention I didn’t have before, people telling me how much “better” I looked, asking me my secret. That’s when I became so obsessed with my body and really looked at how fat and disgusting I was and still am. It’s hard",
      "created_utc": 1687376620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jp06mwa",
      "author": "KixxiKarma",
      "body": "I was around 15 and got strep throat bad and couldn’t eat much for a few weeks. I lost a lot of weight and all of a sudden everyone was commenting how great I looked when I didn’t realize I was “fat” or needed to lose weight. I became obsessed with not eating. I watched a lifetime show about bulimia and then would throw up during the times I felt I ate too much. This crazy cycle has continued throughout my whole life.",
      "created_utc": 1687378232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lofyun0",
      "author": "throupandaway",
      "body": "age 23",
      "created_utc": 1727046866.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joy693a",
      "author": "jesss_ie",
      "body": "When I was 12/13…..so 25-ish years ago. It’s been a long 25 years-ish",
      "created_utc": 1687347359.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joyg5cd",
      "author": "jekyllcorvus",
      "body": "I used food as a comfort from an unstable home environment and being bullied at school from a very young age, it wasn’t until my sophomore year of high school that I learned about bulimia through an hbo special that I started and the rest is history but my ed started with binging food well before purging in hs",
      "created_utc": 1687352751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joza3x8",
      "author": "ed_mayo_onlyfans",
      "body": "It clicked in my head when I was 16, nearly 17. Then the behaviour actually started not long after my 17th birthday",
      "created_utc": 1687365420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jozba9a",
      "author": "through-the-light",
      "body": "14/15",
      "created_utc": 1687365877.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp09w8d",
      "author": "Perfect_Safe6134",
      "body": "I’m 23 now. I started three years ago after I had an adhesion kink off my intestine causing an obstruction.\n\nIt was excruciatingly painful when it finally fully kinked off and I had to have an emergency surgery. \n\nBut I can remember leading up to it I could hardly eat (needless to say) and after that whole experience I just became afraid to eat.\n\nI started off anorexic (went from 190lbs to 138) and became extremely sick from that. \n\nOne day though I learned I could purge. Since then I’ve gained back about 30lbs as I’m less afraid to eat since I know I can purge it (which I do after almost every meal)…\n\nSo mine is a little bit different bc it’s not about body image, which is surprising bc I’ve been bodybuilding since I was 15 lol. It’s more just a fear of eating.",
      "created_utc": 1687379509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp0aaxz",
      "author": "gulletgod",
      "body": "Age 12, right around the time my mums husbands started showing us who he really was. What.a. coinky. Dink. I went on my first self imposed diet aged 9 though so that's kinda suss too.\nMy eating disorder hurts less than my childhood memories. \n\nI'm sorry you went through all that hurt and suffering with your mum, hearing other people's stories of pain really breaks my heart. I hope you can find some moments of peace",
      "created_utc": 1687379671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp0tlqo",
      "author": "None",
      "body": "I started binging when I was in high school and would “cancel” the calories by running and working out for hours and hours in the garage. I didn’t know that was a disorder. One day my younger siblings were watching a stupid movie where the kids slipped laxatives into a villain’s drink and I thought it would be a good idea to get my hands on them. So I then started abusing laxatives for years; then when I was in college a close friend recommended speed… so then I became a meth head for several years all because of my bulimia. I stopped laxatives and speed in my 20s but it completely fucked up my insides and now I can’t ever manage to eat a normal meal without puking at least 60% of it up and I’m not even forcing this to occur. I barely manage to maintain my weight and I have the worst lifestyle (puking every meal / always constipated) that I’m convinced I am stuck with my SO the rest of my life cause who else is gonna accept this gross behavior?",
      "created_utc": 1687387749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp0xk89",
      "author": "Shinyghostie",
      "body": "The binge eating started in my single digits. Maybe around 6/7? I got bullied for my weight by family and peers, then the purging/starvation started around 12/13 when I started following a blog called Bones are Beautiful. The girl who owned it would post her methods, daily calorie intake, and “thinspiration”, etc\n\nI still struggle with a combination of the three and was diagnosed with AN a few years ago. I was in complete denial of it at the time.",
      "created_utc": 1687389558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp0xqcv",
      "author": "sp00kykitteh",
      "body": "I was 11 or 12 when I discovered purging and always have been overweight but grew up as a minority in a predominantly white town where mostly everyone was very thin. I think puberty and joining sports is what truly brought me from being obese as a child to a normal weight in high school but I always felt it was the purging and always thought I was still too fat bc thats all I heard my entire life. So I purged and was vegetarian (for restrictive purposes) all throughout middle and high school - then gained some weight in college from excessive drinking/partying. I’ve always had a toxic relationship with food, exercise and body age and finally sought out help last year (at the age of 26). I didnt rlly realize how much damage I was doing to my body bc I thought less weight= healthy and I wasnt completely starving myself (or so I thought). Basically through a therapist that speacializes in eating disorder recovery I learned my binge eating disorder was most likely attributed to having ADHD.",
      "created_utc": 1687389635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp1oex2",
      "author": "5star-my-notebook",
      "body": "I binged and purged for the first time when I was 6 or 7, before I knew what it was. Did it maybe 5 more times between then and age 12, became conscious of my body and began regularly overeating around 7/8, started skipping breakfast when I was 11 in 5th grade, and my ED fully formed in 7th grade, when I was 12. I was AN-b/p (primarily restricting and occasionally b/ping) until the fall of 9th grade, about 2 years after my ED “truly” began, and I’ve been bulimic since. So almost 6 years of eating disorder, as I’m 18 now, but my relationship with food has been weird since like 1st grade.",
      "created_utc": 1687402605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp1q49o",
      "author": "Megn27_",
      "body": "After my grandfather told me to quit eating syrup because I'd get fat at the age of 9, I always had that voice in my head, but I started restricting freshman year of high school (14yo) then found BP & that lasted 19 years.",
      "created_utc": 1687403502.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp1qpmm",
      "author": "heheheh79103",
      "body": "At this point the years cloud together, I don't remember not being filled with anxiety when I eat.",
      "created_utc": 1687403822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp686bc",
      "author": "kawaiikittenboy",
      "body": "I engaged in having an ED in 2016. Childhood emotional binge eating. Oh yeah, 2007",
      "created_utc": 1687486048.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jp97n2n",
      "author": "bo0o0n",
      "body": "I had such a normal relationship with food until and exercise until I was 12, and decided I wanted to eat healthier and get a six pack.  All went downhill from there.",
      "created_utc": 1687545703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joxwz4b",
      "author": "mermaid_songs",
      "body": "It was hard for me to tell too. I only realized once I started my recovery journey.",
      "created_utc": 1687340729.0,
      "score": 3,
      "context": [
        {
          "id": "joxqwxq",
          "author": "SinfullySinatra",
          "body": "It is hard to tell. I have never had a healthy relationship with food",
          "created_utc": 1687335490.0
        }
      ]
    },
    {
      "id": "jp1iryb",
      "author": "None",
      "body": "Same",
      "created_utc": 1687399763.0,
      "score": 1,
      "context": [
        {
          "id": "joxqwxq",
          "author": "SinfullySinatra",
          "body": "It is hard to tell. I have never had a healthy relationship with food",
          "created_utc": 1687335490.0
        }
      ]
    },
    {
      "id": "joxwpnb",
      "author": "mermaid_songs",
      "body": "wow five years old. I wonder at what age we are able to become “self conscious.” Is that a learned behavior or a natural part of growing up? I don’t know.",
      "created_utc": 1687340508.0,
      "score": 3,
      "context": [
        {
          "id": "joxoyy8",
          "author": "not_samantha1",
          "body": "I had always been pretty self conscious about myself since I was about 5. As I got older I lost quite a bit of that weight because I played soccer. Once I was in middle school I downloaded social media and started seeing everyone looking so skinny. It only made me feel worse about myself, longing to look like them.I was only 12 when I first forced myself to throw up and by now I can do it on command. Also I go throw long periods of time trying to restrict myself from eating then weeks where I give up and binge (which I feel ashamed after). But yea I think it overall started at 12.",
          "created_utc": 1687333811.0
        }
      ]
    },
    {
      "id": "joxwvax",
      "author": "mermaid_songs",
      "body": "I think my disordered eating worsened when I was growing as well. Any rapid bodily changes that seem out of your control like getting taller is sort of scary imo and feels unpredictable.",
      "created_utc": 1687340641.0,
      "score": 2,
      "context": [
        {
          "id": "joxqlzg",
          "author": "Cautious_Bandicoot_4",
          "body": "I was 8. Up until then, I thought getting taller and gaining weight were good things because I couldn’t wait to grow up. Everything changed that year. I don’t believe I developed a diagnosable ED until I was 11, but that’s when my eating became disordered. 37 now and stillllll in it.",
          "created_utc": 1687335228.0
        }
      ]
    },
    {
      "id": "joxx29e",
      "author": "mermaid_songs",
      "body": "Wow that breaks my heart. I want to give you a hug.",
      "created_utc": 1687340801.0,
      "score": 2,
      "context": [
        {
          "id": "joxqyhr",
          "author": "snapped_weenie",
          "body": "I remember throwing up on the playground when I was 10. I've had multiple people tell me they don't believe me but I have people I'm still friends with who caught me doing it. By then I was also often restricting and I was in 3-4 hours of dance classes a week. I've gotten better and relapsed and gotten better and relapsed over and over. 20 now. Had a binge phase in late high school, gained weight, restricting and purging again.",
          "created_utc": 1687335528.0
        }
      ]
    },
    {
      "id": "joxr23b",
      "author": "snapped_weenie",
      "body": "I've never been diagnosed because the only chance I had to be diagnosed I was in a good spot with food actually",
      "created_utc": 1687335614.0,
      "score": 1,
      "context": [
        {
          "id": "joxqyhr",
          "author": "snapped_weenie",
          "body": "I remember throwing up on the playground when I was 10. I've had multiple people tell me they don't believe me but I have people I'm still friends with who caught me doing it. By then I was also often restricting and I was in 3-4 hours of dance classes a week. I've gotten better and relapsed and gotten better and relapsed over and over. 20 now. Had a binge phase in late high school, gained weight, restricting and purging again.",
          "created_utc": 1687335528.0
        }
      ]
    },
    {
      "id": "joze8cy",
      "author": "mermaid_songs",
      "body": "When I was extremely underweight, a lot of people called me skinny but it never felt like a compliment. It made me feel self conscious. People shouldn’t be commenting on size at all",
      "created_utc": 1687367009.0,
      "score": 4,
      "context": [
        {
          "id": "joz2jaw",
          "author": "272829474920",
          "body": "i was 9 and people were constantly commenting on my body and how i was the ‘skinny sibling’ and the second i thought i had gained even 1 pound, i started restricting. i remember playing with one of my friends and thinking how skinny she was while we were both having a snack so instead of finishing my snack, i ‘dropped’ it on the ground. i later on became exercise bulimic.",
          "created_utc": 1687362459.0
        }
      ]
    },
    {
      "id": "jozf8vg",
      "author": "mermaid_songs",
      "body": "Your right it is addicting. Sometimes I felt like purging was cathartic, like letting out a good cry then passing out afterwards.",
      "created_utc": 1687367405.0,
      "score": 2,
      "context": [
        {
          "id": "joz5dkn",
          "author": "Corndogsketchup",
          "body": "5th grade. I googled “how to lose weight fast” accidentally stumbled upon an ED forum. Tried B/P once and was successful, it became addicting . I’m 25 now and go through relapses every so often",
          "created_utc": 1687363567.0
        }
      ]
    },
    {
      "id": "jp2icdt",
      "author": "mermaid_songs",
      "body": "Did your mother have a healthy relationship with food? I find it interesting how those that supposedly have their eating in control are the ones to spout disordered language when it comes to food and weight. My mom has been the same size her entire life and never struggled with snacking or overeating. Yet she was also the one to tell me that I had to lose weight, that stretch marks were ugly, and fed me liquid breakfasts. It’s like they keep the healthy dialogues surrounding food and image to themselves and only say the disordered ones to others",
      "created_utc": 1687423048.0,
      "score": 3,
      "context": [
        {
          "id": "jp00xv6",
          "author": "Additional_Bear_4336",
          "body": "I’ve never had a healthy relationship with food, I used it as a comfort item and even as young as 4-5 I remember climbing on the kitchen counters to steal food out the cupboards and hide it. I’ve always been overweight and my mum took me to slimming world with her when I was 9 which is when I first remember having disordered thoughts",
          "created_utc": 1687376003.0
        }
      ]
    },
    {
      "id": "jp2ihun",
      "author": "mermaid_songs",
      "body": "Right? It’s like you were living ur life and totally content and then someone has to point out your size. It’s not a compliment to say you look “better.” To me the best compliment is, wow you look so joyful or happy. It made me happy that you were having so much fun. Things like that is love language- not “looking slim today!”",
      "created_utc": 1687423180.0,
      "score": 3,
      "context": [
        {
          "id": "jp02il9",
          "author": "Tatianndavis",
          "body": "I feel you story is different than everyone else’s here. Growing up Hispanic, being thick was ok but after I gained a lot of weight due to birth control, my mom and my bf at the time told me I was fat ( I didn’t know it was because of the bc) so when we broke up and I got off it, I dropped about 30lbs. That’s when I got a lot of attention I didn’t have before, people telling me how much “better” I looked, asking me my secret. That’s when I became so obsessed with my body and really looked at how fat and disgusting I was and still am. It’s hard",
          "created_utc": 1687376620.0
        }
      ]
    },
    {
      "id": "lrzl8tm",
      "author": "throupandaway",
      "body": "Just kidding it’s been off an on since I was 12 🤒",
      "created_utc": 1728964120.0,
      "score": 1,
      "context": [
        {
          "id": "lofyun0",
          "author": "throupandaway",
          "body": "age 23",
          "created_utc": 1727046866.0
        }
      ]
    },
    {
      "id": "jp2izl4",
      "author": "mermaid_songs",
      "body": "I hope you are doing better now. I had a fear of eating meat and processed foods for a long time. I recently overcame my fear of meat and started eating it with every meal because my immune system was dropping. I felt stronger after eating meat and started to incorporate it into all of my meals. It was like the gateway for incorporating other fear foods into my diet. I also didn’t know I had an issue with meat at all, until people told me that they eat meat everyday.",
      "created_utc": 1687423609.0,
      "score": 1,
      "context": [
        {
          "id": "jp09w8d",
          "author": "Perfect_Safe6134",
          "body": "I’m 23 now. I started three years ago after I had an adhesion kink off my intestine causing an obstruction.\n\nIt was excruciatingly painful when it finally fully kinked off and I had to have an emergency surgery. \n\nBut I can remember leading up to it I could hardly eat (needless to say) and after that whole experience I just became afraid to eat.\n\nI started off anorexic (went from 190lbs to 138) and became extremely sick from that. \n\nOne day though I learned I could purge. Since then I’ve gained back about 30lbs as I’m less afraid to eat since I know I can purge it (which I do after almost every meal)…\n\nSo mine is a little bit different bc it’s not about body image, which is surprising bc I’ve been bodybuilding since I was 15 lol. It’s more just a fear of eating.",
          "created_utc": 1687379509.0
        }
      ]
    },
    {
      "id": "jp59gqp",
      "author": "mermaid_songs",
      "body": "Bones and Beautiful sounds like a lot like the social media influencer videos I see today “what i eat in a day” “my daily routine” except without the words thinspiration.",
      "created_utc": 1687470020.0,
      "score": 1,
      "context": [
        {
          "id": "jp0xk89",
          "author": "Shinyghostie",
          "body": "The binge eating started in my single digits. Maybe around 6/7? I got bullied for my weight by family and peers, then the purging/starvation started around 12/13 when I started following a blog called Bones are Beautiful. The girl who owned it would post her methods, daily calorie intake, and “thinspiration”, etc\n\nI still struggle with a combination of the three and was diagnosed with AN a few years ago. I was in complete denial of it at the time.",
          "created_utc": 1687389558.0
        }
      ]
    },
    {
      "id": "jp2jbs0",
      "author": "mermaid_songs",
      "body": "Ah demonizing specific foods! 😫",
      "created_utc": 1687423902.0,
      "score": 1,
      "context": [
        {
          "id": "jp1q49o",
          "author": "Megn27_",
          "body": "After my grandfather told me to quit eating syrup because I'd get fat at the age of 9, I always had that voice in my head, but I started restricting freshman year of high school (14yo) then found BP & that lasted 19 years.",
          "created_utc": 1687403502.0
        }
      ]
    },
    {
      "id": "jp2jhou",
      "author": "mermaid_songs",
      "body": "Right? Isn’t eating supposed to be fun and relaxing. Like that’s your break time during school or work. I’m supposed to look forward to it, but instead there’s just so many disordered thoughts buzzing in our heads while eating that it’s as if we were never eating.",
      "created_utc": 1687424041.0,
      "score": 2,
      "context": [
        {
          "id": "jp1qpmm",
          "author": "heheheh79103",
          "body": "At this point the years cloud together, I don't remember not being filled with anxiety when I eat.",
          "created_utc": 1687403822.0
        }
      ]
    },
    {
      "id": "jp9ia3d",
      "author": "mermaid_songs",
      "body": "So scary how it’s just a simple switch like that.",
      "created_utc": 1687550047.0,
      "score": 2,
      "context": [
        {
          "id": "jp97n2n",
          "author": "bo0o0n",
          "body": "I had such a normal relationship with food until and exercise until I was 12, and decided I wanted to eat healthier and get a six pack.  All went downhill from there.",
          "created_utc": 1687545703.0
        }
      ]
    },
    {
      "id": "jp2leha",
      "author": "Additional_Bear_4336",
      "body": "Sounds like our mums would’ve got on well! \nActually, both my parents have very disordered eating habits. They’re both constantly doing crash diets, making comments about their weight, and I’m almost certain my mum was at some point bulimic. She used to actually encourage my eating disorder when she found out",
      "created_utc": 1687425686.0,
      "score": 2,
      "context": [
        {
          "id": "jp00xv6",
          "author": "Additional_Bear_4336",
          "body": "I’ve never had a healthy relationship with food, I used it as a comfort item and even as young as 4-5 I remember climbing on the kitchen counters to steal food out the cupboards and hide it. I’ve always been overweight and my mum took me to slimming world with her when I was 9 which is when I first remember having disordered thoughts",
          "created_utc": 1687376003.0
        },
        {
          "id": "jp2icdt",
          "author": "mermaid_songs",
          "body": "Did your mother have a healthy relationship with food? I find it interesting how those that supposedly have their eating in control are the ones to spout disordered language when it comes to food and weight. My mom has been the same size her entire life and never struggled with snacking or overeating. Yet she was also the one to tell me that I had to lose weight, that stretch marks were ugly, and fed me liquid breakfasts. It’s like they keep the healthy dialogues surrounding food and image to themselves and only say the disordered ones to others",
          "created_utc": 1687423048.0
        }
      ]
    },
    {
      "id": "jp3sqry",
      "author": "Tatianndavis",
      "body": "I’ve learned to never comment on anyone’s body even if it’s a “compliment”",
      "created_utc": 1687448870.0,
      "score": 3,
      "context": [
        {
          "id": "jp02il9",
          "author": "Tatianndavis",
          "body": "I feel you story is different than everyone else’s here. Growing up Hispanic, being thick was ok but after I gained a lot of weight due to birth control, my mom and my bf at the time told me I was fat ( I didn’t know it was because of the bc) so when we broke up and I got off it, I dropped about 30lbs. That’s when I got a lot of attention I didn’t have before, people telling me how much “better” I looked, asking me my secret. That’s when I became so obsessed with my body and really looked at how fat and disgusting I was and still am. It’s hard",
          "created_utc": 1687376620.0
        },
        {
          "id": "jp2ihun",
          "author": "mermaid_songs",
          "body": "Right? It’s like you were living ur life and totally content and then someone has to point out your size. It’s not a compliment to say you look “better.” To me the best compliment is, wow you look so joyful or happy. It made me happy that you were having so much fun. Things like that is love language- not “looking slim today!”",
          "created_utc": 1687423180.0
        }
      ]
    },
    {
      "id": "jp59577",
      "author": "mermaid_songs",
      "body": "Wow hearing your story. I’m realizing that disordered language surrounding body image and food is a universal thing, anyone can perpetrate it intentionally or not.",
      "created_utc": 1687469891.0,
      "score": 2,
      "context": [
        {
          "id": "jp00xv6",
          "author": "Additional_Bear_4336",
          "body": "I’ve never had a healthy relationship with food, I used it as a comfort item and even as young as 4-5 I remember climbing on the kitchen counters to steal food out the cupboards and hide it. I’ve always been overweight and my mum took me to slimming world with her when I was 9 which is when I first remember having disordered thoughts",
          "created_utc": 1687376003.0
        },
        {
          "id": "jp2icdt",
          "author": "mermaid_songs",
          "body": "Did your mother have a healthy relationship with food? I find it interesting how those that supposedly have their eating in control are the ones to spout disordered language when it comes to food and weight. My mom has been the same size her entire life and never struggled with snacking or overeating. Yet she was also the one to tell me that I had to lose weight, that stretch marks were ugly, and fed me liquid breakfasts. It’s like they keep the healthy dialogues surrounding food and image to themselves and only say the disordered ones to others",
          "created_utc": 1687423048.0
        },
        {
          "id": "jp2leha",
          "author": "Additional_Bear_4336",
          "body": "Sounds like our mums would’ve got on well! \nActually, both my parents have very disordered eating habits. They’re both constantly doing crash diets, making comments about their weight, and I’m almost certain my mum was at some point bulimic. She used to actually encourage my eating disorder when she found out",
          "created_utc": 1687425686.0
        }
      ]
    }
  ]
}