{
  "id": "14rirjn",
  "subreddit": "bulimia",
  "author": "AdCharming4503",
  "created_utc": 1688581060.0,
  "title": "“don’t restrict your food intake in recovery” then how the fuck am i going to get better??",
  "selftext": "if i don’t restrict my food, it’s going to continue to be a binge every time i eat. \n\nrelapsed again last night. i need help to stop i can’t do this",
  "url": "https://www.reddit.com/r/bulimia/comments/14rirjn/dont_restrict_your_food_intake_in_recovery_then/",
  "score": 91,
  "num_comments": 17,
  "comments": [
    {
      "id": "jqsn3tz",
      "author": "Queenofwands1212",
      "body": "Yes it’s a total mind Fuck. Go listen to the fitness and sushi podcast… they talk all about this. And it’s been really helpful in my recovery. They have tons of episodes about binging and permission based eating and emotional eating etc",
      "created_utc": 1688585267.0,
      "score": 43,
      "context": []
    },
    {
      "id": "jqsn3mq",
      "author": "Ladybarometer",
      "body": "I guess that can be confusing. By not restricting it's more about not skipping meals or not fasting all day for one big binge. It's about not allowing yourself to get overly hungry and eating regular meals throughout the day. \n\nOne thing that helps me when I'm struggling is eating meals that have clear portion control. Canned soups, frozen dinners, sandwich with an individual bag of chips, a baked potato with a frozen broccoli and cheese packet, or even a fast food meal. I have to not pay much attention to the calories, but regardless my weight stops fluctuating as much just due to not binging since purging only gets rid of about half of the calories you consume even when you do it immediately. \n\nI do 3 meals a day when I'm having to get back into the groove of things. Maybe doing that and having the routine of eating regular portions would help?",
      "created_utc": 1688585264.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jqsxr9r",
      "author": "Pinkflavelon",
      "body": "I feel this. I don't know how to stop binging without restricting",
      "created_utc": 1688589427.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jqsji66",
      "author": "Decent-Poetry3190",
      "body": "Hey! I totally feel you but restriction is often the main reason you’re bingeing. On days when I’m eating more regularly, I rarely ever binge - even though that’s my biggest fear of what will happen when I eat normally. The urge is still often there but it’s so much easier to resist compared to when you’re starving. Getting adequate nutrition is a crucial part of recovery - from there dealing with any emotional binge/purge urges will be a lot easier because you’re not fighting your basic biological instincts. You got this - trust the process and if, after a few weeks, it’s not getting better you can re-assess. It’s a complex illness but we can do things that make it slightly easier to beat x",
      "created_utc": 1688583854.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jqtsm68",
      "author": "honeycakies",
      "body": "Are you able to see a dietician to discuss a meal plan or any similar form of structure to your eating? Might be ~controversial but I personally didn’t find “just stop restricting” to be enough in my own case, and I definitely engage in behaviors less when I have a (healthy) layout for my day",
      "created_utc": 1688602546.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jqtmdou",
      "author": "ilovesleeeping",
      "body": "you’re /more/ likely to binge if you restrict",
      "created_utc": 1688599705.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jr0ehc5",
      "author": "lovejoji",
      "body": "I think you said you have ADHD. I have it too and would recommand a nutritionnist who i watch her videos on YouTube. She propose recipes that are ADHD friendly and gave me a good advice on term of navigating not restricting and BINGE / bulimia \n\nBasically it's about adding on not cutting out \n\nWhat she means by that is you take an instant ramen package, but instead of having it just like that you add seawaed, an egg, legumes etc. Suddenly it becomes a more filling ans nutritious meal \n\nFor me (with my binge) it looks like having bread instead of rice cracker for your Peanut butter sandwich (and realising bread can be good for your body) ----- i choosed rive cracker because it had less calories than bread so it was a formé of cutting/restricting \n\nIf you restrict, chances are youre gonna developp nutriments deficiences ans your body will crave the nutriments in that food (it sounds silly hahahaha) ------ For me : after my rice cracker peanut butter, i was often binging on muffins, croissants, baked goods and BREAD like a whole loaf) \n\nHope it helped you :)🩷",
      "created_utc": 1688729324.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jqsk6ic",
      "author": "Excellent-World-476",
      "body": "Are you eating enough during the day?  If not it will lead to binging on the evening.",
      "created_utc": 1688584122.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqstsvn",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1688587889.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jqvcfgn",
      "author": "Horror-Process-5958",
      "body": "When I was in therapy for this one of the main points is not to restrict in terms of skipping meals or eating with a goal to lose weight. Much research suggest that this is one of the main culprits leading to binging. It actually works very well even though it seems like an “easy” step.",
      "created_utc": 1688637346.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqvppr5",
      "author": "Beaew",
      "body": "You're misinterpreting the sentence, it means do not starve yourself in order to try and lose weight, eat the right amount of food for you!",
      "created_utc": 1688646004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqudwuu",
      "author": "Fitkratomgirl",
      "body": "any specific episodes you recommend? I just looked them up! I'm always on the lookout for new podcasts :)",
      "created_utc": 1688612890.0,
      "score": 2,
      "context": [
        {
          "id": "jqsn3tz",
          "author": "Queenofwands1212",
          "body": "Yes it’s a total mind Fuck. Go listen to the fitness and sushi podcast… they talk all about this. And it’s been really helpful in my recovery. They have tons of episodes about binging and permission based eating and emotional eating etc",
          "created_utc": 1688585267.0
        }
      ]
    },
    {
      "id": "jquhv4o",
      "author": "None",
      "body": "I appreciate your point. \n\nFor me, the idea of a frozen dinner, a sandwich with chips or fast food isn't even part of the equation for me, for where I'm at.\n\nI can only manage small portions, which I try to do every 2-3 hours, depending, and I do my best to include 2-3 food groups per snack/meal. \n\nFor context, I get up around 6-6:30, but don't eat for the first time until around 10. I will have an energy drink (NOT Redbull or the like... we have a few here that taste just like Bubly, not sweet and sugary) within the first hour I'm up to help kickstart my ADHD meds. I don't drink coffee. \n\nFood wise, an example of a day where I actually *just* eat, and don't have a binge/purge episode:\n\n\"Breakfast\", which I have pretty down, is 1/3 cup granola, 1/3 cup protein yogurt, and a big handful of berries, with a tbsp ground chia and sometimes some hemp hearts.\n\nNext will be an apple with an ounce of sliced cheese, and maybe a small handful of almonds or cashews if I think of it.\n\n\"Lunch\" might be 2-3 oz chicken or tofu, with 1/4 cup crispy quinoa and a tbsp or two of dip (hummus, creamy parmesan dip, sweet chili, etc). The crispy tofu is just cooked quinoa, cooled, tossed with salt and a tiny bit of oil, then baked off in the oven until crispy. I'm obsessed with it, and I'm generally carb-averse, so it's a good way for me to get in some carbs without realizing it. \n\nNext, about a cup or more of sliced red pepper and snap peas with parmesan dip and some crispy quinoa mixed into it (I'm a texture eater). \n\nMaybe a popsicle somewhere in there to satisfy my sugar craving. \n\nNext, a repeat of the chicken/tofu- quinoa - dip.\n\nLastly, around 7, a piece of fruit (currently peaches, otherwise an apple, which I share with my dog). \n\nI feel on the brink of full basically all day, super uncomfortable, when in reality I'm not actually eating enough in terms of calories, but I've had an ED for more than half my life, so my gut hangs onto food like it's never going to be fed again, and also, has no damn clue how to digest anything. It just SITS THERE.  \n\nIt's SO HARD not to purge. Honestly, I think it's actually the biggest barrier/challenge to recovery, because we're basically trying to force ourselves to do the absolute opposite of what we are ingrained to do. \n\nFWIW, my dietician (who is an ED specialist) has said to me that if I can eat what I think I can handle, even if it's not enough, if it stops me from binging and purging, then to do it. And that I will eventually be able to increase my intake, but to do the best I can at this point in time, as long as it keeps me from B/P. I think she's got a good approach, to be honest. \n\n(For clarity, I'm not dangerously underweight. So take that as you will - it's not for everyone).",
      "created_utc": 1688615008.0,
      "score": 2,
      "context": [
        {
          "id": "jqsn3mq",
          "author": "Ladybarometer",
          "body": "I guess that can be confusing. By not restricting it's more about not skipping meals or not fasting all day for one big binge. It's about not allowing yourself to get overly hungry and eating regular meals throughout the day. \n\nOne thing that helps me when I'm struggling is eating meals that have clear portion control. Canned soups, frozen dinners, sandwich with an individual bag of chips, a baked potato with a frozen broccoli and cheese packet, or even a fast food meal. I have to not pay much attention to the calories, but regardless my weight stops fluctuating as much just due to not binging since purging only gets rid of about half of the calories you consume even when you do it immediately. \n\nI do 3 meals a day when I'm having to get back into the groove of things. Maybe doing that and having the routine of eating regular portions would help?",
          "created_utc": 1688585264.0
        }
      ]
    },
    {
      "id": "jqvcxtq",
      "author": "Horror-Process-5958",
      "body": "It’s hard, the ability to understand what a “normal” portion size has become completely fked.",
      "created_utc": 1688637749.0,
      "score": 3,
      "context": [
        {
          "id": "jqsxr9r",
          "author": "Pinkflavelon",
          "body": "I feel this. I don't know how to stop binging without restricting",
          "created_utc": 1688589427.0
        }
      ]
    },
    {
      "id": "jquippt",
      "author": "None",
      "body": "Agree with this - I should have read through all the comments before I replied, but I basically said the same thing in my response. \n\nI physically can't eat a \"proper\" meal without being triggered to continue into a binge, so right now I'm managing by eating small portions, more frequently. While I'm still probably not getting all the calories I need, it's enough to keep me satiated to the point that I don't binge, and as long as I keep it up (I still feel full ALL day), I should be able to increase my intake at some point. \n\n\"Just stop restricting\" without giving any further guidance isn't helpful at all, I agree. That's not a solution.",
      "created_utc": 1688615481.0,
      "score": 2,
      "context": [
        {
          "id": "jqtsm68",
          "author": "honeycakies",
          "body": "Are you able to see a dietician to discuss a meal plan or any similar form of structure to your eating? Might be ~controversial but I personally didn’t find “just stop restricting” to be enough in my own case, and I definitely engage in behaviors less when I have a (healthy) layout for my day",
          "created_utc": 1688602546.0
        }
      ]
    },
    {
      "id": "jr34wk6",
      "author": "AdCharming4503",
      "body": "i do not have adhd lmao are you trying to reply to someone else? thanks for the help though",
      "created_utc": 1688771168.0,
      "score": 1,
      "context": [
        {
          "id": "jr0ehc5",
          "author": "lovejoji",
          "body": "I think you said you have ADHD. I have it too and would recommand a nutritionnist who i watch her videos on YouTube. She propose recipes that are ADHD friendly and gave me a good advice on term of navigating not restricting and BINGE / bulimia \n\nBasically it's about adding on not cutting out \n\nWhat she means by that is you take an instant ramen package, but instead of having it just like that you add seawaed, an egg, legumes etc. Suddenly it becomes a more filling ans nutritious meal \n\nFor me (with my binge) it looks like having bread instead of rice cracker for your Peanut butter sandwich (and realising bread can be good for your body) ----- i choosed rive cracker because it had less calories than bread so it was a formé of cutting/restricting \n\nIf you restrict, chances are youre gonna developp nutriments deficiences ans your body will crave the nutriments in that food (it sounds silly hahahaha) ------ For me : after my rice cracker peanut butter, i was often binging on muffins, croissants, baked goods and BREAD like a whole loaf) \n\nHope it helped you :)🩷",
          "created_utc": 1688729324.0
        }
      ]
    },
    {
      "id": "jqwkz1t",
      "author": "ApprehensiveWatch303",
      "body": "whole alive support prick society cooing shelter work icky depend\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1688659506.0,
      "score": 1,
      "context": [
        {
          "id": "jqstsvn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1688587889.0
        }
      ]
    },
    {
      "id": "jqufht0",
      "author": "Queenofwands1212",
      "body": "Just search the key works of the topics I mentioned in my comment . Permission based eating, binge eating, emotional eating. Etc.",
      "created_utc": 1688613717.0,
      "score": 2,
      "context": [
        {
          "id": "jqsn3tz",
          "author": "Queenofwands1212",
          "body": "Yes it’s a total mind Fuck. Go listen to the fitness and sushi podcast… they talk all about this. And it’s been really helpful in my recovery. They have tons of episodes about binging and permission based eating and emotional eating etc",
          "created_utc": 1688585267.0
        },
        {
          "id": "jqudwuu",
          "author": "Fitkratomgirl",
          "body": "any specific episodes you recommend? I just looked them up! I'm always on the lookout for new podcasts :)",
          "created_utc": 1688612890.0
        }
      ]
    }
  ]
}