{
  "id": "14t2s40",
  "subreddit": "bulimia",
  "author": "Active-Accident3451",
  "created_utc": 1688724042.0,
  "title": "I ate raw chicken to give myself food poisoning",
  "selftext": "This is the lowest I have ever been. 2-3 weeks b/p and I’ve gained back 5 out of the 8kgs I lost, I haven’t b/p this past week with the expectation of P a little if I feel too full but no binging which is win. \n\nLast Sunday, instead of going to the grocery store to buy binge food like I have the past 2 sundays, I bought raw chicken. And I ate it. I ate it because I wanted to get food poisoning. I was praying I would get super sick and get skinny again. I didn’t get sick somehow however I feel like mentally that was completely fkd and I do not think is normal.\n\nI went to drs after having a breakdown this morning and was given a referral to phsycologist for depression & eating disorder, I really want to be normal",
  "url": "https://www.reddit.com/r/bulimia/comments/14t2s40/i_ate_raw_chicken_to_give_myself_food_poisoning/",
  "score": 84,
  "num_comments": 8,
  "comments": [
    {
      "id": "jr1042p",
      "author": "Ladybarometer",
      "body": "I'm glad you're getting some help!   \nReaching out is a win all by itself :)",
      "created_utc": 1688740007.0,
      "score": 35,
      "context": []
    },
    {
      "id": "jr11v2d",
      "author": "None",
      "body": "I was thinking of doing that yesterday but was too scared a lot of people in edanonymous said they tried it and regretted it so yeah just make sure you’re physically okay too",
      "created_utc": 1688740754.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jr11rem",
      "author": "Vickycff_1",
      "body": "I'm so sorry for all you're going through right now, it's so fucked up the type of things the ED makes us do, i hope you see this as a sign to start recovery, you deserve it, being skinny is never gonna satisfied you, it's just covering another pain, but instead making it worse, i've lost so many weight as well, but it doesn't mean nothing when you had to destroyed yourself for it, and even then still want to keep changing it.. i don't have the balls to see a doctor yet but believe me, you chose the right call, hope you have a good day, keep fighting!!",
      "created_utc": 1688740712.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jr1dwp6",
      "author": "None",
      "body": "I'm so sorry you're going through this :( This disorder just sucks and the things it makes you do is something I wouldn't wish on anyone. I've also done some seriously messed up things in the name of purging. I'm so glad you are getting help, I hope you get the support you need.",
      "created_utc": 1688745565.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jr3cedi",
      "author": "kichounay",
      "body": "This is really really terrible. I am so sorry that you are feeling so so poorly as to do something like that to yourself. You did not deserve it. And you can lose weight without getting food poisoning...like...I mean, you know what I mean.\n\nAnyway, my own dumb comments aside, I am really glad that you did not contract something deadly.\n\nRaw meat can contain deadly pathogens; microscopic germs that can k![[ you, or, do enough damage to do so before you can get to the hospital in time. Permanent damage can also be done to the brain while you remain alive to carry out the rest of your days (ultimately making them worse.)\n\nThis was not a regular BP, this was a su!c!d€ mission. One that you did not deserve. One that you thankfully survived.\n\nI am a [mostly] recovered survivor of a severe 10-year ED...\n\nAll I can say is that it is not worth it.\nAnd whoever has hurt you, deserves the pain that you are inflicting upon yourself. Not you.",
      "created_utc": 1688774613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jr4fsr5",
      "author": "None",
      "body": "I do that too i search up “top foods that give u food poisoning” and ate all of them but it didnt work why does the universe want me to be fat",
      "created_utc": 1688796476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jr2p0lq",
      "author": "Weekly-Following-739",
      "body": "I was in that state too. I was eating raw eggs plus my bad liver just to try and get sick so I can ,,justify’’ my behaviour. I hope you don’t give up on trying to reach for help and get better! There is hope! Sending love ❤️",
      "created_utc": 1688764284.0,
      "score": 1,
      "context": []
    }
  ]
}