{
  "id": "15qhalt",
  "subreddit": "bulimia",
  "author": "5star-my-notebook",
  "created_utc": 1691978845.0,
  "title": "I thought I was just being a baby but I actually had critically low potassium",
  "selftext": "I was exhausted and my joints ached 24/7, getting tingling/tightness in my chest, and getting out of breath super easily. I kept dismissing it, but I worked a 10 hour shift on the 8th (Tuesday) and physically couldn’t function afterwards. I set up a doctor’s appointment last month but it was still over a week away, so I called the nurse line on my insurance card on Friday (the 11th) to see if they’d recommend going to urgent care. When the nurse asked me about my symptoms, she told me to go to the emergency room right away. Turns out my potassium was 0.1 above hospital admission level. They had me get IV fluids/potassium and let me go home on the condition that I’d do follow up labs on Monday. \n\nI feel amazing compared to how I felt before the IV. I didn’t even think it was possible anymore to not feel wiped out and in pain constantly. I’m still bingeing and purging every day, but trying to reduce it. I feel so guilty for not stopping but it just doesn’t feel possible right now.",
  "url": "https://www.reddit.com/r/bulimia/comments/15qhalt/i_thought_i_was_just_being_a_baby_but_i_actually/",
  "score": 79,
  "num_comments": 16,
  "comments": [
    {
      "id": "jw3bagx",
      "author": "Illustrious_Diver581",
      "body": "Currently in the hospital for this very problem. First drinking gatorade, or other drinks will not help. I know this from countless doctors and nurses. Ask your doctor for potassium tablets. I take them every single day and I still end up in the hospital at least once a month. Please ask your doctor to do routine blood checks.this is the only way to make sure you don’t die. I can’t stop either. Not even while in the hospital. I’m just more sneaky. Be safe. Good luck",
      "created_utc": 1691982448.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jw39rr7",
      "author": "ADFF2F",
      "body": "I'm really sorry that that happened to you and I'm glad you got help before it got even worse.\n\nIf you do end up going to the doctor can you ask them to give you a script for potassium effervescent tablets or something similar? Either that or drinking something like powerade/gatorade after purging might help to prevent it happening again. It also helps with the unquenchable port-purge thirst. Sorry if you know all of this already.\n\nI feel you on not being able to stop (me neither) and I wish I had some magic words of advice for that, but all I can do is wish you the best of luck with this absolutely shitty illness.",
      "created_utc": 1691981690.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jw3r36v",
      "author": "Illustrious_Diver581",
      "body": "I’ve tried so many times to stop but every time I start out great then I panic and can’t help myself and I hear that voice say you can start tomorrow. This has been going on every day for years. I always start with the best intentions but it never ends that way. Then the guilt hits. And it starts all over again",
      "created_utc": 1691991550.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jw4bf2s",
      "author": "eclaireg",
      "body": "Been there!!! I’m so glad you went to the ER and your doctor and got checked out. So many of us are guilty of ignoring all of these warning signs because we function on denial, amirite? I totally understand feeling like you can’t stop, even when your body is telling you to. I think I probably b/p-ed every single day for 10+ years, and the last 3 years or so I was finally able to put some time in between binges. I would consider myself “in recovery” for the last two years- but even then, I’m not perfect, no one is. I probably slip up 3-5 times a year.\n\nThe best you can do is harm reduction- if you’re going to do it, start with only purging when you feel like it’s absolutely necessary. Take your potassium pills early in the morning (or whenever they have the longest chance of staying in your system) so they actually get digested before a B/P event. Drink electrolytes afterwards and take a multivitamin everyday. Harm reduction focuses on lessening the negative impacts of a behavior, while still understanding that we are all human and not all behaviors can be instantaneously stopped.\n\nSome other things that helped me: Try breaking the cycle of binging by forcing yourself to go for a walk before allowing yourself to binge. If you get back home and still want to b/p after taking a walk, then you can do so, but most of the time taking that time to think about it beforehand will make you realize it isn’t worth it. I hated going outside for a walk, but I hated the thought of mindlessly over consuming food just to throw it up again so that was really the only thing that got me out the door. One of my biggest problems was when it was bedtime/late in the evening after dinner and I got the munchies, one snack would turn into more snacks which turned into a “fuck it all” binge and purge sesh, and I had to completely cut myself off from eating after 7pm to stop that cycle. Practicing mindfulness and meditation shouldn’t be disregarded, as hokey pokey as meditation can seem at times, it’s truly helped my success and healing from bulimia.",
      "created_utc": 1692006978.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jw592p9",
      "author": "ChaiTeaLatteBitch",
      "body": "Just got out of the hospital due to this. Was on a week clean streak and then b/p’d for basically 24 hrs. $400 of takeout food later, I was in the hospital due to extremely low potassium and salt levels. \n\n2 IV bags later, I’m now at home, missing a week off of work, swollen af. If this wasn’t a wake up call I don’t know what is.",
      "created_utc": 1692024220.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jw42xb5",
      "author": "None",
      "body": "So glad you're okay friendo ♡ - charlie",
      "created_utc": 1692000390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jw66uwd",
      "author": "derederellama",
      "body": "been there! anemia kicked the living shit outta me until i realized and started taking iron lol",
      "created_utc": 1692036543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jwasjbd",
      "author": "rixxy249",
      "body": "every time i get symptoms that vaguely resemble a deficiency in some vitamin or mineral, i try to add that to my vitamin regimen. try to take them right before bed, too, so you can for sure keep them down for more than an hour to let them absorb",
      "created_utc": 1692114558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0ts7kv",
      "author": "sunsetsandbouquets",
      "body": "Yes I ended up in hospital for this very reason. I also had a seizure in hospital and bit so hard my tongue bled. \nIt was terrifying. Low potassium is extremely dangerous. Hope you’re ok OP. Sending hugs",
      "created_utc": 1694866134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jw3lrhk",
      "author": "5star-my-notebook",
      "body": "I’m so sorry you’re struggling so much. I just got my 2 week prescription for potassium pills today and I’m hoping they’ll help with the blood test I have to take on Monday. I hope you get out of the hospital soon and that you’ll be able to at least take a couple more steps towards harm reduction so you’re not stuck in such shitty situations all the time. And yeah, Gatorade is a scam. The only thing it does is boost blood sugar and sodium, and it has about as much sodium as a small pickle :/\n\nEdit: I also purged while at the ER. I was getting really lightheaded so I ate a couple snacks from the hospital vending machine but then I panicked and purged them about an hour later. You’re not alone. Sending hugs 🫂❤️\nWe’ll get through this",
      "created_utc": 1691988156.0,
      "score": 9,
      "context": [
        {
          "id": "jw3bagx",
          "author": "Illustrious_Diver581",
          "body": "Currently in the hospital for this very problem. First drinking gatorade, or other drinks will not help. I know this from countless doctors and nurses. Ask your doctor for potassium tablets. I take them every single day and I still end up in the hospital at least once a month. Please ask your doctor to do routine blood checks.this is the only way to make sure you don’t die. I can’t stop either. Not even while in the hospital. I’m just more sneaky. Be safe. Good luck",
          "created_utc": 1691982448.0
        }
      ]
    },
    {
      "id": "jw5ngio",
      "author": "triciani23",
      "body": "Purging while in the hospital getting electrolytes was also a low for me. 😔",
      "created_utc": 1692029596.0,
      "score": 4,
      "context": [
        {
          "id": "jw3bagx",
          "author": "Illustrious_Diver581",
          "body": "Currently in the hospital for this very problem. First drinking gatorade, or other drinks will not help. I know this from countless doctors and nurses. Ask your doctor for potassium tablets. I take them every single day and I still end up in the hospital at least once a month. Please ask your doctor to do routine blood checks.this is the only way to make sure you don’t die. I can’t stop either. Not even while in the hospital. I’m just more sneaky. Be safe. Good luck",
          "created_utc": 1691982448.0
        }
      ]
    },
    {
      "id": "jw3luxq",
      "author": "5star-my-notebook",
      "body": "Thank you for your kind response. I’m fortunate to have a 2 week prescription for potassium pills now so I’m hoping they’ll help ❤️",
      "created_utc": 1691988213.0,
      "score": 1,
      "context": [
        {
          "id": "jw39rr7",
          "author": "ADFF2F",
          "body": "I'm really sorry that that happened to you and I'm glad you got help before it got even worse.\n\nIf you do end up going to the doctor can you ask them to give you a script for potassium effervescent tablets or something similar? Either that or drinking something like powerade/gatorade after purging might help to prevent it happening again. It also helps with the unquenchable port-purge thirst. Sorry if you know all of this already.\n\nI feel you on not being able to stop (me neither) and I wish I had some magic words of advice for that, but all I can do is wish you the best of luck with this absolutely shitty illness.",
          "created_utc": 1691981690.0
        }
      ]
    },
    {
      "id": "jw3v6hw",
      "author": "5star-my-notebook",
      "body": "You don’t have to wait for a new day to begin to try again. You can decide any time of the day to fight the urge to b/p. Obviously it’s way easier said than done but you have to challenge the all or nothing mentality in order to survive, because getting better is so much of a gray area full of baby steps. I was b/ping 3-5 times a day before, so now I’m doing 2-3. Would 0 be ideal? Of course. But I can’t reasonably do that right now. This is hard but doable. Eventually maybe I’ll get to once a day, and then maybe I’ll go a day without it for the first time in years. I hope something I said here was helpful, and that I didn’t sound preachy or anything. I relate so hard to the vicious cycle of “I’ll start tomorrow” and to all the guilt and fear that comes with it. Stay safe, friend ❤️",
      "created_utc": 1691994435.0,
      "score": 7,
      "context": [
        {
          "id": "jw3r36v",
          "author": "Illustrious_Diver581",
          "body": "I’ve tried so many times to stop but every time I start out great then I panic and can’t help myself and I hear that voice say you can start tomorrow. This has been going on every day for years. I always start with the best intentions but it never ends that way. Then the guilt hits. And it starts all over again",
          "created_utc": 1691991550.0
        }
      ]
    },
    {
      "id": "jw87qts",
      "author": "KirbyButAnxious",
      "body": "Sending love 💕 very similar story happened to me. It was helpful to try and remind myself I never want to get back to that point again",
      "created_utc": 1692064312.0,
      "score": 2,
      "context": [
        {
          "id": "jw592p9",
          "author": "ChaiTeaLatteBitch",
          "body": "Just got out of the hospital due to this. Was on a week clean streak and then b/p’d for basically 24 hrs. $400 of takeout food later, I was in the hospital due to extremely low potassium and salt levels. \n\n2 IV bags later, I’m now at home, missing a week off of work, swollen af. If this wasn’t a wake up call I don’t know what is.",
          "created_utc": 1692024220.0
        }
      ]
    },
    {
      "id": "jwat2y8",
      "author": "rixxy249",
      "body": "i take magnesium, potassium, and iron supplements any time i feel like i need them, and generally after 3 days my symptoms recede. i also take Olly chewy multivitamins",
      "created_utc": 1692114752.0,
      "score": 1,
      "context": [
        {
          "id": "jwasjbd",
          "author": "rixxy249",
          "body": "every time i get symptoms that vaguely resemble a deficiency in some vitamin or mineral, i try to add that to my vitamin regimen. try to take them right before bed, too, so you can for sure keep them down for more than an hour to let them absorb",
          "created_utc": 1692114558.0
        }
      ]
    },
    {
      "id": "k0tsl8z",
      "author": "sunsetsandbouquets",
      "body": "I relate to you so much. I had a seizure whilst in hospital from bulimia complications. \n\nIt was terrifying. The vending machine was right near where my bed was it as a total nightmare. \nHope life is being kinder to you.",
      "created_utc": 1694866344.0,
      "score": 1,
      "context": [
        {
          "id": "jw3bagx",
          "author": "Illustrious_Diver581",
          "body": "Currently in the hospital for this very problem. First drinking gatorade, or other drinks will not help. I know this from countless doctors and nurses. Ask your doctor for potassium tablets. I take them every single day and I still end up in the hospital at least once a month. Please ask your doctor to do routine blood checks.this is the only way to make sure you don’t die. I can’t stop either. Not even while in the hospital. I’m just more sneaky. Be safe. Good luck",
          "created_utc": 1691982448.0
        },
        {
          "id": "jw3lrhk",
          "author": "5star-my-notebook",
          "body": "I’m so sorry you’re struggling so much. I just got my 2 week prescription for potassium pills today and I’m hoping they’ll help with the blood test I have to take on Monday. I hope you get out of the hospital soon and that you’ll be able to at least take a couple more steps towards harm reduction so you’re not stuck in such shitty situations all the time. And yeah, Gatorade is a scam. The only thing it does is boost blood sugar and sodium, and it has about as much sodium as a small pickle :/\n\nEdit: I also purged while at the ER. I was getting really lightheaded so I ate a couple snacks from the hospital vending machine but then I panicked and purged them about an hour later. You’re not alone. Sending hugs 🫂❤️\nWe’ll get through this",
          "created_utc": 1691988156.0
        }
      ]
    }
  ]
}