{
  "id": "15w6cxh",
  "subreddit": "bulimia",
  "author": "Juicystar77",
  "created_utc": 1692522021.0,
  "title": "Feel like an addict",
  "selftext": "Anybody else feel like they are completely obsessed with bingeing and purging ? I hate it when people are at home. I resent my boyfriend being here because I can’t do it when he’s off work. I get angry when things get in the way. I am never happier than when I know I have hours and hours alone . If anybody ruins that , I get so upset inside.  When my parents went in holidays, I used my key to their house to go and do my thing alone . If I hear my boyfriend say he is going to football for the day in a few days …. I tell myself to hang in there until that day and then as soon as he leaves , I start eating or set off to buy the tons of things I want to eat. I get so so annoyed if he’s home because he’s in the way of my eating .  I feel like an addict . If I go shopping for binge foods , my feet can’t carry me home fast enough . I literally am in the worst phase with it right now.  I’d anybody else like this ? I feel so greedy :(",
  "url": "https://www.reddit.com/r/bulimia/comments/15w6cxh/feel_like_an_addict/",
  "score": 114,
  "num_comments": 29,
  "comments": [
    {
      "id": "jwz59hl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1692522403.0,
      "score": 27,
      "context": []
    },
    {
      "id": "jx081ji",
      "author": "None",
      "body": "EDs are addictions, we are all addicts here",
      "created_utc": 1692544516.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jx0ro6o",
      "author": "None",
      "body": "Omg I used to resent my bf sooo much when he would stay up late, and be furious if he'd wake up in the middle of the night and sit next to me in the couch (no doubt my binge foods were hastily covered w a blanket)! God i remember the rage I used to feel toward him so vividly!!! \nI know exactly how you feel but all I can say is beating the hell out if yourself absolutely doesn't help. We've all done it for years so if it helped we would have noticed by now!\nYour brain is glitching and sending you bad signals and that's not your fault!!! Be gentle and kind w yourself like you would to anyone you loved who told you they were suffering!!!",
      "created_utc": 1692552277.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx0ypw4",
      "author": "Nebion666",
      "body": "We are addicts honestly. My dad let one of his friends whom due to unforeseen circumstances was about to be homeless come live in our home. He lives in the basement and as much as its shitty to say i kinda resent him because it makes it alot harder for me to purge cause i would always go downstairs but now i cant and i have to be really careful moreso.",
      "created_utc": 1692554972.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jx14yck",
      "author": "Realistic-Shallot288",
      "body": "I’m feeling this 100% every single day… I’m married since 16 years and have 3 kids…",
      "created_utc": 1692557404.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx3pgts",
      "author": "burntbroccoliass",
      "body": "Yes. I’ve quit fentanyl, cocaine, and cigarettes all cold turkey but I can’t quit this. I’m almost 19 years in and I have a feeling I won’t ever escape it. Nothing compares to the feeling and I hate that. When I’m stressed, all I want is to purge. My entire life revolves around it.",
      "created_utc": 1692602444.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx247f0",
      "author": "Crimson-Rose28",
      "body": "I feel this. I feel addicted too, and I love it when I’m home alone so I can b/p in peace. I do it when my husband is home too but I have to be really sneaky and it’s terrible.",
      "created_utc": 1692571680.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx2dceh",
      "author": "getitt0gether",
      "body": "It’s absolutely an addiction. I’m so sorry you are going through this. Ironically enough, I was a full blown bulimic (b/p multiple times a day) when I was working as an addiction counsellor. \n\nI learned so much about my ED while working with people with substance use disorders. The similarities are nuts. Personally, I feel there’s more societal shame with bulimia than a SUD. And it’s impossible to go abstinent from food. Sending hugs.",
      "created_utc": 1692575728.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx3oauc",
      "author": "Juicystar77",
      "body": "I cannot tell you all how much comfort your responses have brought me. It sounds crazy but I felt like the only only person on the planet with bulimia. The level of sneaking about and WANTING to do it , it just makes me feel so isolated and to know there are so many people doing exactly what I do - it actually does make me feel a bit better.  Honestly, I just woke up and the first thing on my mind is food and where I’m going to get it from seeing as I don’t have immediate access to enough food so that I can b/p.  I just got on the scales and I’m 2 pounds heavier than I was on two days ago because I’ve ended up keeping more stuff down. It’s put me in a foul mood.  My friend has just messaged me to invite me to hers for the day as she’s on maternity leave and I’ve already said no because I’d rather spend my day eating and purging . I already know what I’m going to buy and what it’s going to cost me .  Off I go again.  I have to go on holiday in two weeks with my family and I’m already thinking about how much restraint I’ll have to show on that 7 day trip because repeated trips to the bath room are difficult when everyone there knows you ‘used to’ be bulimic . My family aren’t the brightest and they think I don’t do it anymore. I’m slim but not bony - so they wrongly assume I’m okay with food. I’m\nAlso a bridesmaid just before the holiday and I’m dreading that too.  What amazes me , is if I’m dressed up nice , or out on the town for the day with friends , the restraint I can show about food and eating is like nothin you’ve ever seen . I will be the only one not ordering food . When there’s a function and there’s a buffet , I don’t even approach it or show any interest in it.  I know though , that if I were on my own with all of that buffet food , I would eat all of it and purge all of it until there was nothing left. To think this all started with my mum calling me fat and greedy age 17 and now I’m 46 and food will never just be a normal thing to me.  And all day now , I’ll obsess about this extra 2 pounds and how I need it gone FAST . :(",
      "created_utc": 1692601530.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jx2r0op",
      "author": "turnipkitty112",
      "body": "I can absolutely totally relate. I also hate when others are home, I avoid going out or socializing bc I’d rather b/p, i actively try to get the place to myself so I can b/p. I spend every second of every day either b/ping, preparing to b/p (buying and making food), cleaning up, or thinking about how I’m going to later. I can’t go a day without doing it. It’s the only thing that brings me comfort anymore. I’ve lied and stolen and just in general been a terrible person bc of how much I want (or think I want, anyways) to do this. It really does feel like an addiction. The habit is so ingrained at this point. You don’t need to feel like you are greedy or bad though (although I can understand why you feel that way as I often do too), at the end of the day it is a severe mental illness and not a character flaw or a choice. I’m so sorry you’re going through this too 🖤",
      "created_utc": 1692581935.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jx3kius",
      "author": "None",
      "body": "At separate times I’ve been severely bulimic and moderately to addicted to opioids  (if that exists- not on the street yet level addiction but pretty close). \nBulimia was hands down the harder of the two to get clean from.",
      "created_utc": 1692598656.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jx5zhf4",
      "author": "Queen_Franzia",
      "body": "I don’t consider our favorite coping mechanism to be an addiction. \n\n…but I get it. The ruminating, the solitude, the ritual of it all. Something that helps me feel better in most situations. \n\nAlso, know that you’re not alone with the hair loss either. I’ve been shaving my head for the past decade. \n\nI wanna give you a hug.",
      "created_utc": 1692642766.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jx0l7zx",
      "author": "NyanNyanKawaii",
      "body": "I'm the exact same",
      "created_utc": 1692549768.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jx7v77u",
      "author": "Outrageous-Ad-1042",
      "body": "you just described what I’m feeling/going through right now perfectly.",
      "created_utc": 1692669631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jwzqxf7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1692536812.0,
      "score": -12,
      "context": []
    },
    {
      "id": "jwz5vev",
      "author": "Juicystar77",
      "body": "I’m 30 years into this now 🙈 started when I was 17 and seen the odd therapist over the years . It started with anorexia and massive weight loss …. Then I was a very skinny bulimic for years , then just slim as I am now. I’m sure I’d be very thin we’re it not fit the fact that my hair loss is so bad that I have to wear wigs. I’m currently on the waiting list for more therapy via eating disorders service but I feel like after 30 years , I can’t ever fully stop.  It’s so draining . The hiding it alone , the sneaking and plotting and plus the money I waste … then the actual physical act of doing it - I’m just consumed.  I’m ashamed to say I fantasise about booking a hotel room in the city centre where all my favourite foods are …so I could take food to the room and eat all weekend . How on earth did I get here 🙈 xx",
      "created_utc": 1692522884.0,
      "score": 12,
      "context": [
        {
          "id": "jwz59hl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1692522403.0
        }
      ]
    },
    {
      "id": "jx2dq7g",
      "author": "getitt0gether",
      "body": "I should add that part of what is addicting about it is the “release” following a purge. Feels like a big exhale. The whole cycle of prepping/buying food, eating (dopamine rush) and purging is addictive.",
      "created_utc": 1692575899.0,
      "score": 5,
      "context": [
        {
          "id": "jx2dceh",
          "author": "getitt0gether",
          "body": "It’s absolutely an addiction. I’m so sorry you are going through this. Ironically enough, I was a full blown bulimic (b/p multiple times a day) when I was working as an addiction counsellor. \n\nI learned so much about my ED while working with people with substance use disorders. The similarities are nuts. Personally, I feel there’s more societal shame with bulimia than a SUD. And it’s impossible to go abstinent from food. Sending hugs.",
          "created_utc": 1692575728.0
        }
      ]
    },
    {
      "id": "jx4c1mt",
      "author": "Juicystar77",
      "body": "It’s horrid isn’t it. I’m a very image conscious person and am very keen on appearing with my best food forward to the rest of the world …yet in private , I’ve eaten out of bins and sold things that mean a lot to me to get money to buy food.  It’s unfortunate that we have ended up with this affliction….. food is everywhere. Would you believe I’m currently sat on a bus with food to take back to my house to do it all again . Why ?! Why ?! 🙈",
      "created_utc": 1692618886.0,
      "score": 1,
      "context": [
        {
          "id": "jx2r0op",
          "author": "turnipkitty112",
          "body": "I can absolutely totally relate. I also hate when others are home, I avoid going out or socializing bc I’d rather b/p, i actively try to get the place to myself so I can b/p. I spend every second of every day either b/ping, preparing to b/p (buying and making food), cleaning up, or thinking about how I’m going to later. I can’t go a day without doing it. It’s the only thing that brings me comfort anymore. I’ve lied and stolen and just in general been a terrible person bc of how much I want (or think I want, anyways) to do this. It really does feel like an addiction. The habit is so ingrained at this point. You don’t need to feel like you are greedy or bad though (although I can understand why you feel that way as I often do too), at the end of the day it is a severe mental illness and not a character flaw or a choice. I’m so sorry you’re going through this too 🖤",
          "created_utc": 1692581935.0
        }
      ]
    },
    {
      "id": "jxb8w3p",
      "author": "Juicystar77",
      "body": "How kind of you ❤️ I hope you’re okay.  It’s so nice that we can support one another on here. I have told you guys things I’ve never told anybody . Thank you for letting me know I’m not alone xxx",
      "created_utc": 1692731975.0,
      "score": 2,
      "context": [
        {
          "id": "jx5zhf4",
          "author": "Queen_Franzia",
          "body": "I don’t consider our favorite coping mechanism to be an addiction. \n\n…but I get it. The ruminating, the solitude, the ritual of it all. Something that helps me feel better in most situations. \n\nAlso, know that you’re not alone with the hair loss either. I’ve been shaving my head for the past decade. \n\nI wanna give you a hug.",
          "created_utc": 1692642766.0
        }
      ]
    },
    {
      "id": "jxb8fqc",
      "author": "Juicystar77",
      "body": "It’s awful isn’t it. I’m so upset with myself today . I’ve spent about £60 on food. Can you imagine what I’ve spent over 30 years. I can’t seem to snap out of this. 🥺x",
      "created_utc": 1692731805.0,
      "score": 1,
      "context": [
        {
          "id": "jx7v77u",
          "author": "Outrageous-Ad-1042",
          "body": "you just described what I’m feeling/going through right now perfectly.",
          "created_utc": 1692669631.0
        }
      ]
    },
    {
      "id": "jx0skfr",
      "author": "Juicystar77",
      "body": "Oh trust me ! I can purge but it’s stressful if he’s here. What I want is ultimate privacy to eat as much as I want , which is usually enough to feed 6 men !!! We go on vacation and the level of stress I go thru every time I eat out is immense. There is a massive difference between bingeing and purging when people are there , to the level I can go to when I’m alone . After 30 years of being bulimic, I can rid myself of what I eat easily around anybody . But the way I feel when I can eat WHATEVER I want for AS LONG as I want …. It’s different.  Privacy to eat mountains is not the same as eating and purging when I’m not alone . The shame , the conniving…… that is not an issue when nobody is there to witness what I REALLY want to eat .  You need privacy to fully binge . I’m sure you get what I mean here  ??",
      "created_utc": 1692552623.0,
      "score": 8,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        }
      ]
    },
    {
      "id": "jx5w737",
      "author": "CarpetDisastrous1963",
      "body": "Take your kinks elsewhere weirdo.",
      "created_utc": 1692641572.0,
      "score": 2,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        }
      ]
    },
    {
      "id": "jx2hh5t",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1692577565.0,
      "score": 1,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        }
      ]
    },
    {
      "id": "jxj286f",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.\nEncouraging EDs.",
      "created_utc": 1692866559.0,
      "score": 1,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        }
      ]
    },
    {
      "id": "jx0ryw7",
      "author": "None",
      "body": "It's not too late, change is possible. In my 40s and finally have a great therapist and making real progress with food!",
      "created_utc": 1692552393.0,
      "score": 5,
      "context": [
        {
          "id": "jwz59hl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1692522403.0
        },
        {
          "id": "jwz5vev",
          "author": "Juicystar77",
          "body": "I’m 30 years into this now 🙈 started when I was 17 and seen the odd therapist over the years . It started with anorexia and massive weight loss …. Then I was a very skinny bulimic for years , then just slim as I am now. I’m sure I’d be very thin we’re it not fit the fact that my hair loss is so bad that I have to wear wigs. I’m currently on the waiting list for more therapy via eating disorders service but I feel like after 30 years , I can’t ever fully stop.  It’s so draining . The hiding it alone , the sneaking and plotting and plus the money I waste … then the actual physical act of doing it - I’m just consumed.  I’m ashamed to say I fantasise about booking a hotel room in the city centre where all my favourite foods are …so I could take food to the room and eat all weekend . How on earth did I get here 🙈 xx",
          "created_utc": 1692522884.0
        }
      ]
    },
    {
      "id": "jx3pkh3",
      "author": "burntbroccoliass",
      "body": "I’m sorry if this is a stupid question but do you have any health issues due to bulimia? I’m only asking because I’ve been doing this for almost 19 years and recently was diagnosed with Barrett’s Esophagus",
      "created_utc": 1692602522.0,
      "score": 3,
      "context": [
        {
          "id": "jwz59hl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1692522403.0
        },
        {
          "id": "jwz5vev",
          "author": "Juicystar77",
          "body": "I’m 30 years into this now 🙈 started when I was 17 and seen the odd therapist over the years . It started with anorexia and massive weight loss …. Then I was a very skinny bulimic for years , then just slim as I am now. I’m sure I’d be very thin we’re it not fit the fact that my hair loss is so bad that I have to wear wigs. I’m currently on the waiting list for more therapy via eating disorders service but I feel like after 30 years , I can’t ever fully stop.  It’s so draining . The hiding it alone , the sneaking and plotting and plus the money I waste … then the actual physical act of doing it - I’m just consumed.  I’m ashamed to say I fantasise about booking a hotel room in the city centre where all my favourite foods are …so I could take food to the room and eat all weekend . How on earth did I get here 🙈 xx",
          "created_utc": 1692522884.0
        }
      ]
    },
    {
      "id": "jx0swww",
      "author": "doulanation",
      "body": "Aha I see.  Yea I can understand why its stressful, even if they don't say anything.",
      "created_utc": 1692552749.0,
      "score": 0,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        },
        {
          "id": "jx0skfr",
          "author": "Juicystar77",
          "body": "Oh trust me ! I can purge but it’s stressful if he’s here. What I want is ultimate privacy to eat as much as I want , which is usually enough to feed 6 men !!! We go on vacation and the level of stress I go thru every time I eat out is immense. There is a massive difference between bingeing and purging when people are there , to the level I can go to when I’m alone . After 30 years of being bulimic, I can rid myself of what I eat easily around anybody . But the way I feel when I can eat WHATEVER I want for AS LONG as I want …. It’s different.  Privacy to eat mountains is not the same as eating and purging when I’m not alone . The shame , the conniving…… that is not an issue when nobody is there to witness what I REALLY want to eat .  You need privacy to fully binge . I’m sure you get what I mean here  ??",
          "created_utc": 1692552623.0
        }
      ]
    },
    {
      "id": "jxj273j",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.\nEncouraging EDs",
      "created_utc": 1692866533.0,
      "score": 2,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        },
        {
          "id": "jx2hh5t",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692577565.0
        }
      ]
    },
    {
      "id": "jx59j8a",
      "author": "bulimia-ModTeam",
      "body": "This can be:\n\n- telling someone not to gain weight \n- telling someone not to go for recovery \n- giving bad advice \n- discussing weight // lowest/highest…\n- discussing calories (how high // how low…)",
      "created_utc": 1692633201.0,
      "score": 1,
      "context": [
        {
          "id": "jwzqxf7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692536812.0
        },
        {
          "id": "jx2hh5t",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692577565.0
        }
      ]
    },
    {
      "id": "jx4biix",
      "author": "Juicystar77",
      "body": "Hey there … I’ve been VERY fortunate that I have not ( so far) developed any health conditions. My hair loss though has not been helped by it …… it’s like , that’s my ‘thing’ that’s gone wrong for me , like my teeth. I had a scare a while back with thyroid nodules that I thought was throat cancer and I was Petrified thinking of how I’d brought it on myself 🙈🙈. I have never put my fingers down my throat , and I’ve never ever used laxatives . I’ve always been able to bring up food at will if there’s enough there to come up , even before bulimia , I would ruminate on food a lot as a little kid ( ugh I know ) so maybe that has a link as to why my digestion isn’t off  …..  I hope you’re okay ??? Xxx",
      "created_utc": 1692618591.0,
      "score": 2,
      "context": [
        {
          "id": "jwz59hl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1692522403.0
        },
        {
          "id": "jwz5vev",
          "author": "Juicystar77",
          "body": "I’m 30 years into this now 🙈 started when I was 17 and seen the odd therapist over the years . It started with anorexia and massive weight loss …. Then I was a very skinny bulimic for years , then just slim as I am now. I’m sure I’d be very thin we’re it not fit the fact that my hair loss is so bad that I have to wear wigs. I’m currently on the waiting list for more therapy via eating disorders service but I feel like after 30 years , I can’t ever fully stop.  It’s so draining . The hiding it alone , the sneaking and plotting and plus the money I waste … then the actual physical act of doing it - I’m just consumed.  I’m ashamed to say I fantasise about booking a hotel room in the city centre where all my favourite foods are …so I could take food to the room and eat all weekend . How on earth did I get here 🙈 xx",
          "created_utc": 1692522884.0
        },
        {
          "id": "jx3pkh3",
          "author": "burntbroccoliass",
          "body": "I’m sorry if this is a stupid question but do you have any health issues due to bulimia? I’m only asking because I’ve been doing this for almost 19 years and recently was diagnosed with Barrett’s Esophagus",
          "created_utc": 1692602522.0
        }
      ]
    }
  ]
}