{
  "id": "15zy7i5",
  "subreddit": "bulimia",
  "author": "feelikedeath",
  "created_utc": 1692873297.0,
  "title": "anorexia would be better",
  "selftext": "if i was anorexic my family would take me more seriously. shit not even the fucking psychiatrists are taking me seriously. i know u technically don’t get to choose what Ed u get but i so fucking wish u could.\nbulimia doesnt even seem to make sense on paper, i mean anorexics starve themselves bc they wanna feel in control of something, they wanna feel like at least there is something they can be successful at, and these are all sentiments i feel too so why the fuck can’t i just do it too? bulimia just makes u feel a thousand times shittier.\n\ni am so tired of feeling like a fake. i am tired of looking just like everybody else, of people not being able to tell that i am sick just by looking at me. i want people to look at me and gasp. i am tired of telling myself i can start doing the things i want to do once i reach a certain weight but staying at the exact same one ive been at for years now. this is such bullshit? i dont wanna recover and i never wanted to recover and in my head “getting better” simply means becoming anorexic, being able to restrict without the b/p bullshit in the way.\n\nthe most ive ever went without bingeing was 48 days and its fucking pathetic. that was genuinely the best i was able to do. and now i just turned 18 and thats just telling me even more that i wasted so much of my time when i couldve lost all this weight and be like all those girls in the ed documentaries and movies and any other type of ed content under the sun. the ones everyone feels bad for, that everyone romanticizes, but no i am stuck with stupid fucking bulimia. bulimics dont even get the privilege to be made fun of most of the time.\n\ni have read about bulimics being able to stop bingeing and get to scarily low weights but the opposite is much more common, and honestly i cannot tell you how much that makes me feel hopeless. i actually have >!attempted suicide!< a couple of times but i was too much of a pussy to go all in (just like literally everything else i try) so i always end up asking for help.\n\nthe reason why all of this started in the first place was that i wanted to be confident. i wanted to have control and i was ready to fuck up my life to get that, because nothing matters more to me than feeling like i am not completely worthless, but my repeated failures at restriction and weight loss have only proved me right and now i fucked up my life for nothing.\n\ni am sorry if the things i have said are insensitive to anorexics or whatever. but im sure a lot of people will understand what i mean when i say that anorexia is a better eating disorder than bulimia.",
  "url": "https://www.reddit.com/r/bulimia/comments/15zy7i5/anorexia_would_be_better/",
  "score": 75,
  "num_comments": 13,
  "comments": [
    {
      "id": "jxlkbpa",
      "author": "StockReporter5",
      "body": "LITERALLY THIS I FEEL LIKE IM TREATED WORSE THAN ANOREXIA PATIENTS AND I HATE MYSELF FOR IT SO MUCH",
      "created_utc": 1692907148.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jxliq7h",
      "author": "geetonah",
      "body": "i have anorexia b/p subtype, and my experience with doctors is the opposite. my treatment focused more on getting rid of my bulimic habits even if that forced me to restrict more. my parents deadass tell me it's better if i eat >!200-400 cals!< per day and scold me if they think I'm \"eating too much\" cus they're worried I'll b/p 💀\n\nboth sucks ass but I'll agree ana is easier on my body than purging imo. acid reflux, tonsillitis, and bloating are NOT fun",
      "created_utc": 1692906560.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jxmjgae",
      "author": "Crimson-Rose28",
      "body": "Facts. 100%. I have anorexia binge/purge subtype but literally 90% of the time I’m binging and purging. I started with just anorexia and when I was severely underweight people expressed concern and took my illness seriously. As soon as I gained weight people stopped worrying and assumed I was doing good. I only gained weight from not getting all the binge food up when I purged 😒 \n\nI relate so much to everything you said. It’s the unfortunate truth about eating disorders that I feel is taboo to talk about. Another thing about bulimia is the MONEY. When I was strictly anorexic I was saving money because all I bought was oats, protein powder, almond milk and fruit. I’ve gone into DEBT from buying binge food. 🙃",
      "created_utc": 1692921080.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jxn7qvv",
      "author": "Sufficient-Ad5988",
      "body": "I had anorexia first, recovered then developed bulimia. And yes, ana was SO MUCH BETTER. People look at you and see a sickness. With bulimia you're just disgusting cause you waste food and puke all the time. Not to mention how much MONEY I saved from ana cause rarely bought groceries. I've literally binged myself into debt with bulimia. \nAnd people PRAISE you and are SUPPORTIVE of you when you manage to eat something somewhat normally. No one's ever praised me for not puking.  Sigh.",
      "created_utc": 1692931864.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jxm11gm",
      "author": "5star-my-notebook",
      "body": "I used to be anorexic. Now I’m almost the same weight I was back then, but b/ping multiple times a day. I’d trade bingeing and purging for starving in a heartbeat if I could. I feel so much worse, both physically and mentally",
      "created_utc": 1692913479.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jxjxs29",
      "author": "AdVirtual9993",
      "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
      "created_utc": 1692885242.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jxowrdi",
      "author": "fedupadult",
      "body": "i wish i was anorexic too. i still hate food i still suffer from being uw i still get all the symptoms anorexics do but being bulimic costs more. my teeth are ruined beyond repair. my stomach is fucked. my muscles are messed up from the electrolyte imbalance. shit is way harder imo:/",
      "created_utc": 1692970387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jxr3xqa",
      "author": "barahonera",
      "body": "I understand what you mean all too well. Nothing anyone could ever say could convince me otherwise. I am so so tired of feeling as heavy as I do. I disgust myself, I want to be small and hungry. It would be so much better. It would make so much more sense, but I can’t swing it for the life of me. No matter how much I try every day.",
      "created_utc": 1693000502.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jxkrddu",
      "author": "feelikedeath",
      "body": "skill issue but i edited it anyway",
      "created_utc": 1692896467.0,
      "score": 9,
      "context": [
        {
          "id": "jxjxs29",
          "author": "AdVirtual9993",
          "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
          "created_utc": 1692885242.0
        }
      ]
    },
    {
      "id": "jxko3xe",
      "author": "CarpetDisastrous1963",
      "body": "I agree I feel like it’s a huge run on",
      "created_utc": 1692895246.0,
      "score": 5,
      "context": [
        {
          "id": "jxjxs29",
          "author": "AdVirtual9993",
          "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
          "created_utc": 1692885242.0
        }
      ]
    },
    {
      "id": "jxkpw54",
      "author": "Downtown-Effect-7450",
      "body": "This isnt english class who cares and yes you can read it",
      "created_utc": 1692895918.0,
      "score": 1,
      "context": [
        {
          "id": "jxjxs29",
          "author": "AdVirtual9993",
          "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
          "created_utc": 1692885242.0
        }
      ]
    },
    {
      "id": "jxlt4hi",
      "author": "AdVirtual9993",
      "body": "Outstanding! Thank you.",
      "created_utc": 1692910445.0,
      "score": 1,
      "context": [
        {
          "id": "jxjxs29",
          "author": "AdVirtual9993",
          "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
          "created_utc": 1692885242.0
        },
        {
          "id": "jxkrddu",
          "author": "feelikedeath",
          "body": "skill issue but i edited it anyway",
          "created_utc": 1692896467.0
        }
      ]
    },
    {
      "id": "jxltjup",
      "author": "AdVirtual9993",
      "body": "Some readers care. While it may be easy for you. It may not be for others The OP did a great job editing it.",
      "created_utc": 1692910609.0,
      "score": 6,
      "context": [
        {
          "id": "jxjxs29",
          "author": "AdVirtual9993",
          "body": "Very difficult for the reader to read  without paragraph breaks. I know I can't.",
          "created_utc": 1692885242.0
        },
        {
          "id": "jxkpw54",
          "author": "Downtown-Effect-7450",
          "body": "This isnt english class who cares and yes you can read it",
          "created_utc": 1692895918.0
        }
      ]
    }
  ]
}