{
  "id": "167ushc",
  "subreddit": "bulimia",
  "author": "GrapefruitPerfect149",
  "created_utc": 1693635267.0,
  "title": "I almost died",
  "selftext": "Yesterday I bp really bad and was feeling sick, but I thought “tomorrow will be fine”. And no, I almost died. \n\nToday I woke up and still feels sick, then I went grocery shopping my with mom, I feel like my heart was giving up on me, I couldn’t breathe, my chest feels heavy, wanting to vomit(but nothing comes out), cold sweat. Then, the worst part, my whole arm and my hands became numb, I couldn’t feel a thing. Fingers on both of my hands were twisting inwards, and there’s no way controlling them. This went on and off for 30 minutes or so. \n\nThis has happened before (last year) but it wasn’t that bad, I’m not sure if it’s the dehydration or electrotype imbalance\n\nMy mom was freaking out and wanted to take me to the hospital, but I said no because I didn’t want to be a burden. I tried telling her “everything will be okay” and laid on the bed, thinking, “I’ll probably never wake up” \n\nAnd here I am typing, still alive. I still feel sick but I’m just so grateful to be alive",
  "url": "https://www.reddit.com/r/bulimia/comments/167ushc/i_almost_died/",
  "score": 64,
  "num_comments": 12,
  "comments": [
    {
      "id": "jyrzbq4",
      "author": "Excellent-World-476",
      "body": "You definitely should get checked. You may well have had a heart attack.",
      "created_utc": 1693637329.0,
      "score": 64,
      "context": []
    },
    {
      "id": "jysogrc",
      "author": "Illustrious_Diver581",
      "body": "Going to the hospital isn’t the burden. Having your mother bury you is. Speaking from experience your body is screaming for help. Go straight to the hospital now. You need potassium and sodium and they need to do it slowly. Eating tons of food could do more damage than good. Please go to the hospital and get checked out. Good luck and please be safe.",
      "created_utc": 1693655256.0,
      "score": 54,
      "context": []
    },
    {
      "id": "jyslemp",
      "author": "Miinka",
      "body": "Please talk to a doctor about this 🙏 that sounds very scary and you’re not a burden.",
      "created_utc": 1693653430.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jyso38e",
      "author": "X_Kate_",
      "body": "Definitely go get checked by a doctor. I have had a similar experience and I had really low potassium and needed a drip.",
      "created_utc": 1693655036.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jyst2ym",
      "author": "Jonistar76",
      "body": "Sounds like your electrolytes are off.",
      "created_utc": 1693657743.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jyunfb3",
      "author": "None",
      "body": "This is a medical emergency. If this was happening to your mom would you not help her bc it was a burden? Of course not! You deserve love and care just like anyone else!!! Your brain is sending you real bad signals. It's not your fault, it's not a character flaw, you're not weak, you're not worthless. You are loved and you are important. \nThis is a medical emergency!!! How would you handle it if literally anyone in your life came to you suffering so much??? Your thoughts are lying to you bc your brain is glitching. Please tell your mom you need help. Please please please get help and keep us posted",
      "created_utc": 1693684422.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jysm2k3",
      "author": "hibitchezzz",
      "body": "this happened to me, stop bp for a couple of days and eat as much as u can and rest, i also tought that i was never gonna wake up",
      "created_utc": 1693653835.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jyvposp",
      "author": "raysanghera",
      "body": "get ur ass to the hospital then i’ll take u seriously",
      "created_utc": 1693700193.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jyy5090",
      "author": "None",
      "body": "This happened to me. The dr said it’s anxiety. I thought it was related to my neurological disorder but nope. Apparently your body has fight flight or freeze. When we get intense anxiety (even for no apparent reason) our body can “freeze”. It’s like how a possum plays dead out of fear. It’s out of our control. I thought I was going to be paralyzed. It happened in 5 min numbness and curling of my toes and fingers. Numbness all the way up to my jaw and it locked and I couldn’t talk. Black dots, hyperventilating… take a deep breath. Sounds cliche but when your body doesn’t get enough oxygen it can fall out pretty quickly. This happened to me after binging/purging in a hotel and I think it lasted longer than normal panic attacks bc I was depleted of energy, so getting back to a normal baseline was hard for my body. Drink LiquidIV and you’ll be better after a few hours ♥️",
      "created_utc": 1693749596.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jywjvg8",
      "author": "triciani23",
      "body": "Please please go to the hospital — you likely have a magnesium, sodium, potassium imbalance. One, or two, or three.",
      "created_utc": 1693713863.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz4dd1z",
      "author": "TATrashpanda",
      "body": "This may not be an appropriate question and will get deleted but what do you mean really bad?? Like, starting off the day doing it without having had any true meals. Or like, doing it like serval times in a row? \n\nI had a scary experience yesterday. I had actually eaten breakfast and lunch. But then afternoon came and I was alone so the urge to binge was just to strong. I only purged twice and after the second time felt this flushing sensation come over my body and suddenly felt like I may pass out. I didn’t feel my heart racing or have chest pain but I know my adrenaline was kicked up because my flight or fight response was telling me I needed to call someone for help. I truly considered calling my boyfriend at work to see if he could come home. I didn’t end up calling but rather took a shower, had a liquid IV and spent the rest of the day on the couch. I feel ok today. Not sure why I’m saying all of this exactly \n\nTLDR: I hope you are doing better today. This d/o sucks.",
      "created_utc": 1693848901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jytnkmg",
      "author": "beansman762",
      "body": "i second this. i’m sure your mother would rather pay for medical bills than your funeral services. if you’re having health problems this severe, i HIGHLY recommend you seek medical attention as soon as you can. i know it’s hard because you don’t want to feel like a burden, but i do not doubt that she would much rather see you happy and healthy, no matter the cost",
      "created_utc": 1693670635.0,
      "score": 18,
      "context": [
        {
          "id": "jysogrc",
          "author": "Illustrious_Diver581",
          "body": "Going to the hospital isn’t the burden. Having your mother bury you is. Speaking from experience your body is screaming for help. Go straight to the hospital now. You need potassium and sodium and they need to do it slowly. Eating tons of food could do more damage than good. Please go to the hospital and get checked out. Good luck and please be safe.",
          "created_utc": 1693655256.0
        }
      ]
    }
  ]
}