{
  "id": "16g511g",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1694461311.0,
  "title": "i’m a recovered bulimic, ask me anything",
  "selftext": "i’m in recovery without treatment and am officially 3 months abstinent wooo! i know it’s not a long amount of time, but if anyone has any questions i would love to help as much as i can.\n\nsome background: i thought this disease would get the best of me and ultimately be my way of life. i spent years putting my binging and purging over everything i loved. i loved bulimia and never wanted to recover. now that i’m doing better, i have a different perspective towards food and my body, but i still understand what it’s like to be going through it.",
  "url": "https://www.reddit.com/r/bulimia/comments/16g511g/im_a_recovered_bulimic_ask_me_anything/",
  "score": 76,
  "num_comments": 72,
  "comments": [
    {
      "id": "k063yl2",
      "author": "None",
      "body": "how do you know you’re fully recovered? i went 6 months then had a relapse and have had a few since. not full on binge purge cycle level relapses but now it’s got me thinking i still have an eating disorder. i eat regularly. not saying you’re not recovered btw!",
      "created_utc": 1694468213.0,
      "score": 18,
      "context": []
    },
    {
      "id": "k06jmqu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1694474430.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k06jn75",
      "author": "KirbyButAnxious",
      "body": "How are your teeth?\nHow did you deal with body image/potential weight gain?",
      "created_utc": 1694474435.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k06e6iq",
      "author": "i_wish_i_was_bread",
      "body": "I’m in the same boat, I’m over 5 weeks b/p free after going through probably the worst relapse of my life and b/ping up to 4 times a day, there’s a long road ahead of us but I believe there’s hope for all of us to escape this disease.",
      "created_utc": 1694472195.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k0ar9rf",
      "author": "Crimson-Rose28",
      "body": "Did you get to a place where you’re okay having food stock piled in your house? I cant for the life of me have a box of protein bars, for example, without binging and purging them and it’s absolute torture",
      "created_utc": 1694545924.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k05rg41",
      "author": "None",
      "body": "how did you get out of the cycle? im so proud of you btw!!",
      "created_utc": 1694463756.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k062eo6",
      "author": "testfreak377",
      "body": "How did you eat during recovery ? How long till you get back the energy and excitement for life ?",
      "created_utc": 1694467638.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k065psg",
      "author": "Margaet_moon",
      "body": "How long were you fully bulimic for?",
      "created_utc": 1694468870.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k0gitq8",
      "author": "Relevant-Meeting-300",
      "body": "How often did you b/p? Like frequency?\nProud of you btw! Hoping to get there myself sometime soon. One day at a time 🙏",
      "created_utc": 1694638122.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k05ocqe",
      "author": "Glass-Bumblebee-1390",
      "body": "1.How did you come to the conclusion that you want to recover? \n2. How did you cope with the self doubt of the process?? Affirmations??\n3. How did you cope with the urge to b/p?\n4. How did your life change??",
      "created_utc": 1694462684.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k05qzwg",
      "author": "StockReporter5",
      "body": "what kind of physical issues (if any) did u have during your ed and how have those symptoms/problems changed since starting recovery? (asking bc my digestion is rough rn)",
      "created_utc": 1694463601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k06o7rn",
      "author": "down4funII",
      "body": "What pain health wise come up? Ive been bulimic for 12 yrs",
      "created_utc": 1694476319.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0743pe",
      "author": "addblocc",
      "body": "Have you ever had extreme hunger, and if so how did you deal with it?",
      "created_utc": 1694482595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k07grcr",
      "author": "dontknowwwhatimdoing",
      "body": "How did you start on your recovery path? What would you suggest doing to start recovering and stop binging and purging, or just all purging in general? Do you have any advice to give to someone wanting to start recovery but scared to do so? Thank you so much!",
      "created_utc": 1694487858.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k07hk17",
      "author": "the-favorite-one",
      "body": "Why did you stop?/hiw did you stop? I hope this doesent sound degrading or anything I just have no reason and no will to",
      "created_utc": 1694488216.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k07vox1",
      "author": "triyodotironina",
      "body": "First of all, I'm so proud of you 💕 and how did you manage the binge/restrict or purge cycle? This is my biggest problem I think",
      "created_utc": 1694495630.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k07x72g",
      "author": "DiabloDeSade69",
      "body": "What’s your dental situation?",
      "created_utc": 1694496590.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k08i70g",
      "author": "MitskiLover7363",
      "body": "Do you still feel the need to be “sick enough” it’s something I struggle with and it’s honestly worse then the ed and other disorders? Does thag help with therapy orrrr",
      "created_utc": 1694512617.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k09c81m",
      "author": "Obamitsulol",
      "body": "I’m trying to recover from bulemia know and I wanted to ask if there is some food that doesn’t irritate my throat at all?",
      "created_utc": 1694527935.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k09fskb",
      "author": "Patient-Cook6598",
      "body": "How to stop procrastinating the recovery i want to stop cold turkey the b/p cycle i set my goal to stop for 10 day than after achieving i start b/p for 3 day straight / how do.i tricl my brain to force my self to not b/p for at least 1 month",
      "created_utc": 1694529282.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0amfga",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1694544255.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0cjef3",
      "author": "None",
      "body": "Did you have bulimia cheeks and manage to get rid of them? Did you initially retain any water and become swollen and if yes how long did it last for?",
      "created_utc": 1694570030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0cn9jh",
      "author": "jialing0609",
      "body": "how did u stop binging",
      "created_utc": 1694571643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0ddtbf",
      "author": "Used-Ambition7917",
      "body": "First of all i just want to say how motivating it is to read all of this positive results, big congratulations! It’s really lovely how you are trying to help others! I have one question on you. I’m one month b/p free and I’m retaining tons of water and look really puffy and swollen, did you deal with this aswell and if so did it subside? Thanks you for answering 🫶🏽",
      "created_utc": 1694586124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0f5f4j",
      "author": "unknown-bulimic",
      "body": "how do you fully recover? i’ve been in recovery (eating normal meals and snacks as i used to be anorexic with a bulimic subtype), and can’t seem to get there. every time i challenge myself to a ff or something i usually end up throwing it up, but i want to get to a point where i don’t see throwing up as an option when i eat a ff which is really hard to do as i can just “get rid” of it if i feel too guilty. any tips?",
      "created_utc": 1694620613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k0nuj57",
      "author": "Ok_Finger_7308",
      "body": "What are your most useful harm reduction coping mechanisms and what skills did you have to develop to combat the ED - Brain? Also, good job!!! It couldn't have been easy. You're so strong. ❤️",
      "created_utc": 1694757755.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k338vz5",
      "author": "Normalweeb13",
      "body": "sorry if i'm a bit late, but how did you stop or atleast help regulate binging?",
      "created_utc": 1696214316.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkga7ug",
      "author": "sam_3458",
      "body": "Did you have Gerd in recovery and did it recover?",
      "created_utc": 1743298625.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mipdkn6",
      "author": "Practical_Style1289",
      "body": "When did the weight gain stop during recovery?",
      "created_utc": 1742425653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp4zxuf",
      "author": "Any-Adagio8477",
      "body": "How do I stop being it and become clean without gaining weight?",
      "created_utc": 1745671927.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mszg2rm",
      "author": "None",
      "body": "Hare are everyone’s kidneys? Anyone tell me how long they were bulimic, their EGFR if they know it and how kidneys faired after and during recovery?",
      "created_utc": 1747588881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx799zr",
      "author": "Any-Adagio8477",
      "body": "Hey, I’ve been bulimic since last year February and I’d like to really stop. I thought I would once I reached 45 but I keep going and almost reached 41 and was happy but now it’s back at 44 and I just want to reach 40 and eat whatever I want. I also just want to live a normal life without having this guilt and trouble behind me. How should I stop… the worst part is I’m only 15",
      "created_utc": 1749650442.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bbajy",
      "author": "Main-Chest-6829",
      "body": "I constantly have the feeling of food in my throat and when i burp and hiccup sometimes food comes up its super uncomfortable after i eat especially. Will this go away or am i stuck with it forever",
      "created_utc": 1751149141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1arrna",
      "author": "SundaeKitchen9266",
      "body": "I lost over 15kg within a year and now I developed bulimia and I gained over 8 kg back. And it makes me super anxious that I crave everything , even foods I use to hate. So I literally binge every single day, sometimes up to five times a day, so I had to purge to stop the numbers from going up. But I rlly want to stop. I just wanna know How do u stop purging cuz every time I binge I rlly want to purge but then if I force myself not to I gain a huge amount of weight in a few weeks.and I’ve been losing a lot of hair, it makes me really anxious, guess I didn’t want to be fat and ugly and bald. But I also can’t so weighing myself for some reason.",
      "created_utc": 1751633546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k065qss",
      "author": "None",
      "body": "i get what you’re saying! i think it’s like being an alcoholic… i’ll never be ~truly~ recovered, i’m a bulimic until i die. but i define recovery based on personal achievements; for me that’s not binging/purging/restricting. so even if i go one day without doing that, i’ll say i’m recovered. it makes it seem more achievable and motivating, compared to thinking i’m not recovered until i reach a certain amount of time.",
      "created_utc": 1694468880.0,
      "score": 22,
      "context": [
        {
          "id": "k063yl2",
          "author": "None",
          "body": "how do you know you’re fully recovered? i went 6 months then had a relapse and have had a few since. not full on binge purge cycle level relapses but now it’s got me thinking i still have an eating disorder. i eat regularly. not saying you’re not recovered btw!",
          "created_utc": 1694468213.0
        }
      ]
    },
    {
      "id": "k07ywo1",
      "author": "emotionalskirt_",
      "body": "omg someone like me",
      "created_utc": 1694497711.0,
      "score": 2,
      "context": [
        {
          "id": "k063yl2",
          "author": "None",
          "body": "how do you know you’re fully recovered? i went 6 months then had a relapse and have had a few since. not full on binge purge cycle level relapses but now it’s got me thinking i still have an eating disorder. i eat regularly. not saying you’re not recovered btw!",
          "created_utc": 1694468213.0
        }
      ]
    },
    {
      "id": "k0730s5",
      "author": "None",
      "body": "that was my biggest fear too. i still weigh myself occasionally… eventually i would like to stop all together, but i think it’s important for now to keep me sane. i gained some weight, but not nearly as much as my disease made me think i would. i just made sure to pile away/donate clothes that don’t fit. this was one of my biggest triggers, as i kept old clothes and told myself i would eventually fit in them again. while in reality, i would only wear two comfort outfits on repeat. i went shopping for new clothes with a friend and my sister, and they were very supportive and helped pick out clothes that suit me and made me feel confident. \nalso, i try to remember that this is temporary; if i am still concerned in a year or so, i can start going to the gym or lose weight in a healthy way. i just want to learn to be comfortable in my body first regardless of my weight.",
      "created_utc": 1694482158.0,
      "score": 9,
      "context": [
        {
          "id": "k06jmqu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694474430.0
        }
      ]
    },
    {
      "id": "k074yb7",
      "author": "None",
      "body": "my teeth have become very transparent. i’ve been procrastinating my dentist appointments for a while because i never wanted to face the truth. i have one coming up so hopefully everything is okay. i’m still struggling with body image & acceptance, but fortunately it’s gotten a lot better! i mostly deal with it by temporarily removing superficial people out of my life (even some family members that constantly make comments) and wearing clothes that i actually like and feel comfortable in. i took the time to prepare outfits that i thought were nice, and now when i wear them idc what i look like, i just like my cute lil fit",
      "created_utc": 1694482938.0,
      "score": 10,
      "context": [
        {
          "id": "k06jn75",
          "author": "KirbyButAnxious",
          "body": "How are your teeth?\nHow did you deal with body image/potential weight gain?",
          "created_utc": 1694474435.0
        }
      ]
    },
    {
      "id": "k06j1st",
      "author": "None",
      "body": "i feel you :( i’m so glad you’re doing better, i hope you continue in your recovery and that it gets easier for you. you got this!! (ur much cooler than bread btw)",
      "created_utc": 1694474192.0,
      "score": 3,
      "context": [
        {
          "id": "k06e6iq",
          "author": "i_wish_i_was_bread",
          "body": "I’m in the same boat, I’m over 5 weeks b/p free after going through probably the worst relapse of my life and b/ping up to 4 times a day, there’s a long road ahead of us but I believe there’s hope for all of us to escape this disease.",
          "created_utc": 1694472195.0
        }
      ]
    },
    {
      "id": "k0b0zpu",
      "author": "None",
      "body": "yes! pint of ice cream?? in my freezer?? it’s something i never thought was possible. i started by getting rid of everything first, but not limiting anything. so if i wanted something, i could have it but i would have to get out to buy it (and only one serving). eventually once that became a habit i started keeping more foods in the house and enjoying them when i felt like it.",
      "created_utc": 1694549242.0,
      "score": 2,
      "context": [
        {
          "id": "k0ar9rf",
          "author": "Crimson-Rose28",
          "body": "Did you get to a place where you’re okay having food stock piled in your house? I cant for the life of me have a box of protein bars, for example, without binging and purging them and it’s absolute torture",
          "created_utc": 1694545924.0
        }
      ]
    },
    {
      "id": "k061l5g",
      "author": "None",
      "body": "aw thank you!! i started with a reward system. for me, my reward was video games lol. i would allow myself to play if i achieved small goals, such as not purging after a binge. i also would play to distract myself when i felt cravings. eventually i would go a couple days w/o binging, then a week, etc. the longer i went, the more horrifying the idea of binging & purging seemed.",
      "created_utc": 1694467341.0,
      "score": 7,
      "context": [
        {
          "id": "k05rg41",
          "author": "None",
          "body": "how did you get out of the cycle? im so proud of you btw!!",
          "created_utc": 1694463756.0
        }
      ]
    },
    {
      "id": "k066nup",
      "author": "None",
      "body": "i didn’t restrict anything because that made me crave things more. i would be cautious around trigger foods, and be sure to monitor how i felt after eating them. i made a list for each meal of nutritious foods that i enjoy. one of my problems was overthinking what to eat… and then ending up binging. having a list made it easy for me so i could just pick something and make it. i’ve regained a little energy, i think it takes more time for that to return. i’m definitely able to attend classes now and not cancel every plan/appointment i make. i don’t think i’ve ever felt excited for life before, but i’m slowly starting to not hate it lol",
      "created_utc": 1694469225.0,
      "score": 9,
      "context": [
        {
          "id": "k062eo6",
          "author": "testfreak377",
          "body": "How did you eat during recovery ? How long till you get back the energy and excitement for life ?",
          "created_utc": 1694467638.0
        }
      ]
    },
    {
      "id": "k067ila",
      "author": "None",
      "body": "7 years",
      "created_utc": 1694469547.0,
      "score": 3,
      "context": [
        {
          "id": "k065psg",
          "author": "Margaet_moon",
          "body": "How long were you fully bulimic for?",
          "created_utc": 1694468870.0
        }
      ]
    },
    {
      "id": "k0k4un4",
      "author": "None",
      "body": "it started off a couple times a week, but the past couple years have been 6-7x daily. and thank you! good luck with your recovery, i’m here for you :)",
      "created_utc": 1694703568.0,
      "score": 1,
      "context": [
        {
          "id": "k0gitq8",
          "author": "Relevant-Meeting-300",
          "body": "How often did you b/p? Like frequency?\nProud of you btw! Hoping to get there myself sometime soon. One day at a time 🙏",
          "created_utc": 1694638122.0
        }
      ]
    },
    {
      "id": "k05zuy8",
      "author": "None",
      "body": "(sorry this is long)\n1. a few factors played a role, such as time and money. but mostly seeing what my disease did to my family. i still live with my parents and had to constantly lie about what i was doing/where i was. it sounds ridiculous to lie about food, but eating disorders are so secretive. i felt extreme guilt each time i binged because i knew my family didn’t want to see me like that. at first when i couldn’t do it for myself, i did it for them.\n2. i made a vision board including everything i could never do/have because of bulimia. whenever i doubted myself i would look at it to remember why i started. i would say simple affirmations before meals, like “you are worthy” or “today will be a good day”.\n3. i coped with distraction- i temporarily became obsessed with movies & video games. i would reward myself by playing a couple games, for example, if i didn’t binge, or purge after a binge. this mostly became my motivation. also, keeping myself busy (especially at night or when i’m alone). i started taking melatonin to help me sleep earlier because i would mostly binge at night. p.s. i also treat myself to iced coffee everyday if i don’t engage in ed behaviors (it’s small but it helps!)\n4. i feel free (as cliche as it sounds). i have saved soooo much time now that i’m not constantly at the grocery store, eating, weighing myself, or sticking my fingers down my throat. i feel like i can be present with the people i’m with. i also have a better relationship with my friends & family, as i’m not constantly lying to everyone or blowing off plans. and most importantly, i’m happy with myself.",
      "created_utc": 1694466711.0,
      "score": 8,
      "context": [
        {
          "id": "k05ocqe",
          "author": "Glass-Bumblebee-1390",
          "body": "1.How did you come to the conclusion that you want to recover? \n2. How did you cope with the self doubt of the process?? Affirmations??\n3. How did you cope with the urge to b/p?\n4. How did your life change??",
          "created_utc": 1694462684.0
        }
      ]
    },
    {
      "id": "k05r1ph",
      "author": "StockReporter5",
      "body": "oooh yes how do u stay motivated?",
      "created_utc": 1694463618.0,
      "score": 3,
      "context": [
        {
          "id": "k05ocqe",
          "author": "Glass-Bumblebee-1390",
          "body": "1.How did you come to the conclusion that you want to recover? \n2. How did you cope with the self doubt of the process?? Affirmations??\n3. How did you cope with the urge to b/p?\n4. How did your life change??",
          "created_utc": 1694462684.0
        }
      ]
    },
    {
      "id": "k060qph",
      "author": "None",
      "body": "at first though, it was very hard to understand when to eat, because i could never tell if i was hungry or not. i set a schedule to eat at the same times everyday, and that helped me regulate it after a couple of weeks.",
      "created_utc": 1694467036.0,
      "score": 5,
      "context": [
        {
          "id": "k05qzwg",
          "author": "StockReporter5",
          "body": "what kind of physical issues (if any) did u have during your ed and how have those symptoms/problems changed since starting recovery? (asking bc my digestion is rough rn)",
          "created_utc": 1694463601.0
        }
      ]
    },
    {
      "id": "k060hop",
      "author": "None",
      "body": "yess i used to have very slow digestion and purged blood multiple times. i was terrified my esophagus would tear but thankfully everything is okay. my digestion is a lot better now that i’m eating more naturally and my hunger queues have returned. tmi but i’m also not nearly constipated as much.",
      "created_utc": 1694466944.0,
      "score": 3,
      "context": [
        {
          "id": "k05qzwg",
          "author": "StockReporter5",
          "body": "what kind of physical issues (if any) did u have during your ed and how have those symptoms/problems changed since starting recovery? (asking bc my digestion is rough rn)",
          "created_utc": 1694463601.0
        }
      ]
    },
    {
      "id": "k0772mf",
      "author": "None",
      "body": "lots of fatigue, hunger, stomach pain, and constipation. i would constantly get very light headed and need to lay down. i’m sorry you’ve also been going through this for so long… i’m here for you",
      "created_utc": 1694483810.0,
      "score": 1,
      "context": [
        {
          "id": "k06o7rn",
          "author": "down4funII",
          "body": "What pain health wise come up? Ive been bulimic for 12 yrs",
          "created_utc": 1694476319.0
        }
      ]
    },
    {
      "id": "k077kku",
      "author": "None",
      "body": "yes, i eat full meals that include foods with higher volume - such as vegetables, watermelon, or rice. i find that when i eat these i get full faster. soda/sparkling water helps too. if i’m still hungry after eating a good amount of food, i distract myself for a bit.",
      "created_utc": 1694484014.0,
      "score": 2,
      "context": [
        {
          "id": "k0743pe",
          "author": "addblocc",
          "body": "Have you ever had extreme hunger, and if so how did you deal with it?",
          "created_utc": 1694482595.0
        }
      ]
    },
    {
      "id": "k07ojjq",
      "author": "None",
      "body": "i started by opening up to my family because they played a huge part in it - their actions & habits triggered me, but that was no excuse for me to lie and steal in order to binge. fortunately they supported me in my recovery so i had people to count on. i suggest making a plan and writing it down somewhere; when i did that, recovery seemed more realistic rather than just an idea in my head. also, get rid of any binge food!!! i still eat foods that i used to binge, but when i started recovery, i had to throw away everything (give to my siblings lol) because it was too triggering. this way if i wanted a certain food, i could still have it, i would just have to go out of my way to get it. i was scared to start recovery too… bulimia had been my way of life for so long that i didn’t know who i was without it. but i realized bulimia is a one sided relationship - it doesn’t care about me, or anyone. it took everything from me!!! i needed to define myself without it. there was nothing more to lose, so why not try something else.",
      "created_utc": 1694491528.0,
      "score": 1,
      "context": [
        {
          "id": "k07grcr",
          "author": "dontknowwwhatimdoing",
          "body": "How did you start on your recovery path? What would you suggest doing to start recovering and stop binging and purging, or just all purging in general? Do you have any advice to give to someone wanting to start recovery but scared to do so? Thank you so much!",
          "created_utc": 1694487858.0
        }
      ]
    },
    {
      "id": "k07rnea",
      "author": "None",
      "body": "it also helps to view bulimia as a person, separate from yourself. i always thought bulimia was part of me, that it made me who i was. but when i view it as a person… i hate it so much! what kind of person would take everything away from someone who’s dedicated their life to them? i’ve done everything for bulimia, but what has it done for me? i shouldn’t have to obey such a horrible thing.",
      "created_utc": 1694493220.0,
      "score": 1,
      "context": [
        {
          "id": "k07grcr",
          "author": "dontknowwwhatimdoing",
          "body": "How did you start on your recovery path? What would you suggest doing to start recovering and stop binging and purging, or just all purging in general? Do you have any advice to give to someone wanting to start recovery but scared to do so? Thank you so much!",
          "created_utc": 1694487858.0
        }
      ]
    },
    {
      "id": "k07q6cc",
      "author": "None",
      "body": "i understand what you mean. i stopped because i was tired of not “living my life.” i was constantly waiting to lose weight and look a certain way before i could allow myself to begin truly living. it wasn’t until i realized that everything in my life was actually falling apart that i decided to try and change. i had dropped out of school, lost all my friends, stopped all of my hobbies, spent all of my savings, etc… all this because i thought binging and purging was the only thing that made me happy. i was willing to throw everything away just to experience that feeling every hour of the day. now i try to find happiness in other things, no matter how small. whether it’s my cats, coffee, nature, etc., i think experiencing these things are better than any binge i could think of. of course it’s not that easy, but just a simple thought can go a long way.",
      "created_utc": 1694492398.0,
      "score": 2,
      "context": [
        {
          "id": "k07hk17",
          "author": "the-favorite-one",
          "body": "Why did you stop?/hiw did you stop? I hope this doesent sound degrading or anything I just have no reason and no will to",
          "created_utc": 1694488216.0
        }
      ]
    },
    {
      "id": "k09g7aw",
      "author": "None",
      "body": "thank you <3 i interrupted the cycle by identifying where it actually started for me, and that was restricting. when i originally started restricting - i began to binge and purge. so i focused mostly on eating enough throughout the day to avoid feeling urges to binge. i also didn’t cut out any foods because when i did, the cravings just got worse. of course there were still urges to binge because it was just a habit at that point; to deal with those i would distract myself by doing something i enjoyed! i know it’s hard to stop restricting, yet alone all of the cycle - but even if you can cut out one thing at a time, whether it’s restricting, purging, or binging, it makes a huge difference.",
      "created_utc": 1694529435.0,
      "score": 3,
      "context": [
        {
          "id": "k07vox1",
          "author": "triyodotironina",
          "body": "First of all, I'm so proud of you 💕 and how did you manage the binge/restrict or purge cycle? This is my biggest problem I think",
          "created_utc": 1694495630.0
        }
      ]
    },
    {
      "id": "k09ihds",
      "author": "None",
      "body": "my teeth are now very transparent and my gums hurt a lot. i’ve been avoiding my dentist appointments out of fear so i’m not sure how my teeth actually are. i finally have one coming up next month so hopefully everything is not terrible 😭",
      "created_utc": 1694530274.0,
      "score": 1,
      "context": [
        {
          "id": "k07x72g",
          "author": "DiabloDeSade69",
          "body": "What’s your dental situation?",
          "created_utc": 1694496590.0
        }
      ]
    },
    {
      "id": "k09j9ef",
      "author": "None",
      "body": "fortunately i haven’t felt that recently; i do occasionally miss being bulimic because it felt like the one thing i had control over. but when i actually sit and think about what it did to me… i’m thankful i’m in recovery. but that was one of the hardest things to get over; because i never lost a lot of weight or binged and purged a certain amount of times a day, i felt like i was never a “successful” bulimic. my goal became wanting to be as sick as possible, to prove that i could actually do something for once. i still had that mentality at the beginning of my recovery, but i tried to put it aside as much as possible and just work on my actions. once i started making the physical changes, my thoughts followed. now i realize how irrational those ideas were to me.",
      "created_utc": 1694530553.0,
      "score": 1,
      "context": [
        {
          "id": "k08i70g",
          "author": "MitskiLover7363",
          "body": "Do you still feel the need to be “sick enough” it’s something I struggle with and it’s honestly worse then the ed and other disorders? Does thag help with therapy orrrr",
          "created_utc": 1694512617.0
        }
      ]
    },
    {
      "id": "k09joa3",
      "author": "None",
      "body": "yogurt, oatmeal, warm meals, and soup helps…food that’s not too hard to swallow. good luck with your recovery :)",
      "created_utc": 1694530704.0,
      "score": 1,
      "context": [
        {
          "id": "k09c81m",
          "author": "Obamitsulol",
          "body": "I’m trying to recover from bulemia know and I wanted to ask if there is some food that doesn’t irritate my throat at all?",
          "created_utc": 1694527935.0
        }
      ]
    },
    {
      "id": "k09n40c",
      "author": "None",
      "body": "i used to do that too. instead of setting a goal for a certain amount of time, just take it one day at a time. if you can get through one day without binging and purging, that’s a win. and the next day, same thing. and if you have a set back, you can try again right after! recovery won’t be linear.",
      "created_utc": 1694531937.0,
      "score": 2,
      "context": [
        {
          "id": "k09fskb",
          "author": "Patient-Cook6598",
          "body": "How to stop procrastinating the recovery i want to stop cold turkey the b/p cycle i set my goal to stop for 10 day than after achieving i start b/p for 3 day straight / how do.i tricl my brain to force my self to not b/p for at least 1 month",
          "created_utc": 1694529282.0
        }
      ]
    },
    {
      "id": "k0b0arn",
      "author": "None",
      "body": "yes;  it took a few weeks but i feel a lot better now. despite gaining some weight, my face is not nearly as puffy/bloated. i looked so miserable before - puffy cheeks, baggy eyes, red dots along my face.",
      "created_utc": 1694549009.0,
      "score": 1,
      "context": [
        {
          "id": "k0amfga",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694544255.0
        }
      ]
    },
    {
      "id": "k0eeajm",
      "author": "None",
      "body": "yes; i didn’t do anything specific to get rid of them, they kind of went away throughout my recovery process. when i first stopped binging/purging, i was very bloated and constipated for the first week. it felt terrible and made me want to give up multiple times. but i just tried to remind myself that it will pass, and that its part of the healing process for my body.",
      "created_utc": 1694610141.0,
      "score": 1,
      "context": [
        {
          "id": "k0cjef3",
          "author": "None",
          "body": "Did you have bulimia cheeks and manage to get rid of them? Did you initially retain any water and become swollen and if yes how long did it last for?",
          "created_utc": 1694570030.0
        }
      ]
    },
    {
      "id": "k0eew8u",
      "author": "None",
      "body": "the key for me was to stop restricting all together; no under eating, no skipping meals, no food was off limits. i made a schedule for times to eat everyday because my hunger queues where still messed up. i also made a list of nutritious meals/foods that were easy to make so i didn’t have to stress about each meal. a reward system also helped for acknowledging small achievements and getting over cravings. so whenever i didn’t purge after a binge, or didn’t binge at all, i would reward myself by doing/getting something i loved!",
      "created_utc": 1694610409.0,
      "score": 1,
      "context": [
        {
          "id": "k0cn9jh",
          "author": "jialing0609",
          "body": "how did u stop binging",
          "created_utc": 1694571643.0
        }
      ]
    },
    {
      "id": "k33ua7i",
      "author": "None",
      "body": "hey sorry i didn’t see this earlier! thank you so much, and congrats on one month, that’s such a huge milestone!!! i was very bloated when i first stopped binging/purging… it was mostly due to increased fiber. this lasted for a couple of weeks. what really helped was a consistent diet/fiber intake, water, and green tea :)",
      "created_utc": 1696226159.0,
      "score": 1,
      "context": [
        {
          "id": "k0ddtbf",
          "author": "Used-Ambition7917",
          "body": "First of all i just want to say how motivating it is to read all of this positive results, big congratulations! It’s really lovely how you are trying to help others! I have one question on you. I’m one month b/p free and I’m retaining tons of water and look really puffy and swollen, did you deal with this aswell and if so did it subside? Thanks you for answering 🫶🏽",
          "created_utc": 1694586124.0
        }
      ]
    },
    {
      "id": "k0k5bmt",
      "author": "None",
      "body": "try thinking of the consequences… it got to the point for me where i didn’t know what purge would be my last one. fearing the negative actions, and rewarding positive ones, like not purging after a binge, have helped me a lot! eventually it gets easier, and purging after eating won’t even seem like an option. you just have to get through the first couple of weeks, and challenge your thoughts.",
      "created_utc": 1694703738.0,
      "score": 2,
      "context": [
        {
          "id": "k0f5f4j",
          "author": "unknown-bulimic",
          "body": "how do you fully recover? i’ve been in recovery (eating normal meals and snacks as i used to be anorexic with a bulimic subtype), and can’t seem to get there. every time i challenge myself to a ff or something i usually end up throwing it up, but i want to get to a point where i don’t see throwing up as an option when i eat a ff which is really hard to do as i can just “get rid” of it if i feel too guilty. any tips?",
          "created_utc": 1694620613.0
        }
      ]
    },
    {
      "id": "k0plw8e",
      "author": "None",
      "body": "thank you so much! ♥️ the best coping mechanisms were distraction and finding an alternative outlet for my feelings. for me that was gaming, going out to get coffee, and going for walks. as for skills- mostly self will. this is something i never had before but it slowly developed throughout my recovery. also challenging my thoughts was very helpful; so whenever i had an ED thought, like “i need to purge”, i would question it and try to realize how irrational it is.",
      "created_utc": 1694792605.0,
      "score": 2,
      "context": [
        {
          "id": "k0nuj57",
          "author": "Ok_Finger_7308",
          "body": "What are your most useful harm reduction coping mechanisms and what skills did you have to develop to combat the ED - Brain? Also, good job!!! It couldn't have been easy. You're so strong. ❤️",
          "created_utc": 1694757755.0
        }
      ]
    },
    {
      "id": "k33v4ho",
      "author": "None",
      "body": "a couple things helped me stop binging. one was a reward system; i rewarded myself whenever i caught myself binging or prevented a purge. i would reward myself with something i enjoyed like going out to get coffee, playing a couple video games, etc. these felt like rewards but also helped me distract myself and ground me. another thing was keeping a consistent diet and making a list of easy nutritious meals i enjoyed, that way whenever i felt hungry and indecisive, instead of binging i would choose something from my list to eat. i didn’t limit any foods, rather just the amounts i ate so that i wouldn’t overeat. :)",
      "created_utc": 1696226757.0,
      "score": 2,
      "context": [
        {
          "id": "k338vz5",
          "author": "Normalweeb13",
          "body": "sorry if i'm a bit late, but how did you stop or atleast help regulate binging?",
          "created_utc": 1696214316.0
        }
      ]
    },
    {
      "id": "k06wzzr",
      "author": "kathruins",
      "body": "we like to say in AA that we're recovering alcoholics until the day we die. no shame in it :) it's a lifelong process. i can't imagine never wanting a drink or a purge again, so it's \"recovering\" one day at a time. the beauty and motivation comes from seeing others turn their lives around in recovery; for that reason, I can't help but recommend EDA.",
      "created_utc": 1694479806.0,
      "score": 8,
      "context": [
        {
          "id": "k063yl2",
          "author": "None",
          "body": "how do you know you’re fully recovered? i went 6 months then had a relapse and have had a few since. not full on binge purge cycle level relapses but now it’s got me thinking i still have an eating disorder. i eat regularly. not saying you’re not recovered btw!",
          "created_utc": 1694468213.0
        },
        {
          "id": "k065qss",
          "author": "None",
          "body": "i get what you’re saying! i think it’s like being an alcoholic… i’ll never be ~truly~ recovered, i’m a bulimic until i die. but i define recovery based on personal achievements; for me that’s not binging/purging/restricting. so even if i go one day without doing that, i’ll say i’m recovered. it makes it seem more achievable and motivating, compared to thinking i’m not recovered until i reach a certain amount of time.",
          "created_utc": 1694468880.0
        }
      ]
    },
    {
      "id": "k07ha7l",
      "author": "Apprehensive_Log5595",
      "body": "Omg I’ve never heard anyone say this out loud , but I do the same thing and you just helped me realize it was a trigger . Saving clothes that I “think will fit me later.” In other words knowing I’ll lose the weight fast and unhealthy.",
      "created_utc": 1694488096.0,
      "score": 6,
      "context": [
        {
          "id": "k06jmqu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694474430.0
        },
        {
          "id": "k0730s5",
          "author": "None",
          "body": "that was my biggest fear too. i still weigh myself occasionally… eventually i would like to stop all together, but i think it’s important for now to keep me sane. i gained some weight, but not nearly as much as my disease made me think i would. i just made sure to pile away/donate clothes that don’t fit. this was one of my biggest triggers, as i kept old clothes and told myself i would eventually fit in them again. while in reality, i would only wear two comfort outfits on repeat. i went shopping for new clothes with a friend and my sister, and they were very supportive and helped pick out clothes that suit me and made me feel confident. \nalso, i try to remember that this is temporary; if i am still concerned in a year or so, i can start going to the gym or lose weight in a healthy way. i just want to learn to be comfortable in my body first regardless of my weight.",
          "created_utc": 1694482158.0
        }
      ]
    },
    {
      "id": "k06cemc",
      "author": "None",
      "body": "omg i’ve never thought ab that strategy im gonna find something to use the reward system on and give it a go aha thank you so much! n again this is a big achievement for you, well done :) wishing you the best!",
      "created_utc": 1694471473.0,
      "score": 2,
      "context": [
        {
          "id": "k05rg41",
          "author": "None",
          "body": "how did you get out of the cycle? im so proud of you btw!!",
          "created_utc": 1694463756.0
        },
        {
          "id": "k061l5g",
          "author": "None",
          "body": "aw thank you!! i started with a reward system. for me, my reward was video games lol. i would allow myself to play if i achieved small goals, such as not purging after a binge. i also would play to distract myself when i felt cravings. eventually i would go a couple days w/o binging, then a week, etc. the longer i went, the more horrifying the idea of binging & purging seemed.",
          "created_utc": 1694467341.0
        }
      ]
    },
    {
      "id": "k0688vz",
      "author": "testfreak377",
      "body": "Thanks for the reply ! I really appreciate it. Do you just eat when hungry and stop when full ?",
      "created_utc": 1694469826.0,
      "score": 2,
      "context": [
        {
          "id": "k062eo6",
          "author": "testfreak377",
          "body": "How did you eat during recovery ? How long till you get back the energy and excitement for life ?",
          "created_utc": 1694467638.0
        },
        {
          "id": "k066nup",
          "author": "None",
          "body": "i didn’t restrict anything because that made me crave things more. i would be cautious around trigger foods, and be sure to monitor how i felt after eating them. i made a list for each meal of nutritious foods that i enjoy. one of my problems was overthinking what to eat… and then ending up binging. having a list made it easy for me so i could just pick something and make it. i’ve regained a little energy, i think it takes more time for that to return. i’m definitely able to attend classes now and not cancel every plan/appointment i make. i don’t think i’ve ever felt excited for life before, but i’m slowly starting to not hate it lol",
          "created_utc": 1694469225.0
        }
      ]
    },
    {
      "id": "k0bi90e",
      "author": "triyodotironina",
      "body": "Wow, this is so helpful fr. Tysm and keep going! 💕",
      "created_utc": 1694555178.0,
      "score": 2,
      "context": [
        {
          "id": "k07vox1",
          "author": "triyodotironina",
          "body": "First of all, I'm so proud of you 💕 and how did you manage the binge/restrict or purge cycle? This is my biggest problem I think",
          "created_utc": 1694495630.0
        },
        {
          "id": "k09g7aw",
          "author": "None",
          "body": "thank you <3 i interrupted the cycle by identifying where it actually started for me, and that was restricting. when i originally started restricting - i began to binge and purge. so i focused mostly on eating enough throughout the day to avoid feeling urges to binge. i also didn’t cut out any foods because when i did, the cravings just got worse. of course there were still urges to binge because it was just a habit at that point; to deal with those i would distract myself by doing something i enjoyed! i know it’s hard to stop restricting, yet alone all of the cycle - but even if you can cut out one thing at a time, whether it’s restricting, purging, or binging, it makes a huge difference.",
          "created_utc": 1694529435.0
        }
      ]
    },
    {
      "id": "k09xazx",
      "author": "Obamitsulol",
      "body": "Thank you for recommendation!:)",
      "created_utc": 1694535520.0,
      "score": 2,
      "context": [
        {
          "id": "k09c81m",
          "author": "Obamitsulol",
          "body": "I’m trying to recover from bulemia know and I wanted to ask if there is some food that doesn’t irritate my throat at all?",
          "created_utc": 1694527935.0
        },
        {
          "id": "k09joa3",
          "author": "None",
          "body": "yogurt, oatmeal, warm meals, and soup helps…food that’s not too hard to swallow. good luck with your recovery :)",
          "created_utc": 1694530704.0
        }
      ]
    },
    {
      "id": "k077x0n",
      "author": "None",
      "body": "ooh thank you! i’ve been meaning to check out EDA more, i’ve read a little bit and found it really helpful. so far i’ve been using an AA book and replacing words with “food” or “eating” lol",
      "created_utc": 1694484153.0,
      "score": 2,
      "context": [
        {
          "id": "k063yl2",
          "author": "None",
          "body": "how do you know you’re fully recovered? i went 6 months then had a relapse and have had a few since. not full on binge purge cycle level relapses but now it’s got me thinking i still have an eating disorder. i eat regularly. not saying you’re not recovered btw!",
          "created_utc": 1694468213.0
        },
        {
          "id": "k065qss",
          "author": "None",
          "body": "i get what you’re saying! i think it’s like being an alcoholic… i’ll never be ~truly~ recovered, i’m a bulimic until i die. but i define recovery based on personal achievements; for me that’s not binging/purging/restricting. so even if i go one day without doing that, i’ll say i’m recovered. it makes it seem more achievable and motivating, compared to thinking i’m not recovered until i reach a certain amount of time.",
          "created_utc": 1694468880.0
        },
        {
          "id": "k06wzzr",
          "author": "kathruins",
          "body": "we like to say in AA that we're recovering alcoholics until the day we die. no shame in it :) it's a lifelong process. i can't imagine never wanting a drink or a purge again, so it's \"recovering\" one day at a time. the beauty and motivation comes from seeing others turn their lives around in recovery; for that reason, I can't help but recommend EDA.",
          "created_utc": 1694479806.0
        }
      ]
    },
    {
      "id": "k06ikgz",
      "author": "None",
      "body": "thank you <3 i hope it helps, good luck!! you got this",
      "created_utc": 1694473992.0,
      "score": 1,
      "context": [
        {
          "id": "k05rg41",
          "author": "None",
          "body": "how did you get out of the cycle? im so proud of you btw!!",
          "created_utc": 1694463756.0
        },
        {
          "id": "k061l5g",
          "author": "None",
          "body": "aw thank you!! i started with a reward system. for me, my reward was video games lol. i would allow myself to play if i achieved small goals, such as not purging after a binge. i also would play to distract myself when i felt cravings. eventually i would go a couple days w/o binging, then a week, etc. the longer i went, the more horrifying the idea of binging & purging seemed.",
          "created_utc": 1694467341.0
        },
        {
          "id": "k06cemc",
          "author": "None",
          "body": "omg i’ve never thought ab that strategy im gonna find something to use the reward system on and give it a go aha thank you so much! n again this is a big achievement for you, well done :) wishing you the best!",
          "created_utc": 1694471473.0
        }
      ]
    },
    {
      "id": "k06ises",
      "author": "None",
      "body": "yes pretty much! of course there are times when i overeat a little, but i remind myself that it’s not worth a relapse, and that i can always eat later when i’m hungry again.",
      "created_utc": 1694474083.0,
      "score": 2,
      "context": [
        {
          "id": "k062eo6",
          "author": "testfreak377",
          "body": "How did you eat during recovery ? How long till you get back the energy and excitement for life ?",
          "created_utc": 1694467638.0
        },
        {
          "id": "k066nup",
          "author": "None",
          "body": "i didn’t restrict anything because that made me crave things more. i would be cautious around trigger foods, and be sure to monitor how i felt after eating them. i made a list for each meal of nutritious foods that i enjoy. one of my problems was overthinking what to eat… and then ending up binging. having a list made it easy for me so i could just pick something and make it. i’ve regained a little energy, i think it takes more time for that to return. i’m definitely able to attend classes now and not cancel every plan/appointment i make. i don’t think i’ve ever felt excited for life before, but i’m slowly starting to not hate it lol",
          "created_utc": 1694469225.0
        },
        {
          "id": "k0688vz",
          "author": "testfreak377",
          "body": "Thanks for the reply ! I really appreciate it. Do you just eat when hungry and stop when full ?",
          "created_utc": 1694469826.0
        }
      ]
    }
  ]
}