{
  "id": "173da7t",
  "subreddit": "bulimia",
  "author": "Several-Giraffe1930",
  "created_utc": 1696807837.0,
  "title": "I am currently in the hospital for a potassium of 1.8…",
  "selftext": "I was brought to the hospital by ambulance Sat morning. I was driving when I started to feel weak, and suddenly my entire body cramped up so bad I was screaming in pain. I couldn’t move and my sister couldn’t even undo my cramped hands or pull my arms down away from my neck where they were stuck cramped up. I have admitted to my doctor that I struggle SEVERELY with BP type bulimia. My blood pressure is very low, 80/40. I’m on IV potassium and fluids. I could have gone into a cardiac arrest. I could’ve dropped dead. \nI’ve been doing this for 6 years now. I’m tired of it. Yet here I am sobbing because I just threw up the hospital dinner. This is the sickest battle and addiction to overcome.",
  "url": "https://www.reddit.com/r/bulimia/comments/173da7t/i_am_currently_in_the_hospital_for_a_potassium_of/",
  "score": 88,
  "num_comments": 11,
  "comments": [
    {
      "id": "k42lfrq",
      "author": "None",
      "body": "telephone encourage pet march spark joke whistle innocent shy dinosaurs\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1696814593.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k42eabc",
      "author": "Memory_System",
      "body": "As someone who was in the hospital for a potassium of >!2.5!< I'm sending you so much love rn <3  \n\n\nThis is a difficult thing to overcome, but I believe in you.",
      "created_utc": 1696811502.0,
      "score": 18,
      "context": []
    },
    {
      "id": "k42wiyv",
      "author": "subangel99",
      "body": "I haven’t been hospitalized over potassium but every time I have been hospitalized pregnancy, gallbladder it has been mentioned.  They bring in this gigantic horse pill that I end up throwing most of it away.   That is very scary and I’m glad you’re ok.",
      "created_utc": 1696819482.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k43xrfr",
      "author": "None",
      "body": "You deserve to live a life without this. I hope the hospital gives you what you need to jumpstart the potassium and wider recovery ❤️‍🩹",
      "created_utc": 1696843861.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k432rxb",
      "author": "Realistic-Shallot288",
      "body": "I’ve been in ER for potassium of 1.8, they’ll give you some and it will be ok, for this time… the worst is that I have a supplement that I have to take every day as prescribed and I don’t even take it because I end up binging and purging before it gets a chance to get absorbed… and I don’t take it at night time because it gives me acid reflux.. so I’m just constantly on the low side and I don’t even want to do any lab work because if they check a low potassium they will send me the police to force me into the ER.. which I don’t want to because I feel like a child that will get blamed for their misbehaving.. ugh\nI’m sorry it sucks..",
      "created_utc": 1696822402.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k43kdcj",
      "author": "SnoozingAndLosing",
      "body": "I was just admitted for dangerously low pottasium as well a few weeks ago and it feels hopeless. Nobody deserves to feel like this. Sending love and support ❤️",
      "created_utc": 1696833310.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k45sij4",
      "author": "Libby19350",
      "body": "Please please please try get better. I lost my sister when she was 18 due to bulimia. She had low potassium levels before (knowing from blood tests) and I wish she took the warning seriously because she ended up passing from cardiac arrest. Sending lots of love your way and hoping for the best for you, as well as a speedy recovery💛💛💛",
      "created_utc": 1696874090.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k45sm2w",
      "author": "Northeastender",
      "body": "Mine’s never been that low, but close. I had a seizure and a head injury from the fall.\n\nIt’s so scary how that was 4 years ago and yet here I still am.\n\nLuckily I can manage it (sort of) with regular blood tests and daily prescriptions K+ supplements. Which are both free in my country, honestly so grateful and lucky for that.",
      "created_utc": 1696874125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1je5zh",
      "author": "Ok_Solution_4417",
      "body": "Hey guys I’ve got a question about this- I  been threatened with the hospital if my potassium levels Dont increase by Monday - would this likely jist be an outpatient appointment where they gave me a drip or would I have to stay in at night ?",
      "created_utc": 1751752408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k46g3iv",
      "author": "Thick-Bottle-9256",
      "body": "Those low potassium cramp ups are the most terrifying and unpleasant things I’ve ever experienced in my ED experience. And I feel like no one understands how scary and debilitating they are unless you’re literally bulimic and have experienced it personally. Please know that as horrible this battle is, you’re not alone, and if nothing else, the people in this sub are cheering for you. I’m cheering for you and sending you peace, relief, and strength as you endure these days in hospital 💗",
      "created_utc": 1696882478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k432vp9",
      "author": "Realistic-Shallot288",
      "body": "Yeah I have two to take every day and they are horrible to swallow",
      "created_utc": 1696822455.0,
      "score": 2,
      "context": [
        {
          "id": "k42wiyv",
          "author": "subangel99",
          "body": "I haven’t been hospitalized over potassium but every time I have been hospitalized pregnancy, gallbladder it has been mentioned.  They bring in this gigantic horse pill that I end up throwing most of it away.   That is very scary and I’m glad you’re ok.",
          "created_utc": 1696819482.0
        }
      ]
    }
  ]
}