{
  "id": "1741dgk",
  "subreddit": "bulimia",
  "author": "No-Show8369",
  "created_utc": 1696881536.0,
  "title": "saving money is a joke",
  "selftext": "so much of my paychecks go to binge meals and bills n im always telling my friends that ohhh im just such a shopaholic!! when in reality i have a shameful eating disorder, especially my roommates must be wondering where the fuck all the money in those “shopping trips” go when there’s rarely new clothes or items in my room ughhh,,, embarrassing…",
  "url": "https://www.reddit.com/r/bulimia/comments/1741dgk/saving_money_is_a_joke/",
  "score": 67,
  "num_comments": 7,
  "comments": [
    {
      "id": "k46lfnp",
      "author": "kittykat_066",
      "body": "THIS!!! i’ve wasted so much money on food that ends up in the toilet. it’s so frustrating",
      "created_utc": 1696884389.0,
      "score": 35,
      "context": []
    },
    {
      "id": "k46owil",
      "author": "xStingx",
      "body": "Mine put me in so much debt I had to move back in with my mom.",
      "created_utc": 1696885667.0,
      "score": 17,
      "context": []
    },
    {
      "id": "k4fdseg",
      "author": "Blondediary",
      "body": "Yup.. been working since I was 17 & still broke as the day I moved out because it’s all spent on this damn disorder",
      "created_utc": 1697037263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k48wf09",
      "author": "YellowAromatic5844",
      "body": "yes. it is the worst, i didn’t think about this when i was younger but since living alone it’s hell. i’m a student so i barely get by when im healthy, and definitely not when i binge. and it all goes to waste.",
      "created_utc": 1696924347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k4mevn0",
      "author": "Fine-Aside1789",
      "body": "I try to keep it as cheap as possible.  Hardly ever eat out, even fast food but still living paycheck to paycheck.  Even the stupid potassium pills I have to take cost too much.  I've tried taking less of those so I could buy more food but then I have no energy to ride my bike to work and then do the work once I get there.  I haven't bought new clothes in years aside from what was absolutely necessary.  All so I can buy food that I'm not even going to keep down.  It's so stupid.  How my husband doesn't get it is beyond me",
      "created_utc": 1697147371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k46qtk5",
      "author": "No-Show8369",
      "body": "i swear that’s gonna be a near future for me and I just moved out this year ugh.. sending hugs",
      "created_utc": 1696886384.0,
      "score": 10,
      "context": [
        {
          "id": "k46owil",
          "author": "xStingx",
          "body": "Mine put me in so much debt I had to move back in with my mom.",
          "created_utc": 1696885667.0
        }
      ]
    },
    {
      "id": "k46t3ko",
      "author": "xStingx",
      "body": "Oh man, please don't be like me. My credit score sucks, I had to leave my job to move back to a job I previously had. I feel pathetic every day. My paychecks get eaten up because of the loans I took out and I've downgraded to a small bedroom that I share with my large dog & cat. \n\nI'm trying to save in order to afford something I've wanted for a very long time and it has been my dream, but it's so hard. Don't be like me. \n\nBest wishes.",
      "created_utc": 1696887242.0,
      "score": 5,
      "context": [
        {
          "id": "k46owil",
          "author": "xStingx",
          "body": "Mine put me in so much debt I had to move back in with my mom.",
          "created_utc": 1696885667.0
        },
        {
          "id": "k46qtk5",
          "author": "No-Show8369",
          "body": "i swear that’s gonna be a near future for me and I just moved out this year ugh.. sending hugs",
          "created_utc": 1696886384.0
        }
      ]
    }
  ]
}