{
  "id": "17m95p1",
  "subreddit": "bulimia",
  "author": "Awkward_Tough6103",
  "created_utc": 1698947087.0,
  "title": "Anyone else sometimes actually consider trading bulimia for drug addiction?",
  "selftext": "So I’m well aware that it probably doesn’t work this way and drug addiction is probably just as worse but I am so sick and tired of bulimia and this life that I actually consider just turning to drugs to make life more bearable and at least I might be skinny and maybe I’ll die of drug abuse and that will be fine too. Anyone can relate?\n\nEdit: thank you so much for all the responses. It’s a relief to see that there’s more people that struggle with the same idea. But also its very helpful to have people share their experiences. It’s clear to me now that adding a drug addiction won’t help me a single bit, it will only make things so much worse. Ofcourse my ‘healthy’ brain already knew this but my disordered brain makes it seem so appealing. And apparently I’m not alone in this. However, it won’t make bulimia go away and probably just ruin things more. I hope anyone who reads this is safe and know you are not struggling alone. Sorry life puts you through this, sending love to y’all ",
  "url": "https://www.reddit.com/r/bulimia/comments/17m95p1/anyone_else_sometimes_actually_consider_trading/",
  "score": 109,
  "num_comments": 48,
  "comments": [
    {
      "id": "k7kaisb",
      "author": "bee102019",
      "body": "People who try to do this almost always just end up with two addictions instead of one.",
      "created_utc": 1698959995.0,
      "score": 95,
      "context": []
    },
    {
      "id": "k7jij8f",
      "author": "tinkerbell10210",
      "body": "Honestly I’m not proud to admit it but I relate. I’ve been purging multiple times a day now after my relapse and it’s fckin hell. All I can think about is my next session…and I don’t even want to keep down my 1 normal safe food meal I have per day anymore. It’s so unbearable.",
      "created_utc": 1698949874.0,
      "score": 21,
      "context": []
    },
    {
      "id": "k7kcxra",
      "author": "poisonedminds",
      "body": "I have this thought WAYY too often. \n\nOne food binge costs me like 65$. One ketamine binge costs like 20$.\n\nBut I know that I would most likely just end up with two addictions .",
      "created_utc": 1698960895.0,
      "score": 22,
      "context": []
    },
    {
      "id": "k7kp1yl",
      "author": "Practical_Listen_412",
      "body": "yes. Adderall would be my drug of choice lmao. I don't even want to talk about how serious I am about it.",
      "created_utc": 1698965598.0,
      "score": 18,
      "context": []
    },
    {
      "id": "k7kpsz6",
      "author": "Top-Secret-8554",
      "body": "I did that and it was the worst trade deal in the history of trade deals, probably ever",
      "created_utc": 1698965894.0,
      "score": 15,
      "context": []
    },
    {
      "id": "k7k7mde",
      "author": "LowEmployee4771",
      "body": "It’s not hard to think about bulimia is an addiction we are just as bad as drug addicts just in another way. Bulimia takes all your money, ruins relationships, ruins your body..and can kill you. At the end of the day most people with EDs have an addictive personality we just chose food.",
      "created_utc": 1698958930.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k7ksfvb",
      "author": "sunshinesparkle95",
      "body": "Sadly it doesn’t work that way. Tried that approach in my teens/early 20s. The stimulants most consider for weight loss will do horrible damage to your cardiovascular system which is already strained from purging. \n\nI had 2 “unexplained strokes” a few years ago and it wasn’t worth being a size 00. Don’t do it :/",
      "created_utc": 1698966947.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k7kxfcg",
      "author": "Rytlane",
      "body": "I did speed & coke for a while. The crazy thing was that not only did it keep me skinny, but it made me forget about my body insecurities & even the desire to purge. I think for this reason its sooo dangerous. I became pregnant soon after so i immediately gave up every vice so my baby could be healthy. (He was). Otherwise I'm afraid i really could've spiralled into that addiction too & i think it would've been way worse.",
      "created_utc": 1698968939.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k7mqrj2",
      "author": "you_enjoy_my_yoga",
      "body": "I have been going back and forth for the past 10 years. When I first started taking x (im not going to say what I was taking because I don’t want anyone to get any ideas), it was the first time I got my bulimia under control. It actually made my addiction to x seem not so bad, because every time I would try to stop, I would fall right back into the bp cycle. But the addiction got so bad. It ruined my life and brain in ways that my ED never could. When I finally detoxed and went to rehab (and went though traumatic withdrawals, including seizures), I was at my lowest weight ever, was weaker because of my years with bulimia, and my body could barely handle it. The eating disorder was right there waiting for me. It’s another addiction. I purged the day I got out of rehab, and gained 20 pounds within 3 months. It is not worth it. Drugs can ruin you in ways you never thought possible, in ways you can never recover from, it can change your personality, and worst of all, when you finally quit, the bulimia will be right there waiting for you. Adding drugs just meant one more near addiction that I had to recover from. Be safe.",
      "created_utc": 1699006596.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k7lkfrn",
      "author": "EstablishmentNeat591",
      "body": "This could be my life story. Severe Ed’s 14-24. Severe drug addiction, 27-29.5, 31-35(now). Do not recommend.",
      "created_utc": 1698978268.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7o65e0",
      "author": "auroratimr",
      "body": "I often feel like this ... There are times when I feel so much hopelessness and desperation that I think being reliant on weed or alcohol would at the very least keep me away from the urge to binge and purge. Plus it feels pleasant so bonus points for pleasure haha. But, at the end of the day it's just a temporary, shitty coping mechanism that makes things worse in the long-run, right? The desperation of being fed up with binging makes the idea seem nice in the moment, but it's just a shitty distraction that can never get rid of the root issue",
      "created_utc": 1699029585.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7kbsxj",
      "author": "MysteriousKale8289",
      "body": "Have both! So fun! Trust! /sarcasm.",
      "created_utc": 1698960468.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k7lqpwh",
      "author": "winnie_dapoohh",
      "body": "lowkey think ab this nonstop;’",
      "created_utc": 1698981048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7phjw2",
      "author": "oppossumshoe",
      "body": "You guys don't already have drug addictions?",
      "created_utc": 1699047167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7q9rtf",
      "author": "triciani23",
      "body": "Yeah now I’m a severe alcoholic as well. My last blood test showed cirrhosis. Great. And then there’s all the damage I’ve done due to anorexia followed by bulimia from ages 12-39 (current).",
      "created_utc": 1699058934.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7rb5yc",
      "author": "wh0thi5",
      "body": "Done this and can confirm it did not solve the bulimia. Neither uppers nor downers nor a combination of both stopped the urges to b/p. Some drugs made it so I couldn’t binge as much, but the intent and outcome were effectively the same. I liked the drugs that had a side effect of nausea/vomiting the most bc I wouldn’t even have to make myself throw up my body would just do it for me. And with no impulse control I couldn’t even somewhat regulate when I did it.",
      "created_utc": 1699079500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku4pw0l",
      "author": "None",
      "body": "yup. got tired of constantly purging so i did stimulants which kept me thinner than when i was in my ed. best part is i didn’t even have to try to burn any of it off, it gave me the body of my dreams. but then i got addicted to meth & that was when my life when downhill. one of the darkest times of my life, but hey! atleast i was skinny. i realized that i couldn’t be sober if i didn’t address the underlying root cause of my drug use, which partly was my eating disorder. today im a year & a half clean. as someone else said, there’s no “trading” one addiction for another, you’ll just end up with both an eating disorder and a substance abuse problem. that’s much harder to get out of",
      "created_utc": 1710019989.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7wemrp",
      "author": "None",
      "body": "It doesn’t work. That’s my experience. It’s easy to just skip doses of meds and b/p. Or take them and b/p anyway. Not really a trade it’s just adding another layer to it.",
      "created_utc": 1717982755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7k72c2",
      "author": "sacha-sacha",
      "body": "yes felt",
      "created_utc": 1698958731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7khung",
      "author": "CrayonDinosauce",
      "body": "I mean, I dealt with both simultaneously for a few years.It's not a solution.",
      "created_utc": 1698962749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7lvgio",
      "author": "Waterysoap_",
      "body": "I tried it before, thank god it didn’t work",
      "created_utc": 1698983332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7m9lb1",
      "author": "Nebion666",
      "body": "Ive considered doing drugs to lose weight, thankfully ive not been quite that desparate yet. I also dont have the means to acquire that stuff.",
      "created_utc": 1698992474.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7mbp5v",
      "author": "None",
      "body": "I did. Now my lungs are fucked after 5 years hard use. I’m really sad about it. But no severe bulimia, and life is absolutely better.",
      "created_utc": 1698994158.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7migph",
      "author": "Illustrious-Fish5547",
      "body": "Same place",
      "created_utc": 1698999880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7mih3q",
      "author": "kittyoats",
      "body": "No, I think drugs are much worse than this disease and I definitely DONT recommend",
      "created_utc": 1698999889.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7moiwt",
      "author": "umbillionthhuman",
      "body": "i do. i flip back and forth between bulimia and ketamine. i’ll get sick (no pun intended) of bulimia, start using ketamine (kills binge-brain). after a while of using ketamine, i’d have lost weight and i’ll think “ok, i haven’t b/ped in x weeks, i’ve broken the cycle”. i’ll stop using k, go back to restricting, then binge within the next few days. i’ll try to fight it, but again the cycle continues. i’m on the k again now, 3 days b/p free, but i don’t leave my house (won’t drug and drive) and everything has become boring unless i’m on k",
      "created_utc": 1699004899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7nmfka",
      "author": "FayrisDraconis",
      "body": "Oh I did that, I still purged, I did it for 6 months, yes I lost weight but I also lost my family, friends and even after years being sober, my mind feel cloudy, I can't concentrate or remember things at all.\n\nIt mentally crippled me, I nearly died, my heart never recovered.\n\nBad, bad decision.",
      "created_utc": 1699022317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7np03b",
      "author": "FayrisDraconis",
      "body": "Oh I did that, I still purged, I did it for 6 months, yes I lost weight but I also lost my family, friends and even after years being sober, my mind feel cloudy, I can't concentrate or remember things at all.\n\nIt mentally crippled me, I nearly died, my heart never recovered.\n\nBad, bad decision.",
      "created_utc": 1699023291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7nqxww",
      "author": "addyangel26",
      "body": "im someone who has struggled with bulimia at 13 to current (20) and also went to rehab two times before hs graduation due to stimulant use that almost took my life on multiple occasions. one of the big reasons i loved stimulants was because it made me lose so much weight. but i can say, now that im sober, i went right back to restriction and bulimia. it just pauses the problem to swap out for another, and if youre lucky enough to get out you just go back anyway to replace that habit that causes weight loss",
      "created_utc": 1699024023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7nterg",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1699024946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7o3sso",
      "author": "Aricatzz",
      "body": "I have had bulimia since I was 16. I’m 26 now, I struggled with meth, coke, mdma. Nothing could compare to the hole I was in while in active drug addiction. It’s lonely, expensive, crippling, and the worst of the worst. Bulimia is no better but I highly suggest never turning to drugs. That is an addiction you either come out sober or end up dead. In the end always choose recovery.",
      "created_utc": 1699028719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7peb77",
      "author": "Blondediary",
      "body": "Yesss",
      "created_utc": 1699045912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pqx03",
      "author": "Extension_Size8422",
      "body": "I've considered alcohol as a coping mechanism many times instead of binging mostly cos drugs are illegal and I don't wanna risk that and is super expensive too. But alcohol has still has cals and IDK if it'd stop me binging food anyway. Bulimia still seems to be the lowest harm addiction (it just gets in the way of the whole weight loss thing yah) health-wise for me personally.",
      "created_utc": 1699050955.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7qngud",
      "author": "Vicariouslylivin",
      "body": "Never. \nBut I used to find NA more of a supportive environment to be around than OA. If they could kick heroin I can kick my silly little behaviours.\n\nIt helped.",
      "created_utc": 1699065167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7vedto",
      "author": "Blugurrl",
      "body": "I sometimes feel if I was an alcoholic at least I would have a lot of support options and social interaction, whereas with ED the groups are hard to find, most don't focus on Bulimia and very few people, very lonely and isolating this disorder. But drinking has too many calories and I don't like being hungover, and I never could do drugs. Plus I know it would make things worse. But I know why people do drugs to kill the pain of life. I wish I had another kind of escape.",
      "created_utc": 1699148570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k82wdh0",
      "author": "JanesThoughts",
      "body": "Anorexia to alcohol to weed to cocaine to vyvanse to bulimia to anorexia to bulimia and vyvanse … you’re not getting out…",
      "created_utc": 1699285019.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kcm93jb",
      "author": "No-Confection-3024",
      "body": "I wish addictions could be just swapped lol",
      "created_utc": 1702117854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7krfsd",
      "author": "smokerintherye",
      "body": "THIS.\n\nbeen there, done that, ended up with bonus problems rather than trading one in for another 🥲",
      "created_utc": 1698966549.0,
      "score": 28,
      "context": [
        {
          "id": "k7kaisb",
          "author": "bee102019",
          "body": "People who try to do this almost always just end up with two addictions instead of one.",
          "created_utc": 1698959995.0
        }
      ]
    },
    {
      "id": "k7l6pht",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1698972610.0,
      "score": 24,
      "context": [
        {
          "id": "k7kaisb",
          "author": "bee102019",
          "body": "People who try to do this almost always just end up with two addictions instead of one.",
          "created_utc": 1698959995.0
        }
      ]
    },
    {
      "id": "k7qnkgq",
      "author": "Vicariouslylivin",
      "body": "This is it.",
      "created_utc": 1699065215.0,
      "score": 1,
      "context": [
        {
          "id": "k7kaisb",
          "author": "bee102019",
          "body": "People who try to do this almost always just end up with two addictions instead of one.",
          "created_utc": 1698959995.0
        }
      ]
    },
    {
      "id": "ku4q3mr",
      "author": "None",
      "body": "yes this is exactly what fueled me to keep doing all sorts of stimulants, but especially crystal meth",
      "created_utc": 1710020065.0,
      "score": 1,
      "context": [
        {
          "id": "k7kxfcg",
          "author": "Rytlane",
          "body": "I did speed & coke for a while. The crazy thing was that not only did it keep me skinny, but it made me forget about my body insecurities & even the desire to purge. I think for this reason its sooo dangerous. I became pregnant soon after so i immediately gave up every vice so my baby could be healthy. (He was). Otherwise I'm afraid i really could've spiralled into that addiction too & i think it would've been way worse.",
          "created_utc": 1698968939.0
        }
      ]
    },
    {
      "id": "k7rv70y",
      "author": "Awkward_Tough6103",
      "body": "Thank you for sharing your story. I hope you’re doing okay and safe ❤️",
      "created_utc": 1699095874.0,
      "score": 1,
      "context": [
        {
          "id": "k7mqrj2",
          "author": "you_enjoy_my_yoga",
          "body": "I have been going back and forth for the past 10 years. When I first started taking x (im not going to say what I was taking because I don’t want anyone to get any ideas), it was the first time I got my bulimia under control. It actually made my addiction to x seem not so bad, because every time I would try to stop, I would fall right back into the bp cycle. But the addiction got so bad. It ruined my life and brain in ways that my ED never could. When I finally detoxed and went to rehab (and went though traumatic withdrawals, including seizures), I was at my lowest weight ever, was weaker because of my years with bulimia, and my body could barely handle it. The eating disorder was right there waiting for me. It’s another addiction. I purged the day I got out of rehab, and gained 20 pounds within 3 months. It is not worth it. Drugs can ruin you in ways you never thought possible, in ways you can never recover from, it can change your personality, and worst of all, when you finally quit, the bulimia will be right there waiting for you. Adding drugs just meant one more near addiction that I had to recover from. Be safe.",
          "created_utc": 1699006596.0
        }
      ]
    },
    {
      "id": "ku4q7fs",
      "author": "None",
      "body": "this.",
      "created_utc": 1710020103.0,
      "score": 1,
      "context": [
        {
          "id": "k7mqrj2",
          "author": "you_enjoy_my_yoga",
          "body": "I have been going back and forth for the past 10 years. When I first started taking x (im not going to say what I was taking because I don’t want anyone to get any ideas), it was the first time I got my bulimia under control. It actually made my addiction to x seem not so bad, because every time I would try to stop, I would fall right back into the bp cycle. But the addiction got so bad. It ruined my life and brain in ways that my ED never could. When I finally detoxed and went to rehab (and went though traumatic withdrawals, including seizures), I was at my lowest weight ever, was weaker because of my years with bulimia, and my body could barely handle it. The eating disorder was right there waiting for me. It’s another addiction. I purged the day I got out of rehab, and gained 20 pounds within 3 months. It is not worth it. Drugs can ruin you in ways you never thought possible, in ways you can never recover from, it can change your personality, and worst of all, when you finally quit, the bulimia will be right there waiting for you. Adding drugs just meant one more near addiction that I had to recover from. Be safe.",
          "created_utc": 1699006596.0
        }
      ]
    },
    {
      "id": "k82wqf7",
      "author": "JanesThoughts",
      "body": "Same",
      "created_utc": 1699285155.0,
      "score": 1,
      "context": [
        {
          "id": "k7q9rtf",
          "author": "triciani23",
          "body": "Yeah now I’m a severe alcoholic as well. My last blood test showed cirrhosis. Great. And then there’s all the damage I’ve done due to anorexia followed by bulimia from ages 12-39 (current).",
          "created_utc": 1699058934.0
        }
      ]
    },
    {
      "id": "k82wi2r",
      "author": "JanesThoughts",
      "body": "Is ketamine addictive??? I WAS JUST ABOUT TO START",
      "created_utc": 1699285067.0,
      "score": 1,
      "context": [
        {
          "id": "k7moiwt",
          "author": "umbillionthhuman",
          "body": "i do. i flip back and forth between bulimia and ketamine. i’ll get sick (no pun intended) of bulimia, start using ketamine (kills binge-brain). after a while of using ketamine, i’d have lost weight and i’ll think “ok, i haven’t b/ped in x weeks, i’ve broken the cycle”. i’ll stop using k, go back to restricting, then binge within the next few days. i’ll try to fight it, but again the cycle continues. i’m on the k again now, 3 days b/p free, but i don’t leave my house (won’t drug and drive) and everything has become boring unless i’m on k",
          "created_utc": 1699004899.0
        }
      ]
    },
    {
      "id": "k82wo0h",
      "author": "JanesThoughts",
      "body": "Yes!!!",
      "created_utc": 1699285129.0,
      "score": 1,
      "context": [
        {
          "id": "k7nterg",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699024946.0
        }
      ]
    },
    {
      "id": "k7l8220",
      "author": "Apathetic_Bourbon",
      "body": "Mine is the reverse 😭. Alcohol before , now smoking . Texting with a back pain and a shortness of breath atm 😭😭",
      "created_utc": 1698973132.0,
      "score": 5,
      "context": [
        {
          "id": "k7kaisb",
          "author": "bee102019",
          "body": "People who try to do this almost always just end up with two addictions instead of one.",
          "created_utc": 1698959995.0
        },
        {
          "id": "k7l6pht",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1698972610.0
        }
      ]
    }
  ]
}