{
  "id": "17mzpoz",
  "subreddit": "bulimia",
  "author": "Evening-Share5742",
  "created_utc": 1699030877.0,
  "title": "How long have you been bulimic?",
  "selftext": "I'm just curious, how long has everyone struggled with bulimia? I'm a 39 year old female and I've been bulimic for 26 years (since 13). I think the longest I've ever gone without b/p was 22 days. My worst periods were freshman year of college, 2 years ago, and right now. I'm also a recovering alcoholic (sober 3 years, after 13 years of daily drinking). I feel really trapped in the cycle, and I don't know what to do. I'm so sneaky. Lately I have spent an obscene amount of money on food that literally goes down the toilet. I'm not sure how much longer I can physically or mentally do this. I'm in AA and another 12 step program and I see a therapist. I honestly don't know what my problem is.",
  "url": "https://www.reddit.com/r/bulimia/comments/17mzpoz/how_long_have_you_been_bulimic/",
  "score": 83,
  "num_comments": 79,
  "comments": [
    {
      "id": "k7oobyq",
      "author": "candyred1",
      "body": "Started when I was 13, I turned 47 in September. So 34 years and counting. Longest I have gone \"clean\" was about 2-3 months which was due to the fact that I had cancer (late 2021-early 2022), in my sinus cavity, and the chemo and esp radiation to my face... I literally lost ALL taste. Dry mouth that caused sores, if I did eat I couldnt handle most things and involuntarily vomited. Very very rare type of Lymphoma (NK/T Cell).\n\nCauses? Nobody can say for sure. But, 8 years of horrible emotional and verbal abuse from my husband, seriously comprised my immune system no doubt. All the years with Bulimia and yeah sometimes the vomit goes up into the sinus cavity. Periodic drug and alcohol use (which is litrrally a given for the vast majority of us with ED) over my younger years,  then some. Perfect storm I guess. \n\nI have read many medical articles stating the growing prevelence of \"older\" women with EDs. Also, somewhere was mentioned that people with Bulimia have shown to have a much higher pain tolerance than those without any ED.",
      "created_utc": 1699036266.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k7payyb",
      "author": "Hairy_Valuable9773",
      "body": "I’m 41 and have struggled with it since I was 15. This is the longest I’ve gone without b/p - it’s been since March. I had a dream the other night that I did it as a stress relief and when I woke up, I was terrified that it did it in real life. I think I just got sick of doing it. Hiding it, worrying what it was doing to my insides, thinking it was always an option… I was just exhausted of it. Don’t get me wrong, I still have the urge but it gets to be less and less the longer I go without. I’m scared that something monumental will trigger it again. This is the longest I’ve gone without doing it in 26 years :(",
      "created_utc": 1699044649.0,
      "score": 25,
      "context": []
    },
    {
      "id": "k7odlj8",
      "author": "None",
      "body": "It’s addictive that’s why you keep coming back to it. I’ve realised this recently, any form of disordered behaviour is my go to because it’s hope o cope with any stress in my life. No clue how you get over that though, probably worth talking to your therapist about it.",
      "created_utc": 1699032318.0,
      "score": 17,
      "context": []
    },
    {
      "id": "k7p5a53",
      "author": "None",
      "body": "This post forced me to realize it’s been almost 15 years",
      "created_utc": 1699042541.0,
      "score": 17,
      "context": []
    },
    {
      "id": "k7pqlym",
      "author": "dosginf",
      "body": "These comments are such a slap to the face. I’m only 16 and to think that some of you have been bulimic longer then I’ve been alive.",
      "created_utc": 1699050826.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k7og9nj",
      "author": "OkaP2",
      "body": "19 years and I can’t stop",
      "created_utc": 1699033304.0,
      "score": 10,
      "context": []
    },
    {
      "id": "k7phwbh",
      "author": "Thegirlwholived808",
      "body": "Are you me?  I’m in substance abuse recovery as well.  Feel free to message me if you want to try support each other through this",
      "created_utc": 1699047306.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k7oiftr",
      "author": "Blessisk",
      "body": "Definitely talk to your therapist about these feelings! I would say even show them this post. I know you feel trapped, but the fact that you are three years sober after 13 years of daily drinking shows the willpower, strength, and ability that you have. I’m  a recovering alcoholic myself, daily for 4 years. It’s HARD stopping, so please believe me when I say that I am so impressed and I am so proud. Lots of people say that changing ur routine can help, that’s something you can try until your next session maybe? Like going out, watching a different show, showering at a different time, and sleeping earlier are a few examples that come to mind.\n\nEdit: I feel it’s rude not to answer the question. I started purging at around 11. I was at my worst at about 15. I “recovered” at around 19, but struggle with disordered eating still.",
      "created_utc": 1699034098.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k7qiki4",
      "author": "CulturedSnail35",
      "body": "I discovered purging when I was 11 or 12-and it felt like such a huge relief. I had been overweight-and purging allowed to continue me to seek comfort in food from the belittling meanness of my alcoholic mother and the sheer loneliness. I’ll be 55 soon and my breaks have been occasional, but the weight gain from recovery attempts have been too scary and I end up relapsing",
      "created_utc": 1699062903.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k7or5tk",
      "author": "No-Nectarine5490",
      "body": "I became in January 2023 but I vomited like 3 times a month and I stopped at March and 2 weeks ago my bulimia episodes returned and I vomit 2 times a week. I don't know if this counts as bulimia but yes I binge before I vomit",
      "created_utc": 1699037308.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k7oy956",
      "author": "InsaneChick35",
      "body": "Started around covid, so about 3 years",
      "created_utc": 1699039924.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k7pnxuh",
      "author": "Informal-Ad-7356",
      "body": "I suffered for 35 years until I attempted Recovery.  One relapse, now I'm in Recovery for 2nd year.  There's no magic pill... we have to actively, On purpose seek Recovery and do the hard things: eat the food, digest the food, sit with the uncomfortable,  buy bigger clothes if needed, get rid of all clothes that don't fit the new recovered body,  stop weighing...all the hard things.   Then slowly the hard things become the new normal.  And then the blessed mental Peace arrives, and food and body are no longer center stage.   Life is.",
      "created_utc": 1699049726.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k7pm8an",
      "author": "poisonedminds",
      "body": "I have had disordered eating from a very young age, purged for the first time at 13.\n\nThat was 8 years ago. I don't think I'll ever recover.",
      "created_utc": 1699049031.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k7pgspb",
      "author": "pacifistpugilist",
      "body": "I've (30M( only been bulimic for the past year. Starting a few times a month until this past month where is has been every day. It's only been this past week where I've actually let myself admit it is a problem that I need to face and overcome.",
      "created_utc": 1699046872.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7qik7s",
      "author": "Professional_Ad5178",
      "body": "I stopped around 3 years ago. But prior to that I was bulimic for 17 years.",
      "created_utc": 1699062900.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7qkass",
      "author": "fadingaurora9828",
      "body": "I’m 36 and started restricting at 11 and purging at 13… so many similarities",
      "created_utc": 1699063699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7rz000",
      "author": "MysteriousKale8289",
      "body": "31 years with a couple of periods of remission during pregnancy (and now! Only three b/p since July!).",
      "created_utc": 1699098431.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7pdgsj",
      "author": "WxT_",
      "body": "currently 17, and I started when I was 15",
      "created_utc": 1699045587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7pebm1",
      "author": "Nebion666",
      "body": "4 years",
      "created_utc": 1699045917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7q75co",
      "author": "None",
      "body": "28 years. Holy fuck. \n\n\n\nThe longest I was \"clean\" was 9 months, and I was pregnant. I didn't don't then, but I sure as hell wanted to.",
      "created_utc": 1699057796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7qhiwh",
      "author": "Emotional_Memory_347",
      "body": "Started 10 years ago when I started a stressful job in my mid 20's and it lasted for about 2 years. Went 5 years without and recently had a relapse for a few weeks. It's been a month since then.\n\nI'm having trouble tonight, but I think I can make it. I hope I can because I have the opportunity to purge without my partner home, and I don't want to take it. Last month, I had a blood vessel pop in my eye, and my partner figured it out. It was embarrassing, especially with how many people see me at work. Now I'm scared to do that again. I started therapy, so I'm trying my best to fight.",
      "created_utc": 1699062422.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7rizoh",
      "author": "neilbreenfan404",
      "body": "I’m 20 right now and I’ve been dealing with my ED for a little over 13 years, since I was around six or seven years old (can’t remember exactly bc it’s just been a part of my life so long I’m not 100% sure when it started, but I know I was so young the first time I purged that I didn’t even know about the gag reflex). \n\nI have begun to question if it’s bulimia recently though because I don’t eat in super excessive amounts, but I do drink lots of water and milk and other drinks after and during meals and that kind of does the same thing, and I’ve messed up my intestines so much that a ‘normal’ amount of food makes me feel overfull so in my mind it feels like a binge. And I start eating knowing I’m going to purge after. I don’t think I restrict enough for it to be anorexia, at least not since high school, so idk where I fit in if that makes any difference as far as for what you’re wondering. I just know that I’ve never met anyone else who truly gets this experience, although it’s not like I talk to many people about it lol. I often feel trapped and hopeless as well. The longest I’ve been without relapsing was i want to say about 4 months just recently until two weeks ago. Honestly I often worry this is going to kill me. I feel like I’m just a ticking time bomb and at any time I could just drop dead while purging or pass out after eating and aspirate. I often feel sick after eating even small amounts, and I get dizziness and headaches so this is a fear I struggle with a lot. I may have a heart condition as well, still have some tests to do and everything, but it concerns me how hard and fast my heart pounds at times, after purging especially. It often feels as though I will never be able to not live like this. I mean it’s been so long that it’s invaded every part of my life, and no one around me even knows because I’ve been so secretive about it. It feels like giving up a part of myself. I haven’t purged any of my meals in about five days, which is good, but I def feel bad about eating and just letting it digest yk. \n\nPersonally, my plans are to see a therapist as soon as I can get an appointment scheduled, and I’m glad you have a therapist already, I would suggest being as honest with them about this as you can. They may be able to help with coping skills you may not be aware of, or offer more intensive treatment. I can’t find many in my area, but depending on where you are, you could look into support groups for bulimia and/or EDs in general. There are also online ones as well. You mentioned AA, so it’s sort of a similar type of thing, obviously a bit different, but still.\n\nI also have struggled with substance use, congrats on three years of sobriety btw!!! Especially after 13 years, that’s a huge accomplishment, even if you’re still struggling with bulimia. I only have about 3 months but I have been thinking about drinking again a lot lately. Not sure if I even have a problem with it yk, but I do know I need to be careful because I’m at risk. Just kind of wanting something else in lieu of the harmful cycle I get into with my ED. \n\nAnyway, all that said, I’m so sorry you’re struggling and have been for so long. It hasn’t been quite as long for me, but I can still understand the feelings of being trapped and not knowing what to do. I hope you can find some peace from this soon but I know it will likely be a long road to get there. \n\nWishing you the best!💛",
      "created_utc": 1699086067.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7rokpu",
      "author": "uhhhhhhhhii",
      "body": "For like 7 years I would occasionally purge when I felt like I had really overeaten, like once a month. About 4 months ago I couldn’t stand being this weight anymore and stared purging several times a day. I wouldn’t say I “binge” exactly but I do tend to overeat",
      "created_utc": 1699090767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7x5k2d",
      "author": "subangel99",
      "body": "It’s eerie that we are very similar.   I’m 39 also bulimic since 13.  Still an alcoholic though on my end.  Working through all of this for years.   Hoping one day to be free but I just seem doomed forever.  Glad you’re sober though.  That is an amazing accomplishment.",
      "created_utc": 1699188957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k833l7k",
      "author": "Juicystar77",
      "body": "I’ve had it for 30 years. I’m now 46 and had to spend thousands on new teeth and I have to wear wigs and other things to disguise my now ravaged hair. I can’t stop.  I love food and it’s constantly on my mind but I remain slim and so far , seemingly healthy. God knows I must have spent thousands over the years 🥲",
      "created_utc": 1699287737.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8eag9g",
      "author": "Wisewoman0920",
      "body": "Started restricting at 17-I’m 58 now. I’m a non purging type-I use exercise and fasting-My self worth and value we’re tied up in being thin. It was the 1980’s and Brooke Shields was in her Calvin Kleins and I was too! I was a model locally too. I started using alcohol and drugs at 12 and this combination was a perfect storm for an effed up life-\nI quit drinking many years ago but the bulimia continues to kick my ass! I’m heavy now but still binge and restrict and binge and so on! \nI have a therapist and tried anorexics and bulimics anonymous and now trying eating disorders anonymous…\nAs a 58 year old woman my advice is to get help as soon as you can because the longer bulimia is part of your life the harder it is to stop. \nThere were no services for ED’s in my “hick” province and still very few 30 years later. \nI’m bitter and feel hopeless at times but pray that I can stop-the only way that I know I can do it is by recovering with others who know what it’s like. \nNamaste, J",
      "created_utc": 1699471164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwkfif5",
      "author": "hotlawyer25",
      "body": "32 years. Started when I was 15 and stopped when I was 47. I'm now 48. I was also anorexic for many of those 30  plus years. The trigger for me stopping was I got really sick with pancreatitus and gall stones and needed gall bladder removed. I was also severely anemic from malnutrition and needed a blood transfusion before they could do surgery. Since the operation I somehow woke up to myself, and started eating normally from then on.\nI also during this time found a partner who accepted me as I was thought i never told him about my eating dispreders and kept it hidden (he actually preferred curves I think, but never said anything about my body, so I feel that also helped me.)\n\nIt's the biggest regret of my life, for 30 years I wasted my life away obsessed with food  could never have relationships  and lost jobs over this obsession. And when I started eating normally, I was so surprised that i never actually got \" fat\" which was my biggest fear, I just got to be a healthy weight.",
      "created_utc": 1749337229.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls4skey",
      "author": "healthanxiety1989",
      "body": "2 decades. Started at 14 I am 34 now.  My 1st decade mainly 14-21 was the worse, then less frequent. Last decade on and off and 7 months fully recovered. I've now found out I have fatty liver, back in May I did not.  I am borderline prediabetic  and going through a sjogrëns diagnosis. Not sure if it is all related or not. I am scared of this long term effects now that I am recovering. This is the longest I have gone without a single episode.",
      "created_utc": 1729041290.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjlghch",
      "author": "PlasticProfit9938",
      "body": "I’ve been bulimic for about 8 months now I keep getting into a cycle where I leave it and then I relapse it’s so awful. I’m only 17 I just turned 17,today my birthday.its been so hard recently I have been diagnosed with anerexia but my insurance was cut off so I wasn’t able to see my therapist anymore. I only met them once, it’s so see how people think them telling me just don’t do it is so easy. I want to keep going tho I love being skinny but I just wanna be thin so bad",
      "created_utc": 1742871736.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7opclt",
      "author": "Illustrious-Fish5547",
      "body": "3 years, 1 year clean but I had a relapse now I am stuck",
      "created_utc": 1699036641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7or343",
      "author": "NightMimeLarynx",
      "body": "Started at 16 and 22 now :(",
      "created_utc": 1699037280.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pkxxa",
      "author": "Blondediary",
      "body": "Only 6 years but Im positive I’ll never fully recover so we’re just adding every year",
      "created_utc": 1699048511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pm7s6",
      "author": "royceriel",
      "body": "2.5 years",
      "created_utc": 1699049026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pmju5",
      "author": "animalsexchange",
      "body": "Been on and off since Covid started🥲",
      "created_utc": 1699049162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pp87i",
      "author": "Extension_Size8422",
      "body": "Approaching two years. It feels like it's been my whole life though, I don't remember what having a normal relationship with food feels like anymore. Before that I had BED for 5 years.",
      "created_utc": 1699050255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7pzfbe",
      "author": "doom_canoe",
      "body": "I’ve been bulimic since 2019/2020 :( can’t seem to overcome it nor do I think I want to even though I’ve lost a few teeth",
      "created_utc": 1699054512.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7q000p",
      "author": "None",
      "body": "Bulimic for 13 years. I’m 26.",
      "created_utc": 1699054750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7qdzzf",
      "author": "MaximumSignature",
      "body": "11 years",
      "created_utc": 1699060821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7qedxe",
      "author": "___devilchild___",
      "body": "On and off, about 11 years.",
      "created_utc": 1699060993.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7qr7y0",
      "author": "mommy-Queerest",
      "body": "I’m 31. I started at 13 with restriction and subjective binges and purging, by 15 I was b/p regularly and by 16 I was treated for the first time. I’m one of the fortunate (and unfortunate) ones to have had access/been sent or coerced into treatment at multiple places over the last 15 years. Fortunate because so many don’t even have the opportunity, unfortunate because it hasn’t stuck even when I check myself in and try. My last absolutely major relapse was in 2021 and ended inpatient to res. I’m still purging a couple times a month no matter what I do. Therapy is great but it’s tough and I haven’t found a coping skill that comes close to matching a behavior. Sorry. I lost a baby in 2022 at 24 weeks and I think everyone on my treatment team expected me to go off the deep end postpartum but if anything I’m trying really hard for him.",
      "created_utc": 1699066988.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7r1ls4",
      "author": "Ok_You1594",
      "body": "Going on 6 years",
      "created_utc": 1699072761.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7r2h12",
      "author": "ArugalaStan",
      "body": "Just turned 40 and I’ve been bulimic since senior year of high school (16/17). I’ve had periods where I wouldn’t keep anything down. Then I’d go a few weeks without doing it. Lately, I’ve been eating once a day and sometimes I don’t keep that down",
      "created_utc": 1699073291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7r99ff",
      "author": "yopis2001",
      "body": "Like 7 or 8 years. I'm 22 but started ar around 14-15. By definition i don't think i was bulímic all those years but My habits change. But yeah at least all those years i've had disordered eating habits",
      "created_utc": 1699078003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7rj54n",
      "author": "Salt_Negotiation_334",
      "body": "I have been bulimic since 12/13 and I am 27 now. So about 14 years. My longest time being clean was right after high school. High school truly was hell for me due to being autistic. Getting bullied and harassed for something that you will never be able to change about yourself is a horrible kind of experience and when I finally got out of that, I had a brief periode of bliss. \n\nI think my bulimia mostly stems from childhood neglect and partly due to my autism. Eating disorders and autism kinda go hand in hand.",
      "created_utc": 1699086195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7rqqoa",
      "author": "whyhellotheresportsy",
      "body": "since i was 13 but i started doing it on regular during pandemic and its still going so",
      "created_utc": 1699092535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7rsz9j",
      "author": "Casslynnicks880",
      "body": "I realized the other day I’ve been doing this for about 15yrs, it’s messed up my body so much but I don’t know how to stop it",
      "created_utc": 1699094250.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7rzh7f",
      "author": "0hbuggerit",
      "body": "16 years, since I was 15.\n\nThis year is the closest I've come to recovery, though I attribute that to good therapy and support. It's not gone away, but I could count my \"bad days\" on both hands in the past 6 months. Rather than the daily occurrence it was before.",
      "created_utc": 1699098735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7s4l2t",
      "author": "selfishcoffeebean",
      "body": "Have you tried a SMART meeting group?",
      "created_utc": 1699101661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7s68ak",
      "author": "daisyelisabee",
      "body": "It’s been officially 10 years for me, started when I was 14 going on 15, now I’m 25, and have been working really hard to stop because I’m scared of this going on any longer and destroying my body beyond repair, though I’m sure enough damage has been done in 10 years. I want to know a life outside of my ED again. I can’t say how long I’ve gone without was, because now I’ll have a handful of days where I’m good, and then a few days of slipping back, I can’t keep track. Luckily those slipping days have been much more minimal in the last year then the b/ping id do everyday for 9 straight years.",
      "created_utc": 1699102495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ufa8c",
      "author": "Good_Vegetable8960",
      "body": "I started gyming obsessively at 13 and by 14 or 15 I discovered b/p. I have been struggling with it on and off since then. I also started smoking weed at 13 and it caused the binge eating to start. I’m now 20. It’s at its worst right now and it is killing me physically and mentally and I don’t know what to do. Every morning I wake up, my roommate goes to work and I plan to eat something and not P but it always turns into a b/p and then I go to work, come home, drink, sometimes b/p again and do it all over again the next day. I recently moved out on my own and also ended a relationship at the same time. It is much more convenient now and I think that’s why it has gotten out of hand. And I used to hate drinking but recently started because I can’t handle this mental pain anymore. And yeah the money I spend on food that I just waste is a huge stressor for me every day. I’m sorry you are going through this.",
      "created_utc": 1699134234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7v1iix",
      "author": "SaturnFlyTrap",
      "body": "I had it probably for 10 years. Been almost 5 years b/p free. I feel annoying because I always rolled my eyes at people who said that in drug addiction recovery (which I also have) but it IS possible",
      "created_utc": 1699143248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7v47nf",
      "author": "betweengayandstr8",
      "body": "I'm not bulimic I just find this sub extremely interesting",
      "created_utc": 1699144344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7vdboc",
      "author": "Blugurrl",
      "body": "Started at 13, stopped at 18 too many people around in college, relapsed at 20, stopped again until 33, got fat as a house, Had my heart broken. After break up I went to OA which triggered my relapse of purging and started again at 33 got super skinny loved it but wasn't sustainable so weigh more now but B/P hasn't stopped and over 50. I at the point where I don't care anymore. It would be nice not to worry about food and my body but finding help is expensive. I am lonely and alone, no support system, eating is all I have.",
      "created_utc": 1699148119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7w0kj5",
      "author": "Fine-Aside1789",
      "body": "41 and I'm somewhere around ten or eleven years.  Binged long before that and substance abuse intertwined in there.  Makes me sad when I see the higher numbers.  I keep thinking I'm going to at some point get so tired of this I'll have no choice but to stop.  That there's no way I can make it another year but realistically this hell can go on and on and on",
      "created_utc": 1699159332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8054k8",
      "author": "Adventurous_Sail_673",
      "body": "A decade for me, the only times I’ve been free from purging is when I was addicted to meth/alcohol 🥲 I’m close to losing hope tbh, I’ve been through intensive therapy and various meds way too many times without any actual progress.",
      "created_utc": 1699229706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k85c79s",
      "author": "spooonfairy",
      "body": "15 years give or take",
      "created_utc": 1699317171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9a7m0g",
      "author": "AquaticOwl64",
      "body": "12 years since I was 18. I'm really scared I won't be able to have kids. I lost my period for 7 months this year and it came back but very light. Now it's again almost 2 months with no period. This is my main motivation to stop but it's still not enough.",
      "created_utc": 1700005024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7opmqq",
      "author": "candyred1",
      "body": "Also wanted to say: read In The Realm Of Hungry Ghosts by Dr. Gabor Mate.\n\nI completely disagree with AA/NA, all of it. When I found this book it explained just what I had felt for so long about 12 steps and all that.\n\nEating disorders, drug and alcohol use/addiction... Any addiction...yes is just a symptom not the root problem.",
      "created_utc": 1699036743.0,
      "score": 18,
      "context": [
        {
          "id": "k7oobyq",
          "author": "candyred1",
          "body": "Started when I was 13, I turned 47 in September. So 34 years and counting. Longest I have gone \"clean\" was about 2-3 months which was due to the fact that I had cancer (late 2021-early 2022), in my sinus cavity, and the chemo and esp radiation to my face... I literally lost ALL taste. Dry mouth that caused sores, if I did eat I couldnt handle most things and involuntarily vomited. Very very rare type of Lymphoma (NK/T Cell).\n\nCauses? Nobody can say for sure. But, 8 years of horrible emotional and verbal abuse from my husband, seriously comprised my immune system no doubt. All the years with Bulimia and yeah sometimes the vomit goes up into the sinus cavity. Periodic drug and alcohol use (which is litrrally a given for the vast majority of us with ED) over my younger years,  then some. Perfect storm I guess. \n\nI have read many medical articles stating the growing prevelence of \"older\" women with EDs. Also, somewhere was mentioned that people with Bulimia have shown to have a much higher pain tolerance than those without any ED.",
          "created_utc": 1699036266.0
        }
      ]
    },
    {
      "id": "mccbwsz",
      "author": "Mysterious-Low-9409",
      "body": "How are you doing now?",
      "created_utc": 1739354360.0,
      "score": 1,
      "context": [
        {
          "id": "k7oobyq",
          "author": "candyred1",
          "body": "Started when I was 13, I turned 47 in September. So 34 years and counting. Longest I have gone \"clean\" was about 2-3 months which was due to the fact that I had cancer (late 2021-early 2022), in my sinus cavity, and the chemo and esp radiation to my face... I literally lost ALL taste. Dry mouth that caused sores, if I did eat I couldnt handle most things and involuntarily vomited. Very very rare type of Lymphoma (NK/T Cell).\n\nCauses? Nobody can say for sure. But, 8 years of horrible emotional and verbal abuse from my husband, seriously comprised my immune system no doubt. All the years with Bulimia and yeah sometimes the vomit goes up into the sinus cavity. Periodic drug and alcohol use (which is litrrally a given for the vast majority of us with ED) over my younger years,  then some. Perfect storm I guess. \n\nI have read many medical articles stating the growing prevelence of \"older\" women with EDs. Also, somewhere was mentioned that people with Bulimia have shown to have a much higher pain tolerance than those without any ED.",
          "created_utc": 1699036266.0
        }
      ]
    },
    {
      "id": "k7pp60v",
      "author": "None",
      "body": ">wow, since March?  Seriously impressive.  i HATE how its always an option, always in the back of your head like, \"well...i COULD\"  \n>  \n>but you're right, that thought becomes less and less the longer you go.",
      "created_utc": 1699050230.0,
      "score": 4,
      "context": [
        {
          "id": "k7payyb",
          "author": "Hairy_Valuable9773",
          "body": "I’m 41 and have struggled with it since I was 15. This is the longest I’ve gone without b/p - it’s been since March. I had a dream the other night that I did it as a stress relief and when I woke up, I was terrified that it did it in real life. I think I just got sick of doing it. Hiding it, worrying what it was doing to my insides, thinking it was always an option… I was just exhausted of it. Don’t get me wrong, I still have the urge but it gets to be less and less the longer I go without. I’m scared that something monumental will trigger it again. This is the longest I’ve gone without doing it in 26 years :(",
          "created_utc": 1699044649.0
        }
      ]
    },
    {
      "id": "k7rmjmi",
      "author": "Evening-Share5742",
      "body": "Wow, since March!? That is incredible. I agree with everything you said... especially thinking it is (or was in your case) always an option! I need to get rid of that mentality. Congratulations!",
      "created_utc": 1699089077.0,
      "score": 2,
      "context": [
        {
          "id": "k7payyb",
          "author": "Hairy_Valuable9773",
          "body": "I’m 41 and have struggled with it since I was 15. This is the longest I’ve gone without b/p - it’s been since March. I had a dream the other night that I did it as a stress relief and when I woke up, I was terrified that it did it in real life. I think I just got sick of doing it. Hiding it, worrying what it was doing to my insides, thinking it was always an option… I was just exhausted of it. Don’t get me wrong, I still have the urge but it gets to be less and less the longer I go without. I’m scared that something monumental will trigger it again. This is the longest I’ve gone without doing it in 26 years :(",
          "created_utc": 1699044649.0
        }
      ]
    },
    {
      "id": "k7r1d7g",
      "author": "Nuulytrip",
      "body": "SO impressive. Keep it up!!",
      "created_utc": 1699072617.0,
      "score": 1,
      "context": [
        {
          "id": "k7payyb",
          "author": "Hairy_Valuable9773",
          "body": "I’m 41 and have struggled with it since I was 15. This is the longest I’ve gone without b/p - it’s been since March. I had a dream the other night that I did it as a stress relief and when I woke up, I was terrified that it did it in real life. I think I just got sick of doing it. Hiding it, worrying what it was doing to my insides, thinking it was always an option… I was just exhausted of it. Don’t get me wrong, I still have the urge but it gets to be less and less the longer I go without. I’m scared that something monumental will trigger it again. This is the longest I’ve gone without doing it in 26 years :(",
          "created_utc": 1699044649.0
        }
      ]
    },
    {
      "id": "k7s3u3p",
      "author": "foamcrestedbrine",
      "body": "Seriously, the sooner you can try to tackle this the more chance you have of leading a normal life without it ❤️\n\nReally wish you the best. I started my disordered behaviours around 15 and am 41 now, about to go into outpatient treatment for the second time. Without anyone in my life knowing about it at all. My EDs have always ruled my life at this point :( \n\nAnd it’s very isolating. The secret double life I have to maintain stops me feeling truly close to or know by anyone",
      "created_utc": 1699101261.0,
      "score": 3,
      "context": [
        {
          "id": "k7pqlym",
          "author": "dosginf",
          "body": "These comments are such a slap to the face. I’m only 16 and to think that some of you have been bulimic longer then I’ve been alive.",
          "created_utc": 1699050826.0
        }
      ]
    },
    {
      "id": "k7s7108",
      "author": "daisyelisabee",
      "body": "I got put into inpatient when I was 15, 10 years ago, and my disorder was very very new. I wish more than anything I had taken the help I was given seriously, I would’ve saved myself from losing my teeth, erosive gastritis and the possibility that I’ll develop cancer in my esophagus. Try to help yourself now please.",
      "created_utc": 1699102899.0,
      "score": 3,
      "context": [
        {
          "id": "k7pqlym",
          "author": "dosginf",
          "body": "These comments are such a slap to the face. I’m only 16 and to think that some of you have been bulimic longer then I’ve been alive.",
          "created_utc": 1699050826.0
        }
      ]
    },
    {
      "id": "k7qv6jc",
      "author": "HerElectronicHaze",
      "body": "Over 20 years in my case",
      "created_utc": 1699069059.0,
      "score": 2,
      "context": [
        {
          "id": "k7pqlym",
          "author": "dosginf",
          "body": "These comments are such a slap to the face. I’m only 16 and to think that some of you have been bulimic longer then I’ve been alive.",
          "created_utc": 1699050826.0
        }
      ]
    },
    {
      "id": "lnybza4",
      "author": "Big-Candy893",
      "body": "This should be your wake up call to get help to reach out to whoever you can. To stop before it gets this bad or when you are forced to stop due to illness. You can do it. You are more than a number on a scale ❤️",
      "created_utc": 1726781116.0,
      "score": 1,
      "context": [
        {
          "id": "k7pqlym",
          "author": "dosginf",
          "body": "These comments are such a slap to the face. I’m only 16 and to think that some of you have been bulimic longer then I’ve been alive.",
          "created_utc": 1699050826.0
        }
      ]
    },
    {
      "id": "k7qx8zx",
      "author": "Slms7301",
      "body": "Wow!   You just gave me hope!   Began at age 16 and im about to be 51     Maybe a silly question but did u stop cold turkey or wean off slowly??    Ty",
      "created_utc": 1699070206.0,
      "score": 3,
      "context": [
        {
          "id": "k7pnxuh",
          "author": "Informal-Ad-7356",
          "body": "I suffered for 35 years until I attempted Recovery.  One relapse, now I'm in Recovery for 2nd year.  There's no magic pill... we have to actively, On purpose seek Recovery and do the hard things: eat the food, digest the food, sit with the uncomfortable,  buy bigger clothes if needed, get rid of all clothes that don't fit the new recovered body,  stop weighing...all the hard things.   Then slowly the hard things become the new normal.  And then the blessed mental Peace arrives, and food and body are no longer center stage.   Life is.",
          "created_utc": 1699049726.0
        }
      ]
    },
    {
      "id": "ls4sqsi",
      "author": "healthanxiety1989",
      "body": "What are your long term effects? Or what initial things did you deal with? This is the longest I have gone without a single episode (7 months) and health issues keep coming up.",
      "created_utc": 1729041357.0,
      "score": 1,
      "context": [
        {
          "id": "k7qik7s",
          "author": "Professional_Ad5178",
          "body": "I stopped around 3 years ago. But prior to that I was bulimic for 17 years.",
          "created_utc": 1699062900.0
        }
      ]
    },
    {
      "id": "k7rqyq3",
      "author": "chompin_bits",
      "body": "Good for you, that must have been incredibly tough to maintain.\n\nPregnancy with an eating disorder is a total mindfuck -- the body changes so dramatically, cravings, nausea and fatigue all raging. The emotional toll is immense.",
      "created_utc": 1699092710.0,
      "score": 2,
      "context": [
        {
          "id": "k7q75co",
          "author": "None",
          "body": "28 years. Holy fuck. \n\n\n\nThe longest I was \"clean\" was 9 months, and I was pregnant. I didn't don't then, but I sure as hell wanted to.",
          "created_utc": 1699057796.0
        }
      ]
    },
    {
      "id": "k7qo208",
      "author": "Evening-Share5742",
      "body": "You can absolutely do it! I know the temptation of being alone, that gets me too. I hope you can recover from your relapse, this is a tricky thing we have to deal with. It's exhausting and just not worth it. Hugs to you!",
      "created_utc": 1699065451.0,
      "score": 2,
      "context": [
        {
          "id": "k7qhiwh",
          "author": "Emotional_Memory_347",
          "body": "Started 10 years ago when I started a stressful job in my mid 20's and it lasted for about 2 years. Went 5 years without and recently had a relapse for a few weeks. It's been a month since then.\n\nI'm having trouble tonight, but I think I can make it. I hope I can because I have the opportunity to purge without my partner home, and I don't want to take it. Last month, I had a blood vessel pop in my eye, and my partner figured it out. It was embarrassing, especially with how many people see me at work. Now I'm scared to do that again. I started therapy, so I'm trying my best to fight.",
          "created_utc": 1699062422.0
        }
      ]
    },
    {
      "id": "k7qpguk",
      "author": "None",
      "body": "how did it feel the first time after 5 years?  Did it feel all the same?  just as easy?  Congrats on 5 years, that is amazing, you can get back on the recovery game, you did it once, you can do it again!",
      "created_utc": 1699066131.0,
      "score": 1,
      "context": [
        {
          "id": "k7qhiwh",
          "author": "Emotional_Memory_347",
          "body": "Started 10 years ago when I started a stressful job in my mid 20's and it lasted for about 2 years. Went 5 years without and recently had a relapse for a few weeks. It's been a month since then.\n\nI'm having trouble tonight, but I think I can make it. I hope I can because I have the opportunity to purge without my partner home, and I don't want to take it. Last month, I had a blood vessel pop in my eye, and my partner figured it out. It was embarrassing, especially with how many people see me at work. Now I'm scared to do that again. I started therapy, so I'm trying my best to fight.",
          "created_utc": 1699062422.0
        }
      ]
    },
    {
      "id": "k7y2bz7",
      "author": "Evening-Share5742",
      "body": "Wow, that is eerie!  I remember when I was still actively drinking. I will say my life is exponentially better now that I am sober. I leaned on the bulimia in the past year of my sobriety too much but probably because I am not addressing some serious issues in my life in therapy that need to be addressed. A work in progress...I hope you can be free from both things soon and I can't wait to be free from bulimia soon. Alcoholism is a life of compulsive slavery, so are eating disorders. Feel free to message me anytime.",
      "created_utc": 1699202391.0,
      "score": 1,
      "context": [
        {
          "id": "k7x5k2d",
          "author": "subangel99",
          "body": "It’s eerie that we are very similar.   I’m 39 also bulimic since 13.  Still an alcoholic though on my end.  Working through all of this for years.   Hoping one day to be free but I just seem doomed forever.  Glad you’re sober though.  That is an amazing accomplishment.",
          "created_utc": 1699188957.0
        }
      ]
    },
    {
      "id": "mjmpncf",
      "author": "Evening-Share5742",
      "body": "Hi! I made this post a while back, and this is still something I struggle with every day because I don't have a normal relationship with food, and as humans we need to eat to live! It takes up a lot of my headspace on some days. \n\nI just wanted to say happy birthday! And I hope you get help, please get some serious help. I had to jump through hoops but I was finally able to find a therapist that has been helping me. Try to find a therapist with experience with eating disorders. It's so much more complicated than people realize. You are so young and it is so hard to be stuck in the cycle. \n\nThere is help and love in the world, even when it doesn't seem like it. Eating disorders suck. You deserve to be happy. Enjoy your birthday!",
      "created_utc": 1742897697.0,
      "score": 1,
      "context": [
        {
          "id": "mjlghch",
          "author": "PlasticProfit9938",
          "body": "I’ve been bulimic for about 8 months now I keep getting into a cycle where I leave it and then I relapse it’s so awful. I’m only 17 I just turned 17,today my birthday.its been so hard recently I have been diagnosed with anerexia but my insurance was cut off so I wasn’t able to see my therapist anymore. I only met them once, it’s so see how people think them telling me just don’t do it is so easy. I want to keep going tho I love being skinny but I just wanna be thin so bad",
          "created_utc": 1742871736.0
        }
      ]
    },
    {
      "id": "k7xfphd",
      "author": "Evening-Share5742",
      "body": "I hope you can stop soon, too. I'm tired of waiting for this to end so life after ED can begin. I know it sounds corny but it is true.",
      "created_utc": 1699193672.0,
      "score": 1,
      "context": [
        {
          "id": "k7w0kj5",
          "author": "Fine-Aside1789",
          "body": "41 and I'm somewhere around ten or eleven years.  Binged long before that and substance abuse intertwined in there.  Makes me sad when I see the higher numbers.  I keep thinking I'm going to at some point get so tired of this I'll have no choice but to stop.  That there's no way I can make it another year but realistically this hell can go on and on and on",
          "created_utc": 1699159332.0
        }
      ]
    },
    {
      "id": "k7q1825",
      "author": "crushworthyxo",
      "body": "Wow thank you for the suggestion! I just read a bit of an article on it and this sounds like a really interesting read.",
      "created_utc": 1699055263.0,
      "score": 4,
      "context": [
        {
          "id": "k7oobyq",
          "author": "candyred1",
          "body": "Started when I was 13, I turned 47 in September. So 34 years and counting. Longest I have gone \"clean\" was about 2-3 months which was due to the fact that I had cancer (late 2021-early 2022), in my sinus cavity, and the chemo and esp radiation to my face... I literally lost ALL taste. Dry mouth that caused sores, if I did eat I couldnt handle most things and involuntarily vomited. Very very rare type of Lymphoma (NK/T Cell).\n\nCauses? Nobody can say for sure. But, 8 years of horrible emotional and verbal abuse from my husband, seriously comprised my immune system no doubt. All the years with Bulimia and yeah sometimes the vomit goes up into the sinus cavity. Periodic drug and alcohol use (which is litrrally a given for the vast majority of us with ED) over my younger years,  then some. Perfect storm I guess. \n\nI have read many medical articles stating the growing prevelence of \"older\" women with EDs. Also, somewhere was mentioned that people with Bulimia have shown to have a much higher pain tolerance than those without any ED.",
          "created_utc": 1699036266.0
        },
        {
          "id": "k7opmqq",
          "author": "candyred1",
          "body": "Also wanted to say: read In The Realm Of Hungry Ghosts by Dr. Gabor Mate.\n\nI completely disagree with AA/NA, all of it. When I found this book it explained just what I had felt for so long about 12 steps and all that.\n\nEating disorders, drug and alcohol use/addiction... Any addiction...yes is just a symptom not the root problem.",
          "created_utc": 1699036743.0
        }
      ]
    },
    {
      "id": "k7rz4dp",
      "author": "MysteriousKale8289",
      "body": "That is a great book.  I have successfully used a sobriety support group that’s not 12-step-focused in my recovery, I do identify as an “addict”.",
      "created_utc": 1699098510.0,
      "score": 5,
      "context": [
        {
          "id": "k7oobyq",
          "author": "candyred1",
          "body": "Started when I was 13, I turned 47 in September. So 34 years and counting. Longest I have gone \"clean\" was about 2-3 months which was due to the fact that I had cancer (late 2021-early 2022), in my sinus cavity, and the chemo and esp radiation to my face... I literally lost ALL taste. Dry mouth that caused sores, if I did eat I couldnt handle most things and involuntarily vomited. Very very rare type of Lymphoma (NK/T Cell).\n\nCauses? Nobody can say for sure. But, 8 years of horrible emotional and verbal abuse from my husband, seriously comprised my immune system no doubt. All the years with Bulimia and yeah sometimes the vomit goes up into the sinus cavity. Periodic drug and alcohol use (which is litrrally a given for the vast majority of us with ED) over my younger years,  then some. Perfect storm I guess. \n\nI have read many medical articles stating the growing prevelence of \"older\" women with EDs. Also, somewhere was mentioned that people with Bulimia have shown to have a much higher pain tolerance than those without any ED.",
          "created_utc": 1699036266.0
        },
        {
          "id": "k7opmqq",
          "author": "candyred1",
          "body": "Also wanted to say: read In The Realm Of Hungry Ghosts by Dr. Gabor Mate.\n\nI completely disagree with AA/NA, all of it. When I found this book it explained just what I had felt for so long about 12 steps and all that.\n\nEating disorders, drug and alcohol use/addiction... Any addiction...yes is just a symptom not the root problem.",
          "created_utc": 1699036743.0
        }
      ]
    },
    {
      "id": "k7slsmf",
      "author": "Informal-Ad-7356",
      "body": "I started with only eating safe foods and digesting.  Then I increased the qtys to getting full and sitting with the panic/distress of that.  Then I added in \"medium\" scary foods.  This was not a fast process, and of course I gained weight and had to process that.   I immediately got rid of clothes that only fit my thinner self (I started as being quite underweight).   The bloat...the digestional issues!  It was very hard.  Mentally and physically.   I had a relapse after a year, because I was majorly triggered by the scale.   I eventually went up 3 sizes.   It was probably very helpful that it wasn't overnight,  as I had to keep getting used to a new body at each stage.  But I celebrated every win!!  Eating out without looking at the menu first,  eating out (and not being in a panic) with friends.  Grocery shopping for food to EAT, not food to binge on.  Every \"win\" counts!   Lastly...only at most recent... I added in trigger/binge foods.   At first I couldn't handle it, but now I can.   One step at a time.  Always forgive yourself!  We are relearning a new way to be..to cope..to live in our own skin.  I may never love my body tbh...I am bigger with hips, thighs, belly, boobs, but I LOVE not having food/body/weight panic.  The mental Peace keeps me staying in Recovery.  And my husband is relieved of living with someone totally in fear every single day,  with what that Damn scale reports.  Now I can just Live.",
      "created_utc": 1699109440.0,
      "score": 2,
      "context": [
        {
          "id": "k7pnxuh",
          "author": "Informal-Ad-7356",
          "body": "I suffered for 35 years until I attempted Recovery.  One relapse, now I'm in Recovery for 2nd year.  There's no magic pill... we have to actively, On purpose seek Recovery and do the hard things: eat the food, digest the food, sit with the uncomfortable,  buy bigger clothes if needed, get rid of all clothes that don't fit the new recovered body,  stop weighing...all the hard things.   Then slowly the hard things become the new normal.  And then the blessed mental Peace arrives, and food and body are no longer center stage.   Life is.",
          "created_utc": 1699049726.0
        },
        {
          "id": "k7qx8zx",
          "author": "Slms7301",
          "body": "Wow!   You just gave me hope!   Began at age 16 and im about to be 51     Maybe a silly question but did u stop cold turkey or wean off slowly??    Ty",
          "created_utc": 1699070206.0
        }
      ]
    },
    {
      "id": "k7qqzd9",
      "author": "Emotional_Memory_347",
      "body": "Thank you for your reply. I've decided to lay down and take my meds a bit early. That's basically the only thing that forces me not to purge because I need the meds to work badly. I'm kinda feeling like I should be up and enjoying my evening, but now I'll be good for another night after a hard week. Haven't been alone at night on a weekend since last month. I'm proud and sleepy now. 😋",
      "created_utc": 1699066865.0,
      "score": 2,
      "context": [
        {
          "id": "k7qhiwh",
          "author": "Emotional_Memory_347",
          "body": "Started 10 years ago when I started a stressful job in my mid 20's and it lasted for about 2 years. Went 5 years without and recently had a relapse for a few weeks. It's been a month since then.\n\nI'm having trouble tonight, but I think I can make it. I hope I can because I have the opportunity to purge without my partner home, and I don't want to take it. Last month, I had a blood vessel pop in my eye, and my partner figured it out. It was embarrassing, especially with how many people see me at work. Now I'm scared to do that again. I started therapy, so I'm trying my best to fight.",
          "created_utc": 1699062422.0
        },
        {
          "id": "k7qo208",
          "author": "Evening-Share5742",
          "body": "You can absolutely do it! I know the temptation of being alone, that gets me too. I hope you can recover from your relapse, this is a tricky thing we have to deal with. It's exhausting and just not worth it. Hugs to you!",
          "created_utc": 1699065451.0
        }
      ]
    },
    {
      "id": "k7t3p4e",
      "author": "Emotional_Memory_347",
      "body": "Just as easy. Felt great about it because I'd love the weight loss. I'm a curvy and short woman, and I've always had fear of gaining too much weight. When I got the huge burst blood vessel in my eye, it stopped me in my tracks. Half my eye was blood red, and it was there for almost 2 weeks as a reminder. I know colleagues and clients wondered about it. Things are really tough at work, so I'm not surprised at my relapse\n\nWhen my job gets to be too much, which is often, I stop caring for my body. I order takeout, and I sit on the couch until bedtime. My bulimia felt like a way to catch up or stay together when I was too exhausted to care for myself. For me, the key is not being so exhausted that I can't take a walk or work out. If I maintain that, I'm usually fine.... if I can't maintain that, which happens all the time, I have to be really conscious about my disordered eating. That has become more normal throughout my years of recovery. This time, I'm in therapy and my partner knows what's happening so i hope it sticks this time.",
      "created_utc": 1699116490.0,
      "score": 1,
      "context": [
        {
          "id": "k7qhiwh",
          "author": "Emotional_Memory_347",
          "body": "Started 10 years ago when I started a stressful job in my mid 20's and it lasted for about 2 years. Went 5 years without and recently had a relapse for a few weeks. It's been a month since then.\n\nI'm having trouble tonight, but I think I can make it. I hope I can because I have the opportunity to purge without my partner home, and I don't want to take it. Last month, I had a blood vessel pop in my eye, and my partner figured it out. It was embarrassing, especially with how many people see me at work. Now I'm scared to do that again. I started therapy, so I'm trying my best to fight.",
          "created_utc": 1699062422.0
        },
        {
          "id": "k7qpguk",
          "author": "None",
          "body": "how did it feel the first time after 5 years?  Did it feel all the same?  just as easy?  Congrats on 5 years, that is amazing, you can get back on the recovery game, you did it once, you can do it again!",
          "created_utc": 1699066131.0
        }
      ]
    }
  ]
}