{
  "id": "17nttm3",
  "subreddit": "bulimia",
  "author": "Large-Management-117",
  "created_utc": 1699127558.0,
  "title": "Sister has bulimia and makes a huge mess",
  "selftext": "Hi guys, I am in desperate need of help. My sister is very sick with bulimia, and as someone who suffered with anorexia, I feel so so horrible for her, and I know how incredibly hard it is to live with an eating disorder but, she makes a giant mess. She is incapable of cleaning up after herself. \n\nBesides the giant stack of dishes and garbage left all over the house, and her eating all of my food, which i need since i am still in recovery and like to eat the same things everyday. Which i know isn’t great but that’s a story for another time. there is vomit everywhere. She binges and purges multiple times a day. She leaves her puke in the sink, literal chunks of it. She leaves it running down the cabinet under the sink. And the toilet, oh my god. There has been caked on vomit around the entire bowl of the toilet, like I’m sure you could grab a handful of it. She leaves piles of vomit on the ground. On the outside of the toilet. She also leaves vomit on the wall. I say to her often that I’d like her to clean up after herself, but for some reason she has zero issues with me cleaning up after her. I don’t understand how she can leave her puke out for everyone to see. Is it wrong of me to be upset with her? \n\nWhat do I do? Is anyone able to help. I am at the point where I hold my pee after school and wait until the next morning to pee once I get to school. I am so frustrated that if I walk into the bathroom and see the mess, I just start crying and walk out. I can not continue living like this. No one can.",
  "url": "https://www.reddit.com/r/bulimia/comments/17nttm3/sister_has_bulimia_and_makes_a_huge_mess/",
  "score": 84,
  "num_comments": 49,
  "comments": [
    {
      "id": "k7u397y",
      "author": "luca-nicoletti",
      "body": "I think it’s totally normal to be upset with her. Despite the rating problems you both have, cleaning up after one self is a form of respect for other people you live with, it has nothing to do with eating disorders. In this specific case it is related, but it’s a good sense thing to not leave a mess for others. \nSomeone I know solve a similar problem (roommate leaving hairs down the shower all the time) by collecting the remaining and putting them on the guilty bed pillow. After two times, this person started cleaning up after her self!",
      "created_utc": 1699129499.0,
      "score": 64,
      "context": []
    },
    {
      "id": "k7ueda0",
      "author": "obsessedpunk",
      "body": "okay this is horrible. coming from a bulimic myself i don’t get how she doesn’t clean up cuz omg id be embarrassed af. \nanyway, talk to her. try to get across how this situation (the not cleaning up) is disgusting. maybe go with a less aggressive approach or just be brutally honest. idk how ur sister ticks. \neven tho i make sure to clean up everything i did clog the sink once (very ew) and forgot to change a towel that got some puke on it. long story short my parents, whom i live with, basically just came up to me and were like: “yup u struggle ik but pls be a bit more aware of how u leave the restroom after purging”. \nmake her aware of how its not the binges and purges itself that bother u to no end but the condition of the toilet afterwards. maybe just try to find a middle ground that both of u can work with. like for example stocking up on wet wipes and maybe some stuff to clean sinks etc. that’s what i do at least.\nmaybe she’s just really bad off and needs to be seen and needs someone to just talk to her idk. and i don’t wanna assume anything just writing down what came to my mind. (i hope this makes sense. it’s late and i’m tired)\nEdit: I forgot to say something to the whole “eating ur food” thing. maybe trying to come to the agreement of marking what’s urs helps. like i myself don’t care who’s ice cream it is when i binge. but i never ever eat the things people downright claimed by writing down their name or so. like id never eat my moms meal prep she makes for work the next day no matter how tempting because it’s “officially claimed”. maybe it’s just my brain. but also coming up with ideas on how to manage life together might help a lot",
      "created_utc": 1699133870.0,
      "score": 45,
      "context": []
    },
    {
      "id": "k7v7avl",
      "author": "Jentheheb",
      "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
      "created_utc": 1699145588.0,
      "score": 20,
      "context": []
    },
    {
      "id": "k7uup46",
      "author": "Nebion666",
      "body": "Oh my god. I dont do the best at cleaning ip all the time. Sometimes theres a little vomit in the toilet bowl and also mold buildup but i never let it go for more than a few days without doing a proper scrub of it. And when i do see mold and stuff in the toilet i feel gross and ashamed. To let it build up this extreme?This is just insane. Also i just have to say, even if it makes you feel gross to pee in that bathroom it’s dangerous to hold your pee so often. Ive seen people get kidney failure and fuck their whole life up. You cannot hold it that long even if it sucks. Is your sister a minor? Maybe she could be forced into treatment? There has to be something your parents could do reasonably to force her to clean up.",
      "created_utc": 1699140459.0,
      "score": 20,
      "context": []
    },
    {
      "id": "k7w3tji",
      "author": "Fine-Aside1789",
      "body": "That is such a rare situation.  Most bulimics are trying to hide what they are doing and she doesn't seem to care.  I think you'd find the toilet of a bulimic to be more clean than the average person as I can attest to by having  to purge in many toilets not belonging to me.  She's so disrespectful as a human being.  I know I can do some stuff I'm not proud of under the bulimic flag but I never expect a free pass for doing it.  She needs some manners",
      "created_utc": 1699161356.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k7xbpey",
      "author": "Valuable-Blood3233",
      "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
      "created_utc": 1699191935.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7xntp3",
      "author": "Early_Face3134",
      "body": "Honestly this is vile. I'm bulimic and occasionally will miss some of the cleanup accidentally, my mother or boyfriend will see it and get mad-rightly so. Its hard enough seeing a loved one suffer but cleaning up their self destruction is soul destroying. She needs a reality check, despite her ed it is so wrong to leave a mess for someone else to clean. If it was me I'd have a go at her and make it extremely clear that it is both disrespectful and disgusting to leave her mess for you to clean up. She isn't incapable of cleaning, it only takes a minute or two. No matter what state she's in mentally that behaviour is not ok",
      "created_utc": 1699196931.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k7vl3aj",
      "author": "lysedelia",
      "body": "She's going to give you kidney disease by making you hold your pee like that.",
      "created_utc": 1699151479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7xiamw",
      "author": "jl9d2",
      "body": "Give her a bin and tell her to use that in the yard until she’s ready to clean up after herself and be responsible.",
      "created_utc": 1699194746.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k803ihf",
      "author": "Adventurous_Sail_673",
      "body": "that’s insane, i’ve been bulimic for a decade and have gone through various disgusting scenarios (broken toilet pipe, my vomit flooded the whole bathroom floor) and i never leave a trace. you’re absolutely allowed to be upset with her, i’d be livid",
      "created_utc": 1699229078.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7ud7tk",
      "author": "None",
      "body": "Do you live with just her?",
      "created_utc": 1699133411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8by0jy",
      "author": "Yuthenia",
      "body": "I already feel embarrassed enough by just puking in restaurants or at college. The only times I remembered not cleaning after myself was when I was sleep deprived and purging ever second to the point I was getting dizzy/brain fog. I wouldn’t even care about the mess or how much noise bc of how tired I was but sometimes I will just forget or even I think I cleaned up after myself.. the mess will still be there the following day. Now I’m at point where my whole family knows and they find every second to trigger me… if anything I love how you care deeply about your sister and have compassion about her ed. I wish my brother was like you.. he also has an ED but he sees me has a competition :/ we don’t get along and finds way to trigger my ed. Sending lots of love your way for both ya 🙏🏻🤍",
      "created_utc": 1699430245.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7vlv4h",
      "author": "macnsleaze",
      "body": "Shame her.",
      "created_utc": 1699151828.0,
      "score": -1,
      "context": []
    },
    {
      "id": "k7u3nhs",
      "author": "Large-Management-117",
      "body": "Yes see that’s a good idea. I just wonder how I would do something like that in this situation. We’ve considered not flushing after we use the washroom so that she sees what other things are entering the toilet, but I feel like if she’s not grossed out by her own vomit she won’t have an issue with that.",
      "created_utc": 1699129652.0,
      "score": 5,
      "context": [
        {
          "id": "k7u397y",
          "author": "luca-nicoletti",
          "body": "I think it’s totally normal to be upset with her. Despite the rating problems you both have, cleaning up after one self is a form of respect for other people you live with, it has nothing to do with eating disorders. In this specific case it is related, but it’s a good sense thing to not leave a mess for others. \nSomeone I know solve a similar problem (roommate leaving hairs down the shower all the time) by collecting the remaining and putting them on the guilty bed pillow. After two times, this person started cleaning up after her self!",
          "created_utc": 1699129499.0
        }
      ]
    },
    {
      "id": "k7uhauc",
      "author": "Large-Management-117",
      "body": "Thank you so much. Hearing from someone who is going through what my sister is going through is great. We have put toilet scrubbers and Lysol wipes in the bathroom and it does help. She does scrub stuff but she half asses it. Leaves a lot of little chunks and other things. And about the food, we’ve actually resorted to locking the fridge, pantry and my room. So I keep many things in my room, but the second I leave my door unlocked she’s in my room and will eat everything. It’s at the point where if I’m showering, I lock my door for the 15 minutes I’m out of it. But my mom thinks it’s unfair to be keeping food in my room and isn’t great for my mental health, which I agree. I definitely think it’s a good idea to try to trust her and mark my name on things. Thank you, I really really appreciate your input. I feel like I have no options and like she just expects me to accept this is how I’m going to have to live.",
      "created_utc": 1699135036.0,
      "score": 14,
      "context": [
        {
          "id": "k7ueda0",
          "author": "obsessedpunk",
          "body": "okay this is horrible. coming from a bulimic myself i don’t get how she doesn’t clean up cuz omg id be embarrassed af. \nanyway, talk to her. try to get across how this situation (the not cleaning up) is disgusting. maybe go with a less aggressive approach or just be brutally honest. idk how ur sister ticks. \neven tho i make sure to clean up everything i did clog the sink once (very ew) and forgot to change a towel that got some puke on it. long story short my parents, whom i live with, basically just came up to me and were like: “yup u struggle ik but pls be a bit more aware of how u leave the restroom after purging”. \nmake her aware of how its not the binges and purges itself that bother u to no end but the condition of the toilet afterwards. maybe just try to find a middle ground that both of u can work with. like for example stocking up on wet wipes and maybe some stuff to clean sinks etc. that’s what i do at least.\nmaybe she’s just really bad off and needs to be seen and needs someone to just talk to her idk. and i don’t wanna assume anything just writing down what came to my mind. (i hope this makes sense. it’s late and i’m tired)\nEdit: I forgot to say something to the whole “eating ur food” thing. maybe trying to come to the agreement of marking what’s urs helps. like i myself don’t care who’s ice cream it is when i binge. but i never ever eat the things people downright claimed by writing down their name or so. like id never eat my moms meal prep she makes for work the next day no matter how tempting because it’s “officially claimed”. maybe it’s just my brain. but also coming up with ideas on how to manage life together might help a lot",
          "created_utc": 1699133870.0
        }
      ]
    },
    {
      "id": "k7v8c5t",
      "author": "Large-Management-117",
      "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
      "created_utc": 1699146022.0,
      "score": 11,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        }
      ]
    },
    {
      "id": "k7v3aff",
      "author": "Large-Management-117",
      "body": "Right! I just feel like it’s insane to let a household live like this I don’t understand why she doesn’t see it the way others do. And she is 18, but if she goes to the hospital due to complications like low potassium, there’s a chance they say she has a risk of bad things happening and have to admit her. And yeah I know it’s dangerous to hold my pee, I just can’t bring myself to sit on that seat. I have just always had a fear of puke. When I hear her puking I go into panic mode, I can’t bring myself to sit next to it. I brush my teeth outside. Like what I’m experiencing is so insane I feel like I’m the only person in the world experiencing this but I’m sure I’m not.\n\nGenuine question for you. Is there a reason as to why you or someone else with bulimia leave vomit in the toilet? Or do you simply just forget to do it. I hope I am wording everything right! I don’t want to be disrespectful.",
      "created_utc": 1699143972.0,
      "score": 7,
      "context": [
        {
          "id": "k7uup46",
          "author": "Nebion666",
          "body": "Oh my god. I dont do the best at cleaning ip all the time. Sometimes theres a little vomit in the toilet bowl and also mold buildup but i never let it go for more than a few days without doing a proper scrub of it. And when i do see mold and stuff in the toilet i feel gross and ashamed. To let it build up this extreme?This is just insane. Also i just have to say, even if it makes you feel gross to pee in that bathroom it’s dangerous to hold your pee so often. Ive seen people get kidney failure and fuck their whole life up. You cannot hold it that long even if it sucks. Is your sister a minor? Maybe she could be forced into treatment? There has to be something your parents could do reasonably to force her to clean up.",
          "created_utc": 1699140459.0
        }
      ]
    },
    {
      "id": "k7xtjva",
      "author": "Large-Management-117",
      "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
      "created_utc": 1699199120.0,
      "score": 3,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        }
      ]
    },
    {
      "id": "k7y0vjc",
      "author": "Large-Management-117",
      "body": "You’re completely right, I feel like the only way I can solve this problem im having is to talk to her and be brutally honest about it.",
      "created_utc": 1699201842.0,
      "score": 3,
      "context": [
        {
          "id": "k7xntp3",
          "author": "Early_Face3134",
          "body": "Honestly this is vile. I'm bulimic and occasionally will miss some of the cleanup accidentally, my mother or boyfriend will see it and get mad-rightly so. Its hard enough seeing a loved one suffer but cleaning up their self destruction is soul destroying. She needs a reality check, despite her ed it is so wrong to leave a mess for someone else to clean. If it was me I'd have a go at her and make it extremely clear that it is both disrespectful and disgusting to leave her mess for you to clean up. She isn't incapable of cleaning, it only takes a minute or two. No matter what state she's in mentally that behaviour is not ok",
          "created_utc": 1699196931.0
        }
      ]
    },
    {
      "id": "k7y0oie",
      "author": "Large-Management-117",
      "body": "That’s what we’re thinking of doing but we think she’s puke in the sink or somehow make it our problem that she has to go outside",
      "created_utc": 1699201768.0,
      "score": 2,
      "context": [
        {
          "id": "k7xiamw",
          "author": "jl9d2",
          "body": "Give her a bin and tell her to use that in the yard until she’s ready to clean up after herself and be responsible.",
          "created_utc": 1699194746.0
        }
      ]
    },
    {
      "id": "k7ugc6d",
      "author": "Large-Management-117",
      "body": "No, our parents are separated so half the time I’m with her, my dad and my step mom, and half the time it’s me her and my mom. All of my parents are kind of at the same place I am at",
      "created_utc": 1699134656.0,
      "score": 1,
      "context": [
        {
          "id": "k7ud7tk",
          "author": "None",
          "body": "Do you live with just her?",
          "created_utc": 1699133411.0
        }
      ]
    },
    {
      "id": "k8d0eut",
      "author": "Large-Management-117",
      "body": "I’m so so sorry to hear, as as someone who has family going through the same thing my heart breaks for you.  You should like you are trying your hardest, keep it up ❤️",
      "created_utc": 1699454218.0,
      "score": 2,
      "context": [
        {
          "id": "k8by0jy",
          "author": "Yuthenia",
          "body": "I already feel embarrassed enough by just puking in restaurants or at college. The only times I remembered not cleaning after myself was when I was sleep deprived and purging ever second to the point I was getting dizzy/brain fog. I wouldn’t even care about the mess or how much noise bc of how tired I was but sometimes I will just forget or even I think I cleaned up after myself.. the mess will still be there the following day. Now I’m at point where my whole family knows and they find every second to trigger me… if anything I love how you care deeply about your sister and have compassion about her ed. I wish my brother was like you.. he also has an ED but he sees me has a competition :/ we don’t get along and finds way to trigger my ed. Sending lots of love your way for both ya 🙏🏻🤍",
          "created_utc": 1699430245.0
        }
      ]
    },
    {
      "id": "k7vm1hj",
      "author": "Large-Management-117",
      "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
      "created_utc": 1699151907.0,
      "score": 4,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        }
      ]
    },
    {
      "id": "k7xio2i",
      "author": "luca-nicoletti",
      "body": "Gloves, dustpan and spatula, collect what she leaves, and move into her bedroom with a sticky note: \"Is it nice?\"",
      "created_utc": 1699194897.0,
      "score": 7,
      "context": [
        {
          "id": "k7u397y",
          "author": "luca-nicoletti",
          "body": "I think it’s totally normal to be upset with her. Despite the rating problems you both have, cleaning up after one self is a form of respect for other people you live with, it has nothing to do with eating disorders. In this specific case it is related, but it’s a good sense thing to not leave a mess for others. \nSomeone I know solve a similar problem (roommate leaving hairs down the shower all the time) by collecting the remaining and putting them on the guilty bed pillow. After two times, this person started cleaning up after her self!",
          "created_utc": 1699129499.0
        },
        {
          "id": "k7u3nhs",
          "author": "Large-Management-117",
          "body": "Yes see that’s a good idea. I just wonder how I would do something like that in this situation. We’ve considered not flushing after we use the washroom so that she sees what other things are entering the toilet, but I feel like if she’s not grossed out by her own vomit she won’t have an issue with that.",
          "created_utc": 1699129652.0
        }
      ]
    },
    {
      "id": "k7uhx54",
      "author": "Excellent-World-476",
      "body": "Could you lock up your food?  When someone is badly bulimic morals and common sense disappear. I think it is fair given your own issues to have a locked cupboard just for you.",
      "created_utc": 1699135286.0,
      "score": 16,
      "context": [
        {
          "id": "k7ueda0",
          "author": "obsessedpunk",
          "body": "okay this is horrible. coming from a bulimic myself i don’t get how she doesn’t clean up cuz omg id be embarrassed af. \nanyway, talk to her. try to get across how this situation (the not cleaning up) is disgusting. maybe go with a less aggressive approach or just be brutally honest. idk how ur sister ticks. \neven tho i make sure to clean up everything i did clog the sink once (very ew) and forgot to change a towel that got some puke on it. long story short my parents, whom i live with, basically just came up to me and were like: “yup u struggle ik but pls be a bit more aware of how u leave the restroom after purging”. \nmake her aware of how its not the binges and purges itself that bother u to no end but the condition of the toilet afterwards. maybe just try to find a middle ground that both of u can work with. like for example stocking up on wet wipes and maybe some stuff to clean sinks etc. that’s what i do at least.\nmaybe she’s just really bad off and needs to be seen and needs someone to just talk to her idk. and i don’t wanna assume anything just writing down what came to my mind. (i hope this makes sense. it’s late and i’m tired)\nEdit: I forgot to say something to the whole “eating ur food” thing. maybe trying to come to the agreement of marking what’s urs helps. like i myself don’t care who’s ice cream it is when i binge. but i never ever eat the things people downright claimed by writing down their name or so. like id never eat my moms meal prep she makes for work the next day no matter how tempting because it’s “officially claimed”. maybe it’s just my brain. but also coming up with ideas on how to manage life together might help a lot",
          "created_utc": 1699133870.0
        },
        {
          "id": "k7uhauc",
          "author": "Large-Management-117",
          "body": "Thank you so much. Hearing from someone who is going through what my sister is going through is great. We have put toilet scrubbers and Lysol wipes in the bathroom and it does help. She does scrub stuff but she half asses it. Leaves a lot of little chunks and other things. And about the food, we’ve actually resorted to locking the fridge, pantry and my room. So I keep many things in my room, but the second I leave my door unlocked she’s in my room and will eat everything. It’s at the point where if I’m showering, I lock my door for the 15 minutes I’m out of it. But my mom thinks it’s unfair to be keeping food in my room and isn’t great for my mental health, which I agree. I definitely think it’s a good idea to try to trust her and mark my name on things. Thank you, I really really appreciate your input. I feel like I have no options and like she just expects me to accept this is how I’m going to have to live.",
          "created_utc": 1699135036.0
        }
      ]
    },
    {
      "id": "k7xiqsn",
      "author": "emotional_low",
      "body": "OP if she has genuinely lost that amount of weight (120 pounds) in such a short amount of time from purging she needs admitting like yesterday. ESPECIALLY if she is purging multiple times a day and \"leaving piles of vomit\" around.\n\nPlease look at my other comment; I truly believe that your sister is deeply unwell (more unwell than I think you seem to realise) and that she may also be suffering from major depression alongside her eating disorder (these things are comorbid a lot of the time). \n\nIt isn't uncommon for people with major depression to fester in unhygienic conditions and genuinely not give a crap about their living environment (I know because I've been there too). When you are depressed *nothing* matters, literally NOTHING. \n\nPlease don't listen to the other comments which suggest shaming her; shame will not work, she needs a professional medical intervention ASAP, and if she doesn't get that help your family poses a very high risk of losing her.\n\n(I say shame won't work because my family tried to shame me into getting better too; I also used to be bulimic, and the only way I was able to properly recover from both my eating disorder and depression was through professional medical intervention).",
      "created_utc": 1699194927.0,
      "score": 14,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        }
      ]
    },
    {
      "id": "k8byw1h",
      "author": "Yuthenia",
      "body": "Has someone who’s around your sister weight and was overweight my whole life. This attention is what drives off to keep going and it’s not healthy but we feel “seen” and not the way are family makes us feel. For me it’s like an accomplishment and control over everything. It helps with my confidence boost and keeps me from feeling guilt.",
      "created_utc": 1699430945.0,
      "score": 2,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        }
      ]
    },
    {
      "id": "k7xhp5j",
      "author": "emotional_low",
      "body": "OP honestly if she's binging and purging multiple times a day and at such a volume to the point where there is vomit everywhere and in \"piles\" I think she already needs admitting. \n\nIf she struggles to do basic things such as clean up/clean herself/look after herself it would suggest that she may have a classic case of depression/ED comorbidity. She might not be cleaning because she simply doesn't have the energy or will to (very common with people who suffer from depression)\n\nI'm not saying what she's doing is okay; I'm just saying that maybe she's even more unwell than you perceive her to be.",
      "created_utc": 1699194501.0,
      "score": 13,
      "context": [
        {
          "id": "k7uup46",
          "author": "Nebion666",
          "body": "Oh my god. I dont do the best at cleaning ip all the time. Sometimes theres a little vomit in the toilet bowl and also mold buildup but i never let it go for more than a few days without doing a proper scrub of it. And when i do see mold and stuff in the toilet i feel gross and ashamed. To let it build up this extreme?This is just insane. Also i just have to say, even if it makes you feel gross to pee in that bathroom it’s dangerous to hold your pee so often. Ive seen people get kidney failure and fuck their whole life up. You cannot hold it that long even if it sucks. Is your sister a minor? Maybe she could be forced into treatment? There has to be something your parents could do reasonably to force her to clean up.",
          "created_utc": 1699140459.0
        },
        {
          "id": "k7v3aff",
          "author": "Large-Management-117",
          "body": "Right! I just feel like it’s insane to let a household live like this I don’t understand why she doesn’t see it the way others do. And she is 18, but if she goes to the hospital due to complications like low potassium, there’s a chance they say she has a risk of bad things happening and have to admit her. And yeah I know it’s dangerous to hold my pee, I just can’t bring myself to sit on that seat. I have just always had a fear of puke. When I hear her puking I go into panic mode, I can’t bring myself to sit next to it. I brush my teeth outside. Like what I’m experiencing is so insane I feel like I’m the only person in the world experiencing this but I’m sure I’m not.\n\nGenuine question for you. Is there a reason as to why you or someone else with bulimia leave vomit in the toilet? Or do you simply just forget to do it. I hope I am wording everything right! I don’t want to be disrespectful.",
          "created_utc": 1699143972.0
        }
      ]
    },
    {
      "id": "k7w02vb",
      "author": "None",
      "body": "sometimes after flushing the vomit doesn't fully flush away, and also its possible to miss some of the vomit splatter when wiping down the toilet bowl especially if ur in a rush. mostly though, its very easy to keep clean",
      "created_utc": 1699159046.0,
      "score": 2,
      "context": [
        {
          "id": "k7uup46",
          "author": "Nebion666",
          "body": "Oh my god. I dont do the best at cleaning ip all the time. Sometimes theres a little vomit in the toilet bowl and also mold buildup but i never let it go for more than a few days without doing a proper scrub of it. And when i do see mold and stuff in the toilet i feel gross and ashamed. To let it build up this extreme?This is just insane. Also i just have to say, even if it makes you feel gross to pee in that bathroom it’s dangerous to hold your pee so often. Ive seen people get kidney failure and fuck their whole life up. You cannot hold it that long even if it sucks. Is your sister a minor? Maybe she could be forced into treatment? There has to be something your parents could do reasonably to force her to clean up.",
          "created_utc": 1699140459.0
        },
        {
          "id": "k7v3aff",
          "author": "Large-Management-117",
          "body": "Right! I just feel like it’s insane to let a household live like this I don’t understand why she doesn’t see it the way others do. And she is 18, but if she goes to the hospital due to complications like low potassium, there’s a chance they say she has a risk of bad things happening and have to admit her. And yeah I know it’s dangerous to hold my pee, I just can’t bring myself to sit on that seat. I have just always had a fear of puke. When I hear her puking I go into panic mode, I can’t bring myself to sit next to it. I brush my teeth outside. Like what I’m experiencing is so insane I feel like I’m the only person in the world experiencing this but I’m sure I’m not.\n\nGenuine question for you. Is there a reason as to why you or someone else with bulimia leave vomit in the toilet? Or do you simply just forget to do it. I hope I am wording everything right! I don’t want to be disrespectful.",
          "created_utc": 1699143972.0
        }
      ]
    },
    {
      "id": "k7y97zo",
      "author": "Valuable-Blood3233",
      "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
      "created_utc": 1699204883.0,
      "score": 2,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        }
      ]
    },
    {
      "id": "k7zy2jz",
      "author": "jl9d2",
      "body": "As mean as it sounds, that’s prob the boundaries you have to set bc otherwise you’re gonna be cleaning her barf for a very long time. Like she is being inconsiderate of others and her ed is no excuse to leave messes for others to clean.",
      "created_utc": 1699226968.0,
      "score": 2,
      "context": [
        {
          "id": "k7xiamw",
          "author": "jl9d2",
          "body": "Give her a bin and tell her to use that in the yard until she’s ready to clean up after herself and be responsible.",
          "created_utc": 1699194746.0
        },
        {
          "id": "k7y0oie",
          "author": "Large-Management-117",
          "body": "That’s what we’re thinking of doing but we think she’s puke in the sink or somehow make it our problem that she has to go outside",
          "created_utc": 1699201768.0
        }
      ]
    },
    {
      "id": "k7vmabh",
      "author": "macnsleaze",
      "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
      "created_utc": 1699152017.0,
      "score": 11,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        }
      ]
    },
    {
      "id": "k7xpbmc",
      "author": "Early_Face3134",
      "body": "No matter how unwell she is its wrong to treat her sister this way knowing she has also suffered with an eating disorder. I agree that shaming her would be an awful and completely unbeneficial thing to do but op shouldnt have to put up with cleaning up a vile and triggering mess because her sister is sick. Even at my absolute worst I wasn't that careless in regards to my families feelings",
      "created_utc": 1699197516.0,
      "score": 4,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k7xiqsn",
          "author": "emotional_low",
          "body": "OP if she has genuinely lost that amount of weight (120 pounds) in such a short amount of time from purging she needs admitting like yesterday. ESPECIALLY if she is purging multiple times a day and \"leaving piles of vomit\" around.\n\nPlease look at my other comment; I truly believe that your sister is deeply unwell (more unwell than I think you seem to realise) and that she may also be suffering from major depression alongside her eating disorder (these things are comorbid a lot of the time). \n\nIt isn't uncommon for people with major depression to fester in unhygienic conditions and genuinely not give a crap about their living environment (I know because I've been there too). When you are depressed *nothing* matters, literally NOTHING. \n\nPlease don't listen to the other comments which suggest shaming her; shame will not work, she needs a professional medical intervention ASAP, and if she doesn't get that help your family poses a very high risk of losing her.\n\n(I say shame won't work because my family tried to shame me into getting better too; I also used to be bulimic, and the only way I was able to properly recover from both my eating disorder and depression was through professional medical intervention).",
          "created_utc": 1699194927.0
        }
      ]
    },
    {
      "id": "k8d0pvz",
      "author": "Large-Management-117",
      "body": "Do you mean attention the attention from boys and peers?",
      "created_utc": 1699454344.0,
      "score": 1,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k8byw1h",
          "author": "Yuthenia",
          "body": "Has someone who’s around your sister weight and was overweight my whole life. This attention is what drives off to keep going and it’s not healthy but we feel “seen” and not the way are family makes us feel. For me it’s like an accomplishment and control over everything. It helps with my confidence boost and keeps me from feeling guilt.",
          "created_utc": 1699430945.0
        }
      ]
    },
    {
      "id": "k7xs7dn",
      "author": "Large-Management-117",
      "body": "Thank you, I didn’t really think of it that way. It’s hard when she’s tearing everyone else’s life apart, but yes that could be the case.",
      "created_utc": 1699198616.0,
      "score": 5,
      "context": [
        {
          "id": "k7uup46",
          "author": "Nebion666",
          "body": "Oh my god. I dont do the best at cleaning ip all the time. Sometimes theres a little vomit in the toilet bowl and also mold buildup but i never let it go for more than a few days without doing a proper scrub of it. And when i do see mold and stuff in the toilet i feel gross and ashamed. To let it build up this extreme?This is just insane. Also i just have to say, even if it makes you feel gross to pee in that bathroom it’s dangerous to hold your pee so often. Ive seen people get kidney failure and fuck their whole life up. You cannot hold it that long even if it sucks. Is your sister a minor? Maybe she could be forced into treatment? There has to be something your parents could do reasonably to force her to clean up.",
          "created_utc": 1699140459.0
        },
        {
          "id": "k7v3aff",
          "author": "Large-Management-117",
          "body": "Right! I just feel like it’s insane to let a household live like this I don’t understand why she doesn’t see it the way others do. And she is 18, but if she goes to the hospital due to complications like low potassium, there’s a chance they say she has a risk of bad things happening and have to admit her. And yeah I know it’s dangerous to hold my pee, I just can’t bring myself to sit on that seat. I have just always had a fear of puke. When I hear her puking I go into panic mode, I can’t bring myself to sit next to it. I brush my teeth outside. Like what I’m experiencing is so insane I feel like I’m the only person in the world experiencing this but I’m sure I’m not.\n\nGenuine question for you. Is there a reason as to why you or someone else with bulimia leave vomit in the toilet? Or do you simply just forget to do it. I hope I am wording everything right! I don’t want to be disrespectful.",
          "created_utc": 1699143972.0
        },
        {
          "id": "k7xhp5j",
          "author": "emotional_low",
          "body": "OP honestly if she's binging and purging multiple times a day and at such a volume to the point where there is vomit everywhere and in \"piles\" I think she already needs admitting. \n\nIf she struggles to do basic things such as clean up/clean herself/look after herself it would suggest that she may have a classic case of depression/ED comorbidity. She might not be cleaning because she simply doesn't have the energy or will to (very common with people who suffer from depression)\n\nI'm not saying what she's doing is okay; I'm just saying that maybe she's even more unwell than you perceive her to be.",
          "created_utc": 1699194501.0
        }
      ]
    },
    {
      "id": "k7yhzs3",
      "author": "Large-Management-117",
      "body": "Yeah, I think she thinks we don’t care. But she’s 18, so my parents no longer have control of admitting her, she has to say she wants to go. At this point it feels like we can’t do anything we just have to wait until the doctors force her to get treatment because she doesn’t want to stop",
      "created_utc": 1699208000.0,
      "score": 1,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        },
        {
          "id": "k7y97zo",
          "author": "Valuable-Blood3233",
          "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
          "created_utc": 1699204883.0
        }
      ]
    },
    {
      "id": "k7vmhtb",
      "author": "Large-Management-117",
      "body": "Yeah I think we’re about at that place. She’s 18, and I don’t think she’s gonna realize what she’s putting my family though until she lives on her own and realizes how disgusting everything is and how much money it costs for her to live the way she does.",
      "created_utc": 1699152111.0,
      "score": 6,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        },
        {
          "id": "k7vmabh",
          "author": "macnsleaze",
          "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
          "created_utc": 1699152017.0
        }
      ]
    },
    {
      "id": "k7xsq6i",
      "author": "Large-Management-117",
      "body": "Yes I agree with that. Although what my sister is doing is really hard to live with I love her to the moon and back and I have a hard time with showing her how upset this whole situation is making me. I think I just have to have a calm sit down conversation with her and talk to her about what I’m feeling.",
      "created_utc": 1699198809.0,
      "score": 3,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k7xiqsn",
          "author": "emotional_low",
          "body": "OP if she has genuinely lost that amount of weight (120 pounds) in such a short amount of time from purging she needs admitting like yesterday. ESPECIALLY if she is purging multiple times a day and \"leaving piles of vomit\" around.\n\nPlease look at my other comment; I truly believe that your sister is deeply unwell (more unwell than I think you seem to realise) and that she may also be suffering from major depression alongside her eating disorder (these things are comorbid a lot of the time). \n\nIt isn't uncommon for people with major depression to fester in unhygienic conditions and genuinely not give a crap about their living environment (I know because I've been there too). When you are depressed *nothing* matters, literally NOTHING. \n\nPlease don't listen to the other comments which suggest shaming her; shame will not work, she needs a professional medical intervention ASAP, and if she doesn't get that help your family poses a very high risk of losing her.\n\n(I say shame won't work because my family tried to shame me into getting better too; I also used to be bulimic, and the only way I was able to properly recover from both my eating disorder and depression was through professional medical intervention).",
          "created_utc": 1699194927.0
        },
        {
          "id": "k7xpbmc",
          "author": "Early_Face3134",
          "body": "No matter how unwell she is its wrong to treat her sister this way knowing she has also suffered with an eating disorder. I agree that shaming her would be an awful and completely unbeneficial thing to do but op shouldnt have to put up with cleaning up a vile and triggering mess because her sister is sick. Even at my absolute worst I wasn't that careless in regards to my families feelings",
          "created_utc": 1699197516.0
        }
      ]
    },
    {
      "id": "k8dlqh5",
      "author": "emotional_low",
      "body": "I agree with you 100%, OP doesn't deserve to have to deal with this; all I'm saying is that I think OPs sister may be more unwell than OP perceives her to be. \n\nFrom what OP has said, I just genuinely think that OP's sister needs a professional medical intervention based on how intensely this is affecting the whole family. She needs treatment YESTERDAY.\n\nI think the best way to come at this is with empathy and sympathy; \n\nYes even I was never this bad when I was at my worst, but do you know what? \n*We all could have been worse* the only people who couldn't have been worse sadly aren't here with us anymore.\n\nThere is no benefit to comparing how you reacted and how OP reacted when maybe, just maybe, OPs sister is in a worse way than either of us were. You know?",
      "created_utc": 1699462287.0,
      "score": 2,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k7xiqsn",
          "author": "emotional_low",
          "body": "OP if she has genuinely lost that amount of weight (120 pounds) in such a short amount of time from purging she needs admitting like yesterday. ESPECIALLY if she is purging multiple times a day and \"leaving piles of vomit\" around.\n\nPlease look at my other comment; I truly believe that your sister is deeply unwell (more unwell than I think you seem to realise) and that she may also be suffering from major depression alongside her eating disorder (these things are comorbid a lot of the time). \n\nIt isn't uncommon for people with major depression to fester in unhygienic conditions and genuinely not give a crap about their living environment (I know because I've been there too). When you are depressed *nothing* matters, literally NOTHING. \n\nPlease don't listen to the other comments which suggest shaming her; shame will not work, she needs a professional medical intervention ASAP, and if she doesn't get that help your family poses a very high risk of losing her.\n\n(I say shame won't work because my family tried to shame me into getting better too; I also used to be bulimic, and the only way I was able to properly recover from both my eating disorder and depression was through professional medical intervention).",
          "created_utc": 1699194927.0
        },
        {
          "id": "k7xpbmc",
          "author": "Early_Face3134",
          "body": "No matter how unwell she is its wrong to treat her sister this way knowing she has also suffered with an eating disorder. I agree that shaming her would be an awful and completely unbeneficial thing to do but op shouldnt have to put up with cleaning up a vile and triggering mess because her sister is sick. Even at my absolute worst I wasn't that careless in regards to my families feelings",
          "created_utc": 1699197516.0
        }
      ]
    },
    {
      "id": "k8doa3r",
      "author": "Yuthenia",
      "body": "For me personally I need the validation from anyone and it’s accomplishing. Only because I feel so alone in this world, even though I am surrounded by love ones .",
      "created_utc": 1699463214.0,
      "score": 1,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k8byw1h",
          "author": "Yuthenia",
          "body": "Has someone who’s around your sister weight and was overweight my whole life. This attention is what drives off to keep going and it’s not healthy but we feel “seen” and not the way are family makes us feel. For me it’s like an accomplishment and control over everything. It helps with my confidence boost and keeps me from feeling guilt.",
          "created_utc": 1699430945.0
        },
        {
          "id": "k8d0pvz",
          "author": "Large-Management-117",
          "body": "Do you mean attention the attention from boys and peers?",
          "created_utc": 1699454344.0
        }
      ]
    },
    {
      "id": "k7yqgy6",
      "author": "Valuable-Blood3233",
      "body": "I know it’s not my place and I hope I’m not too out of line for saying this, but saying she’s 18 so you can’t do anything sounds like the easy way out. \n\nShe’s still a kid that needs to be told what to do and where to go sometimes. Purging several times a day is so extremely dangerous, without any warning at any given point she could have a lethal side effect from it. And these things - as you know - don’t just play out by themselves. \n\nI think with enough force she could be convinced to go into treatment, when I was institutionalised I was 20 and not even living with my parents anymore, still they made me feel like I had to.",
      "created_utc": 1699210964.0,
      "score": 2,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        },
        {
          "id": "k7y97zo",
          "author": "Valuable-Blood3233",
          "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
          "created_utc": 1699204883.0
        },
        {
          "id": "k7yhzs3",
          "author": "Large-Management-117",
          "body": "Yeah, I think she thinks we don’t care. But she’s 18, so my parents no longer have control of admitting her, she has to say she wants to go. At this point it feels like we can’t do anything we just have to wait until the doctors force her to get treatment because she doesn’t want to stop",
          "created_utc": 1699208000.0
        }
      ]
    },
    {
      "id": "k7vmo7c",
      "author": "macnsleaze",
      "body": "Getting “cut off” would likely solve her problems, and yours. Kick her out and the bulimia will disappear when she’s no longer being spoiled or enabled.",
      "created_utc": 1699152193.0,
      "score": 2,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        },
        {
          "id": "k7vmabh",
          "author": "macnsleaze",
          "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
          "created_utc": 1699152017.0
        },
        {
          "id": "k7vmhtb",
          "author": "Large-Management-117",
          "body": "Yeah I think we’re about at that place. She’s 18, and I don’t think she’s gonna realize what she’s putting my family though until she lives on her own and realizes how disgusting everything is and how much money it costs for her to live the way she does.",
          "created_utc": 1699152111.0
        }
      ]
    },
    {
      "id": "k7xuhvg",
      "author": "Early_Face3134",
      "body": "For me when I was really unwell one of the things that drove me to get better was the effect I was having on my loved ones. It could be really beneficial for you and her to give her a reality check, she might not realize the toll its taking on you so a calm conversation might really help. She needs to know her behaviour is wrong without her feeling like shes being pushed away to the point of anger or disregard for your feelings",
      "created_utc": 1699199473.0,
      "score": 1,
      "context": [
        {
          "id": "k7v7avl",
          "author": "Jentheheb",
          "body": "I’m sorry to say, but something is very wrong in your household. Your sister needs professional help pronto.",
          "created_utc": 1699145588.0
        },
        {
          "id": "k7v8c5t",
          "author": "Large-Management-117",
          "body": "I agree. She’s so obsessed with the attention she’s getting from boys that she doesn’t want to stop. She was 230 pounds at 16 and now at 18 she must be 100. She only started getting attention when she lost weigh t which is so sad but that’s what’s happening",
          "created_utc": 1699146022.0
        },
        {
          "id": "k7xiqsn",
          "author": "emotional_low",
          "body": "OP if she has genuinely lost that amount of weight (120 pounds) in such a short amount of time from purging she needs admitting like yesterday. ESPECIALLY if she is purging multiple times a day and \"leaving piles of vomit\" around.\n\nPlease look at my other comment; I truly believe that your sister is deeply unwell (more unwell than I think you seem to realise) and that she may also be suffering from major depression alongside her eating disorder (these things are comorbid a lot of the time). \n\nIt isn't uncommon for people with major depression to fester in unhygienic conditions and genuinely not give a crap about their living environment (I know because I've been there too). When you are depressed *nothing* matters, literally NOTHING. \n\nPlease don't listen to the other comments which suggest shaming her; shame will not work, she needs a professional medical intervention ASAP, and if she doesn't get that help your family poses a very high risk of losing her.\n\n(I say shame won't work because my family tried to shame me into getting better too; I also used to be bulimic, and the only way I was able to properly recover from both my eating disorder and depression was through professional medical intervention).",
          "created_utc": 1699194927.0
        },
        {
          "id": "k7xpbmc",
          "author": "Early_Face3134",
          "body": "No matter how unwell she is its wrong to treat her sister this way knowing she has also suffered with an eating disorder. I agree that shaming her would be an awful and completely unbeneficial thing to do but op shouldnt have to put up with cleaning up a vile and triggering mess because her sister is sick. Even at my absolute worst I wasn't that careless in regards to my families feelings",
          "created_utc": 1699197516.0
        },
        {
          "id": "k7xsq6i",
          "author": "Large-Management-117",
          "body": "Yes I agree with that. Although what my sister is doing is really hard to live with I love her to the moon and back and I have a hard time with showing her how upset this whole situation is making me. I think I just have to have a calm sit down conversation with her and talk to her about what I’m feeling.",
          "created_utc": 1699198809.0
        }
      ]
    },
    {
      "id": "k80k21e",
      "author": "Large-Management-117",
      "body": "As much as I agree, where we live 18 is a legal adult. But I think something has got to get to her and make her realize she needs help.",
      "created_utc": 1699235889.0,
      "score": 1,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        },
        {
          "id": "k7y97zo",
          "author": "Valuable-Blood3233",
          "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
          "created_utc": 1699204883.0
        },
        {
          "id": "k7yhzs3",
          "author": "Large-Management-117",
          "body": "Yeah, I think she thinks we don’t care. But she’s 18, so my parents no longer have control of admitting her, she has to say she wants to go. At this point it feels like we can’t do anything we just have to wait until the doctors force her to get treatment because she doesn’t want to stop",
          "created_utc": 1699208000.0
        },
        {
          "id": "k7yqgy6",
          "author": "Valuable-Blood3233",
          "body": "I know it’s not my place and I hope I’m not too out of line for saying this, but saying she’s 18 so you can’t do anything sounds like the easy way out. \n\nShe’s still a kid that needs to be told what to do and where to go sometimes. Purging several times a day is so extremely dangerous, without any warning at any given point she could have a lethal side effect from it. And these things - as you know - don’t just play out by themselves. \n\nI think with enough force she could be convinced to go into treatment, when I was institutionalised I was 20 and not even living with my parents anymore, still they made me feel like I had to.",
          "created_utc": 1699210964.0
        }
      ]
    },
    {
      "id": "k7vms8d",
      "author": "Large-Management-117",
      "body": "Yeah I really agree with that. I feel like my parents are just waiting to get fed up enough to be able to do that to her. But the topic has definitely come up many times before",
      "created_utc": 1699152243.0,
      "score": 1,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        },
        {
          "id": "k7vmabh",
          "author": "macnsleaze",
          "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
          "created_utc": 1699152017.0
        },
        {
          "id": "k7vmhtb",
          "author": "Large-Management-117",
          "body": "Yeah I think we’re about at that place. She’s 18, and I don’t think she’s gonna realize what she’s putting my family though until she lives on her own and realizes how disgusting everything is and how much money it costs for her to live the way she does.",
          "created_utc": 1699152111.0
        },
        {
          "id": "k7vmo7c",
          "author": "macnsleaze",
          "body": "Getting “cut off” would likely solve her problems, and yours. Kick her out and the bulimia will disappear when she’s no longer being spoiled or enabled.",
          "created_utc": 1699152193.0
        }
      ]
    },
    {
      "id": "k8227lu",
      "author": "Valuable-Blood3233",
      "body": "I don’t think you realise what recovery requires",
      "created_utc": 1699270787.0,
      "score": 1,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        },
        {
          "id": "k7vmabh",
          "author": "macnsleaze",
          "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
          "created_utc": 1699152017.0
        },
        {
          "id": "k7vmhtb",
          "author": "Large-Management-117",
          "body": "Yeah I think we’re about at that place. She’s 18, and I don’t think she’s gonna realize what she’s putting my family though until she lives on her own and realizes how disgusting everything is and how much money it costs for her to live the way she does.",
          "created_utc": 1699152111.0
        },
        {
          "id": "k7vmo7c",
          "author": "macnsleaze",
          "body": "Getting “cut off” would likely solve her problems, and yours. Kick her out and the bulimia will disappear when she’s no longer being spoiled or enabled.",
          "created_utc": 1699152193.0
        }
      ]
    },
    {
      "id": "k816l41",
      "author": "neilbreenfan404",
      "body": "If someone is a danger to themselves, in many places this can be enough to admit them without their own willingness to go. It depends on your jurisdiction and what country/province/state you are in on what exactly qualifies a person for this, esp in regards to EDs since there’s such a grey area legally and medically. But it may be worth looking into. If she is leaving her mess around she either doesn’t have the will/energy/care to clean it or she wants attention. Or both. This is a major red flag that unfortunately no amount of you and your family showing you care is going to definitively be enough to make her believe it. I saw you said she likes the attention she gets from boys, and seems to want attention from you guys as well, and all of this really seems like she has a really low sense of self worth. And her doing this everyday is just so so damaging. As someone who’s been there, purging after every meal, even the smallest snack, everyday, without fail for a long time, sometimes I would claim I was sick physically or drunk or hungover because I had never told anyone about my Ed and wasn’t getting treatment, and I thought that at least that level of attention and concern would be validating enough for me. But it wasn’t. I still craved validation and positive attention. I wanted to be loved and didn’t think that could happen with my body looking how it did, or does, I still struggle with this now tbh. But I have progressed in my recovery enough to where I’m not purging everyday and I can eat at least one full meal a day. I have a long way to go of course, but the point I am trying to make is that, sometimes people do this kind of thing when they are at such a low point that they think they are worthless, or at least worthless without their ED. Often seeing their ED as the one thing that they are capable at, as the one comfort they have. I really would suggest trying in whatever way you can to help her. I totally get that you’re in recovery as well and I get that is hard to have to help someone else when you’re still struggling somewhat yourself, so I’m not suggesting that you aren’t trying hard enough, I just think this may be a bit more of an urgent situation than it seems. I mean, what she is doing is really dangerous. Best of luck to you tho! I wish you and your sister the best in terms of your recovery! This stuff is a bitch to deal with, I hope your family is able to work through this and that y’all find some peace.💛",
      "created_utc": 1699246679.0,
      "score": 2,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        },
        {
          "id": "k7y97zo",
          "author": "Valuable-Blood3233",
          "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
          "created_utc": 1699204883.0
        },
        {
          "id": "k7yhzs3",
          "author": "Large-Management-117",
          "body": "Yeah, I think she thinks we don’t care. But she’s 18, so my parents no longer have control of admitting her, she has to say she wants to go. At this point it feels like we can’t do anything we just have to wait until the doctors force her to get treatment because she doesn’t want to stop",
          "created_utc": 1699208000.0
        },
        {
          "id": "k7yqgy6",
          "author": "Valuable-Blood3233",
          "body": "I know it’s not my place and I hope I’m not too out of line for saying this, but saying she’s 18 so you can’t do anything sounds like the easy way out. \n\nShe’s still a kid that needs to be told what to do and where to go sometimes. Purging several times a day is so extremely dangerous, without any warning at any given point she could have a lethal side effect from it. And these things - as you know - don’t just play out by themselves. \n\nI think with enough force she could be convinced to go into treatment, when I was institutionalised I was 20 and not even living with my parents anymore, still they made me feel like I had to.",
          "created_utc": 1699210964.0
        },
        {
          "id": "k80k21e",
          "author": "Large-Management-117",
          "body": "As much as I agree, where we live 18 is a legal adult. But I think something has got to get to her and make her realize she needs help.",
          "created_utc": 1699235889.0
        }
      ]
    },
    {
      "id": "k8d1h3m",
      "author": "Large-Management-117",
      "body": "I went through recovery myself so I understand it. She’s just so unwilling to even talk about it like I feel like recovery doesn’t even cross her mind, she expects us to let her live like this her whole life. And accept that our lives are just going to be like this.",
      "created_utc": 1699454653.0,
      "score": 1,
      "context": [
        {
          "id": "k7vlv4h",
          "author": "macnsleaze",
          "body": "Shame her.",
          "created_utc": 1699151828.0
        },
        {
          "id": "k7vm1hj",
          "author": "Large-Management-117",
          "body": "How would I do that? It’s so hard because it’s a mental illness but I feel like most people with bulimia try a bit harder to hide their vomit.",
          "created_utc": 1699151907.0
        },
        {
          "id": "k7vmabh",
          "author": "macnsleaze",
          "body": "“This is f*cking disgusting. No one deserves live in these conditions, mental illness or not. Learn to clean up after yourself or get out.” You don’t have to tolerate that.",
          "created_utc": 1699152017.0
        },
        {
          "id": "k7vmhtb",
          "author": "Large-Management-117",
          "body": "Yeah I think we’re about at that place. She’s 18, and I don’t think she’s gonna realize what she’s putting my family though until she lives on her own and realizes how disgusting everything is and how much money it costs for her to live the way she does.",
          "created_utc": 1699152111.0
        },
        {
          "id": "k7vmo7c",
          "author": "macnsleaze",
          "body": "Getting “cut off” would likely solve her problems, and yours. Kick her out and the bulimia will disappear when she’s no longer being spoiled or enabled.",
          "created_utc": 1699152193.0
        },
        {
          "id": "k8227lu",
          "author": "Valuable-Blood3233",
          "body": "I don’t think you realise what recovery requires",
          "created_utc": 1699270787.0
        }
      ]
    },
    {
      "id": "k8d19b9",
      "author": "Large-Management-117",
      "body": "Thank you. I appreciate hearing you’re input. I feel like she is going to end up with serious problems very soon due to her ED but is incapable of seeing it because she loves what her ED has given her",
      "created_utc": 1699454564.0,
      "score": 2,
      "context": [
        {
          "id": "k7xbpey",
          "author": "Valuable-Blood3233",
          "body": "I honestly think it’s to grab your attention. I used to not lock the bathroom doors in hopes of someone finding out. I knew my family knew so I knew they didn’t take any actions in order to „save“ me. I was also young like your sister so I didn’t really reflect on what my actual needs were and what was realistic to ask of someone.\nI wouldn’t leave a mess but sometimes I didn’t brush my teeth afterwards so I would smell like puke, I would make loud noises or talk loudly about my issues on the phone so my family would hear.\nI also had an anorexic sister, I don’t know about your situation but for me it was harmful to see how she got attention, therapy and help and I didn’t.\n\nBut in the end I think I wanted someone to put me in an institution. Talk to your parents and make them take action. The way she’s behaving is disrespectful and not okay, but it fucks you up to know everybody is aware and no one is „saving“ you",
          "created_utc": 1699191935.0
        },
        {
          "id": "k7xtjva",
          "author": "Large-Management-117",
          "body": "I forgot to mention this, but she was in an outpatient program for 4 months. Same one I was in, I can say when I was it in it was very hard, and my sister had a hard time too. When we would pick her up from it she would say she has to “pee” and we had to stop at a gas station to let her go. We would say we know that is not what she’s going to do but she would just yell at us, getting louder and louder. And the medical system is so f*cked up that the weight lost to get her admitted is over a year long. \nAnd about my own eating disorder, I can never help but thinks she does this because she wants her body to look like mine, I have always been petite, but now in recovery I eat proper meals and maintain a healthy lifestyle and am still petite. I don’t think hee body is meant to look like mine but I think her goal is to look like me. Which breaks my heart",
          "created_utc": 1699199120.0
        },
        {
          "id": "k7y97zo",
          "author": "Valuable-Blood3233",
          "body": "I feel so sorry for you but I’ve also been in your sisters position, my sister has always been smaller than me, even after 6 years of bulimia I never got close to where she is when she’s healthy. \nI think if a program hasn’t helped her she needs another program. If she’s waitlisted so be it, but something needs to happen and she needs to know that her illness isn’t accepted and ignored. I don’t think that’s what is happening but I can imagine that’s what she feels.",
          "created_utc": 1699204883.0
        },
        {
          "id": "k7yhzs3",
          "author": "Large-Management-117",
          "body": "Yeah, I think she thinks we don’t care. But she’s 18, so my parents no longer have control of admitting her, she has to say she wants to go. At this point it feels like we can’t do anything we just have to wait until the doctors force her to get treatment because she doesn’t want to stop",
          "created_utc": 1699208000.0
        },
        {
          "id": "k7yqgy6",
          "author": "Valuable-Blood3233",
          "body": "I know it’s not my place and I hope I’m not too out of line for saying this, but saying she’s 18 so you can’t do anything sounds like the easy way out. \n\nShe’s still a kid that needs to be told what to do and where to go sometimes. Purging several times a day is so extremely dangerous, without any warning at any given point she could have a lethal side effect from it. And these things - as you know - don’t just play out by themselves. \n\nI think with enough force she could be convinced to go into treatment, when I was institutionalised I was 20 and not even living with my parents anymore, still they made me feel like I had to.",
          "created_utc": 1699210964.0
        },
        {
          "id": "k80k21e",
          "author": "Large-Management-117",
          "body": "As much as I agree, where we live 18 is a legal adult. But I think something has got to get to her and make her realize she needs help.",
          "created_utc": 1699235889.0
        },
        {
          "id": "k816l41",
          "author": "neilbreenfan404",
          "body": "If someone is a danger to themselves, in many places this can be enough to admit them without their own willingness to go. It depends on your jurisdiction and what country/province/state you are in on what exactly qualifies a person for this, esp in regards to EDs since there’s such a grey area legally and medically. But it may be worth looking into. If she is leaving her mess around she either doesn’t have the will/energy/care to clean it or she wants attention. Or both. This is a major red flag that unfortunately no amount of you and your family showing you care is going to definitively be enough to make her believe it. I saw you said she likes the attention she gets from boys, and seems to want attention from you guys as well, and all of this really seems like she has a really low sense of self worth. And her doing this everyday is just so so damaging. As someone who’s been there, purging after every meal, even the smallest snack, everyday, without fail for a long time, sometimes I would claim I was sick physically or drunk or hungover because I had never told anyone about my Ed and wasn’t getting treatment, and I thought that at least that level of attention and concern would be validating enough for me. But it wasn’t. I still craved validation and positive attention. I wanted to be loved and didn’t think that could happen with my body looking how it did, or does, I still struggle with this now tbh. But I have progressed in my recovery enough to where I’m not purging everyday and I can eat at least one full meal a day. I have a long way to go of course, but the point I am trying to make is that, sometimes people do this kind of thing when they are at such a low point that they think they are worthless, or at least worthless without their ED. Often seeing their ED as the one thing that they are capable at, as the one comfort they have. I really would suggest trying in whatever way you can to help her. I totally get that you’re in recovery as well and I get that is hard to have to help someone else when you’re still struggling somewhat yourself, so I’m not suggesting that you aren’t trying hard enough, I just think this may be a bit more of an urgent situation than it seems. I mean, what she is doing is really dangerous. Best of luck to you tho! I wish you and your sister the best in terms of your recovery! This stuff is a bitch to deal with, I hope your family is able to work through this and that y’all find some peace.💛",
          "created_utc": 1699246679.0
        }
      ]
    }
  ]
}