{
  "id": "17uaiem",
  "subreddit": "bulimia",
  "author": "Skizo999",
  "created_utc": 1699881704.0,
  "title": "Most disgusting embarrassing sad heartbreaking things bulimia made you do?",
  "selftext": "Even though a few people know about my ED, not a single person I know knows all the degrading shit I did. I’m starting this thread both to get it off my chest in this week’s attempt to stop the cycle and if anyone ever reads it after feeling shame and guilt - just know you’re not alone. \n\n\nGoing through my vomit and smelling it to see what came up xoxo \n\nPurging at my 86 year old grandmothers house \n\nGoing to the toilet if u know what I mean while still eating at the same time because I physically couldn’t stop myself from putting the food in my mouth \n\nEating from the trash in my house \n\nContemplating taking a trash bag full of binge food out of the big ass cans outside my building \n\nPouring fairy liquid over the rest of my binge food to stop myself from eating it and eating it anyway \n\nPurging into a trash can in my room while my friend was sleeping over \n\nSpending my literal savings on binge food \n\nDebating taking out a small LOAN to sustain my life and bingeing \n\nStealing \n\nLying to everyone around me to get money that I then spent on food\n\nPurging food my family cooked for me \n\nPurging at airports & in airplanes\n\nSpending money I got from my family for some occasion on binge food \n\nPurging my graduation celebration dinner \n\nPurging a Michelin star 5 course meal. Twice. Once to celebrate something and the other time it was a gift from the company I work at \n\nEating literally ingredients not even food. Butter, cream, etc. \n\n\nIdk if I can think of any more but I’ve purged blood before, thought I was having a heart attack, the whole 9 yards. I have promised myself time and time again that today will be the last day but the guilt and shame I feel and the self hatred I have towards myself if I’m bloated or something is just insane. It’s preventing me from stopping the cycle and getting better. I love fitness & bodybuilding but am completely incapable of achieving any of my goals at the minute. \n\nWriting this today so far I got halfway through the day after a particularly bad and long cycle of daily multiple times purging. Any tips on how to stop always welcome. Hope it gets better for me and u too",
  "url": "https://www.reddit.com/r/bulimia/comments/17uaiem/most_disgusting_embarrassing_sad_heartbreaking/",
  "score": 261,
  "num_comments": 187,
  "comments": [
    {
      "id": "k92ban4",
      "author": "None",
      "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
      "created_utc": 1699881998.0,
      "score": 127,
      "context": []
    },
    {
      "id": "k92qk7p",
      "author": "None",
      "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
      "created_utc": 1699888681.0,
      "score": 73,
      "context": []
    },
    {
      "id": "k92f7la",
      "author": "bunny_butterfly",
      "body": "Purging at every family gathering, and especially, my entire 18th birthday cake 💔",
      "created_utc": 1699883850.0,
      "score": 60,
      "context": []
    },
    {
      "id": "k92kmnr",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699886256.0,
      "score": 43,
      "context": []
    },
    {
      "id": "k92rcvk",
      "author": "Fuwa_Fuwa_",
      "body": "Purged at my sister's wedding as the MoH, cousin's wedding during speeches, and both of my grandparents' funerals.\n\nStole an entire pizza from a friends workplace party \n\nPurged in an outhouse in 40-degree heat + humidity\n\nSometimes I accidentally pissed and crapped myself (multiple times) from the force of my purges, didn't help that I was trying to stop laxatives either...",
      "created_utc": 1699888990.0,
      "score": 47,
      "context": []
    },
    {
      "id": "k92grrx",
      "author": "None",
      "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
      "created_utc": 1699884568.0,
      "score": 29,
      "context": []
    },
    {
      "id": "k92hfpp",
      "author": "Friedsurimi",
      "body": "A lot of shitty things actually\n- missing an important choir concert because I was in a session of b/p because I was anxious\n- missing a lot of meetings, uni lessons, activities with friends because I was too busy b/p\n- Stealing. Like, a lot. Initially I just shoplifted in big supermarkets because fûck capitalism, but then after years it got kinda out of hand, to the point I became kleptomaniac and started stealing small unnoticeable amounts of food every day from every person’s house I go to and every person that lives in the uni dormitory where I also live now. + I got caught like 5 times and every time I played the eating disorder card hoping the employees/guards would’ve had mercy and pity for me in order to not call the cops and not have my criminal record get dirty at like 17. \n- purging in unconventional places: empty bottles, bin bags in my home to the point they were so full that sometimes they fuggin brOKE IT WAS DISGUSTING, in the middle of a parking lot, in plant pots…\n- spending money I shouldn’t have spent (other people’s money, savings for university and the dormitory) in binge food.\n\nThese are the current things that come to my mind but I think there is much more awful stuff that I’ve done. I’m just unsalvageable at this point lmao",
      "created_utc": 1699884868.0,
      "score": 33,
      "context": []
    },
    {
      "id": "k92wkt9",
      "author": "TinyStudio7881",
      "body": "I recognize myself in your post. I guess a lot of us do. \nI am 33, started bingeing and purgeing when I was 16 so I've \"done it all\". \n\nPuking in garbage bags and hiding it in my closet is a classic. \n\nPurgeing expensive meals, or meals that friends or family have lovingly cooked for me, absolutely. \n\nGoing through the puke in the toilet with my hands to check what I purged. \n\nSpending insane amounts of money on food and doordash, yup. I keep ordering doordash even though I'm in credit card debt. \n\nI used to say that I'll \"go for a walk\" just to go into the woods near my old house so I could go purge. At our cabin I would just go in the backyard and purge in some bushes. \n\nI've eaten and binged cakes or cupcakes that I had baked for parties or family events so I had to say I burnt them in the oven or something. \n\nThe list goes on.. all the lying.. there is just way too much.",
      "created_utc": 1699890979.0,
      "score": 29,
      "context": []
    },
    {
      "id": "k92epbp",
      "author": "royceriel",
      "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
      "created_utc": 1699883615.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k92jc1b",
      "author": "RazorsandMittens",
      "body": "I purged at my sister’s birthday party and I threw up in the bathroom and cried on the floor for an hour\n\nAte legos cause I got so desperate to put anything in my mouth\n\nDrank so many energy drinks to met my calorie goal and ended up getting so sick I almost had to go to the hospital \n\nFell asleep in my bathtub because I was vomiting so much I just passed out in a puddle of my own puke\n\nAte nothing but butter for a week and got so sick I couldn’t eat because it hurt\n\nPuked straight up bile and I couldn’t talk because of how painful it was",
      "created_utc": 1699885696.0,
      "score": 18,
      "context": []
    },
    {
      "id": "k92wcwo",
      "author": "curvy_mermaid",
      "body": "Managing to purge so hard I caused rib torsions (a few ribs \"popped\" out of their spot) and then being too ashamed to tell the truth so I told medical professionals and everyone else that I \"coughed wrong\" and that's how it happened. 3 weeks later, multiple visits to a chiropractor, and I'm still dealing with the pain but honestly it hasn't fully stopped me from purging. 😬",
      "created_utc": 1699890897.0,
      "score": 19,
      "context": []
    },
    {
      "id": "k933yx4",
      "author": "crankthatshane",
      "body": "so this may be different from a lot of the responses here….because my ED, according to my doctor, is more of anorexia with b/p episodes, but the purging is almost always via laxatives, not vomiting. laxatives have made me do some embarrassing things.\n\n1. once took so many laxatives that it was coming out both ends (diarrhea and vomitting)\n\n2. once took laxatives on an off day but got called into work later that day. had to go blow up the bathroom a few times in the span of an hour and genuinely felt like i was going to black out. but i had to power though because i didn’t want to leave early on a shift i picked up. i was just embarrassed that i had to keep walking away to shit.\n\n3. shit into a garbage can in my bedroom because i was too embarrassed to go to the bathroom while my dad was getting ready for work. left the bag in my room for a good 6 hours before taking it outside. entire upstairs floor of my house smelled like an outhouse for a few days. the poop also ended up on my bed sheets somehow. no one mentioned the smell but i know it was noticeable and i was so embarrassed.\n\n4. eating food ingredients or condiments because i didn’t have any actual food left after a binge episode",
      "created_utc": 1699893708.0,
      "score": 15,
      "context": []
    },
    {
      "id": "k92fif2",
      "author": "Crimson-Rose28",
      "body": "Go into debt, shoplift, lie, lie by omission, hide things from my husband, binging and purging food that belonged to someone else or was gifted to me, purging in public places, eat food from the trash can…\nThat’s all I can think of for now. It’s so disgusting. I’m currently debating buying more binge food even though I just paid my last monthly bill and have nothing.",
      "created_utc": 1699883991.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k92fmxo",
      "author": "None",
      "body": "I don’t binge a lot nowadays but yesterday I had a chocolate cake at home. I had planned to give it as a part of a present to a friend when she had a birthday dinner, but I was the only one who had a present, so it felt weird to give a big present, so only gave the flower but kept the book and the chocolate ( it was in the same package) Normally I don’t have problems with candy since I am strict sugar free, but i was like, take 2 pieces and then throw it in the trash. And I did. And a few minutes later pick it up from the trash. And that feeling, digging in the disgusting trash. That feeling. And put onion on it. Try later again. I am proud bc I didn’t eat all of it. It is still in the trash (!). And probably it is not tasty today, so now it is fine. But still I KNOW it is there. Wouldn’t be surprised if I tried again later. That stress can no one without an ed understand. So shameful that you need to contaminate it to be sure not to eat it.",
      "created_utc": 1699884048.0,
      "score": 10,
      "context": []
    },
    {
      "id": "k9408vs",
      "author": "derederellama",
      "body": "tfw you purge at a family get-together and have to wipe the tears out of your eyes and take a few deep breaths before going back to the dinner table like nothing happened 🙃",
      "created_utc": 1699905133.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k92grbz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699884562.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k92vjox",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699890596.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k93164h",
      "author": "None",
      "body": "I puked in a trash bag and left it in my bedroom, shut the door, and went into the family's basement to sleep. My mom woke me up and said she found it. Then she left for work.\n\nSpending a ridiculous amount of money on binge food, binging, purging, throwing the rest of the food in the trash and spraying it with Windex, going back into the trash and pulling what I could salvage out, binge and then purge again\n\nSI to stop the urge to b/p \n\nPurging expensive food at a restaurant\n\nCanceling plans/calling out of work to b/p or recoup from a b/p\n\nB/Ping in college bathrooms, common rooms, dorm rooms\n\nSo much money down the toilet.",
      "created_utc": 1699892682.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k9665w7",
      "author": "Mariahpariah51",
      "body": "Just knowing that I probably smelled like vomit quite often. I know I would wash my hands many times but they would still smell.",
      "created_utc": 1699936030.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k92i28u",
      "author": "Extension-Lychee-296",
      "body": "Mostly just having my grandmother interrupt my purging by asking a perfectly innocent question outside my door.\n\nKeeping bags of throw up in my room because of fear of having them clog toilet and not wanting my grandma to find them in the trash can.\n\nPuking in a hospital parking lot. Puking in public in general.",
      "created_utc": 1699885144.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k93ig4p",
      "author": "666throwawaytrash",
      "body": "I've separated myself from the world to have this. I am not even at my ideal weight I'm just fat so there is no relief. But even with that I can't stop. I am caged up in my addiction that I can't get close to anyone for fear of them finding out how bad it is.",
      "created_utc": 1699898874.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k93j4sy",
      "author": "authlia",
      "body": "oh mines gross. i used to throw up in bottles and sometimes they'd explode. milk cartons were the worst. literally disintegrated and turned into black mold. one time during new years i threw up in a cup while my (ex) friends were over and i went to the bathroom. they confronted me abt it and i was literally sooo humiliated. like i wanted to rot away, but we all ignored it. my mom knows i throw up almost daily and i somehow forced her to ignore it. i think she tries to believe i purge less. it's such a shameful disease for me. very embarrassing but i cant stop. i've also spent like 3k on binge food it's terrible 😭 my teeth r lowk rotting. my best friend is also bulimic so i don't feel as bad when we're together. she gets me lol.",
      "created_utc": 1699899116.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k94b48k",
      "author": "None",
      "body": "Eating the candy that was left in my puke and puking it out again",
      "created_utc": 1699908977.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k9604pl",
      "author": "katmeisie",
      "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
      "created_utc": 1699933235.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k939an1",
      "author": "Curious_Goat_8991",
      "body": "I also purged my college graduatation dinner. Literally spent 4 years pursuing a degree and on a day that was supposed to be happy and celebratory I ruined it. I felt so guilty for that. You’re not alone.",
      "created_utc": 1699895640.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k92p4u1",
      "author": "i-am-in-severe-pain",
      "body": "Clogging up my houses plumbing because I keep puking in the shower, the sinks are backed up and they have no idea it’s likely my fault",
      "created_utc": 1699888109.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k94neuu",
      "author": "Rytlane",
      "body": "I searched for a wooded area, pulled in, got out of my car, & purged. Some campers saw me & just stared. I couldn't get back to my car fast enough & get out of there fast enough. I felt so base.",
      "created_utc": 1699913354.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k95tg0m",
      "author": "smyles07",
      "body": "Dumpster diving the same dumpster for three different restaurants foods.\n\nFeeling so bad after bingeing that I don’t know if it’s because said dumpster-dived food was bad/food poisoning or if I ate too much.\n\nGetting soaked in the rain so I could purge outside without roomie knowing\n\nDigging for food I threw out to not binge, only to binge it. \n\nCrying while purging, saying why do I do this / it’s the last time, only to do it 20 more times after that. (I’m a 30 yo male btw)\n\nSneaking food into/out of the house a hundred times before\n\nThe list goes on.",
      "created_utc": 1699930342.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k97ajul",
      "author": "Skizo999",
      "body": "GUYS THANK YOU SO MUCH FOR ALL YOUR COMMENTS IT MADE ME FEEL LESS ALONE. I FINALLY WENT ONE DAY WITHOUT IT ❤️❤️❤️ sending you all love",
      "created_utc": 1699963942.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k97dl0f",
      "author": "Pauladerby",
      "body": "PLEASE read my article on here entitled “Menier’s Disease life story”. I want you to know all this please?? My entire life is ruined from this habit that began in Olympic training at age 13. I’m almost completely deaf now too. Purging can cost you teeth, hearing and the worst ever possible life consequences. I beg you to seek help to stop. Even if it’s reading the comments you get. I send you my best!",
      "created_utc": 1699965646.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k98kaub",
      "author": "beanzmeanzgreenz",
      "body": "Eating left overs from a random customers plate while in eye shot of said customers\n\nUsing my recently deceased grandmothers house to purge telling my family I was “sorting out her stuff and coming to terms with her death” making her kitchen and toilet disgusting so when other family members came round they thought that’s how she’d been living even though she was the cleanest tidiest lady ever\n\nStealing of course\n\nSitting in my car for hours on end in supermarket car parks binging and avoiding eye contact with anyone and someone I know coming up to the car and asking why I’ve got a massive pot of coleslaw and half eaten loaf of bread in there with me\n\nGiving people lifts in my car which is filthy and smells from all the food \n\nCar breaking down on the way to the public toilet I use to purge and having to throw up into a Pringle can on the side of the road in the middle of the day",
      "created_utc": 1699982988.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k991vr7",
      "author": "scrambled-satellite",
      "body": "Probably chewing and spitting into bags in the grocery store parking lot or purging trail mix & cereal in my parent’s house after nearly ODing on lax.",
      "created_utc": 1699989278.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k92qrh1",
      "author": "hollysimone",
      "body": "Last year when I was staying at my parents house for Thanksgiving holidays I hid upstairs in the bedroom and purged into some plastic bags. I felt fucking insane but once I had it in my head I truly could not keep from acting on it. I’ve been in recovery (not fully my choice, but hey, I’m recovering now) for 9 weeks but Thanksgiving is coming up again in a couple of weeks and I’m so scared I won’t be able to keep it up.",
      "created_utc": 1699888760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k93kp9n",
      "author": "None",
      "body": "I've spent hundreds of dollars on food I intended to throw up and I've purged multiple times in the public restroom at my  job 🙃",
      "created_utc": 1699899667.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k93o3je",
      "author": "Froggymushroomfrog",
      "body": "Eating food from the food bin so all other rotten food was in there too (that was my lowest point).",
      "created_utc": 1699900858.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k94hare",
      "author": "Fast-alex1",
      "body": "you’re not alone. \ni did the EXACT SAME THINGS you did it’s actually heartbreaking and hilarious at the same time . \ni’ve been struggling for half a decade now i can’t even see myself recovering any time soon",
      "created_utc": 1699911151.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k94xms2",
      "author": "Willow_moth_bat12",
      "body": "Purging at a strangers house ( parents were going to a church group, and they would meet at different peoples houses there and have dinner) and there was children inside and I was supposed to be entertaining and watching them\n\nEdit- I did it in their backyard too",
      "created_utc": 1699917269.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k952t80",
      "author": "moonbrows",
      "body": "I used to purge so much I needed bin bags and would put one in my room, fill it with trash etc but also whenever I felt like I needed to do it - it would be in there. Think I had about 7 bags in one week then had to rush away from family home quick and they went in to clean and went through them wondering wtf I’d been collecting and I think they probably were quite sick too \nPurging in the hospital after I’d been admitted for oding because I thought the coating would have calories \nToo scared to brush my teeth bc they’re always covered in bile so now they’re awful but I think they’ll be worse if I brush the bile into them \n\nAnd spitting and chewing I genuinely think in my worst days I once ate what I’d spat out because there was nothing else around and then purge out of disgust,\n\nRecently had to see my grandad in the hospital and he had passed away and I excused myself from my family as the nurses spoke to us so I could purge my breakfast up and cried so much while doing it I choked on my snot and I’m so sad that I wasn’t there the whole time and sequestered myself to a fckn hospital cubicle",
      "created_utc": 1699919367.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k954l87",
      "author": "Me-effy",
      "body": "Thankyou I feel less alone with some of the things I  have done can anyone answer if purging can also be laxatives misuse ??",
      "created_utc": 1699920091.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k95cr8z",
      "author": "Liveymcc",
      "body": "Purging in a las vegas rest room in a stall next to a woman having violent diarrhea and not stopping\n\nKeeping a puke bucket next to my bed for weeks then being humiliated when my fiancé found it \n\nEating expired food getting sick from it then still eating it the next day anyway\n\nPurging up tons of blood but not stopping\n\nOh and purging in the restroom at a wedding during the husband and wife dance",
      "created_utc": 1699923456.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k95hibm",
      "author": "ResolutionCareful255",
      "body": "Purged in a psych ward kitchen sink because I was supervised in the bathroom after meals, got caught\n\nTore the back of my throat from purging too often and too heavy foods (hard to digest)\n\nOne of my worst memories ever was purging 2L of Ben and jerrys half an hour after eating, made me feel like I was dying \n\nPurged after having a Nasogastic feed when I was tube fed in a garden, my ng tube came out and I reinserted it myself \n\nStarbucks toilet purge, got walked in on because I forgot to lock the door, I said I had food poisoning \n\nGave myself food poisoning so I would be sick \n\nEmbarrassed but I am almost one year purge free and over one year NG tube free, we do recover ❤️‍🩹",
      "created_utc": 1699925425.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k95scpc",
      "author": "Mochihamster",
      "body": "Purging the food my boyfriend took time to lovingly make for me.\n\nPurging the food my mom took time to lovingly make for me.\n\nPurging food my boyfriend buys for me because he thought of me and how i liked it before this shitty relapse.\n\nPurging food my mom buys for me because she thought of me too.\n\n\n\nIt made me let the 2 people I care about most down, and i still hide it from them. I can't stop but I want to.",
      "created_utc": 1699929898.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k97pv7n",
      "author": "dykediaries",
      "body": "sneaking out to have a ‘smoke’ while eating out, but actually going behind the restaurant or into the car to puke into the bushes / a cup.",
      "created_utc": 1699971454.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k98ngv3",
      "author": "Winter_Astronomer_51",
      "body": "i used to go do laundry which was downstairs at my house and then i would walk into an alleyway bringing a dirty towel with me and purge in the alley way, bury it, and then wipe myself up w the towel and put it in the washer",
      "created_utc": 1699984113.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k92osl2",
      "author": "None",
      "body": "Before being forced into inpatient I went a little crazy. I broke the septic system w/ my purging which was a $9k repair, so instead I started digging holes on the property to purge in. They were 6 ft by 6 ft. My stepdad actually helped dig them. They were just desperate not to fuck w the septic tank again. When they realized I filled up those holes way too fast they told me to find another way, so I bought those huge Tupperware containers people use for Christmas decorations & started filling those up and dumping them on country roads or dumpsters. It got all over my car’s upholstery and I had to rip out the trunk lining. Purging in the trash cans at home was a bust btw - we got maggots and they were way too heavy, we were warned by the trash company.\n\nDuring this time I’d also dumpster dive and eat basically rotten food, or big bags of old donuts with cigarette butts in them. The cops caught me doing that lol & I got interrogated behind a Brookshire’s. Of course I shoplifted but that wasn’t gross just a little embarrassing. Only got caught once & played stupid to get away with it. \n\nI worked at a skilled nursing facility and would eat the leftovers from residents’ meal trays. Plus the diabetic food that was refused the day previous. Lots of pimento cheese sandwiches…\n\nI’ve gotten in trouble for sharing “tips” before on here so I’ll just say that in inpatient I found very, very gross ways of getting away with purging. Was never brave enough to try & sneak into the kitchen to binge like one girl famously did lol but I thought about it.",
      "created_utc": 1699887973.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k93y4y3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699904394.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k94hh7m",
      "author": "SoftwareCharacter345",
      "body": "I keep boxes under my bed with my vomit that I throw out when I get the chance. Not to mention that I purge in these in my bedroom.\nI also purge in the shower sometimes.\nI also spend A LOT of money on binge food.\nI once purged in a movie theater bathroom when I was there with my family.\nI have purged outside in the woods.\nThe list honestly just go on and on cause being bulimic sucks. (Although I don’t have a diagnosis)",
      "created_utc": 1699911215.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k94uur8",
      "author": "Downtown-Effect-7450",
      "body": "Eating raw chicken to give myself food poisoning after I wasnt able to purge because of my non existent gag reflex",
      "created_utc": 1699916176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k95yvcy",
      "author": "Blugurrl",
      "body": "We have catering sometimes at work,I would make extra plates I would say I was bringing food home to neighbors etc when it was all for me. \nGoing after food that was being thrown away. \nPurging after nice dinners, at weddings, in airports, events, etc anywhere. \nKnowing I need to clean up the evidence, by bringing water in with me to the bathroom to make sure nothing sticks. \nOnly wanting to go to restaurants that I knew the bathroom was a single so I could purge in private.\nChecking out the bathrooms in places so I could make a game plan if I was going to eat or not.\nGoing out to my car to puke in a bag when I couldn't use the bathroom. \nMissing events, vacations, etc. being preoccupied with food or not wanting to eat or not being able to not purge. \nHiding food so no one would know I had it.\nEating after everyone has gone to sleep so I could purge.\nHording food/stealing food, ordering enough for several people and eating all of it and getting rid of it.\nGetting puke in my hair, on my clothes, shoes and having to clean and spray air freshener on myself\nFeeling like my only gift is the ability to throw up at will. \nNot letting people use my bathroom\nCreating an isolating world of shame because no one can know that this is all I have in the world.",
      "created_utc": 1699932685.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k96257n",
      "author": "FlightDeck_Kitten",
      "body": "Thank you for being so vulnerable and honest in this post. It made me feel less alone but was a brutal reminder of the ways I have and continue to hurt myself. When I feel like I can’t control myself I want to come back to this. It is so raw. Thank you so much.",
      "created_utc": 1699934143.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k966eso",
      "author": "Branch-Much",
      "body": "Thank you for being so honest. It helps to feel less alone ❤️",
      "created_utc": 1699936129.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k96bira",
      "author": "GigglyScribbles",
      "body": "Hoo boy, I've never admitted any of this to anyone so here is a list of what I could think of off the top of my head. Purposely going to restaurants that have given me food poisoning to make myself sick, spending way too much of my checks on binge food, locking myself in the back shed to purge more discreetly, I also have seriously considered trying to soundproof my room to make it easier to purge without my Mom finding out (still trying to talk myself outta that one). The one that makes me feel the worst though is that I binged and purged at my cousin's Quinceñera. My family isn't rich by any means, but they saved up to rent a hall, got caterers, a custom cake, and a photo both and what did I do? I binged, took laxatives because I didn't want what I was doing to be too obvious, and almost shit myself on the dance floor multiple times. I had a great time, it was the happiest I'd been in years, but intrusive thoughts gotta be intrusive I guess :/",
      "created_utc": 1699938768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k96qui0",
      "author": "vuipixxy",
      "body": "Weddings have been brought up a lot and i'll be another addition to that. Purged at my friend's wedding after binging on too many sweets. I wasn't even my own dress, it was a borrowed one from another friend. I tried rly hard to not get it dirty.\n\nI've snuck into the place I work at super early (5am, before anyone should be in the building) so I could eat out of a coworker's peanut butter jar and leftover donuts in the work fridge. Thankfully the last time I did this was almost a full year ago. It's so gross and I'm trying my hardest not to let my issues affect unsuspecting people ToT\n\nIk animals don't know but when i was alone in the house I b/ped and my dog walked in. She just stared as I vomited and I said \"Sorry\" to her for some reason.",
      "created_utc": 1699949095.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k99e2by",
      "author": "albino_tomato",
      "body": "Not my worst, but when on a vacation with two friends who knew about my bulimia. \nAt the hotel, 1st breakfast plate was soooo good and I wanted to try some more food. Had another plate “(im on vacation i should enjoy life for once”). And another one. Started to feel bad, contemplating whether to ignore it and accept that I was stuffed… but i felt so full and disgusting… “now this whole day is ruined, ill feel fat the whole day, I can’t come home fatter” …”unless…”\nHad 2 more plates of favourites. I was so damn full. Went to the bathroom and purged. Did the whole walk of shame and came back, nobody said anything. Ate some more. Was dizzy and felt like shit.\n\nYears later i told them and they apparently didn’t suspect anything happened. I don’t know if it’s true but I don’t really want to ask about it anymore",
      "created_utc": 1699993807.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k960bl4",
      "author": "Sweetnspicy77",
      "body": "I wish I could get a fake Reddit and tell all, but you are not alone!!!!",
      "created_utc": 1699933318.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k96rzl0",
      "author": "AbbaDabbaHoneymoon",
      "body": "Vomiting into a 1.25L Pepsi bottle (multiple times) and hiding it in my closet until I could dispose of it without detection. I couldn’t use the toilet for long enough without someone noticing",
      "created_utc": 1699949987.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k96s906",
      "author": "buttonlessbutton",
      "body": "I relate to everything you wrote here . \n\nPurging in a funeral . \nPurging 1 day after getting my tongue pierced , l took the piercing to stop myself from binge purging . \nAs a tween l used to cut my tongue to stop myself from eating . Didnt work . \nGetting caught purging in public - twice",
      "created_utc": 1699950188.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k96v141",
      "author": "Adventurous_Sail_673",
      "body": "pawning the gold jewelry my grandma gifted me for binge food, taking loans out for binge food, eating out of the trash, stealing from grocery shops, flooding the bathroom floor with my vomit, skipping uni to go binge at a mall bathroom stall and then purge, purging at all kinds of family events, god idek",
      "created_utc": 1699952456.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k97d7ib",
      "author": "Boosey0910",
      "body": "I once ate 6 frozen lemon souffle cakes (with ladyfingers) that my mother had made ahead of time to give at Easter time.",
      "created_utc": 1699965443.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k97mgzj",
      "author": "Total-Equipment5212",
      "body": "• sucking back the liquid medication and everything else out of my ng tube cause i couldn’t handle the calories\n\n• purging in the hospital bathroom whilst blasting music\n\n• trying to purge in the hospital toilets but it refused to come up for some reason and i ended up making my throat bleed and burst blood vessels in my eyes \n\n• literally sh!t myself on multiple occasions from lax abuse\n\n• faking my illness so that i could be prescribed more lax just to abuse them\n\ni am diagnosed AN-R but i’m not so sure nowadays😵‍💫",
      "created_utc": 1699969958.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k97pxr4",
      "author": "dykediaries",
      "body": "purging at restaurants and the toilet not flushing",
      "created_utc": 1699971485.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k98zzi6",
      "author": "Melodybear0",
      "body": "I literally used to purge but the thing that got me to stop was how my teeth would look in the future and obviously how purging is bad for my body-",
      "created_utc": 1699988587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k9903zn",
      "author": "Melodybear0",
      "body": "I hope you are doing alright!",
      "created_utc": 1699988632.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k997oas",
      "author": "mirror2986",
      "body": "I’ve never told anyone these out loud. I hope no one uses these as ideas and tricks because even if you think no one knows what your doing someone is always aware or has some idea. \nPurging into cups and hiding them under my bed when my parents wouldn’t let me go to the bathroom after meals - my dog would always be curious with the smell  and I’d have to hold him if anyone came into the room.\n\nPurging into a glass container in the shower so I could wait a while until the toilet would have to be flushed - not fun when the shower gets blocked when your aims not great and you have to unclog the hair and stuff with old vomit so no one does it first and notices.",
      "created_utc": 1699991369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k99nw6p",
      "author": "demoIished",
      "body": "purging in a water bottle in a tent while my friends were stoned sitting literally a few meters away. then carrying the bottle in a backpack home\n\nhaving a bottle of puke explode all over my room\n\nstealing food and money from literally everyone\n\ngoing broke each time literally two days after i get paid\n\npurging sushi that costed me more than i could ever imagine\n\npurging at my therapy office\n\nand more",
      "created_utc": 1699997428.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k9gwc1g",
      "author": "PromotionAnnual9801",
      "body": "Digging through the trash for binge food out of my dorm floor’s trash room\n\nStealing food from my roommate \n\nStealing money from my aunt and uncle to support my b/p habit \n\nCheating \n\nPurging into a plastic bag on my mom’s driveway and throwing it into the woods\n\nPurging into bags meant for dog poop while walking my dog. So many times. \n\nI did terrible in college because of my disorder \n\nPurging in every building on my college campus",
      "created_utc": 1700115606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k9rfmhv",
      "author": "Perfect_Safe6134",
      "body": "I’ve been bulimic for over three years \n\nJust like you I’m very into health and fitness \n\nI would say I’m a solid 90% better than I was \n\nAt my worst I had no job and no school, so I had nothing better to do than to stuff my face then throw up\n\nI started a new job a few months ago as an orangetheory fitness coach and have made a lot of friends along the way and honestly this was the breakthrough I needed\n\nSo what’s helped me the most was just filling my time with something I enjoyed (coaching) and just staying busy\n\nAnother thing that really helped me (which I don’t necessarily recommend, I can only speak for myself here) is going on a carnivore(ish) animal based diet. \n\nThis helps bc all my digestive issues are much better (bloating would trigger me to want to purge) and I feel bad about what I eat so much less often than I used to.",
      "created_utc": 1700313601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kcj8uqq",
      "author": "fukasee",
      "body": "purging the birthday cake my dad made for me, purging everything my dad made for me, purging in front of my entire family, taking laxatives while i was talking to my aunt",
      "created_utc": 1702061341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l080rgd",
      "author": "Full_Gene_2762",
      "body": "This is exactly me. Related to everything u said and even tho I’m reading this bc I’ve relapsed recently, but my best advice is you don’t need to recover from ur eating disorder all at once. In the beginning I had to start eating more, but slightly mixed in some fear foods. Now I just eat a bunch of protein and genuinely started LOVING healthy food again bc I didn’t have it for so long since I was purging and starting physically and mentally feeling sm better. Honestly yogurt bowls is the key and some peanut butter and honey with whatever cereal is how I stopped binging. At first I would bp that but relized it was way less",
      "created_utc": 1713483514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4d6sxu",
      "author": "AsparagusDue1263",
      "body": "purging in a bathtub because alot of japanese houses have a separate toilet and bath, and the toilet was occupied \n\npurging after a huge family gathering and having everyone stare at me weirdly after i came out of the toilet \n\npurging 30 mins before track training and collapsing during one of my sets \n\nleaving class halfway to binge at the canteen and purge in the teaching staff's toilets (theyre really quiet and clean)\n\nstealing from supermarkets. \n\ngetting my nails done (... extensions) in an attempt to stop myself from purging, but i did it anyway and ended up scratching the my throat up and having bits of nasty purge stuck under my nails THE SMELL WAS AWFUL\n\ndoing nothing all day except sleeping, crying, binging and purging",
      "created_utc": 1715894833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "le4nrjq",
      "author": "DebateEast1155",
      "body": "started going out to the woods to purge. literally riding my bike there as fast as i can while almost crashing into cars around me",
      "created_utc": 1721506441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqnpb8e",
      "author": "TotalDramaElizabeth",
      "body": "The ones I feel the upmost GUILTIEST about is literally binging right in front of people. And they don’t even know I am. It actually makes me feel so guilty and disgusting. \n\nBinged and purged on my 14th birthday trip while my mum and 3 friends were sat in the next room \n\nAte undercooked food (raw chicken etc) \n\nThrew up my birthday dinner with my family and best friend sitting at the table oblivious \n\nThrew up my birthday cake.",
      "created_utc": 1728240693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzrwch1",
      "author": "Wilted_Rose71",
      "body": "I have struggled for over 35 years now and had sooo many instances of outright disgusting, humiliation coming from failed attempts to conceal purging — both via vomiting & laxatives 😢",
      "created_utc": 1733002626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5arbro",
      "author": "Iamsostupiddd",
      "body": "I was in the class and some girls had prepared pastries for all the students and I binged on them and I immediately threw up everything in the school toilets\n\nI was in the car with my parents I was in the back and I binged on a bag of chips I felt so guilty I took my dog’s poop bag and threw it all up in it when I got home I threw it all in the trash\n\nI was hospitalized for my low potassium and I had to take supplements and after my lunch I went to the toilet to throw it all up and when I threw up the supplement came out of my stomach, I couldn’t not keep it inside me so I went to look for it in the toilet and I swallowed it\nI feel so pitiful I feel disgusting help me",
      "created_utc": 1735961413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6bwtcs",
      "author": "randomgirl0_0",
      "body": "Metabolisms horrible I can’t eat over 1000 calories without gaining weight but it’s my own fault I skip eating for days and then eat and sometimes purge once my mom got me McDonald’s and I didn’t want to eat it so I chewed it  then spat it back into the box but I was so hungry I ended up eating it anyways I felt so disgusting.",
      "created_utc": 1736473356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfykt5a",
      "author": "None",
      "body": "I am a person with a greater tendency towards anorexia than bulimia, yet I think it hurts me to vomit every time I cook something extremely elaborate and with love. :(\nI love cooking and I can spend hours doing it, there are times when I don't still value what I have made and I throw up everything I cook while I watch others enjoy my food. I haven't binged in years and I hope it stays that way. Even if it's not vomiting, throwing the food my mother prepared for me into the trash without thinking and with contempt.",
      "created_utc": 1741096514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mo54ygk",
      "author": "generallyuncomfy",
      "body": "This thread is old but I have 2 main ones\n\nI was struggling to get the food back up one day, so I ate my vomit from the toilet to make me feel nauseous\n\nStealing money from my dads wallet to go and buy binge food",
      "created_utc": 1745178967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9a80bn",
      "author": "melcoch",
      "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
      "created_utc": 1700005189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kblu02q",
      "author": "Ly_172",
      "body": "This is probably my grossest bulimia story because I have made sure im always clean and do it almost like a ritual at certain times, but I ate a bunch of spaghetti without the intention to purge it so I didn't properly chew it. When I was throwing it up a long noodle got caught in my throat and a vomited noodle was just kind of hanging there from my throat and then I immediately threw up more because of how disgusting it was. Also pretty sure we all have the experience of pukey toilet water splashing on our faces and occasionally into our mouths.",
      "created_utc": 1701468385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kcaatrr",
      "author": "tappitikkarassmeow",
      "body": "on nights i feel completely alone in the world threads like these somehow r extremely comforting when im not brave enough to speak to anyone i know about this either :') makes me feel like out of it",
      "created_utc": 1701900242.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kcq4i4s",
      "author": "None",
      "body": "Scooping vomit out of a toilet (with my bare hands, mind you) that wouldn’t flush and into the sink so my parents wouldn’t find it. At 13 years old",
      "created_utc": 1702180005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "keelld7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1703208243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kin1tvu",
      "author": "Spare_Anxiety_7427",
      "body": "purged the food that my mom cooked with love for me has to be  one of the guiltiest feelings \n\nhad a hole ritual that i elaborated to make throwing up more succesful and did it everytime without fail \n\ntried making myself throw up even though i had nothing to eat in days \n\nmom caught me throwing up and i made some shit story of why i was doing it and she actually believed it \n\nspent nights watching those”my anorexia story”youtube videos \n\nhad a constant gigantic bruise on my hand \n\ntrying to throw up so hard i scratched my throat with my nails and threw up blood \n\nthrowing up so hard vomit was coming out of my nose \n\n\nand honestly,the worst one,ALWAYS SMELLING LIKE VOMIT",
      "created_utc": 1705695952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kk6yu66",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1706577371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k92bek0",
      "author": "None",
      "body": "Oh and went to hospital for refeeding and purged all the food they were giving me :( what a waste of a bed and resources that someone else could have actually used",
      "created_utc": 1699882053.0,
      "score": 39,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        }
      ]
    },
    {
      "id": "k92bmil",
      "author": "Skizo999",
      "body": "Wetherspoons hits hard. Everything is sadly so relatable, hope your cracked head is better now",
      "created_utc": 1699882160.0,
      "score": 19,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        }
      ]
    },
    {
      "id": "k93u6jn",
      "author": "PinkyOutYo",
      "body": "I have a \"favourite\" cubicle in multiple 'spoons. So, just putting that out there.",
      "created_utc": 1699903003.0,
      "score": 16,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        }
      ]
    },
    {
      "id": "k92i8ii",
      "author": "Friedsurimi",
      "body": "I am sorry for laughing at the last thing because it’s a serious problem but it would totally be something I’d do I am sCREAMING😭😭\nWhat is wrong with our brain, “yea I’m gonna make sure I do not get fat before going to the hospital to have my possible brain injury checked out”",
      "created_utc": 1699885219.0,
      "score": 28,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        }
      ]
    },
    {
      "id": "k92ikj7",
      "author": "Friedsurimi",
      "body": "Btw sorry if I sounded inappropriate with my comment, I hope everything turned out to be somewhat fine! Stay safe and strong 💪🏼",
      "created_utc": 1699885364.0,
      "score": 3,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        }
      ]
    },
    {
      "id": "k92qycr",
      "author": "Skizo999",
      "body": "I’m so sorry to hear this. I hope you get another wedding!",
      "created_utc": 1699888834.0,
      "score": 19,
      "context": [
        {
          "id": "k92qk7p",
          "author": "None",
          "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
          "created_utc": 1699888681.0
        }
      ]
    },
    {
      "id": "k96c28z",
      "author": "None",
      "body": "I know it’s not the same, but I did this at both my proms. I had to admit that I was purging at the second one because someone in the bathroom told a teacher that I was puking. They thought I was drunk and I had to explain that I was bulimic. 🙃 But yes having my hair and makeup done and being in an expensive gown definitely make it very shameful.",
      "created_utc": 1699939071.0,
      "score": 10,
      "context": [
        {
          "id": "k92qk7p",
          "author": "None",
          "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
          "created_utc": 1699888681.0
        }
      ]
    },
    {
      "id": "k96lebv",
      "author": "iluvchikins",
      "body": "it’s the special gathering foods that hit the hardest.",
      "created_utc": 1699945016.0,
      "score": 11,
      "context": [
        {
          "id": "k92f7la",
          "author": "bunny_butterfly",
          "body": "Purging at every family gathering, and especially, my entire 18th birthday cake 💔",
          "created_utc": 1699883850.0
        }
      ]
    },
    {
      "id": "k92l3ss",
      "author": "Skizo999",
      "body": "Omg well done on 7 months!!! That’s incredible. Any tips lol? \n\nAnd so sorry to hear about the bugs that sounds so so shit. If it makes u feel better I had a mouse in my house that wouldn’t leave and shat everywhere and turned out it was because my oven was so filthy and full of leftover food and crumbs that I would make for myself to binge on that the mouse made a home underneath the oven so she could feast",
      "created_utc": 1699886456.0,
      "score": 14,
      "context": [
        {
          "id": "k92kmnr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699886256.0
        }
      ]
    },
    {
      "id": "k92wqyg",
      "author": "Skizo999",
      "body": "I’ve pissed myself so many times while purging!! I’ve taken breaks to shit, flush it and then purge immediately into that toilet",
      "created_utc": 1699891043.0,
      "score": 8,
      "context": [
        {
          "id": "k92rcvk",
          "author": "Fuwa_Fuwa_",
          "body": "Purged at my sister's wedding as the MoH, cousin's wedding during speeches, and both of my grandparents' funerals.\n\nStole an entire pizza from a friends workplace party \n\nPurged in an outhouse in 40-degree heat + humidity\n\nSometimes I accidentally pissed and crapped myself (multiple times) from the force of my purges, didn't help that I was trying to stop laxatives either...",
          "created_utc": 1699888990.0
        }
      ]
    },
    {
      "id": "k92gzh6",
      "author": "Skizo999",
      "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
      "created_utc": 1699884664.0,
      "score": 13,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        }
      ]
    },
    {
      "id": "k92kvex",
      "author": "Skizo999",
      "body": "I spend so much money that I shouldn’t on bingeing can’t pay my bills i so feel u on that",
      "created_utc": 1699886357.0,
      "score": 11,
      "context": [
        {
          "id": "k92hfpp",
          "author": "Friedsurimi",
          "body": "A lot of shitty things actually\n- missing an important choir concert because I was in a session of b/p because I was anxious\n- missing a lot of meetings, uni lessons, activities with friends because I was too busy b/p\n- Stealing. Like, a lot. Initially I just shoplifted in big supermarkets because fûck capitalism, but then after years it got kinda out of hand, to the point I became kleptomaniac and started stealing small unnoticeable amounts of food every day from every person’s house I go to and every person that lives in the uni dormitory where I also live now. + I got caught like 5 times and every time I played the eating disorder card hoping the employees/guards would’ve had mercy and pity for me in order to not call the cops and not have my criminal record get dirty at like 17. \n- purging in unconventional places: empty bottles, bin bags in my home to the point they were so full that sometimes they fuggin brOKE IT WAS DISGUSTING, in the middle of a parking lot, in plant pots…\n- spending money I shouldn’t have spent (other people’s money, savings for university and the dormitory) in binge food.\n\nThese are the current things that come to my mind but I think there is much more awful stuff that I’ve done. I’m just unsalvageable at this point lmao",
          "created_utc": 1699884868.0
        }
      ]
    },
    {
      "id": "m04lv6x",
      "author": "Fairytaledream26",
      "body": "Did the pity card work most of the time?",
      "created_utc": 1733187463.0,
      "score": 1,
      "context": [
        {
          "id": "k92hfpp",
          "author": "Friedsurimi",
          "body": "A lot of shitty things actually\n- missing an important choir concert because I was in a session of b/p because I was anxious\n- missing a lot of meetings, uni lessons, activities with friends because I was too busy b/p\n- Stealing. Like, a lot. Initially I just shoplifted in big supermarkets because fûck capitalism, but then after years it got kinda out of hand, to the point I became kleptomaniac and started stealing small unnoticeable amounts of food every day from every person’s house I go to and every person that lives in the uni dormitory where I also live now. + I got caught like 5 times and every time I played the eating disorder card hoping the employees/guards would’ve had mercy and pity for me in order to not call the cops and not have my criminal record get dirty at like 17. \n- purging in unconventional places: empty bottles, bin bags in my home to the point they were so full that sometimes they fuggin brOKE IT WAS DISGUSTING, in the middle of a parking lot, in plant pots…\n- spending money I shouldn’t have spent (other people’s money, savings for university and the dormitory) in binge food.\n\nThese are the current things that come to my mind but I think there is much more awful stuff that I’ve done. I’m just unsalvageable at this point lmao",
          "created_utc": 1699884868.0
        }
      ]
    },
    {
      "id": "k941xl8",
      "author": "Skizo999",
      "body": "Omg the “I’m going for a walk” excuse. Know it all too well",
      "created_utc": 1699905726.0,
      "score": 6,
      "context": [
        {
          "id": "k92wkt9",
          "author": "TinyStudio7881",
          "body": "I recognize myself in your post. I guess a lot of us do. \nI am 33, started bingeing and purgeing when I was 16 so I've \"done it all\". \n\nPuking in garbage bags and hiding it in my closet is a classic. \n\nPurgeing expensive meals, or meals that friends or family have lovingly cooked for me, absolutely. \n\nGoing through the puke in the toilet with my hands to check what I purged. \n\nSpending insane amounts of money on food and doordash, yup. I keep ordering doordash even though I'm in credit card debt. \n\nI used to say that I'll \"go for a walk\" just to go into the woods near my old house so I could go purge. At our cabin I would just go in the backyard and purge in some bushes. \n\nI've eaten and binged cakes or cupcakes that I had baked for parties or family events so I had to say I burnt them in the oven or something. \n\nThe list goes on.. all the lying.. there is just way too much.",
          "created_utc": 1699890979.0
        }
      ]
    },
    {
      "id": "kcookrz",
      "author": "Itchy_Egg_8158",
      "body": "When Door dash/skip the dishes came out my binge/purge was heightened cause now I didn't have the public shame of going to pick the food up\nI went into massive credit card debt cause of this \"convenience\", happy to say I haven't ordered delivery in over a year now",
      "created_utc": 1702157128.0,
      "score": 3,
      "context": [
        {
          "id": "k92wkt9",
          "author": "TinyStudio7881",
          "body": "I recognize myself in your post. I guess a lot of us do. \nI am 33, started bingeing and purgeing when I was 16 so I've \"done it all\". \n\nPuking in garbage bags and hiding it in my closet is a classic. \n\nPurgeing expensive meals, or meals that friends or family have lovingly cooked for me, absolutely. \n\nGoing through the puke in the toilet with my hands to check what I purged. \n\nSpending insane amounts of money on food and doordash, yup. I keep ordering doordash even though I'm in credit card debt. \n\nI used to say that I'll \"go for a walk\" just to go into the woods near my old house so I could go purge. At our cabin I would just go in the backyard and purge in some bushes. \n\nI've eaten and binged cakes or cupcakes that I had baked for parties or family events so I had to say I burnt them in the oven or something. \n\nThe list goes on.. all the lying.. there is just way too much.",
          "created_utc": 1699890979.0
        }
      ]
    },
    {
      "id": "k92g1h8",
      "author": "Skizo999",
      "body": "I feel u, always so heartbreaking when it involves family gatherings or food a loved one cooked. And about the gallons of water, very dangerous but I can tell you with certainty that if I had absolutely nothing I would contemplate that too",
      "created_utc": 1699884237.0,
      "score": 12,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        }
      ]
    },
    {
      "id": "kcaa2ur",
      "author": "tappitikkarassmeow",
      "body": "the water thing...i havent heard anyone else mention it before. I used to do that before i trusted myself to be \"\"\"\"good enough\"\"\"\" at purging to get enough food out (not a tip btw. purging pure liquid is way shittier than food cus it goes straight through ur nose as well which does not feel nice to say the least. also the absolutely messed up things it can do for ur electrolytes. if u do do this pls take salt after n try and actually drink water)",
      "created_utc": 1701899966.0,
      "score": 2,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        }
      ]
    },
    {
      "id": "kce7if9",
      "author": "Aggressive-Thanks-60",
      "body": "Do you restrict your water intake?",
      "created_utc": 1701973338.0,
      "score": 1,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        }
      ]
    },
    {
      "id": "k92kndt",
      "author": "Skizo999",
      "body": "Damn some of those are so so rough. Yeah I feel u on eating just anything to have something in my mouth. Sending love",
      "created_utc": 1699886265.0,
      "score": 8,
      "context": [
        {
          "id": "k92jc1b",
          "author": "RazorsandMittens",
          "body": "I purged at my sister’s birthday party and I threw up in the bathroom and cried on the floor for an hour\n\nAte legos cause I got so desperate to put anything in my mouth\n\nDrank so many energy drinks to met my calorie goal and ended up getting so sick I almost had to go to the hospital \n\nFell asleep in my bathtub because I was vomiting so much I just passed out in a puddle of my own puke\n\nAte nothing but butter for a week and got so sick I couldn’t eat because it hurt\n\nPuked straight up bile and I couldn’t talk because of how painful it was",
          "created_utc": 1699885696.0
        }
      ]
    },
    {
      "id": "k9zlanh",
      "author": "Itchy_Egg_8158",
      "body": "I recently did the exact same thing and purged again even when in excruciating pain.\n\nMy triggers are when I'm over stimulated (very been out in public for too long), when I've gone too long without eating, or just craving something delicious but don't want the negative affects of the food.\n\nI purged today so tomorrow I'll start the day counter all over again at Day 1",
      "created_utc": 1700461538.0,
      "score": 2,
      "context": [
        {
          "id": "k92wcwo",
          "author": "curvy_mermaid",
          "body": "Managing to purge so hard I caused rib torsions (a few ribs \"popped\" out of their spot) and then being too ashamed to tell the truth so I told medical professionals and everyone else that I \"coughed wrong\" and that's how it happened. 3 weeks later, multiple visits to a chiropractor, and I'm still dealing with the pain but honestly it hasn't fully stopped me from purging. 😬",
          "created_utc": 1699890897.0
        }
      ]
    },
    {
      "id": "k93l664",
      "author": "Skizo999",
      "body": "Those are all so valid <3! I used to abuse laxatives too and there were so many times I nearly shat myself in the middle of the street and had to run to random petrol stations just to relieve myself. You’re not alone sending love",
      "created_utc": 1699899831.0,
      "score": 10,
      "context": [
        {
          "id": "k933yx4",
          "author": "crankthatshane",
          "body": "so this may be different from a lot of the responses here….because my ED, according to my doctor, is more of anorexia with b/p episodes, but the purging is almost always via laxatives, not vomiting. laxatives have made me do some embarrassing things.\n\n1. once took so many laxatives that it was coming out both ends (diarrhea and vomitting)\n\n2. once took laxatives on an off day but got called into work later that day. had to go blow up the bathroom a few times in the span of an hour and genuinely felt like i was going to black out. but i had to power though because i didn’t want to leave early on a shift i picked up. i was just embarrassed that i had to keep walking away to shit.\n\n3. shit into a garbage can in my bedroom because i was too embarrassed to go to the bathroom while my dad was getting ready for work. left the bag in my room for a good 6 hours before taking it outside. entire upstairs floor of my house smelled like an outhouse for a few days. the poop also ended up on my bed sheets somehow. no one mentioned the smell but i know it was noticeable and i was so embarrassed.\n\n4. eating food ingredients or condiments because i didn’t have any actual food left after a binge episode",
          "created_utc": 1699893708.0
        }
      ]
    },
    {
      "id": "k92fu25",
      "author": "Skizo999",
      "body": "Omg I feel you about the cake. I brought back loads of snacks from Bali for my family but before I went come I ate and purged them all lol then I had to go to a supermarket and buy “Asian snacks” and pretend they’re from Bali and not my\nLocal ass Tesco",
      "created_utc": 1699884141.0,
      "score": 10,
      "context": [
        {
          "id": "k92fmxo",
          "author": "None",
          "body": "I don’t binge a lot nowadays but yesterday I had a chocolate cake at home. I had planned to give it as a part of a present to a friend when she had a birthday dinner, but I was the only one who had a present, so it felt weird to give a big present, so only gave the flower but kept the book and the chocolate ( it was in the same package) Normally I don’t have problems with candy since I am strict sugar free, but i was like, take 2 pieces and then throw it in the trash. And I did. And a few minutes later pick it up from the trash. And that feeling, digging in the disgusting trash. That feeling. And put onion on it. Try later again. I am proud bc I didn’t eat all of it. It is still in the trash (!). And probably it is not tasty today, so now it is fine. But still I KNOW it is there. Wouldn’t be surprised if I tried again later. That stress can no one without an ed understand. So shameful that you need to contaminate it to be sure not to eat it.",
          "created_utc": 1699884048.0
        }
      ]
    },
    {
      "id": "k941pti",
      "author": "Skizo999",
      "body": "Yep",
      "created_utc": 1699905649.0,
      "score": 3,
      "context": [
        {
          "id": "k9408vs",
          "author": "derederellama",
          "body": "tfw you purge at a family get-together and have to wipe the tears out of your eyes and take a few deep breaths before going back to the dinner table like nothing happened 🙃",
          "created_utc": 1699905133.0
        }
      ]
    },
    {
      "id": "k92gwh5",
      "author": "Skizo999",
      "body": "That’s literally something I’m so paranoid about when purging in public. What did u do?",
      "created_utc": 1699884626.0,
      "score": 5,
      "context": [
        {
          "id": "k92grbz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699884562.0
        }
      ]
    },
    {
      "id": "k92wjaa",
      "author": "Skizo999",
      "body": "It’s SO lonely. This Reddit is the only thing thats making me feel less alone in the illness",
      "created_utc": 1699890963.0,
      "score": 11,
      "context": [
        {
          "id": "k92vjox",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699890596.0
        }
      ]
    },
    {
      "id": "k93lbq1",
      "author": "Skizo999",
      "body": "The windex spray and still binge is me every single time but with fairy liquid or all purpose spray cleaner rip I feel u",
      "created_utc": 1699899885.0,
      "score": 3,
      "context": [
        {
          "id": "k93164h",
          "author": "None",
          "body": "I puked in a trash bag and left it in my bedroom, shut the door, and went into the family's basement to sleep. My mom woke me up and said she found it. Then she left for work.\n\nSpending a ridiculous amount of money on binge food, binging, purging, throwing the rest of the food in the trash and spraying it with Windex, going back into the trash and pulling what I could salvage out, binge and then purge again\n\nSI to stop the urge to b/p \n\nPurging expensive food at a restaurant\n\nCanceling plans/calling out of work to b/p or recoup from a b/p\n\nB/Ping in college bathrooms, common rooms, dorm rooms\n\nSo much money down the toilet.",
          "created_utc": 1699892682.0
        }
      ]
    },
    {
      "id": "k93ku71",
      "author": "Skizo999",
      "body": "Omg same. I’ve isolated myself from everyone so that I can b/p and I have not reached my goals if anything I’ve slowed myself\nDown",
      "created_utc": 1699899715.0,
      "score": 5,
      "context": [
        {
          "id": "k93ig4p",
          "author": "666throwawaytrash",
          "body": "I've separated myself from the world to have this. I am not even at my ideal weight I'm just fat so there is no relief. But even with that I can't stop. I am caged up in my addiction that I can't get close to anyone for fear of them finding out how bad it is.",
          "created_utc": 1699898874.0
        }
      ]
    },
    {
      "id": "k93kqab",
      "author": "Skizo999",
      "body": "Omg I totally feel you on gaslighting everyone\nWho knows including my mum that I’m purging less. And damn can’t believe you managed bottles I did cups too but I’m so fucking messy and loud I would never have the aim to do a bottle without puking over myself. When desperate I do bags lol",
      "created_utc": 1699899677.0,
      "score": 3,
      "context": [
        {
          "id": "k93j4sy",
          "author": "authlia",
          "body": "oh mines gross. i used to throw up in bottles and sometimes they'd explode. milk cartons were the worst. literally disintegrated and turned into black mold. one time during new years i threw up in a cup while my (ex) friends were over and i went to the bathroom. they confronted me abt it and i was literally sooo humiliated. like i wanted to rot away, but we all ignored it. my mom knows i throw up almost daily and i somehow forced her to ignore it. i think she tries to believe i purge less. it's such a shameful disease for me. very embarrassing but i cant stop. i've also spent like 3k on binge food it's terrible 😭 my teeth r lowk rotting. my best friend is also bulimic so i don't feel as bad when we're together. she gets me lol.",
          "created_utc": 1699899116.0
        }
      ]
    },
    {
      "id": "k94nr0y",
      "author": "Skizo999",
      "body": "I feel u",
      "created_utc": 1699913481.0,
      "score": 3,
      "context": [
        {
          "id": "k94b48k",
          "author": "None",
          "body": "Eating the candy that was left in my puke and puking it out again",
          "created_utc": 1699908977.0
        }
      ]
    },
    {
      "id": "k979gyw",
      "author": "Skizo999",
      "body": "I feel you in the vomit in hair. In my binges I regularly open the door to Uber east drivers t-shirt covered in vomit and with food all over my face.",
      "created_utc": 1699963298.0,
      "score": 5,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        }
      ]
    },
    {
      "id": "kce8tvm",
      "author": "Aggressive-Thanks-60",
      "body": "Can i ask if you struggle with drinking water or fluid intake and have you figured it out?(cause i saw you mentioned purging water)",
      "created_utc": 1701974124.0,
      "score": 2,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        }
      ]
    },
    {
      "id": "md6x12m",
      "author": "Own_Management2673",
      "body": "I'm more worried about why you were in the forest then why you were purging in it. Although I wish you never had to purge either",
      "created_utc": 1739763678.0,
      "score": 1,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        }
      ]
    },
    {
      "id": "kdvidbm",
      "author": "everythingkillsme22",
      "body": "the one with your mom asking if it is your new safe food hits differently. I reminds me of all the times I disappointed my mom. When I was in recovery she used to ask my how my day was because I used to have a dairy where I check the box when I had a B/P free day. All the times my mother smiled at me asking 'did you have a good day?' but she genuinely believed in me. The smile fading when I had to tell her I b/p broke my heart. I started Lying about it, she noticed, so we stopped checking the boxes & the rewardsystem. Now I'm not in recovery anymore.",
      "created_utc": 1702894888.0,
      "score": 1,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        }
      ]
    },
    {
      "id": "k93kwdn",
      "author": "Skizo999",
      "body": "Yep! Was so sad because it was a really nice dinner too. Sending love",
      "created_utc": 1699899737.0,
      "score": 3,
      "context": [
        {
          "id": "k939an1",
          "author": "Curious_Goat_8991",
          "body": "I also purged my college graduatation dinner. Literally spent 4 years pursuing a degree and on a day that was supposed to be happy and celebratory I ruined it. I felt so guilty for that. You’re not alone.",
          "created_utc": 1699895640.0
        }
      ]
    },
    {
      "id": "k979u53",
      "author": "Skizo999",
      "body": "Omg the getting sick from the binge I gave myself poisoning because I bought raw croissants ready to bake but couldn’t contain myself and ate them before they were cooked raw lol. And about promised that broke my heart bc I do the same. I look in the mirror and say I AM SO SORRY I PROMISE I won’t do it again. 20 - 60 min later I’m doing it again",
      "created_utc": 1699963521.0,
      "score": 3,
      "context": [
        {
          "id": "k95tg0m",
          "author": "smyles07",
          "body": "Dumpster diving the same dumpster for three different restaurants foods.\n\nFeeling so bad after bingeing that I don’t know if it’s because said dumpster-dived food was bad/food poisoning or if I ate too much.\n\nGetting soaked in the rain so I could purge outside without roomie knowing\n\nDigging for food I threw out to not binge, only to binge it. \n\nCrying while purging, saying why do I do this / it’s the last time, only to do it 20 more times after that. (I’m a 30 yo male btw)\n\nSneaking food into/out of the house a hundred times before\n\nThe list goes on.",
          "created_utc": 1699930342.0
        }
      ]
    },
    {
      "id": "k996cng",
      "author": "Skizo999",
      "body": "Omg the c/s into bags in public. Been there",
      "created_utc": 1699990892.0,
      "score": 4,
      "context": [
        {
          "id": "k991vr7",
          "author": "scrambled-satellite",
          "body": "Probably chewing and spitting into bags in the grocery store parking lot or purging trail mix & cereal in my parent’s house after nearly ODing on lax.",
          "created_utc": 1699989278.0
        }
      ]
    },
    {
      "id": "k9dx2b1",
      "author": "Skizo999",
      "body": "Well done on 9 weeks. YOU’VE GOT THIS! Thanksgiving is your bitch I’m so happy you’re doing better",
      "created_utc": 1700071043.0,
      "score": 2,
      "context": [
        {
          "id": "k92qrh1",
          "author": "hollysimone",
          "body": "Last year when I was staying at my parents house for Thanksgiving holidays I hid upstairs in the bedroom and purged into some plastic bags. I felt fucking insane but once I had it in my head I truly could not keep from acting on it. I’ve been in recovery (not fully my choice, but hey, I’m recovering now) for 9 weeks but Thanksgiving is coming up again in a couple of weeks and I’m so scared I won’t be able to keep it up.",
          "created_utc": 1699888760.0
        }
      ]
    },
    {
      "id": "k93lr7d",
      "author": "Skizo999",
      "body": "Big relate. Some days I think I’d be better off if I just burned the money I spend lol",
      "created_utc": 1699900035.0,
      "score": 6,
      "context": [
        {
          "id": "k93kp9n",
          "author": "None",
          "body": "I've spent hundreds of dollars on food I intended to throw up and I've purged multiple times in the public restroom at my  job 🙃",
          "created_utc": 1699899667.0
        }
      ]
    },
    {
      "id": "k93u1of",
      "author": "Skizo999",
      "body": "Big relate",
      "created_utc": 1699902954.0,
      "score": 5,
      "context": [
        {
          "id": "k93o3je",
          "author": "Froggymushroomfrog",
          "body": "Eating food from the food bin so all other rotten food was in there too (that was my lowest point).",
          "created_utc": 1699900858.0
        }
      ]
    },
    {
      "id": "k94nnz9",
      "author": "Skizo999",
      "body": "I do find it hilarious when I have moments of clarity I’m like did I actually just finance a binge over 3 monthly payments and then consider taking a literal loan just to live and binge",
      "created_utc": 1699913449.0,
      "score": 4,
      "context": [
        {
          "id": "k94hare",
          "author": "Fast-alex1",
          "body": "you’re not alone. \ni did the EXACT SAME THINGS you did it’s actually heartbreaking and hilarious at the same time . \ni’ve been struggling for half a decade now i can’t even see myself recovering any time soon",
          "created_utc": 1699911151.0
        }
      ]
    },
    {
      "id": "k97a5k7",
      "author": "Skizo999",
      "body": "So sorry about your grandad <3 \nAnd as per bin bags I relate so hard i my bags were so heavy",
      "created_utc": 1699963707.0,
      "score": 5,
      "context": [
        {
          "id": "k952t80",
          "author": "moonbrows",
          "body": "I used to purge so much I needed bin bags and would put one in my room, fill it with trash etc but also whenever I felt like I needed to do it - it would be in there. Think I had about 7 bags in one week then had to rush away from family home quick and they went in to clean and went through them wondering wtf I’d been collecting and I think they probably were quite sick too \nPurging in the hospital after I’d been admitted for oding because I thought the coating would have calories \nToo scared to brush my teeth bc they’re always covered in bile so now they’re awful but I think they’ll be worse if I brush the bile into them \n\nAnd spitting and chewing I genuinely think in my worst days I once ate what I’d spat out because there was nothing else around and then purge out of disgust,\n\nRecently had to see my grandad in the hospital and he had passed away and I excused myself from my family as the nurses spoke to us so I could purge my breakfast up and cried so much while doing it I choked on my snot and I’m so sad that I wasn’t there the whole time and sequestered myself to a fckn hospital cubicle",
          "created_utc": 1699919367.0
        }
      ]
    },
    {
      "id": "k97a9hr",
      "author": "Skizo999",
      "body": "Me too <3 thank you for saying that. \nYes purging can be through vomit excercise or laxatives. All of these detrimental to us",
      "created_utc": 1699963773.0,
      "score": 3,
      "context": [
        {
          "id": "k954l87",
          "author": "Me-effy",
          "body": "Thankyou I feel less alone with some of the things I  have done can anyone answer if purging can also be laxatives misuse ??",
          "created_utc": 1699920091.0
        }
      ]
    },
    {
      "id": "kdoluxm",
      "author": "mntllyilljewishlez",
      "body": "Yup I purge exclusively through laxatives and have a formal diagnosis of bulimia",
      "created_utc": 1702768986.0,
      "score": 2,
      "context": [
        {
          "id": "k954l87",
          "author": "Me-effy",
          "body": "Thankyou I feel less alone with some of the things I  have done can anyone answer if purging can also be laxatives misuse ??",
          "created_utc": 1699920091.0
        }
      ]
    },
    {
      "id": "k97a0i7",
      "author": "Skizo999",
      "body": "Omg  a fww days ago I also purged in a stall with someone having the shits rip you’re not alone",
      "created_utc": 1699963626.0,
      "score": 3,
      "context": [
        {
          "id": "k95cr8z",
          "author": "Liveymcc",
          "body": "Purging in a las vegas rest room in a stall next to a woman having violent diarrhea and not stopping\n\nKeeping a puke bucket next to my bed for weeks then being humiliated when my fiancé found it \n\nEating expired food getting sick from it then still eating it the next day anyway\n\nPurging up tons of blood but not stopping\n\nOh and purging in the restroom at a wedding during the husband and wife dance",
          "created_utc": 1699923456.0
        }
      ]
    },
    {
      "id": "k9dww8x",
      "author": "Skizo999",
      "body": "Holy shit well done!!! 💓 icon. \nGot any recovery tips for us?",
      "created_utc": 1700070984.0,
      "score": 5,
      "context": [
        {
          "id": "k95hibm",
          "author": "ResolutionCareful255",
          "body": "Purged in a psych ward kitchen sink because I was supervised in the bathroom after meals, got caught\n\nTore the back of my throat from purging too often and too heavy foods (hard to digest)\n\nOne of my worst memories ever was purging 2L of Ben and jerrys half an hour after eating, made me feel like I was dying \n\nPurged after having a Nasogastic feed when I was tube fed in a garden, my ng tube came out and I reinserted it myself \n\nStarbucks toilet purge, got walked in on because I forgot to lock the door, I said I had food poisoning \n\nGave myself food poisoning so I would be sick \n\nEmbarrassed but I am almost one year purge free and over one year NG tube free, we do recover ❤️‍🩹",
          "created_utc": 1699925425.0
        }
      ]
    },
    {
      "id": "k979yb7",
      "author": "Skizo999",
      "body": "Purging food from loved ones always makes me so sad. You can and will stop one day. I will too. Or at least I try and live with that hope otherwise I feel like I’m fuckinf useless",
      "created_utc": 1699963590.0,
      "score": 1,
      "context": [
        {
          "id": "k95scpc",
          "author": "Mochihamster",
          "body": "Purging the food my boyfriend took time to lovingly make for me.\n\nPurging the food my mom took time to lovingly make for me.\n\nPurging food my boyfriend buys for me because he thought of me and how i liked it before this shitty relapse.\n\nPurging food my mom buys for me because she thought of me too.\n\n\n\nIt made me let the 2 people I care about most down, and i still hide it from them. I can't stop but I want to.",
          "created_utc": 1699929898.0
        }
      ]
    },
    {
      "id": "k941sfx",
      "author": "Skizo999",
      "body": "I’m on so many meds I could open a pharmacy. Are you fr they can make it worse?",
      "created_utc": 1699905675.0,
      "score": 3,
      "context": [
        {
          "id": "k93y4y3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699904394.0
        }
      ]
    },
    {
      "id": "k97abm3",
      "author": "Skizo999",
      "body": "Omg me with raw dough after I got sick from it once\nEdit: I literally threw up black shit after and felt like death pls no one else try this",
      "created_utc": 1699963808.0,
      "score": 3,
      "context": [
        {
          "id": "k94uur8",
          "author": "Downtown-Effect-7450",
          "body": "Eating raw chicken to give myself food poisoning after I wasnt able to purge because of my non existent gag reflex",
          "created_utc": 1699916176.0
        }
      ]
    },
    {
      "id": "k979o9p",
      "author": "Skizo999",
      "body": "I relate to the pretending it’s for many people so much. Sometimes when I buy a lot of eg pastries at a coffee shop I literally ask for separate bags and pretend it’s for my friends or at the grocery store I look at a fake list of items to make myself look like less of a shark on a feeding frenzy and more like I’m throwing a party",
      "created_utc": 1699963422.0,
      "score": 2,
      "context": [
        {
          "id": "k95yvcy",
          "author": "Blugurrl",
          "body": "We have catering sometimes at work,I would make extra plates I would say I was bringing food home to neighbors etc when it was all for me. \nGoing after food that was being thrown away. \nPurging after nice dinners, at weddings, in airports, events, etc anywhere. \nKnowing I need to clean up the evidence, by bringing water in with me to the bathroom to make sure nothing sticks. \nOnly wanting to go to restaurants that I knew the bathroom was a single so I could purge in private.\nChecking out the bathrooms in places so I could make a game plan if I was going to eat or not.\nGoing out to my car to puke in a bag when I couldn't use the bathroom. \nMissing events, vacations, etc. being preoccupied with food or not wanting to eat or not being able to not purge. \nHiding food so no one would know I had it.\nEating after everyone has gone to sleep so I could purge.\nHording food/stealing food, ordering enough for several people and eating all of it and getting rid of it.\nGetting puke in my hair, on my clothes, shoes and having to clean and spray air freshener on myself\nFeeling like my only gift is the ability to throw up at will. \nNot letting people use my bathroom\nCreating an isolating world of shame because no one can know that this is all I have in the world.",
          "created_utc": 1699932685.0
        }
      ]
    },
    {
      "id": "k979cqh",
      "author": "Skizo999",
      "body": "Thank you that means so much to me and I’m so glad ❤️ and all the comments helped me not purge yesterday!!! My first clean break in this cycle. I am gonna do my best to be okay today too. It sucks we are all in pain but we’re not alone like this illness makes us think we are  <3",
      "created_utc": 1699963225.0,
      "score": 3,
      "context": [
        {
          "id": "k96257n",
          "author": "FlightDeck_Kitten",
          "body": "Thank you for being so vulnerable and honest in this post. It made me feel less alone but was a brutal reminder of the ways I have and continue to hurt myself. When I feel like I can’t control myself I want to come back to this. It is so raw. Thank you so much.",
          "created_utc": 1699934143.0
        }
      ]
    },
    {
      "id": "k9798be",
      "author": "Skizo999",
      "body": "I’m so glad! And looking at all these comments I’m heartbroken we’re all going through the same or similar shit but it does show that none of us are alone in this. I used to think I was the only one who went to those lengths and it made me feel so guilty and ashamed. But knowing that this illness makes us all cross lines we’d never cross helps relieve that guilt. I’m wishing everyone and you so so much positivity and I am confident we can all get better",
      "created_utc": 1699963150.0,
      "score": 4,
      "context": [
        {
          "id": "k966eso",
          "author": "Branch-Much",
          "body": "Thank you for being so honest. It helps to feel less alone ❤️",
          "created_utc": 1699936129.0
        }
      ]
    },
    {
      "id": "k9dwrou",
      "author": "Skizo999",
      "body": "So sorry to hear that. Glad you still made the best of it <3 I know how you may feel. At one point my family was really struggling financially and my mum sold some of her things so I could have a nice 18th birthday party and I completely ruined it",
      "created_utc": 1700070939.0,
      "score": 2,
      "context": [
        {
          "id": "k96bira",
          "author": "GigglyScribbles",
          "body": "Hoo boy, I've never admitted any of this to anyone so here is a list of what I could think of off the top of my head. Purposely going to restaurants that have given me food poisoning to make myself sick, spending way too much of my checks on binge food, locking myself in the back shed to purge more discreetly, I also have seriously considered trying to soundproof my room to make it easier to purge without my Mom finding out (still trying to talk myself outta that one). The one that makes me feel the worst though is that I binged and purged at my cousin's Quinceñera. My family isn't rich by any means, but they saved up to rent a hall, got caterers, a custom cake, and a photo both and what did I do? I binged, took laxatives because I didn't want what I was doing to be too obvious, and almost shit myself on the dance floor multiple times. I had a great time, it was the happiest I'd been in years, but intrusive thoughts gotta be intrusive I guess :/",
          "created_utc": 1699938768.0
        }
      ]
    },
    {
      "id": "k9c0h2a",
      "author": "Skizo999",
      "body": "Omg no i get that it breaks my heart when my dog is sometimes under my bathroom while I’m purging just waiting for me or looking",
      "created_utc": 1700037864.0,
      "score": 1,
      "context": [
        {
          "id": "k96qui0",
          "author": "vuipixxy",
          "body": "Weddings have been brought up a lot and i'll be another addition to that. Purged at my friend's wedding after binging on too many sweets. I wasn't even my own dress, it was a borrowed one from another friend. I tried rly hard to not get it dirty.\n\nI've snuck into the place I work at super early (5am, before anyone should be in the building) so I could eat out of a coworker's peanut butter jar and leftover donuts in the work fridge. Thankfully the last time I did this was almost a full year ago. It's so gross and I'm trying my hardest not to let my issues affect unsuspecting people ToT\n\nIk animals don't know but when i was alone in the house I b/ped and my dog walked in. She just stared as I vomited and I said \"Sorry\" to her for some reason.",
          "created_utc": 1699949095.0
        }
      ]
    },
    {
      "id": "k9791s9",
      "author": "Skizo999",
      "body": "Omg i got two small finger tattoos to stop myself from purging. Lasted one day. Then used garden gloves and a toothbrush praying I won’t get an infection xoxox so I feel u on the piercing situation",
      "created_utc": 1699963035.0,
      "score": 2,
      "context": [
        {
          "id": "k96s906",
          "author": "buttonlessbutton",
          "body": "I relate to everything you wrote here . \n\nPurging in a funeral . \nPurging 1 day after getting my tongue pierced , l took the piercing to stop myself from binge purging . \nAs a tween l used to cut my tongue to stop myself from eating . Didnt work . \nGetting caught purging in public - twice",
          "created_utc": 1699950188.0
        }
      ]
    },
    {
      "id": "kfeovh7",
      "author": "manders556",
      "body": "Well, did ya at least clean up after yourself??? \n\nSince that’s what you were so concerned about on someone else’s post and shaming them for not cleaning up after themselves after purging when they are in literal crisis mode.",
      "created_utc": 1703855181.0,
      "score": 2,
      "context": [
        {
          "id": "k96s906",
          "author": "buttonlessbutton",
          "body": "I relate to everything you wrote here . \n\nPurging in a funeral . \nPurging 1 day after getting my tongue pierced , l took the piercing to stop myself from binge purging . \nAs a tween l used to cut my tongue to stop myself from eating . Didnt work . \nGetting caught purging in public - twice",
          "created_utc": 1699950188.0
        }
      ]
    },
    {
      "id": "k978ykv",
      "author": "Skizo999",
      "body": "Omg loan twins! I’m currently financing three or four binges over the next 3 months and am in £260 of unauthorised overdraft lol",
      "created_utc": 1699962981.0,
      "score": 2,
      "context": [
        {
          "id": "k96v141",
          "author": "Adventurous_Sail_673",
          "body": "pawning the gold jewelry my grandma gifted me for binge food, taking loans out for binge food, eating out of the trash, stealing from grocery shops, flooding the bathroom floor with my vomit, skipping uni to go binge at a mall bathroom stall and then purge, purging at all kinds of family events, god idek",
          "created_utc": 1699952456.0
        }
      ]
    },
    {
      "id": "k996a2s",
      "author": "Skizo999",
      "body": "Congratulations on stopping! Honestly I’m not alright haha have been in the worst cycle ever past few months just now slowly getting out of it. I want to stop for good so any tips are welcome <3333",
      "created_utc": 1699990865.0,
      "score": 1,
      "context": [
        {
          "id": "k9903zn",
          "author": "Melodybear0",
          "body": "I hope you are doing alright!",
          "created_utc": 1699988632.0
        }
      ]
    },
    {
      "id": "k9c0dct",
      "author": "Skizo999",
      "body": "Literally the day I get my pay check I go crazy and in three days it’s gone so I feel u",
      "created_utc": 1700037782.0,
      "score": 2,
      "context": [
        {
          "id": "k99nw6p",
          "author": "demoIished",
          "body": "purging in a water bottle in a tent while my friends were stoned sitting literally a few meters away. then carrying the bottle in a backpack home\n\nhaving a bottle of puke explode all over my room\n\nstealing food and money from literally everyone\n\ngoing broke each time literally two days after i get paid\n\npurging sushi that costed me more than i could ever imagine\n\npurging at my therapy office\n\nand more",
          "created_utc": 1699997428.0
        }
      ]
    },
    {
      "id": "k99obbe",
      "author": "demoIished",
      "body": "oh and also when i was abusing laxatives they hit me at the most random times and i had to take a shit in my room or forest :DD",
      "created_utc": 1699997580.0,
      "score": 1,
      "context": [
        {
          "id": "k99nw6p",
          "author": "demoIished",
          "body": "purging in a water bottle in a tent while my friends were stoned sitting literally a few meters away. then carrying the bottle in a backpack home\n\nhaving a bottle of puke explode all over my room\n\nstealing food and money from literally everyone\n\ngoing broke each time literally two days after i get paid\n\npurging sushi that costed me more than i could ever imagine\n\npurging at my therapy office\n\nand more",
          "created_utc": 1699997428.0
        }
      ]
    },
    {
      "id": "k9rg2ea",
      "author": "Skizo999",
      "body": "Bloating triggers me so much. Thank you for this!! I need to stay busy but I isolate myself\nSo that I can b/p and then I isolated myself bc I’ve b/pd. it’s a terrible cycle",
      "created_utc": 1700313857.0,
      "score": 1,
      "context": [
        {
          "id": "k9rfmhv",
          "author": "Perfect_Safe6134",
          "body": "I’ve been bulimic for over three years \n\nJust like you I’m very into health and fitness \n\nI would say I’m a solid 90% better than I was \n\nAt my worst I had no job and no school, so I had nothing better to do than to stuff my face then throw up\n\nI started a new job a few months ago as an orangetheory fitness coach and have made a lot of friends along the way and honestly this was the breakthrough I needed\n\nSo what’s helped me the most was just filling my time with something I enjoyed (coaching) and just staying busy\n\nAnother thing that really helped me (which I don’t necessarily recommend, I can only speak for myself here) is going on a carnivore(ish) animal based diet. \n\nThis helps bc all my digestive issues are much better (bloating would trigger me to want to purge) and I feel bad about what I eat so much less often than I used to.",
          "created_utc": 1700313601.0
        }
      ]
    },
    {
      "id": "kcj9xya",
      "author": "Skizo999",
      "body": "Been there. Always makes me so so sad and makes me feel like I’m somehow disgracing my whole childhood",
      "created_utc": 1702061760.0,
      "score": 2,
      "context": [
        {
          "id": "kcj8uqq",
          "author": "fukasee",
          "body": "purging the birthday cake my dad made for me, purging everything my dad made for me, purging in front of my entire family, taking laxatives while i was talking to my aunt",
          "created_utc": 1702061341.0
        }
      ]
    },
    {
      "id": "k9c0bp1",
      "author": "Skizo999",
      "body": "I’m neither. I work with fitness, go to the gym often 2x a day 6 days a week and want to do a bikini show someday. I’d say I’m just athletic looking? Gym girlie vibes, and my b/p kills my performance athletically on top of just making me miserable in general so I really wanna stop",
      "created_utc": 1700037746.0,
      "score": 1,
      "context": [
        {
          "id": "k9a80bn",
          "author": "melcoch",
          "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
          "created_utc": 1700005189.0
        }
      ]
    },
    {
      "id": "kefjh6j",
      "author": "bulimia-ModTeam",
      "body": "This can be:\n\n- telling someone not to gain weight \n- telling someone not to go for recovery \n- giving bad advice \n- discussing weight // lowest/highest…\n- discussing calories (how high // how low…)",
      "created_utc": 1703224335.0,
      "score": 0,
      "context": [
        {
          "id": "keelld7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1703208243.0
        }
      ]
    },
    {
      "id": "kk8pwgf",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1706611735.0,
      "score": 1,
      "context": [
        {
          "id": "kk6yu66",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1706577371.0
        }
      ]
    },
    {
      "id": "k93boi8",
      "author": "cott00n68",
      "body": "Same. And I hid the pills that the nurses gave me... It was on December so the hospital gave us Christmas desserts and I ate them with my mom, then purged. I still feel guilty and embarrassed.",
      "created_utc": 1699896491.0,
      "score": 14,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k92bek0",
          "author": "None",
          "body": "Oh and went to hospital for refeeding and purged all the food they were giving me :( what a waste of a bed and resources that someone else could have actually used",
          "created_utc": 1699882053.0
        }
      ]
    },
    {
      "id": "k93703x",
      "author": "None",
      "body": "The grimmest toilet",
      "created_utc": 1699894807.0,
      "score": 9,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k92bmil",
          "author": "Skizo999",
          "body": "Wetherspoons hits hard. Everything is sadly so relatable, hope your cracked head is better now",
          "created_utc": 1699882160.0
        }
      ]
    },
    {
      "id": "k94284x",
      "author": "Skizo999",
      "body": "Omfg I have a favourite one at my gym and local train station fml",
      "created_utc": 1699905832.0,
      "score": 6,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k93u6jn",
          "author": "PinkyOutYo",
          "body": "I have a \"favourite\" cubicle in multiple 'spoons. So, just putting that out there.",
          "created_utc": 1699903003.0
        }
      ]
    },
    {
      "id": "k92jjse",
      "author": "Skizo999",
      "body": "No bc like same 😭😭 last week I thought I was having a heart attack (idk what I’d do if I actually had one) but it was probs panic attack. Anyway, i decided to first finish my binge food, then purge and THEN call my mum and IF I felt really really bad maybe 999",
      "created_utc": 1699885791.0,
      "score": 14,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k92i8ii",
          "author": "Friedsurimi",
          "body": "I am sorry for laughing at the last thing because it’s a serious problem but it would totally be something I’d do I am sCREAMING😭😭\nWhat is wrong with our brain, “yea I’m gonna make sure I do not get fat before going to the hospital to have my possible brain injury checked out”",
          "created_utc": 1699885219.0
        }
      ]
    },
    {
      "id": "k936wuw",
      "author": "None",
      "body": "Lmao don’t worry I find it hilarious how deranged that was 😂😂😂😂😂😂😂😂😂😂",
      "created_utc": 1699894774.0,
      "score": 3,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k92i8ii",
          "author": "Friedsurimi",
          "body": "I am sorry for laughing at the last thing because it’s a serious problem but it would totally be something I’d do I am sCREAMING😭😭\nWhat is wrong with our brain, “yea I’m gonna make sure I do not get fat before going to the hospital to have my possible brain injury checked out”",
          "created_utc": 1699885219.0
        }
      ]
    },
    {
      "id": "k936ymr",
      "author": "None",
      "body": "Some head glue sorted it right out 😂",
      "created_utc": 1699894792.0,
      "score": 5,
      "context": [
        {
          "id": "k92ban4",
          "author": "None",
          "body": "50,000 pounds of inheritance money gone, now I’m broke and nobody knows why \n\nPurging in a Wetherspoons toilet \n\nCracked my head open on a cupboard during a binge, blood was pouring out my head and I made sure to purge before I went to a+e",
          "created_utc": 1699881998.0
        },
        {
          "id": "k92ikj7",
          "author": "Friedsurimi",
          "body": "Btw sorry if I sounded inappropriate with my comment, I hope everything turned out to be somewhat fine! Stay safe and strong 💪🏼",
          "created_utc": 1699885364.0
        }
      ]
    },
    {
      "id": "k92rfld",
      "author": "None",
      "body": "Thank you! I have no doubts I’ll have a second wedding; I’ve learned a lot over the years and have grown a lot. ❤️",
      "created_utc": 1699889019.0,
      "score": 18,
      "context": [
        {
          "id": "k92qk7p",
          "author": "None",
          "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
          "created_utc": 1699888681.0
        },
        {
          "id": "k92qycr",
          "author": "Skizo999",
          "body": "I’m so sorry to hear this. I hope you get another wedding!",
          "created_utc": 1699888834.0
        }
      ]
    },
    {
      "id": "k97ag27",
      "author": "Skizo999",
      "body": "So sad when it’s a special occasion meant for celebration.",
      "created_utc": 1699963880.0,
      "score": 6,
      "context": [
        {
          "id": "k92qk7p",
          "author": "None",
          "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
          "created_utc": 1699888681.0
        },
        {
          "id": "k96c28z",
          "author": "None",
          "body": "I know it’s not the same, but I did this at both my proms. I had to admit that I was purging at the second one because someone in the bathroom told a teacher that I was puking. They thought I was drunk and I had to explain that I was bulimic. 🙃 But yes having my hair and makeup done and being in an expensive gown definitely make it very shameful.",
          "created_utc": 1699939071.0
        }
      ]
    },
    {
      "id": "k9338ix",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699893444.0,
      "score": 14,
      "context": [
        {
          "id": "k92kmnr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699886256.0
        },
        {
          "id": "k92l3ss",
          "author": "Skizo999",
          "body": "Omg well done on 7 months!!! That’s incredible. Any tips lol? \n\nAnd so sorry to hear about the bugs that sounds so so shit. If it makes u feel better I had a mouse in my house that wouldn’t leave and shat everywhere and turned out it was because my oven was so filthy and full of leftover food and crumbs that I would make for myself to binge on that the mouse made a home underneath the oven so she could feast",
          "created_utc": 1699886456.0
        }
      ]
    },
    {
      "id": "k92m3m2",
      "author": "None",
      "body": "Eat in the bathroom at the gym. I had a lot of excersise bulimia in the beginning and worked out to burn all the calories. So could be at the gym from evening to morning ( 24h gym) So cycle on the spinning cycle and then go to the bathroom eating , and out again.",
      "created_utc": 1699886871.0,
      "score": 13,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        },
        {
          "id": "k92gzh6",
          "author": "Skizo999",
          "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
          "created_utc": 1699884664.0
        }
      ]
    },
    {
      "id": "m05z5kb",
      "author": "Friedsurimi",
      "body": "It does, they don’t want to call the police and go through the whole process of, well, a process. But this is a matter of luck, my experience might be very different from somebody else who maybe got the police called and got arrested as soon as the supermarket saw them with a 1$ candy bar.",
      "created_utc": 1733208542.0,
      "score": 1,
      "context": [
        {
          "id": "k92hfpp",
          "author": "Friedsurimi",
          "body": "A lot of shitty things actually\n- missing an important choir concert because I was in a session of b/p because I was anxious\n- missing a lot of meetings, uni lessons, activities with friends because I was too busy b/p\n- Stealing. Like, a lot. Initially I just shoplifted in big supermarkets because fûck capitalism, but then after years it got kinda out of hand, to the point I became kleptomaniac and started stealing small unnoticeable amounts of food every day from every person’s house I go to and every person that lives in the uni dormitory where I also live now. + I got caught like 5 times and every time I played the eating disorder card hoping the employees/guards would’ve had mercy and pity for me in order to not call the cops and not have my criminal record get dirty at like 17. \n- purging in unconventional places: empty bottles, bin bags in my home to the point they were so full that sometimes they fuggin brOKE IT WAS DISGUSTING, in the middle of a parking lot, in plant pots…\n- spending money I shouldn’t have spent (other people’s money, savings for university and the dormitory) in binge food.\n\nThese are the current things that come to my mind but I think there is much more awful stuff that I’ve done. I’m just unsalvageable at this point lmao",
          "created_utc": 1699884868.0
        },
        {
          "id": "m04lv6x",
          "author": "Fairytaledream26",
          "body": "Did the pity card work most of the time?",
          "created_utc": 1733187463.0
        }
      ]
    },
    {
      "id": "kceuuir",
      "author": "royceriel",
      "body": "No I tend to overhydrate",
      "created_utc": 1701982921.0,
      "score": 1,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        },
        {
          "id": "kce7if9",
          "author": "Aggressive-Thanks-60",
          "body": "Do you restrict your water intake?",
          "created_utc": 1701973338.0
        }
      ]
    },
    {
      "id": "k93tvyd",
      "author": "crankthatshane",
      "body": "it’s good to know i’m not the only one <3",
      "created_utc": 1699902898.0,
      "score": 4,
      "context": [
        {
          "id": "k933yx4",
          "author": "crankthatshane",
          "body": "so this may be different from a lot of the responses here….because my ED, according to my doctor, is more of anorexia with b/p episodes, but the purging is almost always via laxatives, not vomiting. laxatives have made me do some embarrassing things.\n\n1. once took so many laxatives that it was coming out both ends (diarrhea and vomitting)\n\n2. once took laxatives on an off day but got called into work later that day. had to go blow up the bathroom a few times in the span of an hour and genuinely felt like i was going to black out. but i had to power though because i didn’t want to leave early on a shift i picked up. i was just embarrassed that i had to keep walking away to shit.\n\n3. shit into a garbage can in my bedroom because i was too embarrassed to go to the bathroom while my dad was getting ready for work. left the bag in my room for a good 6 hours before taking it outside. entire upstairs floor of my house smelled like an outhouse for a few days. the poop also ended up on my bed sheets somehow. no one mentioned the smell but i know it was noticeable and i was so embarrassed.\n\n4. eating food ingredients or condiments because i didn’t have any actual food left after a binge episode",
          "created_utc": 1699893708.0
        },
        {
          "id": "k93l664",
          "author": "Skizo999",
          "body": "Those are all so valid <3! I used to abuse laxatives too and there were so many times I nearly shat myself in the middle of the street and had to run to random petrol stations just to relieve myself. You’re not alone sending love",
          "created_utc": 1699899831.0
        }
      ]
    },
    {
      "id": "k92lb3c",
      "author": "None",
      "body": "Haha yes yes can relate!",
      "created_utc": 1699886539.0,
      "score": 2,
      "context": [
        {
          "id": "k92fmxo",
          "author": "None",
          "body": "I don’t binge a lot nowadays but yesterday I had a chocolate cake at home. I had planned to give it as a part of a present to a friend when she had a birthday dinner, but I was the only one who had a present, so it felt weird to give a big present, so only gave the flower but kept the book and the chocolate ( it was in the same package) Normally I don’t have problems with candy since I am strict sugar free, but i was like, take 2 pieces and then throw it in the trash. And I did. And a few minutes later pick it up from the trash. And that feeling, digging in the disgusting trash. That feeling. And put onion on it. Try later again. I am proud bc I didn’t eat all of it. It is still in the trash (!). And probably it is not tasty today, so now it is fine. But still I KNOW it is there. Wouldn’t be surprised if I tried again later. That stress can no one without an ed understand. So shameful that you need to contaminate it to be sure not to eat it.",
          "created_utc": 1699884048.0
        },
        {
          "id": "k92fu25",
          "author": "Skizo999",
          "body": "Omg I feel you about the cake. I brought back loads of snacks from Bali for my family but before I went come I ate and purged them all lol then I had to go to a supermarket and buy “Asian snacks” and pretend they’re from Bali and not my\nLocal ass Tesco",
          "created_utc": 1699884141.0
        }
      ]
    },
    {
      "id": "k92i6eu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699885194.0,
      "score": 9,
      "context": [
        {
          "id": "k92grbz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699884562.0
        },
        {
          "id": "k92gwh5",
          "author": "Skizo999",
          "body": "That’s literally something I’m so paranoid about when purging in public. What did u do?",
          "created_utc": 1699884626.0
        }
      ]
    },
    {
      "id": "k97dutl",
      "author": "katmeisie",
      "body": "Thats so heart breaking im so sorry genuinely",
      "created_utc": 1699965794.0,
      "score": 4,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        },
        {
          "id": "k979gyw",
          "author": "Skizo999",
          "body": "I feel you in the vomit in hair. In my binges I regularly open the door to Uber east drivers t-shirt covered in vomit and with food all over my face.",
          "created_utc": 1699963298.0
        }
      ]
    },
    {
      "id": "kcefyp0",
      "author": "katmeisie",
      "body": "Yes i do struggle with it a lot. But i just push through it tbh.. I hope youre ok if youre struggling with this too its a nightmare \n\nDrinking vitamin loaded water helps ease the thoughts",
      "created_utc": 1701977264.0,
      "score": 1,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        },
        {
          "id": "kce8tvm",
          "author": "Aggressive-Thanks-60",
          "body": "Can i ask if you struggle with drinking water or fluid intake and have you figured it out?(cause i saw you mentioned purging water)",
          "created_utc": 1701974124.0
        }
      ]
    },
    {
      "id": "k94oog9",
      "author": "Fast-alex1",
      "body": "it’s literally a lifestyle atp🤣",
      "created_utc": 1699913827.0,
      "score": 2,
      "context": [
        {
          "id": "k94hare",
          "author": "Fast-alex1",
          "body": "you’re not alone. \ni did the EXACT SAME THINGS you did it’s actually heartbreaking and hilarious at the same time . \ni’ve been struggling for half a decade now i can’t even see myself recovering any time soon",
          "created_utc": 1699911151.0
        },
        {
          "id": "k94nnz9",
          "author": "Skizo999",
          "body": "I do find it hilarious when I have moments of clarity I’m like did I actually just finance a binge over 3 monthly payments and then consider taking a literal loan just to live and binge",
          "created_utc": 1699913449.0
        }
      ]
    },
    {
      "id": "k9e2mba",
      "author": "ResolutionCareful255",
      "body": "My best tip is there will never be a right time to recover! You have to be the one to make the first big step and say enough! And the rest will follow, I always try to remember how fun it is to try new foods and eat with friends in restaurants, wagamamas is the best because they have menus with no cals written on it if you ask for them! That was my first proper meal In recovery and it made me fall in love with food again, stay strong friend ❤️",
      "created_utc": 1700073014.0,
      "score": 5,
      "context": [
        {
          "id": "k95hibm",
          "author": "ResolutionCareful255",
          "body": "Purged in a psych ward kitchen sink because I was supervised in the bathroom after meals, got caught\n\nTore the back of my throat from purging too often and too heavy foods (hard to digest)\n\nOne of my worst memories ever was purging 2L of Ben and jerrys half an hour after eating, made me feel like I was dying \n\nPurged after having a Nasogastic feed when I was tube fed in a garden, my ng tube came out and I reinserted it myself \n\nStarbucks toilet purge, got walked in on because I forgot to lock the door, I said I had food poisoning \n\nGave myself food poisoning so I would be sick \n\nEmbarrassed but I am almost one year purge free and over one year NG tube free, we do recover ❤️‍🩹",
          "created_utc": 1699925425.0
        },
        {
          "id": "k9dww8x",
          "author": "Skizo999",
          "body": "Holy shit well done!!! 💓 icon. \nGot any recovery tips for us?",
          "created_utc": 1700070984.0
        }
      ]
    },
    {
      "id": "k9achde",
      "author": "Mochihamster",
      "body": "Likewise. I hope i can stop someday.",
      "created_utc": 1700007092.0,
      "score": 2,
      "context": [
        {
          "id": "k95scpc",
          "author": "Mochihamster",
          "body": "Purging the food my boyfriend took time to lovingly make for me.\n\nPurging the food my mom took time to lovingly make for me.\n\nPurging food my boyfriend buys for me because he thought of me and how i liked it before this shitty relapse.\n\nPurging food my mom buys for me because she thought of me too.\n\n\n\nIt made me let the 2 people I care about most down, and i still hide it from them. I can't stop but I want to.",
          "created_utc": 1699929898.0
        },
        {
          "id": "k979yb7",
          "author": "Skizo999",
          "body": "Purging food from loved ones always makes me so sad. You can and will stop one day. I will too. Or at least I try and live with that hope otherwise I feel like I’m fuckinf useless",
          "created_utc": 1699963590.0
        }
      ]
    },
    {
      "id": "k94hd7k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1699911175.0,
      "score": 2,
      "context": [
        {
          "id": "k93y4y3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699904394.0
        },
        {
          "id": "k941sfx",
          "author": "Skizo999",
          "body": "I’m on so many meds I could open a pharmacy. Are you fr they can make it worse?",
          "created_utc": 1699905675.0
        }
      ]
    },
    {
      "id": "k9828ls",
      "author": "FlightDeck_Kitten",
      "body": "After reading through the comments on your post it kinda occurred to me that it becomes so hard to break free partially because of the secrecy behind having an addiction that we feel so ashamed by! So being open in an accepting space is so amazing and I’m proud of you 💗 I am your biggest cheerleader today you can do this! And just remember to be so proud of yourself for yesterday too!",
      "created_utc": 1699976399.0,
      "score": 3,
      "context": [
        {
          "id": "k96257n",
          "author": "FlightDeck_Kitten",
          "body": "Thank you for being so vulnerable and honest in this post. It made me feel less alone but was a brutal reminder of the ways I have and continue to hurt myself. When I feel like I can’t control myself I want to come back to this. It is so raw. Thank you so much.",
          "created_utc": 1699934143.0
        },
        {
          "id": "k979cqh",
          "author": "Skizo999",
          "body": "Thank you that means so much to me and I’m so glad ❤️ and all the comments helped me not purge yesterday!!! My first clean break in this cycle. I am gonna do my best to be okay today too. It sucks we are all in pain but we’re not alone like this illness makes us think we are  <3",
          "created_utc": 1699963225.0
        }
      ]
    },
    {
      "id": "k9gm8g0",
      "author": "GigglyScribbles",
      "body": "Yeah, it's rough when this shit affects family stuff, especially when they're going out on a limb for something 😓 I'm sorry you had a rough 18th birthday party, but as awful as it is, you saying that makes me feel less alone. I appreciate you sharing and I hope you have a good day and good dreams ♥️",
      "created_utc": 1700109649.0,
      "score": 2,
      "context": [
        {
          "id": "k96bira",
          "author": "GigglyScribbles",
          "body": "Hoo boy, I've never admitted any of this to anyone so here is a list of what I could think of off the top of my head. Purposely going to restaurants that have given me food poisoning to make myself sick, spending way too much of my checks on binge food, locking myself in the back shed to purge more discreetly, I also have seriously considered trying to soundproof my room to make it easier to purge without my Mom finding out (still trying to talk myself outta that one). The one that makes me feel the worst though is that I binged and purged at my cousin's Quinceñera. My family isn't rich by any means, but they saved up to rent a hall, got caterers, a custom cake, and a photo both and what did I do? I binged, took laxatives because I didn't want what I was doing to be too obvious, and almost shit myself on the dance floor multiple times. I had a great time, it was the happiest I'd been in years, but intrusive thoughts gotta be intrusive I guess :/",
          "created_utc": 1699938768.0
        },
        {
          "id": "k9dwrou",
          "author": "Skizo999",
          "body": "So sorry to hear that. Glad you still made the best of it <3 I know how you may feel. At one point my family was really struggling financially and my mum sold some of her things so I could have a nice 18th birthday party and I completely ruined it",
          "created_utc": 1700070939.0
        }
      ]
    },
    {
      "id": "k98m9dq",
      "author": "Adventurous_Sail_673",
      "body": "it’s absolute hell, i was better off financially during both my meth and alcohol addictions lmaooo",
      "created_utc": 1699983680.0,
      "score": 1,
      "context": [
        {
          "id": "k96v141",
          "author": "Adventurous_Sail_673",
          "body": "pawning the gold jewelry my grandma gifted me for binge food, taking loans out for binge food, eating out of the trash, stealing from grocery shops, flooding the bathroom floor with my vomit, skipping uni to go binge at a mall bathroom stall and then purge, purging at all kinds of family events, god idek",
          "created_utc": 1699952456.0
        },
        {
          "id": "k978ykv",
          "author": "Skizo999",
          "body": "Omg loan twins! I’m currently financing three or four binges over the next 3 months and am in £260 of unauthorised overdraft lol",
          "created_utc": 1699962981.0
        }
      ]
    },
    {
      "id": "k9szitc",
      "author": "Perfect_Safe6134",
      "body": "Oh yeah no doubt! \nThat self isolating thing is so hard to break\n\nYou just have to decide to do it you know? Put yourself in a situation where you HAVE to\n\nFor me, when I went to cert. week for OTF, I didn’t purge hardly at all, bc I couldn’t binge! I ate all my food out of plastic containers. So what I brought is what I had. I couldn’t go back for more and off on a binge. It’s was just get the food down real quick, and get back on what were doing. \n\nIt was nerve racking bc I wanted to b/p so bad, but it just wasn’t a choice. That really helped to break the cycle. \n\nAnd ofc, eating only meat and fruit I didn’t have the bloating/ibs that just totally deflates me lol",
      "created_utc": 1700339115.0,
      "score": 2,
      "context": [
        {
          "id": "k9rfmhv",
          "author": "Perfect_Safe6134",
          "body": "I’ve been bulimic for over three years \n\nJust like you I’m very into health and fitness \n\nI would say I’m a solid 90% better than I was \n\nAt my worst I had no job and no school, so I had nothing better to do than to stuff my face then throw up\n\nI started a new job a few months ago as an orangetheory fitness coach and have made a lot of friends along the way and honestly this was the breakthrough I needed\n\nSo what’s helped me the most was just filling my time with something I enjoyed (coaching) and just staying busy\n\nAnother thing that really helped me (which I don’t necessarily recommend, I can only speak for myself here) is going on a carnivore(ish) animal based diet. \n\nThis helps bc all my digestive issues are much better (bloating would trigger me to want to purge) and I feel bad about what I eat so much less often than I used to.",
          "created_utc": 1700313601.0
        },
        {
          "id": "k9rg2ea",
          "author": "Skizo999",
          "body": "Bloating triggers me so much. Thank you for this!! I need to stay busy but I isolate myself\nSo that I can b/p and then I isolated myself bc I’ve b/pd. it’s a terrible cycle",
          "created_utc": 1700313857.0
        }
      ]
    },
    {
      "id": "k9f9xdw",
      "author": "melcoch",
      "body": "But have you lost weight due to bp or gained do your binges lead to a surplus if they were not purged? Actual surplus with activity accounted i will make sense of this later",
      "created_utc": 1700088789.0,
      "score": 1,
      "context": [
        {
          "id": "k9a80bn",
          "author": "melcoch",
          "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
          "created_utc": 1700005189.0
        },
        {
          "id": "k9c0bp1",
          "author": "Skizo999",
          "body": "I’m neither. I work with fitness, go to the gym often 2x a day 6 days a week and want to do a bikini show someday. I’d say I’m just athletic looking? Gym girlie vibes, and my b/p kills my performance athletically on top of just making me miserable in general so I really wanna stop",
          "created_utc": 1700037746.0
        }
      ]
    },
    {
      "id": "md6urh1",
      "author": "Own_Management2673",
      "body": "Update here if you get married lol",
      "created_utc": 1739762846.0,
      "score": 1,
      "context": [
        {
          "id": "k92qk7p",
          "author": "None",
          "body": "I purged at my wedding when my ex and I got married. Something about being alone at your wedding, trying not to get your wedding dress dirty, made me feel really shameful and embarrassed.",
          "created_utc": 1699888681.0
        },
        {
          "id": "k92qycr",
          "author": "Skizo999",
          "body": "I’m so sorry to hear this. I hope you get another wedding!",
          "created_utc": 1699888834.0
        },
        {
          "id": "k92rfld",
          "author": "None",
          "body": "Thank you! I have no doubts I’ll have a second wedding; I’ve learned a lot over the years and have grown a lot. ❤️",
          "created_utc": 1699889019.0
        }
      ]
    },
    {
      "id": "k9425ww",
      "author": "Skizo999",
      "body": "Wow that’s actually so so hopeful to hear and helpful. Thank you! Congratulations on all your success wishing you (and everyone reading this too!) all the best ❤️",
      "created_utc": 1699905810.0,
      "score": 6,
      "context": [
        {
          "id": "k92kmnr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699886256.0
        },
        {
          "id": "k92l3ss",
          "author": "Skizo999",
          "body": "Omg well done on 7 months!!! That’s incredible. Any tips lol? \n\nAnd so sorry to hear about the bugs that sounds so so shit. If it makes u feel better I had a mouse in my house that wouldn’t leave and shat everywhere and turned out it was because my oven was so filthy and full of leftover food and crumbs that I would make for myself to binge on that the mouse made a home underneath the oven so she could feast",
          "created_utc": 1699886456.0
        },
        {
          "id": "k9338ix",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699893444.0
        }
      ]
    },
    {
      "id": "k92mhtr",
      "author": "Skizo999",
      "body": "And i soooo feel u I have two gym memberships bc one is further away but it is 24hr and if I feel\nSuper guilty after a purge I’ll still\nGo at 2 am",
      "created_utc": 1699887033.0,
      "score": 5,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        },
        {
          "id": "k92gzh6",
          "author": "Skizo999",
          "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
          "created_utc": 1699884664.0
        },
        {
          "id": "k92m3m2",
          "author": "None",
          "body": "Eat in the bathroom at the gym. I had a lot of excersise bulimia in the beginning and worked out to burn all the calories. So could be at the gym from evening to morning ( 24h gym) So cycle on the spinning cycle and then go to the bathroom eating , and out again.",
          "created_utc": 1699886871.0
        }
      ]
    },
    {
      "id": "k92mdd9",
      "author": "Skizo999",
      "body": "Feel u. I binged on my way to the gym and then purged at the gym multiple times. And then exercised",
      "created_utc": 1699886983.0,
      "score": 4,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        },
        {
          "id": "k92gzh6",
          "author": "Skizo999",
          "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
          "created_utc": 1699884664.0
        },
        {
          "id": "k92m3m2",
          "author": "None",
          "body": "Eat in the bathroom at the gym. I had a lot of excersise bulimia in the beginning and worked out to burn all the calories. So could be at the gym from evening to morning ( 24h gym) So cycle on the spinning cycle and then go to the bathroom eating , and out again.",
          "created_utc": 1699886871.0
        }
      ]
    },
    {
      "id": "kcfzvfw",
      "author": "Aggressive-Thanks-60",
      "body": "Don’t you freak out about water feeling heavy in stomach and cause the scale go up:(i struggle with this",
      "created_utc": 1701999596.0,
      "score": 1,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        },
        {
          "id": "kce7if9",
          "author": "Aggressive-Thanks-60",
          "body": "Do you restrict your water intake?",
          "created_utc": 1701973338.0
        },
        {
          "id": "kceuuir",
          "author": "royceriel",
          "body": "No I tend to overhydrate",
          "created_utc": 1701982921.0
        }
      ]
    },
    {
      "id": "k92lbcl",
      "author": "Skizo999",
      "body": "I feel u every time I purged in planes or like places where the space between me and the bathroom was small  and I sAw people going to that toilet i was just like “praying for u xox”",
      "created_utc": 1699886543.0,
      "score": 8,
      "context": [
        {
          "id": "k92grbz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699884562.0
        },
        {
          "id": "k92gwh5",
          "author": "Skizo999",
          "body": "That’s literally something I’m so paranoid about when purging in public. What did u do?",
          "created_utc": 1699884626.0
        },
        {
          "id": "k92i6eu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699885194.0
        }
      ]
    },
    {
      "id": "kchd3vf",
      "author": "Aggressive-Thanks-60",
      "body": "It really is:( like food restricting is something and fluid is just something else🫠",
      "created_utc": 1702028287.0,
      "score": 2,
      "context": [
        {
          "id": "k9604pl",
          "author": "katmeisie",
          "body": "Purged at the wedding of a recovered anorexic.\n\nPurged pickles (ultimate safe food) in a forest at 2 am\n\nPurged in public so many times with people watching me (parks forests streets)\n\nHave shit myself many times because of lax.\n\nAsking my mom to buy me b/p food, then her asking if its my new safe food :(\n\nJust the money spent. Sad and embarrasing.\n\nDigging through my vomit to see what came up\n\nPurging diet coke (alone) and water so many times\n\nwent out not realising there was vomit stuck in my hair...\n\nand many more...",
          "created_utc": 1699933235.0
        },
        {
          "id": "kce8tvm",
          "author": "Aggressive-Thanks-60",
          "body": "Can i ask if you struggle with drinking water or fluid intake and have you figured it out?(cause i saw you mentioned purging water)",
          "created_utc": 1701974124.0
        },
        {
          "id": "kcefyp0",
          "author": "katmeisie",
          "body": "Yes i do struggle with it a lot. But i just push through it tbh.. I hope youre ok if youre struggling with this too its a nightmare \n\nDrinking vitamin loaded water helps ease the thoughts",
          "created_utc": 1701977264.0
        }
      ]
    },
    {
      "id": "k94ndt2",
      "author": "Skizo999",
      "body": "So I’m on wellbutrin & two mood stabilisers topiramate and lamictal. All of these are meant to have no effect on hunger. I hate taking so many meds but I’m bipolar and bpd and without them I am unmanageable or at least I think I would be and was",
      "created_utc": 1699913344.0,
      "score": 3,
      "context": [
        {
          "id": "k93y4y3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699904394.0
        },
        {
          "id": "k941sfx",
          "author": "Skizo999",
          "body": "I’m on so many meds I could open a pharmacy. Are you fr they can make it worse?",
          "created_utc": 1699905675.0
        },
        {
          "id": "k94hd7k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1699911175.0
        }
      ]
    },
    {
      "id": "k9tsl5t",
      "author": "Skizo999",
      "body": "You too ❤️❤️❤️",
      "created_utc": 1700352272.0,
      "score": 1,
      "context": [
        {
          "id": "k96bira",
          "author": "GigglyScribbles",
          "body": "Hoo boy, I've never admitted any of this to anyone so here is a list of what I could think of off the top of my head. Purposely going to restaurants that have given me food poisoning to make myself sick, spending way too much of my checks on binge food, locking myself in the back shed to purge more discreetly, I also have seriously considered trying to soundproof my room to make it easier to purge without my Mom finding out (still trying to talk myself outta that one). The one that makes me feel the worst though is that I binged and purged at my cousin's Quinceñera. My family isn't rich by any means, but they saved up to rent a hall, got caterers, a custom cake, and a photo both and what did I do? I binged, took laxatives because I didn't want what I was doing to be too obvious, and almost shit myself on the dance floor multiple times. I had a great time, it was the happiest I'd been in years, but intrusive thoughts gotta be intrusive I guess :/",
          "created_utc": 1699938768.0
        },
        {
          "id": "k9dwrou",
          "author": "Skizo999",
          "body": "So sorry to hear that. Glad you still made the best of it <3 I know how you may feel. At one point my family was really struggling financially and my mum sold some of her things so I could have a nice 18th birthday party and I completely ruined it",
          "created_utc": 1700070939.0
        },
        {
          "id": "k9gm8g0",
          "author": "GigglyScribbles",
          "body": "Yeah, it's rough when this shit affects family stuff, especially when they're going out on a limb for something 😓 I'm sorry you had a rough 18th birthday party, but as awful as it is, you saying that makes me feel less alone. I appreciate you sharing and I hope you have a good day and good dreams ♥️",
          "created_utc": 1700109649.0
        }
      ]
    },
    {
      "id": "k98mnbp",
      "author": "Skizo999",
      "body": "Fucking same I was literally JUST thinking about how I think this hell is worse than when I was in active drug and alcohol addiction",
      "created_utc": 1699983819.0,
      "score": 2,
      "context": [
        {
          "id": "k96v141",
          "author": "Adventurous_Sail_673",
          "body": "pawning the gold jewelry my grandma gifted me for binge food, taking loans out for binge food, eating out of the trash, stealing from grocery shops, flooding the bathroom floor with my vomit, skipping uni to go binge at a mall bathroom stall and then purge, purging at all kinds of family events, god idek",
          "created_utc": 1699952456.0
        },
        {
          "id": "k978ykv",
          "author": "Skizo999",
          "body": "Omg loan twins! I’m currently financing three or four binges over the next 3 months and am in £260 of unauthorised overdraft lol",
          "created_utc": 1699962981.0
        },
        {
          "id": "k98m9dq",
          "author": "Adventurous_Sail_673",
          "body": "it’s absolute hell, i was better off financially during both my meth and alcohol addictions lmaooo",
          "created_utc": 1699983680.0
        }
      ]
    },
    {
      "id": "k9tstar",
      "author": "Skizo999",
      "body": "If I wouldn’t purge my binges I would need a crane to lift me out the house. I used to lose through b/p when I’d heavily restrict as well and my b/p was 1x a day max. These days I mainly\nMaintain with b/p",
      "created_utc": 1700352377.0,
      "score": 1,
      "context": [
        {
          "id": "k9a80bn",
          "author": "melcoch",
          "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
          "created_utc": 1700005189.0
        },
        {
          "id": "k9c0bp1",
          "author": "Skizo999",
          "body": "I’m neither. I work with fitness, go to the gym often 2x a day 6 days a week and want to do a bikini show someday. I’d say I’m just athletic looking? Gym girlie vibes, and my b/p kills my performance athletically on top of just making me miserable in general so I really wanna stop",
          "created_utc": 1700037746.0
        },
        {
          "id": "k9f9xdw",
          "author": "melcoch",
          "body": "But have you lost weight due to bp or gained do your binges lead to a surplus if they were not purged? Actual surplus with activity accounted i will make sense of this later",
          "created_utc": 1700088789.0
        }
      ]
    },
    {
      "id": "k93ns10",
      "author": "None",
      "body": "Yes absolutely. Go to different gyms so no one will see how often you are there. This disease is a f*cking hell. But i am better now at least.",
      "created_utc": 1699900745.0,
      "score": 5,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        },
        {
          "id": "k92gzh6",
          "author": "Skizo999",
          "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
          "created_utc": 1699884664.0
        },
        {
          "id": "k92m3m2",
          "author": "None",
          "body": "Eat in the bathroom at the gym. I had a lot of excersise bulimia in the beginning and worked out to burn all the calories. So could be at the gym from evening to morning ( 24h gym) So cycle on the spinning cycle and then go to the bathroom eating , and out again.",
          "created_utc": 1699886871.0
        },
        {
          "id": "k92mhtr",
          "author": "Skizo999",
          "body": "And i soooo feel u I have two gym memberships bc one is further away but it is 24hr and if I feel\nSuper guilty after a purge I’ll still\nGo at 2 am",
          "created_utc": 1699887033.0
        }
      ]
    },
    {
      "id": "k93nhs5",
      "author": "None",
      "body": "Sorry to hear that you been through it also!",
      "created_utc": 1699900645.0,
      "score": 3,
      "context": [
        {
          "id": "k92grrx",
          "author": "None",
          "body": "Since my parents mostly remembers my anorexia period, (we tend to not telling people about bn ), they are in constant worry that I should loose weight. So they love to give me stuff that I like ( my dad is the kindest on earth ). And I receive it, and if it is fast carbs  I usually throw it away. I can’t handle fast carbs. Or orange juice.Nuts is fine. If I happen to say that I like something he remembers it and buys it maybe some time. And I just throw it away. It breaks my heart to do that to him, he is just the best.\nDidn’t know I felt so much for this but start to cry just thinking of it.",
          "created_utc": 1699884568.0
        },
        {
          "id": "k92gzh6",
          "author": "Skizo999",
          "body": "Omg my dad is the same he buys me stuff he knows I like when I visit home and it BREAKS my heart to not eat it or purge JT",
          "created_utc": 1699884664.0
        },
        {
          "id": "k92m3m2",
          "author": "None",
          "body": "Eat in the bathroom at the gym. I had a lot of excersise bulimia in the beginning and worked out to burn all the calories. So could be at the gym from evening to morning ( 24h gym) So cycle on the spinning cycle and then go to the bathroom eating , and out again.",
          "created_utc": 1699886871.0
        },
        {
          "id": "k92mdd9",
          "author": "Skizo999",
          "body": "Feel u. I binged on my way to the gym and then purged at the gym multiple times. And then exercised",
          "created_utc": 1699886983.0
        }
      ]
    },
    {
      "id": "kch03pz",
      "author": "royceriel",
      "body": "Yes but no. If I drink my weight in water and the scale goes up my mind just blames it on food no matter how little it was. Also I'm afraid of water weight so I drink a lot to tell my body there's no need to retain any",
      "created_utc": 1702017967.0,
      "score": 2,
      "context": [
        {
          "id": "k92epbp",
          "author": "royceriel",
          "body": "Purging at a family event always hurts if I'm with cousins I really like. I've done it before and I'm Gonna Do It Again. I always worry about them finding me and becoming triggered or something. Other sad thing is I contemplated an attempt where I just b/p gallons and gallons of water because I had nothing else available at the time.\n\nEmbarrassing moments had to be binging on a trash bag of expired stale snacks, denying purging while my face said it all, purging over insignificant comments as I think about them hours later, stealing snacks from friends and hoarding/binging/purging those, spending aid on binge food...",
          "created_utc": 1699883615.0
        },
        {
          "id": "kce7if9",
          "author": "Aggressive-Thanks-60",
          "body": "Do you restrict your water intake?",
          "created_utc": 1701973338.0
        },
        {
          "id": "kceuuir",
          "author": "royceriel",
          "body": "No I tend to overhydrate",
          "created_utc": 1701982921.0
        },
        {
          "id": "kcfzvfw",
          "author": "Aggressive-Thanks-60",
          "body": "Don’t you freak out about water feeling heavy in stomach and cause the scale go up:(i struggle with this",
          "created_utc": 1701999596.0
        }
      ]
    },
    {
      "id": "k9eszoh",
      "author": "Adventurous_Sail_673",
      "body": "getting through the day was definitely easier back then 😭 the only thing i don’t miss are the blackouts omg i cannot cope with not knowing all the ways i’ve humiliated myself in front of people it still keeps me up at night",
      "created_utc": 1700082563.0,
      "score": 2,
      "context": [
        {
          "id": "k96v141",
          "author": "Adventurous_Sail_673",
          "body": "pawning the gold jewelry my grandma gifted me for binge food, taking loans out for binge food, eating out of the trash, stealing from grocery shops, flooding the bathroom floor with my vomit, skipping uni to go binge at a mall bathroom stall and then purge, purging at all kinds of family events, god idek",
          "created_utc": 1699952456.0
        },
        {
          "id": "k978ykv",
          "author": "Skizo999",
          "body": "Omg loan twins! I’m currently financing three or four binges over the next 3 months and am in £260 of unauthorised overdraft lol",
          "created_utc": 1699962981.0
        },
        {
          "id": "k98m9dq",
          "author": "Adventurous_Sail_673",
          "body": "it’s absolute hell, i was better off financially during both my meth and alcohol addictions lmaooo",
          "created_utc": 1699983680.0
        },
        {
          "id": "k98mnbp",
          "author": "Skizo999",
          "body": "Fucking same I was literally JUST thinking about how I think this hell is worse than when I was in active drug and alcohol addiction",
          "created_utc": 1699983819.0
        }
      ]
    },
    {
      "id": "k9yx53o",
      "author": "melcoch",
      "body": "Yes because most of the calories are absorb even after purging everything out but the grelin hormone gets worst as further as purgers continues thats why binging gets worst explaining the stoped weight lost (now you don’t restrict just purge)",
      "created_utc": 1700447682.0,
      "score": 1,
      "context": [
        {
          "id": "k9a80bn",
          "author": "melcoch",
          "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
          "created_utc": 1700005189.0
        },
        {
          "id": "k9c0bp1",
          "author": "Skizo999",
          "body": "I’m neither. I work with fitness, go to the gym often 2x a day 6 days a week and want to do a bikini show someday. I’d say I’m just athletic looking? Gym girlie vibes, and my b/p kills my performance athletically on top of just making me miserable in general so I really wanna stop",
          "created_utc": 1700037746.0
        },
        {
          "id": "k9f9xdw",
          "author": "melcoch",
          "body": "But have you lost weight due to bp or gained do your binges lead to a surplus if they were not purged? Actual surplus with activity accounted i will make sense of this later",
          "created_utc": 1700088789.0
        },
        {
          "id": "k9tstar",
          "author": "Skizo999",
          "body": "If I wouldn’t purge my binges I would need a crane to lift me out the house. I used to lose through b/p when I’d heavily restrict as well and my b/p was 1x a day max. These days I mainly\nMaintain with b/p",
          "created_utc": 1700352377.0
        }
      ]
    },
    {
      "id": "lu58ync",
      "author": "Helpful-Ad9200",
      "body": "um this feels mad innappropriate? leave her alone and who cares abt any of that anyway underweight normal weight overweight or obese this disorder is fucked up and to be taken seriously this is honestly no place for those sort of comments to me!",
      "created_utc": 1730103910.0,
      "score": 2,
      "context": [
        {
          "id": "k9a80bn",
          "author": "melcoch",
          "body": "Are you overweight? Or very underweight because recovery is different for both im brutal honest no intention of triger",
          "created_utc": 1700005189.0
        },
        {
          "id": "k9c0bp1",
          "author": "Skizo999",
          "body": "I’m neither. I work with fitness, go to the gym often 2x a day 6 days a week and want to do a bikini show someday. I’d say I’m just athletic looking? Gym girlie vibes, and my b/p kills my performance athletically on top of just making me miserable in general so I really wanna stop",
          "created_utc": 1700037746.0
        },
        {
          "id": "k9f9xdw",
          "author": "melcoch",
          "body": "But have you lost weight due to bp or gained do your binges lead to a surplus if they were not purged? Actual surplus with activity accounted i will make sense of this later",
          "created_utc": 1700088789.0
        },
        {
          "id": "k9tstar",
          "author": "Skizo999",
          "body": "If I wouldn’t purge my binges I would need a crane to lift me out the house. I used to lose through b/p when I’d heavily restrict as well and my b/p was 1x a day max. These days I mainly\nMaintain with b/p",
          "created_utc": 1700352377.0
        },
        {
          "id": "k9yx53o",
          "author": "melcoch",
          "body": "Yes because most of the calories are absorb even after purging everything out but the grelin hormone gets worst as further as purgers continues thats why binging gets worst explaining the stoped weight lost (now you don’t restrict just purge)",
          "created_utc": 1700447682.0
        }
      ]
    }
  ]
}