{
  "id": "184iuw3",
  "subreddit": "bulimia",
  "author": "kaja1323",
  "created_utc": 1701027746.0,
  "title": "Throwing up the food that your relatives made",
  "selftext": "I am so pissed of myself right now. I am visiting my parents and my mom made her delicious strudel (apple pie)… and I have consumed a lot of the pie - strict diet - I don’t eat any of food like that… and you know then I started to panicking like “what have you done omg” and I purged… \nAnd now I feel bad because my mom has baked it with love… how do you handle these situations?",
  "url": "https://www.reddit.com/r/bulimia/comments/184iuw3/throwing_up_the_food_that_your_relatives_made/",
  "score": 66,
  "num_comments": 9,
  "comments": [
    {
      "id": "kavsomg",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1701031665.0,
      "score": 56,
      "context": []
    },
    {
      "id": "kaxqmkp",
      "author": "poisonedminds",
      "body": "I used to care about things like this too. At some point I just became empty inside.",
      "created_utc": 1701060402.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kaxmnpj",
      "author": "Nebion666",
      "body": "I stopped feeling guilty cause i do it so much",
      "created_utc": 1701058365.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kaxt82h",
      "author": "Dear-Researcher-4738",
      "body": " you did enjoy it right ? Yes and u appreciate the effort and affection ur mom made it with , so don’t be hard on yourself u already feel the guilt and ur sickness took over its not like ur ungrateful ur just in a difficult place in your life ❤️❤️",
      "created_utc": 1701061863.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kayeowm",
      "author": "BimBimmie",
      "body": "Listen, the food will end up the same place anyway. If you managed to enjoy it while it lasted with your family, thats what matters. Don’t be too hard on yourself.",
      "created_utc": 1701077454.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kay3a69",
      "author": "kasialis721",
      "body": "speaking as someone who lives at home and always purges food made my my parents, remember that you are going through something, and this something can make you do things that you are ashamed of. you aren’t doing this because you hate your parents or the strudel, but because you are struggling. don’t treat yourself with guilt, but maybe use this as a wake up call if you’re ready. \n\nif you aren’t ready then just remember not to beat yourself up about it 💗",
      "created_utc": 1701068418.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kcark7m",
      "author": "Numerous_Bullfrog394",
      "body": "I find it really hard to throw up the food my mom cooks for me when I'm home from college, hence why I always put on some weight at home.",
      "created_utc": 1701906942.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kawcj5d",
      "author": "Less_Home8530",
      "body": "You're absolutely right and you've put it so well.",
      "created_utc": 1701039003.0,
      "score": 16,
      "context": [
        {
          "id": "kavsomg",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701031665.0
        }
      ]
    },
    {
      "id": "kax49fl",
      "author": "Mochihamster",
      "body": "Thank you for this. I struggle with the same, feeling bad for purging food my mom made and/or bought for me, likewise with foods my boyfriend made and/or bought for me.\n\nI feel so so bad. But seeing what you said helped, and hopefully someday I'll recover.",
      "created_utc": 1701050021.0,
      "score": 5,
      "context": [
        {
          "id": "kavsomg",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701031665.0
        }
      ]
    }
  ]
}