{
  "id": "189taaz",
  "subreddit": "bulimia",
  "author": "rattedbitch",
  "created_utc": 1701609361.0,
  "title": "dae kinda wish that they had AN instead?",
  "selftext": "i know this sounds dark af & that you cant choose ur disorder and this is probably my ed speaking but sometimes i wish i had anorexia instead of the gross puking one. bulimia is literally the most pointless disease to exist, all this suffering and nothing to show for it. ive been ed'd for YEARS (ednos -> bulimia) at this point and all im doing is losing & gaining the same 5 pounds. i mean i lost both my sanity and dignity so thats at least something, i guess?\n\ni am aware that AN is a horrible horrible illness but its the \"poster child\" of eds, the gold standard so to speak. other eds are basically non existent outside of ed spaces and if they are they get stigmatized as hell, especially BED.",
  "url": "https://www.reddit.com/r/bulimia/comments/189taaz/dae_kinda_wish_that_they_had_an_instead/",
  "score": 123,
  "num_comments": 50,
  "comments": [
    {
      "id": "kbtasce",
      "author": "ihavcolaforbreakfast",
      "body": "I had anorexia from age 13 to 19–although it never really leaves, it’s always there—then binge eating from 19 to 27–times in between where my eating habits were fine—and bulimia since last December. It’s worse now than ever. \n\nMy bulimia and binge eating brains are telling me all the damn time how good I felt when I was just skinny without the binging and the purging. When I look at pictures of me when my anorexia was the worst, I am reminded that no, I did, in fact, feel just as terrible, just different terrible. \n\nIt might have been “cleaner”, but that’s about it. Still, I totally get this way of thinking. \nIt saved me a lot of money, too. lol. (there’s nothing funny about this I’m just done)\n\nEdit: typo.",
      "created_utc": 1701611925.0,
      "score": 39,
      "context": []
    },
    {
      "id": "kbtd9en",
      "author": "Jazzlike_Interview_7",
      "body": "Kinda wish? Always. Now that I’m older with kids, every time I purge I get panicked that my heart is going to give out. Yes, of course AN is deadly and ugly, too. But at least I’d be skinny. I’ve felt the same way as you for like 20 yrs. It sucks.",
      "created_utc": 1701613212.0,
      "score": 39,
      "context": []
    },
    {
      "id": "kbthx49",
      "author": "royceriel",
      "body": "Yep. I had AN and I wish it came back daily. It is unhealthy but BN just made me unhealthy and fat. Didn't matter how bad the day was because I was satisfied from eating so little. The brain fog was so bad that I thought less and was therefore less miserable. And I get no concern anymore because I don't look sick, and that concern was the first and only time I ever felt loved.",
      "created_utc": 1701615413.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kbtzett",
      "author": "None",
      "body": "anyone that claims that they never wished they had AN is a fucking liar",
      "created_utc": 1701622573.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kbunzrt",
      "author": "sk1l3",
      "body": "I was anorexic first and now after 9 years of bulimia I'm relapsing back into anorexia. imo bulimia sucks so much more I'm so much more functional and have so much more time now that I'm not binging andn purging all day long anymore. I actually feel more energized and alive and like myself. I hate that I love it.",
      "created_utc": 1701631382.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kbvaom5",
      "author": "None",
      "body": "All the time. I was put into the psych ward several years back, on the ed floor. It was me and 19 anorexics. I watched them get all the help, all the therapy and watched everyone cry over them. I got told I wasn't really that bad and sent home. My last therapist told me she felt bulimia was probably keeping me alive. My husband's cousin died of anorexia, and the whole family still laments over her. They know full well I have this, and they enable me, because they don't even believe I'm ill. I've been turned down four times for treatment. I don't say this because I want anorexia- I understand that it's a terrible disease. But I think the lack of concern for bulimia leads to this type of thinking, that we need to be sicker, we need to strive to be anorexic, to garner any type of help.",
      "created_utc": 1701639591.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kbt79pk",
      "author": "None",
      "body": "I developed AN from BN and they are both as hideous as each other\n\nIn fact, when I was AN I missed BN for being able to allow myself the food at all",
      "created_utc": 1701609992.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kbtvz8w",
      "author": "barahonera",
      "body": "You’re definitely not alone. I’ve mentioned it to my mom and she thinks I’m crazy for wanting that, but it’s the truth. And I’m tired of pretending like it’s not a goal for me.",
      "created_utc": 1701621245.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kbt8rtw",
      "author": "bee102019",
      "body": "My bulimia was never due to weight. I was never overweight. I was forcibly locked in a closet and starved. I came to believe I wasn't worth of food. So, in effect, forced AN. Then I learned I couldn't eat without PTSD and intense fear. So I would eat, then vomit. There was always this past trauma over my head that said \"you've eaten, now you'll get hurt.\" This is a thing none of my therapists ever attempted to understand. \n\nOnto the stigma, as I've been in recovery for several years, I'm working on getting my teeth fixed up. I went to this dentist and I was honest about my bulimia history (why not, I'm there for help), and he said \"you're a lost cause, you're going to lose all your teeth). I left the office crying and my husband stayed to talk to them. They gave me a referral and I fully believe he just wrote me off as a bulimic, recovery or not... because I made that referral appointment and they said your teeth are totally salvageable.\n\nHad I needed dental implants it would have been $30k. I also previously had the septic tank pumped from \"grease\" (it was my vomit) for $400. Bulimia is expensive.\n\nBut forced AN lead to my bulimia. I don't recommend either. Save your money. Save your life.",
      "created_utc": 1701610832.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kbumaij",
      "author": "Downtown-Effect-7450",
      "body": "I had AN before this and it was so torturous. I would “pick” bulimia over AN any day. Yes, I miss how I used to look like but it doesn’t count because in the moment no matter how underweight I was, I still saw myself as the fattest person on earth. I look back at pics now and am so shocked I wasn’t aware of how skinny I was. I feel like with bulimia body dysmorphia is way less severe, at least for me. Hate myself during both disorders lol.",
      "created_utc": 1701630780.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kbuc5hh",
      "author": "Kioxik",
      "body": "I’m diagnosed with AN B/P subtype and I wish I just had AN-R",
      "created_utc": 1701627225.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kbv3zxo",
      "author": "kathruins",
      "body": "basically everyone who has ever had this disease. AN lose more weight, thus get quicker medical attention, and don't get the ew factor. \n\nthat being said neither are good. both are a death sentence. I became more thankful that I had bulimia when I went into treatment and saw my peers struggle with anorexia. I don't want that for them or myself, but we don't think like that when we're deep in our sickness.",
      "created_utc": 1701637154.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kbvn516",
      "author": "Trip_the_light3020",
      "body": "AN b/p here and anyone who thinks all EDs are the same doesn't get it. \n\n I've been on the heavy side with periods of just binging, normal weight only BN, and it is incredibly invalidating and full of shame because of not being severely underweight.  It is not all the same and AN has always been seen as sicker and the better of the EDs. \n\nEven ED treatment centers mostly cater to restrictive EDs because binging is too shameful to admit apparently. At meals, nobody ever talks about binge urges at check out. It's always restriction thoughts or purging. You're right, BED is seen as the mostly lowly and shameful of all EDs and that is not right. It's quite sad.\n\nI still feel the same way even though I'm AN b/p, wishing for a \"worse and cleaner\" ED...I wish I had \"extreme\" restricting only anorexia with a BMI in a lower category",
      "created_utc": 1701644265.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbtgdcj",
      "author": "Saphxmoon",
      "body": "I'm going through these feeling right now to be honest. I've been discussing it with my therapist because I was recently diagnosed with BN and it's giving me some pretty awful emotions. I think it's because of the emotions i feel surrounding the different behaviours. I struggle with restriction a lot, i'm always in a cycle of restriction to b/p. When I b/p i feel disgusted with my self, I feel ashamed and guilty. But when I restrict i feel horribly proud of my self, like I'm in control and I have discipline and restraint. Now that I'm diagnosed with BN, I hate that I'm being defined by behaviours that make me so disgusted with my self. I know that diagnoses DON'T define you, I know that's not how it works. But i can't stop feeling that way. I just wish I could be defined by something that makes me feel in control.",
      "created_utc": 1701614712.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kbtmwnz",
      "author": "oneironauticaobscura",
      "body": "If it makes you feel any better AN is just as gross! I had bulimia for many years and in my head AN must have been such a “clean” alternative to the horrors of puking. But AN comes with so many gross side effects such as occasional sharts. I never would have imagined that not eating would give me diarrhea like I have now!!!!",
      "created_utc": 1701617589.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbuoo1k",
      "author": "unique_plastique",
      "body": "Yeah tbh mostly because stomach acid rubbing up against my teeth 3x a day is gonna leave me fucked up by my mid 20s",
      "created_utc": 1701631624.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbwkp1c",
      "author": "ModandMitton",
      "body": "Yeah I wish too. An seems to be a socially acceptable mental illness. People find out you have bulimia and are immediately horrified. Not in a I'm worried about you way but in a wtf is wrong with you why would you do that kinda way.",
      "created_utc": 1701658264.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kbul7n8",
      "author": "SweetxKiss",
      "body": "I’m AN B/P and I wish I was just AN :( OBVIOUSLY they’re both terrible, but I am so sick of the throw up. It smells, it gets everywhere. The snot and tears that pour out cause you keep forcing. Everyone can hear you. You clog up the toilet. Tooth decay. And the amount of $$$ spent just to uneat it in the end. This 💩 sucks but I hope we can all recover 🤞",
      "created_utc": 1701630398.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kbwsn0o",
      "author": "Short-Lecture5634",
      "body": "Sometimes I miss the time I had AN. I was skinny and didn’t have urges to binge. Like, I didnt want to eat at all. And what I’ve got with bulimia? Nothing, I only lost time, effort and money. And I gained weight. \nStill… perhaps, AN led me to bulimia.",
      "created_utc": 1701661916.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kbwo8pm",
      "author": "Nebion666",
      "body": "Yes. I know its awful to think but I definitely do. I feel like sometimes bulimics are portrayed as just “failed anorexics” which definitely helps no one. Its also like, so many people when they talk about eds only really talk about AN. Anorexia is also the only one glamorized usually which could perhaps only feed into people with other eds like BN feeling gross and such",
      "created_utc": 1701659855.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kbvwugj",
      "author": "fadingaurora9828",
      "body": "I have AN BP subtype and it’s honestly the most hellish existence one can experience .",
      "created_utc": 1701648077.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kbuprw4",
      "author": "makeupyourworld",
      "body": "Yes",
      "created_utc": 1701632018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbw6i19",
      "author": "bla-bla-ha-ha",
      "body": "❤️",
      "created_utc": 1701652041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kc33r0m",
      "author": "Elegant-Inspection74",
      "body": "this is extremely real. especially with all the stigma surrounding bulimia, it makes me feel dirty that i have bulimia because i have “no self control”.",
      "created_utc": 1701778856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbw066l",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1701649408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbywrfo",
      "author": "Tinslee_Bliss",
      "body": "I can understand this. For me it started with anorexia and then turned into bulimia. AN was way cheaper because you just dont eat but the extreme fear of food and the constant urge to move was horrible. I can enjoy going out for dinner with friends but the binging is such a waste of money, i hate it.",
      "created_utc": 1701707006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbw6wf4",
      "author": "bla-bla-ha-ha",
      "body": "Skinny never stops the pain. Wish I could give you a hug. 💕",
      "created_utc": 1701652214.0,
      "score": 8,
      "context": [
        {
          "id": "kbtasce",
          "author": "ihavcolaforbreakfast",
          "body": "I had anorexia from age 13 to 19–although it never really leaves, it’s always there—then binge eating from 19 to 27–times in between where my eating habits were fine—and bulimia since last December. It’s worse now than ever. \n\nMy bulimia and binge eating brains are telling me all the damn time how good I felt when I was just skinny without the binging and the purging. When I look at pictures of me when my anorexia was the worst, I am reminded that no, I did, in fact, feel just as terrible, just different terrible. \n\nIt might have been “cleaner”, but that’s about it. Still, I totally get this way of thinking. \nIt saved me a lot of money, too. lol. (there’s nothing funny about this I’m just done)\n\nEdit: typo.",
          "created_utc": 1701611925.0
        }
      ]
    },
    {
      "id": "kbxjips",
      "author": "mintymelancholy",
      "body": "same sitch here, i end up \"missing\" it because when i look back it feels like i had more control.  like i cant stop myself from binging no matter how guilty and awful i feel about it.  but if i think about it critically, i didn't have more control then.   if you had told me youd give me 800$ to eat velveeta cheese, i wouldnt have been able to get myself to do it even if i had 0$ and was sleeping on the street.   \n\nit had an illusion of control because it tricks you into alligning your beliefs with it, not just your emotions, but i didnt actually have more control.         even knowing that, yeah.   yeah, i catch myself missing it.  rational, irrational, delusional,  doesnt matter, my brain misses it and id be lying if i said it didn't.",
      "created_utc": 1701678818.0,
      "score": 5,
      "context": [
        {
          "id": "kbtasce",
          "author": "ihavcolaforbreakfast",
          "body": "I had anorexia from age 13 to 19–although it never really leaves, it’s always there—then binge eating from 19 to 27–times in between where my eating habits were fine—and bulimia since last December. It’s worse now than ever. \n\nMy bulimia and binge eating brains are telling me all the damn time how good I felt when I was just skinny without the binging and the purging. When I look at pictures of me when my anorexia was the worst, I am reminded that no, I did, in fact, feel just as terrible, just different terrible. \n\nIt might have been “cleaner”, but that’s about it. Still, I totally get this way of thinking. \nIt saved me a lot of money, too. lol. (there’s nothing funny about this I’m just done)\n\nEdit: typo.",
          "created_utc": 1701611925.0
        }
      ]
    },
    {
      "id": "kcm90g5",
      "author": "No-Confection-3024",
      "body": "yeah tbh I don't know which makes me feel worse. When I'm purging I get brainfog and I feel unmotivated and disgusted with myself but when I was restricting I was cranky all the time, I was a total bitch to the people around me and I got weirdly competitive about weight.",
      "created_utc": 1702117780.0,
      "score": 2,
      "context": [
        {
          "id": "kbtasce",
          "author": "ihavcolaforbreakfast",
          "body": "I had anorexia from age 13 to 19–although it never really leaves, it’s always there—then binge eating from 19 to 27–times in between where my eating habits were fine—and bulimia since last December. It’s worse now than ever. \n\nMy bulimia and binge eating brains are telling me all the damn time how good I felt when I was just skinny without the binging and the purging. When I look at pictures of me when my anorexia was the worst, I am reminded that no, I did, in fact, feel just as terrible, just different terrible. \n\nIt might have been “cleaner”, but that’s about it. Still, I totally get this way of thinking. \nIt saved me a lot of money, too. lol. (there’s nothing funny about this I’m just done)\n\nEdit: typo.",
          "created_utc": 1701611925.0
        }
      ]
    },
    {
      "id": "kbvvv1z",
      "author": "gomichan",
      "body": "That's what I tell myself. Why couldn't I have gotten the skinny and clean ED? Lol",
      "created_utc": 1701647692.0,
      "score": 9,
      "context": [
        {
          "id": "kbtd9en",
          "author": "Jazzlike_Interview_7",
          "body": "Kinda wish? Always. Now that I’m older with kids, every time I purge I get panicked that my heart is going to give out. Yes, of course AN is deadly and ugly, too. But at least I’d be skinny. I’ve felt the same way as you for like 20 yrs. It sucks.",
          "created_utc": 1701613212.0
        }
      ]
    },
    {
      "id": "kbvnozw",
      "author": "The_Chaos-Collectiv3",
      "body": "i feel exactly this. been bulimic since i ws 14 (almost 22 now) and my eedee brain is like dont you just WISH you were Ana? You’d be sooooo much happier if you were Ana. its awful. ive been restricting my food intake for the last couple of days but im scared to weigh myself bc then the eedee thoughts will get even worse….its just a shit-show rn, unfortunately. ☹️☹️🫤🫤",
      "created_utc": 1701644486.0,
      "score": 5,
      "context": [
        {
          "id": "kbtd9en",
          "author": "Jazzlike_Interview_7",
          "body": "Kinda wish? Always. Now that I’m older with kids, every time I purge I get panicked that my heart is going to give out. Yes, of course AN is deadly and ugly, too. But at least I’d be skinny. I’ve felt the same way as you for like 20 yrs. It sucks.",
          "created_utc": 1701613212.0
        }
      ]
    },
    {
      "id": "kc0bph4",
      "author": "None",
      "body": "seriously like I hate how much the ed community shits on supposed “wannrexics” like with fatphobia and diet culture literally all bulimics and people with bed wish they had anorexia even anorexics who don’t feel they are good enough at restricting or feel they weigh too much wish they had anorexia like there’s is definitely a hierarchy in which eds are taken more seriously and which are praised from by non-disordered people so it isn’t weird that people want the one that is the most glorified >_>",
      "created_utc": 1701725500.0,
      "score": 3,
      "context": [
        {
          "id": "kbtzett",
          "author": "None",
          "body": "anyone that claims that they never wished they had AN is a fucking liar",
          "created_utc": 1701622573.0
        }
      ]
    },
    {
      "id": "kbwzhvz",
      "author": "Curious_Goat_8991",
      "body": "Literally could not have said it better myself. My AN developed into bulimia and sometimes I still fall back into restricting but I feel so much more addicted to bulimia, but it is by far so much worse. When I’m restricting, I feel so much more functioning in everything else and I actually have a social life. Yes I’m starving all the time but with bulimia I’m always hungry as well. At least during restriction I feel somewhat accomplished and proud.",
      "created_utc": 1701665158.0,
      "score": 7,
      "context": [
        {
          "id": "kbunzrt",
          "author": "sk1l3",
          "body": "I was anorexic first and now after 9 years of bulimia I'm relapsing back into anorexia. imo bulimia sucks so much more I'm so much more functional and have so much more time now that I'm not binging andn purging all day long anymore. I actually feel more energized and alive and like myself. I hate that I love it.",
          "created_utc": 1701631382.0
        }
      ]
    },
    {
      "id": "kbw3q3x",
      "author": "Luckyzzzz",
      "body": "It's not just bulimia that gets disregarded. I have atypical AN, and NO ONE thinks I have a problem bc I'm not underweight. It doesn't matter how much I'm suffering or how disordered my thinking is. Bc I weigh 125lbs every is FIIIINE. There's just a general lack of care for anyone whose bones aren't showing. It's really frustrating.",
      "created_utc": 1701650854.0,
      "score": 7,
      "context": [
        {
          "id": "kbvaom5",
          "author": "None",
          "body": "All the time. I was put into the psych ward several years back, on the ed floor. It was me and 19 anorexics. I watched them get all the help, all the therapy and watched everyone cry over them. I got told I wasn't really that bad and sent home. My last therapist told me she felt bulimia was probably keeping me alive. My husband's cousin died of anorexia, and the whole family still laments over her. They know full well I have this, and they enable me, because they don't even believe I'm ill. I've been turned down four times for treatment. I don't say this because I want anorexia- I understand that it's a terrible disease. But I think the lack of concern for bulimia leads to this type of thinking, that we need to be sicker, we need to strive to be anorexic, to garner any type of help.",
          "created_utc": 1701639591.0
        }
      ]
    },
    {
      "id": "kbt7oyo",
      "author": "rattedbitch",
      "body": "yeah, the grass is always greener on the other side huh",
      "created_utc": 1701610232.0,
      "score": 11,
      "context": [
        {
          "id": "kbt79pk",
          "author": "None",
          "body": "I developed AN from BN and they are both as hideous as each other\n\nIn fact, when I was AN I missed BN for being able to allow myself the food at all",
          "created_utc": 1701609992.0
        }
      ]
    },
    {
      "id": "kbt9xss",
      "author": "rattedbitch",
      "body": "im so sorry u had to go through that nobody deserves such horrible things :( im so happy that you chose to live, i wish you nothing but the best❤️",
      "created_utc": 1701611469.0,
      "score": 4,
      "context": [
        {
          "id": "kbt8rtw",
          "author": "bee102019",
          "body": "My bulimia was never due to weight. I was never overweight. I was forcibly locked in a closet and starved. I came to believe I wasn't worth of food. So, in effect, forced AN. Then I learned I couldn't eat without PTSD and intense fear. So I would eat, then vomit. There was always this past trauma over my head that said \"you've eaten, now you'll get hurt.\" This is a thing none of my therapists ever attempted to understand. \n\nOnto the stigma, as I've been in recovery for several years, I'm working on getting my teeth fixed up. I went to this dentist and I was honest about my bulimia history (why not, I'm there for help), and he said \"you're a lost cause, you're going to lose all your teeth). I left the office crying and my husband stayed to talk to them. They gave me a referral and I fully believe he just wrote me off as a bulimic, recovery or not... because I made that referral appointment and they said your teeth are totally salvageable.\n\nHad I needed dental implants it would have been $30k. I also previously had the septic tank pumped from \"grease\" (it was my vomit) for $400. Bulimia is expensive.\n\nBut forced AN lead to my bulimia. I don't recommend either. Save your money. Save your life.",
          "created_utc": 1701610832.0
        }
      ]
    },
    {
      "id": "kc12nnr",
      "author": "bla-bla-ha-ha",
      "body": "That is awful. You need a new dentist.",
      "created_utc": 1701735955.0,
      "score": 1,
      "context": [
        {
          "id": "kbt8rtw",
          "author": "bee102019",
          "body": "My bulimia was never due to weight. I was never overweight. I was forcibly locked in a closet and starved. I came to believe I wasn't worth of food. So, in effect, forced AN. Then I learned I couldn't eat without PTSD and intense fear. So I would eat, then vomit. There was always this past trauma over my head that said \"you've eaten, now you'll get hurt.\" This is a thing none of my therapists ever attempted to understand. \n\nOnto the stigma, as I've been in recovery for several years, I'm working on getting my teeth fixed up. I went to this dentist and I was honest about my bulimia history (why not, I'm there for help), and he said \"you're a lost cause, you're going to lose all your teeth). I left the office crying and my husband stayed to talk to them. They gave me a referral and I fully believe he just wrote me off as a bulimic, recovery or not... because I made that referral appointment and they said your teeth are totally salvageable.\n\nHad I needed dental implants it would have been $30k. I also previously had the septic tank pumped from \"grease\" (it was my vomit) for $400. Bulimia is expensive.\n\nBut forced AN lead to my bulimia. I don't recommend either. Save your money. Save your life.",
          "created_utc": 1701610832.0
        }
      ]
    },
    {
      "id": "kbzpdgq",
      "author": "AbundantiaTheWitch",
      "body": "Oh god me too",
      "created_utc": 1701717400.0,
      "score": 1,
      "context": [
        {
          "id": "kbuc5hh",
          "author": "Kioxik",
          "body": "I’m diagnosed with AN B/P subtype and I wish I just had AN-R",
          "created_utc": 1701627225.0
        }
      ]
    },
    {
      "id": "kc0c5ap",
      "author": "None",
      "body": "😭same I’m somewhere in between an b/p and bulimia (got diagnosed with atypical bulimia whatever that means) and I just want an r since doctors just assume I have a fast metabolism or I need to eat more and don’t ever want to focus on taking my bingeing seriously :/",
      "created_utc": 1701725666.0,
      "score": 1,
      "context": [
        {
          "id": "kbuc5hh",
          "author": "Kioxik",
          "body": "I’m diagnosed with AN B/P subtype and I wish I just had AN-R",
          "created_utc": 1701627225.0
        }
      ]
    },
    {
      "id": "kc13txw",
      "author": "bla-bla-ha-ha",
      "body": "I had AN years ago and recovered. It was a living hell. Now in my 50s and more secure and control than ever. Our daughter has AN and more recently SEVERE B. She’s 5’8” and 115lbs. May not seem bad, but she has a large frame. I’m 5’10” and vividly remember how accomplished I felt when I was 90 lbs. I remember the obsession with food, the exercising until I passed out, the reward of my spine protruding. At the same time, I felt so empty. I wish you and everyone on this site love and healing. It’s not easy, but you can heal and recover. ❤️",
      "created_utc": 1701736433.0,
      "score": 1,
      "context": [
        {
          "id": "kbuc5hh",
          "author": "Kioxik",
          "body": "I’m diagnosed with AN B/P subtype and I wish I just had AN-R",
          "created_utc": 1701627225.0
        }
      ]
    },
    {
      "id": "kc0clx0",
      "author": "None",
      "body": "Reallll like I went to hospital bc I was suffering with gastric dilation and was literally curled in a ball in pain bc of how much I ate and the doctor weighed me and told me I need to eat more and I ended up just leaving like it’s insane how simplistic doctors think eds are like underweight = just eat some more and being overweight = you’re not sick you just need to lose some weight but I definitely agree being a healthy weight or overweight is the absolute pits and hospitals think it’s perfectly fine to not treat people if they aren’t on their deathbed and severely underweight >:(",
      "created_utc": 1701725838.0,
      "score": 1,
      "context": [
        {
          "id": "kbvn516",
          "author": "Trip_the_light3020",
          "body": "AN b/p here and anyone who thinks all EDs are the same doesn't get it. \n\n I've been on the heavy side with periods of just binging, normal weight only BN, and it is incredibly invalidating and full of shame because of not being severely underweight.  It is not all the same and AN has always been seen as sicker and the better of the EDs. \n\nEven ED treatment centers mostly cater to restrictive EDs because binging is too shameful to admit apparently. At meals, nobody ever talks about binge urges at check out. It's always restriction thoughts or purging. You're right, BED is seen as the mostly lowly and shameful of all EDs and that is not right. It's quite sad.\n\nI still feel the same way even though I'm AN b/p, wishing for a \"worse and cleaner\" ED...I wish I had \"extreme\" restricting only anorexia with a BMI in a lower category",
          "created_utc": 1701644265.0
        }
      ]
    },
    {
      "id": "kbth3h5",
      "author": "rattedbitch",
      "body": "this!! i feel exactly the same way, i just couldnt put it into words. im always stuck in a bp / restrict cycle, currently it's bp (has been for a month or so) and i fucking hate it, i feel so dirty and out of control.",
      "created_utc": 1701615043.0,
      "score": 3,
      "context": [
        {
          "id": "kbtgdcj",
          "author": "Saphxmoon",
          "body": "I'm going through these feeling right now to be honest. I've been discussing it with my therapist because I was recently diagnosed with BN and it's giving me some pretty awful emotions. I think it's because of the emotions i feel surrounding the different behaviours. I struggle with restriction a lot, i'm always in a cycle of restriction to b/p. When I b/p i feel disgusted with my self, I feel ashamed and guilty. But when I restrict i feel horribly proud of my self, like I'm in control and I have discipline and restraint. Now that I'm diagnosed with BN, I hate that I'm being defined by behaviours that make me so disgusted with my self. I know that diagnoses DON'T define you, I know that's not how it works. But i can't stop feeling that way. I just wish I could be defined by something that makes me feel in control.",
          "created_utc": 1701614712.0
        }
      ]
    },
    {
      "id": "kbx04f0",
      "author": "Curious_Goat_8991",
      "body": "Literally me. I didn’t even get cravings when I was restricting I was just riding the high of losing weight. Of course, eventually will power ran out and I got so hungry and started binging which led me to purging 🤡",
      "created_utc": 1701665487.0,
      "score": 7,
      "context": [
        {
          "id": "kbwsn0o",
          "author": "Short-Lecture5634",
          "body": "Sometimes I miss the time I had AN. I was skinny and didn’t have urges to binge. Like, I didnt want to eat at all. And what I’ve got with bulimia? Nothing, I only lost time, effort and money. And I gained weight. \nStill… perhaps, AN led me to bulimia.",
          "created_utc": 1701661916.0
        }
      ]
    },
    {
      "id": "kbxls6g",
      "author": "bulimia-ModTeam",
      "body": "Talking about bulimia in a more positive light, as if it’s good or useful - favourite ways to do it, favourite things to purge…. And so on.",
      "created_utc": 1701680731.0,
      "score": 2,
      "context": [
        {
          "id": "kbw066l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701649408.0
        }
      ]
    },
    {
      "id": "kbxap67",
      "author": "ihavcolaforbreakfast",
      "body": "That’s so true. \nVirtual hugs are better than none. Sending one right back to you! 🙂",
      "created_utc": 1701672003.0,
      "score": 3,
      "context": [
        {
          "id": "kbtasce",
          "author": "ihavcolaforbreakfast",
          "body": "I had anorexia from age 13 to 19–although it never really leaves, it’s always there—then binge eating from 19 to 27–times in between where my eating habits were fine—and bulimia since last December. It’s worse now than ever. \n\nMy bulimia and binge eating brains are telling me all the damn time how good I felt when I was just skinny without the binging and the purging. When I look at pictures of me when my anorexia was the worst, I am reminded that no, I did, in fact, feel just as terrible, just different terrible. \n\nIt might have been “cleaner”, but that’s about it. Still, I totally get this way of thinking. \nIt saved me a lot of money, too. lol. (there’s nothing funny about this I’m just done)\n\nEdit: typo.",
          "created_utc": 1701611925.0
        },
        {
          "id": "kbw6wf4",
          "author": "bla-bla-ha-ha",
          "body": "Skinny never stops the pain. Wish I could give you a hug. 💕",
          "created_utc": 1701652214.0
        }
      ]
    },
    {
      "id": "kbt85kz",
      "author": "None",
      "body": "indeed. and i have discovered that the grass is actually the greenest with neither <3",
      "created_utc": 1701610494.0,
      "score": 11,
      "context": [
        {
          "id": "kbt79pk",
          "author": "None",
          "body": "I developed AN from BN and they are both as hideous as each other\n\nIn fact, when I was AN I missed BN for being able to allow myself the food at all",
          "created_utc": 1701609992.0
        },
        {
          "id": "kbt7oyo",
          "author": "rattedbitch",
          "body": "yeah, the grass is always greener on the other side huh",
          "created_utc": 1701610232.0
        }
      ]
    },
    {
      "id": "kbufuzt",
      "author": "bee102019",
      "body": "Same to you. Our struggles may not be identical, but they're in the same vein. I am here for you if you ever need an understanding ear. It's not easy to talk to someone who doesn't understand how you could ever \"decide\" (we all know it's not really a choice) to do this to your body. The hours, time, money I spent on ED never solved anything. That was my real choice. I am here for you.",
      "created_utc": 1701628502.0,
      "score": 8,
      "context": [
        {
          "id": "kbt8rtw",
          "author": "bee102019",
          "body": "My bulimia was never due to weight. I was never overweight. I was forcibly locked in a closet and starved. I came to believe I wasn't worth of food. So, in effect, forced AN. Then I learned I couldn't eat without PTSD and intense fear. So I would eat, then vomit. There was always this past trauma over my head that said \"you've eaten, now you'll get hurt.\" This is a thing none of my therapists ever attempted to understand. \n\nOnto the stigma, as I've been in recovery for several years, I'm working on getting my teeth fixed up. I went to this dentist and I was honest about my bulimia history (why not, I'm there for help), and he said \"you're a lost cause, you're going to lose all your teeth). I left the office crying and my husband stayed to talk to them. They gave me a referral and I fully believe he just wrote me off as a bulimic, recovery or not... because I made that referral appointment and they said your teeth are totally salvageable.\n\nHad I needed dental implants it would have been $30k. I also previously had the septic tank pumped from \"grease\" (it was my vomit) for $400. Bulimia is expensive.\n\nBut forced AN lead to my bulimia. I don't recommend either. Save your money. Save your life.",
          "created_utc": 1701610832.0
        },
        {
          "id": "kbt9xss",
          "author": "rattedbitch",
          "body": "im so sorry u had to go through that nobody deserves such horrible things :( im so happy that you chose to live, i wish you nothing but the best❤️",
          "created_utc": 1701611469.0
        }
      ]
    },
    {
      "id": "kc25dn1",
      "author": "bee102019",
      "body": "That dentist was promptly dumped. My husband had an appointment too for just some routine dental work (cavities, a cleaning, etc.) and he cancelled immediately. He stayed behind after I left crying but he was livid too with how I was treated. We went to the new dental specialist and were told \"oh, your teeth are totally salvageable. you don't need $30k dental implants.\" Forgive my language, but the dental tech and dental specialist said \"that guy was an a$$,\" thinking his judgement would make a difference from someone already years into remission and seeking help. How about \"congratulations, glad you're here, happy you want better dental health, lets see what we can do to help\" instead of \"you're going to lose all of your teeth in your 30s and pay $30k for totally unnecessary dental implants.\" Shame never helps. Support does. I reported him to the state board of dentistry. He should not be in contact with anyone with an ED history with his judgmental attitude. I went to nursing school and I know the damage it does to the body. It was never a choice. I would doubt he'd be kind to someone who simply didn't brush or floss enough. That dentist has no business interacting with the public. Yes, I have a history of ED, but I deserve respect. So proud of my husband for standing up for me. The way he stayed behind and handled everything and gave the receptionist his appointment card and said \"we will never be back,\" that's love. You don't treat my wife with respect and kindness, I'm not going to be back. So new dentist and dental specialist it is. The old one can take his scary expensive prognosis and be gone.",
      "created_utc": 1701752929.0,
      "score": 1,
      "context": [
        {
          "id": "kbt8rtw",
          "author": "bee102019",
          "body": "My bulimia was never due to weight. I was never overweight. I was forcibly locked in a closet and starved. I came to believe I wasn't worth of food. So, in effect, forced AN. Then I learned I couldn't eat without PTSD and intense fear. So I would eat, then vomit. There was always this past trauma over my head that said \"you've eaten, now you'll get hurt.\" This is a thing none of my therapists ever attempted to understand. \n\nOnto the stigma, as I've been in recovery for several years, I'm working on getting my teeth fixed up. I went to this dentist and I was honest about my bulimia history (why not, I'm there for help), and he said \"you're a lost cause, you're going to lose all your teeth). I left the office crying and my husband stayed to talk to them. They gave me a referral and I fully believe he just wrote me off as a bulimic, recovery or not... because I made that referral appointment and they said your teeth are totally salvageable.\n\nHad I needed dental implants it would have been $30k. I also previously had the septic tank pumped from \"grease\" (it was my vomit) for $400. Bulimia is expensive.\n\nBut forced AN lead to my bulimia. I don't recommend either. Save your money. Save your life.",
          "created_utc": 1701610832.0
        },
        {
          "id": "kc12nnr",
          "author": "bla-bla-ha-ha",
          "body": "That is awful. You need a new dentist.",
          "created_utc": 1701735955.0
        }
      ]
    },
    {
      "id": "kbt9ej6",
      "author": "rattedbitch",
      "body": "thats amazing im so happy for u❤️",
      "created_utc": 1701611181.0,
      "score": 5,
      "context": [
        {
          "id": "kbt79pk",
          "author": "None",
          "body": "I developed AN from BN and they are both as hideous as each other\n\nIn fact, when I was AN I missed BN for being able to allow myself the food at all",
          "created_utc": 1701609992.0
        },
        {
          "id": "kbt7oyo",
          "author": "rattedbitch",
          "body": "yeah, the grass is always greener on the other side huh",
          "created_utc": 1701610232.0
        },
        {
          "id": "kbt85kz",
          "author": "None",
          "body": "indeed. and i have discovered that the grass is actually the greenest with neither <3",
          "created_utc": 1701610494.0
        }
      ]
    }
  ]
}