{
  "id": "18aeb7m",
  "subreddit": "bulimia",
  "author": "Business-Sector-4488",
  "created_utc": 1701671491.0,
  "title": "A warning to beginners",
  "selftext": "I was you just a couple short weeks ago.\n\nYou might be reading posts where people warn that they can’t stop, and think that won’t be you. “I just want to lose weight and stop hating myself, I’ll be able to stop.”\n\nWhat you won’t see coming is the disorder will start to consume you much past your physical hatred.\n\nDo you feel lonely? Maybe something similar mentally? You’ll start to feel intense comfort not letting your body feel full and physically matching the way you feel mentally. \n\nDo not underestimate how addicting the feeling of “control” is in constantly purging out food.\n\nSuddenly, you’ll find yourself on vacation where you had a couple drinks and a high calorie pasta dish. And when you go to walk back to your hotel, you can feel it in your stomach. Then you feel your heart rate speed up, and you begin to sweat, and you begin to run back to the hotel panicking and thinking only about how you have to purge ASAP. \n\nThen your vacation is spent crying on the bathroom floor over the toilet. \n\nAnd it’s a lot harder to pretend you’re in control.\n\nIf you’re still in the stage where you aren’t addicted, I know you probably won’t listen to any of these warning posts. But I still hope you will. :(",
  "url": "https://www.reddit.com/r/bulimia/comments/18aeb7m/a_warning_to_beginners/",
  "score": 72,
  "num_comments": 9,
  "comments": [
    {
      "id": "kbxg4km",
      "author": "Theres_nothingtosee",
      "body": "wow.. I couldn’t write this better.. this is actually my first ever comment on reddit. never had the need i guess, but this just made me do it.. the feeling of the full stomach is something i think I will never get rid of. the constant thinking about purging even after a small snack. i wish i could turn back time and never get into this cycle. i pray everyday before sleep that i’ll stop. However at the end of the day i always end up with my head in the toilet. i wish somebody would just help me, but at the same time i don’t want help, because that would mean i have to recover and i’m just not ready to do that",
      "created_utc": 1701676066.0,
      "score": 23,
      "context": []
    },
    {
      "id": "kbyul48",
      "author": "sweetfaerieface",
      "body": "This is such a great post but I know beginners will not heed this advice. I thought I could stop at anytime. 47 years later and I still struggle everyday",
      "created_utc": 1701706181.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kbxuma4",
      "author": "None",
      "body": "Very well said. I'd give anything to not have lost half of my life to this disorder. To have my kids, my hearing, my teeth back. There's not a day that goes by that I don't wish I could take it all back and get out while it was easy.",
      "created_utc": 1701688058.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbyftmk",
      "author": "ZealousidealPick1385",
      "body": "Don’t do it. I agree with you every other comment. You will think you can stop and you can’t. I started in 2017 and have yet to stop. It’s not to a point where if I get stressed out, purging is the only thing that helps.",
      "created_utc": 1701700116.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbzc68n",
      "author": "biggestvladafan",
      "body": "You’re so right!\n\nI have been anorexic for a long time, but I never purged. A few months ago I started, and I said I would only do it a few times and that I would have it under control now I CANT stop. It’s especially dangerous because I don’t eat much. Like I’ll eat an apple and purge.",
      "created_utc": 1701712668.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kbzrxep",
      "author": "ChoiceInformal7823",
      "body": "dont start.",
      "created_utc": 1701718308.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kwa8ygh",
      "author": "Defiant_Resort7013",
      "body": "i feel this tonight. much love to everyone struggling.",
      "created_utc": 1711245982.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbzv2xj",
      "author": "Theres_nothingtosee",
      "body": "I remember my first time learning about bulimia. I went through all the warning posts and peoples horrific experience, but it still did not stop me. The voice in my head was so strong, nothing could’ve stopped it. \ni miss my old life, when i wasnt constantly thinking about food and numbers on the scale.",
      "created_utc": 1701719427.0,
      "score": 7,
      "context": [
        {
          "id": "kbyul48",
          "author": "sweetfaerieface",
          "body": "This is such a great post but I know beginners will not heed this advice. I thought I could stop at anytime. 47 years later and I still struggle everyday",
          "created_utc": 1701706181.0
        }
      ]
    },
    {
      "id": "kbzw6xe",
      "author": "calhap8203",
      "body": "It’s been around two years now and I still think “I can stop whenever I want” and then I try and stop and I just feel like I HAVE to purge and that’s it. It’s really really hard to stop :(",
      "created_utc": 1701719819.0,
      "score": 8,
      "context": [
        {
          "id": "kbyul48",
          "author": "sweetfaerieface",
          "body": "This is such a great post but I know beginners will not heed this advice. I thought I could stop at anytime. 47 years later and I still struggle everyday",
          "created_utc": 1701706181.0
        }
      ]
    }
  ]
}