{
  "id": "190bvux",
  "subreddit": "bulimia",
  "author": "Existing_Apricot2",
  "created_utc": 1704579562.0,
  "title": "do you eat again after purge?",
  "selftext": "I noticed that lately, after i purge... i start eating again like 30min after my purge. Idk y im doing this bc this is crazy bc i purge to get rid of food but after purge i eat again (esp bread...i need to stop having bread in my house)...\n\nI feel so sick about myself..........",
  "url": "https://www.reddit.com/r/bulimia/comments/190bvux/do_you_eat_again_after_purge/",
  "score": 85,
  "num_comments": 25,
  "comments": [
    {
      "id": "kgnbqws",
      "author": "UnrliablNrrtr666",
      "body": "When my purged were bad I would always try to eat something around half an hour later, especially things like banana and sports drinks mostly to replace lost electrolytes through purging.\n\nMy understanding is that if you feel you can’t stop a craving it’s because your body is trying to replace lost nutrients and, I guess to try and stabilise things like electrolytes, blood sugar etc.\n\nWhen I learned this that was when I decided my ideal post snack would be banana, sports drink that type of thing. It feels more like rebalancing my body chemistry than feeding the impulse. Hopefully that helps, I know it’s a really hard thing to feel after purging which can be quite traumatic in itself 💜",
      "created_utc": 1704580878.0,
      "score": 32,
      "context": []
    },
    {
      "id": "kgnbwy6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1704580938.0,
      "score": 30,
      "context": []
    },
    {
      "id": "kgnzyqs",
      "author": "wafflefries1124",
      "body": "If I’m stuck in a b/p cycle… then yes I’ll binge again and then purge. If not, then I’ll wait as long as I can and I’ll eat something very light. If it’s close to bed time, I’ll go to sleep. But I try to have some warm with a little honey for my throat after regardless.",
      "created_utc": 1704590057.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kgr6jqb",
      "author": "Informal-Ad-7356",
      "body": "Your body is trying to survive.   That simple.",
      "created_utc": 1704648314.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kgnrbu4",
      "author": "diagnosedfancytoast",
      "body": "The only time I ever feel truly HUNGRY 30-45 min after purging.  I figure I jump start my stomach into thinking it has to digest something, and then it tries to digest nothing.",
      "created_utc": 1704586747.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kgo560c",
      "author": "Aggressive_Access831",
      "body": "Ravenous after a purge I’ll normally eat a snack because it helps my stomach feel better and gets the weird feeling out of my throat",
      "created_utc": 1704592072.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kgpok40",
      "author": "sudenazbb",
      "body": "i always b/p during the day non stop so i don't care. i purge and eat and purge again till i sleep. but if i stop binging, then i wait like 20 min i even dont drink anything. then i drink water and if i feel dizzy or smth i usually eat fruits or eggs on toasts.",
      "created_utc": 1704621597.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kgnftg5",
      "author": "blue_bird37",
      "body": "Im sorry your feeling sick about  yourself. I feel the same way.",
      "created_utc": 1704582381.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kgo9nio",
      "author": "9u4rd14n",
      "body": "Like everyone is saying, don’t be too hard on yourself. It’s pretty common and it’s just because this is a stupid illness that makes us do stupid things.   \n  \nI used to eat a very specific dinner so I wouldn’t purge and I would be able to have enough to meet my calorie requirement for my medication. With best intentions, my dietician asked me to try to change it up, so I did, but it backfired. Now I eat a normal-ish dinner, but I have to immediately purge it. Then I have to make myself eat back a certain amount of calories to meet my medication’s requirements. Does it make sense no. Will I do it tonight? Yup. Time to eat it, yeet it, and eat more.",
      "created_utc": 1704593834.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kgoqksb",
      "author": "onekoolduck232",
      "body": "it's so normal. I always feel hungry again like 30 mins to an hour after. Sometimes its to the point that i purge again, but sometimes it’s like my closing ceremony if that makes sense lol",
      "created_utc": 1704600886.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kgo0ffe",
      "author": "petalnymph",
      "body": "it depends when. if i have a late night b+p then i sometimes fall asleep after. if it's during the day then yeah, usually.",
      "created_utc": 1704590239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kgo0nkh",
      "author": "kathruins",
      "body": "I did this too. I think its pretty normal tbh. it takes about that long for your blood sugar to drop; so its natural, dont be so hard on yourself. cutting out foods is only gonna make it worse unfortunately.",
      "created_utc": 1704590327.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kgo46bw",
      "author": "None",
      "body": " i eat and drink things that have electrolytes like pedialyte, juice, banana and nonfat milk since i just got rid of a bunch of liquids. i also safe eat foods that will fill me up like yogurt, oatmeal and pb. if its not a safe food ill probably feel guilty and purge it again. (and yes, peanut butter is a safe food of mine.)",
      "created_utc": 1704591682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kgv4dqm",
      "author": "hideaway1373",
      "body": "Yes I binge and then purge again until I’m too tired and just end up going to bed :(",
      "created_utc": 1704698939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kgngpfe",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1704582715.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kgo74eu",
      "author": "Pigmentvlek420",
      "body": "yeah I've done this before bc my binges were not objectively big (I have ana-bp), so I still wouldn't be satisfied after purging and start eating again but wouldn't purge AGAIN after that for some reason.\nBut other times after purging I just slept the urge off since mine always occured around 11pm-1am, so I would just take a double dose of sleeping pills and drift away.",
      "created_utc": 1704592835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgp5bwm",
      "author": "Friedsurimi",
      "body": "Yep! A very very light safe food, such as an apple, crackers, a salad with lemon and salt, an orange, and plenty asf of water",
      "created_utc": 1704608347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgpu9td",
      "author": "Host_Front",
      "body": "When you lose lots of water, your body will start craving carbs. Carbs are longer-lasting a source of water for your organism. Please eat at least something small and carby! The urge will not go away if you just drink, most likely.\nAlso, stomach stretching. Your brain feels that it is empty again as does not really like it.. Overall : yes, this is normal, please please please hydrate and eat something carby. If you freak out because of cals, still do, and try not to purge after, it will only get worse\nAll my love to you!!! Please hang on there :'(",
      "created_utc": 1704625813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgsh4wo",
      "author": "None",
      "body": "Yes and I hate it.  Sometimes get genuinely hungry after a purge sometimes just want to b/p again. Sometimes do it multiple times all day. You aren’t alone",
      "created_utc": 1704663521.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgyi9g9",
      "author": "stiddybounce",
      "body": "I usually eat really fast after I purge like within 5-10 minutes sometimes bc I am so hungry again. I usually eat peanut butter crackers, or ritz, sometimes little bites muffins. And it helps me calm that immediate hunger that follows.",
      "created_utc": 1704750669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgo0zzn",
      "author": "cetaceansituation",
      "body": "This is essentially me. There is nothing but eating, purging, restricting, and sleeping. Oh, and coffee so I can still handle taking care of my animals, which is the only other thing I can still do because I WILL NOT let my animals suffer. Anything other than that? Nope. Maybe some sims here and there, but this also means basic hygiene is something that hardly ever happens (like, only if I know I have to go to the doctor or in-person therapy).\n\nAnd I just got my denial for SSDI (I was told to file by every medical professional seeing me, though the denial was expected) because \"our findings indicate your condition to not be severe,\" despite the diagnosis on my medical file literally saying \"anorexia nervosa, binge/purge type, severe\" and having gotten turned away from res because \"you need a higher level of care.\" I'm in that weird limbo between inpatient and res, I think, though I haven't reached out to any inpatient facilities, as there aren't any near me and I'm hoping once my teeth can function like teeth, I'll be able to swing getting into res. \n\nThis is SUCH a glamorous illness! /s \n\n...Where's my cheat to remove this trait, guys?",
      "created_utc": 1704590462.0,
      "score": 6,
      "context": [
        {
          "id": "kgnbwy6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1704580938.0
        }
      ]
    },
    {
      "id": "kgo00sq",
      "author": "wafflefries1124",
      "body": "*warm water",
      "created_utc": 1704590079.0,
      "score": 1,
      "context": [
        {
          "id": "kgnzyqs",
          "author": "wafflefries1124",
          "body": "If I’m stuck in a b/p cycle… then yes I’ll binge again and then purge. If not, then I’ll wait as long as I can and I’ll eat something very light. If it’s close to bed time, I’ll go to sleep. But I try to have some warm with a little honey for my throat after regardless.",
          "created_utc": 1704590057.0
        }
      ]
    },
    {
      "id": "kgyjdi8",
      "author": "stiddybounce",
      "body": "This comment makes me want to cry&cry&cry",
      "created_utc": 1704751041.0,
      "score": 6,
      "context": [
        {
          "id": "kgr6jqb",
          "author": "Informal-Ad-7356",
          "body": "Your body is trying to survive.   That simple.",
          "created_utc": 1704648314.0
        }
      ]
    },
    {
      "id": "khc6r06",
      "author": "Vohsrek",
      "body": "I’m sorry, but “eat it, yeet it” made me chuckle",
      "created_utc": 1704962712.0,
      "score": 2,
      "context": [
        {
          "id": "kgo9nio",
          "author": "9u4rd14n",
          "body": "Like everyone is saying, don’t be too hard on yourself. It’s pretty common and it’s just because this is a stupid illness that makes us do stupid things.   \n  \nI used to eat a very specific dinner so I wouldn’t purge and I would be able to have enough to meet my calorie requirement for my medication. With best intentions, my dietician asked me to try to change it up, so I did, but it backfired. Now I eat a normal-ish dinner, but I have to immediately purge it. Then I have to make myself eat back a certain amount of calories to meet my medication’s requirements. Does it make sense no. Will I do it tonight? Yup. Time to eat it, yeet it, and eat more.",
          "created_utc": 1704593834.0
        }
      ]
    },
    {
      "id": "kgo0thv",
      "author": "bulimia-ModTeam",
      "body": "Talking about weight may be triggering to some people - as it may cause guilt, feeling as if they need to be smaller or have a competitive response to it",
      "created_utc": 1704590391.0,
      "score": 3,
      "context": [
        {
          "id": "kgngpfe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1704582715.0
        }
      ]
    },
    {
      "id": "kgyiym0",
      "author": "stiddybounce",
      "body": "I also eat oatmeal with bananas, honey & peanut butter very late at night before I go to bed. I can somehow keep this down and it doesn’t feel like anything on my stomach except taking away my hunger. I’ve gotten to the point where I’ve stopped binging & purging right before bed but I still sometimes slip up. This is the one thing that’s helped me a lot recently. And helps me feel I’m giving my body some nutrition even when it’s not much.",
      "created_utc": 1704750902.0,
      "score": 1,
      "context": [
        {
          "id": "kgyi9g9",
          "author": "stiddybounce",
          "body": "I usually eat really fast after I purge like within 5-10 minutes sometimes bc I am so hungry again. I usually eat peanut butter crackers, or ritz, sometimes little bites muffins. And it helps me calm that immediate hunger that follows.",
          "created_utc": 1704750669.0
        }
      ]
    }
  ]
}