{
  "id": "195pli2",
  "subreddit": "bulimia",
  "author": "onekoolduck232",
  "created_utc": 1705157372.0,
  "title": "I have gone two weeks without b/p",
  "selftext": "Just wanted to share… i honestly don't know if I will recover now, but I feel proud of myself for that.\n\nI’ve found that regularly working out has in some way negated my urges to binge and purge. I hope it continues working. Iknow there are underlying issues mentally that lead me to b/p that i definitley need to fix, but I'm really happy to have started on my recovery. It is the longest break I've gone in about two years. I had bulimia for 8 years. I guess not much to say here, but I'm just happy and proud of myself.",
  "url": "https://www.reddit.com/r/bulimia/comments/195pli2/i_have_gone_two_weeks_without_bp/",
  "score": 68,
  "num_comments": 19,
  "comments": [
    {
      "id": "khpau8f",
      "author": "AlliCakes",
      "body": "I'm on day 13 😁 keep it up! My New Year's Resolution was to not purge anymore. I'm doing weekly therapy and that seems to be helping a lot. Good luck!!",
      "created_utc": 1705171714.0,
      "score": 14,
      "context": []
    },
    {
      "id": "khoffmy",
      "author": "bygonessquared",
      "body": "This is awesome and something to feel proud about! I hope that it gets easier for you to avoid doing it as the weeks go by without it.",
      "created_utc": 1705160401.0,
      "score": 7,
      "context": []
    },
    {
      "id": "khorhx8",
      "author": "Gold_Tour6369",
      "body": "Same here! So proud of you, we can do this!!",
      "created_utc": 1705164903.0,
      "score": 4,
      "context": []
    },
    {
      "id": "khr6on9",
      "author": "ThestralBreeder",
      "body": "So proud of you! I remember when I hit two weeks… I’ve had a few slip ups, but it will be 4 years recovered in March (16 years in active bulimia). Thinking if you!",
      "created_utc": 1705196844.0,
      "score": 5,
      "context": []
    },
    {
      "id": "khots4t",
      "author": "Margaet_moon",
      "body": "Two weeks is huge my gal. I’ve suffered for 10 years and haven’t had more than 2 days so well done. Keep going. xx",
      "created_utc": 1705165727.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khpdkge",
      "author": "esoterique87",
      "body": "Well done! You should be so proud of yourself! Keep up the fantastic work. ❤️",
      "created_utc": 1705172669.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khpfsuj",
      "author": "Karalieva_Sniehu",
      "body": "Me too! Let's recover together!!",
      "created_utc": 1705173458.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khpnn70",
      "author": "superconklover",
      "body": "Thats great, stay strong, we believe in u!",
      "created_utc": 1705176269.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khqfxmt",
      "author": "invieranos",
      "body": "Congrats!!",
      "created_utc": 1705186637.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khqg4cn",
      "author": "wneg",
      "body": "Hell yeah- that's great to hear! You've got this 💪💗",
      "created_utc": 1705186703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khr1hfq",
      "author": "sweetfaerieface",
      "body": "That is something you should be proud of!!\n\nEdited to say I am on day 4!",
      "created_utc": 1705194848.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khram0f",
      "author": "New-Mountain-365",
      "body": "I am so proud of you!! Way to go! That’s great that you know there is underline issues. Same to me. Anxiety always drove me binging and purging and I am in recovery for 4 months",
      "created_utc": 1705198370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khssikb",
      "author": "Quiet_Attention_1676",
      "body": "i am so proud of you too 💖 Keep going you’re doing amazing. I know your pain i believe you can beat disorder!!!!! Good work pays off",
      "created_utc": 1705228699.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khu36e1",
      "author": "ChoiceInformal7823",
      "body": ";( congrats, i wish i could do the same",
      "created_utc": 1705251661.0,
      "score": 2,
      "context": []
    },
    {
      "id": "khuf8lc",
      "author": "Informal-Ad-7356",
      "body": "Fabulous!  This is how it's done!  Slow and steady,  baby steps.  I recovered after 35 years and it was hard work! DAILY hard work, until my healthy behaviors felt like the normal ones, and ED behaviors felt like the wrong, shameful actions.\n\nI still don't love my new recovered body shape or weight. But I LOVE the mental freedom...the mental Peace.  I don't freak out about meeting people for dinner, don't get furious that every social event seems to involve food,  no terror at the Holidays...\n\nTip: stop weighing yourself on the scale,  or at least put farther and farther amounts of time in between weighing,  until you can stop.  Tbh, after a while,  the number on there is no longer \"rewarding\".  Once you settle into your body's choice of weight, It doesn't move one way or the other dramatically anyway.  No reward or punishment there in the scale anymore. \n\nTip: Immediately get rid of ALL clothing in your closet that doesn't fit your changing, recovering body.   I went up 3 sizes during Recovery.   NOTHING in your closet or dresser should taunt you, be cruel to you... insist on ED behaviors just so you can fit into them.   I learned to shop at Second Hand Stores and Costco... but this is important here...keep NOTHING that no longer fits your changing body.\n\nIn a world screaming Diversity for race, gender, religion , it's about time there is BODY DIVERSITY. \n\nKeep going.  Always forgive yourself.   And always remember:  a slip is NOT a relapse.   It's hard work relearning how to choose food, eat food, sit in the uncomfortable and then digest food.  Relearn how to cope without ED behaviors...Relearn how to comfort yourself when facing Life's stressors (or other people's comments!)\n\nKeep going.  You are doing it.  You are not alone on the Recovery Journey.",
      "created_utc": 1705255806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "khrhti4",
      "author": "onekoolduck232",
      "body": "Lets keep it going! congrats to you too <3",
      "created_utc": 1705201237.0,
      "score": 2,
      "context": [
        {
          "id": "khpau8f",
          "author": "AlliCakes",
          "body": "I'm on day 13 😁 keep it up! My New Year's Resolution was to not purge anymore. I'm doing weekly therapy and that seems to be helping a lot. Good luck!!",
          "created_utc": 1705171714.0
        }
      ]
    },
    {
      "id": "khpv7ve",
      "author": "twopumpkinpasties",
      "body": "Well done 👏😊",
      "created_utc": 1705179068.0,
      "score": 1,
      "context": [
        {
          "id": "khpau8f",
          "author": "AlliCakes",
          "body": "I'm on day 13 😁 keep it up! My New Year's Resolution was to not purge anymore. I'm doing weekly therapy and that seems to be helping a lot. Good luck!!",
          "created_utc": 1705171714.0
        }
      ]
    },
    {
      "id": "khrhua3",
      "author": "onekoolduck232",
      "body": "we got this!",
      "created_utc": 1705201246.0,
      "score": 3,
      "context": [
        {
          "id": "khorhx8",
          "author": "Gold_Tour6369",
          "body": "Same here! So proud of you, we can do this!!",
          "created_utc": 1705164903.0
        }
      ]
    },
    {
      "id": "khrhyad",
      "author": "onekoolduck232",
      "body": "Hey there we go! You got this! proud of you :)",
      "created_utc": 1705201291.0,
      "score": 2,
      "context": [
        {
          "id": "khr1hfq",
          "author": "sweetfaerieface",
          "body": "That is something you should be proud of!!\n\nEdited to say I am on day 4!",
          "created_utc": 1705194848.0
        }
      ]
    }
  ]
}