{
  "id": "1au96ir",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1708301051.0,
  "title": "if you think your bulimia is not \"that bad\", read this.",
  "selftext": "after 2 years of b/p free, i relapsed in january. i started binging and purging again. it wasnt everday, it was just a few days a week. i thought since i was not doing it often, and since i was planning to stop very soon, it wouldnt have any negative effects. i was wrong. a few weeks after i started, i got this terrible pain in my upper right abdomen. excruciating pain. in the past when i would b/p, i had stomach pain and it would go away. so i just waited for it to go away. and it did, for some time. but then it'd come back. even if i didnt b/p, sometimes the pain just came back in the middle of the night, and it would be so bad that i wouldnt be able to fall asleep. i thought it was indigestion or something. but one day it was so bad i just had to go to the ER. i had gallstones and had to get my gallbladder removed. after that experience i thought \"ill never b/p again\" but i was wrong. just last week, i gave myself the pass to b/p again. i was pretty much healed from surgery and i b/p for just three days. suddenly, i was having migraines for hours everday, random aches and pains in my body, my period hadn't come, my teeth were aching. just THREE DAYS and all these symptoms came. then i stopped b/p. i was really gonna be serious about recovery so i didnt b/p for 5 days. today, after 5 days clean i decided to b/p ONCE. i just ate some ice cream, some oreos and then i purged. it wasnt huge, it wasnt severe. after about 2-3 hours after the purge, i got this painful, sudden migraine. i was shaking, i was dizzy, i felt nauseous. it was the worst headache of my life, ive never experienced anything like this. i involuntarily threw up and then fell asleep on the couch. after an hour long nap, i ate some food and drank some water but i still felt so fatigued that all i could do was lay down and watch t.v. now i dont know what caused that headache, but it felt like a thunderclap headache which means that i may have had a blood vessel pop near the brain, which is common when purging. i hope to god its nothing that serious but im going to go to the doctor and try and get an MRI scan soon. if you ever thought that bulimia wont cause issues, that you're somehow resistant to these issues, think again. i hadnt purged for TWO YEARS and just 1 month and a two weeks of infrequent b/p led me to have terrible migraines, gallstones and probably 1 or 2 new cavities. RECOVER AS SOON AS YOU POSSIBLY CAN. the health issues arent worth any of it.",
  "url": "https://www.reddit.com/r/bulimia/comments/1au96ir/if_you_think_your_bulimia_is_not_that_bad_read/",
  "score": 85,
  "num_comments": 4,
  "comments": [
    {
      "id": "kr2m033",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1708304655.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kr3n5yf",
      "author": "StankFace24",
      "body": "This is so close to my current experience down to the gallbladder removal. \n\nExcept now because my liver has function issues, I also throw up unintentionally all the time on top of 5-6 time weekly purge even when I don’t mean to. It’s horrible. Same headaches, the shaking, the sweating, even confusion and I still cannot stop. \n\nThank you for sharing your story/struggle. \n\nPeople think you can just turn it on and off when you can’t. Being 3 days post op after a 4 day hospitalization and hunched over a toliet is not what I wanted to do with my life. I legitimately cannot turn it off even when I know I need to",
      "created_utc": 1708321562.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kr4moib",
      "author": "None",
      "body": "literally. ive come to terms that some of the side effects that ill have from bulimia are irreversible or will at least stick around for a really long time. theres really no other choice but recovery when it comes to eds, you can keep it up for a long time but at the end of the day its either choosing recovery or choosing a very slow suicide",
      "created_utc": 1708345700.0,
      "score": 9,
      "context": [
        {
          "id": "kr3n5yf",
          "author": "StankFace24",
          "body": "This is so close to my current experience down to the gallbladder removal. \n\nExcept now because my liver has function issues, I also throw up unintentionally all the time on top of 5-6 time weekly purge even when I don’t mean to. It’s horrible. Same headaches, the shaking, the sweating, even confusion and I still cannot stop. \n\nThank you for sharing your story/struggle. \n\nPeople think you can just turn it on and off when you can’t. Being 3 days post op after a 4 day hospitalization and hunched over a toliet is not what I wanted to do with my life. I legitimately cannot turn it off even when I know I need to",
          "created_utc": 1708321562.0
        }
      ]
    }
  ]
}