{
  "id": "1b561z6",
  "subreddit": "bulimia",
  "author": "MaximumCredit7924",
  "created_utc": 1709433088.0,
  "title": "ppl only care until it looks like you’re dying ",
  "selftext": "honestly just a rant but it seems to me that people only start really worrying when it’s almost “too late” like i swear a person could show every single sign of an ED (heavy restricting, not eating at all and even flat out talking about purging and or binging and people turn a blind eye. people only care when you’re severely underweight but if you aren’t they rlly do not give a single fuck. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1b561z6/ppl_only_care_until_it_looks_like_youre_dying/",
  "score": 203,
  "num_comments": 34,
  "comments": [
    {
      "id": "kt3iui9",
      "author": "None",
      "body": "real lol my mom literally caught me purging and nothing has changed, i’m convinced if i was thinner she’d care more",
      "created_utc": 1709435455.0,
      "score": 59,
      "context": []
    },
    {
      "id": "kt3qngr",
      "author": "royceriel",
      "body": "Real. Nobody cared until I was at my lw. Even during peak purging cycles, nobody bat an eye because I was almost OW",
      "created_utc": 1709438975.0,
      "score": 41,
      "context": []
    },
    {
      "id": "kt3ytmy",
      "author": "Good_Vegetable8960",
      "body": "Yeah that was definitely my experience. At my sickest I got the most compliments, comments and concerns. But if it is a noticeable change, especially in a short amount of time it can be shocking and/or alarming. It was a bit triggering, as it did make me want to stay that way but it was definitely one of the easier things to let go of once starting recovery.",
      "created_utc": 1709443089.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kt4j0jq",
      "author": "None",
      "body": "seriously. I try to forgive my family, especially now that I recovered, but I literally cried and begged my family to help me, to just send me an email once a week asking how I did that week.  Their answer was, well you haven't died yet. I don't get how being near death was the requirement to have their love or concern. I would have helped them. My family acted like it didn't exist for 30 years. And now I have permanent damage. I get that I needed to recover for myself, but I don't think I should have had to do it alone with absolutely no support.",
      "created_utc": 1709456043.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kt42mmc",
      "author": "lunanicie",
      "body": "Ya people will comment when you look thinner. It’s not usually lack of care that keeps them from commenting at other points. I really think it’s lack of understanding(which they really can’t if they haven’t had the problem) and not knowing if saying something would help or hurt. When you look thinner they think you’re doing worse than usual(which really depends on the person and was never true for me) and figure a comment is worth the risk of saying something 🤷🏼‍♀️ \nMy old roommate just made the first comment about my eating problems because I’m smaller than she’s seen before(from doing better not worse actually). I’m sure she heard me puke for years while living with me(embarrassing). Her not bringing it up before wasn’t lack of care, I’m pretty sure she just knew it was a private and touchy subject. Besides, she had her own shit going on and I didn’t want help/didn’t know what would even help",
      "created_utc": 1709445198.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kt4ns04",
      "author": "cherryseason1408",
      "body": "some don’t even care when you are visibly dying.",
      "created_utc": 1709459490.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kt4yzsv",
      "author": "AwkwardYak",
      "body": "I have bulimia, I have have had it for 30 years and now, I have multiple hernias due to a super long surgical scar and bulimia that show odd lumps, so people are reminded that I’m bulimic. Otherwise, unless I’ve been super skinny (like when I was getting married and lost a lot of weight between the last fitting and the big day 🤦🏻‍♀️), nobody notices much. I’ve lost my teeth to bulimia, to show you the damage it does.\n\nI have found in my 30 years of eating disorders that many truly don’t comprehend eating disorders, especially if purging is involved. Many don’t know what to say, their brains literally don’t seem able to comprehend.. 🤷🏻‍♀️ I’m slowly coming to terms with that.",
      "created_utc": 1709467468.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kt4kmsf",
      "author": "None",
      "body": "You’re right, and god help you if you’re overweight some people will even think your ED is a good thing or not believe you have it!",
      "created_utc": 1709457215.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kt5l3xa",
      "author": "sushiyum12",
      "body": "That’s so real. People only care when I was underweight and it’s sad truth",
      "created_utc": 1709478317.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt610gn",
      "author": "eddiemomentos",
      "body": "Honestly I feel like this applies to so so many health related issues :/ I saw a video of someone talking about the same thing and how dismissive doctors are until you’re on the deathbed, and even then it feels like they treat you like you’re making the choice to stay sick as if it’s not as serious as it is if that makes sense",
      "created_utc": 1709484218.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt3ijd2",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thats not completely true, it is just that when it looks worse and shows visably people notice easier. When do you, yourself really ask someone how they are doing? Most of the time, I do aswell, people just say good. “Funny” story I remember now, when I was doing anorexic stuff an old football coach that hadnt seen me for years thought I had cancer. Ps my sentence making is terrible, i need sleep GN 🫡",
      "created_utc": 1709435323.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kt3uq8x",
      "author": "ChazRPay",
      "body": "If you hide your ED, I'm not sure anyone would necessarily be concerned unless there was something obvious to create concern.  I lived with Bulimia for years and I felt broken and out of control most days but outwardly hid what I was feeling.  I didn't expect or wasn't looking for emotional support and it wasn't a cry for help.  Thinking back, maybe my behaviors seemed obvious and why would my family or friends be so oblivious?  but, really I was living a deceptive life binging and purging.",
      "created_utc": 1709440967.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt5m9p5",
      "author": "Psychological_Gear94",
      "body": "Yeah it’s true. My whole family knows I b/p and they kinda just ignore it. They showed some concern when I was smaller but even then it was like the elephant in the room",
      "created_utc": 1709478778.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt5xd5v",
      "author": "Icy_Veterinarian4476",
      "body": "Very true. Even medical professionals didn’t start threatening to hospitalise me until I was emaciated. \n\nSo much better now though. Weight restored. Your ed is always valid and you’ll always be sick enough. Don’t let anyone else convince you otherwise ❤️",
      "created_utc": 1709482919.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kt78ky1",
      "author": "nyctosys",
      "body": "its not exactly the same sort of situation so im sorry for barging in but it reminded me of something.\n\ni remember a little while back telling my dad that im anorexic while i was drunk. all he did was say \"youre not anorexic.\" and go on with his night. its honestly so triggering that no one cares if youre not \"skinny enough\". like, do they not understand that is the exact thing that is going to make someone worse???",
      "created_utc": 1709499507.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kt7ej5c",
      "author": "vbgirl24",
      "body": "Too real. This is fucked to say but it makes me resentful, angry, and motivated to lose weight",
      "created_utc": 1709501580.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kt837wj",
      "author": "anon_survivorr",
      "body": "My fiancé listens to me purge and don’t even ask if I’m fine anymore. I honestly don’t even think he sees ED as issues.",
      "created_utc": 1709510878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ku0qazm",
      "author": "None",
      "body": "Omg I feel that!!! When I was super duper extremely low eight hardly eating, everyone was worried and could see I was sick cause it reflected what I felt inside and mentally they cared and were worried. \n\nNow mentally it’s so much worse mentally but  because of my attempts to get better and I’ve achieved a “healthier weight , pork’s don’t worry. All they do is see me eat better but mentally I’m so much worse. I’m still underweight  but because I’m not as unhealthy as I was before no one cares.but I’ve been purging everyday at every meal and dinner time I purge ( I eat healthy and repeat but then feel guilty), and even worse when I have a late night snack I’ll purge that too. \n\n\nBut all people see is I’m eating well and better , and at a “healthier weight” I’m ok, and they won’t bother me. Which is fine for my ED cause I can purge in peace but also it’s been getting worse and worse ",
      "created_utc": 1709955157.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktjn9ll",
      "author": "Informal_Bear1130",
      "body": "This is so relatable :( it makes me feel invalid too",
      "created_utc": 1709689211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt601j0",
      "author": "Nebion666",
      "body": "People only cared when I was begging for attention on my fucking knees. I think a lot of the people i used to be closer to just think im recovered now because ive fucking gained more weight and i started already overweight im a failed bulimic.",
      "created_utc": 1709483871.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt6j75b",
      "author": "Turbulent-Catch-142",
      "body": "I’ve struggled with bulimia off and on since I was 15. I’ve been in a bad place (to the point where I was an inpatient) due to dangerously precarious blood levels. \n\nPurging became an issue summer 2023. My husband has known my issues in the past but I always pulled myself out of it after a number of months. From summer 2022 to now it’s been really bad. He notices everything. I still don’t get to use the toilet without him calling out to me and/or opening the door. \n\nAll this to say - sometimes people think you’ll get past it or through it. As a mum if one of my kids was struggling and I wasn’t aware, I’d hope they’d let me know and I would be checking on them a lot.",
      "created_utc": 1709490561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt77s8s",
      "author": "Sporknut",
      "body": "Ants on my toilet. Living off meal replacements then binging at night. Running excessively. \n\nNada until I laid it out out for them… then they got me one doctors appointment and then called it good",
      "created_utc": 1709499229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt89k5l",
      "author": "Izmuchennyy",
      "body": "This is true. My mother treated me very well during my lw and extreme b/p, but since I stopped losing weight and had various failed recs and have been stuck in a binge cycle, she treats me like shit and tells me it's all my fault for having a 'weak mentality' or smth like that",
      "created_utc": 1709513399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kt4kqmx",
      "author": "None",
      "body": "I see no reason why you would need to forgive that?",
      "created_utc": 1709457292.0,
      "score": 6,
      "context": [
        {
          "id": "kt4j0jq",
          "author": "None",
          "body": "seriously. I try to forgive my family, especially now that I recovered, but I literally cried and begged my family to help me, to just send me an email once a week asking how I did that week.  Their answer was, well you haven't died yet. I don't get how being near death was the requirement to have their love or concern. I would have helped them. My family acted like it didn't exist for 30 years. And now I have permanent damage. I get that I needed to recover for myself, but I don't think I should have had to do it alone with absolutely no support.",
          "created_utc": 1709456043.0
        }
      ]
    },
    {
      "id": "kt5msu1",
      "author": "Psychological_Gear94",
      "body": "Yeah I think a lot of times people don’t know how to approach it and therefore just avoid it",
      "created_utc": 1709478992.0,
      "score": 7,
      "context": [
        {
          "id": "kt42mmc",
          "author": "lunanicie",
          "body": "Ya people will comment when you look thinner. It’s not usually lack of care that keeps them from commenting at other points. I really think it’s lack of understanding(which they really can’t if they haven’t had the problem) and not knowing if saying something would help or hurt. When you look thinner they think you’re doing worse than usual(which really depends on the person and was never true for me) and figure a comment is worth the risk of saying something 🤷🏼‍♀️ \nMy old roommate just made the first comment about my eating problems because I’m smaller than she’s seen before(from doing better not worse actually). I’m sure she heard me puke for years while living with me(embarrassing). Her not bringing it up before wasn’t lack of care, I’m pretty sure she just knew it was a private and touchy subject. Besides, she had her own shit going on and I didn’t want help/didn’t know what would even help",
          "created_utc": 1709445198.0
        }
      ]
    },
    {
      "id": "kt9bn7b",
      "author": "madmompalm",
      "body": "Did you end up going for dentures or implants?",
      "created_utc": 1709530021.0,
      "score": 2,
      "context": [
        {
          "id": "kt4yzsv",
          "author": "AwkwardYak",
          "body": "I have bulimia, I have have had it for 30 years and now, I have multiple hernias due to a super long surgical scar and bulimia that show odd lumps, so people are reminded that I’m bulimic. Otherwise, unless I’ve been super skinny (like when I was getting married and lost a lot of weight between the last fitting and the big day 🤦🏻‍♀️), nobody notices much. I’ve lost my teeth to bulimia, to show you the damage it does.\n\nI have found in my 30 years of eating disorders that many truly don’t comprehend eating disorders, especially if purging is involved. Many don’t know what to say, their brains literally don’t seem able to comprehend.. 🤷🏻‍♀️ I’m slowly coming to terms with that.",
          "created_utc": 1709467468.0
        }
      ]
    },
    {
      "id": "kt4vbm9",
      "author": "thingstodo258",
      "body": "the op said, even when they straight up say that they are purging people seem to care less because its not visible, it is completely true",
      "created_utc": 1709464995.0,
      "score": 2,
      "context": [
        {
          "id": "kt3ijd2",
          "author": "YeahNoYeahMaybeNo",
          "body": "Thats not completely true, it is just that when it looks worse and shows visably people notice easier. When do you, yourself really ask someone how they are doing? Most of the time, I do aswell, people just say good. “Funny” story I remember now, when I was doing anorexic stuff an old football coach that hadnt seen me for years thought I had cancer. Ps my sentence making is terrible, i need sleep GN 🫡",
          "created_utc": 1709435323.0
        }
      ]
    },
    {
      "id": "kxd7tae",
      "author": "grxydoll",
      "body": "if you don't mind me asking how did your friends notice your bulimic behaviors? :0",
      "created_utc": 1711868025.0,
      "score": 1,
      "context": [
        {
          "id": "kt3uq8x",
          "author": "ChazRPay",
          "body": "If you hide your ED, I'm not sure anyone would necessarily be concerned unless there was something obvious to create concern.  I lived with Bulimia for years and I felt broken and out of control most days but outwardly hid what I was feeling.  I didn't expect or wasn't looking for emotional support and it wasn't a cry for help.  Thinking back, maybe my behaviors seemed obvious and why would my family or friends be so oblivious?  but, really I was living a deceptive life binging and purging.",
          "created_utc": 1709440967.0
        }
      ]
    },
    {
      "id": "kt5mhuw",
      "author": "Psychological_Gear94",
      "body": "Also, I lost 96lbs in a year and a half and still no one cared. I always felt like I just never got small enough to even be considered skinny",
      "created_utc": 1709478869.0,
      "score": 2,
      "context": [
        {
          "id": "kt5m9p5",
          "author": "Psychological_Gear94",
          "body": "Yeah it’s true. My whole family knows I b/p and they kinda just ignore it. They showed some concern when I was smaller but even then it was like the elephant in the room",
          "created_utc": 1709478778.0
        }
      ]
    },
    {
      "id": "kth6yql",
      "author": "Flat_One_6622",
      "body": "same for me, makes me think maybe he'll care if i lose enough weight",
      "created_utc": 1709658679.0,
      "score": 2,
      "context": [
        {
          "id": "kt837wj",
          "author": "anon_survivorr",
          "body": "My fiancé listens to me purge and don’t even ask if I’m fine anymore. I honestly don’t even think he sees ED as issues.",
          "created_utc": 1709510878.0
        }
      ]
    },
    {
      "id": "ktc1l1l",
      "author": "AwkwardYak",
      "body": "Neither, actually. I meant to get dentures, about a month after and never got that done, other things came up. I’m used to not having any now, but I know some people are shocked the first time they notice. I have wondered if it’s too late, I’d like to look pretty smiling again.",
      "created_utc": 1709578365.0,
      "score": 2,
      "context": [
        {
          "id": "kt4yzsv",
          "author": "AwkwardYak",
          "body": "I have bulimia, I have have had it for 30 years and now, I have multiple hernias due to a super long surgical scar and bulimia that show odd lumps, so people are reminded that I’m bulimic. Otherwise, unless I’ve been super skinny (like when I was getting married and lost a lot of weight between the last fitting and the big day 🤦🏻‍♀️), nobody notices much. I’ve lost my teeth to bulimia, to show you the damage it does.\n\nI have found in my 30 years of eating disorders that many truly don’t comprehend eating disorders, especially if purging is involved. Many don’t know what to say, their brains literally don’t seem able to comprehend.. 🤷🏻‍♀️ I’m slowly coming to terms with that.",
          "created_utc": 1709467468.0
        },
        {
          "id": "kt9bn7b",
          "author": "madmompalm",
          "body": "Did you end up going for dentures or implants?",
          "created_utc": 1709530021.0
        }
      ]
    },
    {
      "id": "kt825el",
      "author": "Playful-Reflection12",
      "body": "96 lbs is a lot to lose. I’d think you’d look very thin unless you were  seriously overweight.",
      "created_utc": 1709510455.0,
      "score": 3,
      "context": [
        {
          "id": "kt5m9p5",
          "author": "Psychological_Gear94",
          "body": "Yeah it’s true. My whole family knows I b/p and they kinda just ignore it. They showed some concern when I was smaller but even then it was like the elephant in the room",
          "created_utc": 1709478778.0
        },
        {
          "id": "kt5mhuw",
          "author": "Psychological_Gear94",
          "body": "Also, I lost 96lbs in a year and a half and still no one cared. I always felt like I just never got small enough to even be considered skinny",
          "created_utc": 1709478869.0
        }
      ]
    },
    {
      "id": "kt8naqp",
      "author": "Psychological_Gear94",
      "body": "Yeah unfortunately I was almost morbidly obese and then ended up a few lbs from being underweight. Short ppl problems…lol",
      "created_utc": 1709518922.0,
      "score": 3,
      "context": [
        {
          "id": "kt5m9p5",
          "author": "Psychological_Gear94",
          "body": "Yeah it’s true. My whole family knows I b/p and they kinda just ignore it. They showed some concern when I was smaller but even then it was like the elephant in the room",
          "created_utc": 1709478778.0
        },
        {
          "id": "kt5mhuw",
          "author": "Psychological_Gear94",
          "body": "Also, I lost 96lbs in a year and a half and still no one cared. I always felt like I just never got small enough to even be considered skinny",
          "created_utc": 1709478869.0
        },
        {
          "id": "kt825el",
          "author": "Playful-Reflection12",
          "body": "96 lbs is a lot to lose. I’d think you’d look very thin unless you were  seriously overweight.",
          "created_utc": 1709510455.0
        }
      ]
    },
    {
      "id": "kt8ng65",
      "author": "Psychological_Gear94",
      "body": "Also body dysmorphia fucked me up because I look back at my lw now and realize I was at least smallish",
      "created_utc": 1709518981.0,
      "score": 3,
      "context": [
        {
          "id": "kt5m9p5",
          "author": "Psychological_Gear94",
          "body": "Yeah it’s true. My whole family knows I b/p and they kinda just ignore it. They showed some concern when I was smaller but even then it was like the elephant in the room",
          "created_utc": 1709478778.0
        },
        {
          "id": "kt5mhuw",
          "author": "Psychological_Gear94",
          "body": "Also, I lost 96lbs in a year and a half and still no one cared. I always felt like I just never got small enough to even be considered skinny",
          "created_utc": 1709478869.0
        },
        {
          "id": "kt825el",
          "author": "Playful-Reflection12",
          "body": "96 lbs is a lot to lose. I’d think you’d look very thin unless you were  seriously overweight.",
          "created_utc": 1709510455.0
        },
        {
          "id": "kt8naqp",
          "author": "Psychological_Gear94",
          "body": "Yeah unfortunately I was almost morbidly obese and then ended up a few lbs from being underweight. Short ppl problems…lol",
          "created_utc": 1709518922.0
        }
      ]
    }
  ]
}