{
  "id": "1bam08g",
  "subreddit": "bulimia",
  "author": "Flat_One_6622",
  "created_utc": 1710002730.0,
  "title": "grossest thing you've done because of bulimia?",
  "selftext": "i've seen this post on this subreddit before, but i wanted to make another one as inspiration to cut down on b/p. my list is long, but just yesterday i was eating so fast that i didn't realize the pesto i had put on my pasta was completely moldy. it tasted rancid, but i ate it anyways because it was all i had made. what's yours?",
  "url": "https://www.reddit.com/r/bulimia/comments/1bam08g/grossest_thing_youve_done_because_of_bulimia/",
  "score": 123,
  "num_comments": 158,
  "comments": [
    {
      "id": "ku3eo2b",
      "author": "OkCommunication6119",
      "body": "Threw away food to avoid b/p later… But consumed said food straight out of the trash hours later. FML",
      "created_utc": 1710003985.0,
      "score": 163,
      "context": []
    },
    {
      "id": "ku3me87",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710006557.0,
      "score": 125,
      "context": []
    },
    {
      "id": "ku3novl",
      "author": "Temporary-Wrap-6694",
      "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
      "created_utc": 1710006983.0,
      "score": 99,
      "context": []
    },
    {
      "id": "ku3h6y6",
      "author": "that_one_artsy_chick",
      "body": "Threw up in bags and hid them in my room",
      "created_utc": 1710004841.0,
      "score": 72,
      "context": []
    },
    {
      "id": "ku3w6pb",
      "author": "kianagunning",
      "body": "almost wanna put a tmi gross here lmao but i once accidentally purged up my recently swallowed laxatives so fished them back out, rinsed them off and swallowed them again. absolutely rancid but i had no laxatives left and it felt necessary at the time. mostly recovered now but it’s what I consider to be one of the worst moments of my ED",
      "created_utc": 1710009815.0,
      "score": 68,
      "context": []
    },
    {
      "id": "ku467tv",
      "author": "Salt_Negotiation_334",
      "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
      "created_utc": 1710013163.0,
      "score": 67,
      "context": []
    },
    {
      "id": "ku4brn4",
      "author": "toucansam0384",
      "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
      "created_utc": 1710015055.0,
      "score": 55,
      "context": []
    },
    {
      "id": "ku4xvnu",
      "author": "madeleinetwocock",
      "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
      "created_utc": 1710022875.0,
      "score": 54,
      "context": []
    },
    {
      "id": "ku3vcp4",
      "author": "None",
      "body": "when i drink too much water while binging i literally have splashed vomit on the walls 😭 i have raked through my vomit with my hands before as well, nearly shat myself from the strain of purging the other day… oh and i kept a bin with puke residue in my closet for weeks bc i was too depressed to clean it properly lol",
      "created_utc": 1710009543.0,
      "score": 50,
      "context": []
    },
    {
      "id": "ku4sixw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710020943.0,
      "score": 49,
      "context": []
    },
    {
      "id": "ku4mdca",
      "author": "calhap8203",
      "body": "I’ve done a lot of things already mentioned but quite a common gross thing is when you’re throwing up and it splashes back on your face or in your mouth. Makes me shudder every time but not enough to quit purging :/",
      "created_utc": 1710018728.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ku3fcst",
      "author": "BimBimmie",
      "body": "Shoving my hands down the toilet through all the vomit to check if everything’s there LOL. \nAlso when I was at our families cottage in the mountians alone there’s no running water there, so I decided to b/p in a massive plastic tub on the floor. When it was full I poured it into the incinetating toilet one paper bag at a time… not exactly classy. Also I’ve definitly shat myself a couple of times due to how fucked up my digestive system has become…🥲",
      "created_utc": 1710004223.0,
      "score": 68,
      "context": []
    },
    {
      "id": "ku4aw2h",
      "author": "peanut-butter-blood",
      "body": "Fished through the vomit in the sink to make sure the red bits I was seeing were food and not blood.",
      "created_utc": 1710014760.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ku3oudu",
      "author": "RadishFew3972",
      "body": "I’ve put my hands in the toilet too to measure the vomit making sure it’s all there. Thrown up in the shower and sink. I actually clogged my boyfriend sink once but I was afraid the noise it would make in the toilet. I pull over on the side of the road to purge because I also binge while driving. Purged in buckets and or bags and behind bushes. Purged in countless public toilets and wonder if that’s how I got hepatitis A many years ago. And I’ve shat myself when I was abusing laxatives. I haven’t gotten to the point of eating food out of the trash but it’s so god damn expensive, I’m thinking I have to start.",
      "created_utc": 1710007372.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ku3wnj3",
      "author": "invader_zimothy",
      "body": "I’d pick my roomate’s leftover uneaten meals/takeout out of the garbage and eat it 😰",
      "created_utc": 1710009971.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ku488bm",
      "author": "Brandyscloset9",
      "body": "I've washed my hands in the toilet water after I flush at random places, restaurants and bars to make sure all the vomit is off my hand before I leave the stall when I know there are people by the sink in the rest room",
      "created_utc": 1710013849.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ku3z66n",
      "author": "gomichan",
      "body": "Purging into a public toilet was probably my lowest, besides having to dig through my vomit to break up big chunks so it'll flush easier",
      "created_utc": 1710010795.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ku6mzp1",
      "author": "vinaa27",
      "body": "Threw up in the garden. The birds started EATING it and it attracted quite a few, my mum heard their chirps and she adores birds, she saw them eating vomit from the window.\n\nDefinitely re-eaten some purges. All time low.",
      "created_utc": 1710049706.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ku4pgsp",
      "author": "None",
      "body": "chewing and spitting food to go back and re eat it",
      "created_utc": 1710019834.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ku6cn1i",
      "author": "NonverbalSquirrel",
      "body": "Constantly urinating myself every single time I purge and I have to clean the piss off the bathroom floor along with the rest of the mess. Also, vomit chunks in my hair X_X",
      "created_utc": 1710044384.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ku4gslu",
      "author": "RainbowTowers9",
      "body": "I once decided to purge in a public toilet. I took my ring off and put it near the sink. When I had finished I washed my hands and went to put it back on but I dropped it in the toilet full of vomit. It was such a special ring I had no choice but to put my hand in and fish it out. That was definitely a WTF am I doing with my life moment.\nAlso eaten other people’s leftovers out of the bin 24 hours later.\nI’ve also C/S food and then eaten what I spat out to purge it 🫣",
      "created_utc": 1710016805.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ku4rvf3",
      "author": "JustaVet-MedGirl",
      "body": "Unclog the toilet with my bare hands, shit in the tub, soil myself, diy enema, eat rotten food, the list goes on and on.",
      "created_utc": 1710020706.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ku697rq",
      "author": "rosecreamdream",
      "body": "Purging then pissing then shitting all in one toilet. the smell was horrendous. Purging constantly during a 10 hour flight isnt really gross but it definitely hurt my body. Purging in trash bags in my room and having it leak. Purging on the side of a road and walking home covered in vomit. Pulling noodles out of my throat also sucks. I also throw up in my hands and place it in the toilet cause I hate splash back.",
      "created_utc": 1710042734.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ku52r1b",
      "author": "edthrowaway1290",
      "body": "grab my two little hands and wipe my wet vomit covered hands from throwing up outside in the grass in the middle of the night with a leaf and parts of a tree shrub, but right after sifting through the vomit with my grass and wet vomit covered hands just to check what i got out in the mush\n\nyou're welcome for the really graphic description\n\nabhorrent texture having bits of crushed leaf on wet gritty-mush covered hands btw",
      "created_utc": 1710024696.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ku5sogl",
      "author": "None",
      "body": "This is gross in a different way but I got into deep debt because I would get my binging food delivered. It was so stupid and irresponsible, it makes me feel ashamed.",
      "created_utc": 1710035373.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ku49l30",
      "author": "None",
      "body": "Put my hand through my own vomit to see what I’ve purged :/ had a glove on but still",
      "created_utc": 1710014310.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ku6ga0o",
      "author": "punk_chick_",
      "body": "trying to avoid the b/p by restricting …. and then failing by scraping food off of the bottom of the dirty work dishes and eating it. unfortunately i have done this more than once",
      "created_utc": 1710046199.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ku7m31g",
      "author": "dementedforever_",
      "body": "It's hard to choose from the wonderfully revolting things I've done in my 28year career of living with an ed. But shitting myself in the middle of Kings Cross Station before getting on a 12hour train was an especially mortifying day!",
      "created_utc": 1710073591.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ku4pnvm",
      "author": "unknown_caller01",
      "body": "For me it was when one time I ate canes (a big trigger food back then) and purged in the tub, the tub clogged and it was halfway full so I used a sponge to soak a little at a time and ran to the toilet and back, super scary and took half an hour 🫠",
      "created_utc": 1710019907.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ku5hs5m",
      "author": "stupidemobxtch",
      "body": "its between (tmi) >!liquid yellow diarrhoea!< on a light grey fabric sofa directly opposite my mother OR when i was in psych when i was 14 the ward i eas on had ensuites so i was constantly b/p’ing. One time a nurse caught me midnway and locked the door (needd a key from the outside. I waited for her to leave then carried on in the “bin” (bucket) i can’t remember after that but yeah both awful",
      "created_utc": 1710030780.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ku5tc06",
      "author": "iluvchikins",
      "body": "puked in a cereal bag and was going to throw it away at a gas station, i pressed the brakes and it went everywhere on the floor.",
      "created_utc": 1710035648.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ku57045",
      "author": "beaudebonair",
      "body": "Regurgitating the alcohol I almost threw up.....my addiction too booze interfered with my bulimia, I swear at times it was a weird contrast back then. Kills people even faster, glad my life is spared.",
      "created_utc": 1710026341.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ku8hg3c",
      "author": "ResolutionCareful255",
      "body": "This is so mf embarrassing because I haven’t confessed this before but I Threw up a ng tube and fitted it again by myself, only to throw it up 9 times that day before giving in, the tube touched the floor and other places as well, but I couldn’t let the staff even get a inclination that I was purging so I had no choice but to refit it even after it fell in a toilet. probably the most disgusting and desperate thing I’ve ever done, but happy to say I haven’t binged or purged in 1 year and I am recovered now (I think!) from both bulimia nervosa and Axn :) it does get better !",
      "created_utc": 1710087226.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ku4b4w4",
      "author": "Mediocre_Vehicle2540",
      "body": "I clogged the sink while purging and I had to stop to unclog it with my bare hands before I finished purging",
      "created_utc": 1710014842.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ku55lcz",
      "author": "None",
      "body": "Not technically bulimia but as a consequence of having it for over 10 years, the thing that's helped me recover is grosser than the bulimia ||(chewing and spitting food in zip bags)||",
      "created_utc": 1710025776.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ku65y5r",
      "author": "THESASAS",
      "body": "Continued to purge after I got all four wisdom teeth removed …",
      "created_utc": 1710041235.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ku4zevs",
      "author": "kristine0711",
      "body": "So I got a lip piercing (vertical labret) that I tend to play with with my tongue resulting in the jewellery loosening and subsequently fall out from time to time. So obviously I’ve had instances where my piercing falls out while purging, and well yeah, I’ve put my hands down into the vomit more than once looking for the jewellery\n\nObviously, if I ended up retrieving said jewellery from the vomit I gave it one hell of a cleaning and sterilised it to the best of my ability before I put it back in. \n\nAfter it happened for the second or third time I realised it may be a good idea to have a few in backup in case it were to happen again, so I am glad to say that I hopefully won’t be doing it again",
      "created_utc": 1710023447.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku5bjcb",
      "author": "barahonera",
      "body": "I once had an accident purging at a restaurant I liked and vomited all over my black leather shoes. I was so fatigued that I walked home like that. I must’ve smelled, and it took me a couple days until I got around to cleaning them",
      "created_utc": 1710028204.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku6sskw",
      "author": "RazorsandMittens",
      "body": "Ate my own vomit because I felt so bad for puking, then throwing it back up because it was so bad",
      "created_utc": 1710053217.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ku7h1iz",
      "author": "None",
      "body": "puked into my hands and then placed the puke into the toilet",
      "created_utc": 1710070379.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku7hhub",
      "author": "calfreak",
      "body": "Got my wisdom teeth out and purged the next day even though I promised I’d quit. And I think that clogging the whole house would be my lowest moments. Both happened in the last 2 weeks 🫣",
      "created_utc": 1710070685.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ku6iokz",
      "author": "texaselysiumBlue582",
      "body": "started to pee myself while purging but couldn't stop, so I just kept purging until my bladder was empty. I've also dug around, as many of you have, in my own vomit to look for certain foods/make sure I got to a certain food. Shit myself ..",
      "created_utc": 1710047414.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku6nvnh",
      "author": "None",
      "body": "I would cover stuff in mustard and throw it away to stop from binging, then days later would dig it up and eat it… also full on peeing while purging",
      "created_utc": 1710050222.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ku6pt90",
      "author": "Normal-Sort4287",
      "body": "Purging in an outhouse while backcountry hiking/camping. \n\nOr leaving a garbage bag full of puke outside my back door only to have wild animals get into it overnight…",
      "created_utc": 1710051383.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ku7li2y",
      "author": "Fuwa_Fuwa_",
      "body": "Purged in the shower so much I nearly had permanently damaged the plumbing in our old house.\n\nNearly fell into a dumpster while trying to balance on the ledge trying to puke into it.\n\nPuked in the woods behind our house past midnight and ended up with lots of bug bites constantly.\n\nPuking in a communal trailer park porta potty in August.\n\nPuking so hard that I get nosebleeds, so I would have blood, snot and vomit in the toilet all at once.\n\nUsed so many laxatives I couldn't make it to the toilet on time and had to squat over my trash can, which ended up mostly on the floor anyway.\n\nAte moldy birthday cake.",
      "created_utc": 1710073246.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku7rq7k",
      "author": "ebitempurasushi",
      "body": "When I lived with my family, I left used dishes and empty packages in my wardrobe because I was too scared to bring all of them downstairs when they were looking. \nSo I once left two bowls I used to eat ice cream and cereal and an empty jar of jam in my room for weeks until my mom noticed an awful smell in my room when I was on vacation and discovered all these things rotten and moldy.",
      "created_utc": 1710076621.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ku8trke",
      "author": "vinaa27",
      "body": "Vomited in bottles. Like empty milk bottles or empty 1 litre fizzy drink bottles. Left them in the closet and forgot about them. I would empty them in the toilet. Left them so long one time all the food was fermented and gassed up the bottles they EXPLODED in the bathroom as soon as I let the tiniest bit of air out as I was opening them. Quite literally like a b 0 mb. Called my girlfriend crying as I spent hours cleaning that up as my parents were asleep upstairs. \n\nFermented vomit on the floor. On the walls. The bottles were puffed and ballooning up. I should’ve known but at 1 am I’m not the smartest. The smell was the worst oh my fucking god.",
      "created_utc": 1710091549.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ku4ww6o",
      "author": "Nebion666",
      "body": "Ive dug through my own vomit on many occasions when I used to purge in a sink. Was when my parents were still together and my mom was not so ignorant so I had to do that bec she would hear me if i used the toilet. Since it was a sink, my puke got stuck often on the uh bars in the drain and i had to stuff it down and break it apart with my hands. Now my parents are separated and I live with my dad who is shockingly clueless when im purging in the next fucking room.",
      "created_utc": 1710022520.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku52jhx",
      "author": "kshsjsjdhsjdhskdush",
      "body": "Reached into the toilet with my bare hands to unclog food because it wouldn’t flush 😭",
      "created_utc": 1710024617.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ku5xtzg",
      "author": "Yuthenia",
      "body": "Retrieving a brownie from the trash can to avoid b/p. (mind yall it was full of spit 😭).",
      "created_utc": 1710037603.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ku8v9a1",
      "author": "5dollareggroll",
      "body": "Gotten sick bc of repeatedly having my face in the toilet",
      "created_utc": 1710092062.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ku98e2i",
      "author": "Hellterskellter44",
      "body": "Threw up in bags and hid them in my basement, puked in gas station bathrooms, vom splashed back in my eyes/hair/face",
      "created_utc": 1710096577.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kubp2dn",
      "author": "braindamagecore",
      "body": "Splashing vomit getting into your eyes and quickly rinsing it so u don’t get pinkeye😭",
      "created_utc": 1710131005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kubdj2q",
      "author": "baybaluzza",
      "body": "When I was in residential I didn't have a roommate so I stole some of the extra large paper bags that they gave us for laundry and I would purge in that after every meal and keep it under my desk 😭  I kept doing it until I had like two completely full bags and one of the techs commented on the smell after like three weeks.",
      "created_utc": 1710125482.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kubegke",
      "author": "Apatchycat",
      "body": "accidentally of course- had diarrhoea while purging.\n\nleft buckets/bag of purge beneath bed to go bad.\n\nleft buckets/containers of purge in my drawers to be infested with ants- one of the scariest/grosest things ive ever encountered in my life to this day!\n\nvomited into a shoe while driving.\n\nused my hand to shovel vomit countless times.\n\nso many more honestly",
      "created_utc": 1710125886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kubon4o",
      "author": "braindamagecore",
      "body": "Throwing up in cups that I kept on my dresser for days",
      "created_utc": 1710130783.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kucrxhn",
      "author": "wafflefries1124",
      "body": "Peed and lost bowel control (aka diarrhea) while purging. Ate rotten food to try to get food poisoning cause I can’t purge hands free and the finger rubbing friction was irritating my throat soooooo bad!",
      "created_utc": 1710157750.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuhfn2t",
      "author": "AdmirableRecipe2877",
      "body": "When I wasn’t able to throw up in the toilet or shower, I would use my cats litter box. Id make a big circle, puke in the middle and scoop the litter on top of it to hide the puke. \n\nAlso if I wasn’t able to puke in the toilet again I would use bags, bowls, box’s, cups, shampoo bottles, the list goes on. But I’ve never done it outside or in a public bathroom it’s too risky.",
      "created_utc": 1710222369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuk9046",
      "author": "Local-Regret7831",
      "body": "All of these things you share, I did it too. But I think none of you did What I did… it’s literally so gross",
      "created_utc": 1710269806.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kukfaev",
      "author": "gracefulagain",
      "body": "I took a handful of lax after a b/p, you know just to really get everything out and start \"fresh\".\n It hit me way before I was expecting it to and I was clenching so hard but my boyfriend was in the bathroom taking one of his famous hour long shits and I ended up shitting myself, hot poo running down my leg right as he opened the door. \nWhen I finally came out of the bathroom he was sitting on the bed and there was a bottle of carpet cleaner and paper towels next to him, because his dad smelled the shit smell from upstairs and assumed the cat shit on the floor and brought it down.",
      "created_utc": 1710272057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwoesi5",
      "author": "lariana0",
      "body": "One time when I was going to flush the toilet after a really big b/p session the toilet got clogged and I had to digg my hand in the toilet to fix it",
      "created_utc": 1711477033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgkd8qs",
      "author": "bulimiaisabitch",
      "body": "Okay plz don't judge me buttt,\n\nI used to grab my throw up in the toilet and eat it to try and make myself gag even more and purge more.\nOr I would eat food out the trash that I threw out cuz I thought I was done with purging\n\nI would pee myself if I purged too hard\n\nI threw up everywhere a few times.\nOn the walls, all over the floor and toilet.",
      "created_utc": 1741376925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrn6vme",
      "author": "Medium_Act_4206",
      "body": "One time my mom found like 8 bags of P*** in my closet.. was only 15 at the time",
      "created_utc": 1746909043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ku4ipmz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710017460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku4j3cr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710017589.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku4uf9j",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710021630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku52pxq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710024684.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku9ihpi",
      "author": "unyms",
      "body": "eating moldy bread from the trash",
      "created_utc": 1710100184.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kucts8z",
      "author": "monimuni",
      "body": "Eat food that’s already fallen to the floor, or drink tap water (which isn’t safe in my country) because “I’ll throw it up later anyways.”",
      "created_utc": 1710158772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kun0it1",
      "author": "Fair-Combination-937",
      "body": "Lots of them unfortunately.... 10+ years, a lot has happened. 1. Ate out of the trash can and then threw up right back into it 2. Shit myself while purging and it splattered on the wall, I didn't care, I just wanted to get all the vomit out. 3. Stuck my hand in the toilet to feel how much vomit came out and make sure everything came up. 4. Purged into buckets and containers 5. Ate other people's food/ stole food from family members (not exactly gross but definitely felt shame after). All these things made me wish I could stop but I never could so far.",
      "created_utc": 1710309021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kya5dgl",
      "author": "brattyappledrops",
      "body": "Hide bags of vomit in my room when I was living with my mom when it got real bad it’d start to smell but my parents didn’t go in my room so they didn’t notice.",
      "created_utc": 1712378804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkb4g2q",
      "author": "nashgold_lol",
      "body": "Ahah, I don't know if this counts, but I drank 5-8 laxative tablets a day. I was also very hysterical when I couldn't vomit to the end😭",
      "created_utc": 1724832320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnetb42",
      "author": "Senior_Leading_6533",
      "body": "was eating in my car in the parking lot of the food place. immediately got the urge to purge once i was done and normally i’ll just open the door and do it outside, but there was too many people around. i had no other option but to puke in the bag and the bag had burst open and broke due to the amount in it. was all over my car seats, floor, myself, etc. had nothing to clean it with.",
      "created_utc": 1744812413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mo6y4n4",
      "author": "None",
      "body": "Went into $30,000 worth of debt and kept spending every dime to binge and purge. Still do this to this day.",
      "created_utc": 1745201994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp3j0nh",
      "author": "SquareTiny2789",
      "body": "Purged, clogged the toilet bc the food was so greasy and I had to keep scooping out the water until I could fish out the rest of the culprit with my hands bc a cup wouldn’t fit.",
      "created_utc": 1745643209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrn8a1t",
      "author": "Medium_Act_4206",
      "body": "Waiting money b\\p on doordash when i needed that money even doing this shi at work getting over 5 teeth removed but i still continue to hurt my body 😔 I wish I could stop",
      "created_utc": 1746909519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku3esis",
      "author": "Flat_One_6622",
      "body": "omg i've done that too",
      "created_utc": 1710004027.0,
      "score": 35,
      "context": [
        {
          "id": "ku3eo2b",
          "author": "OkCommunication6119",
          "body": "Threw away food to avoid b/p later… But consumed said food straight out of the trash hours later. FML",
          "created_utc": 1710003985.0
        }
      ]
    },
    {
      "id": "kuiu4ly",
      "author": "Yourfellowgrandpa",
      "body": "Bro I was just abt to comment that lmaoo",
      "created_utc": 1710252625.0,
      "score": 2,
      "context": [
        {
          "id": "ku3eo2b",
          "author": "OkCommunication6119",
          "body": "Threw away food to avoid b/p later… But consumed said food straight out of the trash hours later. FML",
          "created_utc": 1710003985.0
        }
      ]
    },
    {
      "id": "ku419js",
      "author": "memyselfandi10089",
      "body": "This happens so much for me I would out toilet roll between my vag flaps just incase",
      "created_utc": 1710011493.0,
      "score": 48,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku3rwah",
      "author": "Good_Vegetable8960",
      "body": "Happens every time for me",
      "created_utc": 1710008398.0,
      "score": 20,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku5g7wm",
      "author": "Separate-Gap-3298",
      "body": "I always have to pee first and try to empty my bladder before I purge. It happens to me every single time. \n\nBut to be fair, I pee a little bit every time I cough or sneeze or get up too fast since I had a baby.",
      "created_utc": 1710030130.0,
      "score": 19,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku3mm3w",
      "author": "Flat_One_6622",
      "body": "me too",
      "created_utc": 1710006629.0,
      "score": 10,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku4bzo9",
      "author": "toucansam0384",
      "body": "Happens all the time. I've shoved towels down my pants on many occasions.",
      "created_utc": 1710015132.0,
      "score": 8,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku3wpao",
      "author": "lemonuponlemon",
      "body": "Same",
      "created_utc": 1710009987.0,
      "score": 7,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku531nx",
      "author": "Dont_know_them987",
      "body": "Yep me too 🙁",
      "created_utc": 1710024807.0,
      "score": 5,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "kuatoak",
      "author": "DestinyFlowers",
      "body": "Sit on the toilet and puke into a bowl or small trash can",
      "created_utc": 1710117364.0,
      "score": 1,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "lkyk1ol",
      "author": "mahesper",
      "body": "me too",
      "created_utc": 1725178588.0,
      "score": 1,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "mb42err",
      "author": "Illustrious_Fox_4696",
      "body": "Why does this happen",
      "created_utc": 1738766923.0,
      "score": 1,
      "context": [
        {
          "id": "ku3me87",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710006557.0
        }
      ]
    },
    {
      "id": "ku4pebv",
      "author": "unknown_caller01",
      "body": "oh my god the prolapse sounds so scary",
      "created_utc": 1710019810.0,
      "score": 21,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        }
      ]
    },
    {
      "id": "ku5wvu7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710037184.0,
      "score": 7,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        }
      ]
    },
    {
      "id": "ku662rm",
      "author": "THESASAS",
      "body": "Oh god I’m scared of this happening! My bowel is so dependent on enemas",
      "created_utc": 1710041294.0,
      "score": 3,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        }
      ]
    },
    {
      "id": "kupc97k",
      "author": "ProofNewspaper2720",
      "body": "When I lived in the dorm, I would go in the showers if they seemed empty, purge in a garbage bag, then transition to toilet to dump the bag. Doubt the shower actually disguised the sound of purging.",
      "created_utc": 1710349930.0,
      "score": 2,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        }
      ]
    },
    {
      "id": "ku4ltzy",
      "author": "calhap8203",
      "body": "Ooo when you forget about them and pick the bags up a while later and the bag breaks 🤮 happened once for me and I never forgot about a bag again (that I’m aware of)",
      "created_utc": 1710018535.0,
      "score": 36,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "ku4pg67",
      "author": "unknown_caller01",
      "body": "i feel like this is a universal experience among ppl with mia",
      "created_utc": 1710019828.0,
      "score": 17,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "ku5foqa",
      "author": "None",
      "body": "thank god i’m not the only one. mine attracted flies if i forgot about them",
      "created_utc": 1710029914.0,
      "score": 9,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "ku4571q",
      "author": "Annakant",
      "body": "I did that too…",
      "created_utc": 1710012817.0,
      "score": 8,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "ku6ikpf",
      "author": "Asleep-Yak7335",
      "body": "Have done too, the bags often had leaks and there was vomit running over all my room’s floor 🥲",
      "created_utc": 1710047358.0,
      "score": 4,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "kub0od0",
      "author": "Secure_Lychee_782",
      "body": "so glad to know I’m not the only one, I did this as a teenager and when I lived with my mother and she thought it was so abnormal and thought I was “trying to collect my vomit”",
      "created_utc": 1710120157.0,
      "score": 4,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "kuylf4n",
      "author": "SassyApple55",
      "body": "omggg I did this and my room would smell rancid",
      "created_utc": 1710488269.0,
      "score": 1,
      "context": [
        {
          "id": "ku3h6y6",
          "author": "that_one_artsy_chick",
          "body": "Threw up in bags and hid them in my room",
          "created_utc": 1710004841.0
        }
      ]
    },
    {
      "id": "ku50c2w",
      "author": "-cumdogmillionaire-",
      "body": "You’re not alone. I’ve also fished different meds and laxatives out of my puke piles, rinsed them and took them. Having an ED is so embarrassing",
      "created_utc": 1710023784.0,
      "score": 20,
      "context": [
        {
          "id": "ku3w6pb",
          "author": "kianagunning",
          "body": "almost wanna put a tmi gross here lmao but i once accidentally purged up my recently swallowed laxatives so fished them back out, rinsed them off and swallowed them again. absolutely rancid but i had no laxatives left and it felt necessary at the time. mostly recovered now but it’s what I consider to be one of the worst moments of my ED",
          "created_utc": 1710009815.0
        }
      ]
    },
    {
      "id": "ku82l3h",
      "author": "withextracheesepls",
      "body": "i’ve done that more times than i can count lol you’re not alone",
      "created_utc": 1710081525.0,
      "score": 5,
      "context": [
        {
          "id": "ku3w6pb",
          "author": "kianagunning",
          "body": "almost wanna put a tmi gross here lmao but i once accidentally purged up my recently swallowed laxatives so fished them back out, rinsed them off and swallowed them again. absolutely rancid but i had no laxatives left and it felt necessary at the time. mostly recovered now but it’s what I consider to be one of the worst moments of my ED",
          "created_utc": 1710009815.0
        }
      ]
    },
    {
      "id": "ku4cy15",
      "author": "toucansam0384",
      "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
      "created_utc": 1710015459.0,
      "score": 24,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        }
      ]
    },
    {
      "id": "ku5sj59",
      "author": "None",
      "body": "Jesus, you win.",
      "created_utc": 1710035312.0,
      "score": 21,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "ku8sumz",
      "author": "Fleurri_",
      "body": "Been there 😩😩",
      "created_utc": 1710091227.0,
      "score": 6,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "ku666cq",
      "author": "THESASAS",
      "body": "Oh lord",
      "created_utc": 1710041341.0,
      "score": 6,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "kupchjh",
      "author": "ProofNewspaper2720",
      "body": "Many, many times. It was the easiest way to avoid getting caught if the porta potty was isolated.",
      "created_utc": 1710350005.0,
      "score": 4,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "kubot7v",
      "author": "braindamagecore",
      "body": "Real",
      "created_utc": 1710130869.0,
      "score": 2,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "kubov53",
      "author": "braindamagecore",
      "body": "Mom caught me once as a teenager bc I did this LMAO",
      "created_utc": 1710130897.0,
      "score": 2,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "kuewevf",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710186267.0,
      "score": 1,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "l3dtjbs",
      "author": "Acceptable-Fault2512",
      "body": "I've done this several times- worst one was camping with a big group. They weren't sinks or TP so I had to walk through the whole campsite full of people to rinse off my hand and face in a spigot. No soap either so I know I stunk.",
      "created_utc": 1715312248.0,
      "score": 1,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        }
      ]
    },
    {
      "id": "ku8068z",
      "author": "PeachYogurtLover",
      "body": "Oh yes, completely agree lol",
      "created_utc": 1710080506.0,
      "score": 7,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        }
      ]
    },
    {
      "id": "kuamihj",
      "author": "psychofeline72",
      "body": "I too am genuinely impressed at the honesty, wouldn't find it elsewhere.",
      "created_utc": 1710114525.0,
      "score": 6,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        }
      ]
    },
    {
      "id": "kubeqqq",
      "author": "Apatchycat",
      "body": "this is wild lmao thanks for sharing",
      "created_utc": 1710126010.0,
      "score": 3,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        }
      ]
    },
    {
      "id": "ku7tecb",
      "author": "madeleinetwocock",
      "body": "the wall splash happens to me every time i drink anything carbonated during a binge ☠️ \n\nwe’re in the same boat friendo! too bad that boat is like the titanic tho lol rip",
      "created_utc": 1710077423.0,
      "score": 6,
      "context": [
        {
          "id": "ku3vcp4",
          "author": "None",
          "body": "when i drink too much water while binging i literally have splashed vomit on the walls 😭 i have raked through my vomit with my hands before as well, nearly shat myself from the strain of purging the other day… oh and i kept a bin with puke residue in my closet for weeks bc i was too depressed to clean it properly lol",
          "created_utc": 1710009543.0
        }
      ]
    },
    {
      "id": "ku7tkc7",
      "author": "madeleinetwocock",
      "body": "i felt this comment deep in my soul",
      "created_utc": 1710077503.0,
      "score": 8,
      "context": [
        {
          "id": "ku4sixw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710020943.0
        }
      ]
    },
    {
      "id": "ku8t3in",
      "author": "Fleurri_",
      "body": "This!",
      "created_utc": 1710091312.0,
      "score": 2,
      "context": [
        {
          "id": "ku4mdca",
          "author": "calhap8203",
          "body": "I’ve done a lot of things already mentioned but quite a common gross thing is when you’re throwing up and it splashes back on your face or in your mouth. Makes me shudder every time but not enough to quit purging :/",
          "created_utc": 1710018728.0
        }
      ]
    },
    {
      "id": "ku3hr27",
      "author": "Flat_One_6622",
      "body": "i literally shit myself the other day ur not alone",
      "created_utc": 1710005021.0,
      "score": 21,
      "context": [
        {
          "id": "ku3fcst",
          "author": "BimBimmie",
          "body": "Shoving my hands down the toilet through all the vomit to check if everything’s there LOL. \nAlso when I was at our families cottage in the mountians alone there’s no running water there, so I decided to b/p in a massive plastic tub on the floor. When it was full I poured it into the incinetating toilet one paper bag at a time… not exactly classy. Also I’ve definitly shat myself a couple of times due to how fucked up my digestive system has become…🥲",
          "created_utc": 1710004223.0
        }
      ]
    },
    {
      "id": "ku3ltme",
      "author": "Temporary-Wrap-6694",
      "body": "I've shat myself a couple of times during binges as well 😪",
      "created_utc": 1710006365.0,
      "score": 13,
      "context": [
        {
          "id": "ku3fcst",
          "author": "BimBimmie",
          "body": "Shoving my hands down the toilet through all the vomit to check if everything’s there LOL. \nAlso when I was at our families cottage in the mountians alone there’s no running water there, so I decided to b/p in a massive plastic tub on the floor. When it was full I poured it into the incinetating toilet one paper bag at a time… not exactly classy. Also I’ve definitly shat myself a couple of times due to how fucked up my digestive system has become…🥲",
          "created_utc": 1710004223.0
        }
      ]
    },
    {
      "id": "ku47xoa",
      "author": "Brandyscloset9",
      "body": "I've done that too.. many times",
      "created_utc": 1710013748.0,
      "score": 9,
      "context": [
        {
          "id": "ku3fcst",
          "author": "BimBimmie",
          "body": "Shoving my hands down the toilet through all the vomit to check if everything’s there LOL. \nAlso when I was at our families cottage in the mountians alone there’s no running water there, so I decided to b/p in a massive plastic tub on the floor. When it was full I poured it into the incinetating toilet one paper bag at a time… not exactly classy. Also I’ve definitly shat myself a couple of times due to how fucked up my digestive system has become…🥲",
          "created_utc": 1710004223.0
        }
      ]
    },
    {
      "id": "kubp676",
      "author": "braindamagecore",
      "body": "GOD I RELATE TO THIS SM",
      "created_utc": 1710131064.0,
      "score": 3,
      "context": [
        {
          "id": "ku4aw2h",
          "author": "peanut-butter-blood",
          "body": "Fished through the vomit in the sink to make sure the red bits I was seeing were food and not blood.",
          "created_utc": 1710014760.0
        }
      ]
    },
    {
      "id": "kubpbso",
      "author": "braindamagecore",
      "body": "Omg new fear unlocked :( I’m sorry you’ve experienced that with the hep A :(",
      "created_utc": 1710131147.0,
      "score": 1,
      "context": [
        {
          "id": "ku3oudu",
          "author": "RadishFew3972",
          "body": "I’ve put my hands in the toilet too to measure the vomit making sure it’s all there. Thrown up in the shower and sink. I actually clogged my boyfriend sink once but I was afraid the noise it would make in the toilet. I pull over on the side of the road to purge because I also binge while driving. Purged in buckets and or bags and behind bushes. Purged in countless public toilets and wonder if that’s how I got hepatitis A many years ago. And I’ve shat myself when I was abusing laxatives. I haven’t gotten to the point of eating food out of the trash but it’s so god damn expensive, I’m thinking I have to start.",
          "created_utc": 1710007372.0
        }
      ]
    },
    {
      "id": "ku6glf0",
      "author": "punk_chick_",
      "body": "i’ve done that too !",
      "created_utc": 1710046362.0,
      "score": 3,
      "context": [
        {
          "id": "ku3wnj3",
          "author": "invader_zimothy",
          "body": "I’d pick my roomate’s leftover uneaten meals/takeout out of the garbage and eat it 😰",
          "created_utc": 1710009971.0
        }
      ]
    },
    {
      "id": "ku6gatx",
      "author": "None",
      "body": "i've made it a habit to try and pee first if i have any urges, even if i don't actually end up purging. the potential sensory hell if i don't is Not worth it",
      "created_utc": 1710046211.0,
      "score": 6,
      "context": [
        {
          "id": "ku6cn1i",
          "author": "NonverbalSquirrel",
          "body": "Constantly urinating myself every single time I purge and I have to clean the piss off the bathroom floor along with the rest of the mess. Also, vomit chunks in my hair X_X",
          "created_utc": 1710044384.0
        }
      ]
    },
    {
      "id": "ku82lmj",
      "author": "PeachYogurtLover",
      "body": "Yeah throw up in hands also to don't make any noise",
      "created_utc": 1710081532.0,
      "score": 3,
      "context": [
        {
          "id": "ku697rq",
          "author": "rosecreamdream",
          "body": "Purging then pissing then shitting all in one toilet. the smell was horrendous. Purging constantly during a 10 hour flight isnt really gross but it definitely hurt my body. Purging in trash bags in my room and having it leak. Purging on the side of a road and walking home covered in vomit. Pulling noodles out of my throat also sucks. I also throw up in my hands and place it in the toilet cause I hate splash back.",
          "created_utc": 1710042734.0
        }
      ]
    },
    {
      "id": "kuaohyq",
      "author": "psychofeline72",
      "body": "Very ashamed to admit I stole money from the canteen cashbox while volunteering at a disabled people's daycare centre. I was deep in my bulimia/depression/OCD, and psych had arranged this volunteer role for me. At the time, I was on benefits (welfare) & had got into debt to fund my bingeing. I was desperate for money to buy more food all the time, and stole cash from various places, including from my parents. Utterly disgraceful behaviour, the pit of depravity, but I was in the grip of an addiction.",
      "created_utc": 1710115316.0,
      "score": 5,
      "context": [
        {
          "id": "ku5sogl",
          "author": "None",
          "body": "This is gross in a different way but I got into deep debt because I would get my binging food delivered. It was so stupid and irresponsible, it makes me feel ashamed.",
          "created_utc": 1710035373.0
        }
      ]
    },
    {
      "id": "kupcqym",
      "author": "ProofNewspaper2720",
      "body": "I took out a payday loan, stole food from roommates, shoplifter, you name it. Feel so terrible about it.",
      "created_utc": 1710350091.0,
      "score": 1,
      "context": [
        {
          "id": "ku5sogl",
          "author": "None",
          "body": "This is gross in a different way but I got into deep debt because I would get my binging food delivered. It was so stupid and irresponsible, it makes me feel ashamed.",
          "created_utc": 1710035373.0
        }
      ]
    },
    {
      "id": "ku6gde2",
      "author": "punk_chick_",
      "body": "i’ve also dropped an airpod in the toilet when purging",
      "created_utc": 1710046248.0,
      "score": 14,
      "context": [
        {
          "id": "ku6ga0o",
          "author": "punk_chick_",
          "body": "trying to avoid the b/p by restricting …. and then failing by scraping food off of the bottom of the dirty work dishes and eating it. unfortunately i have done this more than once",
          "created_utc": 1710046199.0
        }
      ]
    },
    {
      "id": "kubpzh0",
      "author": "braindamagecore",
      "body": "Going through this currently",
      "created_utc": 1710131505.0,
      "score": 1,
      "context": [
        {
          "id": "ku57045",
          "author": "beaudebonair",
          "body": "Regurgitating the alcohol I almost threw up.....my addiction too booze interfered with my bulimia, I swear at times it was a weird contrast back then. Kills people even faster, glad my life is spared.",
          "created_utc": 1710026341.0
        }
      ]
    },
    {
      "id": "lfi6nuk",
      "author": "kristioz",
      "body": "How did you get out of bulimia? Been struggling for 11 years now, really would like to make a change..",
      "created_utc": 1722268730.0,
      "score": 1,
      "context": [
        {
          "id": "ku8hg3c",
          "author": "ResolutionCareful255",
          "body": "This is so mf embarrassing because I haven’t confessed this before but I Threw up a ng tube and fitted it again by myself, only to throw it up 9 times that day before giving in, the tube touched the floor and other places as well, but I couldn’t let the staff even get a inclination that I was purging so I had no choice but to refit it even after it fell in a toilet. probably the most disgusting and desperate thing I’ve ever done, but happy to say I haven’t binged or purged in 1 year and I am recovered now (I think!) from both bulimia nervosa and Axn :) it does get better !",
          "created_utc": 1710087226.0
        }
      ]
    },
    {
      "id": "ku70o4s",
      "author": "elphieblue",
      "body": "omg one time I c/s’d so much my tongue got raw and it hurt to eat…..also doing it in front of my best friend. they were okay with it bc they wanted to eat with me and were happy I wasn’t purging omg bless their heart",
      "created_utc": 1710058624.0,
      "score": 8,
      "context": [
        {
          "id": "ku55lcz",
          "author": "None",
          "body": "Not technically bulimia but as a consequence of having it for over 10 years, the thing that's helped me recover is grosser than the bulimia ||(chewing and spitting food in zip bags)||",
          "created_utc": 1710025776.0
        }
      ]
    },
    {
      "id": "ku7hoz1",
      "author": "calfreak",
      "body": "Did that 🫣 took me so long to heal and I needed up getting a high fever so most likely bc of using said behaviour…",
      "created_utc": 1710070818.0,
      "score": 4,
      "context": [
        {
          "id": "ku65y5r",
          "author": "THESASAS",
          "body": "Continued to purge after I got all four wisdom teeth removed …",
          "created_utc": 1710041235.0
        }
      ]
    },
    {
      "id": "ku82vzy",
      "author": "withextracheesepls",
      "body": "did that! purged the day after i got them out. crazy to me that they didn’t get infected",
      "created_utc": 1710081653.0,
      "score": 5,
      "context": [
        {
          "id": "ku65y5r",
          "author": "THESASAS",
          "body": "Continued to purge after I got all four wisdom teeth removed …",
          "created_utc": 1710041235.0
        }
      ]
    },
    {
      "id": "kun0zxg",
      "author": "Fair-Combination-937",
      "body": "I did this too. Very lucky not to get dry socket or infection",
      "created_utc": 1710309329.0,
      "score": 1,
      "context": [
        {
          "id": "ku65y5r",
          "author": "THESASAS",
          "body": "Continued to purge after I got all four wisdom teeth removed …",
          "created_utc": 1710041235.0
        }
      ]
    },
    {
      "id": "ku56l9s",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1710026170.0,
      "score": 2,
      "context": [
        {
          "id": "ku4ipmz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710017460.0
        }
      ]
    },
    {
      "id": "ku56jy3",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1710026155.0,
      "score": 1,
      "context": [
        {
          "id": "ku4j3cr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710017589.0
        }
      ]
    },
    {
      "id": "ku56etx",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1710026097.0,
      "score": 0,
      "context": [
        {
          "id": "ku4uf9j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710021630.0
        }
      ]
    },
    {
      "id": "ku56bke",
      "author": "bulimia-ModTeam",
      "body": "Talking about bulimia in a more positive light, as if it’s good or useful - favourite ways to do it, favourite things to purge…. And so on.",
      "created_utc": 1710026061.0,
      "score": 1,
      "context": [
        {
          "id": "ku52pxq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710024684.0
        }
      ]
    },
    {
      "id": "ku3fagk",
      "author": "OkCommunication6119",
      "body": "😭🫣 I’m not sure if that’s the worst though. I’ve hauled tons of random/cheap pastries, pies, instant meals etc etc… But I’m very much vegan. This cr*p was not. The shame of eating that stuff feels pretty rancid too. UGH",
      "created_utc": 1710004200.0,
      "score": 20,
      "context": [
        {
          "id": "ku3eo2b",
          "author": "OkCommunication6119",
          "body": "Threw away food to avoid b/p later… But consumed said food straight out of the trash hours later. FML",
          "created_utc": 1710003985.0
        },
        {
          "id": "ku3esis",
          "author": "Flat_One_6622",
          "body": "omg i've done that too",
          "created_utc": 1710004027.0
        }
      ]
    },
    {
      "id": "ku4ubh1",
      "author": "Temporary-Wrap-6694",
      "body": "Yeah, it made me stop b/p for 2 months or so, because I was so scared of it happening again. Luckily, it didn't, even though I got back to b/p.",
      "created_utc": 1710021593.0,
      "score": 8,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        },
        {
          "id": "ku4pebv",
          "author": "unknown_caller01",
          "body": "oh my god the prolapse sounds so scary",
          "created_utc": 1710019810.0
        }
      ]
    },
    {
      "id": "ku73cbi",
      "author": "Temporary-Wrap-6694",
      "body": "How did you stop completely? I can't hold it for more than a week 😪",
      "created_utc": 1710060566.0,
      "score": 3,
      "context": [
        {
          "id": "ku3novl",
          "author": "Temporary-Wrap-6694",
          "body": "When I was living with roommates, I would throw up in a plastic bucket in my room and fill it up completely. I would then cover it with a towel and store it under my desk until late at night when everyone was asleep. Then I would sneak out of my room, with the towel covered bucket, empty it into the toilet, wipe the toilet and sneak to the shower to wash the bucket from the remaining bits of vomit.\nAlso, a couple of times I couldn't purge *at all* after a binge and I was severely constipated, but trying so hard to pass a bowel movement, that I had rectal prolapse and had to push my rectum back inside my body, with my fist. That's probably the most traumatizing experience I had in my life and I was so close to calling an ambulance.",
          "created_utc": 1710006983.0
        },
        {
          "id": "ku5wvu7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710037184.0
        }
      ]
    },
    {
      "id": "ku4m5y8",
      "author": "calhap8203",
      "body": "I once became face to face with a badger while purging in the woods at night. Where I live it’s a really rare thing to see a badger up close and I got to see one when I was covered in puke and had spaghetti up my nose at 11pm in the middle of nowhere lol",
      "created_utc": 1710018654.0,
      "score": 27,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        },
        {
          "id": "ku4cy15",
          "author": "toucansam0384",
          "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
          "created_utc": 1710015459.0
        }
      ]
    },
    {
      "id": "kuf1non",
      "author": "bulimia-ModTeam",
      "body": "Talking about bulimia in a more positive light, as if it’s good or useful - favourite ways to do it, favourite things to purge…. And so on.",
      "created_utc": 1710187993.0,
      "score": 1,
      "context": [
        {
          "id": "ku4brn4",
          "author": "toucansam0384",
          "body": "How about purging in a port a potty? Hovering above mounds of feces while puking your guts out. Wonderful.",
          "created_utc": 1710015055.0
        },
        {
          "id": "kuewevf",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710186267.0
        }
      ]
    },
    {
      "id": "ku9xbfk",
      "author": "madeleinetwocock",
      "body": "🫶🏻we lil nasties gotta stick together eh?\n\n(i say ‘lil nasties’ in the most endearing way humanly possible, just to clarify)",
      "created_utc": 1710105387.0,
      "score": 11,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        },
        {
          "id": "ku8068z",
          "author": "PeachYogurtLover",
          "body": "Oh yes, completely agree lol",
          "created_utc": 1710080506.0
        }
      ]
    },
    {
      "id": "kuewyr5",
      "author": "madeleinetwocock",
      "body": "it’s refreshing af. i always forget about this. \n\nsometimes i spend a *lot* of time on ed subs & stuff. and other times i just don’t (not because of any change in my condition, just random i guess). whenever i’ve been off ed threads for a while and i go back to it, i’m always like “i don’t know any of these folks but god golly do i ever love them like my own flesh and blood”",
      "created_utc": 1710186452.0,
      "score": 5,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        },
        {
          "id": "kuamihj",
          "author": "psychofeline72",
          "body": "I too am genuinely impressed at the honesty, wouldn't find it elsewhere.",
          "created_utc": 1710114525.0
        }
      ]
    },
    {
      "id": "kuev4zw",
      "author": "madeleinetwocock",
      "body": "no prob bob lol. i debated it or choosing another one but ultimately i went with this becos OP didn’t ask for gross, they asked for gross**est**, and that’s up in my top 5 for sure\n\nif my supreme nasty can make someone else feel less bad about their own nasty, i’d share everything i’ve ever done. no one should feel badly - and especially not guilty - about having acted in xyz manner becos of a mental illness taking over common sense/logic🫶🏻\n\n when ur an open book only in ed communities 🙈",
      "created_utc": 1710185845.0,
      "score": 2,
      "context": [
        {
          "id": "ku4xvnu",
          "author": "madeleinetwocock",
          "body": "sheesh guys you all just remind me why i genuinely fucking love this thread and this sub. like this is where the most *human* humans are on the internet. where else would i be able to mention the purging of scallop risotto in my shower and when a scallop came up whole i basically had a second serving because, well, scallops. like *anywhere* else i’d be virtually ripped to shreds for that one. but here? nah. we’re family. we can be gross and still be loved\n\nthanks for coming to my tedtalk",
          "created_utc": 1710022875.0
        },
        {
          "id": "kubeqqq",
          "author": "Apatchycat",
          "body": "this is wild lmao thanks for sharing",
          "created_utc": 1710126010.0
        }
      ]
    },
    {
      "id": "kuesvet",
      "author": "peanut-butter-blood",
      "body": "Specifically picking them out and rubbing between your fingers to see if it’s a solid item or just a streak of blood in the food. ☠️",
      "created_utc": 1710185096.0,
      "score": 2,
      "context": [
        {
          "id": "ku4aw2h",
          "author": "peanut-butter-blood",
          "body": "Fished through the vomit in the sink to make sure the red bits I was seeing were food and not blood.",
          "created_utc": 1710014760.0
        },
        {
          "id": "kubp676",
          "author": "braindamagecore",
          "body": "GOD I RELATE TO THIS SM",
          "created_utc": 1710131064.0
        }
      ]
    },
    {
      "id": "ku6v9nt",
      "author": "NonverbalSquirrel",
      "body": "I always use the bathroom before but for some reason I still end up urinating. I don’t understand :(",
      "created_utc": 1710054854.0,
      "score": 4,
      "context": [
        {
          "id": "ku6cn1i",
          "author": "NonverbalSquirrel",
          "body": "Constantly urinating myself every single time I purge and I have to clean the piss off the bathroom floor along with the rest of the mess. Also, vomit chunks in my hair X_X",
          "created_utc": 1710044384.0
        },
        {
          "id": "ku6gatx",
          "author": "None",
          "body": "i've made it a habit to try and pee first if i have any urges, even if i don't actually end up purging. the potential sensory hell if i don't is Not worth it",
          "created_utc": 1710046211.0
        }
      ]
    },
    {
      "id": "kuexrxg",
      "author": "beaudebonair",
      "body": "The best thing I can recommend is to tackle the alcohol first when you are ready, because in my experience the bulimia may resurface in recovery, I have seen it happen to others within inpatient rehab as well. Tackling both diseases/addictions at the same time is rough, like being in a fight against 2 people ya know lol it's tough I get it, but hang in there.\n\nFor myself, while I was in recovery for alcoholism, that gave me the time to focus on my bulimia, which I was of sound mind & sober finally to tackle my issues with the trauma I dealt with in previously in life with being overweight, body dysmorphia, & low self-esteem. I also was able to finally sort out what foods I am okay with eating, & which foods trigger me & to stay away from, & slowly feel better about the things I am okay with consuming if I feel it's gonna make me healthier, ya know helpful, not harmful.\n\nIt's hard I know but when you are ready, it does get better, absolutely, and spirituality helped me a lot as well. Best of luck to you in your journey, if you need to message anyone, feel free I'm here, hang in there.",
      "created_utc": 1710186715.0,
      "score": 1,
      "context": [
        {
          "id": "ku57045",
          "author": "beaudebonair",
          "body": "Regurgitating the alcohol I almost threw up.....my addiction too booze interfered with my bulimia, I swear at times it was a weird contrast back then. Kills people even faster, glad my life is spared.",
          "created_utc": 1710026341.0
        },
        {
          "id": "kubpzh0",
          "author": "braindamagecore",
          "body": "Going through this currently",
          "created_utc": 1710131505.0
        }
      ]
    },
    {
      "id": "ku8lcba",
      "author": "None",
      "body": "Damn those are good friends 😭 I only do it alone in my room because I'm so ashamed of it, my partner knows I do it and I'm sure she sees the zip bags in the trash but I basically kick her out of my room when she comes in unannounced while I'm doing it",
      "created_utc": 1710088619.0,
      "score": 3,
      "context": [
        {
          "id": "ku55lcz",
          "author": "None",
          "body": "Not technically bulimia but as a consequence of having it for over 10 years, the thing that's helped me recover is grosser than the bulimia ||(chewing and spitting food in zip bags)||",
          "created_utc": 1710025776.0
        },
        {
          "id": "ku70o4s",
          "author": "elphieblue",
          "body": "omg one time I c/s’d so much my tongue got raw and it hurt to eat…..also doing it in front of my best friend. they were okay with it bc they wanted to eat with me and were happy I wasn’t purging omg bless their heart",
          "created_utc": 1710058624.0
        }
      ]
    },
    {
      "id": "ku7j857",
      "author": "THESASAS",
      "body": "Yep it’s so scary, like I knew it was fucked when I was doing it but didn’t stop …",
      "created_utc": 1710071831.0,
      "score": 2,
      "context": [
        {
          "id": "ku65y5r",
          "author": "THESASAS",
          "body": "Continued to purge after I got all four wisdom teeth removed …",
          "created_utc": 1710041235.0
        },
        {
          "id": "ku7hoz1",
          "author": "calfreak",
          "body": "Did that 🫣 took me so long to heal and I needed up getting a high fever so most likely bc of using said behaviour…",
          "created_utc": 1710070818.0
        }
      ]
    },
    {
      "id": "kuc22vg",
      "author": "None",
      "body": "😭same I got my upper wisdom teeth taken out in January and only lasted a day before I was back to b/p-ing and I was so scared of dry socket I spent £50 on protein shakes and a protein shaker and was determined to recover and instantly gave up💀",
      "created_utc": 1710139158.0,
      "score": 1,
      "context": [
        {
          "id": "ku65y5r",
          "author": "THESASAS",
          "body": "Continued to purge after I got all four wisdom teeth removed …",
          "created_utc": 1710041235.0
        },
        {
          "id": "ku82vzy",
          "author": "withextracheesepls",
          "body": "did that! purged the day after i got them out. crazy to me that they didn’t get infected",
          "created_utc": 1710081653.0
        }
      ]
    },
    {
      "id": "ku4s1pk",
      "author": "toucansam0384",
      "body": "Holy shit! Those things are mean. Glad it didn't attack you.",
      "created_utc": 1710020770.0,
      "score": 10,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        },
        {
          "id": "ku4cy15",
          "author": "toucansam0384",
          "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
          "created_utc": 1710015459.0
        },
        {
          "id": "ku4m5y8",
          "author": "calhap8203",
          "body": "I once became face to face with a badger while purging in the woods at night. Where I live it’s a really rare thing to see a badger up close and I got to see one when I was covered in puke and had spaghetti up my nose at 11pm in the middle of nowhere lol",
          "created_utc": 1710018654.0
        }
      ]
    },
    {
      "id": "mjiwk20",
      "author": "Numerous_Bullfrog394",
      "body": "I think this is an original experience",
      "created_utc": 1742842404.0,
      "score": 2,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        },
        {
          "id": "ku4cy15",
          "author": "toucansam0384",
          "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
          "created_utc": 1710015459.0
        },
        {
          "id": "ku4m5y8",
          "author": "calhap8203",
          "body": "I once became face to face with a badger while purging in the woods at night. Where I live it’s a really rare thing to see a badger up close and I got to see one when I was covered in puke and had spaghetti up my nose at 11pm in the middle of nowhere lol",
          "created_utc": 1710018654.0
        }
      ]
    },
    {
      "id": "ku9jyn2",
      "author": "None",
      "body": "that's awful. i'm sorry </3",
      "created_utc": 1710100711.0,
      "score": 3,
      "context": [
        {
          "id": "ku6cn1i",
          "author": "NonverbalSquirrel",
          "body": "Constantly urinating myself every single time I purge and I have to clean the piss off the bathroom floor along with the rest of the mess. Also, vomit chunks in my hair X_X",
          "created_utc": 1710044384.0
        },
        {
          "id": "ku6gatx",
          "author": "None",
          "body": "i've made it a habit to try and pee first if i have any urges, even if i don't actually end up purging. the potential sensory hell if i don't is Not worth it",
          "created_utc": 1710046211.0
        },
        {
          "id": "ku6v9nt",
          "author": "NonverbalSquirrel",
          "body": "I always use the bathroom before but for some reason I still end up urinating. I don’t understand :(",
          "created_utc": 1710054854.0
        }
      ]
    },
    {
      "id": "ku73am1",
      "author": "calhap8203",
      "body": "I know! I was so lucky! It ran off after I started purging again but we were just staring at each other for a full minute or so, crazy experience",
      "created_utc": 1710060532.0,
      "score": 6,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        },
        {
          "id": "ku4cy15",
          "author": "toucansam0384",
          "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
          "created_utc": 1710015459.0
        },
        {
          "id": "ku4m5y8",
          "author": "calhap8203",
          "body": "I once became face to face with a badger while purging in the woods at night. Where I live it’s a really rare thing to see a badger up close and I got to see one when I was covered in puke and had spaghetti up my nose at 11pm in the middle of nowhere lol",
          "created_utc": 1710018654.0
        },
        {
          "id": "ku4s1pk",
          "author": "toucansam0384",
          "body": "Holy shit! Those things are mean. Glad it didn't attack you.",
          "created_utc": 1710020770.0
        }
      ]
    },
    {
      "id": "mjmmbxb",
      "author": "calhap8203",
      "body": "LOL unfortunately I have to agree",
      "created_utc": 1742895685.0,
      "score": 1,
      "context": [
        {
          "id": "ku467tv",
          "author": "Salt_Negotiation_334",
          "body": "Discovered that my roommate got home early before I was able to throw up. Her room was next to the bathroom. \n\nI biked out to the woods. Dug a hole in the ground with my bare hands. Stuffed the dirt covered hand in my mouth to purge. Covered the hole. Biked back. Washed my hands. Went to bed.",
          "created_utc": 1710013163.0
        },
        {
          "id": "ku4cy15",
          "author": "toucansam0384",
          "body": "I puke outside a lot. God I hate to admit this but we have a lot of animals around here so raccoons, dogs etc will eat it.",
          "created_utc": 1710015459.0
        },
        {
          "id": "ku4m5y8",
          "author": "calhap8203",
          "body": "I once became face to face with a badger while purging in the woods at night. Where I live it’s a really rare thing to see a badger up close and I got to see one when I was covered in puke and had spaghetti up my nose at 11pm in the middle of nowhere lol",
          "created_utc": 1710018654.0
        },
        {
          "id": "mjiwk20",
          "author": "Numerous_Bullfrog394",
          "body": "I think this is an original experience",
          "created_utc": 1742842404.0
        }
      ]
    }
  ]
}