{
  "id": "1benb92",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1710428674.0,
  "title": "Does anyone else feel like their ED has made them a bad person?",
  "selftext": "Today my friend was telling me about how she felt ugly because she'd gained a bit of weight. She's maybe 1-2 sizes bigger than I am currently. My first instant thought was \"yeah you really need to lose the weight. You are not pretty.\" I never said it aloud but the instant guilt stayed. So much so I had to excuse myself to the bathroom and cried a bit because how could I ever think such a thing? I love my best friend to bits and she's gorgeous, so I don't know why I thought it. It happens all the time - people walking down the street, people I'm talking to, friends, strangers - I instantly look at their stomach and thighs and judge how much weight they need to lose. \n\nI look at overweight people and feel like they're not putting in the effort to lose weight, and then cry because I know what a horrible thought it is and I don't know why I keep having it. I wish bulimia on no one and yet somehow get instinctively angry at overweight people - if I'm putting in \"effort\" why aren't they?\n\nI feel horrible. All the body positivity posts on the internet piss me off now because my first instinct is that anyone showing off their belly is disgusting - and then guilt hits me. I can't seem to get over what a horrible person I am now, judging everyone in my head. I have never acted on these thoughts or said them aloud, but I can't escape the feeling of what a bad person I am.\n\n I wonder if anyone else has experienced this? ",
  "url": "https://www.reddit.com/r/bulimia/comments/1benb92/does_anyone_else_feel_like_their_ed_has_made_them/",
  "score": 108,
  "num_comments": 38,
  "comments": [
    {
      "id": "kuugbf2",
      "author": "qnjoon",
      "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
      "created_utc": 1710429411.0,
      "score": 72,
      "context": []
    },
    {
      "id": "kuutbbq",
      "author": "ThestralBreeder",
      "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
      "created_utc": 1710433758.0,
      "score": 25,
      "context": []
    },
    {
      "id": "kuviury",
      "author": "memyselfandi10089",
      "body": "Yes but not in the same way you explained. I push people away. I have lost friends because of it because I don't want anyone to find out I have bullimia. I get in bad moods and become distant in situations with food and drinks and go quiet and it gives them the impression I don't wanna be there even tho I do I just sit there and panic because I've eaten too much and don't know the calories and want to get rid of it but I can't",
      "created_utc": 1710442103.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kuwr9eh",
      "author": "Unable_Quantity_8048",
      "body": "I can tell you this … never assume. I started my ED journey when I was 17. That was 1982.  I have had some form of anorexia/bulimia for 42 years. Well about 2 decades ago when Inhad my daughters my body decided it was tired of starving. Never been a hunger per se. drank water felt full threw it up. Had an extra spoonful of sweet potatoes threw it up. Something happened with my metabolism, my body was tired of starvation/dehydration/cortisol stress and holds on to every single calorie I ingest. A few years ago has to go in for endoscopy and colonoscopy and was told I was playing Russian roulette with my stomach and esophagus lining. Was told there was a very real chance of throwing up one to many times and my girls would find me dead over the toilet. Still do it when I’m stressed but now on a good day I ingest 600 calories. I am a size 18. Always told myself I would kill myself at this size. I’m sure people look at me and think I eat like a pig. Not a lot of people live after throwing up multiple times daily for 40+years. \n\nWhen I was a size two and saw someone in a club at a size 10 having a great time all I thought about was how wonderful it must be not to care. Not to have this horrible disease that grabs hold and never let’s go. How beautiful and liberated they must feel. In my dreams, because for me it was never about beauty or being skinny it was/is about abuse and needing something to control. If I put on weight I was mad that I lost control. After years I’ve realized I’ve never been in control of this. It’s always controlled me.",
      "created_utc": 1710457055.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kuutaup",
      "author": "NefariousnessDue590",
      "body": "So real for this. I catch myself guessing strangers and my close friends calorie intake, type of exercise/frequency and making horrible irrational character judgments. I hold myself on a pedestal for being thinner than people bigger than me and am filled with overwhelming hate for people smaller than me- assuming they just have better genetics or more discipline. I wish life wasn’t a brutal internal comparison war but these thoughts are helping me stay thin so i’m not even open to “rewiring” yet.",
      "created_utc": 1710433754.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kuxhzbn",
      "author": "snooginz",
      "body": "I completely relate. \n\nDuring the height of my ED, I joined the infamous \"fatpeoplehate\" subreddit to make comparisons and think \"yeah, I'm totally in control of my body unlike these people\". Oh how wrong I was. I was and still am a slave to my ED; I was not the one in control and I was basing mine and others' worth as people on how our bodies are shaped. I feel horrible about how I thought back then. \n\nI'm trying to reverse the damage and become a better person, here's hoping this new round of CBT works 🤞",
      "created_utc": 1710467235.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuy6csx",
      "author": "anotherplatypus",
      "body": "Nods it's very pronounced when your biology's chemistry can no longer balance itself (due to electrolytes, blood sugar, vitamin, and whatever other imbalances I haven't learned about but am sure exist....)\n\nBut regardless of gender, those physiological imbalances I mentioned don't exactly make anorexic people memorable for being sharp, enjoyable, energetic, day-long pleasant socialites...  \n\nEver see someone with low blood sugar get hangry?  That one's not as bad because you can instantly eat something to fix it...  The others are more complicated to helping the person keep up their attitude, energy level, and ability to handle stress like any other member of a normal group of happy friends hanging out.",
      "created_utc": 1710478220.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuutoxh",
      "author": "NonverbalSquirrel",
      "body": "I’m in the exact same position. The thing that sucks the most is I’ve regained the weight I lost (I have an average bmi now) and I know there are other disordered people who definitely look at me in public who think I need to lose a lot of weight and think my thighs look disgustingly huge.",
      "created_utc": 1710433883.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kuwob7o",
      "author": "Sea-Fix-3520",
      "body": "I have never been able to show off my belly, even if very thin, I never was in shape enough to wear a short cropped shirt.I always have been obsessed with my stomach,looking in the mirror, compulsively.I feel like I am a slob and messy,no self control or discipline or order.Again,the I can't stop eating or drinking or drugging.",
      "created_utc": 1710455976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuxesmb",
      "author": "oh_wow_its_an_alt",
      "body": "ED really messes up our way of thinking, I honestly compare it to addiction in how destructive and all-encompassing it truly is. \nI feel like a lot of the judgement and anger doesn't necessarily come from yourself, but from the ED and from the person (you) who it's hurting. For example; \nI'd for sure attribute the judgement of those you know and love to ED. It's clear that *you* don't really believe that, but ED *does*, and it will worm its way into that at every corner, it tries to make you think it's a fact rather than a intrusive thought. \nAnd when it comes to the judgement of those bigger than you, I'd say that's probably coming more from the person who's hurting-- why do *you* feel this pain, why don't *they*? You're working so hard, you're doing so much better than them, what is stopping *them*? This one I honestly still struggle with-- that anger is real, and it's justified, but *not at them*. That anger should be instead redirected, not at yourself or others, but to your disorder. Why do others get to be healthy? Why can't I be healthy? Don't I deserve better? And, you do. And this redirection has really helped me in recovery. You *do* deserve better, you *don't* deserve this awful invasive parasite. \nIn the end, ED is a game of will, and a test or strength. I truly liken it to addiction, it feels so good to restrict or purge, but it's so awful in actuality-- and recovery is a bumpy road lined with relapse, panic attacks, and pain, that all ultimately ends with a feeling of comfort, knowing your skin and your body are *yours*, not some invisible monster who hunts you. You will likely always struggle with these thoughts while in active ED, it's unfortunately the nature of the beast. But, you *know* they aren't true, and you *know* they are wrong, and that is so incredibly important and so good that you recognize. \nI know the struggle OP, I've had my own on and off for around half my life at this point, but I promise you, that same driving force that brings us to purge/restrict/etc, is the same force you can use to help yourself. It fucking sucks. Recovery is one of the hardest things I've ever gone through, and at times felt *worse* than my ED-- but the thing with recovery is that it doesn't go on forever. You don't have the nagging thought that \"oh god, what if someone finds out about my recovery?\", or \"oh no, that's a healthy amount of calories\", and you don't struggle everyday with the inital pain that recovery causes. It takes a long time, relapse in ED is so common, especially during recovery, so don't think too poorly of yourself if you can't now, or if you don't think you will be able to for a *while*. Everyone's journey is different, but with your awareness about what your disorder is doing, I hold good faith in my heart thay someday, your recovery will be long past, and you'll barely even remember these moments besides the passing shudder.",
      "created_utc": 1710465968.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuv1i1j",
      "author": "None",
      "body": "Absolutely",
      "created_utc": 1710436428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuv3bym",
      "author": "caracracra",
      "body": "Yes my first best friend gave me an ED and then my now best friend is showing symptoms",
      "created_utc": 1710437028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuw3xxr",
      "author": "Sea-Fix-3520",
      "body": "I am a bad person who can't stop going to sugar and gross,corn syrup 😃 that is in chocolate sauce,so much of my binging on the stuff in food ,the drug sugar corn syrup,high fructose corn syrup,and white flour.It also is cream cheese,cottage cheese 🧀 dairy and grains.But I don't know how to quit the bad foods that are addictive for me.I run to the past or something else that comforts me.I am tired of being fat.",
      "created_utc": 1710449028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuxebix",
      "author": "iannmicci",
      "body": "hell yeah, i had an external glow up but on the inside i’ve never been so miserable and disgusted with me for the terrible human being i became",
      "created_utc": 1710465780.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kz086z9",
      "author": "jade1766",
      "body": "Omg yes I thought it was just me",
      "created_utc": 1712795648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuw0mol",
      "author": "Affectionate-Fox5117",
      "body": "I honestly relate so much to this which is awful because as for me my sister is overweight she’s around like 200 pounds and she hardly goes to the gym even though she has a membership and she can drive and has her own car and is always sat down on her ass all day talking to her online bf that she barley meets like once every 3 months and that shit pisses me off because I was just like her then I finally realized wtf am I doing eating all this shit and not exercising so then I started going to the gym and working out not eating as much then slowly Ive obsessed over it and obsessed over it and I saw this clip in a movie and it was bulimia and I completely thought to try it and from there it stuck like glue and I never stopped and I dropped weight like crazy and my mom saw it as well and completely thought bulimia which at the moment I wasn’t even throwing up and when she said that I was like I should try it THATS HOW IT ALL STARTED BECAUSE SHE THIUGHT I WAS THROWING UP but I was just doing cardio like crazy and I was losing weight then she said that and I thought to try it and I was like let me do it and then it stuck and I never been able to stop I was able to stop for like 2 weeks but then I gained weight and I was like I do not want to be like my sister and be fat again and now I just keep doing it and I’m so tired then I see my sister and she’s just on her bed asking her bf To get her DoorDash and he does and he always compliments her and I’m just like what the fuck I do all this shit and she’s just getting compliments getting thrown at her and she’s so fucking fat and she disgusts me and whenever she’s lying down I see her double chin and she’s just AGH she gets me so mad because she’s so fucking fat and she doesn’t have a care in the world about what she eats and I do I throw up everyday and workout and she still is so fucking fat I’m embarrassed just to be next to her fat ass.",
      "created_utc": 1710447938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv0ut5q",
      "author": "snuffedog",
      "body": "yeah 100%. i lost my friends from it, i got my ed from a gr**mer, it made me push away so many people and even my closest family, i lie constantly about eating habits, i judge others, this disorder is so ugly and unfair",
      "created_utc": 1710525164.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuugjjd",
      "author": "qnjoon",
      "body": "Which is all to say- you're definitely not alone, but im optimistic that we can get through the grossness of the disorder",
      "created_utc": 1710429487.0,
      "score": 13,
      "context": [
        {
          "id": "kuugbf2",
          "author": "qnjoon",
          "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
          "created_utc": 1710429411.0
        }
      ]
    },
    {
      "id": "kuwra2i",
      "author": "Blacquebird",
      "body": "Came here to say just that! You are doing some really positive work! It's so hard to unlearn and re-pave your neural pathways, but you are using powerful reinforcements and I'm proud of you. \n\nIt's a good tool in your belt toward recovery because if you are someone who feels unworthy of the compassion you give to others, it can actually send you the permission to give yourself that gift; and genuinely accept it. \n\nYou are forced to realize: \n1. You are not your thoughts\n2. Those aren't even your thoughts in the first place\n3. You don't have to align your worth and feelings about yourself with the involuntary narrative in your head",
      "created_utc": 1710457062.0,
      "score": 6,
      "context": [
        {
          "id": "kuugbf2",
          "author": "qnjoon",
          "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
          "created_utc": 1710429411.0
        }
      ]
    },
    {
      "id": "kuxb0d0",
      "author": "oh_wow_its_an_alt",
      "body": "I was literally about to come into the comments to say this exact quote! I feel this is especially true for people with abuse trauma or predatory disorders like ED. Sometimes we internalize all of these incredibly harsh judgements about ourselves, and it eventually tries to leech its way into other parts. The fact OP immediately realized it was wrong and feels guilty really solidifys that they don't *actually* believe that at their core.",
      "created_utc": 1710464489.0,
      "score": 3,
      "context": [
        {
          "id": "kuugbf2",
          "author": "qnjoon",
          "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
          "created_utc": 1710429411.0
        }
      ]
    },
    {
      "id": "kv0z6dx",
      "author": "None",
      "body": "I've been loosely working on this too! It hasn't helped the guilt I feel though because it feels wrong to even be having such bitchy thoughts in the first place. I'm glad to hear I'm not alone though",
      "created_utc": 1710526634.0,
      "score": 2,
      "context": [
        {
          "id": "kuugbf2",
          "author": "qnjoon",
          "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
          "created_utc": 1710429411.0
        }
      ]
    },
    {
      "id": "kv0zm6u",
      "author": "None",
      "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
      "created_utc": 1710526781.0,
      "score": 2,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        }
      ]
    },
    {
      "id": "kv10mgi",
      "author": "None",
      "body": "My second thought is always \"how the hell would I know what that person is going through?\" And it's sort of the way I scold myself after I have a mean thought. I get what you mean about seeing bigger people and wondering how they manage to be so care free, I feel that too. Sometimes I look at people bigger than me wearing tight fitting clothing and feel extremely jealous that they're \"allowed\" to wear that and feel confident. I'm angry at how sexy they look even though they're bigger than me which is so irrational.\n\n I'm extremely sorry you went through what you did, and behalf of anyone who has/had an ED and felt the need to mentally judge you, I apologise. You don't deserve any judgement - you deserve to break free and feel sexy and confident no matter what <3",
      "created_utc": 1710527125.0,
      "score": 1,
      "context": [
        {
          "id": "kuwr9eh",
          "author": "Unable_Quantity_8048",
          "body": "I can tell you this … never assume. I started my ED journey when I was 17. That was 1982.  I have had some form of anorexia/bulimia for 42 years. Well about 2 decades ago when Inhad my daughters my body decided it was tired of starving. Never been a hunger per se. drank water felt full threw it up. Had an extra spoonful of sweet potatoes threw it up. Something happened with my metabolism, my body was tired of starvation/dehydration/cortisol stress and holds on to every single calorie I ingest. A few years ago has to go in for endoscopy and colonoscopy and was told I was playing Russian roulette with my stomach and esophagus lining. Was told there was a very real chance of throwing up one to many times and my girls would find me dead over the toilet. Still do it when I’m stressed but now on a good day I ingest 600 calories. I am a size 18. Always told myself I would kill myself at this size. I’m sure people look at me and think I eat like a pig. Not a lot of people live after throwing up multiple times daily for 40+years. \n\nWhen I was a size two and saw someone in a club at a size 10 having a great time all I thought about was how wonderful it must be not to care. Not to have this horrible disease that grabs hold and never let’s go. How beautiful and liberated they must feel. In my dreams, because for me it was never about beauty or being skinny it was/is about abuse and needing something to control. If I put on weight I was mad that I lost control. After years I’ve realized I’ve never been in control of this. It’s always controlled me.",
          "created_utc": 1710457055.0
        }
      ]
    },
    {
      "id": "kv11ekl",
      "author": "None",
      "body": "I do this too! There's a girl in my class who I'm not close with at all, but we're friendly enough to have a conversation. Since last year I've seen her lose weight - slowly but surely. She's definitely not as big as she was this time last year. I know because In every class I have a mental \"rank\" from fattest to thinnest (I know how terrible this is, I cry about it often) and she's no longer on the \"big side\". I obviously have not mentioned this to her at all and have not asked about her weight - how weird would that be!? \n\nI do however, keep staring at her in class. I can't stop wondering if she's working out, or eating different, or exercising..?? One day I was staring at her in class and thought to myself \"I really hope she has an ED too.\" Because my brain couldn't handle someone losing weight healthily and being happy while I'm here B/P four times a week and still gaining weight. I cried twice that day because I felt like it was such a horrible thought.",
      "created_utc": 1710527394.0,
      "score": 2,
      "context": [
        {
          "id": "kuutaup",
          "author": "NefariousnessDue590",
          "body": "So real for this. I catch myself guessing strangers and my close friends calorie intake, type of exercise/frequency and making horrible irrational character judgments. I hold myself on a pedestal for being thinner than people bigger than me and am filled with overwhelming hate for people smaller than me- assuming they just have better genetics or more discipline. I wish life wasn’t a brutal internal comparison war but these thoughts are helping me stay thin so i’m not even open to “rewiring” yet.",
          "created_utc": 1710433754.0
        }
      ]
    },
    {
      "id": "kv11kyt",
      "author": "None",
      "body": "I think that's why I hold myself to such a high standard. We assume people are watching us through ED eyes but they're not. I hope you manage to find some peace and happiness - you deserve it lovie!",
      "created_utc": 1710527455.0,
      "score": 2,
      "context": [
        {
          "id": "kuutoxh",
          "author": "NonverbalSquirrel",
          "body": "I’m in the exact same position. The thing that sucks the most is I’ve regained the weight I lost (I have an average bmi now) and I know there are other disordered people who definitely look at me in public who think I need to lose a lot of weight and think my thighs look disgustingly huge.",
          "created_utc": 1710433883.0
        }
      ]
    },
    {
      "id": "kv11ugv",
      "author": "None",
      "body": "I love this comment. You really pictured it perfectly. You think your ED has you in control and everyone is out of it - but really it's the other way around. I didn't realise how much of a slave I was to my ED until I tried to quit for a week and simply couldn't. Thank you for this comment, it really really helped",
      "created_utc": 1710527545.0,
      "score": 2,
      "context": [
        {
          "id": "kuxesmb",
          "author": "oh_wow_its_an_alt",
          "body": "ED really messes up our way of thinking, I honestly compare it to addiction in how destructive and all-encompassing it truly is. \nI feel like a lot of the judgement and anger doesn't necessarily come from yourself, but from the ED and from the person (you) who it's hurting. For example; \nI'd for sure attribute the judgement of those you know and love to ED. It's clear that *you* don't really believe that, but ED *does*, and it will worm its way into that at every corner, it tries to make you think it's a fact rather than a intrusive thought. \nAnd when it comes to the judgement of those bigger than you, I'd say that's probably coming more from the person who's hurting-- why do *you* feel this pain, why don't *they*? You're working so hard, you're doing so much better than them, what is stopping *them*? This one I honestly still struggle with-- that anger is real, and it's justified, but *not at them*. That anger should be instead redirected, not at yourself or others, but to your disorder. Why do others get to be healthy? Why can't I be healthy? Don't I deserve better? And, you do. And this redirection has really helped me in recovery. You *do* deserve better, you *don't* deserve this awful invasive parasite. \nIn the end, ED is a game of will, and a test or strength. I truly liken it to addiction, it feels so good to restrict or purge, but it's so awful in actuality-- and recovery is a bumpy road lined with relapse, panic attacks, and pain, that all ultimately ends with a feeling of comfort, knowing your skin and your body are *yours*, not some invisible monster who hunts you. You will likely always struggle with these thoughts while in active ED, it's unfortunately the nature of the beast. But, you *know* they aren't true, and you *know* they are wrong, and that is so incredibly important and so good that you recognize. \nI know the struggle OP, I've had my own on and off for around half my life at this point, but I promise you, that same driving force that brings us to purge/restrict/etc, is the same force you can use to help yourself. It fucking sucks. Recovery is one of the hardest things I've ever gone through, and at times felt *worse* than my ED-- but the thing with recovery is that it doesn't go on forever. You don't have the nagging thought that \"oh god, what if someone finds out about my recovery?\", or \"oh no, that's a healthy amount of calories\", and you don't struggle everyday with the inital pain that recovery causes. It takes a long time, relapse in ED is so common, especially during recovery, so don't think too poorly of yourself if you can't now, or if you don't think you will be able to for a *while*. Everyone's journey is different, but with your awareness about what your disorder is doing, I hold good faith in my heart thay someday, your recovery will be long past, and you'll barely even remember these moments besides the passing shudder.",
          "created_utc": 1710465968.0
        }
      ]
    },
    {
      "id": "kuw1s0e",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710448316.0,
      "score": 0,
      "context": [
        {
          "id": "kuw0mol",
          "author": "Affectionate-Fox5117",
          "body": "I honestly relate so much to this which is awful because as for me my sister is overweight she’s around like 200 pounds and she hardly goes to the gym even though she has a membership and she can drive and has her own car and is always sat down on her ass all day talking to her online bf that she barley meets like once every 3 months and that shit pisses me off because I was just like her then I finally realized wtf am I doing eating all this shit and not exercising so then I started going to the gym and working out not eating as much then slowly Ive obsessed over it and obsessed over it and I saw this clip in a movie and it was bulimia and I completely thought to try it and from there it stuck like glue and I never stopped and I dropped weight like crazy and my mom saw it as well and completely thought bulimia which at the moment I wasn’t even throwing up and when she said that I was like I should try it THATS HOW IT ALL STARTED BECAUSE SHE THIUGHT I WAS THROWING UP but I was just doing cardio like crazy and I was losing weight then she said that and I thought to try it and I was like let me do it and then it stuck and I never been able to stop I was able to stop for like 2 weeks but then I gained weight and I was like I do not want to be like my sister and be fat again and now I just keep doing it and I’m so tired then I see my sister and she’s just on her bed asking her bf To get her DoorDash and he does and he always compliments her and I’m just like what the fuck I do all this shit and she’s just getting compliments getting thrown at her and she’s so fucking fat and she disgusts me and whenever she’s lying down I see her double chin and she’s just AGH she gets me so mad because she’s so fucking fat and she doesn’t have a care in the world about what she eats and I do I throw up everyday and workout and she still is so fucking fat I’m embarrassed just to be next to her fat ass.",
          "created_utc": 1710447938.0
        }
      ]
    },
    {
      "id": "kv124un",
      "author": "None",
      "body": "This is horrible I'm so sorry you're going through this, genuinely. I have also upset friends with my comments on multiple occasions and have snapped a few times. Just know that when you're ready to get better, and make things right, a true friend will understand and support you. You deserve a friend who will do that. Thank you for sharing!",
      "created_utc": 1710527645.0,
      "score": 1,
      "context": [
        {
          "id": "kv0ut5q",
          "author": "snuffedog",
          "body": "yeah 100%. i lost my friends from it, i got my ed from a gr**mer, it made me push away so many people and even my closest family, i lie constantly about eating habits, i judge others, this disorder is so ugly and unfair",
          "created_utc": 1710525164.0
        }
      ]
    },
    {
      "id": "kv12v3m",
      "author": "None",
      "body": "I'm not really proud of myself at the moment. I think I'm unworthy of any sort of compassion and that's stuck. I'm so unhealthily obsessed with everyone's body that I lie awake for hours thinking about it. I think my thoughts can sometimes become consuming to the point of tears - it happens a lot after I feel I've been particularly judgmental. The other week one of my friends made a comment on a stranger's body as we were walking by. Something like \"wow she's big, why is she eating such a massive bag of crisps?\" I screamed at her. Seriously. I must've been on the verge of tears and people around me were looking a little - somehow It felt horrible hearing someone say exactly what I had been thinking at that moment out loud. This total stranger was worthy of compassion and my defense, but I'm not..?",
      "created_utc": 1710527894.0,
      "score": 1,
      "context": [
        {
          "id": "kuugbf2",
          "author": "qnjoon",
          "body": "Yes, yes, 100%.\n\nThe one thing I cling to is that one quote from somewhere that says \"your first thought is what you've been taught, your second is who you are\". I try really hard to placate guilt I feel about my immediate judgements with immediate corrections. Like- \"oh, she's too fat? Nope, I don't care about her body. Also, cute shoes.\" It's taking time, but I'm really working on rewiring my brain to sub out that harsh judgement for something more neutral/positive.",
          "created_utc": 1710429411.0
        },
        {
          "id": "kuwra2i",
          "author": "Blacquebird",
          "body": "Came here to say just that! You are doing some really positive work! It's so hard to unlearn and re-pave your neural pathways, but you are using powerful reinforcements and I'm proud of you. \n\nIt's a good tool in your belt toward recovery because if you are someone who feels unworthy of the compassion you give to others, it can actually send you the permission to give yourself that gift; and genuinely accept it. \n\nYou are forced to realize: \n1. You are not your thoughts\n2. Those aren't even your thoughts in the first place\n3. You don't have to align your worth and feelings about yourself with the involuntary narrative in your head",
          "created_utc": 1710457062.0
        }
      ]
    },
    {
      "id": "kv12dsk",
      "author": "ThestralBreeder",
      "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
      "created_utc": 1710527730.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        }
      ]
    },
    {
      "id": "kv1uo4e",
      "author": "NonverbalSquirrel",
      "body": "Thank you so much dear. I wish you the absolute best and hope you can fully recover from this life taking disorder. Much love 💕🩷",
      "created_utc": 1710537565.0,
      "score": 1,
      "context": [
        {
          "id": "kuutoxh",
          "author": "NonverbalSquirrel",
          "body": "I’m in the exact same position. The thing that sucks the most is I’ve regained the weight I lost (I have an average bmi now) and I know there are other disordered people who definitely look at me in public who think I need to lose a lot of weight and think my thighs look disgustingly huge.",
          "created_utc": 1710433883.0
        },
        {
          "id": "kv11kyt",
          "author": "None",
          "body": "I think that's why I hold myself to such a high standard. We assume people are watching us through ED eyes but they're not. I hope you manage to find some peace and happiness - you deserve it lovie!",
          "created_utc": 1710527455.0
        }
      ]
    },
    {
      "id": "kv01ozv",
      "author": "bulimia-ModTeam",
      "body": "This can be:\n\n- telling someone not to gain weight \n- telling someone not to go for recovery \n- giving bad advice \n- discussing weight // lowest/highest…\n- discussing calories (how high // how low…)",
      "created_utc": 1710515338.0,
      "score": 1,
      "context": [
        {
          "id": "kuw0mol",
          "author": "Affectionate-Fox5117",
          "body": "I honestly relate so much to this which is awful because as for me my sister is overweight she’s around like 200 pounds and she hardly goes to the gym even though she has a membership and she can drive and has her own car and is always sat down on her ass all day talking to her online bf that she barley meets like once every 3 months and that shit pisses me off because I was just like her then I finally realized wtf am I doing eating all this shit and not exercising so then I started going to the gym and working out not eating as much then slowly Ive obsessed over it and obsessed over it and I saw this clip in a movie and it was bulimia and I completely thought to try it and from there it stuck like glue and I never stopped and I dropped weight like crazy and my mom saw it as well and completely thought bulimia which at the moment I wasn’t even throwing up and when she said that I was like I should try it THATS HOW IT ALL STARTED BECAUSE SHE THIUGHT I WAS THROWING UP but I was just doing cardio like crazy and I was losing weight then she said that and I thought to try it and I was like let me do it and then it stuck and I never been able to stop I was able to stop for like 2 weeks but then I gained weight and I was like I do not want to be like my sister and be fat again and now I just keep doing it and I’m so tired then I see my sister and she’s just on her bed asking her bf To get her DoorDash and he does and he always compliments her and I’m just like what the fuck I do all this shit and she’s just getting compliments getting thrown at her and she’s so fucking fat and she disgusts me and whenever she’s lying down I see her double chin and she’s just AGH she gets me so mad because she’s so fucking fat and she doesn’t have a care in the world about what she eats and I do I throw up everyday and workout and she still is so fucking fat I’m embarrassed just to be next to her fat ass.",
          "created_utc": 1710447938.0
        },
        {
          "id": "kuw1s0e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710448316.0
        }
      ]
    },
    {
      "id": "kv18h96",
      "author": "None",
      "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
      "created_utc": 1710529820.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        }
      ]
    },
    {
      "id": "kv19wq5",
      "author": "ThestralBreeder",
      "body": "I’m sorry your mother has that take. Having an ADHD is a protected medical diagnosis and therefore nobody outside of you and your doctor would necessarily have to be aware of it. Adhd treatment can absolutely improve grades! Saying you’re not “disruptive” is outmoded. You more likely have adhd with an inattentive subtype! \n\nYou should definitely push your mom to help you get a diagnosis - perhaps a privately funded doctor might have availability?\n\nI also do highly highly recommend cognitive behavioral therapy - it helps with adhd and anxiety and parsing through your emotions and feelings of disorganization, forgetfulness etc. The best treatment for adhd is, unfortunately, medication + behavioral therapy. But if you’re not able to get meds or be assessed by a psychiatrist, meeting with a therapist generally might be your best bet. Is your mom aware of your ED?",
      "created_utc": 1710530310.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        },
        {
          "id": "kv18h96",
          "author": "None",
          "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
          "created_utc": 1710529820.0
        }
      ]
    },
    {
      "id": "kv1fsz4",
      "author": "None",
      "body": "She knows here and there that I struggle but it has not made her kinder with food so she has no idea just how bad it has gotten. I think broaching the subject will make it worse at this point unfortunately. Many arguments have broken out over getting a diagnosis and I've officially decided that it isn't worth my parents knowing about. I had a therapist for a few sessions but my mum told me the therapist  dropped me because my issues weren't bad enough and she was too busy (not sure if this is true but I have always had trouble expressing just how bad I'm struggling so possibly). I want medication but am extremely worried it will make me gain weight because my goal is too lose weight (healthier than I'm attempting right now ofc). My main worry with going on the waiting list is that it'll take years just for a doctor to tell me I'm just \"anxious\" or that it's hormones because it's often missed in girls I've been told. I'll feel like utter shit if that's the case unfortunately. I wonder how easy it was for you to get diagnosed?",
      "created_utc": 1710532339.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        },
        {
          "id": "kv18h96",
          "author": "None",
          "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
          "created_utc": 1710529820.0
        },
        {
          "id": "kv19wq5",
          "author": "ThestralBreeder",
          "body": "I’m sorry your mother has that take. Having an ADHD is a protected medical diagnosis and therefore nobody outside of you and your doctor would necessarily have to be aware of it. Adhd treatment can absolutely improve grades! Saying you’re not “disruptive” is outmoded. You more likely have adhd with an inattentive subtype! \n\nYou should definitely push your mom to help you get a diagnosis - perhaps a privately funded doctor might have availability?\n\nI also do highly highly recommend cognitive behavioral therapy - it helps with adhd and anxiety and parsing through your emotions and feelings of disorganization, forgetfulness etc. The best treatment for adhd is, unfortunately, medication + behavioral therapy. But if you’re not able to get meds or be assessed by a psychiatrist, meeting with a therapist generally might be your best bet. Is your mom aware of your ED?",
          "created_utc": 1710530310.0
        }
      ]
    },
    {
      "id": "kv1luib",
      "author": "ThestralBreeder",
      "body": "I was diagnosed in childhood in the US where it’s easier to get a diagnosis generally speaking. A lot of people have this worry that they aren’t sick or disordered or impacted “enough” - but clearly it is impacting you. I would absolutely get on the NHS waiting list! That way at least it’s ticking down the list in the background while you try and figure out other solutions.\n\nMost weight gain from SSRI’s is somewhat negligible. Are you talking about adhd meds specifically or anti depressants? Adhd meds are primarily in the dexmethylphenidate family in the US, also known as stimulants. These do not cause weight gain!",
      "created_utc": 1710534446.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        },
        {
          "id": "kv18h96",
          "author": "None",
          "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
          "created_utc": 1710529820.0
        },
        {
          "id": "kv19wq5",
          "author": "ThestralBreeder",
          "body": "I’m sorry your mother has that take. Having an ADHD is a protected medical diagnosis and therefore nobody outside of you and your doctor would necessarily have to be aware of it. Adhd treatment can absolutely improve grades! Saying you’re not “disruptive” is outmoded. You more likely have adhd with an inattentive subtype! \n\nYou should definitely push your mom to help you get a diagnosis - perhaps a privately funded doctor might have availability?\n\nI also do highly highly recommend cognitive behavioral therapy - it helps with adhd and anxiety and parsing through your emotions and feelings of disorganization, forgetfulness etc. The best treatment for adhd is, unfortunately, medication + behavioral therapy. But if you’re not able to get meds or be assessed by a psychiatrist, meeting with a therapist generally might be your best bet. Is your mom aware of your ED?",
          "created_utc": 1710530310.0
        },
        {
          "id": "kv1fsz4",
          "author": "None",
          "body": "She knows here and there that I struggle but it has not made her kinder with food so she has no idea just how bad it has gotten. I think broaching the subject will make it worse at this point unfortunately. Many arguments have broken out over getting a diagnosis and I've officially decided that it isn't worth my parents knowing about. I had a therapist for a few sessions but my mum told me the therapist  dropped me because my issues weren't bad enough and she was too busy (not sure if this is true but I have always had trouble expressing just how bad I'm struggling so possibly). I want medication but am extremely worried it will make me gain weight because my goal is too lose weight (healthier than I'm attempting right now ofc). My main worry with going on the waiting list is that it'll take years just for a doctor to tell me I'm just \"anxious\" or that it's hormones because it's often missed in girls I've been told. I'll feel like utter shit if that's the case unfortunately. I wonder how easy it was for you to get diagnosed?",
          "created_utc": 1710532339.0
        }
      ]
    },
    {
      "id": "kv767m2",
      "author": "None",
      "body": "Well I was mainly talking about ADHD because I really feel like everything else is a symptom of my root problem which is this unfocused haze constantly at the back of my mind. I really appreciate all the info you've given me, I think I will call the GP tomorrow. I was wondering if it would still be okay to DM you sometime with a few questions about getting a diagnosis and your experience?",
      "created_utc": 1710627130.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        },
        {
          "id": "kv18h96",
          "author": "None",
          "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
          "created_utc": 1710529820.0
        },
        {
          "id": "kv19wq5",
          "author": "ThestralBreeder",
          "body": "I’m sorry your mother has that take. Having an ADHD is a protected medical diagnosis and therefore nobody outside of you and your doctor would necessarily have to be aware of it. Adhd treatment can absolutely improve grades! Saying you’re not “disruptive” is outmoded. You more likely have adhd with an inattentive subtype! \n\nYou should definitely push your mom to help you get a diagnosis - perhaps a privately funded doctor might have availability?\n\nI also do highly highly recommend cognitive behavioral therapy - it helps with adhd and anxiety and parsing through your emotions and feelings of disorganization, forgetfulness etc. The best treatment for adhd is, unfortunately, medication + behavioral therapy. But if you’re not able to get meds or be assessed by a psychiatrist, meeting with a therapist generally might be your best bet. Is your mom aware of your ED?",
          "created_utc": 1710530310.0
        },
        {
          "id": "kv1fsz4",
          "author": "None",
          "body": "She knows here and there that I struggle but it has not made her kinder with food so she has no idea just how bad it has gotten. I think broaching the subject will make it worse at this point unfortunately. Many arguments have broken out over getting a diagnosis and I've officially decided that it isn't worth my parents knowing about. I had a therapist for a few sessions but my mum told me the therapist  dropped me because my issues weren't bad enough and she was too busy (not sure if this is true but I have always had trouble expressing just how bad I'm struggling so possibly). I want medication but am extremely worried it will make me gain weight because my goal is too lose weight (healthier than I'm attempting right now ofc). My main worry with going on the waiting list is that it'll take years just for a doctor to tell me I'm just \"anxious\" or that it's hormones because it's often missed in girls I've been told. I'll feel like utter shit if that's the case unfortunately. I wonder how easy it was for you to get diagnosed?",
          "created_utc": 1710532339.0
        },
        {
          "id": "kv1luib",
          "author": "ThestralBreeder",
          "body": "I was diagnosed in childhood in the US where it’s easier to get a diagnosis generally speaking. A lot of people have this worry that they aren’t sick or disordered or impacted “enough” - but clearly it is impacting you. I would absolutely get on the NHS waiting list! That way at least it’s ticking down the list in the background while you try and figure out other solutions.\n\nMost weight gain from SSRI’s is somewhat negligible. Are you talking about adhd meds specifically or anti depressants? Adhd meds are primarily in the dexmethylphenidate family in the US, also known as stimulants. These do not cause weight gain!",
          "created_utc": 1710534446.0
        }
      ]
    },
    {
      "id": "kv76cjm",
      "author": "ThestralBreeder",
      "body": "Yes absolutely - feel free to DM! I was diagnosed with adhd in childhood, sorry I didn’t make that clear! Xx",
      "created_utc": 1710627185.0,
      "score": 1,
      "context": [
        {
          "id": "kuutbbq",
          "author": "ThestralBreeder",
          "body": "I think this is a common thought in the ED world because so so much of the disorder revolves around “self control” and “discipline” and “consequences” for not fallowing whatever fucked up belief system we have created for ourselves. \n\nI definitely felt this way for most of my ED, but I eventually was just so so tired. So tired of feeling mean, to myself and to others. I’ve been in recovery for four years, and I still sometimes get a twinge - but usually more-so in extreme cases.",
          "created_utc": 1710433758.0
        },
        {
          "id": "kv0zm6u",
          "author": "None",
          "body": "I'm so happy to hear you're in recovery. I think my ED stems from a lack of discipline which sounds fucked up I know. I feel so disorganised in every single other area of my life, I feel like I use this to \"take back\" some things. It's like I'm purging my stress with the food..?",
          "created_utc": 1710526781.0
        },
        {
          "id": "kv12dsk",
          "author": "ThestralBreeder",
          "body": "I totally hear you and validate your struggle. Bulimia and disordered eating in general is like trying to fight in a lions den. You are not alone. Have you been assessed for ADHD/done cognitive behavioral therapy before? \n\nI have adhd/audhd, anxiety and depression, so all of those mix together into this horrible soup of negative self-talk and general sadness. I also don’t think the general state of the world, and how so many things feel out of our control, helps at all. My DM’s are always open. 💗",
          "created_utc": 1710527730.0
        },
        {
          "id": "kv18h96",
          "author": "None",
          "body": "A lot of people have mentioned to me that I have ADHD traits. My mother agrees that I have it - but thinks a professional diagnosis is \"weak\" and will make me \"undesirable\". I tried going through the school but they told me my grades weren't suffering enough. I'm on Bs - Cs and I tried explaining that I'm not where I should be because mentally I have all the potential for As and A* but because I'm not disruptive in class and my grades aren't **that bad they said they couldn't justify an in school diagnosis. I'm now looking into getting it done through the NHS but the waitlist is a few years and I'm scared they'll tell me I'm making it up. \n\nI feel like I never explain how much I'm struggling properly and make it seem less than it is by accident (I don't know why?). I somehow turn \"can't even remember to brush her teeth twice a day and is bulimic because she can't control anything ranging from sleep to eating habits.\" To \"um I don't concentrate very well\" so not sure how to handle this anymore but it's just getting worse.",
          "created_utc": 1710529820.0
        },
        {
          "id": "kv19wq5",
          "author": "ThestralBreeder",
          "body": "I’m sorry your mother has that take. Having an ADHD is a protected medical diagnosis and therefore nobody outside of you and your doctor would necessarily have to be aware of it. Adhd treatment can absolutely improve grades! Saying you’re not “disruptive” is outmoded. You more likely have adhd with an inattentive subtype! \n\nYou should definitely push your mom to help you get a diagnosis - perhaps a privately funded doctor might have availability?\n\nI also do highly highly recommend cognitive behavioral therapy - it helps with adhd and anxiety and parsing through your emotions and feelings of disorganization, forgetfulness etc. The best treatment for adhd is, unfortunately, medication + behavioral therapy. But if you’re not able to get meds or be assessed by a psychiatrist, meeting with a therapist generally might be your best bet. Is your mom aware of your ED?",
          "created_utc": 1710530310.0
        },
        {
          "id": "kv1fsz4",
          "author": "None",
          "body": "She knows here and there that I struggle but it has not made her kinder with food so she has no idea just how bad it has gotten. I think broaching the subject will make it worse at this point unfortunately. Many arguments have broken out over getting a diagnosis and I've officially decided that it isn't worth my parents knowing about. I had a therapist for a few sessions but my mum told me the therapist  dropped me because my issues weren't bad enough and she was too busy (not sure if this is true but I have always had trouble expressing just how bad I'm struggling so possibly). I want medication but am extremely worried it will make me gain weight because my goal is too lose weight (healthier than I'm attempting right now ofc). My main worry with going on the waiting list is that it'll take years just for a doctor to tell me I'm just \"anxious\" or that it's hormones because it's often missed in girls I've been told. I'll feel like utter shit if that's the case unfortunately. I wonder how easy it was for you to get diagnosed?",
          "created_utc": 1710532339.0
        },
        {
          "id": "kv1luib",
          "author": "ThestralBreeder",
          "body": "I was diagnosed in childhood in the US where it’s easier to get a diagnosis generally speaking. A lot of people have this worry that they aren’t sick or disordered or impacted “enough” - but clearly it is impacting you. I would absolutely get on the NHS waiting list! That way at least it’s ticking down the list in the background while you try and figure out other solutions.\n\nMost weight gain from SSRI’s is somewhat negligible. Are you talking about adhd meds specifically or anti depressants? Adhd meds are primarily in the dexmethylphenidate family in the US, also known as stimulants. These do not cause weight gain!",
          "created_utc": 1710534446.0
        },
        {
          "id": "kv767m2",
          "author": "None",
          "body": "Well I was mainly talking about ADHD because I really feel like everything else is a symptom of my root problem which is this unfocused haze constantly at the back of my mind. I really appreciate all the info you've given me, I think I will call the GP tomorrow. I was wondering if it would still be okay to DM you sometime with a few questions about getting a diagnosis and your experience?",
          "created_utc": 1710627130.0
        }
      ]
    }
  ]
}