{
  "id": "1bfmbok",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1710531125.0,
  "title": "Things I've done with my ED that have made me feel disgusting",
  "selftext": "Title. I feel like my Bulimia has made me do some incredibly stupid irrational things but here are a few I'm struggling with that I am extremely embarrassed of. I decided to post this because I'm hoping that someone can relate so I don't feel like a complete idiot.\nHere goes: \n\n- ate from the actual bins at my work regularly before I took them out. \n\n- Stolen a lot of food from work. \n\n- snapped at a girl in my class who tried to talk to me. I just said something aggressive like \"piss off!\" For no other reason than I've noticed she's been losing weight and that makes me angry. \n\n- I have also obsessively been staring at her body to a point where I'm excited to see her in class - I am a straight woman. I just want so badly to know how she lost the weight, but of course I'll never ask her. I have also secretly hoped she has an ED because somehow it's so hard to fathom someone losing weight healthily while I am this miserable. I cry from guilt often about this. \n\n- stolen other people's lunches at school (I feel incredibly guilty about this one) \n\n- hidden food/plates under my bed to the point it starts rotting. \n\n- the sound of chewing makes me extremely angry to the point of tears. Even when they're not being that loud - if they're eating and I'm not I feel like I can hear it. \n\n- I always make eating a competition. I hate finishing my food first so I purposefully eat slower and take smaller bites. I'm worried I'll hear people chewing if I finish too quickly or that I'll be jealous of their food (what does this even mean!?) \n\n- When someone is eating and I'm not, I feel sad. Even when I'm not even hungry and they are. \n\n- every time I have the urge to binge and don't - I feel like I'm owed a B/P session later on. This is even if I replace the binge with a healthy meal with great macros. \n\n- Constantly on dating apps. No intention of actually going on a date - but I crave validation so badly. \n\n- Purged. Eaten. Purged again. \n\n- Stolen money from my parents so I can buy binge food. \n\nThis is all I can think of as I'm writing. I'm very scared to post this because I'm honestly so embarrassed but I need to get it off my chest somehow. I don't want anyone to think that I don't feel guilty for every single one of these, because I do. I know how morally wrong it is and I wish I could take it back/stop. \n\nHere's to hoping someone can read this today and feel not so alone by something bad their ED has made them do.",
  "url": "https://www.reddit.com/r/bulimia/comments/1bfmbok/things_ive_done_with_my_ed_that_have_made_me_feel/",
  "score": 113,
  "num_comments": 29,
  "comments": [
    {
      "id": "kv1h6cf",
      "author": "Safetychick92",
      "body": "I understand and you’re not alone. I have done many things I am not proud of. I’ll share a few:\n- drank water from a public toilet when I couldn’t purge cause it was too dry \n\n- purged in bags and kept them in my closet till garbage day\n\n- stayed home from important events to b/p\n\n- ate from the garbage\n\n- spent $$$ on food to just b/p over paying my bills \n\n- left work to b/p\n\nSo you’re not alone. This disease makes you do horrible things that you normally wouldn’t do. I hope you can find recovery and happiness within yourself 💛",
      "created_utc": 1710532812.0,
      "score": 70,
      "context": []
    },
    {
      "id": "kv2461w",
      "author": "spiralsandswings",
      "body": "I've stolen food from friends and housemates to b/p on. Puked into bags, buckets, containers to flush down the toilet at a later time. Skipped out on uni and work to b/p. Purged when out on dates and other events like birthdays, funerals, a wedding too. Almost reate vomit to throw up again but managed to resist that. Eaten undercooked food, rotten food, wasted soooo much money, gotten irrationally angry when someone asked if they could have one of my biscuits during a semi-public binge and, when I was with my ex who was aware of my ED, I screamed and broke down when he stood in front of the bathroom door to stop me from purging. So ashamed of it all plus more",
      "created_utc": 1710541057.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kv2vgrf",
      "author": "you_enjoy_my_yoga",
      "body": "Someone baking something for me out of love and then purging it. “Oh I made you your favorite” and I have to accept it with pain in my soul knowing how they’d feel if they knew what I was going to do with it",
      "created_utc": 1710551795.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kv2a2k6",
      "author": "kathruins",
      "body": "when I lived with my parents, the toilet got to the point it couldn't handle my purges. I'd fill an entire bathroom trashcan and hide it in the shower to either  slowly flush over the course of a day or throw it out in the tall grass. I'm pretty sure our bi-monthly house cleaner saw it a couple times. \n\nat one point I was giving myself vitamin shots and developed a pilonidal cyst. doctors wouldn't help so it busted on its own. most painful thing ever. I didn't know the shots were causing it so it kept happening until I had a fairly intensive surgery. so many people saw my asshole that year. my doctor was super hot and I went to elementary school with my nurse. oh and the wound wouldn't close so I had a gaping wound above my asshole for 4 months. \n\nI once flooded the only toilet at a buffet. I made a swift exit and never went back. \n\nI've purged into a cup while driving, not caring that others could see me. \n\nany purge in a public restroom was humiliating.",
      "created_utc": 1710543310.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kv1we3y",
      "author": "Forward_Peanut1019",
      "body": "I feel you so much. I did many of these things. I once stole someones cake from work fridge cuz i knew they went home and forgot to take it and ran to the bathroom to eat it i was chugging myself with it like an animal eating it with bare hands I was covered in chocolate and then i felt so guilty and I still am till this day",
      "created_utc": 1710538180.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kv25efw",
      "author": "None",
      "body": "ive done many of these things 🫂 also recently realized there was mold growing under the rim of my toilet bowl bc i forgot to clean it after purging like 3 weeks ago, that was not fun to clean lol",
      "created_utc": 1710541520.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kv2gpb9",
      "author": "Interesting_Goose_45",
      "body": "I have done every single one of these things😕 you’re not alone❤️‍🩹",
      "created_utc": 1710545890.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kv2gc0g",
      "author": "rulerofeverything180",
      "body": "Been there done that ❤️‍🩹",
      "created_utc": 1710545746.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kv37cyb",
      "author": "Un-Happy_Lil-Lady_94",
      "body": "Eaten from the food bin\nTakes multiple laxatives before work\nPurges at work (many times a night) \nPurged in a public toilet while my family has waited for me\nTaken laxatives and has shit myself while people have slept\nChewed and spit food \n\nGod so many it's kind of refreshing.... to know I'm not alone 🥺",
      "created_utc": 1710556921.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kv6ejr3",
      "author": "glass_doII",
      "body": "i stole laxatives from my grandma, i’ve puked in water bottles and kept them in my room, puked in bags, stolen food from peoples bags, eaten parts of my puke only to throw it up again \nwe all have bad stories, you’re not alone",
      "created_utc": 1710616449.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kv6oi38",
      "author": "hhhhhhfrick",
      "body": "I'll never forget eating toast at 2 am with a shitload of butter and jam while my stepsister was trying to talk me down but I couldn't stop and I was just crying and eating while she kept fucking talking...",
      "created_utc": 1710620243.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kv70zpq",
      "author": "mirror2986",
      "body": "Purged into containers and hid them under my bed until people were asleep. I had to leave my dog outside my room, crying because he’d try to get to the containers. Now he’s gone it breaks my heart that I chose being deceptive than cuddling him at night. \nHad dinner made or bought for me by friends parents and purged straight away in their house. \nI hate this one because I know it would make me spiral if someone did this to me - I’ve added extra oil or butter or sauces to other peoples meals when preparing after I had plated mine. I felt that if I had to eat they’d have to consume more calories.\nIf I was full enough sometimes I could bring the food up without my fingers or any effort. I’d do it in front of people so they’d think I was ill, then I’d be able to go to the bathroom and purge fully. Them not knowing it was self induced.",
      "created_utc": 1710625079.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kv1ibw8",
      "author": "OnceUponA-Nevertime",
      "body": "Pretty much have done all of these things. \n\nDefinitely was that roommate stealing food.  I'd try to make it not obvious but how can it not be obvious when it is always happening? I wasn't an asshole - I had a problem.",
      "created_utc": 1710533215.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kv7ksce",
      "author": "Electronic-Race-2687",
      "body": "I'm with you. I've had my septum/lip ring balls fall into the toilet mid purge and of course I reached in to grab them. I've pulled food out of the trash too, like from fast food my fiancé ordered and i swore up and down i didnt want any, cue me eating fries out of the trash 30 hours after they tossed it (chipotle chips are a big one for me, they throw away half-full bags and i cant help it idk). they've unknowingly bought me binge food before. ive also eaten on my bathroom floor (like on plates but when things inevitably fall off my plate onto the floor i still eat it). used spoiled milk for cereal and eaten 2 week old donuts. \n\nreading the rest of this thread has honestly made me feel so much less alone. it feels gross and isolating, its embarrassing to even admit to my counselor. but hey... here's to better days ahead OP ♥️",
      "created_utc": 1710633045.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kv1yyzk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710539114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kv7mdn5",
      "author": "None",
      "body": "I can relate to most of these things ❤️",
      "created_utc": 1710633698.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kv7su8e",
      "author": "snuffedog",
      "body": "you aren’t alone, i can’t count how many times i’ve clogged mine, public and others toilets or showers (sadly), i’ve eaten rotted food, chewed, spit, and then ate again, had vomit on my face and clothes after purging at school, keep vomit bags in my drawers until i’m alone, and steal food. eating disorders are vile",
      "created_utc": 1710636330.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvcscx9",
      "author": "sharpteethangel",
      "body": "done pretty much all of these plus the forbidden eating mostly intact purged food directly from the toilet to purge it again (did it once drunk and now it’s an urge every time it is objectively disgusting)\n\nyou’re not alone we’ve got an illness and it’s not pretty :,) hope you’re doing okay today <3",
      "created_utc": 1710718722.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvmif4c",
      "author": "Fair-Combination-937",
      "body": "I feel for everyone here. This is a vile disease. I have stolen food, ate out of the trash, taken myself out to dinner at a buffet just for the purpose of throwing up, shit on the floor while purging, and binged and purged during irreplaceable memories and events that I will never live again. It sucks so bad. Much love to all of you honestly... Hope it gets better",
      "created_utc": 1710877121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kv2lqsn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710547888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv4tw3d",
      "author": "phdacula",
      "body": "can i ask why didn’t you drink the tap water? i hope it doesn’t sound offensive or anything, i’m just generally curious. and also very sorry that you had to do that",
      "created_utc": 1710594431.0,
      "score": 4,
      "context": [
        {
          "id": "kv1h6cf",
          "author": "Safetychick92",
          "body": "I understand and you’re not alone. I have done many things I am not proud of. I’ll share a few:\n- drank water from a public toilet when I couldn’t purge cause it was too dry \n\n- purged in bags and kept them in my closet till garbage day\n\n- stayed home from important events to b/p\n\n- ate from the garbage\n\n- spent $$$ on food to just b/p over paying my bills \n\n- left work to b/p\n\nSo you’re not alone. This disease makes you do horrible things that you normally wouldn’t do. I hope you can find recovery and happiness within yourself 💛",
          "created_utc": 1710532812.0
        }
      ]
    },
    {
      "id": "kv75n43",
      "author": "None",
      "body": "Thank you for sharing. Honestly it's so amazing to see other people responding and letting me know I'm really not alone. I hope you found peace",
      "created_utc": 1710626901.0,
      "score": 1,
      "context": [
        {
          "id": "kv1h6cf",
          "author": "Safetychick92",
          "body": "I understand and you’re not alone. I have done many things I am not proud of. I’ll share a few:\n- drank water from a public toilet when I couldn’t purge cause it was too dry \n\n- purged in bags and kept them in my closet till garbage day\n\n- stayed home from important events to b/p\n\n- ate from the garbage\n\n- spent $$$ on food to just b/p over paying my bills \n\n- left work to b/p\n\nSo you’re not alone. This disease makes you do horrible things that you normally wouldn’t do. I hope you can find recovery and happiness within yourself 💛",
          "created_utc": 1710532812.0
        }
      ]
    },
    {
      "id": "kv75axy",
      "author": "None",
      "body": "Feel that way every time my mum cooks. I feel so bad purging it. I feel even worse when I purge with money I have STOLEN.",
      "created_utc": 1710626767.0,
      "score": 6,
      "context": [
        {
          "id": "kv2vgrf",
          "author": "you_enjoy_my_yoga",
          "body": "Someone baking something for me out of love and then purging it. “Oh I made you your favorite” and I have to accept it with pain in my soul knowing how they’d feel if they knew what I was going to do with it",
          "created_utc": 1710551795.0
        }
      ]
    },
    {
      "id": "kv59toc",
      "author": "PeachYogurtLover",
      "body": "Omg this is so true, sad but true 😭",
      "created_utc": 1710601254.0,
      "score": 2,
      "context": [
        {
          "id": "kv2vgrf",
          "author": "you_enjoy_my_yoga",
          "body": "Someone baking something for me out of love and then purging it. “Oh I made you your favorite” and I have to accept it with pain in my soul knowing how they’d feel if they knew what I was going to do with it",
          "created_utc": 1710551795.0
        }
      ]
    },
    {
      "id": "kv75g7h",
      "author": "None",
      "body": "I did that with an entire salmon at work. Just stuffed it straight into my mouth in the bathroom. I've eaten in the bathroom many times - and felt absolutely disgusting after it.",
      "created_utc": 1710626824.0,
      "score": 3,
      "context": [
        {
          "id": "kv1we3y",
          "author": "Forward_Peanut1019",
          "body": "I feel you so much. I did many of these things. I once stole someones cake from work fridge cuz i knew they went home and forgot to take it and ran to the bathroom to eat it i was chugging myself with it like an animal eating it with bare hands I was covered in chocolate and then i felt so guilty and I still am till this day",
          "created_utc": 1710538180.0
        }
      ]
    },
    {
      "id": "kv752q0",
      "author": "None",
      "body": "I'm so glad you found this post. I think it's so easy to feel so disgusted with ourselves sometimes because of what we've done with our ED - but you can always come back here to remind yourself that you are not alone :) my DM's are always open",
      "created_utc": 1710626676.0,
      "score": 3,
      "context": [
        {
          "id": "kv37cyb",
          "author": "Un-Happy_Lil-Lady_94",
          "body": "Eaten from the food bin\nTakes multiple laxatives before work\nPurges at work (many times a night) \nPurged in a public toilet while my family has waited for me\nTaken laxatives and has shit myself while people have slept\nChewed and spit food \n\nGod so many it's kind of refreshing.... to know I'm not alone 🥺",
          "created_utc": 1710556921.0
        }
      ]
    },
    {
      "id": "kv74qb4",
      "author": "None",
      "body": "Did the same thing with a plate of pasta. My mother looked purely disgusted with me and I had eaten to the point of nearly vomiting right then and there on the table",
      "created_utc": 1710626539.0,
      "score": 3,
      "context": [
        {
          "id": "kv6oi38",
          "author": "hhhhhhfrick",
          "body": "I'll never forget eating toast at 2 am with a shitload of butter and jam while my stepsister was trying to talk me down but I couldn't stop and I was just crying and eating while she kept fucking talking...",
          "created_utc": 1710620243.0
        }
      ]
    },
    {
      "id": "kv74iim",
      "author": "None",
      "body": "This one is so relatable. My dog died a month ago ago. He had just turned one and he was hit by a car. I had made a pact to stay clean for him a week prior. Now all I can think of is that he died as a baby and only knew me purge free for a week. When I purged, he'd sit by the toilet for me trying to see what was going on and if he could help - now he's gone and I'm back to B/P. Sometimes when we were home alone, I'd hear him whine and cry for me to come back as I shut the door and binged in another room. You're not alone <3",
      "created_utc": 1710626453.0,
      "score": 2,
      "context": [
        {
          "id": "kv70zpq",
          "author": "mirror2986",
          "body": "Purged into containers and hid them under my bed until people were asleep. I had to leave my dog outside my room, crying because he’d try to get to the containers. Now he’s gone it breaks my heart that I chose being deceptive than cuddling him at night. \nHad dinner made or bought for me by friends parents and purged straight away in their house. \nI hate this one because I know it would make me spiral if someone did this to me - I’ve added extra oil or butter or sauces to other peoples meals when preparing after I had plated mine. I felt that if I had to eat they’d have to consume more calories.\nIf I was full enough sometimes I could bring the food up without my fingers or any effort. I’d do it in front of people so they’d think I was ill, then I’d be able to go to the bathroom and purge fully. Them not knowing it was self induced.",
          "created_utc": 1710625079.0
        }
      ]
    },
    {
      "id": "kv74uul",
      "author": "None",
      "body": "I think it's always bothered me - but it's so much worse now. I feel like I can always hear people chewing even if they're nowhere near me. Even if I can't just see them eat through a restaurant window or something",
      "created_utc": 1710626589.0,
      "score": 2,
      "context": [
        {
          "id": "kv1yyzk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710539114.0
        }
      ]
    },
    {
      "id": "kva419j",
      "author": "bulimia-ModTeam",
      "body": "Sharing ‘tips and tricks’ on how to do behaviors.",
      "created_utc": 1710684008.0,
      "score": 1,
      "context": [
        {
          "id": "kv2lqsn",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710547888.0
        }
      ]
    },
    {
      "id": "kv84m4b",
      "author": "panda3100",
      "body": "my guess is because they didnt wanna be seen drinking water from the sink",
      "created_utc": 1710641316.0,
      "score": 2,
      "context": [
        {
          "id": "kv1h6cf",
          "author": "Safetychick92",
          "body": "I understand and you’re not alone. I have done many things I am not proud of. I’ll share a few:\n- drank water from a public toilet when I couldn’t purge cause it was too dry \n\n- purged in bags and kept them in my closet till garbage day\n\n- stayed home from important events to b/p\n\n- ate from the garbage\n\n- spent $$$ on food to just b/p over paying my bills \n\n- left work to b/p\n\nSo you’re not alone. This disease makes you do horrible things that you normally wouldn’t do. I hope you can find recovery and happiness within yourself 💛",
          "created_utc": 1710532812.0
        },
        {
          "id": "kv4tw3d",
          "author": "phdacula",
          "body": "can i ask why didn’t you drink the tap water? i hope it doesn’t sound offensive or anything, i’m just generally curious. and also very sorry that you had to do that",
          "created_utc": 1710594431.0
        }
      ]
    }
  ]
}