{
  "id": "1bizj78",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1710892647.0,
  "title": "i’ve ruined my life",
  "selftext": "this year has been the worst for me, morally. i’ve taken so much money from people… like thousands. i’ve been blocked by 2 people because of it. yes, i know i’m a terrible, terrible person. i’ve stolen, lied, and done illegal things in order to get money so i could binge and purge. i need to be put down like a rabid dog. i keep hurting everyone around me and i can’t take it anymore. there’s no point in treatment.. i’ve done countless inpatient, day treatment, and outpatient programs. i’m unfixable. i’m only 23 and i can’t see a life outside of deception and malice. i’m so tired of being who i am",
  "url": "https://www.reddit.com/r/bulimia/comments/1bizj78/ive_ruined_my_life/",
  "score": 73,
  "num_comments": 25,
  "comments": [
    {
      "id": "kvo979g",
      "author": "unremarkable_sapien",
      "body": "All I can say is me too. I’ve shoplifted thousands of dollars worth of food, stolen from my parents, lied to everyone in my life. I’ve tried every form of treatment possible. I still find ways to b/p when I’m inpatient. I’ve stolen food from treatment centre kitchens, staff and other patients. And as terrible as I feel about it, I keep doing it.\n\nIt’s not you, it’s the illness. And the fact that so many of us go to these lengths to aquire b/p food shows that it’s just part of the diagnosis. You are not a horrible person, you just have a horrible disorder that is ruining your life. You deserve treatment, we all do.",
      "created_utc": 1710899583.0,
      "score": 43,
      "context": []
    },
    {
      "id": "kvo9i8b",
      "author": "None",
      "body": "I’ve been there. Honestly from my experience recovering from bulimia is harder than opiate addiction (I’ve done both medically). \n\nI did horrific illegal shit. I sold my body. I sold parts of my soul that I can’t get back. \n\nBut I’m on the other side of it somehow and working on a clean, sober life (except for weed) and there is light at the end of the tunnel, no matter how dark. \nI go to a lot of therapy and addictions support groups which I quickly realized helped more for my ED than any of the years of inpatient and specialized treatment I’d ever received. \nSame area of the brain. \n\nI’m so sorry you are in the dark right now. If you ever need an ear that’s been there too, please DM.",
      "created_utc": 1710899706.0,
      "score": 27,
      "context": []
    },
    {
      "id": "kvohps3",
      "author": "sleepyetc",
      "body": "I’m really sorry and empathize with you. I’m 20 but already depleted my savings, ran up credit card debt, stole my brother’s gift money, lied to my parents for money just to keep buying b/p hoards. There are 4 grocery stores im scared to enter now bc I stole so much food. Bulimia takes u to such extremes that u don’t recognize yourself. It’s an evil disease but you are NOT an evil person. \n\nNot to give unsolicited advice but please keep trying with treatment. I gave it one last try and I’m now 4 months without b/p. I believe in you and I’m sorry",
      "created_utc": 1710903068.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kvoo3w1",
      "author": "None",
      "body": "You are not alone. I was caught shoplifting from Whole Foods (to be fair I was just taking what I wanted not trying to hide it for some reason? Like I felt invisible??) and bc I took like $1k worth of stuff they called the police and I was arrested and had to walk out of the store in handcuffs. It was like 9pm so I couldn’t see a judge that night so I spent the night in jail.\nI was so embarrassed I lied when the other women asked me what I did and said prostitution. I wish I was kidding.\nI had my period and the toilet was basically open and you had to ask a guard for tp every time. And obvs I didn’t have a pad or anything bc I couldn’t have anything w me.\n\nGuys, I spent the night in jail in nyc. Did it stop me? For a minute.\nI stopped shoplifting for the most part except little things. Now I just have thousands and thousands and thousands of dollars in credit card debt.\n\nLast week was bad for me, but bad now is 3x in a week not every night. And I can go months without purging. \n\nI do think recovery is possible!! I do think we can get to the other side!!\n\nAnd you are SO young!!! Right now your brain is hardcore LYING to you!!! It’s glitching like crazy and that voice telling you there’s no hope and it’s always going to be like this is fkng lying to you!!\n\nI got really sick once and cried to the dr saying I knew I’d done it to myself, and I wanted so badly to change.\n\nI’m not religious at all so apologize if I get this wrong/ but she told me that Jesus washed Mary’s feet and she was instantly changed or something like that?\nAnd for some reason that stuck with me, that you can like wake up in the morning and change?? I seriously know nothing about new testament so sorry if I fcked that up!!\n\nI know you feel like you’ve tried everything, but I promise at 23 you have not!!!",
      "created_utc": 1710905952.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kvoo8ma",
      "author": "None",
      "body": "BULIMIA IS NOT A CHARACTER FLAW!!! It’s a disease!!",
      "created_utc": 1710906015.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kvpf09l",
      "author": "Goodbyekyle_",
      "body": "YOU CAN DO THIS!! i promise. i am currently going thru the roughest time of my life as i try to get clean from b/p, cocaine, and alcohol. i’m ferociously addicted to all of them. i am 23 too. also in debt. we are in this together. you know you have a problem, and that’s where this starts. i’m proud of you",
      "created_utc": 1710923875.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvpts5m",
      "author": "RainbowTowers9",
      "body": "You aren’t alone. I’ve had a criminal record for shoplifting due to Bulimia. My mum has bailed me out so many times with money and I don’t think the guilt for that will ever cease. I feel absolutely awful for putting her through it too. \nI will say though that I have had a lot of success at radically reducing the binging and purging, and completely stoping the chewing and spitting after I asked to try the medication, Bupropion. It works on Dopamine and as food is an addiction, we’re constantly battling to top up our dopamine. It’s helped so much to finally have a clear headspace to focus on what’s behind this horrific illness.",
      "created_utc": 1710933976.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvq0vpv",
      "author": "None",
      "body": "these comments are helping me so much… i appreciate all of you 🤍 it’s relieving to know i’m not alone in this sense",
      "created_utc": 1710937577.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvq82wm",
      "author": "Informal-Ad-7356",
      "body": "I hear you, and you are in great pain now.  But you are deep into your addiction.   YOU, as a person, are NOT your addiction.   That being said, no one is going to save you either.  Outside providers (therapists,  dieticians,  etc) are only just tools to help you recover.   You have to want Recovery MORE that wanting what the ED behaviors are giving you.  All of it... whether it's your body shape, clothing sizes, sense of pride or \"specialness\"...whatever your addiction is giving you.\n\nYou have to get so sick of it you would rather surrender to Recovery,  accept what those changes will do to you physically and mentally/emotionally.  Then at that point you fight like hell.  It's not easy or quick; there's no magic pill.  You have to choose the food, eat the food,  sit in the uncomfortable,  digest the food.  Deal with what that feels like physically and mentally.    You may start out screaming and sweating.  Addictions don't want to let go.   But your slow and steady repeat WILL start to pay off.  You will see the eating and digesting as the normal things until you no longer see the ED behaviors as even being an option. \n\nYou will gain weight.  You will be changing your clothing sizes, and getting rid of ANY clothes that only fit your body with a ED behavior.    You will ditch the scale.   There's nothing but cruel judgment there.  Not needed in Recovery or at all in fact!!\n\nGet ready to fight.  Freedom isn't Free.  But only YOU can do it.  Only you can be the one to choose correct behaviors over ED ones.\n\nI recovered after 35 years into a menopausal body.   The ED addiction WILL take over your life if you let it. It's time to think about if you want to fight now or later, dealing with older skin that doesn't react like you want it to, or other physical problems,  just because you are simply older.   \n\nThe body always wins in the end.  It's called aging and death.   Don't spend your life in misery. You don't need to be, or conform, or prove yourself to anyone.   Diversity includes all body shapes too!!  Go fight for your freedom.",
      "created_utc": 1710940688.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvuoesy",
      "author": "Sweaterweatherwaste",
      "body": "Thank you for sharing this, I sometimes feel alone in just how bad my bulimia can get, even here, but this post, and these comments, make it less so. There must be a tiny shred of hope in you, even if most of the time you convince yourself it's not real, or its delusional (I'm the same) - or else you wouldn't be here. That hope is not delusional, it's not ridiculous, a life better than this is still possible for you, it's possible for all of us, even if we can't always see it... I'm also stuck right now, but holding on to that shred of hope, and I pray you hold on, too. You are not a monster, you are not an animal, you are not evil or greedy or morrally irredeemable - you are a human who is very ill, with something there isn't enough research and understanding about. I'm tired too, but there has to be hope. There has to be.",
      "created_utc": 1711000815.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvxevbw",
      "author": "FancyLikeNancy",
      "body": "I am Next to you if you wanna talk to someone ❤️",
      "created_utc": 1711046351.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvnw8iv",
      "author": "Longjumping_Laugh337",
      "body": "I’m so sorry love. This illness brings out the worst in us. It’s not your fault xx",
      "created_utc": 1710894569.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kvnzxl5",
      "author": "Sea-Fix-3520",
      "body": "After I got sober from alcohol, I started smoking 🚬 and got hooked on cigarettes and I was trying to stop eating sugar and flour, but I was hungry and broke,and we just moved, to a cheaper apartment with my roommate,and I couldn't afford to eat , but I went to AA, and OA meetings,and came home (before cell phones) and ate  my roommate's peanut butter,and ice cream 🍨.Then I fell asleep on top of the bed ,and dropped a cigarette on the bedspread and the bed caught fire, and the firemen came, and I was so embarrassed, and full of guilt and shame, and I ran out the door and never came back.And it went on and on.But the bulimia stopped.",
      "created_utc": 1710895970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvr12nw",
      "author": "auar5682",
      "body": "I’m so sorry you’re in pain. You’re not alone.",
      "created_utc": 1710950869.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvsezmf",
      "author": "ArgentumMorte",
      "body": "I hear you, i had a juvenile criminal record for shoplifting in my country and am now an escort to afford my addiction at 22. The things i do for food😔",
      "created_utc": 1710967223.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvoyjuw",
      "author": "None",
      "body": "Same :/ I’m in an inpatient temporarily bc of my housing situation but I still just b/p 2-3 times a day and hospital used to be my safe space to get away from all that but they either don’t care when I tell them or they just don’t notice and I’m just worried if I do ever go to an ed inpatient I’ll still find a way since I’m very resistant to losing my autonomy and since eds are a form of control I feel like I’ll never want to “lose my control” even though I know treatment is necessary ;;",
      "created_utc": 1710911697.0,
      "score": 8,
      "context": [
        {
          "id": "kvo979g",
          "author": "unremarkable_sapien",
          "body": "All I can say is me too. I’ve shoplifted thousands of dollars worth of food, stolen from my parents, lied to everyone in my life. I’ve tried every form of treatment possible. I still find ways to b/p when I’m inpatient. I’ve stolen food from treatment centre kitchens, staff and other patients. And as terrible as I feel about it, I keep doing it.\n\nIt’s not you, it’s the illness. And the fact that so many of us go to these lengths to aquire b/p food shows that it’s just part of the diagnosis. You are not a horrible person, you just have a horrible disorder that is ruining your life. You deserve treatment, we all do.",
          "created_utc": 1710899583.0
        }
      ]
    },
    {
      "id": "kvoohu0",
      "author": "None",
      "body": "Thank you for posting this! I always feel like I identify w drug addiction bc of this but then I feel stupid for comparing it. \nBut I believe you that this is harder to kick than opiates bc food is not something we can quit! We’re in constant battle",
      "created_utc": 1710906141.0,
      "score": 8,
      "context": [
        {
          "id": "kvo9i8b",
          "author": "None",
          "body": "I’ve been there. Honestly from my experience recovering from bulimia is harder than opiate addiction (I’ve done both medically). \n\nI did horrific illegal shit. I sold my body. I sold parts of my soul that I can’t get back. \n\nBut I’m on the other side of it somehow and working on a clean, sober life (except for weed) and there is light at the end of the tunnel, no matter how dark. \nI go to a lot of therapy and addictions support groups which I quickly realized helped more for my ED than any of the years of inpatient and specialized treatment I’d ever received. \nSame area of the brain. \n\nI’m so sorry you are in the dark right now. If you ever need an ear that’s been there too, please DM.",
          "created_utc": 1710899706.0
        }
      ]
    },
    {
      "id": "kvp89hu",
      "author": "vinaa27",
      "body": "What kind of treatment finally worked for you? I’m in the same spot as OP and I need to get this disease out of my life.",
      "created_utc": 1710918559.0,
      "score": 3,
      "context": [
        {
          "id": "kvohps3",
          "author": "sleepyetc",
          "body": "I’m really sorry and empathize with you. I’m 20 but already depleted my savings, ran up credit card debt, stole my brother’s gift money, lied to my parents for money just to keep buying b/p hoards. There are 4 grocery stores im scared to enter now bc I stole so much food. Bulimia takes u to such extremes that u don’t recognize yourself. It’s an evil disease but you are NOT an evil person. \n\nNot to give unsolicited advice but please keep trying with treatment. I gave it one last try and I’m now 4 months without b/p. I believe in you and I’m sorry",
          "created_utc": 1710903068.0
        }
      ]
    },
    {
      "id": "kvp6e0l",
      "author": "Sea-Fix-3520",
      "body": "I do feel like it's a character flaw,and you can't bring it up at all in an AA meeting,or an older white man will say something like\" no one died from drinking too much orange 🍊 juice!!!\", this happened to me last time I went to a small AA meeting at B.U.,a small daytime meeting with 4 men and 1 or 2 women. The outrage if I say that I am also taking responsibility for my eating disorder because to be in denial is a character defect and I am powerless over drugs,like sugar, alcohol,and pills, relationships that are codependent where I take care of a nother person instead of me.",
      "created_utc": 1710917147.0,
      "score": 4,
      "context": [
        {
          "id": "kvoo8ma",
          "author": "None",
          "body": "BULIMIA IS NOT A CHARACTER FLAW!!! It’s a disease!!",
          "created_utc": 1710906015.0
        }
      ]
    },
    {
      "id": "kvpf4pj",
      "author": "Goodbyekyle_",
      "body": "and i will say, i think bulimia might be the toughest out of all of these to recover from",
      "created_utc": 1710923977.0,
      "score": 5,
      "context": [
        {
          "id": "kvpf09l",
          "author": "Goodbyekyle_",
          "body": "YOU CAN DO THIS!! i promise. i am currently going thru the roughest time of my life as i try to get clean from b/p, cocaine, and alcohol. i’m ferociously addicted to all of them. i am 23 too. also in debt. we are in this together. you know you have a problem, and that’s where this starts. i’m proud of you",
          "created_utc": 1710923875.0
        }
      ]
    },
    {
      "id": "kvqgy27",
      "author": "psychofeline72",
      "body": "You really aren't.",
      "created_utc": 1710944051.0,
      "score": 2,
      "context": [
        {
          "id": "kvq0vpv",
          "author": "None",
          "body": "these comments are helping me so much… i appreciate all of you 🤍 it’s relieving to know i’m not alone in this sense",
          "created_utc": 1710937577.0
        }
      ]
    },
    {
      "id": "mk53cnn",
      "author": "Subject-Pension-3027",
      "body": "How did you win? It’s so hard to come by someone who has recovered after decades of living in their disease",
      "created_utc": 1743141031.0,
      "score": 1,
      "context": [
        {
          "id": "kvq82wm",
          "author": "Informal-Ad-7356",
          "body": "I hear you, and you are in great pain now.  But you are deep into your addiction.   YOU, as a person, are NOT your addiction.   That being said, no one is going to save you either.  Outside providers (therapists,  dieticians,  etc) are only just tools to help you recover.   You have to want Recovery MORE that wanting what the ED behaviors are giving you.  All of it... whether it's your body shape, clothing sizes, sense of pride or \"specialness\"...whatever your addiction is giving you.\n\nYou have to get so sick of it you would rather surrender to Recovery,  accept what those changes will do to you physically and mentally/emotionally.  Then at that point you fight like hell.  It's not easy or quick; there's no magic pill.  You have to choose the food, eat the food,  sit in the uncomfortable,  digest the food.  Deal with what that feels like physically and mentally.    You may start out screaming and sweating.  Addictions don't want to let go.   But your slow and steady repeat WILL start to pay off.  You will see the eating and digesting as the normal things until you no longer see the ED behaviors as even being an option. \n\nYou will gain weight.  You will be changing your clothing sizes, and getting rid of ANY clothes that only fit your body with a ED behavior.    You will ditch the scale.   There's nothing but cruel judgment there.  Not needed in Recovery or at all in fact!!\n\nGet ready to fight.  Freedom isn't Free.  But only YOU can do it.  Only you can be the one to choose correct behaviors over ED ones.\n\nI recovered after 35 years into a menopausal body.   The ED addiction WILL take over your life if you let it. It's time to think about if you want to fight now or later, dealing with older skin that doesn't react like you want it to, or other physical problems,  just because you are simply older.   \n\nThe body always wins in the end.  It's called aging and death.   Don't spend your life in misery. You don't need to be, or conform, or prove yourself to anyone.   Diversity includes all body shapes too!!  Go fight for your freedom.",
          "created_utc": 1710940688.0
        }
      ]
    },
    {
      "id": "kvw3qc6",
      "author": "Informal-Ad-7356",
      "body": "I recovered from alcohol abuse and ED.   The Recovery from the ED was far harder. The booze...just don't buy it, be around it, have that first drink.   The frickin food?   Oh here is your demon 3X plus a day...but just moderate with no behaviors.   I hear you...it was truly day by day work to get free.  Day by day committed until the screaming urges died down. That's why I now guard my Recovery like a fragile child.  (Stfu ozempic ads!!  You are hurting some of us!)",
      "created_utc": 1711030630.0,
      "score": 4,
      "context": [
        {
          "id": "kvnzxl5",
          "author": "Sea-Fix-3520",
          "body": "After I got sober from alcohol, I started smoking 🚬 and got hooked on cigarettes and I was trying to stop eating sugar and flour, but I was hungry and broke,and we just moved, to a cheaper apartment with my roommate,and I couldn't afford to eat , but I went to AA, and OA meetings,and came home (before cell phones) and ate  my roommate's peanut butter,and ice cream 🍨.Then I fell asleep on top of the bed ,and dropped a cigarette on the bedspread and the bed caught fire, and the firemen came, and I was so embarrassed, and full of guilt and shame, and I ran out the door and never came back.And it went on and on.But the bulimia stopped.",
          "created_utc": 1710895970.0
        }
      ]
    },
    {
      "id": "kvwp9p7",
      "author": "PhotographSingle2746",
      "body": "Hey ❤️❤️\nThank you for sharing your experience , just wanted to send you some love and support. Life can be tough, but remember, you're not alone. You're strong and resilient, and you deserve happiness and healing. Keep holding on and please seeking help in hospital or therapy better days are ahead. Sending you a virtual hug and wishing you all the best on your journey.l❤️❤️❤️",
      "created_utc": 1711038048.0,
      "score": 1,
      "context": [
        {
          "id": "kvsezmf",
          "author": "ArgentumMorte",
          "body": "I hear you, i had a juvenile criminal record for shoplifting in my country and am now an escort to afford my addiction at 22. The things i do for food😔",
          "created_utc": 1710967223.0
        }
      ]
    }
  ]
}