{
  "id": "1bjvey4",
  "subreddit": "bulimia",
  "author": "Moviemaker99",
  "created_utc": 1710986883.0,
  "title": "The food is NEVER worth it",
  "selftext": "I’ve wasted thousands of dollars on food, my wildest cravings, things I’ll convince myself that after this last crazy binge it’ll be my last one ever…just to end up purging and feeling disgustingly ashamed that I hurriedly scarfed down a gigantic portion of whatever. And you know what?? It never satisfies me! I always eat whatever I want exactly and it never hits the spot. This ED seriously sucks. I haven’t been purging very consistently but its become a multiple time a week thing if I stray from my diet and workout plan—which I continue to do. The food is never worth it so why do I crave it all of the time? I think about eating all day long.  ",
  "url": "https://www.reddit.com/r/bulimia/comments/1bjvey4/the_food_is_never_worth_it/",
  "score": 124,
  "num_comments": 22,
  "comments": [
    {
      "id": "kvug6kb",
      "author": "Winnipegwonderland19",
      "body": "I love seeing my bank statement after the fact too. How do you tell your fiancé that you can’t save up for a house because you need to spend hundreds of $$ of food to eat and then promptly throw up",
      "created_utc": 1710995610.0,
      "score": 56,
      "context": []
    },
    {
      "id": "kvu5hos",
      "author": "EffortOk3350",
      "body": "And sometimes for me I’ll be craving a food, convince myself I can buy the pack of small portioned ones and “only have one” but it ends up being every single one I’ve bought even by the time I’m finished they taste gross and then I’m grossed out by myself",
      "created_utc": 1710990332.0,
      "score": 34,
      "context": []
    },
    {
      "id": "kvuqjmq",
      "author": "None",
      "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
      "created_utc": 1711002346.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kvuehh6",
      "author": "vbgirl24",
      "body": "Ugh I resonate with this. I hate myself for giving into cravings. It is even worse when the binge is completely unsatisfying and then not only do I have to waste time purging, but also wasted money 🤡",
      "created_utc": 1710994681.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kvwb2em",
      "author": "hallowmean",
      "body": "The food is never worth it, but the ED is serving a purpose in your life that seems worth it to you. The act of thinking about and eating and purging the food is fulfilling a need or helping you cope in some way, otherwise you'd stop because you know the food isn't worth it. \n\nIf it was just about the food it would be easy, but it's not, because it isn't.",
      "created_utc": 1711033225.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kvvlw3v",
      "author": "Longjumping_Laugh337",
      "body": "Yep. I’m in debt simply due to food delivery services",
      "created_utc": 1711023381.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kvyny4t",
      "author": "InternationalEase718",
      "body": "I hear you and this was me too. What really helps me is when I’m able to let go of the eating plan and exercise schedule. Restriction ALWAYS leads to binging. always. I’m willing to bet if you allowed yourself to eat freely and fed your body properly, those cravings will diminish. This disorder sucks so hard, and it sucks more than the extra weight you think you’ll put on. I went all out when I started recovering, I bought bigger clothes so that I didn’t feel shit about putting on weight- I really prepared myself. Interestingly, I didn’t gain any weight so those extra clothes aren’t being used but they are there as a reminder that I accept myself at any weight. \nThe food is never worth it- you are absolutely right.  Literally nothing is worth it.",
      "created_utc": 1711061532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvwh3yi",
      "author": "Forward_Peanut1019",
      "body": "Yes. Same for me. I payed my credit card debt like two months ago which was mostly money spent on food. And till now i use most of my salary on delivery foods and snacks. I have a problem now that i barely have any money on things that i really need and i cant tell anyone because its so dumb and i know nobody will understand and they will get mad",
      "created_utc": 1711035306.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvwwwvm",
      "author": "CheesecakeAngel",
      "body": "I feel this post so much! My bank account is always red because I can't stop spending so much money every day trying to fulfill the void that is inside of me, but it's pointless! I hate myself I hate this but I can't stop 😩 🥹",
      "created_utc": 1711040531.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kw1mhcb",
      "author": "luaissad",
      "body": "This was me today, in the store buying said binge food to only end up having my card DECLINED because I’ve spent all my money on previous binges",
      "created_utc": 1711115251.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvxnrxi",
      "author": "eviIdeviI",
      "body": "so comforting to not be alone with this mess 🫂",
      "created_utc": 1711049273.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvxwlw9",
      "author": "Safetychick92",
      "body": "I do this too, it’s always “this is my last binge ever” and I never eat nearly enough to make the money spent worth it",
      "created_utc": 1711052176.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvycsd5",
      "author": "Necessary-Award-4220",
      "body": "$500 is 2 weeks🥲 probably only 1/3 of it was actually groceries I keep down & energy drinks",
      "created_utc": 1711057562.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw1qior",
      "author": "Informal-Ad-7356",
      "body": "It's because it's a vicious addiction.    I remember this specifically with my eating disorder and with booze when I was abusing that too.   It's not just the food itself.   It's the ritual,  the reasons WHY.  At one point when trying to control my poor sick mind, I wouldn't even binge;  I would just purge nothing at all. \n\nThis is a crippling addiction.   Please consider outside help.  It is not quick or easy. I wish I could tell you the opposite,  but it took me 2 years to Recover from 3 decades long ED.    It's a slow and steady process. \n\nThere are a few ways to recover,  so if one approach doesn't work, change gears and try again.   Even if you don't feel you are recovering \"fast enough \" or \"correctly\", the pure fight against it will bring back your self-respect because you are trying to fight this Beast.    In the last year of my Recovery I was doing it  alone without a team and that was fine because I had the information; the tools.   At the beginning attempts I tried an ED treatment clinic (didn't work at all for my personality)  but then after 2 more dieticians and 2 more therapists...I found a \"team\" that worked with where I was, not just going off some pre-determined chart.   I then moved away from that state to one with poor mental health coverage, so I had to do it alone.    By then I wanted to relapse bad...but I had already had a taste of freedom,  and I found out I wanted freedom MORE than what the ED gave me!!  This was a vital point in my Recovery. Once you taste freedom,  you know there is a different way to live.\n\nHuge tips for me for that successful push:  ditch the cruel scale, or at least put further and further amts of time between weighing until you can ditch the effing scale.    And also while recovering,  get rid of ANY and all clothing that only fits a body using ED behaviors.   And how I started was eating \"safe foods\" and not allowing Purging to be an option...no matter what!   Then increasing safe foods qtys...sitting in the uncomfortable...digest.   repeat.   Then add in moderate scary foods.. sit in the uncomfortable,  digest,  repeat.    Trigger or binge foods came only at the end.   You can only handle so much at a time.  You gotta eat the food. You have to let your body do what it wants to.  Simple but hard...but factual. You have to surrender to the process.  Scream, sweat, Journal...whatever you need to do, move furniture....but eat the food, sit with it, digest the food. \n\nRemember to always forgive yourself.   A slip is NOT a relapse.   You are relearning a new way to eat, digest, you may get intestinal upset in the beginning...you may have to relearn how to carry a different body on your frame, and how this feels physically and emotionally.    This is not a short or quick process .  One step at a time.\n\nRecovery IS possible.    This can be done.  You may never love your new body, but the freedom is PRICELESS.   Come over to Recovery.   We can eat and digest cookies over here...chocolate without guilt, visiting a restaurant without looking at the menu first, and join our people when socializing; being fully there.  \n\nYou could start today.   But it's baby steps and you have to be 100% honest with yourself.   You know what triggers you, you know when you are slipping or cheating.    This is your personal fight.",
      "created_utc": 1711116701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvxqplb",
      "author": "kasialis721",
      "body": "omg i had this, except i was a 17 yo living with my family, and all my mum said is „you’re eating all this food and where is it going? you don’t look fat or bulimic!!” i’m like miss gurl if only you knew",
      "created_utc": 1711050242.0,
      "score": 3,
      "context": [
        {
          "id": "kvug6kb",
          "author": "Winnipegwonderland19",
          "body": "I love seeing my bank statement after the fact too. How do you tell your fiancé that you can’t save up for a house because you need to spend hundreds of $$ of food to eat and then promptly throw up",
          "created_utc": 1710995610.0
        }
      ]
    },
    {
      "id": "kvvi5eg",
      "author": "EffortOk3350",
      "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
      "created_utc": 1711021532.0,
      "score": 9,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        }
      ]
    },
    {
      "id": "kvw1a6f",
      "author": "Moviemaker99",
      "body": "Me too, I also have bpd so the impulsive spending to cure how I’m feeling in a moment has put me in an awful spot. I’ve maxed out multiple cards that are all closed now. You should look into debt relief, that’s my only option to ever fix my score now☹️",
      "created_utc": 1711029734.0,
      "score": 5,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        }
      ]
    },
    {
      "id": "kvwxltp",
      "author": "None",
      "body": "I told someone recently about my cc debt bc they were talking about theirs but when they asked me what I bought I couldn’t tell them I had zero to show for it",
      "created_utc": 1711040758.0,
      "score": 2,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        },
        {
          "id": "kvvi5eg",
          "author": "EffortOk3350",
          "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
          "created_utc": 1711021532.0
        }
      ]
    },
    {
      "id": "kvxxm1a",
      "author": "EffortOk3350",
      "body": "It’s so hard. My husband says the same thing… and idk how to tell him",
      "created_utc": 1711052504.0,
      "score": 2,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        },
        {
          "id": "kvvi5eg",
          "author": "EffortOk3350",
          "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
          "created_utc": 1711021532.0
        },
        {
          "id": "kvwxltp",
          "author": "None",
          "body": "I told someone recently about my cc debt bc they were talking about theirs but when they asked me what I bought I couldn’t tell them I had zero to show for it",
          "created_utc": 1711040758.0
        }
      ]
    },
    {
      "id": "kvzr0fj",
      "author": "None",
      "body": "Oh wow he doesn’t know? I’m so so sorry. Ive lived w boyfriends who never knew abd holy shit it was such agony. Waiting for alone time to binge, replacing food as quick as I could…\nI was once binging when I thought my bf was asleep and he woke up and came into the living room, and I threw a blanket over all the food in front of me and tried to get him to go back to bed, but the main thing i remember aside from being terrified he’d see the amount of food I had laid out was this super intense fury at him.I had y eaten enough to be furious I couldn’t purge- I was raging mad bc he ruined my binge!! I have a great therapist etc etc but I still feel so fkng insane sometimes",
      "created_utc": 1711076592.0,
      "score": 1,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        },
        {
          "id": "kvvi5eg",
          "author": "EffortOk3350",
          "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
          "created_utc": 1711021532.0
        },
        {
          "id": "kvwxltp",
          "author": "None",
          "body": "I told someone recently about my cc debt bc they were talking about theirs but when they asked me what I bought I couldn’t tell them I had zero to show for it",
          "created_utc": 1711040758.0
        },
        {
          "id": "kvxxm1a",
          "author": "EffortOk3350",
          "body": "It’s so hard. My husband says the same thing… and idk how to tell him",
          "created_utc": 1711052504.0
        }
      ]
    },
    {
      "id": "kvzt2bs",
      "author": "EffortOk3350",
      "body": "So he knows that I’ve eaten “so much” that I throw up, but he doesn’t know I make myself if that makes sense - he has seen it once in a while but not to like the full extent… which is why it’s in quotations because he’s seen it at like 25% not like a full out binge… I blame a lot of my digestion problems on my gallbladder that I had to have removed like a year and a half ago.",
      "created_utc": 1711077501.0,
      "score": 2,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        },
        {
          "id": "kvvi5eg",
          "author": "EffortOk3350",
          "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
          "created_utc": 1711021532.0
        },
        {
          "id": "kvwxltp",
          "author": "None",
          "body": "I told someone recently about my cc debt bc they were talking about theirs but when they asked me what I bought I couldn’t tell them I had zero to show for it",
          "created_utc": 1711040758.0
        },
        {
          "id": "kvxxm1a",
          "author": "EffortOk3350",
          "body": "It’s so hard. My husband says the same thing… and idk how to tell him",
          "created_utc": 1711052504.0
        },
        {
          "id": "kvzr0fj",
          "author": "None",
          "body": "Oh wow he doesn’t know? I’m so so sorry. Ive lived w boyfriends who never knew abd holy shit it was such agony. Waiting for alone time to binge, replacing food as quick as I could…\nI was once binging when I thought my bf was asleep and he woke up and came into the living room, and I threw a blanket over all the food in front of me and tried to get him to go back to bed, but the main thing i remember aside from being terrified he’d see the amount of food I had laid out was this super intense fury at him.I had y eaten enough to be furious I couldn’t purge- I was raging mad bc he ruined my binge!! I have a great therapist etc etc but I still feel so fkng insane sometimes",
          "created_utc": 1711076592.0
        }
      ]
    },
    {
      "id": "kvzu6ai",
      "author": "None",
      "body": "That def makes sense",
      "created_utc": 1711077997.0,
      "score": 1,
      "context": [
        {
          "id": "kvuqjmq",
          "author": "None",
          "body": "Every. Single. Time. Is the last time so I can splurge- every single time. And alwaaaaays trying to find that one food that is so great it’s all worth it. Is it fried chicken for 4? Is it tons of Chinese food? Sjwsys searching for the perfect food to get the last binge and I never find it bc it doesn’t exist.\n\nAlso in such credit card debt bc of this. I remember once I maxed out my cc and I was broke so I absolutely couldn’t binge, and it felt freeing almost?\nLike I need an electric shock every time I go to DoorDash or grubhub. I delete the apps but they’re online!\nI’ve deleted and re-downloaded Uber eats so many times",
          "created_utc": 1711002346.0
        },
        {
          "id": "kvvi5eg",
          "author": "EffortOk3350",
          "body": "Me too, the amount of times I’ve deleted and redownloaded is insane - and all the money I have spent - it’s completely humiliating… I’m right there with you with the credit card debt too",
          "created_utc": 1711021532.0
        },
        {
          "id": "kvwxltp",
          "author": "None",
          "body": "I told someone recently about my cc debt bc they were talking about theirs but when they asked me what I bought I couldn’t tell them I had zero to show for it",
          "created_utc": 1711040758.0
        },
        {
          "id": "kvxxm1a",
          "author": "EffortOk3350",
          "body": "It’s so hard. My husband says the same thing… and idk how to tell him",
          "created_utc": 1711052504.0
        },
        {
          "id": "kvzr0fj",
          "author": "None",
          "body": "Oh wow he doesn’t know? I’m so so sorry. Ive lived w boyfriends who never knew abd holy shit it was such agony. Waiting for alone time to binge, replacing food as quick as I could…\nI was once binging when I thought my bf was asleep and he woke up and came into the living room, and I threw a blanket over all the food in front of me and tried to get him to go back to bed, but the main thing i remember aside from being terrified he’d see the amount of food I had laid out was this super intense fury at him.I had y eaten enough to be furious I couldn’t purge- I was raging mad bc he ruined my binge!! I have a great therapist etc etc but I still feel so fkng insane sometimes",
          "created_utc": 1711076592.0
        },
        {
          "id": "kvzt2bs",
          "author": "EffortOk3350",
          "body": "So he knows that I’ve eaten “so much” that I throw up, but he doesn’t know I make myself if that makes sense - he has seen it once in a while but not to like the full extent… which is why it’s in quotations because he’s seen it at like 25% not like a full out binge… I blame a lot of my digestion problems on my gallbladder that I had to have removed like a year and a half ago.",
          "created_utc": 1711077501.0
        }
      ]
    }
  ]
}