{
  "id": "1bpjv82",
  "subreddit": "bulimia",
  "author": "fireflashthirteen",
  "created_utc": 1711591147.0,
  "title": "Don't ever let your guard down on your disorder. Ever.",
  "selftext": "Two years ago, I made a post in here celebrating my hard earned recovery. I'd just put together a stretch of 144 days without bingeing, restricting or purging. It was a stretch I'd just put together off the back of 98 days without disordered eating - meaning I had gone over seven months with only one binge. At the time, it was a reddit-post-worthy achievement for me.  \n\n\nI would go on to extend that stretch to 232 days without bingeing, and after some minor setbacks (35 days without bingeing; 135 days without bingeing), in 2023, I put together my crowning achievement - a full 402 days without bingeing, purging or restricting.   \n\n\nIt was absolutely life changing. In 2023, I finally got my life back and became the person I should have been for the entirety of my early 20s. Now 25 years old, I was fit, resilient, and successful in the things I set out to accomplish. I was attractive and desired. I was adventurous and I explored the world, with a confidence that allowed me to go to dangerous places and do amazing things that many other people only dream of. It was undoubtedly the happiest time of my life. I'd done it. I'd beaten it, I'd survived, and it all been worth it.   \n\n\nAnd then a month ago, in a split second moment of weakness, it all came crashing down. All it took was one binge urge to get through. Of course, I knew this might happen eventually. Not to worry, I thought - if I did 402 days this last time, then the sky was the limit on my record this time around. I was so confident in my abilities in fact, that I thought it might very well have been the last time I ever binged.   \n\n\nToo confident. I was too confident.   \n\n\nIt was not the last time. Before I knew it, I'd binged again. And again. And again.   \n\n\nAnd now, I sit here writing to you with a very fucking heavy (and likely heading towards unhealthy) heart as I am forced to admit that I have fully relapsed into bulimia. Not OSFED or EDNOS like times before; full, clinical bulimia. Square one, as they say. On average, I'm now bingeing once every 5 days, and while I'm not purging, I realise I am subconsciously restricting my calories again because I can't stand the sight of what I've become in the mirror.   \n\n\nI'll keep the scale out of this, but in a month, I've gained well over \\~8% of my former bodyweight in pure fat. Not water-weight - not muscle - just pure fat, and that comes at a cost. I struggle to train at 80% of what I was formerly physically capable of, regardless of whether it's strength, cardio, flexibility - you name it. My posture has been destroyed by the rapid accumulation of fat on my waist, and my joints ache because they're not accustomed to carrying this much pressure. Due to the severity of my binges, I've rapidly transitioned from a body composition generally held by competing elite athletes, to someone who's slightly overweight. It all happened so fast.   \n\n\nBut what's worse, so much worse, is what's happened to my mind. I can't go out. I just travelled the world, solo, for several months, but I can't even leave the house for a social event. I can't plan ahead beyond a couple of days. I can work, a little, but it takes every ounce of my energy. I can't read a book anymore, because I can't concentrate for long enough or understand the words. Little things I used to do voluntarily for my partner now seem like overwhelming demands. I cry every day. I never really used to cry. And I can't remember things; my memory (along with virtually all of my other cognitive faculties) is shot. It's like my mental world has caved in on top of me, and I can't see out of the rubble anymore.  \n\n\nI thought I'd maybe end up back to where I was in 2022. Maybe even 2021. But this has been at minimum, a 4 year setback. Hell, this could even be a 6 year setback.  \n\n\nWhat if it takes another 6 years to make it back? Who's to say it won't? My record, right now, is 12 days without a binge, and that is not 12 days and counting. Every day is near unbearable. I don't know who I am anymore. I don't know how I became this. It all happened so fast.   \n\n\nI'm not done. I've been outside in that light at the end of the tunnel now, and it's glorious. I'll do everything in my power to make it back there and if I've done it once, then there's a good chance I can do it again.   \n\n\nBut while I apologise if this is confronting, I really want this to be a warning to any of you who have recovered and think you're safe from this stuff, because you may very quickly find out that you're not. Don't ever let your guard down - keep to the things that got you healthy, keep your momentum going. Because if your momentum stops... Fuck. I can't tell you how hard things are right now.   \n\n\nI'm sorry that this is a negative post and I know it might seem scary to those who haven't recovered yet. But I wanted to be honest. I won't stop fighting and you shouldn't either. For those who read through all of this, thankyou for holding this space and allowing me to vent about my experience.   \n\n\nI wish the very best for all of us in our recovery journeys. I stand by what I said 2 years ago: recovery does happen, and at the very least, it's worth our best shot.   \n\n\nThis is me signing off - 28/03/2024 - 4 days and counting without a binge.   \n\n\n&#x200B;\n\n&#x200B;",
  "url": "https://www.reddit.com/r/bulimia/comments/1bpjv82/dont_ever_let_your_guard_down_on_your_disorder/",
  "score": 73,
  "num_comments": 18,
  "comments": [
    {
      "id": "kwwgk74",
      "author": "PeachYogurtLover",
      "body": "Oh, shit happens, sadly, i think that ED's will ever be part of our life.Our mind has this emergency mechanism, the b/p cycle, but it's so, so valuable that once you've been able to overcome it so much, it shows you that it's not impossible. You can get out of that hole. Please, don't get discouraged. I know how exhausting and desperate it is, but you'll achieve it again. You're very capable. Much strength to you. Maybe you lost a battle, but not the war. 🫂",
      "created_utc": 1711594310.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kwx1bp4",
      "author": "StockReporter5",
      "body": "i’m so sorry ur going through this but thank u for posting about it. i would give anything to get 402 days and this helped me believe the work will be worth it. you’ve done it before, u can do it again! maybe set smaller goals for yourself? you might not get back to full recovery lickety split, but it’s unfair to expect yourself to. if it’s possible for you to see a therapist, i would go for it. it’s helped me a bunch. small wins are still wins <3",
      "created_utc": 1711605407.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kwx2pf9",
      "author": "None",
      "body": "hey there. something that’s helped me in my relapses is remembering you’re not ~really~ starting from scratch. you’re starting from ~experience~. sending you so much love and hoping you can give yourself grace. you’ve done it before and you will do it again!!!! 💗💗💗💗",
      "created_utc": 1711606350.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kwxvo2d",
      "author": "hallowmean",
      "body": "Square one is bullshit, you're not at square one. You couldn't be if you tried. You're exactly where you are now, with all the tools and skills and coping mechanisms that you've developed since last time. There's no backward, theres only forward. Every day without a binge is a success, and any day with one is a step forwards regardless.",
      "created_utc": 1711626422.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kwzjmav",
      "author": "esoterique87",
      "body": "Thank you for sharing your story. From what I read, you are an incredibly strong person who has worked so hard to get what they want. I want you to know that the knowledge, experience, confidence and progress you have made isn't lost. All of those things are yours forever, not even a relapse can take them away from you. \n\nI had a bad relapse back in 2020 after over a year with no behaviors and have since fully recovered. For me, my body image was the wall I hit that allowed my eating disorder back in. And it turns out that my body image issues were tied to trauma I experienced as a teenager. Sometimes we think we have recovered but there are stones that we haven't unturned or things we haven't fully addressed. Eating disorders can be alarm systems for something inside that hasn't been resolved. If you can think of anything at all that might have triggered this relapse, it could be really helpful in moving forward in your recovery. \n\nIn my experience, letting go of the shame, feelings of failure and reaching out for help was the best way to pull me out of my relapse. If you have access to help, I strongly recommend working with someone who specializes in eating disorders. Sometimes we don't know how deep these things go until we have the guidance of a professional. If you don't have the ability to seek support, return to what was working before. Add in anything that has fallen out of rotation that was helping you in your recovery. What has worked in the past will likely work again.\n\nSending you so much love and support. 💜",
      "created_utc": 1711648233.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kx0ebwc",
      "author": "Unidentified_Cat_",
      "body": "I relapsed on and off for 10 years before I settled into real healing. Today I’ve not only sustained but evolved even deeper in my healing over the past decade. I do not live my life with my guard up because I am a different person now and I trust myself. ED doesn’t exist for me anymore but it took a decade of relapse to get here. Don’t lose hope. Healing is not linear. You are never starting all over. Please don’t let your brain fool you. You are picking yourself up from a fall while having the most knowledge you’ve ever had. Sending you so much support. Keep going. ❤️",
      "created_utc": 1711658497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kwyr0kl",
      "author": "Margaet_moon",
      "body": "Your post is very relatable. I had a breakdown in the autumn telling my mum I’ll never be a normal functioning girl again. No matter the stage of my eating disorder I always have that ping in the back of my head. It’s such a sad situation we have been given but as I sure you know how, all we can do is make the best of everyday and fight when we can.\n\nYou’re not alone, hang in there darling. Better days are possible, even one-two days victories are still victories. Thinking of you. xx",
      "created_utc": 1711638800.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kx0aqnz",
      "author": "SnooSnoo96035",
      "body": "Sending you compassion and grace.  🫂",
      "created_utc": 1711657292.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwwp0r7",
      "author": "LobsterKey4514",
      "body": "Thank you so much for sharing this important message. 🙏\n\n\nI am sending you love and support beyond what I can put in words. ",
      "created_utc": 1711598246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwx5f0x",
      "author": "fireflashthirteen",
      "body": "Thankyou - I guess my mistake was thinking the war was over. But now I know better!\n\nWishing you the absolute best in your recovery :)",
      "created_utc": 1711608282.0,
      "score": 5,
      "context": [
        {
          "id": "kwwgk74",
          "author": "PeachYogurtLover",
          "body": "Oh, shit happens, sadly, i think that ED's will ever be part of our life.Our mind has this emergency mechanism, the b/p cycle, but it's so, so valuable that once you've been able to overcome it so much, it shows you that it's not impossible. You can get out of that hole. Please, don't get discouraged. I know how exhausting and desperate it is, but you'll achieve it again. You're very capable. Much strength to you. Maybe you lost a battle, but not the war. 🫂",
          "created_utc": 1711594310.0
        }
      ]
    },
    {
      "id": "kwx4rmr",
      "author": "fireflashthirteen",
      "body": "It is worth it for sure.   \n  \nI am having to set smaller goals at this point, I don't really have a choice. Right now, my focus is on beating 12 days, and hopefully I can just keep the ball rolling from there. I've brought back some old strategies and incorporated some new ones and so far, they're working quite well.\n\nI'm glad a therapist has worked well for you - I would recommend everyone go and see one if they haven't already. In my case, a therapist helped me understand that I had a disorder in 2018 when I was still in denial and didn't fully appreciate the degree to which BN can warp your brain and your thinking. That was back in the days where I thought that hoarding junk food in my room but barely touching it (until a binge of course) was totally normal and reasonable behaviour...  \n  \nUnfortunately therapy is a trigger in itself for me, and part of me jump-starting my recovery in 2021 was actually stopping it altogether. One approach doesn't fit all I guess",
      "created_utc": 1711607815.0,
      "score": 3,
      "context": [
        {
          "id": "kwx1bp4",
          "author": "StockReporter5",
          "body": "i’m so sorry ur going through this but thank u for posting about it. i would give anything to get 402 days and this helped me believe the work will be worth it. you’ve done it before, u can do it again! maybe set smaller goals for yourself? you might not get back to full recovery lickety split, but it’s unfair to expect yourself to. if it’s possible for you to see a therapist, i would go for it. it’s helped me a bunch. small wins are still wins <3",
          "created_utc": 1711605407.0
        }
      ]
    },
    {
      "id": "kwx3t4b",
      "author": "fireflashthirteen",
      "body": "Yeah, that's true - but I'm really hesitant to look at it that way now, because that's what I told myself after the first slip up, and now it's progressed to a full blown relapse. As I said, it was my overconfidence that sunk me.  \n  \nI'm honestly so out of practice with recovery that I keep underestimating just how stress-minimising I need to be to get a successful recovery push off the ground :/",
      "created_utc": 1711607119.0,
      "score": 3,
      "context": [
        {
          "id": "kwx2pf9",
          "author": "None",
          "body": "hey there. something that’s helped me in my relapses is remembering you’re not ~really~ starting from scratch. you’re starting from ~experience~. sending you so much love and hoping you can give yourself grace. you’ve done it before and you will do it again!!!! 💗💗💗💗",
          "created_utc": 1711606350.0
        }
      ]
    },
    {
      "id": "kx01ml8",
      "author": "fireflashthirteen",
      "body": "You're right, square one is bullshit, and I appreciate your approach in telling me this. Sometimes a reality check is what's needed.\n\nWith that said, the concepts of momentum and/or vicious cycles seem very real when it comes to eating disorders or otherwise addictive behaviours (or at least have been in my mental health journey). Generally, the longer you go between disordered behaviours, the easier things become. Likewise though, when the gap between them gets increasingly smaller, it becomes progressively harder to bounce back.  \n  \nI think it's okay and even often healthy to acknowledge broader negative trends, provided its in a context of working to address them. I'm moving forward again now with some old and some new strategies, but there's no point denying (for my own sanity especially) that I'm starting from quite a low base now and consequently may need to manage my expectations of what I'll be capable of.",
      "created_utc": 1711654220.0,
      "score": 2,
      "context": [
        {
          "id": "kwxvo2d",
          "author": "hallowmean",
          "body": "Square one is bullshit, you're not at square one. You couldn't be if you tried. You're exactly where you are now, with all the tools and skills and coping mechanisms that you've developed since last time. There's no backward, theres only forward. Every day without a binge is a success, and any day with one is a step forwards regardless.",
          "created_utc": 1711626422.0
        }
      ]
    },
    {
      "id": "kx061xe",
      "author": "fireflashthirteen",
      "body": "No, thank you for sharing yours... You can't know how much it means to me to find not only someone who has recovered, but someone who has (edit: clinically) recovered twice. You are such an inspiration to people like me - you remind me, and hopefully others, of what's possible and what we too might be capable of\n\nI do have body image issues, from just plain old dysmorphia to self-loathing to critical life events that made me see body image in a very problematic way. Sadly, that last part I think is less a mental distortion and more a reflection of how our society treats people on the basis of their aesthetic appeal\n\nI'm in a little bit of a tough spot because therapy is a trigger for me and has put me in some dangerous spots in the past. I've worked with specialists and they've never really understood me\n\nBut yeah, I am returning to the old strategies that I phased out over time, and so far so good, I guess :)",
      "created_utc": 1711655705.0,
      "score": 2,
      "context": [
        {
          "id": "kwzjmav",
          "author": "esoterique87",
          "body": "Thank you for sharing your story. From what I read, you are an incredibly strong person who has worked so hard to get what they want. I want you to know that the knowledge, experience, confidence and progress you have made isn't lost. All of those things are yours forever, not even a relapse can take them away from you. \n\nI had a bad relapse back in 2020 after over a year with no behaviors and have since fully recovered. For me, my body image was the wall I hit that allowed my eating disorder back in. And it turns out that my body image issues were tied to trauma I experienced as a teenager. Sometimes we think we have recovered but there are stones that we haven't unturned or things we haven't fully addressed. Eating disorders can be alarm systems for something inside that hasn't been resolved. If you can think of anything at all that might have triggered this relapse, it could be really helpful in moving forward in your recovery. \n\nIn my experience, letting go of the shame, feelings of failure and reaching out for help was the best way to pull me out of my relapse. If you have access to help, I strongly recommend working with someone who specializes in eating disorders. Sometimes we don't know how deep these things go until we have the guidance of a professional. If you don't have the ability to seek support, return to what was working before. Add in anything that has fallen out of rotation that was helping you in your recovery. What has worked in the past will likely work again.\n\nSending you so much love and support. 💜",
          "created_utc": 1711648233.0
        }
      ]
    },
    {
      "id": "kx03rfz",
      "author": "fireflashthirteen",
      "body": "Thankyou and I can tell you from experience, with each victory the pings get less intense, fewer and further in between. Functioning at all can be just as good as normal functioning in my book, so I hope we can both find our way there :)",
      "created_utc": 1711654939.0,
      "score": 1,
      "context": [
        {
          "id": "kwyr0kl",
          "author": "Margaet_moon",
          "body": "Your post is very relatable. I had a breakdown in the autumn telling my mum I’ll never be a normal functioning girl again. No matter the stage of my eating disorder I always have that ping in the back of my head. It’s such a sad situation we have been given but as I sure you know how, all we can do is make the best of everyday and fight when we can.\n\nYou’re not alone, hang in there darling. Better days are possible, even one-two days victories are still victories. Thinking of you. xx",
          "created_utc": 1711638800.0
        }
      ]
    },
    {
      "id": "kwx5bal",
      "author": "fireflashthirteen",
      "body": "Thankyou :)",
      "created_utc": 1711608208.0,
      "score": 1,
      "context": [
        {
          "id": "kwwp0r7",
          "author": "LobsterKey4514",
          "body": "Thank you so much for sharing this important message. 🙏\n\n\nI am sending you love and support beyond what I can put in words. ",
          "created_utc": 1711598246.0
        }
      ]
    },
    {
      "id": "kx519h7",
      "author": "esoterique87",
      "body": "I totally get it, I had some awful experiences in therapy which made me adverse to the whole thing for a very long time. It's difficult to find someone knowledgable and trustworthy who also understands us. It sounds like you have a plan in place and that is really the main thing. \n\nI know how discouraging a relapse can be especially after you have been doing so well. It's really hard to come to terms with the fact that you have more work to do despite thinking you were done. The most important thing is that you don't give up. The people who do not recover are the ones who, for whatever reason, stop trying. It may take longer than you initially thought but the things that are worthwhile in this life rarely come quickly or easily. You absolutely can get back to where you were and you will probably be even stronger this time around. You got this. 💕",
      "created_utc": 1711734216.0,
      "score": 2,
      "context": [
        {
          "id": "kwzjmav",
          "author": "esoterique87",
          "body": "Thank you for sharing your story. From what I read, you are an incredibly strong person who has worked so hard to get what they want. I want you to know that the knowledge, experience, confidence and progress you have made isn't lost. All of those things are yours forever, not even a relapse can take them away from you. \n\nI had a bad relapse back in 2020 after over a year with no behaviors and have since fully recovered. For me, my body image was the wall I hit that allowed my eating disorder back in. And it turns out that my body image issues were tied to trauma I experienced as a teenager. Sometimes we think we have recovered but there are stones that we haven't unturned or things we haven't fully addressed. Eating disorders can be alarm systems for something inside that hasn't been resolved. If you can think of anything at all that might have triggered this relapse, it could be really helpful in moving forward in your recovery. \n\nIn my experience, letting go of the shame, feelings of failure and reaching out for help was the best way to pull me out of my relapse. If you have access to help, I strongly recommend working with someone who specializes in eating disorders. Sometimes we don't know how deep these things go until we have the guidance of a professional. If you don't have the ability to seek support, return to what was working before. Add in anything that has fallen out of rotation that was helping you in your recovery. What has worked in the past will likely work again.\n\nSending you so much love and support. 💜",
          "created_utc": 1711648233.0
        },
        {
          "id": "kx061xe",
          "author": "fireflashthirteen",
          "body": "No, thank you for sharing yours... You can't know how much it means to me to find not only someone who has recovered, but someone who has (edit: clinically) recovered twice. You are such an inspiration to people like me - you remind me, and hopefully others, of what's possible and what we too might be capable of\n\nI do have body image issues, from just plain old dysmorphia to self-loathing to critical life events that made me see body image in a very problematic way. Sadly, that last part I think is less a mental distortion and more a reflection of how our society treats people on the basis of their aesthetic appeal\n\nI'm in a little bit of a tough spot because therapy is a trigger for me and has put me in some dangerous spots in the past. I've worked with specialists and they've never really understood me\n\nBut yeah, I am returning to the old strategies that I phased out over time, and so far so good, I guess :)",
          "created_utc": 1711655705.0
        }
      ]
    },
    {
      "id": "kx6q3so",
      "author": "fireflashthirteen",
      "body": "Yeah. It's a little morbid, but I've always been quite moved (for better and for worse) by the sentiment of \"either get busy living, or get busy dying\"... and I'm not ready to go out just yet. So we keep pushing forward!\n\n6 days and counting.",
      "created_utc": 1711758123.0,
      "score": 2,
      "context": [
        {
          "id": "kwzjmav",
          "author": "esoterique87",
          "body": "Thank you for sharing your story. From what I read, you are an incredibly strong person who has worked so hard to get what they want. I want you to know that the knowledge, experience, confidence and progress you have made isn't lost. All of those things are yours forever, not even a relapse can take them away from you. \n\nI had a bad relapse back in 2020 after over a year with no behaviors and have since fully recovered. For me, my body image was the wall I hit that allowed my eating disorder back in. And it turns out that my body image issues were tied to trauma I experienced as a teenager. Sometimes we think we have recovered but there are stones that we haven't unturned or things we haven't fully addressed. Eating disorders can be alarm systems for something inside that hasn't been resolved. If you can think of anything at all that might have triggered this relapse, it could be really helpful in moving forward in your recovery. \n\nIn my experience, letting go of the shame, feelings of failure and reaching out for help was the best way to pull me out of my relapse. If you have access to help, I strongly recommend working with someone who specializes in eating disorders. Sometimes we don't know how deep these things go until we have the guidance of a professional. If you don't have the ability to seek support, return to what was working before. Add in anything that has fallen out of rotation that was helping you in your recovery. What has worked in the past will likely work again.\n\nSending you so much love and support. 💜",
          "created_utc": 1711648233.0
        },
        {
          "id": "kx061xe",
          "author": "fireflashthirteen",
          "body": "No, thank you for sharing yours... You can't know how much it means to me to find not only someone who has recovered, but someone who has (edit: clinically) recovered twice. You are such an inspiration to people like me - you remind me, and hopefully others, of what's possible and what we too might be capable of\n\nI do have body image issues, from just plain old dysmorphia to self-loathing to critical life events that made me see body image in a very problematic way. Sadly, that last part I think is less a mental distortion and more a reflection of how our society treats people on the basis of their aesthetic appeal\n\nI'm in a little bit of a tough spot because therapy is a trigger for me and has put me in some dangerous spots in the past. I've worked with specialists and they've never really understood me\n\nBut yeah, I am returning to the old strategies that I phased out over time, and so far so good, I guess :)",
          "created_utc": 1711655705.0
        },
        {
          "id": "kx519h7",
          "author": "esoterique87",
          "body": "I totally get it, I had some awful experiences in therapy which made me adverse to the whole thing for a very long time. It's difficult to find someone knowledgable and trustworthy who also understands us. It sounds like you have a plan in place and that is really the main thing. \n\nI know how discouraging a relapse can be especially after you have been doing so well. It's really hard to come to terms with the fact that you have more work to do despite thinking you were done. The most important thing is that you don't give up. The people who do not recover are the ones who, for whatever reason, stop trying. It may take longer than you initially thought but the things that are worthwhile in this life rarely come quickly or easily. You absolutely can get back to where you were and you will probably be even stronger this time around. You got this. 💕",
          "created_utc": 1711734216.0
        }
      ]
    }
  ]
}