{
  "id": "1bvs148",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1712249107.0,
  "title": "Parents who gave you your ED",
  "selftext": "I preface this by saying I love my parents so damn much. They're wonderful. But I watched my dad spend his entire life dieting - four hours in the gym a day + cutting out sugar to the point of not eating bananas. We have a rule in our house - if I eat a \"high sugar\" fruit I can't have any dessert. My dad refuses to add salt in his cooking because it's \"unhealthy\". My mum won't eat bread from the supermarket because it's \"processed\". \n\nWhen I was a kid she used to diet me to the point where I wasn't happy unless I was binging - she caught me mid - binge once and called me a fat pig who was going to eat herself into the grave. Both my parents brag when they've fasted for the day - my mum tried to stop me from taking my prescribed vitamin meds to take her herbal meds from a priest in India. One of the side effects includes Diarrhea.\n\n I stopped seeing my nutritionist because all the foods we worked on and deemed healthy together - my parents made fun of it and made gagging noises every time I made it. Shopping is \"once you lose that last couple of KG...\" And \"Did you really need to eat as much as you did... Now this dress won't fit.\"\n\nNow I'm stuck. Can't move out. Can't heal with them. Binging and purging to a point of gaining weight. And no - can't talk to them about it either because that always results in a fight. \n\nI wonder if anyone else relates to my small rant or knows how to work through it or heal while living with parents like this?",
  "url": "https://www.reddit.com/r/bulimia/comments/1bvs148/parents_who_gave_you_your_ed/",
  "score": 88,
  "num_comments": 36,
  "comments": [
    {
      "id": "ky1gydk",
      "author": "ThestralBreeder",
      "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
      "created_utc": 1712251048.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ky1urw1",
      "author": "MariaMisterios",
      "body": "My mom gave me my ED!! She has body dysmorphia and is skinny and always complaining about how much weight she's put on or rejoicing over how much she lost because of having diarrhea or whatever. When I was a kid I was a bit on the chubby side (now I can see I was not really fat or obese, just chubby) and she always commented on how my outfits made my rolls pop, so I had to use loose baggy clothes to avoid this, plus she made me feel like i was huge. To make things worse, her idea of nutrition was terrible, she served spaghetti with bread (carbs over carbs) or rice or a ton of carbs, and I had to finish the whole plate. so I ended up making myself sick in my bathroom after each meal. Later I was able to go to a nutritionist and my mom absolutely obsessed over the diet and she was the one strictly following it. She recently got really sick because of a gut bacteria problem and was almost hospitalized because of unyielding diarrhea for a month, she lost 5 kg and she was over the moon because of how much weight she lost. \n\nDon't we all get our EDs from our parents?",
      "created_utc": 1712255530.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ky23v8x",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712258430.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ky2yb9t",
      "author": "littleT_mon",
      "body": "Wow. I’ve never been so triggered by other peoples parents. I mean, it sounds like they have full blown eating disorders themselves. That must be horrific to be around. You need to get out. I could never heal when I lived with my mum. Or if you can’t move, you’ve got to be so 100% on your recovery. Literally put blinders on, keep reminding yourself that your parents opinions are not fact, they are damaging and they will not be the medicine for you to heal. Do not listen to your parents. I find it helps thinking of them as kids. They are just big wounded children playing out the traumas they’ve picked up and trying to pass it on to you. Your job on this earth is to be a cycle breaker. To not let this behaviour pass on to other generations. Please know your parents are not the norm and for you to get out of this, you must completely ignore what they say and trust in the power you have within you to be successful in your recovery and thriving as a human x",
      "created_utc": 1712268182.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ky23yt1",
      "author": "Quintilyn",
      "body": "You’re totally not alone with this… my mum definitely pushed me over the edge. When I was younger I used to be chubbier and my family all made comments about it, but mostly my mum. She would put me on all sorts of diets and make mean comments about my weight and body :// at one point it just became too much and I developed anorexia and bulimia and became underweight and miserable then that became too much again for her\n\nOne of the requirements for me moving out was that I “fixed myself” and on the surface it seemed like it, but now I’m in and endless binge and purge cycle and I cant talk to them about it because they will send me staright home",
      "created_utc": 1712258461.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ky29n3k",
      "author": "ExpressionFast1468",
      "body": "My mom definitely contributed. She was overweight most of my childhood and refused to go shopping, do fun things with friends or really anything that wasn’t a “family” function. We went shopping when I was around 8 years old and she was crying in the dressing room because nothing fit or she didn’t like how she looked. She constantly had those magazines of lose weight in 5 days etc. She never told me to lose weight but it was always there because whatever diet she was on, we all were on. My grandma would always tell me how great I looked and I could see how it made my mom feel and then I slowly started restricting food and then would binge and purge. Didn’t help that it was the 90s, all my friends were skinny and people called me “thick.”\n\nI think the worst part was when she actually caught on to how I would shower after dinner so I could purge but I’d come up with an excuse and she’d let it go. It’s a battle I still fight but I’m happy my mom has become accepting of herself (she lost some weight but over time) and now compliments aren’t based on looks. Great lesson as I have a son and daughter and as hard as it is, we don’t talk about weight and if I’m having a day where things aren’t fitting right or I’m frustrated, I don’t project that onto my kids. We fuel our bodies and talk kindly to ourselves and others.",
      "created_utc": 1712260241.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ky28cpw",
      "author": "DaniDutchi",
      "body": "I strongly believe my mom gave me my eating disorder. She’s being yoyo’ing her weight for as long as I can remember and tried every diet known to mankind. I can still remember the herba life lady coming over every week to weigh her and she was over the moon to lose a few pounds living on mealshakes everyday. She would always say: ‘we are ALL going on this diet not just me!’. And she still does that, she’s on keto now (worst diet ever) she is overweight and makes the worst food choices and when I come over to join for dinner it’s full of heavy cream and pork and just 🤮 But she never listens to any feedback. I was a little chubby as a kid but not too overweight but I have had problems with food for when I was about 10 maybe? Peers started calling me fat and when I told my mom she put me on a diet straight away. I remember waking up very early to binge before my parents would wake . I remember that she (still) couldn’t say a single positive thing about herself and still look at myself with so much negativity which makes me so sad. She never wanted (still) to be in pictures and was always so negative about herself. I hate that I do the same now it’s such a bad habit. If I ever get a child I will never ever do that cause it makes me hate my life",
      "created_utc": 1712259843.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ky2e0hx",
      "author": "Local_Wrangler1335",
      "body": "My mum has always been OBSESSED with her looks and body. In her room she has old pictures of herself when she was underweight and modelling for motivation. She even lied to the doctor about her weight to get ozempic..\n\nI had the healthiest relationship to food as well as my body the first 14 years of my life, it makes me happy to think about. My weight fluctuates a lot and when I was at a heavier point than usual (not overweight by any means) my mom commented on my weight, so I decided to eat healthier and workout. I got obsessed and within months I lost way too much weight, and here I am battling bulimia and my mum is so scared of me unaliving. Thank you mum!",
      "created_utc": 1712261603.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ky3srwb",
      "author": "killermichi",
      "body": "My dad always let it be known that skinny girls were the beautiful ones while my mom was always bringing up how tiny she used to be. She did things like having me try on her cheer uniform and then point out how she wore it at my age, but it didn't fit me. She'd say things like how she wore a smaller size than me when she left the hospital after giving birth to me. I'm her 3rd child. I started wearing girdles my freshman year because I felt fat, and I didn't even weight 100lbs until I was about 4 months pregnant with my eldest child. I don't think she meant it to be mean and was just stuck in the glory days.",
      "created_utc": 1712279697.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ky3nurm",
      "author": "None",
      "body": "Not my mom, but my grandma gave me Ozempic as my 16th birthday gift, and told me everybody could see my “rolls” in my bikini, I was 8. parents definitely contribute more than they think.",
      "created_utc": 1712277763.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ky339ft",
      "author": "okaysweaty167",
      "body": "My mom didn’t give me an ED, but she never things I’m sick because she compares to when I was hospitalized the first time.",
      "created_utc": 1712269957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky392a5",
      "author": "Luckyzzzz",
      "body": "I worry I'm going to negatively affect my kid bc of my eating disorder. I know I have said things about watching what I eat and counting calories and working out even though I hate the gym. I'm really grateful that he's a boy, not that cis males can't develop EDs but we all know the pressures on girls and boys are different. And he's naturally stick skinny like his dad, so I know he's not battling negative comments from his peers. But even though I do my best to hide my disordered thinking about my body and about food, I'm know I've let so much slip. I just don't want him to hate me for something I already hate myself for when he grows up. 😞",
      "created_utc": 1712272104.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky3mu9r",
      "author": "toucansam0384",
      "body": "Well I wouldn't say my parents gave me my eating disorder but my mom was an alcoholic and I have her addictive tendencies. My mom also constantly complained about her weight and the only meal I ever saw her eat was dinner. She drank plenty of beer though. And diet Pepsi. I think she also said stuff to me, like \"put jelly on your pancakes, it's healthier than syrup\" and shit like that that fueled my disorder. Note: my mom has been dead almost five years now and unfortunately I still remember very clearly a lot of the trauma I went thru as a kid.",
      "created_utc": 1712277370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky3ynwb",
      "author": "flridathng",
      "body": "similar for me but not as extreme. my mom put me on a diet at 6 years old because i was \"getting chubby from school lunches\". from then on i was only allowed to eat \"healthy\" with the exception of once a week treats. she herself was also obsessed with different diets and would always encourage me to do them with her. bone broth diets, keto, etc, she would force me to run on the elliptical. then was disgusted when she found out i was purging. yelled at me for wasting food and shit like that. we have a good relationship now that i've moved out",
      "created_utc": 1712282043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky41k78",
      "author": "Pawsywawsy3",
      "body": "I don’t eat breakfast because I have meds that can’t be eaten two hours before or after. I know my 11 year old is watching and inquisitive.",
      "created_utc": 1712283222.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky4568q",
      "author": "None",
      "body": "Oh my god, I relate so much  \nMy parents literally shame me if I eat before 6 or so at night. Like yesterday they shamed me because I made breakfast (scrambled eggs) at like, 9 AM. They're like saying \"WE don't eat til dinner... WE don't need it... You need to do the same...\" Even with healthy foods. Not just like if I eat ice cream or something.. I feel ashamed to eat and just wanna vomit every time I eat... Sometimes not even induced. Like the thought of not going to make myself sick, it makes me sick to leave it in my tummy. This is their doing... Like if it weren't for their impossible standards (nothing is ever good enough for them, never has been), shaming me for eating, not exercising \"enough.\" I hate them for it. They treat me awful anyway, but I still feel bad for hating them... Even if they \\*deserve\\* it for what they put me through.",
      "created_utc": 1712284731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky4epms",
      "author": "Comfortable-Shift-38",
      "body": "My mom has always been on the chubbier side (not necessarily fat though) and my dad spent a great deal of time and effort making it known that he thought she was horrifyingly fat. He always made comments about her weight (ever since they started dating). I even remember him making fun of her by pretending her panties were big enough to be a parachute when my brother and I were very young. It wasn’t all about her weight. It seemed to me that there was something wrong with everything she did and everything she was (from observing my dad). I wasn’t around to hear all of it. But my mom used me as her confidant, so I got to learn about all the slights, jibes, fights, etc. that I missed and how they tore her apart. There’s a lot more that plays into the dynamic, but the result was that I grew up believing that there’s no worse fate than to be fat. I think internalized the abuse and unhealth and contributed it all to the fact that my mom had a little extra weight on her.",
      "created_utc": 1712289067.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky58r6z",
      "author": "NighthawkUnicorn",
      "body": "My mother was always on a diet.  She used to yell at me when I got a snack, saying I was going to be \"as big as a house\".\n\nAdding to that, my brother was my biggest bully.  I started to hide food, eat in secret and hide the packaging, and eat really really fast so people wouldn't catch me.\n\nI'd then feel really guilty and make myself vomit.\n\nMy mother and my brother caused my BED, and that caused my bulimia.",
      "created_utc": 1712308150.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky5ae0o",
      "author": "Technical-Step-9888",
      "body": "My mother was certainly the overall cause of my ED. She used to call me \"Thunder Thighs\" when I was a little kid, and made me feel foolish for trying sports etc because I was bigger so it made me look stupid to try. She made it clear that everything in my life would be tied to my weight. I would be unemployable because no one would hire someone who was fat, I would never date because no one could really love a fat girl, and that any interaction I had which was not positive was directly linked to my weight. If I failed a test, I probably would have passed it if the teacher liked me more, but no one likes fat people etc. \n\nAll the while she was feeding me adult portions, and giving me no knowledge or skills to actually eat healthy. She was overweight and type 2 diabetic, and it is really clear looking back that if she had her way we would be going down together.\n\n She completely destroyed my self esteem/worth. By the time I was in my late teens early twenties I was so demoralized, and had no idea what to do to lose weight, I  started to binge/purge. That was 20 years ago now, but I still struggle with it every single day. \n\nIn the end I had to leave the country in my mid 20's and put in some serious boundaries in order to recover. I can only speak for myself, but I needed the separation in order to escape my mother projecting her own bullshit on to me. So much of what our parents do to us has nothing to do with us or our best interest. It can often be traced back to their own insecurities and feelings of inadequacy.\n\n In my experience no amount of talking to her helped, but that's not to say it wouldn't make a difference for someone else. \n\nI know you can't move out, but it might give you some freedom if you reframe it as \"I can't move out, yet\". Circumstances change and  you're going to leave one day. I wish someone had reminded me when I was young that nothing is permanent. That your parents are flawed, and you only think they know anything because you were/are a child. They are great, and they are also terrible in their own way. Just like every person. \n\nYour obviously old enough to know what's good for you, so focus on yourself. What you know to be true about recovery, and what your goals in life are. Tune them out the best you can when they don't support your healing, and just try and look to the future that you want.",
      "created_utc": 1712309338.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky7h68d",
      "author": "DummyBlueBunny",
      "body": "not my parents but my legal guardian , spending every day with her is hell , i was doing my best to recover from ana because i was able to get rid of bulimia for a while, she loves bullying me along with her husband if i ever gained a kilogram and make fun of my belly (i am at a healthy weight and m not much of a big eater i don't even like junk food) , so no matter how much i tried i still relapsed and it is worse this time cz i'm not binging , but she is forcing me to eat my whole plate (one meal a day gladly) and i will finish it in just 5 mins and purge it, if i ever felt like having a small dessert , it's also going to never end up in my stomach , i really hate what's going on",
      "created_utc": 1712341053.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky9andi",
      "author": "lunanicie",
      "body": "My mom really tried not to pass on the ED. She was a dietician and has been underweight her whole life, also an ultramarathon runner. Constantly incredibly food and body conscious. But, she knew the big things to do, and not do. There wasn’t much commenting on my weight and she always cooked healthy meals and even kept junk food around. \nBuuut, even doing everything right, seeing her model the eating disorder behavior, watching her have the anorexic struggles with herself, was enough that I got obsessed. It was always unspoken, she won’t admit it now even though she’s 20lbs underweight. It took me a very long time to realize those thoughts and feelings about weight weren’t coming from me",
      "created_utc": 1712364884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kyckgz7",
      "author": "No-Investigator-9218",
      "body": "I was anorexic from age 14-18, then started binge/purge from about age 20 to 23. I also used to “chew and spit” foods just to get the taste without actually getting the calories. My mom was always slim and fit (5 ft 4 inches, 120 pounds max) she exercised a lot and would mainly eat salads and eat/drink slim fast shakes and bars. I remember in grade school all the kids loved whenever they got my mom assigned as their chaperone for field trips and they would always tell her how beautiful she is, and she would say “oh no I’m so fat and ugly”. There was a time when she had gotten really mad at me and just screamed in my face “YOU ARE UGLY!” I still remember the day that I weighed myself right after she said that she thought she was fat and she only weighed 115 pounds and whenever I got on the scale I was 126 pounds at the same height. That bothered me a lot and I feel like something my mind kind of switched that day. I used to look at a lot of the high fashion, Vogue, Cosmo magazines, etc. as well. My ED started in freshman year of high school and it just spiraled out of control until I got to my lowest weight of 75 pounds ( I was on the varsity soccer team working out and running everyday and would eat half a bagel for breakfast and then just small amounts of soup broth and steamed veggies the rest of the day). at which point my pediatrician gave my parents the ultimatum to send me to an ED or she would have to contact CPS. My stepdad at the time was a hard-core Bible beater alcoholic and said that Jesus would heal me. Not following Monday. Cops showed up, knocking at our door and took me to the emergency room of Texas Children’s Hospital at which point I was admitted for the first time. I was in and out of the hospital for three times during my high school years.",
      "created_utc": 1712424297.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky2tuia",
      "author": "Nebion666",
      "body": "Oh my god your parents are awful im sorry.",
      "created_utc": 1712266667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky381fw",
      "author": "None",
      "body": "The ED vaguely came up but they have such a hard time understanding, they don't know how bad it is. Trying to talk about how harmful the things they have said always leads to how I'm too sensitive and kids these days can't hear anything bad. Adding in foods is hard because when they're not on my mum's pre-approved list eating is just a pain with all the comments and snarkiness. \n\nI do appreciate the tips though, I have honestly been trying so hard to find some coping mechanisms before this gets too out of hand",
      "created_utc": 1712271719.0,
      "score": 7,
      "context": [
        {
          "id": "ky1gydk",
          "author": "ThestralBreeder",
          "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
          "created_utc": 1712251048.0
        }
      ]
    },
    {
      "id": "ky2do36",
      "author": "Local_Wrangler1335",
      "body": "I have almost the exact same story as yours!! My mum has been on diets for years, but she never commented on me before I was like 14 years old. I had the healthiest relationship to food and my body as a child, I ate whatever I wanted and was active for the purpose of having fun. But then I got depressed because I lost a family member, so I put on a bit of weight 2 years ago, and she commented on it a lot and even compared me to my step sister - so I decided to go on a healthy little diet and boom. Within the matter of months I lost a shit ton of weight, developed bulimia and my weight dictates my day. Thanks mum.",
      "created_utc": 1712261494.0,
      "score": 7,
      "context": [
        {
          "id": "ky1urw1",
          "author": "MariaMisterios",
          "body": "My mom gave me my ED!! She has body dysmorphia and is skinny and always complaining about how much weight she's put on or rejoicing over how much she lost because of having diarrhea or whatever. When I was a kid I was a bit on the chubby side (now I can see I was not really fat or obese, just chubby) and she always commented on how my outfits made my rolls pop, so I had to use loose baggy clothes to avoid this, plus she made me feel like i was huge. To make things worse, her idea of nutrition was terrible, she served spaghetti with bread (carbs over carbs) or rice or a ton of carbs, and I had to finish the whole plate. so I ended up making myself sick in my bathroom after each meal. Later I was able to go to a nutritionist and my mom absolutely obsessed over the diet and she was the one strictly following it. She recently got really sick because of a gut bacteria problem and was almost hospitalized because of unyielding diarrhea for a month, she lost 5 kg and she was over the moon because of how much weight she lost. \n\nDon't we all get our EDs from our parents?",
          "created_utc": 1712255530.0
        }
      ]
    },
    {
      "id": "ky37k6e",
      "author": "None",
      "body": "Thank you for this comment, honestly. For my dad, it is definitely an eating disorder. Type 2 diabetes runs in the family and watching him basically dedicate his life to staying active and watching what he eats just to still get it, it's sad. My mother has a huge fear of foods she doesn't understand. Takes us an hour to shop because she's looking at the ingredients and if there's one she can't pronounce it goes out of the cart. I've tried the whole focus on yourself thing but it only leads to fights because my mother gets so worried she starts screaming for everything and then everyone is miserable. Miserable to the point of it not being worth it.",
      "created_utc": 1712271540.0,
      "score": 3,
      "context": [
        {
          "id": "ky2yb9t",
          "author": "littleT_mon",
          "body": "Wow. I’ve never been so triggered by other peoples parents. I mean, it sounds like they have full blown eating disorders themselves. That must be horrific to be around. You need to get out. I could never heal when I lived with my mum. Or if you can’t move, you’ve got to be so 100% on your recovery. Literally put blinders on, keep reminding yourself that your parents opinions are not fact, they are damaging and they will not be the medicine for you to heal. Do not listen to your parents. I find it helps thinking of them as kids. They are just big wounded children playing out the traumas they’ve picked up and trying to pass it on to you. Your job on this earth is to be a cycle breaker. To not let this behaviour pass on to other generations. Please know your parents are not the norm and for you to get out of this, you must completely ignore what they say and trust in the power you have within you to be successful in your recovery and thriving as a human x",
          "created_utc": 1712268182.0
        }
      ]
    },
    {
      "id": "ky39ozx",
      "author": "None",
      "body": "I starkly remember excitingly showing my mum the new jeans I had bought with my friend. My mother grabs the waistband of my jeans and says \"these fit perfectly. You need to buy at least two sizes up because with the way you eat, you're not going to fit into this by summer.\" Right in front of my best friend. I called her out for fatshaming and for the rest of the goddamn month I couldn't get away from \"my own daughter thinks I'm fatshaming her. She can't handle any honesty I have to tiptoe around her.\" I get how embarrassing it feels to have your mum make comments in public. Here's to hoping we heal girlie 🤞",
      "created_utc": 1712272343.0,
      "score": 3,
      "context": [
        {
          "id": "ky23yt1",
          "author": "Quintilyn",
          "body": "You’re totally not alone with this… my mum definitely pushed me over the edge. When I was younger I used to be chubbier and my family all made comments about it, but mostly my mum. She would put me on all sorts of diets and make mean comments about my weight and body :// at one point it just became too much and I developed anorexia and bulimia and became underweight and miserable then that became too much again for her\n\nOne of the requirements for me moving out was that I “fixed myself” and on the surface it seemed like it, but now I’m in and endless binge and purge cycle and I cant talk to them about it because they will send me staright home",
          "created_utc": 1712258461.0
        }
      ]
    },
    {
      "id": "ky28j9x",
      "author": "DaniDutchi",
      "body": "Do we have the same mom?",
      "created_utc": 1712259899.0,
      "score": 2,
      "context": [
        {
          "id": "ky23yt1",
          "author": "Quintilyn",
          "body": "You’re totally not alone with this… my mum definitely pushed me over the edge. When I was younger I used to be chubbier and my family all made comments about it, but mostly my mum. She would put me on all sorts of diets and make mean comments about my weight and body :// at one point it just became too much and I developed anorexia and bulimia and became underweight and miserable then that became too much again for her\n\nOne of the requirements for me moving out was that I “fixed myself” and on the surface it seemed like it, but now I’m in and endless binge and purge cycle and I cant talk to them about it because they will send me staright home",
          "created_utc": 1712258461.0
        }
      ]
    },
    {
      "id": "kyaxzor",
      "author": "toucansam0384",
      "body": "Wtf.....God that's awful. I'm sorry.",
      "created_utc": 1712398559.0,
      "score": 2,
      "context": [
        {
          "id": "ky3nurm",
          "author": "None",
          "body": "Not my mom, but my grandma gave me Ozempic as my 16th birthday gift, and told me everybody could see my “rolls” in my bikini, I was 8. parents definitely contribute more than they think.",
          "created_utc": 1712277763.0
        }
      ]
    },
    {
      "id": "ky3amfl",
      "author": "None",
      "body": "From a kid who has a mum like this - make sure he knows that you know what you say is wrong but you can't help it. Don't restrict his eating, Don't stress about his food too much and keep calm. Don't beat yourself up about the way every self deprecating comment can be misconstrued. Actions speak louder than words - show him you want to encourage healthy behaviour by giving him the food freedom you never gave yourself. If/when he's old enough tell him about what you're going through so he knows to take what you say with a pinch of salt. And most importantly - remember you are a strong mum. You absolutely have the power to do this - I really believe in you. Your concern shows how much you want this. Keep going, I'm sure you will raise a wonderful son 😊😊",
      "created_utc": 1712272692.0,
      "score": 3,
      "context": [
        {
          "id": "ky392a5",
          "author": "Luckyzzzz",
          "body": "I worry I'm going to negatively affect my kid bc of my eating disorder. I know I have said things about watching what I eat and counting calories and working out even though I hate the gym. I'm really grateful that he's a boy, not that cis males can't develop EDs but we all know the pressures on girls and boys are different. And he's naturally stick skinny like his dad, so I know he's not battling negative comments from his peers. But even though I do my best to hide my disordered thinking about my body and about food, I'm know I've let so much slip. I just don't want him to hate me for something I already hate myself for when he grows up. 😞",
          "created_utc": 1712272104.0
        }
      ]
    },
    {
      "id": "kyaej2d",
      "author": "DaniDutchi",
      "body": "I already posted my experience but reading yours made me realize I missed some things. My mom also told me I would be unemployable and no man would love me if I was overweight. And the thing I recognize as well is that our moms had no idea what they were doing. I was given adult sizes as well and she still has no idea which is so frustrating for example she doesn’t eat fruit because of the sugar in it?? She’s on keto now and makes the worst food choices which sometimes make me sick when she tells me how she eats (like dirty keto and she is still very overweight). Moved out in 2019 and we will heal 🫶🏼",
      "created_utc": 1712384442.0,
      "score": 1,
      "context": [
        {
          "id": "ky5ae0o",
          "author": "Technical-Step-9888",
          "body": "My mother was certainly the overall cause of my ED. She used to call me \"Thunder Thighs\" when I was a little kid, and made me feel foolish for trying sports etc because I was bigger so it made me look stupid to try. She made it clear that everything in my life would be tied to my weight. I would be unemployable because no one would hire someone who was fat, I would never date because no one could really love a fat girl, and that any interaction I had which was not positive was directly linked to my weight. If I failed a test, I probably would have passed it if the teacher liked me more, but no one likes fat people etc. \n\nAll the while she was feeding me adult portions, and giving me no knowledge or skills to actually eat healthy. She was overweight and type 2 diabetic, and it is really clear looking back that if she had her way we would be going down together.\n\n She completely destroyed my self esteem/worth. By the time I was in my late teens early twenties I was so demoralized, and had no idea what to do to lose weight, I  started to binge/purge. That was 20 years ago now, but I still struggle with it every single day. \n\nIn the end I had to leave the country in my mid 20's and put in some serious boundaries in order to recover. I can only speak for myself, but I needed the separation in order to escape my mother projecting her own bullshit on to me. So much of what our parents do to us has nothing to do with us or our best interest. It can often be traced back to their own insecurities and feelings of inadequacy.\n\n In my experience no amount of talking to her helped, but that's not to say it wouldn't make a difference for someone else. \n\nI know you can't move out, but it might give you some freedom if you reframe it as \"I can't move out, yet\". Circumstances change and  you're going to leave one day. I wish someone had reminded me when I was young that nothing is permanent. That your parents are flawed, and you only think they know anything because you were/are a child. They are great, and they are also terrible in their own way. Just like every person. \n\nYour obviously old enough to know what's good for you, so focus on yourself. What you know to be true about recovery, and what your goals in life are. Tune them out the best you can when they don't support your healing, and just try and look to the future that you want.",
          "created_utc": 1712309338.0
        }
      ]
    },
    {
      "id": "ky38jdu",
      "author": "ThestralBreeder",
      "body": "I’m not sure what your age is, but could you seek counseling at your school or family therapy or some kind? My parents still make, frankly, insane comments about food and weight, but cognitive behavioral therapy helped me a great deal! And journaling too. I’m really sorry that they behave this way when you are trying to get better.",
      "created_utc": 1712271907.0,
      "score": 2,
      "context": [
        {
          "id": "ky1gydk",
          "author": "ThestralBreeder",
          "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
          "created_utc": 1712251048.0
        },
        {
          "id": "ky381fw",
          "author": "None",
          "body": "The ED vaguely came up but they have such a hard time understanding, they don't know how bad it is. Trying to talk about how harmful the things they have said always leads to how I'm too sensitive and kids these days can't hear anything bad. Adding in foods is hard because when they're not on my mum's pre-approved list eating is just a pain with all the comments and snarkiness. \n\nI do appreciate the tips though, I have honestly been trying so hard to find some coping mechanisms before this gets too out of hand",
          "created_utc": 1712271719.0
        }
      ]
    },
    {
      "id": "ky45i93",
      "author": "siberianchick",
      "body": "Could be because they have their own eating disorders to an extent. They don’t sound normal at all either. I’m not surprised you never learned to have a healthy relationship with food when your family treats it like an enemy!!!",
      "created_utc": 1712284872.0,
      "score": 2,
      "context": [
        {
          "id": "ky1gydk",
          "author": "ThestralBreeder",
          "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
          "created_utc": 1712251048.0
        },
        {
          "id": "ky381fw",
          "author": "None",
          "body": "The ED vaguely came up but they have such a hard time understanding, they don't know how bad it is. Trying to talk about how harmful the things they have said always leads to how I'm too sensitive and kids these days can't hear anything bad. Adding in foods is hard because when they're not on my mum's pre-approved list eating is just a pain with all the comments and snarkiness. \n\nI do appreciate the tips though, I have honestly been trying so hard to find some coping mechanisms before this gets too out of hand",
          "created_utc": 1712271719.0
        }
      ]
    },
    {
      "id": "ky3dnxj",
      "author": "Luckyzzzz",
      "body": "No, I never say anything to him about his food. He's has to eat his veggies at dinner, but I also let him have pizza rolls and snack cakes in his lunch. He's allowed to eat whatever he wants and I'm always offering him snacks and drinks. I have had conversations with him about my eating. He's 9yo, and when he was 8 he asked me why I didnt eat dinner with him at night and that's really what pushed me into quasi-recovery and harm reduction. I had mostly struggled with veryyy heavy restriction, I only occasionally b/p. But now I eat throughout the day. I always have dinner at the table with him. I eat a couple cookies when we bake together. I still count my calories and I know I still have some disordered eating, but I'm so much happier. And I've been pretty upfront, for a 9yo, about the fact that mommy wasn't eating right and that I'm eating better now and that he doesn't need to worry about food. I don't know if I'm doing it right or wrong. I know he's young and I don't want to put too many grown-up burdens on him. But he was smart enough to notice my food intake was wrong and so I feel like he's smart enough for me to be open with him to an extent.",
      "created_utc": 1712273841.0,
      "score": 3,
      "context": [
        {
          "id": "ky392a5",
          "author": "Luckyzzzz",
          "body": "I worry I'm going to negatively affect my kid bc of my eating disorder. I know I have said things about watching what I eat and counting calories and working out even though I hate the gym. I'm really grateful that he's a boy, not that cis males can't develop EDs but we all know the pressures on girls and boys are different. And he's naturally stick skinny like his dad, so I know he's not battling negative comments from his peers. But even though I do my best to hide my disordered thinking about my body and about food, I'm know I've let so much slip. I just don't want him to hate me for something I already hate myself for when he grows up. 😞",
          "created_utc": 1712272104.0
        },
        {
          "id": "ky3amfl",
          "author": "None",
          "body": "From a kid who has a mum like this - make sure he knows that you know what you say is wrong but you can't help it. Don't restrict his eating, Don't stress about his food too much and keep calm. Don't beat yourself up about the way every self deprecating comment can be misconstrued. Actions speak louder than words - show him you want to encourage healthy behaviour by giving him the food freedom you never gave yourself. If/when he's old enough tell him about what you're going through so he knows to take what you say with a pinch of salt. And most importantly - remember you are a strong mum. You absolutely have the power to do this - I really believe in you. Your concern shows how much you want this. Keep going, I'm sure you will raise a wonderful son 😊😊",
          "created_utc": 1712272692.0
        }
      ]
    },
    {
      "id": "ky3b77k",
      "author": "None",
      "body": "I've exhausted all my options at this point. The school counsellor tattled to my mum which led to probably the most difficult fight of my entire life. I had a therapist when I was younger but apparently (this is what my mum told me) they said I didn't have enough problems and they were too busy with other clients to help me. I was a kid and terrible at expressing myself, now I would like nothing more than to be rich enough to cry in a therapist's arms because there is so much to unpack. I've never tried CBT, did you start after you moved out?",
      "created_utc": 1712272907.0,
      "score": 6,
      "context": [
        {
          "id": "ky1gydk",
          "author": "ThestralBreeder",
          "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
          "created_utc": 1712251048.0
        },
        {
          "id": "ky381fw",
          "author": "None",
          "body": "The ED vaguely came up but they have such a hard time understanding, they don't know how bad it is. Trying to talk about how harmful the things they have said always leads to how I'm too sensitive and kids these days can't hear anything bad. Adding in foods is hard because when they're not on my mum's pre-approved list eating is just a pain with all the comments and snarkiness. \n\nI do appreciate the tips though, I have honestly been trying so hard to find some coping mechanisms before this gets too out of hand",
          "created_utc": 1712271719.0
        },
        {
          "id": "ky38jdu",
          "author": "ThestralBreeder",
          "body": "I’m not sure what your age is, but could you seek counseling at your school or family therapy or some kind? My parents still make, frankly, insane comments about food and weight, but cognitive behavioral therapy helped me a great deal! And journaling too. I’m really sorry that they behave this way when you are trying to get better.",
          "created_utc": 1712271907.0
        }
      ]
    },
    {
      "id": "kyghi35",
      "author": "RainbowTowers9",
      "body": "Thank you for sharing this. It’s given me so much inspiration. I am in the same position with a 6 year old boy. It’s always been in my mind that he is going to ask why I don’t have dinner with him soon. I am trying so hard to sit down and have something with him even if it’s not the same just to acknowledge a space for dinner together. I have managed to add in breakfast successfully but we don’t always manage it together on school days when it’s such a rush to get out. Reading your experience is so reassuring.",
      "created_utc": 1712490873.0,
      "score": 1,
      "context": [
        {
          "id": "ky392a5",
          "author": "Luckyzzzz",
          "body": "I worry I'm going to negatively affect my kid bc of my eating disorder. I know I have said things about watching what I eat and counting calories and working out even though I hate the gym. I'm really grateful that he's a boy, not that cis males can't develop EDs but we all know the pressures on girls and boys are different. And he's naturally stick skinny like his dad, so I know he's not battling negative comments from his peers. But even though I do my best to hide my disordered thinking about my body and about food, I'm know I've let so much slip. I just don't want him to hate me for something I already hate myself for when he grows up. 😞",
          "created_utc": 1712272104.0
        },
        {
          "id": "ky3amfl",
          "author": "None",
          "body": "From a kid who has a mum like this - make sure he knows that you know what you say is wrong but you can't help it. Don't restrict his eating, Don't stress about his food too much and keep calm. Don't beat yourself up about the way every self deprecating comment can be misconstrued. Actions speak louder than words - show him you want to encourage healthy behaviour by giving him the food freedom you never gave yourself. If/when he's old enough tell him about what you're going through so he knows to take what you say with a pinch of salt. And most importantly - remember you are a strong mum. You absolutely have the power to do this - I really believe in you. Your concern shows how much you want this. Keep going, I'm sure you will raise a wonderful son 😊😊",
          "created_utc": 1712272692.0
        },
        {
          "id": "ky3dnxj",
          "author": "Luckyzzzz",
          "body": "No, I never say anything to him about his food. He's has to eat his veggies at dinner, but I also let him have pizza rolls and snack cakes in his lunch. He's allowed to eat whatever he wants and I'm always offering him snacks and drinks. I have had conversations with him about my eating. He's 9yo, and when he was 8 he asked me why I didnt eat dinner with him at night and that's really what pushed me into quasi-recovery and harm reduction. I had mostly struggled with veryyy heavy restriction, I only occasionally b/p. But now I eat throughout the day. I always have dinner at the table with him. I eat a couple cookies when we bake together. I still count my calories and I know I still have some disordered eating, but I'm so much happier. And I've been pretty upfront, for a 9yo, about the fact that mommy wasn't eating right and that I'm eating better now and that he doesn't need to worry about food. I don't know if I'm doing it right or wrong. I know he's young and I don't want to put too many grown-up burdens on him. But he was smart enough to notice my food intake was wrong and so I feel like he's smart enough for me to be open with him to an extent.",
          "created_utc": 1712273841.0
        }
      ]
    },
    {
      "id": "ky3cbba",
      "author": "ThestralBreeder",
      "body": "I’m so sorry - your feelings are valid and your difficulties are worthy of therapy despite what your mom says. \n\nCognitive behavioral therapy is really helpful in addressing impulsive behavior, self destructive behavior and disordered thought patterns. I used this a LOT when I was still at home as a teen. While it’s ideal to follow along with an actually licensed person, there are a lot of CBT intro books online and worksheets. It can be really helpful in identifying triggers, figuring out what kind of thought you are having (catastrophizing, black & white thinking, assumptions based off of solely feelings vs trying to check back in with reality). I don’t have a specific book in mind, but this article is an accessible article on CBT unique to bulimia. \n\nhttps://complicated.life/blog/5-powerful-cognitive-behavioural-therapy-techniques-to-use-for-bulimia/?amp=1\n\nI promise you can get better. One day at a time. Even when you have setbacks, you are working forwards a happier version of yourself.",
      "created_utc": 1712273326.0,
      "score": 2,
      "context": [
        {
          "id": "ky1gydk",
          "author": "ThestralBreeder",
          "body": "Are your parents aware you have an eating disorder and that you are trying to recover? Or are they just…horrifying people? \n\nI feel that my parents 100% fueled my bulimia. They were divorced, and when I went to see my dad I had barely enough calories to live on and was constantly belittled for my weight and choices etc. Famine. \n\nThen I would go back to my moms house who would lavish me with treats and comfort food. Feast. \n\nAfter setting me up solidly for binge eating and bulimia, they then both went on the offensive that I was too fat. I completely feel your pain. I unfortunately was only able to truly heal when I was out of the house, but there were some things that did help me when I was living with them: \n\n- journaling, free prose no holding back etc. Talk about how what they say and how it makes you feel. \n\n- adding in foods and things vs taking them away:\nAdding in volume eating of things like kale in a delicious lemony and pecorino vinaigrette with some pine nuts, baking cabbage, baking leeks shallots and cauliflower etc. Roasting veggies has changed my life honestly - the extra fiber also helped curb some of my cravings and they are so so much better when prepared in a bountiful way, vs in a “diet” way. \n\nApples and fruits readily available, having the individual packs of Barney butter (almond butter)\n\nAdding in a 10 minute walk when I’m feeling triggered and mentally telling myself - “if you still feel like binging after this walk you can.” It can take that little time to reset. \n\nWorking with a nutritionist was helpful, but can also be challenging if the goal is weight loss Vs Bulimia recovery. For me I tried slightly modified intuitive eating, which did come with initial weight gain, but then lost a lot of my extra weight from binge eating. \n\nI hope none of these tips feel unhelpful, but they were just some small things that worked when I had less control over my family situation.",
          "created_utc": 1712251048.0
        },
        {
          "id": "ky381fw",
          "author": "None",
          "body": "The ED vaguely came up but they have such a hard time understanding, they don't know how bad it is. Trying to talk about how harmful the things they have said always leads to how I'm too sensitive and kids these days can't hear anything bad. Adding in foods is hard because when they're not on my mum's pre-approved list eating is just a pain with all the comments and snarkiness. \n\nI do appreciate the tips though, I have honestly been trying so hard to find some coping mechanisms before this gets too out of hand",
          "created_utc": 1712271719.0
        },
        {
          "id": "ky38jdu",
          "author": "ThestralBreeder",
          "body": "I’m not sure what your age is, but could you seek counseling at your school or family therapy or some kind? My parents still make, frankly, insane comments about food and weight, but cognitive behavioral therapy helped me a great deal! And journaling too. I’m really sorry that they behave this way when you are trying to get better.",
          "created_utc": 1712271907.0
        },
        {
          "id": "ky3b77k",
          "author": "None",
          "body": "I've exhausted all my options at this point. The school counsellor tattled to my mum which led to probably the most difficult fight of my entire life. I had a therapist when I was younger but apparently (this is what my mum told me) they said I didn't have enough problems and they were too busy with other clients to help me. I was a kid and terrible at expressing myself, now I would like nothing more than to be rich enough to cry in a therapist's arms because there is so much to unpack. I've never tried CBT, did you start after you moved out?",
          "created_utc": 1712272907.0
        }
      ]
    }
  ]
}