{
  "id": "1bwnw3c",
  "subreddit": "bulimia",
  "author": "Impressive-Arm-6884",
  "created_utc": 1712338249.0,
  "title": "I’ve never met a bulimic ",
  "selftext": "In my whole life I’ve met people who have anorexia and binge eating disorder but I’ve never met anyone who I knew was a bulimic. I’m sure I have met some people who were, but there was just no way of me knowing. That’s literally so scary that it’s so difficult to tell if someone has it. I always see bulimics online. There’s this woman that I follow on TikTok who obviously has bulimia and she has literally said it herself. But still, so many people in her comment section are literally clueless. They try to come up with any explanation to the behavior that she’s doing. I literally saw a fat phobic comment about how everyone who is saying she has an eating disorder is just trying to cope with being fat. Like, she is literally binge eating and posting it for everyone to see. She is very underweight. It is so obvious as to what she is doing. It’s like everyone is in denial about bulimics. I don’t understand why it’s so taboo when it’s such a common disorder. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1bwnw3c/ive_never_met_a_bulimic/",
  "score": 119,
  "num_comments": 57,
  "comments": [
    {
      "id": "ky7e57u",
      "author": "None",
      "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
      "created_utc": 1712340038.0,
      "score": 152,
      "context": []
    },
    {
      "id": "ky7fj2h",
      "author": "StockReporter5",
      "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
      "created_utc": 1712340501.0,
      "score": 100,
      "context": []
    },
    {
      "id": "ky82z7g",
      "author": "SpaghettiLoveee",
      "body": "Most people react in disgust when you tell them you have bulimia. Especially when you’re bulimic at a normal or high BMI. There is no concern, just digust and you’re a weirdo. So why tell anybody?",
      "created_utc": 1712348448.0,
      "score": 59,
      "context": []
    },
    {
      "id": "ky7nju0",
      "author": "None",
      "body": "Hi, I'm a bulimic. Nice to meet you <3",
      "created_utc": 1712343190.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ky7xruv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712346669.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ky8it9v",
      "author": "None",
      "body": "I'm bulimic (have suffered with many other ED's in the past, but it's my main problem) and I think it's because it lives in the nastiest amount of secrecy, compared to other ED's. It's like an addict at a stage of addiction where they're desperately trying to hide their substance the most. It's probably the most shameful considering the lengths and the extent it could get to.",
      "created_utc": 1712354006.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ky8jsdj",
      "author": "AdFantastic5292",
      "body": "I think also a lot of people think bulimia is throwing up your meals etc, and don’t know about the binging part ",
      "created_utc": 1712354361.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ky8p8tj",
      "author": "texaselysiumBlue582",
      "body": "bulimia is probably one of the most shameful mental illnesses. To the general public, the binging is seen as gluttonous, and the purging is seen as gross and wasteful. it's horrifying to admit to oneself, much less to someone who might have a negative reaction to you/your illness (and whose opinion you probably care about and respect). I've never admitted my bulimia to anyone, even when I was throwing up several times a day; the furthest I've gone was to vaguely refer to \"eating issues.\" I've only just begun to think about seeking professional help for my eating issues after years of trying to manage the symptoms on my own, self medicating with substances, and hiding it in different ways.",
      "created_utc": 1712356415.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ky7xi7o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712346580.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ky8jsu7",
      "author": "toucansam0384",
      "body": "Well if you want to know a bulimic you've come to the right place. It's not as embarrassing to say I starve myself versus I eat massive amounts of food and puke it up.",
      "created_utc": 1712354366.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ky82qi8",
      "author": "None",
      "body": "Twenty years later, I’m only starting to talk about it with my family. I’ve never met someone like me, that I know of. I’m embarrassed. When my SO’s learned found out about it one made fun of me another said I was wasting money. It seems people wait to listen, or try to watch more closely. It makes it a worse feeling for me.",
      "created_utc": 1712348365.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ky9yqar",
      "author": "Goodbyekyle_",
      "body": "it’s a very shameful disease. i’m quite the open book when it comes to mental health, since i have dealt with many struggles. however, bulimia is the one thing i refuse to admit to. i don’t know what it is, it just feels so disgraceful and disgusting to admit to, for me.",
      "created_utc": 1712375313.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ky8efi5",
      "author": "Kariatide",
      "body": "It think the “loss of control” idea which is associated with it is very stigmatized. \n\nAlso the purging side of it. The physical act in itself \n\nI admit sometimes I dedicate myself to focus on people’s hands (on tv, at work , at my personal life) to see if anyone else has Russel’s signs :(",
      "created_utc": 1712352428.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ky8flcz",
      "author": "Friedsurimi",
      "body": "Stigma 110%, it’s an eating disorder that causes you more shame and makes you more shameful than anorexia and BED and other glamorized/pitiful eating disorders. I mean, not only you are “disgusting because you eat too much, spend all your money on food and you can’t contain yourself” but you’re also “an ungrateful wasteful rich bitch because you purge it all away, wasting resources that others could’ve eaten and making people who cooked sad and angry”. I mean how are you going to argue against that? You feel ashamed, you feel a burden, you’re not thin and worthy of care like anorexic people, for like orthorexics and you’re not obese and worthy of pity like BEDs people etc. you’re stuck in the middle, too normal to feel valid, never ill enough and worthy of not feeling shameful in your own eyes and in the eyes of the others.\n\nI hate this illness.",
      "created_utc": 1712352843.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ky8edtz",
      "author": "fireflashthirteen",
      "body": "Yeah I had a reality check the other day when a friend, who knows I'm bulimic, decided it would be a good idea to seriously assert that I didn't have a choice but to eat their birthday cake (party is today) and that they'd get upset if I didn't, when they know that sort of stuff is not considered a safe food for me. The lesson I took from this was a reminder that:\n\na) Mental health education is not where it should be;  \nb) Bulimia is portrayed as a butt of the joke/insult behaviour pattern in which people choose to throw up their food, and;  \nc) Normies will not understand your eating disorder, no matter what you tell them, until they have something equivalent (i.e., an addictive behaviour disorder).",
      "created_utc": 1712352412.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ky940al",
      "author": "Forgotmyusername8910",
      "body": "I think a lot of people just don’t know.\n\nI know quite a few. And I am sure that most people in their everyday lives have no idea.",
      "created_utc": 1712362224.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ky9ffg6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712366847.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ky99ulm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712364563.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky9gldn",
      "author": "cherryribs",
      "body": "Me neither actually. Now that I think about it. Even on the clock app, most of the people with eds who admit it are usually anorexic or have BED.",
      "created_utc": 1712367325.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kybisij",
      "author": "BradleyNowellLives",
      "body": "I’m bulimic at a normal BMI and never tell people because I know that that’s what they’ll think. That I should be skinnier if I’m claiming that. AWWWFFUULL feeling that leads to awful dysmorphia.",
      "created_utc": 1712410175.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ky9wvar",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1712374424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyasg9o",
      "author": "BpdBabe19",
      "body": "I did a lot tbh. It's way more common than ppl realize but many ppl are in so much denial that they don't even admit it to themselves that they are sick. It's like with anorexia but if youre anorexic, \"sth changes\", you keep losing weight. When you are bulimic, that doesn't necessairly happen",
      "created_utc": 1712394421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyauw06",
      "author": "Prettyprincess_1998",
      "body": "I think one reason to why fewer people tell is because many people with bulimia isn’t super skinny. Many has a normal weight or is overweight. And that means that there are people who won’t believe you, who will say that you are lying because you are not skinny. Also the details of vomiting and using laxative can be pretty sensitive and hard to talk about. And also from my personal experience as a bulimic, I don’t want to tell anyone because I’m afraid that they might stop me. But also I’m afraid that I might trigger other people if I talk about it so I’d rather stay quiet",
      "created_utc": 1712396267.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyawhoc",
      "author": "CitrusCop",
      "body": "I am not diagnosed but I fit pretty much all the criteria so, hello, I probably would never tell you about my eating disorder even if we met at a doctors place or something like that… I have this idea that people think I will say it to get attention or people will look at me and say “i’m sure you don’t.”",
      "created_utc": 1712397469.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyb1dpb",
      "author": "cursed-core",
      "body": "You probably have and don't know it, because they didn't realise it themselves. I opened up to a friend about being bulimic with (exercise and lax purging) and she asked me \"is fasting after binges bulimia as well? like to cleanse from the food\" I told her yes and it looked like so many things just *clicked*.",
      "created_utc": 1712400961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyb5mpx",
      "author": "cafeorcaphe",
      "body": "IM HAVINF BULIMIC LOL, and it is embarrassing af 💀 if im struggling with anorexia then maybe i’ll admit if get asked",
      "created_utc": 1712403647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kybehi8",
      "author": "None",
      "body": "I mean you probably have met a few",
      "created_utc": 1712408232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kybfv0t",
      "author": "edthrowaway1290",
      "body": "if it helps a lot of people who say they have BED would actually fall under atypical bulimia because BED's diagnostic criteria forbids any compensatory behavior\n\nat least in the BED subreddit people will be talking about things like fasting all the time\n\ni think the binge restrict cycle is like micro bulimia",
      "created_utc": 1712408872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kybm468",
      "author": "fuxhead",
      "body": "Wife had bulimia, spent 1+3 months in rehab over 2 years and has come out the other side stronger (mentally and physically) than ever.  She was a shadow of the person she is now - she’s unstoppable. This disease is beatable - if you’re ready to stop - seek professional help, don’t be afraid of inpatient care - it’s literally their job to help you get better. \n\nRegarding not knowing anyone with it, you’d be surprised - now I know what to look for (specifically swollen lower jaw + unhealthy skinny) I see  it all the time. It’s sad knowing the challenges you are all going through. But there is hope, if you’re ready and want to get better - there are people who can help you. \n\nTalk to your dr, investigate private health care, prepare yourselves because it’s hard - but the best things in life are hard. That’s why they exist. \n\nGood luck to you all on your journeys.",
      "created_utc": 1712411594.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyde9a7",
      "author": "cyntheticwaves",
      "body": "idk, i guess mia has always been the ugliest sister of the eds",
      "created_utc": 1712435170.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyfevuu",
      "author": "SassyApple55",
      "body": " r u talking about chiara",
      "created_utc": 1712465236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kymctis",
      "author": "Due-Egg-8460",
      "body": "I mean this with all respect but it's bc the shit it makes you do is honestly laughable. Like why was I a 16 year old begging my parents to get an Enema for my birthday.",
      "created_utc": 1712585501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyvdy12",
      "author": "purrriodd",
      "body": "I had a doctor say I could starve myself as long as I stopped throwing up which made me feel so much shame.",
      "created_utc": 1712719045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzzoq9t",
      "author": "ConsiderationOk2119",
      "body": "Just curious, is anyone trying to figure out if someone in their life is making themselves throw up or if they're actually sick? Here's a clue. Do they come out of the bathroom (after you've heard them throwing up) with a sleeve pushed up because maybe their hand has been down their throat? I've had weight loss surgery, and sometimes I actually seem to forget (after 11 years🤷‍♀️, clearly I'm still a bit of an emotional eater at times, honestly) that my stomach pouch is the size of a banana now and not a football, and I eat a little more than I should, and the only way to feel better is to just get some back out. So yes, this happens sometimes. But my partner doesn't get that. \"Did you just throw up,\" he asks. \"Yeah, I think I just ate too much,\" I say. But I'm always careful to pull my sleeve back down before I leave the bathroom. I've never said this out loud before or typed it publicly as such. If you notice this happening to your person, talk to them, and do it in a loving, helpful way, not in an accusing way, because that does tend to be his tone when he does ask that question, which makes me even more reluctant to share this with him. Look after the people you love!",
      "created_utc": 1733115106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky8sj43",
      "author": "tuilark",
      "body": "a lot of people just don't know, either. i'm open and have told people and have often been met with 'what is that'. given that i'm bulimic via vomiting purging, it's a bit brutal to have to explain that i eat for a family of four then go and chuck it all up. anorexia and BED are just more 'well understood' by the general public, if that makes sense",
      "created_utc": 1712357689.0,
      "score": 34,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "ky7mjyp",
      "author": "rrrachel_rocks",
      "body": "💯 💯 and when folks start calling it by its name and speaking about experiences, hopefully the stigma fades.",
      "created_utc": 1712342856.0,
      "score": 15,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "ky8wj43",
      "author": "Nebion666",
      "body": "This. Its a lot harder for me to speak aloud about bulimia than anorexia.",
      "created_utc": 1712359248.0,
      "score": 13,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "ky9blny",
      "author": "-Jambie-",
      "body": "وstill actively use the words 'I have disordered eating'....,\n\nheh, it's all the foods fault not mine...\n\nBut yeah, ppl don't like to think about us fist fucking our throats....",
      "created_utc": 1712365266.0,
      "score": 12,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "kyareph",
      "author": "THESASAS",
      "body": "I absolutely could not agree with this comment more. And some people will look at me as “normal weight” I guess and be like “oh but you don’t look unwell.” \nOk hun 😞",
      "created_utc": 1712393636.0,
      "score": 6,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "kya65j6",
      "author": "None",
      "body": "Dude same.",
      "created_utc": 1712379242.0,
      "score": 2,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        }
      ]
    },
    {
      "id": "ky7nfcg",
      "author": "None",
      "body": "Yes. It doesn’t matter “why”, I’m binge eating thousands and thousands of calories (and pounds) of food with the deliberate intention of making myself vomit it back up again. There’s shame in that",
      "created_utc": 1712343148.0,
      "score": 36,
      "context": [
        {
          "id": "ky7fj2h",
          "author": "StockReporter5",
          "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
          "created_utc": 1712340501.0
        }
      ]
    },
    {
      "id": "kyb6jai",
      "author": "you_enjoy_my_yoga",
      "body": "This is why I never share what I have, just that I have an ED. A lot of my friends are very environmentally conscious and I know they would judge me for being so wasteful.",
      "created_utc": 1712404165.0,
      "score": 9,
      "context": [
        {
          "id": "ky7fj2h",
          "author": "StockReporter5",
          "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
          "created_utc": 1712340501.0
        }
      ]
    },
    {
      "id": "kyan02s",
      "author": "Naite_",
      "body": "I'm so sorry you're going through all this, and I know the feelings of shame and insecurity and not feeling taken seriously about your struggles is really awful!\n\nI don't mean to take away from what you're saying, but as another previous anorexic/now bulimic, I just want to say that I never looked at other people thinking \"I would rather die than look like that\". I said that in the mirror plenty of times, but I always thought other people, especially beautiful, confident people at any weight living their best life with no eating disorder, were a lot more beautiful than myself. \n\nAll eating disorders are hell on earth, and they all have their own specific struggles, but they are rarely about judging other people for their weight, and instead all about judging and controlling yourself, and all of us with these disorders are suffering. I hope you get the help and support you need!",
      "created_utc": 1712390362.0,
      "score": 5,
      "context": [
        {
          "id": "ky7xruv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1712346669.0
        }
      ]
    },
    {
      "id": "ky9dgya",
      "author": "Internal_Mountain725",
      "body": "100%",
      "created_utc": 1712366033.0,
      "score": 5,
      "context": [
        {
          "id": "ky8it9v",
          "author": "None",
          "body": "I'm bulimic (have suffered with many other ED's in the past, but it's my main problem) and I think it's because it lives in the nastiest amount of secrecy, compared to other ED's. It's like an addict at a stage of addiction where they're desperately trying to hide their substance the most. It's probably the most shameful considering the lengths and the extent it could get to.",
          "created_utc": 1712354006.0
        }
      ]
    },
    {
      "id": "kyargrh",
      "author": "THESASAS",
      "body": "Yep, or the other purging part; excessive laxative or enema abuse",
      "created_utc": 1712393680.0,
      "score": 6,
      "context": [
        {
          "id": "ky8jsdj",
          "author": "AdFantastic5292",
          "body": "I think also a lot of people think bulimia is throwing up your meals etc, and don’t know about the binging part ",
          "created_utc": 1712354361.0
        }
      ]
    },
    {
      "id": "ky8wlla",
      "author": "Impressive-Arm-6884",
      "body": "I agree with you. I have a relative who allegedly has bulimia or some type of purging disorder. I don’t think he binges I think he just purges normal amounts of food. And when my uncle and dad found out he could possibly be doing that, they shitted on him so bad and hate him to this day because of it. It makes me terrified of my family finding out.",
      "created_utc": 1712359276.0,
      "score": 8,
      "context": [
        {
          "id": "ky8p8tj",
          "author": "texaselysiumBlue582",
          "body": "bulimia is probably one of the most shameful mental illnesses. To the general public, the binging is seen as gluttonous, and the purging is seen as gross and wasteful. it's horrifying to admit to oneself, much less to someone who might have a negative reaction to you/your illness (and whose opinion you probably care about and respect). I've never admitted my bulimia to anyone, even when I was throwing up several times a day; the furthest I've gone was to vaguely refer to \"eating issues.\" I've only just begun to think about seeking professional help for my eating issues after years of trying to manage the symptoms on my own, self medicating with substances, and hiding it in different ways.",
          "created_utc": 1712356415.0
        }
      ]
    },
    {
      "id": "kycjhju",
      "author": "NoSquare4505",
      "body": "It’s not tht visible esp bc u get good at purging like u don’t need anything- ur body just pushes it out w/ muscles so the scars fade away but ur knuckle looks SLIGHTLY different u have to be in person to tell I don’t think u can do tht via television lol unless they zoom into it … they’re shape is also different slightly. U have to have had ED or know well of it to pick up and tell",
      "created_utc": 1712423947.0,
      "score": 1,
      "context": [
        {
          "id": "ky8efi5",
          "author": "Kariatide",
          "body": "It think the “loss of control” idea which is associated with it is very stigmatized. \n\nAlso the purging side of it. The physical act in itself \n\nI admit sometimes I dedicate myself to focus on people’s hands (on tv, at work , at my personal life) to see if anyone else has Russel’s signs :(",
          "created_utc": 1712352428.0
        }
      ]
    },
    {
      "id": "kyck43z",
      "author": "NoSquare4505",
      "body": "It’s not tht visible esp bc u get good at purging like u don’t need anything- ur body just pushes it out w/ muscles so the scars fade away but ur knuckle looks SLIGHTLY different u have to be in person to tell I don’t think u can do tht via television lol unless they zoom into it … they’re shape is also different slightly. U have to have had ED or know well of it to pick up and tell",
      "created_utc": 1712424171.0,
      "score": 1,
      "context": [
        {
          "id": "ky8efi5",
          "author": "Kariatide",
          "body": "It think the “loss of control” idea which is associated with it is very stigmatized. \n\nAlso the purging side of it. The physical act in itself \n\nI admit sometimes I dedicate myself to focus on people’s hands (on tv, at work , at my personal life) to see if anyone else has Russel’s signs :(",
          "created_utc": 1712352428.0
        }
      ]
    },
    {
      "id": "ky8k1t4",
      "author": "AdFantastic5292",
      "body": "With point c, you’re spot on. Describing it as a food addiction, similar to a drug addiction (and I have had both) can help get the message across. ",
      "created_utc": 1712354458.0,
      "score": 3,
      "context": [
        {
          "id": "ky8edtz",
          "author": "fireflashthirteen",
          "body": "Yeah I had a reality check the other day when a friend, who knows I'm bulimic, decided it would be a good idea to seriously assert that I didn't have a choice but to eat their birthday cake (party is today) and that they'd get upset if I didn't, when they know that sort of stuff is not considered a safe food for me. The lesson I took from this was a reminder that:\n\na) Mental health education is not where it should be;  \nb) Bulimia is portrayed as a butt of the joke/insult behaviour pattern in which people choose to throw up their food, and;  \nc) Normies will not understand your eating disorder, no matter what you tell them, until they have something equivalent (i.e., an addictive behaviour disorder).",
          "created_utc": 1712352412.0
        }
      ]
    },
    {
      "id": "ky9hpjj",
      "author": "Impressive-Arm-6884",
      "body": "No this is about >!onboou!<. Who’s Chiara?",
      "created_utc": 1712367784.0,
      "score": 1,
      "context": [
        {
          "id": "ky9ffg6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1712366847.0
        }
      ]
    },
    {
      "id": "ky9eifg",
      "author": "Impressive-Arm-6884",
      "body": "Yes I’m talking about that french woman. She’s not blonde anymore though",
      "created_utc": 1712366466.0,
      "score": 2,
      "context": [
        {
          "id": "ky99ulm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1712364563.0
        }
      ]
    },
    {
      "id": "ky9x3iv",
      "author": "bulimia-ModTeam",
      "body": "Being abusive or harassing other members",
      "created_utc": 1712374532.0,
      "score": 1,
      "context": [
        {
          "id": "ky9wvar",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1712374424.0
        }
      ]
    },
    {
      "id": "kyfez8n",
      "author": "Impressive-Arm-6884",
      "body": "No I’m talking about onboou",
      "created_utc": 1712465288.0,
      "score": 1,
      "context": [
        {
          "id": "kyfevuu",
          "author": "SassyApple55",
          "body": " r u talking about chiara",
          "created_utc": 1712465236.0
        }
      ]
    },
    {
      "id": "kyasgfi",
      "author": "None",
      "body": "yes indeed when actually my health was very much the most at risk when i was bulimic. ironically, people think you are healthier if you are larger but my health markers, bloods etc were all better when i was anorexic compared to bulimic. so sad.",
      "created_utc": 1712394425.0,
      "score": 5,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        },
        {
          "id": "kyareph",
          "author": "THESASAS",
          "body": "I absolutely could not agree with this comment more. And some people will look at me as “normal weight” I guess and be like “oh but you don’t look unwell.” \nOk hun 😞",
          "created_utc": 1712393636.0
        }
      ]
    },
    {
      "id": "kycwelz",
      "author": "StockReporter5",
      "body": "that fkn sucks. like yeah it’s wasteful and that helps motivate me to stop sometimes but it’s not our fault and the extra shame only deepens the disorder. and compared to how much food stores and restaurants throw out,,, it’s nothing",
      "created_utc": 1712428566.0,
      "score": 2,
      "context": [
        {
          "id": "ky7fj2h",
          "author": "StockReporter5",
          "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
          "created_utc": 1712340501.0
        },
        {
          "id": "kyb6jai",
          "author": "you_enjoy_my_yoga",
          "body": "This is why I never share what I have, just that I have an ED. A lot of my friends are very environmentally conscious and I know they would judge me for being so wasteful.",
          "created_utc": 1712404165.0
        }
      ]
    },
    {
      "id": "ky96139",
      "author": "texaselysiumBlue582",
      "body": "that's awful ): I'm so sorry",
      "created_utc": 1712363041.0,
      "score": 3,
      "context": [
        {
          "id": "ky8p8tj",
          "author": "texaselysiumBlue582",
          "body": "bulimia is probably one of the most shameful mental illnesses. To the general public, the binging is seen as gluttonous, and the purging is seen as gross and wasteful. it's horrifying to admit to oneself, much less to someone who might have a negative reaction to you/your illness (and whose opinion you probably care about and respect). I've never admitted my bulimia to anyone, even when I was throwing up several times a day; the furthest I've gone was to vaguely refer to \"eating issues.\" I've only just begun to think about seeking professional help for my eating issues after years of trying to manage the symptoms on my own, self medicating with substances, and hiding it in different ways.",
          "created_utc": 1712356415.0
        },
        {
          "id": "ky8wlla",
          "author": "Impressive-Arm-6884",
          "body": "I agree with you. I have a relative who allegedly has bulimia or some type of purging disorder. I don’t think he binges I think he just purges normal amounts of food. And when my uncle and dad found out he could possibly be doing that, they shitted on him so bad and hate him to this day because of it. It makes me terrified of my family finding out.",
          "created_utc": 1712359276.0
        }
      ]
    },
    {
      "id": "kyeaf7j",
      "author": "THESASAS",
      "body": "Yep so sad. These illnesses are so dangerous and hard to manage/recover.",
      "created_utc": 1712447551.0,
      "score": 2,
      "context": [
        {
          "id": "ky7e57u",
          "author": "None",
          "body": "The stigma stops people admitting it.  I have been both anorexic and bulimic and never felt able to name it as bulimia. When I was bulimic, I just said “eating disorder”",
          "created_utc": 1712340038.0
        },
        {
          "id": "kyareph",
          "author": "THESASAS",
          "body": "I absolutely could not agree with this comment more. And some people will look at me as “normal weight” I guess and be like “oh but you don’t look unwell.” \nOk hun 😞",
          "created_utc": 1712393636.0
        },
        {
          "id": "kyasgfi",
          "author": "None",
          "body": "yes indeed when actually my health was very much the most at risk when i was bulimic. ironically, people think you are healthier if you are larger but my health markers, bloods etc were all better when i was anorexic compared to bulimic. so sad.",
          "created_utc": 1712394425.0
        }
      ]
    },
    {
      "id": "kycyimd",
      "author": "you_enjoy_my_yoga",
      "body": "I wish it would help them realize how much it’s an illness and out of my control because I truly care about that stuff but I still can’t stop.",
      "created_utc": 1712429329.0,
      "score": 2,
      "context": [
        {
          "id": "ky7fj2h",
          "author": "StockReporter5",
          "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
          "created_utc": 1712340501.0
        },
        {
          "id": "kyb6jai",
          "author": "you_enjoy_my_yoga",
          "body": "This is why I never share what I have, just that I have an ED. A lot of my friends are very environmentally conscious and I know they would judge me for being so wasteful.",
          "created_utc": 1712404165.0
        },
        {
          "id": "kycwelz",
          "author": "StockReporter5",
          "body": "that fkn sucks. like yeah it’s wasteful and that helps motivate me to stop sometimes but it’s not our fault and the extra shame only deepens the disorder. and compared to how much food stores and restaurants throw out,,, it’s nothing",
          "created_utc": 1712428566.0
        }
      ]
    },
    {
      "id": "kyeekja",
      "author": "StockReporter5",
      "body": "REALLLLL",
      "created_utc": 1712449192.0,
      "score": 3,
      "context": [
        {
          "id": "ky7fj2h",
          "author": "StockReporter5",
          "body": "i really do feel like bulimia is one of the most stigmatized disorders. the shame is just overwhelming sometimes",
          "created_utc": 1712340501.0
        },
        {
          "id": "kyb6jai",
          "author": "you_enjoy_my_yoga",
          "body": "This is why I never share what I have, just that I have an ED. A lot of my friends are very environmentally conscious and I know they would judge me for being so wasteful.",
          "created_utc": 1712404165.0
        },
        {
          "id": "kycwelz",
          "author": "StockReporter5",
          "body": "that fkn sucks. like yeah it’s wasteful and that helps motivate me to stop sometimes but it’s not our fault and the extra shame only deepens the disorder. and compared to how much food stores and restaurants throw out,,, it’s nothing",
          "created_utc": 1712428566.0
        },
        {
          "id": "kycyimd",
          "author": "you_enjoy_my_yoga",
          "body": "I wish it would help them realize how much it’s an illness and out of my control because I truly care about that stuff but I still can’t stop.",
          "created_utc": 1712429329.0
        }
      ]
    }
  ]
}