{
  "id": "1c49nqq",
  "subreddit": "bulimia",
  "author": "nomoreredshoes",
  "created_utc": 1713143449.0,
  "title": "I suspect my 12 year old is purging - how can I best help?",
  "selftext": "My daughter has been acting oddly for a few weeks now, particularly around food and exercise. A time or two we thought we heard her throw up, so between that and the strange new fixation on food/diet/exercise I've been alert for any other signs of disordered eating. Tonight I was right next to the bathroom while she was showering and am 95% sure I heard her. \n\nI went into her room before bed and asked how she was feeling, because I thought I'd heard her getting sick. She said of course not, she would have told me, and besides it was just phlegm that she was coughing out. But I'm pretty sure she's lying. I stayed calm, didn't push her on it, but mentioned some of the reasons why someone might binge/purge, and some of the health risks that go along with it. We've discussed EDs before in a general way, but never gone too deep. I made it clear I was here to talk about it of she wanted to, then let her be.\n\nShe sees a therapist semiweekly for diagnosed anxiety/OCD, but has been doing well for the last six months...or so I thought. The therapist comes back from maternity leave this month, and I'll certainly mention my suspicions to her. And I'll talk to my own therapist about my feelings, which are pretty big right now. \n\nI guess what I'm hoping for here is advice from folks who've lived through this on what you might have hoped for from your parents early on in your journey. If she won't admit it to me, what can I do? I don't want to make her feel any more shame or embarrassment than she might already have, but I also need to keep her safe and healthy, as much as I'm able. I've searched for this question and didn't easily find many answers, but if there are any resources or other posts here on Reddit, I'd love some direction. Or comfort, or advice, or anything. \n\nThanks in advance for whatever folks are willing to share. This is one struggle I've not been through myself, and I'm at a loss for how to help my darling baby who's not at all a baby anymore but still needs me even if she thinks she doesn't. And even though we've been careful with the way we talk about food and bodies and all the rest, and I know in my mind this isn't my fault, I still feel like I've failed her somehow. I hope this post is an okay one to make here, and once again thank you for taking the time to read and respond. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1c49nqq/i_suspect_my_12_year_old_is_purging_how_can_i/",
  "score": 70,
  "num_comments": 48,
  "comments": [
    {
      "id": "kzmcue8",
      "author": "get_in_muh_belly",
      "body": "You sound like a wonderful mother. I developed an eating disorder at 12 years old after as well and I wish my mother had been as caring and kind as you seem to be. I would encourage you to be gentle and understanding while giving her the support she needs. I also have struggled with OCD since childhood and for me my ED became another theme for my OCD. Keep seeing your own therapist and take care of yourself.",
      "created_utc": 1713146213.0,
      "score": 72,
      "context": []
    },
    {
      "id": "kzm8xx1",
      "author": "poisonedminds",
      "body": "I would've liked my mom to spend more time with me, without necessarily adressing the subject. Maybe she will speak about it by herself if she feels safe with you and like you care. Tell and show her you love her. That's probably the best thing you can do right now, besides all the other good things you already said. Maybe encourage her to write a letter to you if speaking is too hard. Just don't punish her for her ed behaviour and don't put insane restrictions in place (my mom locked the fridge, hid all food from me, forced me to keep my door open always and other harmful measures).",
      "created_utc": 1713144483.0,
      "score": 54,
      "context": []
    },
    {
      "id": "kzmonw5",
      "author": "swollennymphloads",
      "body": "Get her into therapy immediately. I wish my parents would've intervened when I was 12. I'm now 30 struggling with the same thing I was twenty years ago. Get her into treatment. Gently and calm and quietly. It's uncomfortable but it will save her life. You're a great mother.",
      "created_utc": 1713151664.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kzmgpuz",
      "author": "islandrebel",
      "body": "A lot of people with OCD have EDs for a variety of reasons. So her therapist should probably be focusing on that a bit.",
      "created_utc": 1713147925.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kzn0n64",
      "author": "fireflashthirteen",
      "body": "Also, I just realised OP, no one has mentioned yet that if your child is not bingeing on food, then this could be heading down the track of Anorexia Nervosa, which is (not to scare you) the most life threatening mental health disorder we have categorised. \n\nI think you're taking an amazing approach but make no mistake, if she gets underweight, you may need to have to take intervention that she's not totally on board with. So I would recommend keeping an eye on her weight without commenting on it (and I would strongly emphasise not commenting on it unless it's unavoidable) \n\nIt might also be worthwhile reinforcing the negative effects of purging on things that she may care about as a near teen (the appearance of yellow teeth, for example), but you'd need to be careful with that as sometimes the stress associated with the negative effects can perpetuate the behaviour too.",
      "created_utc": 1713158278.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kzmbmhk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713145671.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzn40d3",
      "author": "messybunz1",
      "body": "In can be such a sensitive conversation and she could get defensive because most of us that have struggled will protect the ED secret at all costs. I wished so much that my mom stepped in more. Of course at the time and when I was younger I just wanted to be able to eat how I wanted (disordered) and not have anyone question me. I think being so careful about how you approach and maybe educate yourself as much as possible on it. Slow and steady wins the race. Be patient. Open up that form of communication and trust..but please do not give up or ignore. It will only get worse and she will be dealing with it alone. That won’t stop it. I have dealt with ED for the past 10+ years..or should I say suffered..it has ruined every aspect of my life. I am in my late 20s. It wasn’t until recently that my mom did research and just came to me with a print out from each of their website giving contact info..a dietician phone # and therapist #. All she said was that she did some research and found some good doctors in the area that specialized in that type of stuff if I wanted she would get some sessions for me. This meant so much to me. It showed she cared..we didn’t have to have any type of uncomfortable conversation and it wasn’t forceful. When I was younger and she would try to talk to me about it I would just get more and more secretive because I didn’t want her to worry, think differently of me, or pay attention to what I was doing/be found out.",
      "created_utc": 1713160400.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kznt6ft",
      "author": "RosieStar101",
      "body": "I think this comment section really was great at explaining everything and giving sound advice. I suffered an ED and undiagnosed OCD growing up (first I had OCD and then my ED developed, I just couldn't see it at the time). It was very hard, especially not having a supportive mother, like you. This post made me really happy, in a way (healing my inner child, I suppose). \n\nNow, I think the biggest hurdles actually come AFTER that first conversation you (and hopefully your husband) have with her about this situation, because it has a sort of ripple effect. It affects everything, and as someone who chronically wants to feel in control, it can definitely rock your world and in a bad way. Hopefully through trial and error you'll all be able to figure out a way, maybe her triggers (if she's far advanced into her ED, things like trigger foods, food amount, measuring can be example of things but for now, just hol' up and talk with your daughter's therapist. they will hopefully know how to help and if not, consider finding specialist in the matter) and future systems that might work for her. \n\nAll the love. Good luck for you and your family. You're doing amazing!! 🖤🥺",
      "created_utc": 1713178492.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kzn5ncf",
      "author": "None",
      "body": "Please get her to an eating disorder therapist. The sooner a potential ED is spotted and addressed the better chances you have of recovery. I wish my parents got me help at that age because a decade later I’m still struggling and it only got worse since that age. My mom would bring it up but she would do it in the wrong way by shaming me and making me feel bad. Don’t do that, make sure to always remind her that she’s loved and cared for and that she’s beautiful no matter what. ❤️",
      "created_utc": 1713161477.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kzmactb",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713145109.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kzmjj8i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713149206.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzmzlmv",
      "author": "fireflashthirteen",
      "body": "Fuck yeah, what an awesome Mum you are :) You're doing a great job. Sounds like she's lucky to have you in her corner",
      "created_utc": 1713157643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kznz5m7",
      "author": "Entire-Somewhere-198",
      "body": "This post is so sweet, thank you for caring and noticing. What helped me the most was medication to lower my anxiety and depression- it made me feel like I needed less control and so it was easier to recover",
      "created_utc": 1713181813.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzo9s79",
      "author": "None",
      "body": "Thank you for posting! This is very long and I’m sorry for that- if you have time, you might find this helpful 💚\n\nThis is from my perspective so it might not apply here, but you asked what we hoped from our parents, so here’s what I had hoped from mine:\n\nMy ED was/is a way to communicate. My parents didn’t really communicate with me in the way that I needed. I wanted them to know that I wasn’t doing well, but also that it didn’t mean that I was bad. Of course they would have known this, but to me at 11-13 it didn’t feel that way. They thought I was nice, smart, etc., and that left no room for being sad, anxious, and no room for trying new things that had any chance of failure. \n\nBulimia is about food only on the surface, so it might be worth exploring what she’s feeling underneath. Family therapy CAN be great, although my experience with it was horrible. I’d say do some serious review searching before committing to anyone if you decide to go that route. \n\nIn a nutshell though, emotions that are really strong are super important; essential for communication. Bulimia and other EDs, along with other clinical behaviours in general, numb feelings. The goal is generally to numb the ones that feel bad, but the good come along with it. If there’s a need of hers that isn’t being met, she might feel angry. If she’s had an experience, in the past or ongoing, where she’s felt threatened or where painful things have happened to her, or she feels unfamiliar with things and people around her, she might feel fear. If she lost something or someone important to her, worked hard for something that didn’t pan out, or feels alone, powerless, etc, she might feel sad. If she’s been rejected, bullied, criticized, betrayed, or negatively compared to others by people in her peer group (peers are SO important for teens), she might feel shame. And, if she’s done or said something that she feels doesn’t match her own value system, (or hasn’t done or said something she intended or said she would do in accordance to her value system), or her values don’t match up perfectly to someone very important to her, she might feel guilty. \n\nAny of those ‘negative’ emotions can pile up and become greater than the sum of their parts. Bulimia is overwhelming, and two important things are almost certainly present from that list: the general feeling of shame (which makes someone want to hide, like how she’s not admitting what she’s doing when asked), and the feeling of powerlessness (she’s seeking to control her weight, which might be compensating for other aspects of her life that feel out of control). \n\nBeing a teen nearly always comes with shame and feelings of being out of control of everyone changing so quickly around you, and yourself changing, so it’s so important to talk to her about this and let her know that she’s not alone. ED behaviour becomes more than a coping mechanism, and moves very quickly to habit, and one that’s so difficult to break. That’s because it works so well and so reliably to feel better. If you can work together to find other ways for her to feel good, it can help her build the “replacement” mechanisms she’ll need to ensure she doesn’t feel like she’s always going to suffer. Doing art/music/dance, going to social events (or counselling groups if she’s anxious in front of people- it takes practice!), having quiet hobbies to herself, and having people to talk to when things happen- big or small (remember they pile up!) that make her feel angry, sad, guilty, or ashamed. Therapy is a wonderful start for this, and I’d encourage you to do your best to get a feeling for whether her therapist is a good fit for her. The right therapist feels like a breath of fresh air when it’s appointment time rather than a pain to have to wake up and get ready for. I know options can be quite limiting, so the best you can do is the best for her.\n\nI very very strongly encourage trying to increase your heart to hearts with her in general, because opening up doesn’t happen in a day, and it can be so hard talking to parents as a teen when you feel like you can’t even understand yourself half the time. Think about how you felt as a teen, and also how your parents might have felt raising you as a teen for some possible insight 😊\n\nOne last note- DBT (dialectical behavioural therapy) is extremely helpful for those with eating disorders. Also highly recommended!",
      "created_utc": 1713186689.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzoaluq",
      "author": "ReflectionThin5574",
      "body": "From what I wish I had: intervene now. Don’t wait. Will she hate you for it? Maybe. But you will save her so much pain physically and emotionally.",
      "created_utc": 1713187032.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzpf44j",
      "author": "SadGooseFeet",
      "body": "Main reason I didn’t confide in my caregivers about my bulimia is because I was worried they would try to control me, and consequently take away the control that the ED was giving me. I was also very ashamed, shich is common amongst EDs.\n\nMake sure she knows that you are not judging her, and will not try to stop her. Let her know you’re just here to understand and support her. That is all",
      "created_utc": 1713201357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzplwr9",
      "author": "InternationalEase718",
      "body": "You are a wonderful mom. One thing I’ll add to all the wonderful advice you have received is that lying is very much a part of this disorder and a means to protect it. At 12, I wish I understood this better ‘the chains of habit are too light to be felt until they are too heavy to be broken’. She probably thinks she has got this under control and will stop when she wants to. I would absolutely keep letting her know that this is strongly associated with OCD, that it is in NO WAY her fault and that it is in her best interest to stop sooner rather than later and that you are ready to help her on her terms when she is ready. It’s so hard that she is not opening up but she will let you in when she is ready. Definitely speak to her therapist to try and shorten the time between now and her feeling ready to open up about it.",
      "created_utc": 1713203622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzpo9mr",
      "author": "None",
      "body": "i wish my parents would’ve helped me with my ed a lot differently than they did. the sooner you get her into therapy or treatment, the better off she’ll be. i developed my ed when i was 13. my overly religious (yet somehow still drug and alcohol addicted) father would tell me i was possessed and selfish and my selfish desires were sins from the devil. i was in and out of therapists when my parents had to change insurance or my mom didn’t like one of my therapists or whatever reason we used that time. had probably 10 therapists between 13 and 17. my mom used to try and sit in on therapy appointments with me- made me resort to lying about everything and that’s another reason therapists stopped seeing me, i didn’t want my mother to know what i was doing so i lied. with that the drs thought i was “better.” (please don’t do what my mother did) anyways went to a partial day treatment center in cleveland (hour drive one way) and eventually my parents made me feel so selfish and awful for “making them drive two hours every day” that i lied my way through the program and developed severe bulimia at 16. \n\ni’m going to be 20 in a month, and im actually doing significantly worse than i was at 16. i genuinely am at the lowest point in my life and i am not sure i can be saved without a serious medical or professional intervention. \n\nsorry for kinda unloading my life history.. but my point is please please please be gentle with her. definitely get her help and stay strong on that end.. but the emotional aspect of eating disorders is so sensitive. it’s a lot easier to undo a few months of disordered eating and behaviors and patterns than five years of those same habits. stay strong please, i know it’s hard from a mothers perspective. it’s probably really hard on your daughter as well. just make sure she knows you are a safe place for her to go to if she needs a shoulder to lean on. it REALLY helps especially with her going into high school soon if not already. a lot of people that age don’t get it. i felt so alone in high school, i wish my parents would’ve been there for me more",
      "created_utc": 1713204411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzpx0dp",
      "author": "thunderandrain69",
      "body": "You sound like such a great mom. I developed my ED young as well, and I also have OCD. There is quite a bit of overlap between OCD and EDs. I think so far you’ve handled it great by staying calm and not being too pushy. My mom is amazing but when she found out, her anxiety was so high all the time and she just nonstop pressured me/asked me about it/tried to “catch” me in a very overbearing way, albeit one that came from good intentions. Talk to the therapist for sure. If her therapist is not well-versed in EDs (most aren’t), it would be worth finding one who specializes. The sooner she gets help the better the outcome. Keep being gentle with her. She needs to know that you’re on her side and it’s not “I have to hide this from mom.” If she lies to you about it, try not to take it personally. It’s the nature of EDs unfortunately, especially in the early stages. My parents put me in therapy immediately, but I wasted a lot of time with therapists who didn’t specialize in EDs. Specialized therapist off the bat is very important IMO. Best of luck to you both 🩷",
      "created_utc": 1713207342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzq958r",
      "author": "RaccoonLord12",
      "body": "I used to do the same things when I was young like showering after dinner to mask the sound. I think the best thing my mother could have done was be understanding and compassionate. My mom would yell at me, take away things like my scale, and threaten to pull me out of school and send me away. I think the best thing you can do is be there for her. For me therapy was necessary but very difficult I did often lie to my therapist due to shame and not wanting to lose control of something",
      "created_utc": 1713211370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kzrwpdu",
      "author": "erraticella",
      "body": "You’re an incredible mother. I’m sorry your daughter is going through this. Early intervention with Eating Disorder’s is crucial so please please speak up to her therapist about it, your daughter will thank you in the years to come. Best of luck to the both of you 💖",
      "created_utc": 1713234968.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l02ayw1",
      "author": "GoodRefrigerator204",
      "body": "Okay here we go my names josh and I usually ignore stuff like this but you mentioned ocd and it sounded like you don't have it yourself... Some background... Ocd ruined my childhood, destroyed everything... I used to make myself sick because my brain was full of.. (obsession) if I don't make myself puke before bed ill kill someone... (compulsion) making myself sick... (disorder) it's pointless and meaningless. The obsession is always something the person doesn't agree with... Its a meaningless intrusive thought that doesn't go away... So\n\n\nTake these words very seriously... Ocd is a monster and the more attention you feed it the bigger it grows.. I've been ocd free now for about 10 years I still get spikes sometimes but I put that down to it being a huge memory... Do not talk to her about ocd if she doesn't mention it..she has to learn to train her brain to ignore the bad thoughts that seem like they last forever. It's very hard... Took me five years or self care to heal... Any 'professional' will make her worse...ocd only dissapears when it's forgotten about. I'm here if you wanna learn more. I know more than any pro and I don't take people's fucking money. Ughhh.... Okay so... Let's say its not ocd...how can you assume its anything else? She may only be 12 which by the way is a normal age for this and that doctor knows it... I hope you're not paying him as he is rinsing you. Also... Are you up to date with current nutrition agreements? Is there actually any harm or does it just make you worry... Is she a healthy young girl just going through some stuff or is she dying from startavtion... You need to make sure what the actual problem is... If its ocd then I'm so sorry for what she is gonna go though. I can offer endless advice for free as I am a survive... I was once homeless on and off for 7 years and I still think being ocd free is my biggest achievement. If it is an eating disorder the best thing you can do is study nutrition and silently make sure than even if she keeps making her self sick for looks or wanting to be skinny... Its her body it's her choice... But make sure she is still getting the input she needs... So if its a mental disorder like ocd then I can offer advice and my heart breaks... If its a physical thing... Then back off and just keep her alive and as healthy as you can. Xx",
      "created_utc": 1713395476.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kznp72i",
      "author": "nomoreredshoes",
      "body": "This is good stuff. Whenever in doubt I try to just bolster our relationship, this is a great reminder to keep doing that. Definitely won't punish or further restrict, it's helpful to hear that that approach was harmful for you. Best of luck on your own journey.",
      "created_utc": 1713175891.0,
      "score": 8,
      "context": [
        {
          "id": "kzm8xx1",
          "author": "poisonedminds",
          "body": "I would've liked my mom to spend more time with me, without necessarily adressing the subject. Maybe she will speak about it by herself if she feels safe with you and like you care. Tell and show her you love her. That's probably the best thing you can do right now, besides all the other good things you already said. Maybe encourage her to write a letter to you if speaking is too hard. Just don't punish her for her ed behaviour and don't put insane restrictions in place (my mom locked the fridge, hid all food from me, forced me to keep my door open always and other harmful measures).",
          "created_utc": 1713144483.0
        }
      ]
    },
    {
      "id": "kznp2a2",
      "author": "nomoreredshoes",
      "body": "Thank you so much for your advice. Appreciate it.",
      "created_utc": 1713175797.0,
      "score": 2,
      "context": [
        {
          "id": "kzmonw5",
          "author": "swollennymphloads",
          "body": "Get her into therapy immediately. I wish my parents would've intervened when I was 12. I'm now 30 struggling with the same thing I was twenty years ago. Get her into treatment. Gently and calm and quietly. It's uncomfortable but it will save her life. You're a great mother.",
          "created_utc": 1713151664.0
        }
      ]
    },
    {
      "id": "kznoyj1",
      "author": "nomoreredshoes",
      "body": "This is helpful, thank you! Her OCD has mostly manifested in counting things/needing things to be \"even\", but I wonder if it's been affecting her more than she's letting on. She's good at being sneaky, which I don't blame her for but makes it tough to keep her safe and healthy sometimes. Thanks again.",
      "created_utc": 1713175725.0,
      "score": 3,
      "context": [
        {
          "id": "kzmgpuz",
          "author": "islandrebel",
          "body": "A lot of people with OCD have EDs for a variety of reasons. So her therapist should probably be focusing on that a bit.",
          "created_utc": 1713147925.0
        }
      ]
    },
    {
      "id": "kzqrdx5",
      "author": "Edog6968",
      "body": "Came here to say this, I also have anxiety and OCD and both definitely contribute to my bulimia. And mom you definitely aren’t failing your kid, I’ve been dealing with serious ED’s for around 10 years now and my parents have barely asked about it, and at most just say “you better not have an ED” and then change the subject.  Be persistent with asking her about it if you continue to have suspicions and definitely bring it up with her therapist when she gets back from maternity leave, if you catch it early enough you can stop it from spiraling into a way more serious issue!",
      "created_utc": 1713217600.0,
      "score": 2,
      "context": [
        {
          "id": "kzmgpuz",
          "author": "islandrebel",
          "body": "A lot of people with OCD have EDs for a variety of reasons. So her therapist should probably be focusing on that a bit.",
          "created_utc": 1713147925.0
        }
      ]
    },
    {
      "id": "kzno85j",
      "author": "nomoreredshoes",
      "body": "My husband and I have been noticing that she often won't eat her whole dinner in recent weeks. She says her teeth are bothering her (she has braces) or she's just not hungry. But then when she got back from her dad's yesterday, she told me about alllll the food she ate yesterday (mostly junk food). And she ate her whole dinner without saying anything about her teeth bugging her. \n\nWhat does intervention look like if she won't admit to it? Do I get her PCP involved? Escalate from therapist to psychiatrist? I guess I just don't know what to do if she keeps denying any issue and there's no smoking gun in terms of behaviors.",
      "created_utc": 1713175205.0,
      "score": 3,
      "context": [
        {
          "id": "kzn0n64",
          "author": "fireflashthirteen",
          "body": "Also, I just realised OP, no one has mentioned yet that if your child is not bingeing on food, then this could be heading down the track of Anorexia Nervosa, which is (not to scare you) the most life threatening mental health disorder we have categorised. \n\nI think you're taking an amazing approach but make no mistake, if she gets underweight, you may need to have to take intervention that she's not totally on board with. So I would recommend keeping an eye on her weight without commenting on it (and I would strongly emphasise not commenting on it unless it's unavoidable) \n\nIt might also be worthwhile reinforcing the negative effects of purging on things that she may care about as a near teen (the appearance of yellow teeth, for example), but you'd need to be careful with that as sometimes the stress associated with the negative effects can perpetuate the behaviour too.",
          "created_utc": 1713158278.0
        }
      ]
    },
    {
      "id": "kzn01ap",
      "author": "fireflashthirteen",
      "body": "Are you aware that bingeing and restricting can also constitute bulimia? And as such, being bulimic can make someone lose weight? \n\nBulimia is not characterised by purging necessarily, but rather a variety of \"inappropriate compensatory behaviours\"",
      "created_utc": 1713157903.0,
      "score": 4,
      "context": [
        {
          "id": "kzmbmhk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145671.0
        }
      ]
    },
    {
      "id": "kznoiwp",
      "author": "nomoreredshoes",
      "body": "I call her my porcupine kid because when she's upset she gets mad and prickly even if she's really feeling sad or scared. I think that's why I posted here, because I don't want to push her into further defensiveness but I'm also so scared for her and want to give her the best support I can. Thanks for your response, it's exactly the kind of insight I was hoping for. Hope your journey is on a good trajectory and that you are able to find relief from suffering more and more as time goes on.",
      "created_utc": 1713175418.0,
      "score": 1,
      "context": [
        {
          "id": "kzn40d3",
          "author": "messybunz1",
          "body": "In can be such a sensitive conversation and she could get defensive because most of us that have struggled will protect the ED secret at all costs. I wished so much that my mom stepped in more. Of course at the time and when I was younger I just wanted to be able to eat how I wanted (disordered) and not have anyone question me. I think being so careful about how you approach and maybe educate yourself as much as possible on it. Slow and steady wins the race. Be patient. Open up that form of communication and trust..but please do not give up or ignore. It will only get worse and she will be dealing with it alone. That won’t stop it. I have dealt with ED for the past 10+ years..or should I say suffered..it has ruined every aspect of my life. I am in my late 20s. It wasn’t until recently that my mom did research and just came to me with a print out from each of their website giving contact info..a dietician phone # and therapist #. All she said was that she did some research and found some good doctors in the area that specialized in that type of stuff if I wanted she would get some sessions for me. This meant so much to me. It showed she cared..we didn’t have to have any type of uncomfortable conversation and it wasn’t forceful. When I was younger and she would try to talk to me about it I would just get more and more secretive because I didn’t want her to worry, think differently of me, or pay attention to what I was doing/be found out.",
          "created_utc": 1713160400.0
        }
      ]
    },
    {
      "id": "kzntmno",
      "author": "nomoreredshoes",
      "body": "Awww thanks you for sharing this! The internet can be just awful, but it can also provide moments like this, and opportunities for healing and sharing and all the good things we humans can do. I hope your inner child continues to heal and that you have supportive folks in your life now. Take good care.",
      "created_utc": 1713178771.0,
      "score": 4,
      "context": [
        {
          "id": "kznt6ft",
          "author": "RosieStar101",
          "body": "I think this comment section really was great at explaining everything and giving sound advice. I suffered an ED and undiagnosed OCD growing up (first I had OCD and then my ED developed, I just couldn't see it at the time). It was very hard, especially not having a supportive mother, like you. This post made me really happy, in a way (healing my inner child, I suppose). \n\nNow, I think the biggest hurdles actually come AFTER that first conversation you (and hopefully your husband) have with her about this situation, because it has a sort of ripple effect. It affects everything, and as someone who chronically wants to feel in control, it can definitely rock your world and in a bad way. Hopefully through trial and error you'll all be able to figure out a way, maybe her triggers (if she's far advanced into her ED, things like trigger foods, food amount, measuring can be example of things but for now, just hol' up and talk with your daughter's therapist. they will hopefully know how to help and if not, consider finding specialist in the matter) and future systems that might work for her. \n\nAll the love. Good luck for you and your family. You're doing amazing!! 🖤🥺",
          "created_utc": 1713178492.0
        }
      ]
    },
    {
      "id": "kznolg1",
      "author": "nomoreredshoes",
      "body": "She's so beautiful. And funny and smart and just the best. Thanks for taking the time, and I wish you all the best on your own journey.",
      "created_utc": 1713175468.0,
      "score": 2,
      "context": [
        {
          "id": "kzn5ncf",
          "author": "None",
          "body": "Please get her to an eating disorder therapist. The sooner a potential ED is spotted and addressed the better chances you have of recovery. I wish my parents got me help at that age because a decade later I’m still struggling and it only got worse since that age. My mom would bring it up but she would do it in the wrong way by shaming me and making me feel bad. Don’t do that, make sure to always remind her that she’s loved and cared for and that she’s beautiful no matter what. ❤️",
          "created_utc": 1713161477.0
        }
      ]
    },
    {
      "id": "kzmay5t",
      "author": "springcat413",
      "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
      "created_utc": 1713145372.0,
      "score": 8,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        }
      ]
    },
    {
      "id": "kzmgtqt",
      "author": "islandrebel",
      "body": "Yeah, I mean the fact that she’s in therapy already and her mother is too is a great start. One thing that needs to be made clear though is that her therapist won’t tell mom if she is purging. It’s scary to open that can of worms.",
      "created_utc": 1713147973.0,
      "score": 5,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        }
      ]
    },
    {
      "id": "kzpwyb0",
      "author": "nomoreredshoes",
      "body": "I'm so sorry your mom said thing like that to you. I can't imagine ever being that nasty to my kid about anything, let alone her mental health. \n\nI really like the idea of finding someone else she could talk to who's not a therapist. I'm going to add that to my list. Thanks again for taking the time, all the best to you!",
      "created_utc": 1713207323.0,
      "score": 1,
      "context": [
        {
          "id": "kzmjj8i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713149206.0
        }
      ]
    },
    {
      "id": "kzpx9mz",
      "author": "nomoreredshoes",
      "body": "Thank you x a million...I really appreciate that.",
      "created_utc": 1713207427.0,
      "score": 1,
      "context": [
        {
          "id": "kzmzlmv",
          "author": "fireflashthirteen",
          "body": "Fuck yeah, what an awesome Mum you are :) You're doing a great job. Sounds like she's lucky to have you in her corner",
          "created_utc": 1713157643.0
        }
      ]
    },
    {
      "id": "kzpxew8",
      "author": "nomoreredshoes",
      "body": "Thanks for this insight, I really hadn't considered the anxiety/OCD aspects before the comments on this post and I appreciate the advice so much!",
      "created_utc": 1713207476.0,
      "score": 2,
      "context": [
        {
          "id": "kznz5m7",
          "author": "Entire-Somewhere-198",
          "body": "This post is so sweet, thank you for caring and noticing. What helped me the most was medication to lower my anxiety and depression- it made me feel like I needed less control and so it was easier to recover",
          "created_utc": 1713181813.0
        }
      ]
    },
    {
      "id": "kzpyizu",
      "author": "nomoreredshoes",
      "body": "Holy shit this is fire! Thank you so much for taking the time to explain the feelings-to-behavior mechanism here. I'm familiar with numbing behaviors related to my own mental health issues, but I guess I didn't realize how purging could be one. I've struggled with quite a few substances in the past, including overeating, but never purging and now that you've pointed it out it makes perfect sense that it could serve the same function. I also really appreciate how you pointed out that the behavior can move from coping mechanism to habit. This is really such a helpful and thorough response, and I am so grateful to you for taking the time to share.",
      "created_utc": 1713207852.0,
      "score": 3,
      "context": [
        {
          "id": "kzo9s79",
          "author": "None",
          "body": "Thank you for posting! This is very long and I’m sorry for that- if you have time, you might find this helpful 💚\n\nThis is from my perspective so it might not apply here, but you asked what we hoped from our parents, so here’s what I had hoped from mine:\n\nMy ED was/is a way to communicate. My parents didn’t really communicate with me in the way that I needed. I wanted them to know that I wasn’t doing well, but also that it didn’t mean that I was bad. Of course they would have known this, but to me at 11-13 it didn’t feel that way. They thought I was nice, smart, etc., and that left no room for being sad, anxious, and no room for trying new things that had any chance of failure. \n\nBulimia is about food only on the surface, so it might be worth exploring what she’s feeling underneath. Family therapy CAN be great, although my experience with it was horrible. I’d say do some serious review searching before committing to anyone if you decide to go that route. \n\nIn a nutshell though, emotions that are really strong are super important; essential for communication. Bulimia and other EDs, along with other clinical behaviours in general, numb feelings. The goal is generally to numb the ones that feel bad, but the good come along with it. If there’s a need of hers that isn’t being met, she might feel angry. If she’s had an experience, in the past or ongoing, where she’s felt threatened or where painful things have happened to her, or she feels unfamiliar with things and people around her, she might feel fear. If she lost something or someone important to her, worked hard for something that didn’t pan out, or feels alone, powerless, etc, she might feel sad. If she’s been rejected, bullied, criticized, betrayed, or negatively compared to others by people in her peer group (peers are SO important for teens), she might feel shame. And, if she’s done or said something that she feels doesn’t match her own value system, (or hasn’t done or said something she intended or said she would do in accordance to her value system), or her values don’t match up perfectly to someone very important to her, she might feel guilty. \n\nAny of those ‘negative’ emotions can pile up and become greater than the sum of their parts. Bulimia is overwhelming, and two important things are almost certainly present from that list: the general feeling of shame (which makes someone want to hide, like how she’s not admitting what she’s doing when asked), and the feeling of powerlessness (she’s seeking to control her weight, which might be compensating for other aspects of her life that feel out of control). \n\nBeing a teen nearly always comes with shame and feelings of being out of control of everyone changing so quickly around you, and yourself changing, so it’s so important to talk to her about this and let her know that she’s not alone. ED behaviour becomes more than a coping mechanism, and moves very quickly to habit, and one that’s so difficult to break. That’s because it works so well and so reliably to feel better. If you can work together to find other ways for her to feel good, it can help her build the “replacement” mechanisms she’ll need to ensure she doesn’t feel like she’s always going to suffer. Doing art/music/dance, going to social events (or counselling groups if she’s anxious in front of people- it takes practice!), having quiet hobbies to herself, and having people to talk to when things happen- big or small (remember they pile up!) that make her feel angry, sad, guilty, or ashamed. Therapy is a wonderful start for this, and I’d encourage you to do your best to get a feeling for whether her therapist is a good fit for her. The right therapist feels like a breath of fresh air when it’s appointment time rather than a pain to have to wake up and get ready for. I know options can be quite limiting, so the best you can do is the best for her.\n\nI very very strongly encourage trying to increase your heart to hearts with her in general, because opening up doesn’t happen in a day, and it can be so hard talking to parents as a teen when you feel like you can’t even understand yourself half the time. Think about how you felt as a teen, and also how your parents might have felt raising you as a teen for some possible insight 😊\n\nOne last note- DBT (dialectical behavioural therapy) is extremely helpful for those with eating disorders. Also highly recommended!",
          "created_utc": 1713186689.0
        }
      ]
    },
    {
      "id": "kzpw191",
      "author": "nomoreredshoes",
      "body": "Oh sweet internet stranger, I am so sorry for what you've been through. While I haven't suffered from an ED, my parents made their own messes in my psyche that I am still working through in my 40s. It's part of why I'm so concerned with making better choices for my daughter, so that she can be supported the ways my mother could not or would not support me. Thank you for sharing your story, it's a blessing to me in this moment to hear about it. I hope that you find your way through your own darkness now, and that you find the support you didn't have when you were younger. Keep telling your story, and remember that sharing it may just have helped a 12 year old girl who will never know you but will now benefit from the lessons you've learned. All the best to you.",
      "created_utc": 1713207018.0,
      "score": 2,
      "context": [
        {
          "id": "kzpo9mr",
          "author": "None",
          "body": "i wish my parents would’ve helped me with my ed a lot differently than they did. the sooner you get her into therapy or treatment, the better off she’ll be. i developed my ed when i was 13. my overly religious (yet somehow still drug and alcohol addicted) father would tell me i was possessed and selfish and my selfish desires were sins from the devil. i was in and out of therapists when my parents had to change insurance or my mom didn’t like one of my therapists or whatever reason we used that time. had probably 10 therapists between 13 and 17. my mom used to try and sit in on therapy appointments with me- made me resort to lying about everything and that’s another reason therapists stopped seeing me, i didn’t want my mother to know what i was doing so i lied. with that the drs thought i was “better.” (please don’t do what my mother did) anyways went to a partial day treatment center in cleveland (hour drive one way) and eventually my parents made me feel so selfish and awful for “making them drive two hours every day” that i lied my way through the program and developed severe bulimia at 16. \n\ni’m going to be 20 in a month, and im actually doing significantly worse than i was at 16. i genuinely am at the lowest point in my life and i am not sure i can be saved without a serious medical or professional intervention. \n\nsorry for kinda unloading my life history.. but my point is please please please be gentle with her. definitely get her help and stay strong on that end.. but the emotional aspect of eating disorders is so sensitive. it’s a lot easier to undo a few months of disordered eating and behaviors and patterns than five years of those same habits. stay strong please, i know it’s hard from a mothers perspective. it’s probably really hard on your daughter as well. just make sure she knows you are a safe place for her to go to if she needs a shoulder to lean on. it REALLY helps especially with her going into high school soon if not already. a lot of people that age don’t get it. i felt so alone in high school, i wish my parents would’ve been there for me more",
          "created_utc": 1713204411.0
        }
      ]
    },
    {
      "id": "kznrztn",
      "author": "Sam_thelion",
      "body": "She might be less ashamed of the ED if it’s spoken about as a manifestation of her OCD (assuming she already is comfortable talking about that because she’s been in therapy for it). I developed bulimia after other ED behaviors and mental health issues, ones which I felt way more comfortable talking about because bulimia is so stigmatized. I felt disgusting and ashamed all the time when I first started purging, and I was terrified of someone finding out. Just a thought!",
      "created_utc": 1713177750.0,
      "score": 7,
      "context": [
        {
          "id": "kzmgpuz",
          "author": "islandrebel",
          "body": "A lot of people with OCD have EDs for a variety of reasons. So her therapist should probably be focusing on that a bit.",
          "created_utc": 1713147925.0
        },
        {
          "id": "kznoyj1",
          "author": "nomoreredshoes",
          "body": "This is helpful, thank you! Her OCD has mostly manifested in counting things/needing things to be \"even\", but I wonder if it's been affecting her more than she's letting on. She's good at being sneaky, which I don't blame her for but makes it tough to keep her safe and healthy sometimes. Thanks again.",
          "created_utc": 1713175725.0
        }
      ]
    },
    {
      "id": "kznplg7",
      "author": "fireflashthirteen",
      "body": "If, and this is a big if, she starts entering territory where she's underweight for her height, age, muscle. mass and so on - or you know for sure that she's purging - then you could probably get her doctor involved, and consult an eating disorder specialist, who generally come in the forms of doctors (including psychiatrists), psychologists and nutritionists.\n\nI'd be very cautious about moving on this without definitive evidence or cause though; I would say having her see you as a supporter and an ally rather than someone she has to work against and/or outwit is extremely important. A much better case scenario is that you allow her to approach you for support, and then you've already got the support infrastructure scoped out and ready to go.",
      "created_utc": 1713176166.0,
      "score": 5,
      "context": [
        {
          "id": "kzn0n64",
          "author": "fireflashthirteen",
          "body": "Also, I just realised OP, no one has mentioned yet that if your child is not bingeing on food, then this could be heading down the track of Anorexia Nervosa, which is (not to scare you) the most life threatening mental health disorder we have categorised. \n\nI think you're taking an amazing approach but make no mistake, if she gets underweight, you may need to have to take intervention that she's not totally on board with. So I would recommend keeping an eye on her weight without commenting on it (and I would strongly emphasise not commenting on it unless it's unavoidable) \n\nIt might also be worthwhile reinforcing the negative effects of purging on things that she may care about as a near teen (the appearance of yellow teeth, for example), but you'd need to be careful with that as sometimes the stress associated with the negative effects can perpetuate the behaviour too.",
          "created_utc": 1713158278.0
        },
        {
          "id": "kzno85j",
          "author": "nomoreredshoes",
          "body": "My husband and I have been noticing that she often won't eat her whole dinner in recent weeks. She says her teeth are bothering her (she has braces) or she's just not hungry. But then when she got back from her dad's yesterday, she told me about alllll the food she ate yesterday (mostly junk food). And she ate her whole dinner without saying anything about her teeth bugging her. \n\nWhat does intervention look like if she won't admit to it? Do I get her PCP involved? Escalate from therapist to psychiatrist? I guess I just don't know what to do if she keeps denying any issue and there's no smoking gun in terms of behaviors.",
          "created_utc": 1713175205.0
        }
      ]
    },
    {
      "id": "kzmbnxh",
      "author": "None",
      "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
      "created_utc": 1713145689.0,
      "score": 2,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        }
      ]
    },
    {
      "id": "kznnkjh",
      "author": "nomoreredshoes",
      "body": "Thanks for pointing this out, I didn't know that therapists wouldn't necessarily share this kind of information with me. Makes sense, and while of course I want to know everything about my kid so I can help her, she doesn't belong to me. She's just in my care for a few decades and I'm trying to do right by her while I can. Thanks for taking the time.",
      "created_utc": 1713174731.0,
      "score": 1,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmgtqt",
          "author": "islandrebel",
          "body": "Yeah, I mean the fact that she’s in therapy already and her mother is too is a great start. One thing that needs to be made clear though is that her therapist won’t tell mom if she is purging. It’s scary to open that can of worms.",
          "created_utc": 1713147973.0
        }
      ]
    },
    {
      "id": "l03lm3q",
      "author": "None",
      "body": "You’re so welcome 😊 it really makes me happy that you’re going through all of these responses and working hard to help your daughter. It’s going to be difficult, but I have a lot of faith that you’ll be able to help her through this 💚 if and whenever you’re discouraged by her responses (as you mentioned that she’s not exactly the type to want help), just remember that bulimia is such an awful thing to deal with and it makes you want to be alone. Underneath though, no one wants to have an eating disorder. She doesn’t want one far more than she doesn’t want your input, if that makes sense. It’s also wonderful you’re doing this now- an established eating disorder can take an average of 7 years to be free from with therapy and a willing patient, but catching it early is a crucial time-reducer. Keep doing what you’re doing 💚🤗",
      "created_utc": 1713415176.0,
      "score": 1,
      "context": [
        {
          "id": "kzo9s79",
          "author": "None",
          "body": "Thank you for posting! This is very long and I’m sorry for that- if you have time, you might find this helpful 💚\n\nThis is from my perspective so it might not apply here, but you asked what we hoped from our parents, so here’s what I had hoped from mine:\n\nMy ED was/is a way to communicate. My parents didn’t really communicate with me in the way that I needed. I wanted them to know that I wasn’t doing well, but also that it didn’t mean that I was bad. Of course they would have known this, but to me at 11-13 it didn’t feel that way. They thought I was nice, smart, etc., and that left no room for being sad, anxious, and no room for trying new things that had any chance of failure. \n\nBulimia is about food only on the surface, so it might be worth exploring what she’s feeling underneath. Family therapy CAN be great, although my experience with it was horrible. I’d say do some serious review searching before committing to anyone if you decide to go that route. \n\nIn a nutshell though, emotions that are really strong are super important; essential for communication. Bulimia and other EDs, along with other clinical behaviours in general, numb feelings. The goal is generally to numb the ones that feel bad, but the good come along with it. If there’s a need of hers that isn’t being met, she might feel angry. If she’s had an experience, in the past or ongoing, where she’s felt threatened or where painful things have happened to her, or she feels unfamiliar with things and people around her, she might feel fear. If she lost something or someone important to her, worked hard for something that didn’t pan out, or feels alone, powerless, etc, she might feel sad. If she’s been rejected, bullied, criticized, betrayed, or negatively compared to others by people in her peer group (peers are SO important for teens), she might feel shame. And, if she’s done or said something that she feels doesn’t match her own value system, (or hasn’t done or said something she intended or said she would do in accordance to her value system), or her values don’t match up perfectly to someone very important to her, she might feel guilty. \n\nAny of those ‘negative’ emotions can pile up and become greater than the sum of their parts. Bulimia is overwhelming, and two important things are almost certainly present from that list: the general feeling of shame (which makes someone want to hide, like how she’s not admitting what she’s doing when asked), and the feeling of powerlessness (she’s seeking to control her weight, which might be compensating for other aspects of her life that feel out of control). \n\nBeing a teen nearly always comes with shame and feelings of being out of control of everyone changing so quickly around you, and yourself changing, so it’s so important to talk to her about this and let her know that she’s not alone. ED behaviour becomes more than a coping mechanism, and moves very quickly to habit, and one that’s so difficult to break. That’s because it works so well and so reliably to feel better. If you can work together to find other ways for her to feel good, it can help her build the “replacement” mechanisms she’ll need to ensure she doesn’t feel like she’s always going to suffer. Doing art/music/dance, going to social events (or counselling groups if she’s anxious in front of people- it takes practice!), having quiet hobbies to herself, and having people to talk to when things happen- big or small (remember they pile up!) that make her feel angry, sad, guilty, or ashamed. Therapy is a wonderful start for this, and I’d encourage you to do your best to get a feeling for whether her therapist is a good fit for her. The right therapist feels like a breath of fresh air when it’s appointment time rather than a pain to have to wake up and get ready for. I know options can be quite limiting, so the best you can do is the best for her.\n\nI very very strongly encourage trying to increase your heart to hearts with her in general, because opening up doesn’t happen in a day, and it can be so hard talking to parents as a teen when you feel like you can’t even understand yourself half the time. Think about how you felt as a teen, and also how your parents might have felt raising you as a teen for some possible insight 😊\n\nOne last note- DBT (dialectical behavioural therapy) is extremely helpful for those with eating disorders. Also highly recommended!",
          "created_utc": 1713186689.0
        },
        {
          "id": "kzpyizu",
          "author": "nomoreredshoes",
          "body": "Holy shit this is fire! Thank you so much for taking the time to explain the feelings-to-behavior mechanism here. I'm familiar with numbing behaviors related to my own mental health issues, but I guess I didn't realize how purging could be one. I've struggled with quite a few substances in the past, including overeating, but never purging and now that you've pointed it out it makes perfect sense that it could serve the same function. I also really appreciate how you pointed out that the behavior can move from coping mechanism to habit. This is really such a helpful and thorough response, and I am so grateful to you for taking the time to share.",
          "created_utc": 1713207852.0
        }
      ]
    },
    {
      "id": "kzqmyof",
      "author": "None",
      "body": "it makes me so happy to hear that there are caring parents out there like you. thank you so so much for your kind words and i wish you and your daughter nothing but the best in life, and in your mental health journey <3 keep it up mama, you’re doing awesome",
      "created_utc": 1713216047.0,
      "score": 2,
      "context": [
        {
          "id": "kzpo9mr",
          "author": "None",
          "body": "i wish my parents would’ve helped me with my ed a lot differently than they did. the sooner you get her into therapy or treatment, the better off she’ll be. i developed my ed when i was 13. my overly religious (yet somehow still drug and alcohol addicted) father would tell me i was possessed and selfish and my selfish desires were sins from the devil. i was in and out of therapists when my parents had to change insurance or my mom didn’t like one of my therapists or whatever reason we used that time. had probably 10 therapists between 13 and 17. my mom used to try and sit in on therapy appointments with me- made me resort to lying about everything and that’s another reason therapists stopped seeing me, i didn’t want my mother to know what i was doing so i lied. with that the drs thought i was “better.” (please don’t do what my mother did) anyways went to a partial day treatment center in cleveland (hour drive one way) and eventually my parents made me feel so selfish and awful for “making them drive two hours every day” that i lied my way through the program and developed severe bulimia at 16. \n\ni’m going to be 20 in a month, and im actually doing significantly worse than i was at 16. i genuinely am at the lowest point in my life and i am not sure i can be saved without a serious medical or professional intervention. \n\nsorry for kinda unloading my life history.. but my point is please please please be gentle with her. definitely get her help and stay strong on that end.. but the emotional aspect of eating disorders is so sensitive. it’s a lot easier to undo a few months of disordered eating and behaviors and patterns than five years of those same habits. stay strong please, i know it’s hard from a mothers perspective. it’s probably really hard on your daughter as well. just make sure she knows you are a safe place for her to go to if she needs a shoulder to lean on. it REALLY helps especially with her going into high school soon if not already. a lot of people that age don’t get it. i felt so alone in high school, i wish my parents would’ve been there for me more",
          "created_utc": 1713204411.0
        },
        {
          "id": "kzpw191",
          "author": "nomoreredshoes",
          "body": "Oh sweet internet stranger, I am so sorry for what you've been through. While I haven't suffered from an ED, my parents made their own messes in my psyche that I am still working through in my 40s. It's part of why I'm so concerned with making better choices for my daughter, so that she can be supported the ways my mother could not or would not support me. Thank you for sharing your story, it's a blessing to me in this moment to hear about it. I hope that you find your way through your own darkness now, and that you find the support you didn't have when you were younger. Keep telling your story, and remember that sharing it may just have helped a 12 year old girl who will never know you but will now benefit from the lessons you've learned. All the best to you.",
          "created_utc": 1713207018.0
        }
      ]
    },
    {
      "id": "kzpjucl",
      "author": "InternationalEase718",
      "body": "I really like this idea of attaching it to the OCD issue.",
      "created_utc": 1713202934.0,
      "score": 2,
      "context": [
        {
          "id": "kzmgpuz",
          "author": "islandrebel",
          "body": "A lot of people with OCD have EDs for a variety of reasons. So her therapist should probably be focusing on that a bit.",
          "created_utc": 1713147925.0
        },
        {
          "id": "kznoyj1",
          "author": "nomoreredshoes",
          "body": "This is helpful, thank you! Her OCD has mostly manifested in counting things/needing things to be \"even\", but I wonder if it's been affecting her more than she's letting on. She's good at being sneaky, which I don't blame her for but makes it tough to keep her safe and healthy sometimes. Thanks again.",
          "created_utc": 1713175725.0
        },
        {
          "id": "kznrztn",
          "author": "Sam_thelion",
          "body": "She might be less ashamed of the ED if it’s spoken about as a manifestation of her OCD (assuming she already is comfortable talking about that because she’s been in therapy for it). I developed bulimia after other ED behaviors and mental health issues, ones which I felt way more comfortable talking about because bulimia is so stigmatized. I felt disgusting and ashamed all the time when I first started purging, and I was terrified of someone finding out. Just a thought!",
          "created_utc": 1713177750.0
        }
      ]
    },
    {
      "id": "kznru03",
      "author": "nomoreredshoes",
      "body": "This advice is gold. It's in line with how I parent in general, and even more importantly in line with how my daughter's personality works. Thanks again. Amazing how strangers on the internet can have such an impact in these stressful moments. All the best to you.",
      "created_utc": 1713177646.0,
      "score": 5,
      "context": [
        {
          "id": "kzn0n64",
          "author": "fireflashthirteen",
          "body": "Also, I just realised OP, no one has mentioned yet that if your child is not bingeing on food, then this could be heading down the track of Anorexia Nervosa, which is (not to scare you) the most life threatening mental health disorder we have categorised. \n\nI think you're taking an amazing approach but make no mistake, if she gets underweight, you may need to have to take intervention that she's not totally on board with. So I would recommend keeping an eye on her weight without commenting on it (and I would strongly emphasise not commenting on it unless it's unavoidable) \n\nIt might also be worthwhile reinforcing the negative effects of purging on things that she may care about as a near teen (the appearance of yellow teeth, for example), but you'd need to be careful with that as sometimes the stress associated with the negative effects can perpetuate the behaviour too.",
          "created_utc": 1713158278.0
        },
        {
          "id": "kzno85j",
          "author": "nomoreredshoes",
          "body": "My husband and I have been noticing that she often won't eat her whole dinner in recent weeks. She says her teeth are bothering her (she has braces) or she's just not hungry. But then when she got back from her dad's yesterday, she told me about alllll the food she ate yesterday (mostly junk food). And she ate her whole dinner without saying anything about her teeth bugging her. \n\nWhat does intervention look like if she won't admit to it? Do I get her PCP involved? Escalate from therapist to psychiatrist? I guess I just don't know what to do if she keeps denying any issue and there's no smoking gun in terms of behaviors.",
          "created_utc": 1713175205.0
        },
        {
          "id": "kznplg7",
          "author": "fireflashthirteen",
          "body": "If, and this is a big if, she starts entering territory where she's underweight for her height, age, muscle. mass and so on - or you know for sure that she's purging - then you could probably get her doctor involved, and consult an eating disorder specialist, who generally come in the forms of doctors (including psychiatrists), psychologists and nutritionists.\n\nI'd be very cautious about moving on this without definitive evidence or cause though; I would say having her see you as a supporter and an ally rather than someone she has to work against and/or outwit is extremely important. A much better case scenario is that you allow her to approach you for support, and then you've already got the support infrastructure scoped out and ready to go.",
          "created_utc": 1713176166.0
        }
      ]
    },
    {
      "id": "kzmen0z",
      "author": "azulezb",
      "body": "Inpatient therapy isn't really considered the gold standard for treating eating disorders in children anyway. I'm pretty sure that outpatient treatment involving a dietician, psychologist and GP is the minimum.\n\nAnd please try to get another opinion on your eating disorder yourself! You are still so young and there is no way that a good doctor wouldn't diagnose you with an eating disorder if you are purging regularly. Please be as honest with your doctor as possible because it's a diagnosis is necessary for accessing treatment.",
      "created_utc": 1713147001.0,
      "score": 1,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        },
        {
          "id": "kzmbnxh",
          "author": "None",
          "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
          "created_utc": 1713145689.0
        }
      ]
    },
    {
      "id": "kzmg7hg",
      "author": "None",
      "body": "No, inpatient therapy isn’t really gold standard for kids but a lot of parents look at it as a last resort, in a good way. And it’s definitely not. \nAlso as for getting diagnosed, Honestly i wish i could. I have brought it up to doctors and they’ve kinda just brushed over it then suggested therapy or SSRIs. I don’t want to be medicated as I hate that feeling but i have expressed that i want help and what i go through. also i’ve always been at a generally average weight.",
      "created_utc": 1713147697.0,
      "score": 1,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        },
        {
          "id": "kzmbnxh",
          "author": "None",
          "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
          "created_utc": 1713145689.0
        },
        {
          "id": "kzmen0z",
          "author": "azulezb",
          "body": "Inpatient therapy isn't really considered the gold standard for treating eating disorders in children anyway. I'm pretty sure that outpatient treatment involving a dietician, psychologist and GP is the minimum.\n\nAnd please try to get another opinion on your eating disorder yourself! You are still so young and there is no way that a good doctor wouldn't diagnose you with an eating disorder if you are purging regularly. Please be as honest with your doctor as possible because it's a diagnosis is necessary for accessing treatment.",
          "created_utc": 1713147001.0
        }
      ]
    },
    {
      "id": "kzmt4kr",
      "author": "azulezb",
      "body": "I think people were just concerned by you saying that the daughter of this concerned mother didn't need professional help. But you did also say that therapy was a good starting place - do you not think psychotherapy is professional help?\n\nI was also an average weight when I was diagnosed with bulimia (although after with a consultation with the psychologist I was referred to by my doctor) and I was not put on SSRIs until a few months later. And therapy is a necessary part of treatment if you have an eating disorder, so I'm not really sure why a doctor suggesting therapy to you has you thinking that they are brushing it off? I'm not sure if doctors really feel that comfortable diagnosing bulimia right off the bat or if they usually want the opinion of a psychologist first too - that might have been what they were trying to do with you. Although I am Australian and our healthcare system is vastly different to the US, which is where I'm guessing you are from.",
      "created_utc": 1713153969.0,
      "score": 1,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        },
        {
          "id": "kzmbnxh",
          "author": "None",
          "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
          "created_utc": 1713145689.0
        },
        {
          "id": "kzmen0z",
          "author": "azulezb",
          "body": "Inpatient therapy isn't really considered the gold standard for treating eating disorders in children anyway. I'm pretty sure that outpatient treatment involving a dietician, psychologist and GP is the minimum.\n\nAnd please try to get another opinion on your eating disorder yourself! You are still so young and there is no way that a good doctor wouldn't diagnose you with an eating disorder if you are purging regularly. Please be as honest with your doctor as possible because it's a diagnosis is necessary for accessing treatment.",
          "created_utc": 1713147001.0
        },
        {
          "id": "kzmg7hg",
          "author": "None",
          "body": "No, inpatient therapy isn’t really gold standard for kids but a lot of parents look at it as a last resort, in a good way. And it’s definitely not. \nAlso as for getting diagnosed, Honestly i wish i could. I have brought it up to doctors and they’ve kinda just brushed over it then suggested therapy or SSRIs. I don’t want to be medicated as I hate that feeling but i have expressed that i want help and what i go through. also i’ve always been at a generally average weight.",
          "created_utc": 1713147697.0
        }
      ]
    },
    {
      "id": "kzmtmvj",
      "author": "None",
      "body": "nevermind to all of you. why would you think i meant harm with anything i said??? also why try to talk about my ED when that wasn’t even the point? whatever.",
      "created_utc": 1713154246.0,
      "score": 1,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        },
        {
          "id": "kzmbnxh",
          "author": "None",
          "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
          "created_utc": 1713145689.0
        },
        {
          "id": "kzmen0z",
          "author": "azulezb",
          "body": "Inpatient therapy isn't really considered the gold standard for treating eating disorders in children anyway. I'm pretty sure that outpatient treatment involving a dietician, psychologist and GP is the minimum.\n\nAnd please try to get another opinion on your eating disorder yourself! You are still so young and there is no way that a good doctor wouldn't diagnose you with an eating disorder if you are purging regularly. Please be as honest with your doctor as possible because it's a diagnosis is necessary for accessing treatment.",
          "created_utc": 1713147001.0
        },
        {
          "id": "kzmg7hg",
          "author": "None",
          "body": "No, inpatient therapy isn’t really gold standard for kids but a lot of parents look at it as a last resort, in a good way. And it’s definitely not. \nAlso as for getting diagnosed, Honestly i wish i could. I have brought it up to doctors and they’ve kinda just brushed over it then suggested therapy or SSRIs. I don’t want to be medicated as I hate that feeling but i have expressed that i want help and what i go through. also i’ve always been at a generally average weight.",
          "created_utc": 1713147697.0
        },
        {
          "id": "kzmt4kr",
          "author": "azulezb",
          "body": "I think people were just concerned by you saying that the daughter of this concerned mother didn't need professional help. But you did also say that therapy was a good starting place - do you not think psychotherapy is professional help?\n\nI was also an average weight when I was diagnosed with bulimia (although after with a consultation with the psychologist I was referred to by my doctor) and I was not put on SSRIs until a few months later. And therapy is a necessary part of treatment if you have an eating disorder, so I'm not really sure why a doctor suggesting therapy to you has you thinking that they are brushing it off? I'm not sure if doctors really feel that comfortable diagnosing bulimia right off the bat or if they usually want the opinion of a psychologist first too - that might have been what they were trying to do with you. Although I am Australian and our healthcare system is vastly different to the US, which is where I'm guessing you are from.",
          "created_utc": 1713153969.0
        }
      ]
    },
    {
      "id": "kznooo5",
      "author": "nomoreredshoes",
      "body": "For what it's worth I found what you wrote helpful and I really appreciate the time you took to share. Thank you!",
      "created_utc": 1713175532.0,
      "score": 2,
      "context": [
        {
          "id": "kzmactb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713145109.0
        },
        {
          "id": "kzmay5t",
          "author": "springcat413",
          "body": "Any amount of purging deserves help - someone may never show the “health signs”. I do know getting her help now is so important. Unfortunately I didn’t get adequate help at that age and I only really recovered 2 years ago - I am 42. Thank you for wanting to help.",
          "created_utc": 1713145372.0
        },
        {
          "id": "kzmbnxh",
          "author": "None",
          "body": "you are right, that is why i first suggested therapy. intensive/inpatient care isn’t available to everyone for whatever the reason may be. i am in that same boat and am 18 now and no doctor has ever cared to diagnose so im in an endless loop. i dont know the personal situation of OP but sometimes the right help isn’t always accessible.",
          "created_utc": 1713145689.0
        },
        {
          "id": "kzmen0z",
          "author": "azulezb",
          "body": "Inpatient therapy isn't really considered the gold standard for treating eating disorders in children anyway. I'm pretty sure that outpatient treatment involving a dietician, psychologist and GP is the minimum.\n\nAnd please try to get another opinion on your eating disorder yourself! You are still so young and there is no way that a good doctor wouldn't diagnose you with an eating disorder if you are purging regularly. Please be as honest with your doctor as possible because it's a diagnosis is necessary for accessing treatment.",
          "created_utc": 1713147001.0
        },
        {
          "id": "kzmg7hg",
          "author": "None",
          "body": "No, inpatient therapy isn’t really gold standard for kids but a lot of parents look at it as a last resort, in a good way. And it’s definitely not. \nAlso as for getting diagnosed, Honestly i wish i could. I have brought it up to doctors and they’ve kinda just brushed over it then suggested therapy or SSRIs. I don’t want to be medicated as I hate that feeling but i have expressed that i want help and what i go through. also i’ve always been at a generally average weight.",
          "created_utc": 1713147697.0
        },
        {
          "id": "kzmt4kr",
          "author": "azulezb",
          "body": "I think people were just concerned by you saying that the daughter of this concerned mother didn't need professional help. But you did also say that therapy was a good starting place - do you not think psychotherapy is professional help?\n\nI was also an average weight when I was diagnosed with bulimia (although after with a consultation with the psychologist I was referred to by my doctor) and I was not put on SSRIs until a few months later. And therapy is a necessary part of treatment if you have an eating disorder, so I'm not really sure why a doctor suggesting therapy to you has you thinking that they are brushing it off? I'm not sure if doctors really feel that comfortable diagnosing bulimia right off the bat or if they usually want the opinion of a psychologist first too - that might have been what they were trying to do with you. Although I am Australian and our healthcare system is vastly different to the US, which is where I'm guessing you are from.",
          "created_utc": 1713153969.0
        },
        {
          "id": "kzmtmvj",
          "author": "None",
          "body": "nevermind to all of you. why would you think i meant harm with anything i said??? also why try to talk about my ED when that wasn’t even the point? whatever.",
          "created_utc": 1713154246.0
        }
      ]
    }
  ]
}