{
  "id": "1c8ct0u",
  "subreddit": "bulimia",
  "author": "tr0ublewllfindme",
  "created_utc": 1713573607.0,
  "title": "Are we even sick ",
  "selftext": "I dont feel sick. I bp multiple times a day every day, but I feel fine. I go about my life. I just went out to dinner with my husband and ate fine. I purged in the restaurant but it took no time at all and he didn't know. Went out for coffee this afternoon and same thing, purged in a shop. No one knows, no one can tell. I'm maintaining a healthy bmi. I feel fine so am I fine? What damage does bulimia actually do? \n\nWhen I was uw, I felt a lot sicker and it was harder for my body to recover from a purge. I gained a few lbs and now it's like I'm not sick at all ",
  "url": "https://www.reddit.com/r/bulimia/comments/1c8ct0u/are_we_even_sick/",
  "score": 105,
  "num_comments": 46,
  "comments": [
    {
      "id": "l0dr9se",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713574532.0,
      "score": 67,
      "context": []
    },
    {
      "id": "l0drqng",
      "author": "royceriel",
      "body": "The damage is internal and neither of us will know until it's far too late. But I don't feel sick either. Eating isn't as hard, my bmi is very healthy, and my labs are fine. I can't even take truth (that I'm sick) seriously unless I have a very bad b/p cycle.",
      "created_utc": 1713574730.0,
      "score": 55,
      "context": []
    },
    {
      "id": "l0dslx1",
      "author": "bovineuniversitygrad",
      "body": "I felt the same way until my throat turned to fire 24/7 and my gi tract was fucked to hell 😭",
      "created_utc": 1713575102.0,
      "score": 39,
      "context": []
    },
    {
      "id": "l0ei1up",
      "author": "None",
      "body": "Wait for the GERD and gastroparesis...",
      "created_utc": 1713587010.0,
      "score": 34,
      "context": []
    },
    {
      "id": "l0enz9z",
      "author": "9NUMBERS9",
      "body": "Almost 3 years B/P’ing multiple times\nA day about 5-6 days per week.\nMy teeth started cracking (hurts like FUCK when u chew\nOr drink ANYTHING) and eventually started to fall out.\nLymph nodes in throat started to swell. Face/cheeks swelled, didn’t even realize it until I looked at older pictures of me and realized I used to have a chiseled\nJaw line pre-bulimia, digestion is so fucked, takes forever to digest food I actually want to keep down, constipation is common, GERD SUCKS! Especially when trying to sleep and u have no tums/rolaids, throat was always sensitive, belly would be bloated as hell day after purges and I’d actually try to keep food down when I’d acknowledge BULIMIA IS NOT NORMAL AND ITS A FUCKING MENTAL DISORDER.\nAbout $12,000 in dentist bills for root canals, new teeth and prescription tooth paste to slow down the gum decay that’s happened from consistent purging. \n\nOh my Favorite: filing bankruptcy for the massive credit card debt I let get outta control & couldn’t get back on track from all the binge food I was buying- after working hard to get to an 830 FICO score where I literally had the best rates on anything I wanted & almost $270,000 in credit card funds. \n\nYes u are sick. Ur eating disorder is running the show  for u when u start to consider that binging and then throwing it up regularly isn’t a problem. Especially normalizing it in a public setting. \nI’m not attacking u! I struggled SEVERELY & shamefully.\nBeing caught, lying about it, barrowing money to pay bills cuz I binge ate my paycheck… then went and B/P’d the money I barrowed for bills, binging on my girlfriends 4 year olds snacks (probably did him a favor tbh lol kids shouldn’t be eating chemical ass sweets),\nCalling off work/blowing through PTO/Vac time from feeling way too weak and shitty from being up all night B/P’ing, passing out in a Starbucks bathroom from\nElectrolyte depletion then being woken up by paramedics & questioned by police & being “forced” to  prove I wasn’t intoxicated or shooting up/doing drugs & also now banned from that Starbucks (the police were going to give me a public intoxication citation if I refused to take a breathalyzer test) I flat Out told them I have an eating order and was purging & for fucks sake they didn’t even believe me lol, puking in public bathrooms and not realizing it splashed all Over my shoes and pants and returning to work meetings, dates, dinners, corporate events etc smelling like puke. We don’t realize it but others definitely smell it on us …there’s even Worse shit than that I’ve done but I’ve rambled enough.\n\nBottom line is this is not normal and it’s not Ok.\nFar fucking from.\nU don’t realize the trail of chaos it leaves around you and what it physically does to ur body and also ur mind and thought process until it’s too late.\n\nPlease don’t get comfortable with this sickness. It’s happy to make a home inside your head and take over ur life and eventually take ur life. \n\nThrowing up ur food intentionally out of fear of gaining weight is mental sickness.\n\nEating is normal- keeping it down and digesting it and using the nutrients vitamins minerals and macros in the food for fuel, body regeneration, healing, hormonal support, cellular growth and overall health is NORMAL.\n\nI hope u get on well and can beat this shit.\nIt’s hard buts it’s possible. I didn’t think it was after so many failed attempts but I finally feel like I got this recovery attempt working. I still have urges but I’m realizing it’s just that: an urge.\nI’m in control. No one or no thing actually makes me do it. I chose to do it. What’s even worse is choosing to do despite knowing how terrible it is and the side consequences—- that’s just more proof of a mental issue.\n \nI hope u find ur way out of it sooner than later & never have to deal with the ugly painful side of it.",
      "created_utc": 1713590467.0,
      "score": 21,
      "context": []
    },
    {
      "id": "l0emkk8",
      "author": "monimuni",
      "body": "It may feel like there is no damage occurring right now, but later on when you eventually do, it’ll hit you and it’ll hit you hard.",
      "created_utc": 1713589609.0,
      "score": 19,
      "context": []
    },
    {
      "id": "l0dzg9o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713578043.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l0edp7m",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1713584746.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l0epqze",
      "author": "KatMac6013",
      "body": "I can relate to this, particularly when I was in the thick of the illness and b/p was basically just part of my lifestyle. I was in denial about just how bad things were and compared to anorexia I felt great. To be blunt, eating disorders require a certain amount of self delusion in order to thrive. \nRegardless of how you may feel, the truth is that our bodies are just not meant to puke every day. If you keep going long enough you’ll face repercussions. I really hope you stop before that happens",
      "created_utc": 1713591583.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l0e8jgl",
      "author": "Freyabees",
      "body": "I completely relate to this. I BP multiple times a day. I get teeth cleanings every six months and my dentist has never said a thing. My teeth are fine. I’m a healthy BMI. I enjoy my food when I eat it and throw it up because I don’t want to gain the weight from it but I still wanna eat it. \n\nThe hardest thing is that I’ve told people in my life that I’m doing this and even three different therapists have been unable to help me at all. \n\nI seriously consider at times if the calories from digesting the food would be worse for me than just throwing it up. It literally takes under 20 seconds at this point to just yeet it.",
      "created_utc": 1713582214.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l0kuyvg",
      "author": "Pauladerby",
      "body": "9Numbers is right on. Let me explain why. I BP for decades. I did like you. No one knew. I rinsed. I went about life. Then it hits you so fast you can’t hold up. Barrett’s esophagus. Gerd. Digestion crap. Oh more! Hearing loss! Yep. Deaf in one ear. The other was going when I stopped cold turkey. Arthritis. Heart irregularities. Miscarriages. I could write a book. The shit just hits you. I have 11 dental implants. Three teeth hurt now that I’m losing. Did I say I rinse? Yes. But it does not stop the decay. I never thought it would hurt me either. I loved being able to eat and drink then purge and dance and be thin. It eats you up from inside. It’s a mental disorder. It’s cruel. It’s hard to kick. Really hard. But one day I realized it would not kill me but instead disable the crap out of me while everyone around me is fine. Wondering what’s wrong with her. Get in touch with your inner self and understand why you do this. To be thin?  Being thin won’t help if your body is decayed. I’ve gained 7 pounds since I’ve stopped. Big deal. I’m getting healthy again piece by piece. It takes a lot of will power but you are worth it. I had to see myself in a whole new light of catching up to heal. You don’t want that! I send you hugs and hope you will recover before that day hits. It comes out of nowhere. But it’s coming. (PS. I had surgery recently and the anesthesia made me sick but I could not vomit! The reflex was gone! It made me laugh.)",
      "created_utc": 1713696584.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l0hw55x",
      "author": "None",
      "body": "The more you do it, the weaker your stomach muscles become and the more likely it becomes that it will rupture.",
      "created_utc": 1713642900.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l0iwg10",
      "author": "None",
      "body": "wait until you develop esophagitis from GERD and a hiatal hernia. i also have a chronic heart arrhythmia. been doing this since i was 15 and almost 10 years later, i’ve just started developing terrible symptoms. it will catch up to you. you’re not invincible… i thought i was too",
      "created_utc": 1713656662.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l0dssvy",
      "author": "econroy",
      "body": "Depends on how long you've been doing it, but in a few years go see a dentist and that's just the tip of the iceberg.",
      "created_utc": 1713575186.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l0enrck",
      "author": "None",
      "body": "do you really think puking up your dinners, at the resturant you're with your husband at even, is normal and fine...??? your teeth will go, your throat will get destroyed, various stomach issues, breaking blood vessels in your face from the physical stain of throwing up, just to name a few damaging things. your face will get puffy. and you smell. people can smell the vomit on you. they can see the redness in your face and eyes from the force of puking. definitely not fine, and you are sick as much as you want to deny it.",
      "created_utc": 1713590330.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l0lj5iy",
      "author": "memyselfandi10089",
      "body": "I felt the same. I haven't relapsed in about 2 weeks tbh you don't realise the effects until you stop",
      "created_utc": 1713708950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l0huwqw",
      "author": "Common-Alternative96",
      "body": "Also, you’re telling your mind that you mind of hâte yourself.",
      "created_utc": 1713642456.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0i0cn5",
      "author": "brattyappledrops",
      "body": "I’m the same way I go about my day and eat and purge through but my spine is starting to hurt, sometimes I wake up and my throat sounds harsh like I’m sick but I feel I’m okay with this “life style” at the same time",
      "created_utc": 1713644427.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0jv52s",
      "author": "RuthMaudeJameison",
      "body": "There’s the potential stomach exploding. I was healthy too. Until I wasn’t.",
      "created_utc": 1713672274.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0mr9eq",
      "author": "degasballetsculpture",
      "body": "Your teeth will be damaged as well. The dentist said I had early signs of gum disease at 21 and that the enamel on my teeth had eroded. Along with plenty of cavities",
      "created_utc": 1713724876.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0obb3k",
      "author": "Infamous_Outside_584",
      "body": "Felt the same til I developed GERD and my dentist told me I have 15 cavities and receding gums.",
      "created_utc": 1713746228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0u3uke",
      "author": "azulezb",
      "body": "Maybe you don't feel that sick yet, but it's gonna catch up to you. I'm pretty much fully recovered and I still feel sick. I swear b/p destroyed my energy levels forever.",
      "created_utc": 1713840991.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l0j4v7c",
      "author": "Miserexa",
      "body": "My ed never made me feel physically sick. I had pretty much no physical effects at all. It's a mental illness though, and I did feel pretty mentally ill.",
      "created_utc": 1713660137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0j8ig4",
      "author": "3beansIn",
      "body": "Yeah I’m kinda chubby so I don’t look or feel really sick but I have totally fucked my upper and lower GI (severe constipation, severe GERD, stomach/esophageal lining has changed to resemble the intestinal lining which is a precursor to cancer, hemorrhoids, weak pelvic floor and urinary incontinence due to pushing turds out too forcefully cuz of constipation etc…) \n\nIt will hurt you if you do it long enough.",
      "created_utc": 1713661638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0kclvt",
      "author": "None",
      "body": "THIS!!!!!!!!!!!!!!!!!!!",
      "created_utc": 1713683174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0kcysg",
      "author": "None",
      "body": "literally same. Dentist has never said anything, no one has ever said anything. If I was actually sick and looked sick then people would say something but no one cares so I'm not sick. Literally threw up at work today like it was nothing.",
      "created_utc": 1713683423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0knh34",
      "author": "andreeam88",
      "body": "Think it this way and then answer yourself;\n-  humans and any other animals need food, water and sleep to function, to live\n- animals and us before all social media and “skinny society/community” never purge any food if it's not poisoning us.\n- purging is naturally occurring when one is poisoned and its body's defense mechanism to get rid of poison \n- self-inflicted purging a none toxic food is about something else\n- because we are living in a society that is not interested in or focuses on a healthy body - a body u can rely on, a body that u want to be the strongest and healthiest version, no matter what size it takes - a body that u have full concentration, u are happy, u have good dopamine, good hormone levels.\nWhat is pushed is a size - and some of us do whatever it takes to be that size, image, of what we see outside.\nAnd we try to “shape” that size throughout anything available to us - purging, fasting, surgeries, etc.\n\nSo ask yourself - do you see any problem with why are purging? \nIt feels “normal” because u look outside and fit the “goal” u wanted to look like. \n\nBut u will have to rely on the body u have for other things than its small size - it will have to keep up alive, You will rely on it to be alive and enjoy your life with your husband, and family, to just enjoy whatever time we have here.\n\nWishing u the best of luck with everything x",
      "created_utc": 1713691027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0pl8cs",
      "author": "Academic-Quantity271",
      "body": "perfect recipe for esophageal cancer",
      "created_utc": 1713770329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l105qce",
      "author": "None",
      "body": "Yeah, tbh this was me for a few years. Fast forward now, ended up in a treatment center and my teeth and throat and all that are fine, but I've been bloated for over a year straight and emotionally fucked. My body does not know how to digest food, so if you ever stop it sucks and you'll look pregnant 24/7 ",
      "created_utc": 1713935932.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1473ph",
      "author": "sgknight",
      "body": "to me b/p is worse because my face always get super puffy after a long purging streak. when i lay off it looks better. but i do miss starving and being sick and underweight. i have to remind myself constantly that bulimia is still valid and we ARE still sick. it will affect your heart and your blood pressure (i know from experience) it’s also ruined my gag reflex (i almost throw up every time i brush my teeth), my digestive tract, my teeth, my throat, and i have severe acid reflux and nausea all the time now.",
      "created_utc": 1713998254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l0kvy26",
      "author": "Pauladerby",
      "body": "I understand completely. I thought just the same thing. I really did. Read my comments though. Save your health. ♥️",
      "created_utc": 1713697243.0,
      "score": 2,
      "context": [
        {
          "id": "l0dr9se",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713574532.0
        }
      ]
    },
    {
      "id": "mieybbk",
      "author": "None",
      "body": "What did you do about it ?",
      "created_utc": 1742294631.0,
      "score": 1,
      "context": [
        {
          "id": "l0dslx1",
          "author": "bovineuniversitygrad",
          "body": "I felt the same way until my throat turned to fire 24/7 and my gi tract was fucked to hell 😭",
          "created_utc": 1713575102.0
        }
      ]
    },
    {
      "id": "l0ipbr6",
      "author": "coffeeandascone",
      "body": "Yep, I can't even bend over anymore without my stomach contents hurtling back up my esophagus all on it's own. Especially painful after a few hours mixed with stomach acid. My hiatal hernia giving me excruciating chest pain randomly.",
      "created_utc": 1713653789.0,
      "score": 10,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        }
      ]
    },
    {
      "id": "l0i6jxu",
      "author": "Noccioletta",
      "body": "What’s that that sounds so scary 😭😭😭",
      "created_utc": 1713646665.0,
      "score": 3,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        }
      ]
    },
    {
      "id": "l0jv9s7",
      "author": "RuthMaudeJameison",
      "body": "Oh, Gastroparasis suuuuucks. Can get that from not eating also.",
      "created_utc": 1713672346.0,
      "score": 3,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        }
      ]
    },
    {
      "id": "l0jx6hb",
      "author": "tr0ublewllfindme",
      "body": "I take zofran religiously but I'm sure one day it'll catch up with me",
      "created_utc": 1713673424.0,
      "score": 1,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        }
      ]
    },
    {
      "id": "l0jvtgn",
      "author": "RuthMaudeJameison",
      "body": "Yes. Thank you.",
      "created_utc": 1713672652.0,
      "score": 5,
      "context": [
        {
          "id": "l0enz9z",
          "author": "9NUMBERS9",
          "body": "Almost 3 years B/P’ing multiple times\nA day about 5-6 days per week.\nMy teeth started cracking (hurts like FUCK when u chew\nOr drink ANYTHING) and eventually started to fall out.\nLymph nodes in throat started to swell. Face/cheeks swelled, didn’t even realize it until I looked at older pictures of me and realized I used to have a chiseled\nJaw line pre-bulimia, digestion is so fucked, takes forever to digest food I actually want to keep down, constipation is common, GERD SUCKS! Especially when trying to sleep and u have no tums/rolaids, throat was always sensitive, belly would be bloated as hell day after purges and I’d actually try to keep food down when I’d acknowledge BULIMIA IS NOT NORMAL AND ITS A FUCKING MENTAL DISORDER.\nAbout $12,000 in dentist bills for root canals, new teeth and prescription tooth paste to slow down the gum decay that’s happened from consistent purging. \n\nOh my Favorite: filing bankruptcy for the massive credit card debt I let get outta control & couldn’t get back on track from all the binge food I was buying- after working hard to get to an 830 FICO score where I literally had the best rates on anything I wanted & almost $270,000 in credit card funds. \n\nYes u are sick. Ur eating disorder is running the show  for u when u start to consider that binging and then throwing it up regularly isn’t a problem. Especially normalizing it in a public setting. \nI’m not attacking u! I struggled SEVERELY & shamefully.\nBeing caught, lying about it, barrowing money to pay bills cuz I binge ate my paycheck… then went and B/P’d the money I barrowed for bills, binging on my girlfriends 4 year olds snacks (probably did him a favor tbh lol kids shouldn’t be eating chemical ass sweets),\nCalling off work/blowing through PTO/Vac time from feeling way too weak and shitty from being up all night B/P’ing, passing out in a Starbucks bathroom from\nElectrolyte depletion then being woken up by paramedics & questioned by police & being “forced” to  prove I wasn’t intoxicated or shooting up/doing drugs & also now banned from that Starbucks (the police were going to give me a public intoxication citation if I refused to take a breathalyzer test) I flat Out told them I have an eating order and was purging & for fucks sake they didn’t even believe me lol, puking in public bathrooms and not realizing it splashed all Over my shoes and pants and returning to work meetings, dates, dinners, corporate events etc smelling like puke. We don’t realize it but others definitely smell it on us …there’s even Worse shit than that I’ve done but I’ve rambled enough.\n\nBottom line is this is not normal and it’s not Ok.\nFar fucking from.\nU don’t realize the trail of chaos it leaves around you and what it physically does to ur body and also ur mind and thought process until it’s too late.\n\nPlease don’t get comfortable with this sickness. It’s happy to make a home inside your head and take over ur life and eventually take ur life. \n\nThrowing up ur food intentionally out of fear of gaining weight is mental sickness.\n\nEating is normal- keeping it down and digesting it and using the nutrients vitamins minerals and macros in the food for fuel, body regeneration, healing, hormonal support, cellular growth and overall health is NORMAL.\n\nI hope u get on well and can beat this shit.\nIt’s hard buts it’s possible. I didn’t think it was after so many failed attempts but I finally feel like I got this recovery attempt working. I still have urges but I’m realizing it’s just that: an urge.\nI’m in control. No one or no thing actually makes me do it. I chose to do it. What’s even worse is choosing to do despite knowing how terrible it is and the side consequences—- that’s just more proof of a mental issue.\n \nI hope u find ur way out of it sooner than later & never have to deal with the ugly painful side of it.",
          "created_utc": 1713590467.0
        }
      ]
    },
    {
      "id": "l0kvbf9",
      "author": "Pauladerby",
      "body": "THANK YOU for the honesty and truth!",
      "created_utc": 1713696817.0,
      "score": 3,
      "context": [
        {
          "id": "l0enz9z",
          "author": "9NUMBERS9",
          "body": "Almost 3 years B/P’ing multiple times\nA day about 5-6 days per week.\nMy teeth started cracking (hurts like FUCK when u chew\nOr drink ANYTHING) and eventually started to fall out.\nLymph nodes in throat started to swell. Face/cheeks swelled, didn’t even realize it until I looked at older pictures of me and realized I used to have a chiseled\nJaw line pre-bulimia, digestion is so fucked, takes forever to digest food I actually want to keep down, constipation is common, GERD SUCKS! Especially when trying to sleep and u have no tums/rolaids, throat was always sensitive, belly would be bloated as hell day after purges and I’d actually try to keep food down when I’d acknowledge BULIMIA IS NOT NORMAL AND ITS A FUCKING MENTAL DISORDER.\nAbout $12,000 in dentist bills for root canals, new teeth and prescription tooth paste to slow down the gum decay that’s happened from consistent purging. \n\nOh my Favorite: filing bankruptcy for the massive credit card debt I let get outta control & couldn’t get back on track from all the binge food I was buying- after working hard to get to an 830 FICO score where I literally had the best rates on anything I wanted & almost $270,000 in credit card funds. \n\nYes u are sick. Ur eating disorder is running the show  for u when u start to consider that binging and then throwing it up regularly isn’t a problem. Especially normalizing it in a public setting. \nI’m not attacking u! I struggled SEVERELY & shamefully.\nBeing caught, lying about it, barrowing money to pay bills cuz I binge ate my paycheck… then went and B/P’d the money I barrowed for bills, binging on my girlfriends 4 year olds snacks (probably did him a favor tbh lol kids shouldn’t be eating chemical ass sweets),\nCalling off work/blowing through PTO/Vac time from feeling way too weak and shitty from being up all night B/P’ing, passing out in a Starbucks bathroom from\nElectrolyte depletion then being woken up by paramedics & questioned by police & being “forced” to  prove I wasn’t intoxicated or shooting up/doing drugs & also now banned from that Starbucks (the police were going to give me a public intoxication citation if I refused to take a breathalyzer test) I flat Out told them I have an eating order and was purging & for fucks sake they didn’t even believe me lol, puking in public bathrooms and not realizing it splashed all Over my shoes and pants and returning to work meetings, dates, dinners, corporate events etc smelling like puke. We don’t realize it but others definitely smell it on us …there’s even Worse shit than that I’ve done but I’ve rambled enough.\n\nBottom line is this is not normal and it’s not Ok.\nFar fucking from.\nU don’t realize the trail of chaos it leaves around you and what it physically does to ur body and also ur mind and thought process until it’s too late.\n\nPlease don’t get comfortable with this sickness. It’s happy to make a home inside your head and take over ur life and eventually take ur life. \n\nThrowing up ur food intentionally out of fear of gaining weight is mental sickness.\n\nEating is normal- keeping it down and digesting it and using the nutrients vitamins minerals and macros in the food for fuel, body regeneration, healing, hormonal support, cellular growth and overall health is NORMAL.\n\nI hope u get on well and can beat this shit.\nIt’s hard buts it’s possible. I didn’t think it was after so many failed attempts but I finally feel like I got this recovery attempt working. I still have urges but I’m realizing it’s just that: an urge.\nI’m in control. No one or no thing actually makes me do it. I chose to do it. What’s even worse is choosing to do despite knowing how terrible it is and the side consequences—- that’s just more proof of a mental issue.\n \nI hope u find ur way out of it sooner than later & never have to deal with the ugly painful side of it.",
          "created_utc": 1713590467.0
        }
      ]
    },
    {
      "id": "l0e5l4j",
      "author": "tr0ublewllfindme",
      "body": "I'm very open about my ed with my dentist, I use prescription toothpaste and I get x-rays 2x a year. I floss daily, I don't binge on a ton of sugary food etc. I do my best to minimize enamel wear, and my dentist helps me stay on top of problems when they pop up so they don't get worse. But every time I'm still terrified.",
      "created_utc": 1713580820.0,
      "score": 8,
      "context": [
        {
          "id": "l0dzg9o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713578043.0
        }
      ]
    },
    {
      "id": "l0kv2st",
      "author": "Pauladerby",
      "body": "Read my comment. It will make you go deaf.",
      "created_utc": 1713696656.0,
      "score": 1,
      "context": [
        {
          "id": "l0edp7m",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1713584746.0
        }
      ]
    },
    {
      "id": "l0l5pu0",
      "author": "Loose_Strain8997",
      "body": "Lmao \"just yeet it\" 😂",
      "created_utc": 1713702918.0,
      "score": 2,
      "context": [
        {
          "id": "l0e8jgl",
          "author": "Freyabees",
          "body": "I completely relate to this. I BP multiple times a day. I get teeth cleanings every six months and my dentist has never said a thing. My teeth are fine. I’m a healthy BMI. I enjoy my food when I eat it and throw it up because I don’t want to gain the weight from it but I still wanna eat it. \n\nThe hardest thing is that I’ve told people in my life that I’m doing this and even three different therapists have been unable to help me at all. \n\nI seriously consider at times if the calories from digesting the food would be worse for me than just throwing it up. It literally takes under 20 seconds at this point to just yeet it.",
          "created_utc": 1713582214.0
        }
      ]
    },
    {
      "id": "l0e8tho",
      "author": "tr0ublewllfindme",
      "body": "Same!!! It takes me seconds to get it up. I eat whatever I want, I go out for dinner and meals. I purge so quickly and quietly that it's so easy to dash to the bathroom and reset.",
      "created_utc": 1713582349.0,
      "score": 1,
      "context": [
        {
          "id": "l0e8jgl",
          "author": "Freyabees",
          "body": "I completely relate to this. I BP multiple times a day. I get teeth cleanings every six months and my dentist has never said a thing. My teeth are fine. I’m a healthy BMI. I enjoy my food when I eat it and throw it up because I don’t want to gain the weight from it but I still wanna eat it. \n\nThe hardest thing is that I’ve told people in my life that I’m doing this and even three different therapists have been unable to help me at all. \n\nI seriously consider at times if the calories from digesting the food would be worse for me than just throwing it up. It literally takes under 20 seconds at this point to just yeet it.",
          "created_utc": 1713582214.0
        }
      ]
    },
    {
      "id": "l0kw6qd",
      "author": "Pauladerby",
      "body": "And your esophagus! And your hearing goes!",
      "created_utc": 1713697406.0,
      "score": 1,
      "context": [
        {
          "id": "l0hw55x",
          "author": "None",
          "body": "The more you do it, the weaker your stomach muscles become and the more likely it becomes that it will rupture.",
          "created_utc": 1713642900.0
        }
      ]
    },
    {
      "id": "l0dyau1",
      "author": "tr0ublewllfindme",
      "body": "I've been doing it for over a decade, I see my dentist regularly tho as a precaution",
      "created_utc": 1713577540.0,
      "score": 5,
      "context": [
        {
          "id": "l0dssvy",
          "author": "econroy",
          "body": "Depends on how long you've been doing it, but in a few years go see a dentist and that's just the tip of the iceberg.",
          "created_utc": 1713575186.0
        }
      ]
    },
    {
      "id": "l0j42xw",
      "author": "None",
      "body": "You made me look into hiatal hernia because I've been dealing with chest pains for years and it's made me really worried about my heart but every EKG comes back normal",
      "created_utc": 1713659810.0,
      "score": 4,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        },
        {
          "id": "l0ipbr6",
          "author": "coffeeandascone",
          "body": "Yep, I can't even bend over anymore without my stomach contents hurtling back up my esophagus all on it's own. Especially painful after a few hours mixed with stomach acid. My hiatal hernia giving me excruciating chest pain randomly.",
          "created_utc": 1713653789.0
        }
      ]
    },
    {
      "id": "l0igr9o",
      "author": "JadeBubbles_",
      "body": "GERD is really bad acid reflux and gastroparesis is delayed stomach emptying, basically.",
      "created_utc": 1713650438.0,
      "score": 4,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        },
        {
          "id": "l0i6jxu",
          "author": "Noccioletta",
          "body": "What’s that that sounds so scary 😭😭😭",
          "created_utc": 1713646665.0
        }
      ]
    },
    {
      "id": "l0jvl23",
      "author": "RuthMaudeJameison",
      "body": "My gag reflex became super lax and I simply couldn’t any longer.",
      "created_utc": 1713672522.0,
      "score": 1,
      "context": [
        {
          "id": "l0e8jgl",
          "author": "Freyabees",
          "body": "I completely relate to this. I BP multiple times a day. I get teeth cleanings every six months and my dentist has never said a thing. My teeth are fine. I’m a healthy BMI. I enjoy my food when I eat it and throw it up because I don’t want to gain the weight from it but I still wanna eat it. \n\nThe hardest thing is that I’ve told people in my life that I’m doing this and even three different therapists have been unable to help me at all. \n\nI seriously consider at times if the calories from digesting the food would be worse for me than just throwing it up. It literally takes under 20 seconds at this point to just yeet it.",
          "created_utc": 1713582214.0
        },
        {
          "id": "l0e8tho",
          "author": "tr0ublewllfindme",
          "body": "Same!!! It takes me seconds to get it up. I eat whatever I want, I go out for dinner and meals. I purge so quickly and quietly that it's so easy to dash to the bathroom and reset.",
          "created_utc": 1713582349.0
        }
      ]
    },
    {
      "id": "l0eoo9n",
      "author": "9NUMBERS9",
      "body": "Reddit name checks out 😂😂😂",
      "created_utc": 1713590904.0,
      "score": 2,
      "context": [
        {
          "id": "l0dssvy",
          "author": "econroy",
          "body": "Depends on how long you've been doing it, but in a few years go see a dentist and that's just the tip of the iceberg.",
          "created_utc": 1713575186.0
        },
        {
          "id": "l0dyau1",
          "author": "tr0ublewllfindme",
          "body": "I've been doing it for over a decade, I see my dentist regularly tho as a precaution",
          "created_utc": 1713577540.0
        }
      ]
    },
    {
      "id": "l0lc0fm",
      "author": "coffeeandascone",
      "body": "I had an endoscopy done which confirmed it. It doesn't give me trouble often fortunately.",
      "created_utc": 1713705931.0,
      "score": 1,
      "context": [
        {
          "id": "l0ei1up",
          "author": "None",
          "body": "Wait for the GERD and gastroparesis...",
          "created_utc": 1713587010.0
        },
        {
          "id": "l0ipbr6",
          "author": "coffeeandascone",
          "body": "Yep, I can't even bend over anymore without my stomach contents hurtling back up my esophagus all on it's own. Especially painful after a few hours mixed with stomach acid. My hiatal hernia giving me excruciating chest pain randomly.",
          "created_utc": 1713653789.0
        },
        {
          "id": "l0j42xw",
          "author": "None",
          "body": "You made me look into hiatal hernia because I've been dealing with chest pains for years and it's made me really worried about my heart but every EKG comes back normal",
          "created_utc": 1713659810.0
        }
      ]
    }
  ]
}