{
  "id": "1cg7ofa",
  "subreddit": "bulimia",
  "author": "Batmansbawlls",
  "created_utc": 1714418195.0,
  "title": "Is it wrong that I feel genuine hate for people that get in the way of my ed",
  "selftext": "Each time someone intervenes to prevent me from using the bathroom, assuming I'm going to purge (which I am), I'm overwhelmed with anger. It feels like everyone is getting in the way of my eating disorder, and I feel a strong urge to isolate myself . How can I change these feelings? I don't want to be alone but everyone is just getting in the way",
  "url": "https://www.reddit.com/r/bulimia/comments/1cg7ofa/is_it_wrong_that_i_feel_genuine_hate_for_people/",
  "score": 78,
  "num_comments": 11,
  "comments": [
    {
      "id": "l1ty6fj",
      "author": "Live_Setting_3091",
      "body": " \nI understand. I had my sister intervene and I felt so much rage but afterwards (the next day) I was glad. It’s good that you have people that care for you. \nI am not sure the level of intervention or how deep you are in the ED. I think there is a fine line between intervening and then being continually over-bearing.",
      "created_utc": 1714419082.0,
      "score": 18,
      "context": []
    },
    {
      "id": "l1tz5b3",
      "author": "Axidents_happen",
      "body": "I don't know where you currently want to be or whether you're working on recovery, so mind this please.\nYes, it is normal. Absolutely normal. People break up with their significant others to go deeper into the ED or go as little contact as possible. I've had bulimia for close to 4 years and the anger I've felt towards people made me go crazy. I'm not deep into it rn, but when my bf asks me how I'm doing with food I get angrier than angry (like you're the largest a**hole, I wanna break up with you) and I'm a very calm person otherwise. So yes, normal.\nWhat you can do against it is not much if you don't want to get better. \nIf you do, you need to realize that those people care about you. You might view your ED as your best friend ever, but in reality it is killing you actively. And the people who care about you don't want anything to happen that harms you. They want to help you work against the ED by trying to prevent you from purging. You'd probably do the same if you had a friend with an ED. \nTo you it will feel like they want to rip a piece of you or they want to take something insanely important away from you, but this is the disordered view. People don't want to harm you and that's important to understand regardless. \nOtherwise you could maybe tell those people that it is completely unhelpful for you or try to not purge with people around. I always avoided eating large enough quantities when I was in front of people since purging is rough for me and simply to noticeable then. \nBut whatever the hell you do, don't ever isolate yourself. Maybe be honest with the people and say that you can't eat in front of them cause it'll trigger the purging or whatever, but never ever isolate yourself. The urge might be insanely strong, but don't ever do that to yourself. \nMaybe this answer is completely unhelpful, but wishing you all the best and stay safe <3",
      "created_utc": 1714419420.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l1ujtxq",
      "author": "Dull-Veterinarian-59",
      "body": "That is not you hating them. That is your disorder<333 it’s a little demon that makes you feel and act in ways that’s out of your control. Hope you get someone to talk to",
      "created_utc": 1714426632.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l1wn8ek",
      "author": "marselijaneredford",
      "body": "Same when my fiance does this it feels like he is lying and betraying me. I’m recovered about a couple years now. Recover by reminding so yourself that they are the ones that love you who will step in front of the deaths door to save you EVEN if it makes you hate them. Thats some powerful stuff. Good luck sis",
      "created_utc": 1714460134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1yvd5v",
      "author": "Humblebaddie96",
      "body": "I don’t know a lot about how to manage those kinds of feelings. Sometimes I wish people would get on my way because I need help. No one really understands me and I could keep binging and purging. All I want without anyone even finding out unless I lose weight. That’s not a good place to be in. What’s going to prevent you an isolation from binging and purging. I know it’s not easy but I think you have to think about here is that these people they’re getting in the way because they care about you because they don’t want to see anything bad happening to you. I get it, though I know what it’s like. I don’t want others to interfere with my problems too, but it seems like the only one who really tries to interfere and get in the way of my ED and my insecurities is my boyfriend. I feel the urge to purge right now so badly but I’m not gonna do it because I feel like every time I purge I let him down. Recovery is a process just take the positives out of this they’re getting in the way because they care about you as long as they don’t get away that affects your mental health like trying to shove food down your throat and they’re trying to be nice to you about it and that’s all that matters. you also have to accept that you have a problem and that you need help that’s why we’re all here aren’t we? We’re not here to get deeper and deeper into the void of eating disorders because bulimia is here to kill us. That’s it goal. We’re trying to support each other through recovery, and that’s exactly what your family is trying to do. You should count yourself. Not many people have family and friends and loved ones around to help them with their ED. Isolation is not good you get too much into your thoughts you become too negative and then you just start to slip further and further down the hole of bulimia. It’s not easy having what we have but you gotta take it day at a time. I meant to say you need to take it one day at a time. That’s the best approach that I can offer to you. I hope you get better. I hope you find help and recover. We all need it.",
      "created_utc": 1714498036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1zjzdx",
      "author": "PinkyOutYo",
      "body": "I used to but I'm just generally chill with my ED. Purging for me is just something I do, like brushing my teeth or taking the bin out. I think it helps that my ED predates most of my relationships, so people haven't known me any other way. I'm not secretive about it, my friends are all familiar with \"Just need to go and do my thing\", so there's nothing for them to need to intervene with. I think if they saw it distressing me, it would be different, and in the early days it was. My mum described it as \"Her eating disorder is so precious to her that she will protect it at all costs\", and she was right, I would fiercely defend it against anyone trying to get in the way.",
      "created_utc": 1714506476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l21vonw",
      "author": "spooonfairy",
      "body": "it’s not wrong but it’s not right either.",
      "created_utc": 1714539706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1u7eav",
      "author": "fireflashthirteen",
      "body": "Wouldn't matter if it was. It's just the way you feel, and however you feel is okay.",
      "created_utc": 1714422256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1vqm0s",
      "author": "Evening-Affect6091",
      "body": "i don’t know how to help but you aren’t alone. i get so pissed when someone interrupts me or ask “ are you going to be sick” like yes duh",
      "created_utc": 1714443437.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1vveri",
      "author": "Sweet_Anything625",
      "body": "I have alot of anger towards my mother because i want to restrict and not binge. I’m currently living with her while I save for a home and she buys my favorite binge foods and it’s hard to deny the urge. When i live alone I’m able to control my binge because i don’t buy them.",
      "created_utc": 1714445399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1wpzp9",
      "author": "sunsetsandbouquets",
      "body": "This is normal yes",
      "created_utc": 1714462081.0,
      "score": 0,
      "context": []
    }
  ]
}