{
  "id": "1ck4yro",
  "subreddit": "bulimia",
  "author": "pieceofc4k3e",
  "created_utc": 1714841949.0,
  "title": "has anybody else had a 'honeymoon' phase w bulimia??",
  "selftext": "i always hear people w ana talking about having an ana honeymoon phase, where restricting is super easy and it feels exciting / whetevs. yk what i mean, haha😭😭 but like i hardly hear anybody talk about having something similar with mia??\n\npersonally, when i first \"unlocked\" the ability to b/p, it felt like the best thing since sliced bread. after years of restriction, i felt relieved that there was a way i could \"finally eat without guilt\". i let myself get worse and worse, my binges got bigger and my episodes got more frequent. i told myself that id stop when i wanted to, it's just that i didn't want to. i felt excited each time and i felt like i was on top of the world.\n\nflashforward to now, i feel trapped in my illness. im sick all the time and i can't stop even though i want nothing more. sometimes i still get excited to b/p, but usually it's just mechanical; b/p is just part of my life now, and i hate it.\n\nhas anybody else experienced something similar??",
  "url": "https://www.reddit.com/r/bulimia/comments/1ck4yro/has_anybody_else_had_a_honeymoon_phase_w_bulimia/",
  "score": 101,
  "num_comments": 15,
  "comments": [
    {
      "id": "l2klcmf",
      "author": "thesecretarydawg",
      "body": "Yep. I was so excited I could eat whatever and never get fat from it… I was having episodes multiple times a day and losing weight from it… I was on top of the world and I was so proud of how I looked. Welp, it doesn’t last forever… I’m back to the heaviest I’ve ever been and I am in recovery. It’s not worth it, that’s a year I’ll never get back.",
      "created_utc": 1714843940.0,
      "score": 54,
      "context": []
    },
    {
      "id": "l2ktj9g",
      "author": "beepbopboopbop69",
      "body": "this may be unpopular, but bulimia fucked up my brain function the most out of the EDs I've cycled through. Almost a high after feeling like I'd successfully expelled all the food I'd eaten...but then a very bad low after a few months and bloated face, body, and electrolyte dysfunction. The ups and downs of the disorder are extremely hard to manage.",
      "created_utc": 1714846762.0,
      "score": 24,
      "context": []
    },
    {
      "id": "l2kh51d",
      "author": "Mochihamster",
      "body": "Me. I’m plagued by constant cramps from low electrolytes and my hands have got Russell’s sign. And it’s just horrid because my hair is kinda falling out too and my teeth are getting real sensitive",
      "created_utc": 1714842510.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l2kq84w",
      "author": "MainFreij",
      "body": "Oh yeah for sure, probably for at least 2 years I kept thinking I could keep it to a minimum or stop whenever I wanted or that it wouldn't affected my studies/work/relationships or my life in general. I was very naive and now I feel like it has ruined everything for me",
      "created_utc": 1714845621.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l2njyxl",
      "author": "-lilac4",
      "body": "YES, it was like I had discovered this lawless cheat code and entered the portals to seventh heaven. For three months I was absolutely elated — until I lost so much weight I had trouble walking half a mile.\n\nFast forward five years and it’s the worst addiction I’ve ever had. You can stop doing drugs but you can’t stop eating",
      "created_utc": 1714889675.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l2lmn7o",
      "author": "heartshapedmoon",
      "body": "I also felt like I “unlocked” a skill lol. That’s a great and funny way to phrase it despite it being such a difficult situation",
      "created_utc": 1714857299.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l2mui6p",
      "author": "sozzanxious",
      "body": "definitely. i felt like i cracked the code when i could eat anything i wanted and not gain weight. but the drop from electrolytes immediately after purging basically ruined it all once i realized it was directly caused by purging (i was naive). not to say restricting isn’t just as bad, but being stuck in a b/p cycle was probably the worst time of my life (failed academics, couldn’t function, horrible relationships with family/friends). im semi recovered, almost a month since purging last, but stuck in a binge/restrict cycle. at least right now i can function pretty normally, compared to when i was purging once or a twice a day every day.",
      "created_utc": 1714875729.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2mx9gk",
      "author": "_n0thing1",
      "body": "oh yeah i definitelyyy had a honeymoon phase w bulimia, i had struggled w an ed for 2 years before ever being able to purge and so when i first started i literally felt like i had a superpower. it is kinda depressing looking back now bc i was so joyous over something that literally ruined my life lol, but as fucked up as this is, i think that this is one of the only periods of my life where i remember actually being almost happy. i would plan huge binges for fun and low-key relish in how big my binges were instead of being deeply ashamed. this time lasted maybe 3 months before purging became painful and laborious and i started to see glimpses of what was gonna come in terms of health stuff, but when i’m thinking very honestly about my ed, those first few months of bulimia were, in a weird way, pretty fun.",
      "created_utc": 1714877037.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2n9jlz",
      "author": "coffee--beans",
      "body": "Yeah, it went on for like a month, I spent all my time b/p-ing or looking forward to being able to.",
      "created_utc": 1714883227.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2wab9q",
      "author": "wneg",
      "body": "I partly chalk it up to teenage hubris, but when I first started to b/p at 16 I genuinely felt like I was cheating god himself at his own game. Being able to change the numbers on the scale so instantly made me feel like I was outpacing my own biology, and it's a high I have never since felt again. Now- over a decade later- anytime I b/p I just feel like I'm yanking back the chain on my own neck after running a little too far ahead of myself. There's nothing empowering or fulfilling about it, it's just painful and exhausting. It feels more like I'm atoning for a sin.",
      "created_utc": 1715034185.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2oxlqt",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1714919898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l2km9s2",
      "author": "pieceofc4k3e",
      "body": "yes:(( it's so frustrating. i just want this out of my life but it's so hard, man",
      "created_utc": 1714844256.0,
      "score": 7,
      "context": [
        {
          "id": "l2klcmf",
          "author": "thesecretarydawg",
          "body": "Yep. I was so excited I could eat whatever and never get fat from it… I was having episodes multiple times a day and losing weight from it… I was on top of the world and I was so proud of how I looked. Welp, it doesn’t last forever… I’m back to the heaviest I’ve ever been and I am in recovery. It’s not worth it, that’s a year I’ll never get back.",
          "created_utc": 1714843940.0
        }
      ]
    },
    {
      "id": "l2nby7e",
      "author": "Equivalent_Goal_9403",
      "body": "Not unpopular at all.\n\nIf your starving your body/brain of nutrition then this makes sense.\n\nKnow whats scary? We know we're doing this to ourself!\n\nI will admit. I haven't binged/purged for a long time. I can't handle that blood sugar crash after a purge. Wow it's intense. That's what made me stop purging. Whenever I purged my blood sugars crashed so bad that I could barely function. I went hypoglycemic and had to lay in bed. Honestly felt like my body was dying.\n\nI still clsss myself as bulimic. I just don't purge anymore. I haven't purged for a while now thankfully.\n\nI hope you manage to stop. Honestly the damage from bulimia is bad. I mean seriously bad. Not just stomach acid burning your throat and teeth etc. I'm talking. Electrolyte imbalances to the point that your heart can just stop. Your then dead. Your heart can stop mid purge due to a blood sugar drop + electrolyte imbalance. Just switch off. If you look online. It's common.\n\nPlease try and stop",
      "created_utc": 1714884593.0,
      "score": 5,
      "context": [
        {
          "id": "l2ktj9g",
          "author": "beepbopboopbop69",
          "body": "this may be unpopular, but bulimia fucked up my brain function the most out of the EDs I've cycled through. Almost a high after feeling like I'd successfully expelled all the food I'd eaten...but then a very bad low after a few months and bloated face, body, and electrolyte dysfunction. The ups and downs of the disorder are extremely hard to manage.",
          "created_utc": 1714846762.0
        }
      ]
    },
    {
      "id": "l2kimgx",
      "author": "pieceofc4k3e",
      "body": "yup yup same:( im so sorry you're going through this",
      "created_utc": 1714843016.0,
      "score": 2,
      "context": [
        {
          "id": "l2kh51d",
          "author": "Mochihamster",
          "body": "Me. I’m plagued by constant cramps from low electrolytes and my hands have got Russell’s sign. And it’s just horrid because my hair is kinda falling out too and my teeth are getting real sensitive",
          "created_utc": 1714842510.0
        }
      ]
    },
    {
      "id": "l2pb05t",
      "author": "bulimia-ModTeam",
      "body": "This post or comment was removed for: \nSharing ‘tips and tricks’ on how to do ED behaviors.",
      "created_utc": 1714925029.0,
      "score": 1,
      "context": [
        {
          "id": "l2oxlqt",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1714919898.0
        }
      ]
    }
  ]
}