{
  "id": "1ckrwiw",
  "subreddit": "bulimia",
  "author": "barahonera",
  "created_utc": 1714917605.0,
  "title": "I just diarrhead into a dustbin",
  "selftext": "I’m in shock. My mom isn’t answering my calls. Maybe I should take this to my grave but I need to tell someone. I can’t believe it. \n\nI took a laxative a couple hours ago and it just kicked in. I had a big meal before this happened, but what I was trying to purge was a bunch of sushi I ate last night. The bathroom I usually use was occupied, there are people over by the other one and I didn’t know what to do. \n\nI feel like my dog when he has an accident indoors. Some of it didn’t make it in the bin (which has a bag, fortunately) but I cleaned it up really quickly with a wipe. I need to put it in another bag and take it out. \n\nI’ve shat myself before, but never in a bin. I cannot believe this just happened to me. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1ckrwiw/i_just_diarrhead_into_a_dustbin/",
  "score": 69,
  "num_comments": 10,
  "comments": [
    {
      "id": "l2ou5jd",
      "author": "mourons",
      "body": "Oh god I'm so sorry this happened, I'm glad you could solve the situation quickly, so there wasn't any human contact made in the meantime (I assume?). \n\nI've never abused laxatives, because I'm so terrified of accidents. I've once pooped and peed my pants while purging bread. I've never purged bread again and I don't purge in public anymore. Great sacrifice, since boyfriend takes me on a dinner date weekly.",
      "created_utc": 1714918508.0,
      "score": 43,
      "context": []
    },
    {
      "id": "l2q35sx",
      "author": "shade__thrower",
      "body": "I am about to be 35, and due to bulimia, have terrible digestion. I have pooped my pants more times than I can count. Hugs x",
      "created_utc": 1714935319.0,
      "score": 26,
      "context": []
    },
    {
      "id": "l2qsivq",
      "author": "heartshapedmoon",
      "body": "This happened to me once but it went all over the wall 😭",
      "created_utc": 1714944771.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l2rtqqc",
      "author": "notalotofsubstance",
      "body": "Happened to me in the middle of an Airport, I was still purchasing my ticket, had to sprint into the pet bathroom with the artificial grass and dig through my suitcase for a pair of new panties and a fresh skirt, thank you Ducolax. \n\nYou are not alone!",
      "created_utc": 1714960429.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l2s3snz",
      "author": "islandrebel",
      "body": "If it makes you feel better, the other day I didn’t make it to the toilet in time for explosive diarrhea in a very pretty public bathroom. What’s most disgusting is I didn’t really notice I was spraying before I was fully sitting until I started to wipe myself and it was clearly farther from my anus that even that kind of diarrhea usually is. Then I got up and turned around and looked at it and was in shock. All over the back of the seat, inside of the lid, even some on the wall. I almost started crying… I was so lucky that there was 409 and air febreeze under the sink (not sure if they intended it to be there for customers to clean up after themselves or if it was just convenient, but either way it was a lifesaver).",
      "created_utc": 1714964963.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l2pk1vp",
      "author": "NighthawkUnicorn",
      "body": "Laxatives only work on the part of the bowel that is used AFTER the nutrients have been absorbed.\n\nPurging with laxatives doesn't rid the food you ate, it just prevents water being absorbed.  It's also incredibly dangerous.",
      "created_utc": 1714928362.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l2p1d0l",
      "author": "barahonera",
      "body": "Yeah I’m good. No one knows besides this subreddit and now my mom. \n\nI totally get you. I quit purging in public a while ago and I have things that I hate purging too. Bread and leafy greens!! I hate it all either way. It’s not currently enough for me to quit but hopefully this will lead me closer to that. \n\nHave a great day!",
      "created_utc": 1714921352.0,
      "score": 12,
      "context": [
        {
          "id": "l2ou5jd",
          "author": "mourons",
          "body": "Oh god I'm so sorry this happened, I'm glad you could solve the situation quickly, so there wasn't any human contact made in the meantime (I assume?). \n\nI've never abused laxatives, because I'm so terrified of accidents. I've once pooped and peed my pants while purging bread. I've never purged bread again and I don't purge in public anymore. Great sacrifice, since boyfriend takes me on a dinner date weekly.",
          "created_utc": 1714918508.0
        }
      ]
    },
    {
      "id": "l2s46pa",
      "author": "islandrebel",
      "body": "The other day I didn’t make it to the toilet in time for explosive diarrhea in a very pretty public bathroom. What’s most disgusting is I didn’t really notice I was spraying before I was fully sitting until I started to wipe myself and it was clearly farther from my anus that even that kind of diarrhea usually is. Then I got up and turned around and looked at it and was in shock. All over the back of the seat, inside of the lid, even some on the wall. I almost started crying… I was so lucky that there was 409 and air febreeze under the sink (not sure if they intended it to be there for customers to clean up after themselves or if it was just convenient, but either way it was a lifesaver).",
      "created_utc": 1714965155.0,
      "score": 9,
      "context": [
        {
          "id": "l2qsivq",
          "author": "heartshapedmoon",
          "body": "This happened to me once but it went all over the wall 😭",
          "created_utc": 1714944771.0
        }
      ]
    },
    {
      "id": "l2s48of",
      "author": "islandrebel",
      "body": "Oh you poor creature 😭",
      "created_utc": 1714965182.0,
      "score": 5,
      "context": [
        {
          "id": "l2rtqqc",
          "author": "notalotofsubstance",
          "body": "Happened to me in the middle of an Airport, I was still purchasing my ticket, had to sprint into the pet bathroom with the artificial grass and dig through my suitcase for a pair of new panties and a fresh skirt, thank you Ducolax. \n\nYou are not alone!",
          "created_utc": 1714960429.0
        }
      ]
    },
    {
      "id": "l2pnywj",
      "author": "barahonera",
      "body": "I understand that my compensatory behaviors are generally ineffective. Only I have a mental illness so that understanding prolly won’t be internalized, especially in the heat of the after-binge moment. Thanks for the reminder though!",
      "created_utc": 1714929719.0,
      "score": 25,
      "context": [
        {
          "id": "l2pk1vp",
          "author": "NighthawkUnicorn",
          "body": "Laxatives only work on the part of the bowel that is used AFTER the nutrients have been absorbed.\n\nPurging with laxatives doesn't rid the food you ate, it just prevents water being absorbed.  It's also incredibly dangerous.",
          "created_utc": 1714928362.0
        }
      ]
    }
  ]
}