{
  "id": "1dcuhv7",
  "subreddit": "bulimia",
  "author": "asacredbeing",
  "created_utc": 1718048462.0,
  "title": "Are you ‘public’ about your bulimia?",
  "selftext": "I’m really curious to see how many of you don’t mind talking about having bulimia? \n\nThe stigma and self induced shame is so hard to be in. \n\nTo anyone who speaks publicly (meant in cases where it is relevant ofc) about their bulimia: \n- how are you perceived by whoever you’re talking to? \n- What are your experiences? ❤️‍🩹\n\n\n\nAnd to anyone who doesn’t: \n- why not?\n- what are your experiences? ",
  "url": "https://www.reddit.com/r/bulimia/comments/1dcuhv7/are_you_public_about_your_bulimia/",
  "score": 64,
  "num_comments": 63,
  "comments": [
    {
      "id": "l80iu0w",
      "author": "lost-marbles69",
      "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
      "created_utc": 1718050371.0,
      "score": 64,
      "context": []
    },
    {
      "id": "l80hets",
      "author": "toucansam0384",
      "body": "Never want anyone to know about it. I blatantly deny it when my spouse catches me even. I think it's because I'm a grown ass woman with an eating disorder that I \"should have outgrown years ago\".",
      "created_utc": 1718049897.0,
      "score": 27,
      "context": []
    },
    {
      "id": "l80o5vl",
      "author": "sendmegyros",
      "body": "I don't tell anyone IRL, because I am very private. I find it hard to be vulnerable. I've told one person that I have had an ED in the past, but that's it.",
      "created_utc": 1718052142.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l80flat",
      "author": "calfreak",
      "body": "Nope not at all… took me a while to even admit to my therapist",
      "created_utc": 1718049289.0,
      "score": 25,
      "context": []
    },
    {
      "id": "l80j4y0",
      "author": "hazel_eyes96",
      "body": "Definitely not public… I would love to be but can’t even tell my therapist how bad it is… working on reducing the shame and trying to understand how/why I got here :/ that being said I find so much inspiration from and admiration for people who do speak out about their struggle bc that has so much power in making others feel less alone, spreading awareness/educating others, and reducing the stigma.",
      "created_utc": 1718050470.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l80n7ug",
      "author": "Percy2303",
      "body": "Im not ‘public’ about it per se but i can talk about it with very close friends, especially if theyve been through EDs or other mental illnesses",
      "created_utc": 1718051822.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l816kyo",
      "author": "None",
      "body": "yea and I'm not in recovery. most people don't know any1 with bulimia, or at least not any1 who's told them. people don't know what to say...others with eating disorders we just vent to each other sometimes it can get competitive",
      "created_utc": 1718058785.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l81u6gg",
      "author": "EducationalCheetah79",
      "body": "I am not, and while it may sound a but awful, I think very very often about how Princess Diana, Amy Winehouse, and Lady Gaga, just to name a few people being open about Bulimia healed me in a way I can’t describe. I feel awful that they suffered but bulimia is so little talked about openly compared to other ED’s. The act of BPing feels otherworldly sometimes to me, like I made it up. The idea of women as strong and as lovely as Princess Diana succumbing to the same weakness as me— it helps with the shame and makes me feel more human. What I mean to say is I wish it was more openly talked about.",
      "created_utc": 1718068307.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l80ocp9",
      "author": "ZhangSuofei",
      "body": "Only one of my friends and my therapist know. It was very difficult to tell them about it. Before becoming bulimic, I had been struggling with ana for two years. For some reason, talking about the fact that you are fasting is less embarrassing than talking about the fact that you are purging (for me). Fortunately, my friend supported me and never told anyone else",
      "created_utc": 1718052205.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l80rjmo",
      "author": "ladymcgonagall",
      "body": "I could go public once I really started my recovery - I think talking about it with some people is already a big step in the recovery process.\n\nI like that my friends know because if I have a bad day and food gives me stress they can help me out.\n\nI also share it with medical staff, especially if I think it could be relevant to the current issues, eg. dental issues. They have always been very positive about it - they appreciated that I shared it with them, asked about my current state and if I got the help I needed, and told me to be proud of myself that I could talk about it.\n\nI also find it important to talk about it with any kinds of personal coach, or professional who are helping you with a healthy lifestyle change, so they know that some sentences could be triggering. None of them ever blinked an eye - they probably learn about EDs during their studies, so they know what it is about. Informing them helps them to provide you with the support you need.",
      "created_utc": 1718053283.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l80zybd",
      "author": "Queenofwands1212",
      "body": "I’m very open about it to my therapists but I wouldn’t ever make it “public”. I find that to e\nBe bizarre tbh. Like why would I go on Instagram and willingly let everyone know I’m bulimic? I hate the double standard too when it comes to addiction. It’s obvious I have an Ed. But with drug and alcohol addicts it’s totally accepted to talk about addiction and their life and process but for someone with anorexia or bulimia it’s like taboo. I hate it but I won’t be letting social media in on my privacy like that. Nothing good would come from it",
      "created_utc": 1718056271.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l82276j",
      "author": "glossyjade",
      "body": "Absolutely not. I feel like there is so much stigma about the disorder. It is almost always portrayed in such a negative light in media, often as a way to show that a woman is shallow but too \"lazy\" to diet the proper way.\n\ni feel a lot of shame around it, and i just would hate for others to know, especially because i feel like people would start trying to watch me and prevent me from purging",
      "created_utc": 1718071663.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l80zvmw",
      "author": "thenaanprophet",
      "body": "I've struggled with this for almost 20 years and have only started trying to get better for the last 3. Honestly, admitting it to some people closest to me was my first step to recovery. Now I'm comfortable talking about it to pretty much anyone who knows me. I agree that there is just too much stigma around  it which only makes it worse because you feel like you're all alone even though so many more people have to be dealing with this or similar, right?! I actually feel much less ashamed now to talk about it because I'm so proud of the progress I've made so far and it just cancels out the shame somehow. I haven't felt any judgement from anyone I've told yet, which surprises me because I'll talk pretty openly about it lol life is too short and I've wasted too much of it already, by hiding and hating myself. Choosing to get better is choosing to love yourself and I don't want to hide that because I am so proud of myself.",
      "created_utc": 1718056244.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l8199w8",
      "author": "supermarket_Ba",
      "body": "I rarely disclose.",
      "created_utc": 1718059838.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l81bjfg",
      "author": "ForsakenShow4997",
      "body": "I can't not make jokes about traumatic shit and sometimes the disorder is material that I can't pass up. People just kinds go \"ope\" and don't react. I also don't look like I have an ED and I think that makes it easier for others to ignore.",
      "created_utc": 1718060726.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l82r3sa",
      "author": "fatale_x",
      "body": "Nope not at all.\n\nI can 'pretend' to be fine when out with friends and family and even on vacations, but once I'm alone the B/p cycle starts.",
      "created_utc": 1718083879.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l815dip",
      "author": "DeafCricket",
      "body": "I’ve been more open/public about it since being in recovery. Sometimes in the form of social media statuses speaking out against food fear mongering and whatnot. It’s usually met with care and support.",
      "created_utc": 1718058319.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l81mxm3",
      "author": "tittyswan",
      "body": "No, I haven't even talked to my doctor about it. In my mind it's not that serious and I have it under control 🤷‍♂️",
      "created_utc": 1718065336.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l82auyc",
      "author": "uneven_tits",
      "body": "I've mentioned to  a couple of people about my throwing up but I haven't told anyone about the binges, those are so embarrassing for me. \nNormally my friends r just like \" dude that's not normal, get help\" then they dismiss it and we all go about our days.",
      "created_utc": 1718075364.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l838v5q",
      "author": "Spiritual_Worker3062",
      "body": "Yes I am. For one its easy for me, cuz I naturally distance myself from my illnesses. I view them as obvious facts. I cant let myself “feel” anything about them. Not a good thing, dont get me wrong. Also I tell people about it, so they might not feel ad alone as i did. \n\nPeople generally react pretty well. Tbh there are situations where its best not to mention it, but even then, if I had to, it wouldn’t be much of a problem. In my experience a lot of people don’t know how to react. But not ina negative way, they just don’t want to say something wrrong. I think. They don’t start convincing me to recover either. They may ask questions, but usually ask if im comfortable sharing this. \nHow am I perceived? Good question. I think it comes off as being genuine. And if they see im okay sharing stuff like this, they feel encouraged to do so as well.\n\nI will also mention this hasn’t always been the case. When i was younger everyone had something to say, even people who literally had know idea what an ed is. Which is good, lucky them, but don’t give me a lecture xd people also felt they had influence on me so they tried to kinda talk me out if it. \n \nOne thing is for sure: I cant think of a time when I was bullied because of this. Even people who couldn’t really handle the information, never tried to intentionally hurt me",
      "created_utc": 1718096168.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l83w646",
      "author": "newgirleden",
      "body": "i talked about it exclusively to my boyfriend, my best friend for +14y and a very close friend.\n\n- my boyfriend was adorable, he reacted the best way possible and helped me recover like no one else in my life. he was freaked out but he didn’t let it show at all on the moment which really helped me not feel like a monster as i often do\n\n- my best friend takes it very seriously and is also very supportive in my recovery. she doesn’t care as much but she’s always very careful on what she says about food when she’s with me\n\n- my close friend took it seriously on the moment but she wouldn’t stop giving me the “i would’ve never been able to tell”, which is still to this day pretty annoying. i know you can’t tell, i did everything to hide it - move on. also she won’t stop making jokes about me eating too little sooo that kinda stopped me from ever telling a friend again lol",
      "created_utc": 1718109793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l85eefv",
      "author": "stiddybounce",
      "body": "I don’t think I ever wanted to be public about it , but anyone around me seeing me go to the bathroom very quickly after I ate I’m sure started to wonder and it’s pretty hard to hide after awhile. I’ve been open about it to those I’m close with , and even some strangers that feel the need to ask why I’m taking so long bc it upset me why anyone would think it’s their business. Anytime I eat a lot of food in front of anyone I wonder what they think when I get up and walk away. I’ve even asked friends for hair bows. It is embarrassing for me at times, but my friends also try to talk to me to distract me a lot after that happens , I don’t binge very often but when I do overeat I feel like everyone knows what’s about to happen. Yes it’s embarrassing to me but it’s part of who I’ve become facing this ED. It’s very normal to people around me, and I didn’t think anyone really cared. Until one day my bestfriend ( this was around 3 years ago) told me I can’t get sick at her house anymore because her daughter was asking “why was I always sick” and could hear me I guess. I left very quickly and cried for a while about this. She was only protecting her daughter, and I felt sick knowing a child who is like my own heard me do such a thing to myself ( she obviously didn’t know I was forcing this ) but when she gets older if she remembers it could impact her. The wildest thing about this for me is when I was around 12 years old my mom had a friend come over and she brought her daughter , who was probably 16 at the time . She asked me if she could use my bathroom upstairs and of course I said yes. She had been there for a while so I went up to check on her, I could hear what was happening and when she came out I asked if she was ok. She told me everything was fine and that she just got sick sometimes after she eats but I didn’t need to worry about her. I wish to this day I never saw that. It never left my brain what had happened and seeing what I do to myself now, I feel so sad for her. She probably didn’t mean for me to hear her retching either. Of course at that age I wasn’t aware it was forced. I do now. And I cry inside for anyone else struggling who wishes no one could hear. I’ve even had girls ask when I have come out of a bathroom stall in public if I was ok, and I’ve lied and said I “drank too much” . Yes I have hid it from strangers , yes I’ve hid it from family until they realized. I felt very alone, and I still do dealing with this disorder. It’s become such an easy thing for me, and it’s become purely something I do when I overeat or don’t eat a safe food. It’s become a part of my daily routine. This disease inside of us , is killing me. No matter how many people know that I have bulimia, only one has pushed me to get help.",
      "created_utc": 1718128859.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l8cvy95",
      "author": "BeachyyB",
      "body": "No one in my life knows besides my therapist. I’m 27 so it’s really not a maturity thing for me, I’ve just been so private about it because I don’t even fully understand it. It’s hard for me to process and as I’m still learning about it it feels off to be public about. My personal experience",
      "created_utc": 1718240367.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lazgz08",
      "author": "Nischajellisa",
      "body": "I am open about it, towards friends and everyone else. But not towards family, i know they would break to hear that my ED got back.",
      "created_utc": 1719759302.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l81back",
      "author": "Fuwa_Fuwa_",
      "body": "I have told a handful of people willingly, but whiever was involved with my outpatient treatment, they also, but in greater detail.",
      "created_utc": 1718060628.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81khw1",
      "author": "strwbrryhnye",
      "body": "I've been bulimic for 7 years.  With my family i am pretty candid since theyve known about it for several years, and have tried to encourage recovery and treatment. With friends maybe 2-3 people know and they never ask me about it so i never bring it up",
      "created_utc": 1718064336.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81o455",
      "author": "Unreasonably_Good",
      "body": "I tell people- selected friends- it helps to when I slip up because part of what helps heal it is it being out in the open. You can’t deny it then",
      "created_utc": 1718065826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81qfab",
      "author": "5star-my-notebook",
      "body": "My ED got “exposed” less than a year after it started by some medical tests when I was 13, so my whole family has known for over 6 years. I gave up trying to hide it once I reached high school, so pretty much all of my friends know.",
      "created_utc": 1718066768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81tycy",
      "author": "generalpsych",
      "body": "Not really, no. Close friends know about it along with my immediate family but no one else. I also don't tell people about my bulimia because for me isn't a food/weight/body image thing and never has been (not even in the slightest) and I hate the thought that people might think that it is. I only tell people if I can properly explain it to them, and even then I haven't told that many people.",
      "created_utc": 1718068214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81umth",
      "author": "Colin_Zeal0",
      "body": "I told them to few people but they seem to forget it\nI used to think that they pretended not to remember so as not to talk about it, but they really seem to forget it.\n\nSometimes it makes me sad as i don't have family and friends, makes me feel i'm forgettable",
      "created_utc": 1718068498.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8213g5",
      "author": "fireflashthirteen",
      "body": "Only after I'd recovered. Once you've beaten a weakness, it becomes a strength - no reason to be worried talking about it. But yeah, in the throughs, I keep all vulnerabilities private. People may say it doesn't change the way they see you, but it absolutely does.",
      "created_utc": 1718071206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l82o2dk",
      "author": "gomichan",
      "body": "Not at all. Took me forever to tell even the people closest to me. I've tried to tell others at my therapists advice but it's soooo hard to because of all the shame I feel. So far, only my immediate family know (and that's after months of therapy helping me tell them) and my bosses know because it was either I told them what's going on with me or get fired because it was showing in my work. \n\nI want to open up more about it, because when I first told my dad, and he was sort of reeling with it, he was at work and a close female coworker asked him what's wrong because she could tell he was quiet and he shared what I'd told him, and he said she instantly started crying because she had it too and had never told anyone, not even her husband. My dad was the first person she'd ever told about it and the first time she's talked about it out loud. \n\nSimilarly, when I told my boss, it was during a work review because my work had been declining, and she was in tears as well because her daughter had been put in the hospital because of an ED and she knew what it was like. \n\nI think it could really help people being open and honest about my struggles, but like I said it is HARD.\n\nEdit to add: the very first person I told was a teletherapist I was given through my work. I had 4 free sessions with her (everyone at my workplace did) and it wasn't till like....we were saying goodbye at the final session did I finally admit it to her. And you know what? She said she had watched her sister suffer the same thing and she was able to point me to my current amazing therapist.",
      "created_utc": 1718082081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l838bwb",
      "author": "Olivewhales",
      "body": "I've only told a very close friend and my boyfriend. I actually had the intention of not telling anyone, but I was having a lot of health concerns that were worrying them (luckily I was recovering from the bulimia and health problems) and it made sense to tell them. \n\nBut generally I won't tell people. However, I'm not against telling someone I trust if it happens to come up in conversation.",
      "created_utc": 1718095777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l83osxd",
      "author": "emotional_low",
      "body": "I usually don't tell people unless they know me well, *especially* if I'm suspicious that the other person also has an ED (because I don't want it to  become competitive/ have a bad influence on the other person).",
      "created_utc": 1718106278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8455nv",
      "author": "lostnfound30",
      "body": "Some friends and family know + therapists\nA lot of people don't really understand what you're going through so I don't talk in depth about it",
      "created_utc": 1718113492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l84azxw",
      "author": "Pauladerby",
      "body": "I told NO ONE during my 45+ years. Not even my husband knew. It made my recovery peaceful. Clean almost 9 months. I’m very open now about my journey.",
      "created_utc": 1718115661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l84ypen",
      "author": "thanksyalll",
      "body": "I only started being public about it after my recovery",
      "created_utc": 1718123697.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l85afmj",
      "author": "None",
      "body": "I don’t tell anybody about it. I want to be more open but people are very judgmental.",
      "created_utc": 1718127564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l85ckry",
      "author": "daniabear",
      "body": "Some of my close friends know. My family doesn't. But I'm vocal about having struggles with ED's online or with friends I trust. I just don't really talk about in the open, only if the conversation requires me to mention it or my struggles with it.\n\nEdit: Those who know are accepting and love me nonetheless and try to be there for me if I'm having a hard time. They never judge me. They only give me words of encouragement that make me feel loved and like I'm not fighting this battle alone.\n\nBut I wouldn't really tell my family, coz I already deal with enough problems as it is. They know a lot about most of my problems, and I even have a lot of allergies and issues with digestion, so they know I puke and vomit coz of nausea sometimes. But they don't know that what caused all these bad problems was \"bulimia\" in itself. They don't even think something like that exists whenever I mention it in front of them. So it's whatever.",
      "created_utc": 1718128264.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l865q4u",
      "author": "honeypotofluck",
      "body": "nope. unfortunately. i think i’m just ashamed that i’ve carried the harsh lessons about food, internalized self hate about my body, and all else that drives me away from ever wanting to acknowledge or tell anyone about.",
      "created_utc": 1718137910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l86pioc",
      "author": "beijerinck",
      "body": "I talk about it as an experience of my past even though it is never really gone. I constantly experience relapses varying in intensity. But yea, I talk about it.",
      "created_utc": 1718144869.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l87l21h",
      "author": "orangepepsicola",
      "body": "Hell no!! I talked about it once with my friends and they treated me completely different. When I had Ana they were so much nicer",
      "created_utc": 1718158000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l881rrr",
      "author": "beepbopboopbop69",
      "body": "hell no. it's my DiRtY secret.",
      "created_utc": 1718165730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l88wxnt",
      "author": "Pau0622",
      "body": "I’ve only told my partner and a couple close friends, I’ve recovered but I still don’t like to share it, especially with my parents or siblings",
      "created_utc": 1718186204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8bgqdx",
      "author": "eijibot",
      "body": "tbh i just dont care if someone brings it up im like yeah i have bulimia nobody around me seems to care so i dont care either",
      "created_utc": 1718221532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8elruz",
      "author": "t0xicsiren",
      "body": "I am not the first one to mention it but if someone brings this subject up, I don’t really mind talking about it and exposing myself. I felt shame for a long time but just realised most people are only prejudiced about EDs in general due to lack of true knowledge about it and such, not really their fault most of the time… so I just try to educate ppl who seem like they want to learn and help, and ignore ppl who’re just clearly jerks lmao",
      "created_utc": 1718274414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8q1lid",
      "author": "Fine_Ant9507",
      "body": "Yes, I am. Because in my mind it's not a big deal. I usually don't go out of my way to tell people, because i don't want them to read it as a cry for help, but if someone is suspicious of me, i usually just tell them in a joking manner. reactions vary. sometimes older women are more concerned for me, but men/people closer to my own age usually laugh it off because i play it off or because they think i'm joking. idk just a pattern i notice lol.",
      "created_utc": 1718458695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8taoxf",
      "author": "DimensionThin147",
      "body": "What's a way to be public about it? I suffered for years decades of hiding it",
      "created_utc": 1718508653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l81g3jj",
      "author": "worldsbestlasagna",
      "body": "I was diagnosed atypical anorexia but I vomit. I've told 3 people at work and it turned out two also have a history of vomiting.",
      "created_utc": 1718062552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l80qi5i",
      "author": "sweetfaerieface",
      "body": "I am the same! I think it is because when you are in recovery you no longer feel the shame. At least that’s what I think.",
      "created_utc": 1718052929.0,
      "score": 9,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        }
      ]
    },
    {
      "id": "l8167xx",
      "author": "DeafCricket",
      "body": "Same here. I think when I was being secretive in my ED it’s just because I didn’t want to deal with anyone else’s concern. I only talked about it with my therapist, but I wasn’t truly ready for the help just solely out of fear on the changes it might’ve made to my body. Another fear was the healing in general. When I was admitted to a psychiatric ward for unrelated matters, I didn’t have the same bathroom opportunities to support my ED. By the time I got back home, my belly was distended. My digestive system was completely shut down. I was afraid of that happening again.",
      "created_utc": 1718058643.0,
      "score": 3,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        }
      ]
    },
    {
      "id": "l89fe2w",
      "author": "competent2",
      "body": "\nI am recently in recovery and my family and significant other’s family keep making snarky comments about my weight gain. Like they have no idea, stfu!",
      "created_utc": 1718196107.0,
      "score": 2,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        }
      ]
    },
    {
      "id": "l8pku35",
      "author": "LovelyBerries23",
      "body": "Are you saying you gain weight when you stopped?",
      "created_utc": 1718449405.0,
      "score": 2,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        }
      ]
    },
    {
      "id": "l85k7sb",
      "author": "Kikiiii125",
      "body": "Yo my weight gain was the HARDEST and I mean HARDESTTTT part I couldn’t even go to school bc of it 😭",
      "created_utc": 1718130779.0,
      "score": 1,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        }
      ]
    },
    {
      "id": "l83gjnh",
      "author": "candyred1",
      "body": "Hey don't think you're by any means alone. Many many of us are still riding the \"teenage ED wave\". I am 47, started at 13. \n\nI started telling friends and a couple close family about it maybe 10 yrs ago. My kids didn't know. It hurts most of all because now one of my twins has bulimia/anorexia for the past year. I opened up to her (them) when she told me. Right now she is in residential for the second time and hasn't been home in almost 2 months. She is fighting recovery and I feel like such a a failure trying to save her life when I have and am this lifelong bulimic.",
      "created_utc": 1718101604.0,
      "score": 10,
      "context": [
        {
          "id": "l80hets",
          "author": "toucansam0384",
          "body": "Never want anyone to know about it. I blatantly deny it when my spouse catches me even. I think it's because I'm a grown ass woman with an eating disorder that I \"should have outgrown years ago\".",
          "created_utc": 1718049897.0
        }
      ]
    },
    {
      "id": "l8q0rkq",
      "author": "Fine_Ant9507",
      "body": "ugh i relate to this so much. :(",
      "created_utc": 1718458277.0,
      "score": 1,
      "context": [
        {
          "id": "l81bjfg",
          "author": "ForsakenShow4997",
          "body": "I can't not make jokes about traumatic shit and sometimes the disorder is material that I can't pass up. People just kinds go \"ope\" and don't react. I also don't look like I have an ED and I think that makes it easier for others to ignore.",
          "created_utc": 1718060726.0
        }
      ]
    },
    {
      "id": "l85mcdt",
      "author": "Kikiiii125",
      "body": "Perioddd.",
      "created_utc": 1718131477.0,
      "score": 2,
      "context": [
        {
          "id": "l81mxm3",
          "author": "tittyswan",
          "body": "No, I haven't even talked to my doctor about it. In my mind it's not that serious and I have it under control 🤷‍♂️",
          "created_utc": 1718065336.0
        }
      ]
    },
    {
      "id": "l85mzw7",
      "author": "Kikiiii125",
      "body": "Deadass bro",
      "created_utc": 1718131692.0,
      "score": 2,
      "context": [
        {
          "id": "l82auyc",
          "author": "uneven_tits",
          "body": "I've mentioned to  a couple of people about my throwing up but I haven't told anyone about the binges, those are so embarrassing for me. \nNormally my friends r just like \" dude that's not normal, get help\" then they dismiss it and we all go about our days.",
          "created_utc": 1718075364.0
        }
      ]
    },
    {
      "id": "l8ed4al",
      "author": "asacredbeing",
      "body": "I am the same as you. But I am open to my parents, sibling and close friends aswell. I definitely don’t understand my bulimia yet so the rest of the world won’t be able to either 😅",
      "created_utc": 1718268651.0,
      "score": 1,
      "context": [
        {
          "id": "l8cvy95",
          "author": "BeachyyB",
          "body": "No one in my life knows besides my therapist. I’m 27 so it’s really not a maturity thing for me, I’ve just been so private about it because I don’t even fully understand it. It’s hard for me to process and as I’m still learning about it it feels off to be public about. My personal experience",
          "created_utc": 1718240367.0
        }
      ]
    },
    {
      "id": "lazz7pa",
      "author": "asacredbeing",
      "body": "I understand completely.❤️ this is actually a term we know in nursing as “the shield of love”. I wish you the best and I hope you get the support you need from your friends",
      "created_utc": 1719765841.0,
      "score": 1,
      "context": [
        {
          "id": "lazgz08",
          "author": "Nischajellisa",
          "body": "I am open about it, towards friends and everyone else. But not towards family, i know they would break to hear that my ED got back.",
          "created_utc": 1719759302.0
        }
      ]
    },
    {
      "id": "l8uelll",
      "author": "asacredbeing",
      "body": "A way to be public is to share it with your friends and family and to not mind sharing it if anyone else asks you about eating disorders. (Not bc they are particularly thinking you have one, even just in casual conversation about ED’s) ❤️",
      "created_utc": 1718535142.0,
      "score": 2,
      "context": [
        {
          "id": "l8taoxf",
          "author": "DimensionThin147",
          "body": "What's a way to be public about it? I suffered for years decades of hiding it",
          "created_utc": 1718508653.0
        }
      ]
    },
    {
      "id": "l8ask2i",
      "author": "lost-marbles69",
      "body": "That is FUCKED. If my family did that shit it would make me spiral back into my ED. I’m so sorry",
      "created_utc": 1718213585.0,
      "score": 1,
      "context": [
        {
          "id": "l80iu0w",
          "author": "lost-marbles69",
          "body": "I actually am. I lived in secret for a long time but now that I’m in recovery, I don’t really feel shame in it anymore. I mostly feel shame about my weight gain. But when I was in my ED I was very much secretive. But now I’m an open book and if people are judgy I’m just like fuck it.",
          "created_utc": 1718050371.0
        },
        {
          "id": "l89fe2w",
          "author": "competent2",
          "body": "\nI am recently in recovery and my family and significant other’s family keep making snarky comments about my weight gain. Like they have no idea, stfu!",
          "created_utc": 1718196107.0
        }
      ]
    },
    {
      "id": "l83jl8u",
      "author": "toucansam0384",
      "body": "I'm so sorry about your daughter.  My teenage daughter is starting to restrict and become obsessive with food. It breaks my heart and no matter what I say to her, it will never be enough. I'm 40, started at 20....I guess I thought by now I would have \"outgrown\"  this nightmare. Please don't feel like a failure, we never wanted this for our kids, it sounds like she is getting better help than we had when we were younger and you are doing all you can to help her ❤️",
      "created_utc": 1718103463.0,
      "score": 7,
      "context": [
        {
          "id": "l80hets",
          "author": "toucansam0384",
          "body": "Never want anyone to know about it. I blatantly deny it when my spouse catches me even. I think it's because I'm a grown ass woman with an eating disorder that I \"should have outgrown years ago\".",
          "created_utc": 1718049897.0
        },
        {
          "id": "l83gjnh",
          "author": "candyred1",
          "body": "Hey don't think you're by any means alone. Many many of us are still riding the \"teenage ED wave\". I am 47, started at 13. \n\nI started telling friends and a couple close family about it maybe 10 yrs ago. My kids didn't know. It hurts most of all because now one of my twins has bulimia/anorexia for the past year. I opened up to her (them) when she told me. Right now she is in residential for the second time and hasn't been home in almost 2 months. She is fighting recovery and I feel like such a a failure trying to save her life when I have and am this lifelong bulimic.",
          "created_utc": 1718101604.0
        }
      ]
    }
  ]
}