{
  "id": "1e0ld0o",
  "subreddit": "bulimia",
  "author": "BreadStickEater",
  "created_utc": 1720692558.0,
  "title": "Can we just rant about our problems with bullimia, like the ones we dont bring up?",
  "selftext": "   Honestly I'm just curious as to what other people have to deal with that isn't that well known like the teeth side of things.\n   Literally can be anything, even if it is a rant about your dental issues.\n\n   Right now I'm dealing with;\n-   The occasional very painful heartburn that can happen every time I lay down. (Depending on how bad I b/p recently.)\n-   Needing to vomit after I eat, if I don't it either comes back up as painful bile/heartburn or I quite literally projectile vomit some of it which has happened through my mouth and nose.\n-    The constant crushing guilt and shame I feel.\n-    Not caring about much else, alongside a messy room which most likely smells horrid.\n -   Disposing of the vomit and trash.\n -   A very painful sore onto of my mouth which I assume is from the vomitting yet I have still been doing it.\n-   Constant worry of rotting teeth and panicking if they hurt yet I hardly can bring myself to brush them because I will most likely b/p soon anyways\n-   Worry about the fact I'll smell like vomit\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1e0ld0o/can_we_just_rant_about_our_problems_with_bullimia/",
  "score": 108,
  "num_comments": 99,
  "comments": [
    {
      "id": "lcnjr95",
      "author": "DirtybutCuteFerret",
      "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
      "created_utc": 1720693566.0,
      "score": 124,
      "context": []
    },
    {
      "id": "lcnjh2r",
      "author": "Saturn11dae",
      "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
      "created_utc": 1720693391.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lco43pu",
      "author": "Just-Rough-4621",
      "body": "The constant pimples on my cheeks and chin due to getting vomit on my face. Just horrible. \n\nOh and the annoying back pain after b/p sessions.",
      "created_utc": 1720703510.0,
      "score": 30,
      "context": []
    },
    {
      "id": "lcnxrhp",
      "author": "fatale_x",
      "body": "For me it has to be the chipmunk cheeks. I hate them so much!! I'm trying to stop b/ping to get rid of them but I can only last a few days before relapsing.",
      "created_utc": 1720700843.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lcpjlfl",
      "author": "weird4utum",
      "body": "One of the worst things for me is the amount of money I spend on b/p food, and the wrappers and trash and old food I find in my room, it was a total wake up call when I went to the store to buy food and realized I had spend over $100 in 2 days on junk food.",
      "created_utc": 1720720802.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lco8cwi",
      "author": "thenaanprophet",
      "body": "Twice, I clogged the toilet and couldn't get the plunger fast enough and it overflowed I had to clean all the gross vomit/toilet water from the bathroom floor.",
      "created_utc": 1720705162.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lcomxtq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1720710243.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lcnpj7x",
      "author": "lumpy_space_queenie",
      "body": "Totally with ya on the heartburn. I haven’t purged (regularly) in almost 2 years. I’ve had a few relapses here and there…but I’ve had to be on prescription medication for my heartburn ever since. Probably always will. \n\nAlso when I swallow, my throat makes this weird knocking sound and I feel like there is something catching in my throat. I hope this goes away but idk I’m not holding my breath",
      "created_utc": 1720696879.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lcpxks1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1720725338.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lcqng81",
      "author": "Express_Possibility5",
      "body": "Not being able to purge while trying really hard.",
      "created_utc": 1720733908.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lcr5w6p",
      "author": "13aquamarine",
      "body": "Transparent teeth as the inside bit slowly disappears..",
      "created_utc": 1720740617.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lco989o",
      "author": "SakuraSkye16",
      "body": "Accidentally getting barf in your hair or your nose ;-;",
      "created_utc": 1720705491.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lcokmop",
      "author": "CarpetDisastrous1963",
      "body": "Broken blood vessels on face after barfing 🥲",
      "created_utc": 1720709475.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lcqm0gy",
      "author": "Maleficent_Market657",
      "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
      "created_utc": 1720733407.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lcqqia5",
      "author": "None",
      "body": "Food. In. Nose. It. Is. Horrific.",
      "created_utc": 1720734982.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lcqvtxj",
      "author": "candynymph",
      "body": "The teeth thing was the biggest one for me. I’m gonna have to spend $8k to get mine fixed 🫠 until then I’m in constant pain. Not to mention the amount of money I’m spending monthly on laxatives, and how badly they have affected my health and life overall",
      "created_utc": 1720736915.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lcrfj0g",
      "author": "Scared-Addition-8126",
      "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
      "created_utc": 1720744219.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lcsat2j",
      "author": "qweobi",
      "body": "Urinary incontinence.  :/I’ve never given birth and am a young person but pee leaks sometimes if I wait just a bit too long to go to the bathroom",
      "created_utc": 1720757331.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lctiv00",
      "author": "pink_wing",
      "body": "sores and wounds around the mouth, almost permanent throat burn, still feeling food inside even though you're throwing up a mix of spit and stomach acid, and yes everything that has been posted so far... insane that despite all of this, especially the financial hellhole i dug myself into, im only b/p free (month and a half) bc i had gained a small amount of weight. how fucking insane is that",
      "created_utc": 1720783952.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lcqsiya",
      "author": "kstocc",
      "body": "feelings of disgust, finding my body even more unbearable than before, eating other people’s food in secret, not being able to drink without b/p, wasting free nights and days off of work to b/p",
      "created_utc": 1720735708.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lcrcn2z",
      "author": "Any_Ad1578",
      "body": "this one is small potatoes but--how gross the underside of your nails get from purging with bare hands. mine were constantly nasty for years no matter how hard i tried (incidentally, a purge-curbing thing i sometimes do is get my nails done bc id rather die than ruin them)",
      "created_utc": 1720743125.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lcofzq7",
      "author": "lostnfound30",
      "body": "Always being gassy and bloated",
      "created_utc": 1720707911.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lcppujs",
      "author": "Scared-Addition-8126",
      "body": "This was the most relatable post of my life 😭\n\n-I always feel dingy (even after showering ) \n-that need to throw anything that goes it cause it won’t stay down\n-💸\n-#1 CHEEKS! I’m 94 pounds but my face makes me look 150 I want to cry and no go into Public",
      "created_utc": 1720722827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcqaal4",
      "author": "blacknwhitelife02",
      "body": "I feel like my (constant cycles of different) ED(s) has messed up my digestive system, I take so many Tums.",
      "created_utc": 1720729497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcrghgf",
      "author": "StockReporter5",
      "body": "bursting blood vessels in my eyes from purging. it would pool at the bottom of my eyes and ppl would ask about it and i have no clue what to tell them.\n\nMONEY.\n\nthe self hatred is ,, notable. i did really really gross things (eat out of my trashcan, eat hotel guests’ leftover food when i cleaned their rooms, purged in public restrooms, stole food) when i was doing real bad and the shame is overwhelming. and talking to ppl about it can feel impossible. it really feels like i am a genuinely worse person bc of this disorder sometimes.\n\nppl make jokes about bulimia in the worst way and it’s so upsetting to hear honestly. it’s embarrassing to be triggered by this and i know that’s on me to handle and whatever but hearing people in shows/movies or real life turn it into like a sexual joke (yikes ew no) or just making it the butt of the joke kinda hurts lol",
      "created_utc": 1720744586.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcrogo7",
      "author": "None",
      "body": "Just having to be in the bathroom for 45 minutes, and having cracks and bruises on the back of my hand that hurt royally, and make it take longer.",
      "created_utc": 1720747748.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcslr19",
      "author": "cainschiincat",
      "body": "Blowing your nose into a tissue only to open it up and it’s full of food -_- and even worse, stomach acid getting into your nose and sinuses, I absolutely HATE it. Also just getting sick constantly ??? Is this happening to anyone else? I am just continuously getting horribly sick and I don’t even know what to do about it.",
      "created_utc": 1720763044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcrt9tp",
      "author": "Old-Market7389",
      "body": "Just encountered a severely clogged toilet for the first time. Like clogged for 24 plus hours and nothing I do is working. Any tips?",
      "created_utc": 1720749664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcs5luo",
      "author": "twiggy_cucumberslice",
      "body": "The food in the nose sucksss\nEsp since I used to be a coke addict I have a hole in my nose so there are times where I’ll blow my nose a couple hours or even days later and I’ll have a chunk of food come out that was lodged in the hole 🥴",
      "created_utc": 1720754885.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcsrt5d",
      "author": "YuleBunny",
      "body": "Thinking horrible stuff about people. I always judge people at my job and what food they’re buying. I’ll look at their bodies and think “ugh I am not eating today. I do not want to end up like them” but I know that I do not actually feel that way. I have bigger friends and I love them but my bulimia makes me judge them so harshly.",
      "created_utc": 1720766670.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcx8ysg",
      "author": "beepbopboopbop69",
      "body": "\\* when the uhhhhh rEmOvAl methods aren't working\n\n\\* people staring at the scars on my hands\n\n\\* bad, bad bloating\n\n\\* swollen face from rEmOvAl methods\n\n\\* electrolyte imbalances\n\n\\* as others have said, peeing during rEmOvAl methods :/",
      "created_utc": 1720831592.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcyrgg3",
      "author": "DiligentUmpire6524",
      "body": "I’ve been clean for a few months now but I was bulimic for about 14 years and the back problems that I have now are excruciating I’m in physio therapy three times a week to help.\nI’ve also had a bad cough for a few months and bc the end of my oesophagus is so damaged I keep getting sick from coughing.\nAnd lastly the heartburn gets so bad(same reason as above) I usually can’t sleep and the only thing that helps is rennie but now I’m worried about my liver because of it",
      "created_utc": 1720860568.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsc4gzn",
      "author": "Otherwise-Life-6043",
      "body": "coming here again so I can read everyones experiences and scare myself into recovery (at least for today) 😭",
      "created_utc": 1729155844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcro9ic",
      "author": "Defiant-Orange-7075",
      "body": "I deal with similar things reguarding the heartburn and shame \nBut I have a unique living situation that makes my bulimia very tricky.\n\nFirst of all I live in a small trailer in a trailer park so the walls are paper thin. And secondly there’s a total of 7 people living here. The bathroom is in constant use, I feel a like an sneaky assassin (only the target is me😮‍💨)",
      "created_utc": 1720747668.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcrvzov",
      "author": "prdcroftme",
      "body": "broken eye blood vessels",
      "created_utc": 1720750758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcuf8zg",
      "author": "After0hours",
      "body": "I'm currently about 3 months sober but when I used to b/p, I remember having cramps afterwards, my arm and fingers were sore and pretty much everywhere. I smelt like vomit, the skin on my hands was dry, I felt like my eyes were gonna pop out my skull, I spent too much fucking money on food, felt like a raccoon stashing away food and hiding it, went through a phase of taking half bites of chocolate then purging. It was fucking awful.",
      "created_utc": 1720796539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcx96yl",
      "author": "countvomit",
      "body": "well for the past like three months i’ve been dealing with the most excruciating stomach pain and bloating (beyond a reasonable or normal amount) no matter what i eat. almost positive i’ve done some kind of internal damage. outside of my binges i eat extremely clean so it’s really frustrating because even my safe foods are hurting me.",
      "created_utc": 1720831685.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcxr6uk",
      "author": "None",
      "body": "The nasty toilet!",
      "created_utc": 1720839356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcy854u",
      "author": "Rotten-Star",
      "body": "I struggle so much with money. I know that I spend at least £50-100 monthly on foods to binge on. I’m honestly broke",
      "created_utc": 1720847914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcyj3mo",
      "author": "NMomThrowaway12345",
      "body": "Low energy and brain fog sucks when you have to be a functioning adult 😩",
      "created_utc": 1720854782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcyz3ap",
      "author": "Apprehensive-Put9552",
      "body": "chest pain.  (TW graphic / body experiences ) \n\nI've been throwing up for like 2 years now. recently in the last 2 weeks or so right after/ nearing the end of a vomiting session, my chest/ sternum hurt really bad to the point that one time sometime last week I  nearly called the ambulance because I actually thought I might be dying due to how much it hurt. the chest pain is no joke!!! \n\nIt doesn't help that all the medical dramas immediately have their bulimic patients get ruptured esophagus and so I'm hyper paranoid that every time my chest hurts its because I broke my esophagus or stomach and I'm gonna bleed out and die. \n\n\n\nThe silver lining I guess is that when I do get this scared it makes me realize that maybe I don't wanna die  after all ( I have Hx of depression, passive su1c1dality). Even if only out of fear that was born in these moments, and the main fear that my loved ones would have to find me if I did leave; mid purge with my body clinging to life. this disorder has made me realize that I at least want to not go out like *that*.",
      "created_utc": 1720865996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lczw4wa",
      "author": "lunaelliott4",
      "body": "Knowing the dr is telling me my kidney function is lowering and will get lower the more I purge but I can't stop it and breaking into panic attacks after purging 😭😭😭😭",
      "created_utc": 1720882185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ld0cr74",
      "author": "Impossible_Award_717",
      "body": "Taking an extra lax tab “just to make sure” and shitting myself in the grocery store 🤦‍♀️",
      "created_utc": 1720888254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ld25nsj",
      "author": "Alex_Not_Home",
      "body": "The guilt of feeling wasteful Everytime I purge.",
      "created_utc": 1720912343.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm697e6",
      "author": "just_a_rat_081128",
      "body": "The financial strain.",
      "created_utc": 1744182392.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcnky7q",
      "author": "Saturn11dae",
      "body": "Peeing yourself while throwing up! Thank god it’s not just me😭",
      "created_utc": 1720694308.0,
      "score": 42,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        }
      ]
    },
    {
      "id": "lcqm3ee",
      "author": "Maleficent_Market657",
      "body": "tmi but i’ve shit myself while purging too…",
      "created_utc": 1720733436.0,
      "score": 11,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        }
      ]
    },
    {
      "id": "lcnlsxq",
      "author": "BreadStickEater",
      "body": "Omg I completely forgot about peeing yourself when vomitting, I've done that too 😭 \nBdhd I fear in the future that my family will wonder why I don't have much money when in reality I spent it on food, already dreading that as it'll come sooner than u know it :')\n\nWould be nice if schools actually taught kids how addicting eating disorders can be 😔",
      "created_utc": 1720694816.0,
      "score": 23,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        }
      ]
    },
    {
      "id": "lcqmcb5",
      "author": "Maleficent_Market657",
      "body": "getting dressed fr. like i feel as if energy just doesn’t exist in my body anymore. i’m SOOOO sluggish and fatigued that even just laying is exhausting",
      "created_utc": 1720733523.0,
      "score": 11,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        }
      ]
    },
    {
      "id": "lcnliob",
      "author": "BreadStickEater",
      "body": "Jdjfjj omg I get what you mean with the bowel movements \nSending hugs ♥",
      "created_utc": 1720694649.0,
      "score": 6,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        }
      ]
    },
    {
      "id": "lcsb87u",
      "author": "HistrionicSlut",
      "body": "Oh God, hardly brushing. \n\nBetween the purging and ADHD I do it a shamefully small amount. Like I'm hardly ever embarrassed but I would DIE if people knew how little.",
      "created_utc": 1720757534.0,
      "score": 6,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        }
      ]
    },
    {
      "id": "lcq9l6l",
      "author": "sleepyboydreams",
      "body": "Omg why do u smell like vomit ??? \n\nDo I smell of vomit too?? \n\nI wash my hands and brush my teeth after every session. And I clean the toilet. I even take off my shirt because too many times I’ve got vomit on me so I basically get undressed and moving wash hands and face brush teeth then get redressed. \n\nI can still smell the vomit in my fingers tbh but I just assume no one else can :/",
      "created_utc": 1720729267.0,
      "score": 4,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        }
      ]
    },
    {
      "id": "lcrh4rq",
      "author": "StockReporter5",
      "body": "no one warned me about the back pain!! >:(",
      "created_utc": 1720744835.0,
      "score": 4,
      "context": [
        {
          "id": "lco43pu",
          "author": "Just-Rough-4621",
          "body": "The constant pimples on my cheeks and chin due to getting vomit on my face. Just horrible. \n\nOh and the annoying back pain after b/p sessions.",
          "created_utc": 1720703510.0
        }
      ]
    },
    {
      "id": "lcqskaf",
      "author": "Longjumping_Laugh337",
      "body": "Same here :(",
      "created_utc": 1720735722.0,
      "score": 2,
      "context": [
        {
          "id": "lcnxrhp",
          "author": "fatale_x",
          "body": "For me it has to be the chipmunk cheeks. I hate them so much!! I'm trying to stop b/ping to get rid of them but I can only last a few days before relapsing.",
          "created_utc": 1720700843.0
        }
      ]
    },
    {
      "id": "lcrh2wl",
      "author": "StockReporter5",
      "body": "this is so fucking real",
      "created_utc": 1720744815.0,
      "score": 2,
      "context": [
        {
          "id": "lcnxrhp",
          "author": "fatale_x",
          "body": "For me it has to be the chipmunk cheeks. I hate them so much!! I'm trying to stop b/ping to get rid of them but I can only last a few days before relapsing.",
          "created_utc": 1720700843.0
        }
      ]
    },
    {
      "id": "lcsbme2",
      "author": "HistrionicSlut",
      "body": "Last year I saved over 2k in door dash fees. The fees. FEES! Not even the actual food. What is wrong with me?!?!",
      "created_utc": 1720757723.0,
      "score": 4,
      "context": [
        {
          "id": "lcpjlfl",
          "author": "weird4utum",
          "body": "One of the worst things for me is the amount of money I spend on b/p food, and the wrappers and trash and old food I find in my room, it was a total wake up call when I went to the store to buy food and realized I had spend over $100 in 2 days on junk food.",
          "created_utc": 1720720802.0
        }
      ]
    },
    {
      "id": "lcoqkg7",
      "author": "SweetxKiss",
      "body": "If you jiggle the handle up and down while the bowl is filling back up with water it *should* stop.",
      "created_utc": 1720711437.0,
      "score": 3,
      "context": [
        {
          "id": "lco8cwi",
          "author": "thenaanprophet",
          "body": "Twice, I clogged the toilet and couldn't get the plunger fast enough and it overflowed I had to clean all the gross vomit/toilet water from the bathroom floor.",
          "created_utc": 1720705162.0
        }
      ]
    },
    {
      "id": "lcq9s2h",
      "author": "sleepyboydreams",
      "body": "So real!!!!",
      "created_utc": 1720729330.0,
      "score": 2,
      "context": [
        {
          "id": "lcomxtq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1720710243.0
        }
      ]
    },
    {
      "id": "lctpgdh",
      "author": "BreadStickEater",
      "body": "Relatable 😔",
      "created_utc": 1720787049.0,
      "score": 1,
      "context": [
        {
          "id": "lcomxtq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1720710243.0
        }
      ]
    },
    {
      "id": "lco55ke",
      "author": "Just-Rough-4621",
      "body": "My throat does this thing too! And drinking water in a silent room is sooo embrassing bc of this",
      "created_utc": 1720703925.0,
      "score": 9,
      "context": [
        {
          "id": "lcnpj7x",
          "author": "lumpy_space_queenie",
          "body": "Totally with ya on the heartburn. I haven’t purged (regularly) in almost 2 years. I’ve had a few relapses here and there…but I’ve had to be on prescription medication for my heartburn ever since. Probably always will. \n\nAlso when I swallow, my throat makes this weird knocking sound and I feel like there is something catching in my throat. I hope this goes away but idk I’m not holding my breath",
          "created_utc": 1720696879.0
        }
      ]
    },
    {
      "id": "lctpnw7",
      "author": "BreadStickEater",
      "body": "Omg trueee\nDespite the guilt it's like you just can't stop 😮‍💨",
      "created_utc": 1720787142.0,
      "score": 1,
      "context": [
        {
          "id": "lcpxks1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1720725338.0
        }
      ]
    },
    {
      "id": "lctq4bg",
      "author": "BreadStickEater",
      "body": "Omg this is so true and one of the worst feelings... sending hugs!",
      "created_utc": 1720787341.0,
      "score": 1,
      "context": [
        {
          "id": "lcqng81",
          "author": "Express_Possibility5",
          "body": "Not being able to purge while trying really hard.",
          "created_utc": 1720733908.0
        }
      ]
    },
    {
      "id": "lctq060",
      "author": "BreadStickEater",
      "body": "Omg that's horrifying, any signs or obvious symptoms? I think im getting that 😥",
      "created_utc": 1720787290.0,
      "score": 2,
      "context": [
        {
          "id": "lcr5w6p",
          "author": "13aquamarine",
          "body": "Transparent teeth as the inside bit slowly disappears..",
          "created_utc": 1720740617.0
        }
      ]
    },
    {
      "id": "lcx9d9l",
      "author": "countvomit",
      "body": "god i didn’t even think of that but was noticing today how transparent my teeth are looking",
      "created_utc": 1720831757.0,
      "score": 2,
      "context": [
        {
          "id": "lcr5w6p",
          "author": "13aquamarine",
          "body": "Transparent teeth as the inside bit slowly disappears..",
          "created_utc": 1720740617.0
        }
      ]
    },
    {
      "id": "lctpstd",
      "author": "BreadStickEater",
      "body": "I've started to let my hair get longer and the horrors of it getting in your hair 😬",
      "created_utc": 1720787202.0,
      "score": 1,
      "context": [
        {
          "id": "lco989o",
          "author": "SakuraSkye16",
          "body": "Accidentally getting barf in your hair or your nose ;-;",
          "created_utc": 1720705491.0
        }
      ]
    },
    {
      "id": "lcr8oi3",
      "author": "sweatykrabs",
      "body": "Hi. :) So I’ve been addicted to laxatives since I was 15/16 years old, on and off; I turn 31 in two months and I have two young children ages 4 and 6. I was in the hospital November 2023 for hypokalemia (severely low potassium) and I could have dropped dead at any moment. I lied to them and said I wasn’t sure what the cause was, that maybe I was working too much (true) and I wasn’t eating very much (also true). They also asked if I took any laxatives and I denied it. I was at a 1.2 when I should’ve been at 3.5. I stayed for 3 days and left. \n\nFast forward to this past January. I weighed 135. Wasn’t happy. I’m 5’2 so I always feel huge because of how short I am. I restricted, increased my laxative intake back up to 100 pills per day, and occasionally drank coconut water and ate some cheese. Dropped down to 120. Work was a pain in my ass and decided to take a weekend to spend with my ex/good friend of mine (bad idea? mayyyybe). No regrets and it was great. A week later, double vision, almost fainted and had to go to the ER. I’m back at a 1.1 and it’s being discussed that I should be transferred to “Denver Acute”. As in Denver, CO - meaning, only the most severe cases of eating disorders with the highest risk of death. I’ll be honest, yes of course it scared me - I have two kids, I’m still young, I can’t keep doing this. But I also thought, I can just get my potassium up, keep it up and just occasionally take laxatives. \n\nI’m not going to tell you what to do, or that it gets better. All of that shit is obviously up to you. I am doing much better now. Yes, I’m still taking laxatives. Not *as* much, but I am working on it - every single day. There are days where I overload and I’m throwing up into my trash can while on the toilet. I get it. It’s an ongoing battle and idk when it’ll end. But you’re not alone and I’m here if you need someone to listen.❣️ oh and get your blood work done every now and then. 🫶",
      "created_utc": 1720741648.0,
      "score": 5,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        }
      ]
    },
    {
      "id": "lcv2qao",
      "author": "sgknight",
      "body": "i used to take up to 125 lax pills all while never eating besides coffee and water and maybe the occasional meal on a date on a saturday. this was in high school when i had no money. i was cleaning my grandparents and parents house for money and spent it all on this disease.",
      "created_utc": 1720804085.0,
      "score": 1,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        }
      ]
    },
    {
      "id": "lcr39ge",
      "author": "Dizzy-cat13",
      "body": "This is so real ffs why does it sting so bad 😭",
      "created_utc": 1720739642.0,
      "score": 2,
      "context": [
        {
          "id": "lcqqia5",
          "author": "None",
          "body": "Food. In. Nose. It. Is. Horrific.",
          "created_utc": 1720734982.0
        }
      ]
    },
    {
      "id": "lcs3blv",
      "author": "None",
      "body": "i def. think about that.....i hear its rare that barrett's turns into cancer but still, nothing to fuck with.",
      "created_utc": 1720753869.0,
      "score": 3,
      "context": [
        {
          "id": "lcrfj0g",
          "author": "Scared-Addition-8126",
          "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
          "created_utc": 1720744219.0
        }
      ]
    },
    {
      "id": "lcsbuys",
      "author": "HistrionicSlut",
      "body": "No, but it's after midnight, and I'm here so we know I hate myself already. Why not find another reason eh?",
      "created_utc": 1720757838.0,
      "score": 3,
      "context": [
        {
          "id": "lcrfj0g",
          "author": "Scared-Addition-8126",
          "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
          "created_utc": 1720744219.0
        }
      ]
    },
    {
      "id": "ldp8kr3",
      "author": "Admirable_Gain_3917",
      "body": "It’s called Barret’s esophagus, and people with GETD get it too. Of course, some docs posit that GERD is a late left over of b/p disorder or just bingeing/overeating for many years…",
      "created_utc": 1721263699.0,
      "score": 3,
      "context": [
        {
          "id": "lcrfj0g",
          "author": "Scared-Addition-8126",
          "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
          "created_utc": 1720744219.0
        }
      ]
    },
    {
      "id": "lctqox9",
      "author": "BreadStickEater",
      "body": "I've accepted I'll likely get some kind of cancer in my digestive system 😔",
      "created_utc": 1720787587.0,
      "score": 2,
      "context": [
        {
          "id": "lcrfj0g",
          "author": "Scared-Addition-8126",
          "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
          "created_utc": 1720744219.0
        }
      ]
    },
    {
      "id": "lctrge0",
      "author": "BreadStickEater",
      "body": "I've always been able to purge without my hands or gagging myself but I can't imagine how annoyingly awful that would be, I'm sorry you have to deal with that ♥",
      "created_utc": 1720787912.0,
      "score": 3,
      "context": [
        {
          "id": "lcrcn2z",
          "author": "Any_Ad1578",
          "body": "this one is small potatoes but--how gross the underside of your nails get from purging with bare hands. mine were constantly nasty for years no matter how hard i tried (incidentally, a purge-curbing thing i sometimes do is get my nails done bc id rather die than ruin them)",
          "created_utc": 1720743125.0
        }
      ]
    },
    {
      "id": "lctpu2z",
      "author": "BreadStickEater",
      "body": "THIS ^",
      "created_utc": 1720787218.0,
      "score": 1,
      "context": [
        {
          "id": "lcofzq7",
          "author": "lostnfound30",
          "body": "Always being gassy and bloated",
          "created_utc": 1720707911.0
        }
      ]
    },
    {
      "id": "lcrh00o",
      "author": "StockReporter5",
      "body": "oh shit i forgot i had to go to court for stealing food and ik other ppl from treatment (only 2 but still) who’ve been in the same scenario, so there’s gotta be a lil portion of us who’ve all had some kind of legal problem. it’s on intake forms too sometimes.",
      "created_utc": 1720744784.0,
      "score": 3,
      "context": [
        {
          "id": "lcrghgf",
          "author": "StockReporter5",
          "body": "bursting blood vessels in my eyes from purging. it would pool at the bottom of my eyes and ppl would ask about it and i have no clue what to tell them.\n\nMONEY.\n\nthe self hatred is ,, notable. i did really really gross things (eat out of my trashcan, eat hotel guests’ leftover food when i cleaned their rooms, purged in public restrooms, stole food) when i was doing real bad and the shame is overwhelming. and talking to ppl about it can feel impossible. it really feels like i am a genuinely worse person bc of this disorder sometimes.\n\nppl make jokes about bulimia in the worst way and it’s so upsetting to hear honestly. it’s embarrassing to be triggered by this and i know that’s on me to handle and whatever but hearing people in shows/movies or real life turn it into like a sexual joke (yikes ew no) or just making it the butt of the joke kinda hurts lol",
          "created_utc": 1720744586.0
        }
      ]
    },
    {
      "id": "lctqyes",
      "author": "BreadStickEater",
      "body": "Sending hugs ♥ \nYeah its just.. awful to hear any jokes about any eating disorder tbh",
      "created_utc": 1720787700.0,
      "score": 2,
      "context": [
        {
          "id": "lcrghgf",
          "author": "StockReporter5",
          "body": "bursting blood vessels in my eyes from purging. it would pool at the bottom of my eyes and ppl would ask about it and i have no clue what to tell them.\n\nMONEY.\n\nthe self hatred is ,, notable. i did really really gross things (eat out of my trashcan, eat hotel guests’ leftover food when i cleaned their rooms, purged in public restrooms, stole food) when i was doing real bad and the shame is overwhelming. and talking to ppl about it can feel impossible. it really feels like i am a genuinely worse person bc of this disorder sometimes.\n\nppl make jokes about bulimia in the worst way and it’s so upsetting to hear honestly. it’s embarrassing to be triggered by this and i know that’s on me to handle and whatever but hearing people in shows/movies or real life turn it into like a sexual joke (yikes ew no) or just making it the butt of the joke kinda hurts lol",
          "created_utc": 1720744586.0
        }
      ]
    },
    {
      "id": "lctrp2u",
      "author": "BreadStickEater",
      "body": "No clue the name. Maybe drain-o but have you tried pouring that chemical that people use to unclog sinks? Maybe that can help? 🤔",
      "created_utc": 1720788014.0,
      "score": 1,
      "context": [
        {
          "id": "lcrt9tp",
          "author": "Old-Market7389",
          "body": "Just encountered a severely clogged toilet for the first time. Like clogged for 24 plus hours and nothing I do is working. Any tips?",
          "created_utc": 1720749664.0
        }
      ]
    },
    {
      "id": "lco66wr",
      "author": "Lonely_Step_4454",
      "body": "Girl I’ve done it too. your not alone in that 😭",
      "created_utc": 1720704328.0,
      "score": 15,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcnky7q",
          "author": "Saturn11dae",
          "body": "Peeing yourself while throwing up! Thank god it’s not just me😭",
          "created_utc": 1720694308.0
        }
      ]
    },
    {
      "id": "lcubz5j",
      "author": "EffortOk3350",
      "body": "I’ve taken a laxative the night before and end up B/P (like in the morning) and have literally had the runs while throwing up and it was awful.",
      "created_utc": 1720795461.0,
      "score": 8,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcnky7q",
          "author": "Saturn11dae",
          "body": "Peeing yourself while throwing up! Thank god it’s not just me😭",
          "created_utc": 1720694308.0
        }
      ]
    },
    {
      "id": "lcrgwa5",
      "author": "lavendervc",
      "body": "One time I did too 😂😭😭",
      "created_utc": 1720744743.0,
      "score": 4,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcqm3ee",
          "author": "Maleficent_Market657",
          "body": "tmi but i’ve shit myself while purging too…",
          "created_utc": 1720733436.0
        }
      ]
    },
    {
      "id": "lcnr14r",
      "author": "DirtybutCuteFerret",
      "body": "yeah, it doesnt happen on a regular basis for me either, it is one of the most shameful things when it does happen tho :c like, when i throw up violentley alot a whole day, even if i know okay, after throwing up 5h to 7th time today i need to pee before i throw up, it still can happen...i dont know why it does, i think it is just cause i so violentley try to get everything out of my stomach....i swear bulimia sucks-\n\nand if you still live with your family your lucky, cause tbh managing severe bulimia in this economy and paying rent and all bills, is devastating. i have to earn well otherwise im screwed. that i have pissed myself a few times while throwing up is like one of my most shameful secrets ! also i managed to clog up every toilet in every appartment i ever lived in, and one time someone had to come and repair it, and they pumped out the clog,\n\nand it was all the food - like they talked about it, like, my shame i swear xD",
      "created_utc": 1720697652.0,
      "score": 4,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcnlsxq",
          "author": "BreadStickEater",
          "body": "Omg I completely forgot about peeing yourself when vomitting, I've done that too 😭 \nBdhd I fear in the future that my family will wonder why I don't have much money when in reality I spent it on food, already dreading that as it'll come sooner than u know it :')\n\nWould be nice if schools actually taught kids how addicting eating disorders can be 😔",
          "created_utc": 1720694816.0
        }
      ]
    },
    {
      "id": "lcqmge1",
      "author": "Saturn11dae",
      "body": "THIS!!! You get me 😭🖤",
      "created_utc": 1720733563.0,
      "score": 3,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcqmcb5",
          "author": "Maleficent_Market657",
          "body": "getting dressed fr. like i feel as if energy just doesn’t exist in my body anymore. i’m SOOOO sluggish and fatigued that even just laying is exhausting",
          "created_utc": 1720733523.0
        }
      ]
    },
    {
      "id": "lctpd21",
      "author": "BreadStickEater",
      "body": "Ggdgg omg I feel you",
      "created_utc": 1720787009.0,
      "score": 1,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcsb87u",
          "author": "HistrionicSlut",
          "body": "Oh God, hardly brushing. \n\nBetween the purging and ADHD I do it a shamefully small amount. Like I'm hardly ever embarrassed but I would DIE if people knew how little.",
          "created_utc": 1720757534.0
        }
      ]
    },
    {
      "id": "lw0w7tc",
      "author": "Particular_Clock2354",
      "body": "THIS EXACT THING DOWN TO EVERY LAST WORD i thought i was the only one :’)",
      "created_utc": 1731038746.0,
      "score": 1,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcsb87u",
          "author": "HistrionicSlut",
          "body": "Oh God, hardly brushing. \n\nBetween the purging and ADHD I do it a shamefully small amount. Like I'm hardly ever embarrassed but I would DIE if people knew how little.",
          "created_utc": 1720757534.0
        }
      ]
    },
    {
      "id": "lcqaf3k",
      "author": "Saturn11dae",
      "body": "People tell me that the scent is like in my hair even when I tie it up and all that😭 so I have no idea. It’s not on me, I clean myself and whatever I used…  but I guess when I’m purging like 5-10 times a day the scent just lingers 🙃",
      "created_utc": 1720729538.0,
      "score": 4,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcq9l6l",
          "author": "sleepyboydreams",
          "body": "Omg why do u smell like vomit ??? \n\nDo I smell of vomit too?? \n\nI wash my hands and brush my teeth after every session. And I clean the toilet. I even take off my shirt because too many times I’ve got vomit on me so I basically get undressed and moving wash hands and face brush teeth then get redressed. \n\nI can still smell the vomit in my fingers tbh but I just assume no one else can :/",
          "created_utc": 1720729267.0
        }
      ]
    },
    {
      "id": "lcsbemy",
      "author": "HistrionicSlut",
      "body": "Mine is my abs. When I get too dehydrated and purge my whole stomach feels hard and just cramps like that. Looks like my belly did when I went into labor. The most intense muscle contraction. Yuck.",
      "created_utc": 1720757618.0,
      "score": 5,
      "context": [
        {
          "id": "lco43pu",
          "author": "Just-Rough-4621",
          "body": "The constant pimples on my cheeks and chin due to getting vomit on my face. Just horrible. \n\nOh and the annoying back pain after b/p sessions.",
          "created_utc": 1720703510.0
        },
        {
          "id": "lcrh4rq",
          "author": "StockReporter5",
          "body": "no one warned me about the back pain!! >:(",
          "created_utc": 1720744835.0
        }
      ]
    },
    {
      "id": "lcpul7m",
      "author": "Bake-Some",
      "body": "omg i didn’t know this happened bc of bulimia!! i literally get made fun of for it",
      "created_utc": 1720724362.0,
      "score": 6,
      "context": [
        {
          "id": "lcnpj7x",
          "author": "lumpy_space_queenie",
          "body": "Totally with ya on the heartburn. I haven’t purged (regularly) in almost 2 years. I’ve had a few relapses here and there…but I’ve had to be on prescription medication for my heartburn ever since. Probably always will. \n\nAlso when I swallow, my throat makes this weird knocking sound and I feel like there is something catching in my throat. I hope this goes away but idk I’m not holding my breath",
          "created_utc": 1720696879.0
        },
        {
          "id": "lco55ke",
          "author": "Just-Rough-4621",
          "body": "My throat does this thing too! And drinking water in a silent room is sooo embrassing bc of this",
          "created_utc": 1720703925.0
        }
      ]
    },
    {
      "id": "lddbfbu",
      "author": "13aquamarine",
      "body": "Get a small cosmetic mirror to use in front of a bigger mirror to look behind your front teeth.. You’ll no doubt see all the enamel is worn off and the middle bit is exposed.. and slowly the middle bit disappears, leaving only the front layer of enamel..",
      "created_utc": 1721085788.0,
      "score": 2,
      "context": [
        {
          "id": "lcr5w6p",
          "author": "13aquamarine",
          "body": "Transparent teeth as the inside bit slowly disappears..",
          "created_utc": 1720740617.0
        },
        {
          "id": "lctq060",
          "author": "BreadStickEater",
          "body": "Omg that's horrifying, any signs or obvious symptoms? I think im getting that 😥",
          "created_utc": 1720787290.0
        }
      ]
    },
    {
      "id": "lcr9hc2",
      "author": "Maleficent_Market657",
      "body": "yup yup. throwing up over the trash can while the lax shits hit is the WORST. and you still struggling 15 years later breaks my heart. thank you for sharing your personal experience w/ it. it does scare me every day that i could too drop dead at any moment but it’s like any other addiction, i can’t/don’t know how to stop. and 100 pills is crazy!!! omg?? i thought my 10-20 was a lot (def is) but holy cow!! the fact that ur living still esp after having children is insane. may you continue to get better and get healthier if that’s what you choose 💕",
      "created_utc": 1720741946.0,
      "score": 3,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        },
        {
          "id": "lcr8oi3",
          "author": "sweatykrabs",
          "body": "Hi. :) So I’ve been addicted to laxatives since I was 15/16 years old, on and off; I turn 31 in two months and I have two young children ages 4 and 6. I was in the hospital November 2023 for hypokalemia (severely low potassium) and I could have dropped dead at any moment. I lied to them and said I wasn’t sure what the cause was, that maybe I was working too much (true) and I wasn’t eating very much (also true). They also asked if I took any laxatives and I denied it. I was at a 1.2 when I should’ve been at 3.5. I stayed for 3 days and left. \n\nFast forward to this past January. I weighed 135. Wasn’t happy. I’m 5’2 so I always feel huge because of how short I am. I restricted, increased my laxative intake back up to 100 pills per day, and occasionally drank coconut water and ate some cheese. Dropped down to 120. Work was a pain in my ass and decided to take a weekend to spend with my ex/good friend of mine (bad idea? mayyyybe). No regrets and it was great. A week later, double vision, almost fainted and had to go to the ER. I’m back at a 1.1 and it’s being discussed that I should be transferred to “Denver Acute”. As in Denver, CO - meaning, only the most severe cases of eating disorders with the highest risk of death. I’ll be honest, yes of course it scared me - I have two kids, I’m still young, I can’t keep doing this. But I also thought, I can just get my potassium up, keep it up and just occasionally take laxatives. \n\nI’m not going to tell you what to do, or that it gets better. All of that shit is obviously up to you. I am doing much better now. Yes, I’m still taking laxatives. Not *as* much, but I am working on it - every single day. There are days where I overload and I’m throwing up into my trash can while on the toilet. I get it. It’s an ongoing battle and idk when it’ll end. But you’re not alone and I’m here if you need someone to listen.❣️ oh and get your blood work done every now and then. 🫶",
          "created_utc": 1720741648.0
        }
      ]
    },
    {
      "id": "lcreqx4",
      "author": "okaysweaty167",
      "body": "I’ve had friends at ACUTE who found it really helpful",
      "created_utc": 1720743920.0,
      "score": 1,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        },
        {
          "id": "lcr8oi3",
          "author": "sweatykrabs",
          "body": "Hi. :) So I’ve been addicted to laxatives since I was 15/16 years old, on and off; I turn 31 in two months and I have two young children ages 4 and 6. I was in the hospital November 2023 for hypokalemia (severely low potassium) and I could have dropped dead at any moment. I lied to them and said I wasn’t sure what the cause was, that maybe I was working too much (true) and I wasn’t eating very much (also true). They also asked if I took any laxatives and I denied it. I was at a 1.2 when I should’ve been at 3.5. I stayed for 3 days and left. \n\nFast forward to this past January. I weighed 135. Wasn’t happy. I’m 5’2 so I always feel huge because of how short I am. I restricted, increased my laxative intake back up to 100 pills per day, and occasionally drank coconut water and ate some cheese. Dropped down to 120. Work was a pain in my ass and decided to take a weekend to spend with my ex/good friend of mine (bad idea? mayyyybe). No regrets and it was great. A week later, double vision, almost fainted and had to go to the ER. I’m back at a 1.1 and it’s being discussed that I should be transferred to “Denver Acute”. As in Denver, CO - meaning, only the most severe cases of eating disorders with the highest risk of death. I’ll be honest, yes of course it scared me - I have two kids, I’m still young, I can’t keep doing this. But I also thought, I can just get my potassium up, keep it up and just occasionally take laxatives. \n\nI’m not going to tell you what to do, or that it gets better. All of that shit is obviously up to you. I am doing much better now. Yes, I’m still taking laxatives. Not *as* much, but I am working on it - every single day. There are days where I overload and I’m throwing up into my trash can while on the toilet. I get it. It’s an ongoing battle and idk when it’ll end. But you’re not alone and I’m here if you need someone to listen.❣️ oh and get your blood work done every now and then. 🫶",
          "created_utc": 1720741648.0
        }
      ]
    },
    {
      "id": "ldp87mz",
      "author": "Admirable_Gain_3917",
      "body": "Just take magnesium/potassium/sodium daily. The mag is its own kind of laxative, and your body needs tons of potassium when you are regularly purging. And you should rinse well with plain water after a purge, drink about 1/2 liter of water, and chew a calcium tums to protect the teeth. It’s not the flush of stomach acid eroding them as much as sitting around letting it eat ch the teeth after you are done.",
      "created_utc": 1721263558.0,
      "score": 1,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        },
        {
          "id": "lcr8oi3",
          "author": "sweatykrabs",
          "body": "Hi. :) So I’ve been addicted to laxatives since I was 15/16 years old, on and off; I turn 31 in two months and I have two young children ages 4 and 6. I was in the hospital November 2023 for hypokalemia (severely low potassium) and I could have dropped dead at any moment. I lied to them and said I wasn’t sure what the cause was, that maybe I was working too much (true) and I wasn’t eating very much (also true). They also asked if I took any laxatives and I denied it. I was at a 1.2 when I should’ve been at 3.5. I stayed for 3 days and left. \n\nFast forward to this past January. I weighed 135. Wasn’t happy. I’m 5’2 so I always feel huge because of how short I am. I restricted, increased my laxative intake back up to 100 pills per day, and occasionally drank coconut water and ate some cheese. Dropped down to 120. Work was a pain in my ass and decided to take a weekend to spend with my ex/good friend of mine (bad idea? mayyyybe). No regrets and it was great. A week later, double vision, almost fainted and had to go to the ER. I’m back at a 1.1 and it’s being discussed that I should be transferred to “Denver Acute”. As in Denver, CO - meaning, only the most severe cases of eating disorders with the highest risk of death. I’ll be honest, yes of course it scared me - I have two kids, I’m still young, I can’t keep doing this. But I also thought, I can just get my potassium up, keep it up and just occasionally take laxatives. \n\nI’m not going to tell you what to do, or that it gets better. All of that shit is obviously up to you. I am doing much better now. Yes, I’m still taking laxatives. Not *as* much, but I am working on it - every single day. There are days where I overload and I’m throwing up into my trash can while on the toilet. I get it. It’s an ongoing battle and idk when it’ll end. But you’re not alone and I’m here if you need someone to listen.❣️ oh and get your blood work done every now and then. 🫶",
          "created_utc": 1720741648.0
        }
      ]
    },
    {
      "id": "lcvskp7",
      "author": "Maleficent_Market657",
      "body": "omg love i’m so sorry :(",
      "created_utc": 1720812513.0,
      "score": 1,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        },
        {
          "id": "lcv2qao",
          "author": "sgknight",
          "body": "i used to take up to 125 lax pills all while never eating besides coffee and water and maybe the occasional meal on a date on a saturday. this was in high school when i had no money. i was cleaning my grandparents and parents house for money and spent it all on this disease.",
          "created_utc": 1720804085.0
        }
      ]
    },
    {
      "id": "lcv0z0u",
      "author": "None",
      "body": "It’s so putrid and painful",
      "created_utc": 1720803521.0,
      "score": 1,
      "context": [
        {
          "id": "lcqqia5",
          "author": "None",
          "body": "Food. In. Nose. It. Is. Horrific.",
          "created_utc": 1720734982.0
        },
        {
          "id": "lcr39ge",
          "author": "Dizzy-cat13",
          "body": "This is so real ffs why does it sting so bad 😭",
          "created_utc": 1720739642.0
        }
      ]
    },
    {
      "id": "lcscgn4",
      "author": "Scared-Addition-8126",
      "body": "😑",
      "created_utc": 1720758135.0,
      "score": 2,
      "context": [
        {
          "id": "lcrfj0g",
          "author": "Scared-Addition-8126",
          "body": "Anyone else go down the health hell rabbit hole and think about how acid can cause esophageal cancel and that’s like 100% mortality rate ..just me ?",
          "created_utc": 1720744219.0
        },
        {
          "id": "lcsbuys",
          "author": "HistrionicSlut",
          "body": "No, but it's after midnight, and I'm here so we know I hate myself already. Why not find another reason eh?",
          "created_utc": 1720757838.0
        }
      ]
    },
    {
      "id": "lcxz035",
      "author": "Any_Ad1578",
      "body": "its all good. rn i have fancy fandom-commissioned coffin glue ons that keep me from purging that way, and have my boys on 'em. past me was suffering tho lol",
      "created_utc": 1720843042.0,
      "score": 1,
      "context": [
        {
          "id": "lcrcn2z",
          "author": "Any_Ad1578",
          "body": "this one is small potatoes but--how gross the underside of your nails get from purging with bare hands. mine were constantly nasty for years no matter how hard i tried (incidentally, a purge-curbing thing i sometimes do is get my nails done bc id rather die than ruin them)",
          "created_utc": 1720743125.0
        },
        {
          "id": "lctrge0",
          "author": "BreadStickEater",
          "body": "I've always been able to purge without my hands or gagging myself but I can't imagine how annoyingly awful that would be, I'm sorry you have to deal with that ♥",
          "created_utc": 1720787912.0
        }
      ]
    },
    {
      "id": "ld0bxa6",
      "author": "Impossible_Award_717",
      "body": "Same!!",
      "created_utc": 1720887950.0,
      "score": 2,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcnky7q",
          "author": "Saturn11dae",
          "body": "Peeing yourself while throwing up! Thank god it’s not just me😭",
          "created_utc": 1720694308.0
        },
        {
          "id": "lcubz5j",
          "author": "EffortOk3350",
          "body": "I’ve taken a laxative the night before and end up B/P (like in the morning) and have literally had the runs while throwing up and it was awful.",
          "created_utc": 1720795461.0
        }
      ]
    },
    {
      "id": "lcrh7ga",
      "author": "Maleficent_Market657",
      "body": "so sorry you also experienced that but thank GOD i’m not the only one😭",
      "created_utc": 1720744863.0,
      "score": 5,
      "context": [
        {
          "id": "lcnjr95",
          "author": "DirtybutCuteFerret",
          "body": "Peeing yourself while throwing up and food in the nose…how financially devastating bulimia is. Like why do people not talk about how expensive bulimia is ???",
          "created_utc": 1720693566.0
        },
        {
          "id": "lcqm3ee",
          "author": "Maleficent_Market657",
          "body": "tmi but i’ve shit myself while purging too…",
          "created_utc": 1720733436.0
        },
        {
          "id": "lcrgwa5",
          "author": "lavendervc",
          "body": "One time I did too 😂😭😭",
          "created_utc": 1720744743.0
        }
      ]
    },
    {
      "id": "lcqmjq4",
      "author": "Maleficent_Market657",
      "body": "unfortunately i do :( im sorry you’re struggling love. sending so much love ur way 🤍",
      "created_utc": 1720733595.0,
      "score": 3,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcqmcb5",
          "author": "Maleficent_Market657",
          "body": "getting dressed fr. like i feel as if energy just doesn’t exist in my body anymore. i’m SOOOO sluggish and fatigued that even just laying is exhausting",
          "created_utc": 1720733523.0
        },
        {
          "id": "lcqmge1",
          "author": "Saturn11dae",
          "body": "THIS!!! You get me 😭🖤",
          "created_utc": 1720733563.0
        }
      ]
    },
    {
      "id": "lgpp9fa",
      "author": "bulimia-ModTeam",
      "body": "This post or comment was removed for: \nSharing ‘tips and tricks’ on how to do ED behaviors.",
      "created_utc": 1722912678.0,
      "score": 1,
      "context": [
        {
          "id": "lcqm0gy",
          "author": "Maleficent_Market657",
          "body": "pissing and shitting myself from laxative abuse (literally addicted to them i’ve been taking them every day for a few weeks and im taking like 10-30 PER DAY), money wasted, the amount of trash that accumulates over the DAYS??? like i’ve emptied my trash cans 3+ times in a week while my family only takes their trash out when the cleaners come every other week…, the depression, the mood swings, the post-binge guilt, i can keep going.. i hate this awful disorder but im a literal slave to it and atp i’m hoping it just kills me :(",
          "created_utc": 1720733407.0
        },
        {
          "id": "lcr8oi3",
          "author": "sweatykrabs",
          "body": "Hi. :) So I’ve been addicted to laxatives since I was 15/16 years old, on and off; I turn 31 in two months and I have two young children ages 4 and 6. I was in the hospital November 2023 for hypokalemia (severely low potassium) and I could have dropped dead at any moment. I lied to them and said I wasn’t sure what the cause was, that maybe I was working too much (true) and I wasn’t eating very much (also true). They also asked if I took any laxatives and I denied it. I was at a 1.2 when I should’ve been at 3.5. I stayed for 3 days and left. \n\nFast forward to this past January. I weighed 135. Wasn’t happy. I’m 5’2 so I always feel huge because of how short I am. I restricted, increased my laxative intake back up to 100 pills per day, and occasionally drank coconut water and ate some cheese. Dropped down to 120. Work was a pain in my ass and decided to take a weekend to spend with my ex/good friend of mine (bad idea? mayyyybe). No regrets and it was great. A week later, double vision, almost fainted and had to go to the ER. I’m back at a 1.1 and it’s being discussed that I should be transferred to “Denver Acute”. As in Denver, CO - meaning, only the most severe cases of eating disorders with the highest risk of death. I’ll be honest, yes of course it scared me - I have two kids, I’m still young, I can’t keep doing this. But I also thought, I can just get my potassium up, keep it up and just occasionally take laxatives. \n\nI’m not going to tell you what to do, or that it gets better. All of that shit is obviously up to you. I am doing much better now. Yes, I’m still taking laxatives. Not *as* much, but I am working on it - every single day. There are days where I overload and I’m throwing up into my trash can while on the toilet. I get it. It’s an ongoing battle and idk when it’ll end. But you’re not alone and I’m here if you need someone to listen.❣️ oh and get your blood work done every now and then. 🫶",
          "created_utc": 1720741648.0
        },
        {
          "id": "ldp87mz",
          "author": "Admirable_Gain_3917",
          "body": "Just take magnesium/potassium/sodium daily. The mag is its own kind of laxative, and your body needs tons of potassium when you are regularly purging. And you should rinse well with plain water after a purge, drink about 1/2 liter of water, and chew a calcium tums to protect the teeth. It’s not the flush of stomach acid eroding them as much as sitting around letting it eat ch the teeth after you are done.",
          "created_utc": 1721263558.0
        }
      ]
    },
    {
      "id": "lcqmq21",
      "author": "Saturn11dae",
      "body": "Right back at you!! Love for everyone here, honestly.",
      "created_utc": 1720733657.0,
      "score": 3,
      "context": [
        {
          "id": "lcnjh2r",
          "author": "Saturn11dae",
          "body": "I relate heavily to hardly brushing because I’ll likely purge soon—I’ve done that for years and honestly the 4000$ bill at the dentist was a wake up call. (I say, as I still haven’t changed my habits.) \n\nBut the weakness? I used to be able to lift my weight but now holding a two litre is too tiresome, or getting dressed in the morning makes me typically collapse against the wall. \n\nUncontrollable bowel movements if I *do* keep food down—self explanatory but god is it embarrassing 😭\n\nAnd I relate to the fear of smelling like vomit—too many times I’ve been told I do😭😭",
          "created_utc": 1720693391.0
        },
        {
          "id": "lcqmcb5",
          "author": "Maleficent_Market657",
          "body": "getting dressed fr. like i feel as if energy just doesn’t exist in my body anymore. i’m SOOOO sluggish and fatigued that even just laying is exhausting",
          "created_utc": 1720733523.0
        },
        {
          "id": "lcqmge1",
          "author": "Saturn11dae",
          "body": "THIS!!! You get me 😭🖤",
          "created_utc": 1720733563.0
        },
        {
          "id": "lcqmjq4",
          "author": "Maleficent_Market657",
          "body": "unfortunately i do :( im sorry you’re struggling love. sending so much love ur way 🤍",
          "created_utc": 1720733595.0
        }
      ]
    }
  ]
}