{
  "id": "1ebg1p4",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1721863909.0,
  "title": "My husband is just MEAN",
  "selftext": "While I’m sure he shouldn’t support my bulimia he is MEAN about it. Tells me he’s not buying me any food, absolutely refuses to put any of my dishes or silverware in the dishwasher, ridicules me any time I eat, mocking me saying “oh, guess you can’t eat without condiments, how embarrassing” and is constantly (and I mean constantly) bringing up how “I’m destroying the family” with the money I waste by just throwing up what I eat. \nI feel guilty any time I eat anything. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1ebg1p4/my_husband_is_just_mean/",
  "score": 83,
  "num_comments": 21,
  "comments": [
    {
      "id": "lesnrlb",
      "author": "runawaypsych666",
      "body": "I will never understand how people think this is an ok way to act like it'll eventually fix the issue ? news flash it won't and it'll probably make it worse ! you don't deserve to be treated like that I'm sorry.",
      "created_utc": 1721866937.0,
      "score": 69,
      "context": []
    },
    {
      "id": "lesydzk",
      "author": "Princess_Sparkle_99",
      "body": "What a piece of absolute shit. Mocking and abusing someone struggling with a deadly illness. This pisses me off. Either leave him or avoid him for awhile. Don’t cook for him, take food to your room and eat alone. Does he have all control over finances? If so, that is financial abuse if he’s refusing to buy you food.",
      "created_utc": 1721871030.0,
      "score": 58,
      "context": []
    },
    {
      "id": "lesgx0q",
      "author": "Queenofwands1212",
      "body": "Time to leave your husband. He sounds like a manipulative ignorant fuck. I’m sorry.",
      "created_utc": 1721864390.0,
      "score": 54,
      "context": []
    },
    {
      "id": "letpc3x",
      "author": "Branch-Much",
      "body": "I’m so confused about the condiment comment- who doesn’t like condiments? \n\nIt’s giving abusive, and honestly I think even if you didn’t struggle with bulimia, he’d find something else to berate you over. I’m sorry you’re going through this.",
      "created_utc": 1721882733.0,
      "score": 8,
      "context": []
    },
    {
      "id": "letne3y",
      "author": "Sad-Western597",
      "body": "He gets ED's are about control, right?????\nIMHO, thanks exactly what he's taking. \nI understand you probably love this.. individual.\nBut even if you do not leave, time apart may still be a good idea. \nConsult your local mental health people, maybe they would have some options. Maybe they tell you my opinions are shit. But I the end at least you know you made the best choice you could ATM",
      "created_utc": 1721881735.0,
      "score": 6,
      "context": []
    },
    {
      "id": "levbcng",
      "author": "AgreeableMoose",
      "body": "It sounds like both of you need therapy. Not to be harsh but he is living with an addict and should seek counseling for living with someone that has an addiction. It made all the difference for myself and I was able to learn from experts the issues facing my relationship. He needs to understand the underlying issues that results in bulimia and how to navigate those signs. No different than AA or NA. His behavior is unacceptable but he needs guidance and to understand the issue. The key is finding a counselor that specializes in ED for him to speak with.",
      "created_utc": 1721914837.0,
      "score": 5,
      "context": []
    },
    {
      "id": "leusqzv",
      "author": "Axxeptance",
      "body": "This is how you end up developing full blown restriction and secret eating etc \nSure, he might shame you out of purging so often, but I could see this making a lot of people worse with restriction.",
      "created_utc": 1721907032.0,
      "score": 3,
      "context": []
    },
    {
      "id": "letr8cc",
      "author": "BpdBabe19",
      "body": "Babe I'm sorry but I rly realized I keep repeating and repeating myself here. Somehow bulimics always end up in relationships like this that worsen their ed or even are the main factor why the ed came up. It is horrible and heartbreaking to me still yess but I don't think anymore this happened by coincidence. I think you are (still)with this person bc you hate yourself and you need somebody who mirrors that while it gives you the oppurtunity to realize how much you love yourself and you crave out for that love (in the ed and that sub f.example). I think you're twisted and this is rly sad",
      "created_utc": 1721883734.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lewjsk8",
      "author": "None",
      "body": "dump that bitch love 💕",
      "created_utc": 1721929140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lewvd6n",
      "author": "vuipixxy",
      "body": "I know it's easier said than done to just up and leave, but from the sounds of this, i hope one day you'll be able to call him an ex-husband.",
      "created_utc": 1721932804.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lexgio0",
      "author": "Informal-Ad-7356",
      "body": "Ok... he needs to become your EX-husband.  And I don't say that lightly.   My 2nd husband was not supportive at all....told me he would leave me if I got fat.  I had a 35 year long ED, but he just cared about how my body looked (actually how HE looked next to my body).   \n\nMy current husband was/is so incredibly supportive.   I chose to believe his reassurances, and was able to finally recover.   It was HARD, took me 2 years with one 3 month relapse in there, but my current husband was true to his word:  he loved me all the way through that hellish cycle and still does, with me in my recovered body.\n\nI'm sorry you have a partner who sounds like he cares more about finances than your health.  I hope you can find the strength to stand up for yourself in whatever way you can.   Then maybe you can also consider Recovery.   But Recovery has to be for YOU. 100%.  That's how it will stick.\n\nGood luck.",
      "created_utc": 1721939462.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leu46f2",
      "author": "Ok-Reality1872",
      "body": "time to up and leave baby. that manipulative piece of shit is not worth another second of your time.",
      "created_utc": 1721891500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "leu4zxa",
      "author": "Chees_forall",
      "body": "Why do people never seem to understand that treating you with disgust derision and belittlement and making little remarks does NOT HELP if anything I find people gradually trying to erode my self esteem with this kinda thing ends up making it WORSE. If you can leave him please please consider it. People like this just don't change and over time it wears you down so badly, and often I feel like it's as bad as an enabler if not worse because I feel like the effect of them is the same 😞",
      "created_utc": 1721892035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "leusmru",
      "author": "nullixsecundus",
      "body": "Whether you have a mental health issue or not, that's always abuse. He needs to go, your never going to help yourself with him around, he's egging on the disorder. My partner never ever mentions my disorder unless I talk to him about it. If he hasn't seen me eat or is a bit curious about any weight loss, he will ask, but very lovingly for example \"have you eaten yet, do you want me to get you anything?\" Or \"have you had your weight checked recently?\" (I get it checked every month at the clinic). I probably b/p once a day and the rest is restriction and over exercise. He's very good at not pushing, but at the same time not enabling the disorder. He has never shamed me and that's actually helped me over the years. A loving relationship should be about support, not shame.",
      "created_utc": 1721906974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lewmqcn",
      "author": "Mandapanda82",
      "body": "My now ex husband would say how ashamed he was of me. He was just mad.",
      "created_utc": 1721930058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf0kotc",
      "author": "toucansam0384",
      "body": "My husband is the exact same way. He doesn't believe in mental illness and thinks I should just shut it off and makes it all about him.....what I do to him, why our family isn't enough for me to stop. This just makes me worse. It's ruined our relationship. ",
      "created_utc": 1721991897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "leusrud",
      "author": "Axxeptance",
      "body": "He sucks please get rid of him",
      "created_utc": 1721907043.0,
      "score": 3,
      "context": [
        {
          "id": "leusqzv",
          "author": "Axxeptance",
          "body": "This is how you end up developing full blown restriction and secret eating etc \nSure, he might shame you out of purging so often, but I could see this making a lot of people worse with restriction.",
          "created_utc": 1721907032.0
        }
      ]
    },
    {
      "id": "levok2t",
      "author": "None",
      "body": "Oh wow",
      "created_utc": 1721919303.0,
      "score": 1,
      "context": [
        {
          "id": "letr8cc",
          "author": "BpdBabe19",
          "body": "Babe I'm sorry but I rly realized I keep repeating and repeating myself here. Somehow bulimics always end up in relationships like this that worsen their ed or even are the main factor why the ed came up. It is horrible and heartbreaking to me still yess but I don't think anymore this happened by coincidence. I think you are (still)with this person bc you hate yourself and you need somebody who mirrors that while it gives you the oppurtunity to realize how much you love yourself and you crave out for that love (in the ed and that sub f.example). I think you're twisted and this is rly sad",
          "created_utc": 1721883734.0
        }
      ]
    },
    {
      "id": "lf0ves8",
      "author": "None",
      "body": "My husband wholeheartedly believes it’s just some selfish choice I make and I can stop whenever I want to and that I just don’t want to and that I love all these problems it’s causing such as severe health problems, financial struggles and my plummeting self esteem. Clearly I’m having a wonderful time engaging in such an exciting activity.",
      "created_utc": 1721997031.0,
      "score": 2,
      "context": [
        {
          "id": "lf0kotc",
          "author": "toucansam0384",
          "body": "My husband is the exact same way. He doesn't believe in mental illness and thinks I should just shut it off and makes it all about him.....what I do to him, why our family isn't enough for me to stop. This just makes me worse. It's ruined our relationship. ",
          "created_utc": 1721991897.0
        }
      ]
    },
    {
      "id": "lf0w0lt",
      "author": "toucansam0384",
      "body": "Girl, I have heard this all before....it's abuse really but we take it because part of us unfortunately believes them and part of us is just stuck. Like we don't feel humiliated enough.....they are just lacking compassion z empathy and general kindness. I've found pictures on my husband's phone of \"evidence\" that he might use against me someday. I know people will say just get out of the situation we are in but unfortunately it's not so easy when he makes quadruple what I make and he's smart and knows legal stuff way better than me. I wish you luck and strength and so sorry you are dealing with this. ",
      "created_utc": 1721997293.0,
      "score": 2,
      "context": [
        {
          "id": "lf0kotc",
          "author": "toucansam0384",
          "body": "My husband is the exact same way. He doesn't believe in mental illness and thinks I should just shut it off and makes it all about him.....what I do to him, why our family isn't enough for me to stop. This just makes me worse. It's ruined our relationship. ",
          "created_utc": 1721991897.0
        },
        {
          "id": "lf0ves8",
          "author": "None",
          "body": "My husband wholeheartedly believes it’s just some selfish choice I make and I can stop whenever I want to and that I just don’t want to and that I love all these problems it’s causing such as severe health problems, financial struggles and my plummeting self esteem. Clearly I’m having a wonderful time engaging in such an exciting activity.",
          "created_utc": 1721997031.0
        }
      ]
    },
    {
      "id": "lf2bf7o",
      "author": "None",
      "body": "Omg me too! My husband also has “evidence” he keeps.",
      "created_utc": 1722014855.0,
      "score": 2,
      "context": [
        {
          "id": "lf0kotc",
          "author": "toucansam0384",
          "body": "My husband is the exact same way. He doesn't believe in mental illness and thinks I should just shut it off and makes it all about him.....what I do to him, why our family isn't enough for me to stop. This just makes me worse. It's ruined our relationship. ",
          "created_utc": 1721991897.0
        },
        {
          "id": "lf0ves8",
          "author": "None",
          "body": "My husband wholeheartedly believes it’s just some selfish choice I make and I can stop whenever I want to and that I just don’t want to and that I love all these problems it’s causing such as severe health problems, financial struggles and my plummeting self esteem. Clearly I’m having a wonderful time engaging in such an exciting activity.",
          "created_utc": 1721997031.0
        },
        {
          "id": "lf0w0lt",
          "author": "toucansam0384",
          "body": "Girl, I have heard this all before....it's abuse really but we take it because part of us unfortunately believes them and part of us is just stuck. Like we don't feel humiliated enough.....they are just lacking compassion z empathy and general kindness. I've found pictures on my husband's phone of \"evidence\" that he might use against me someday. I know people will say just get out of the situation we are in but unfortunately it's not so easy when he makes quadruple what I make and he's smart and knows legal stuff way better than me. I wish you luck and strength and so sorry you are dealing with this. ",
          "created_utc": 1721997293.0
        }
      ]
    }
  ]
}