{
  "id": "1ecf9em",
  "subreddit": "bulimia",
  "author": "vinaa27",
  "created_utc": 1721968093.0,
  "title": "Ubereats aka my toxic love affair ",
  "selftext": "Just spent $300 buying binge food to finish it all in a single episode. I feel like trash. Im broke, like this is money that’s come from selling collectables Ive had since I was 8 and I still can’t stop. \nI feel disgusting. $300 is over a MONTH of groceries for some people. I vomited everything until there was blood. This is going to kill me I’m going insane. It’s not even about the weight at this point. Make me 10 kilos heavier just TAKE THE BULIMIA AWAY. I’m in outpatient treatment but we haven’t really gotten anywhere. \n\nAnyways little rant over. If there’s anyone in the ‘beginning’ of this- STOP IT. It’s an ADDICTION. You WILL lose grip and go insane. \n\n ",
  "url": "https://www.reddit.com/r/bulimia/comments/1ecf9em/ubereats_aka_my_toxic_love_affair/",
  "score": 75,
  "num_comments": 9,
  "comments": [
    {
      "id": "lezmxqd",
      "author": "Branch-Much",
      "body": "These posts make me so weirdly comforted, in a misery loves company kinda way. For the past two days, I’ve been organised enough to actually go to the grocery store, but still made late night doordash orders 🤦🏾‍♀️. \n\nIt’s actually wild to think about how much healthier our bank balances would be without this condition 🫠.",
      "created_utc": 1721970696.0,
      "score": 31,
      "context": []
    },
    {
      "id": "lezxxdt",
      "author": "GoIdpaw",
      "body": "Right with you here. Oh my god Uber eats is my ENEMY. I’ve spent hundreds on it the past 2 weeks or so buying groceries just to binge on. You’re not alone",
      "created_utc": 1721977241.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lf05xve",
      "author": "aItereg0",
      "body": "Oof, I'm sorry. I've been there.\n\nMy binge eating was at its worst a few years ago when I was in a toxic relationship and hating myself. Uber Eats was my crutch. I think I only managed to shake the habit because I had to move back to the rural area my mum lives in and there's no delivery out here.\n\nThere's more time to question your life choices when you have to drive 15 minutes to get take away.",
      "created_utc": 1721982558.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lf0aor7",
      "author": "Disastrous-Purpose-1",
      "body": "I feel you... Yesterday in 24h I spent 75€ just from b/p 4 times. Maybe I will b/p again tonight and tomorrow .. which will lead me to +150€ of food just to throwing everything up. I hate this disorder. I don't care about anything I just want to b/p every second of my life. I'm ashamed of this. I hope we will get better soon🫶🏻",
      "created_utc": 1721985758.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lf0gwwo",
      "author": "maliciousmeower",
      "body": "sometimes i’m thankful im broke as shit lmfaooo",
      "created_utc": 1721989741.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lf5i6ox",
      "author": "Good_Vegetable8960",
      "body": "Its so sad, I do wish I could see the amount of money i’ve spent to just go down the toilet. I know its at least 20k minimum. To think what 20k would do for me rn. And i’m not rich or have money from anyone. I just have worked alot and unfortunately haven’t saved anything yet. This eating disorder has only maintained or made me gain a bit over the last 6 years. It is not worth it. Also the reality of it is, if you are wanting to let whatever ed get you to a very unhealthy place, being very thin, very weak, fragile, fatigued, you need to have financial support and an environment and lifestyle that allowed you to get that bad. I’m 21 and support myself, this ed already takes a huge toll on my energy, my immune system and overall mental health. Supporting yourself is already hard enough. I definitely wish I never started in the first place.",
      "created_utc": 1722060614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgu7gt1",
      "author": "One_Definition_8975",
      "body": "Try eat healthy.:)",
      "created_utc": 1722979567.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf0gqon",
      "author": "vinaa27",
      "body": "I’m sending you such a big hug :(( I hate that it’s such a ‘shameful’ habit. It’s so hard to talk about to anyone because saying it how it is sounds disgusting and crazy. It’s 8:30 pm for me now and I haven’t bp the entire day but the urges are hitting HARD lol",
      "created_utc": 1721989636.0,
      "score": 8,
      "context": [
        {
          "id": "lf0aor7",
          "author": "Disastrous-Purpose-1",
          "body": "I feel you... Yesterday in 24h I spent 75€ just from b/p 4 times. Maybe I will b/p again tonight and tomorrow .. which will lead me to +150€ of food just to throwing everything up. I hate this disorder. I don't care about anything I just want to b/p every second of my life. I'm ashamed of this. I hope we will get better soon🫶🏻",
          "created_utc": 1721985758.0
        }
      ]
    },
    {
      "id": "lf1tfpf",
      "author": "Disastrous-Purpose-1",
      "body": "You should be so proud of you 🫶🏻 you struggled to resist until now and it's already a win! I hope you're having a pleasant night and get the rest you deserve. I have no one to talk to and I just feel bad about myself and my life most of the time... It's 6 pm for me and I might binge in a few hours :(((",
      "created_utc": 1722009062.0,
      "score": 2,
      "context": [
        {
          "id": "lf0aor7",
          "author": "Disastrous-Purpose-1",
          "body": "I feel you... Yesterday in 24h I spent 75€ just from b/p 4 times. Maybe I will b/p again tonight and tomorrow .. which will lead me to +150€ of food just to throwing everything up. I hate this disorder. I don't care about anything I just want to b/p every second of my life. I'm ashamed of this. I hope we will get better soon🫶🏻",
          "created_utc": 1721985758.0
        },
        {
          "id": "lf0gqon",
          "author": "vinaa27",
          "body": "I’m sending you such a big hug :(( I hate that it’s such a ‘shameful’ habit. It’s so hard to talk about to anyone because saying it how it is sounds disgusting and crazy. It’s 8:30 pm for me now and I haven’t bp the entire day but the urges are hitting HARD lol",
          "created_utc": 1721989636.0
        }
      ]
    }
  ]
}