{
  "id": "1ee4e84",
  "subreddit": "bulimia",
  "author": "randomismysecondname",
  "created_utc": 1722162439.0,
  "title": "Misclassifying the vomit - anyone else??😭",
  "selftext": "Pls tell me you relate 😭 sometimes when purging I can’t identify what food it was or think it’s something else. Like yesterday I was convinced I have fucking worms - then remembered I ate quinoa and the tiny white „worms“ were just germs from it😭 same happened when I ate cheese sticks 😭\nOr for example I thought I threw up blood (which happened before so I‘m always searching for signs ig) - turns out it was jam. Or half digested salad,…\nNot to forget the moment I thought I had internal injuries because I threw up black/ dark brown anything (it was half digested salad and a liter of Coke Zero😭)\n\nPls tell me I’m not alone with this!!😭",
  "url": "https://www.reddit.com/r/bulimia/comments/1ee4e84/misclassifying_the_vomit_anyone_else/",
  "score": 76,
  "num_comments": 15,
  "comments": [
    {
      "id": "lfbnp9x",
      "author": "Aggressive-Mall6879",
      "body": "Last week when I was almost done i started vomiting dark red pieces of cherries, forgetting that I ate them as a snack after lunch, and when I saw them I was like \" Yea this is it I fucked up\" thinking they were pieces of my own stomach ☠️☠️",
      "created_utc": 1722166836.0,
      "score": 55,
      "context": []
    },
    {
      "id": "lfd3vn5",
      "author": "Icy-Money-5787",
      "body": "forgot I had a few pieces of beef jerky earlier in the day and then I bp’d a bunch of cake and pudding and I was like WHY IS THERE MEAT?? WHAT",
      "created_utc": 1722187433.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lfdoed9",
      "author": "Celestialghosty",
      "body": "I once binged on rainbow cake and when I purged I sat there and kinda admired it because it was full of swirly colours. Sitting there like damn my vomit looking like artwork",
      "created_utc": 1722194497.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lfc53ts",
      "author": "rottingglitter",
      "body": "Omg it happens all the time then like halfway through im like oh yea..... its that",
      "created_utc": 1722175130.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lfd9dwu",
      "author": "dino_wearing_hoodie",
      "body": "yeah I was throwing up cake, rice, and crackers the other day and was extremely confused as to why there were little green and orange chunks, until I remembered that earlier in the day I had peas and carrots",
      "created_utc": 1722189287.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lfdv94u",
      "author": "corporateballerina",
      "body": "Me after drinking matcha. I forgot and was horrified to see the bright green.",
      "created_utc": 1722196898.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lfev2o8",
      "author": "filthy-peach",
      "body": "Definitely noodles and rice mistakenly worms always a  terrifying experience",
      "created_utc": 1722210431.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfenqr0",
      "author": "Ok-Can1090",
      "body": "Strawberries are my safe food so they are usually inside my stomach all the time and sometimes when i throw up and they come up as well i start thinking its blood or one time i thought one of my teeth fell out but it was just oreo cream filling because i separate it from the cookie 😬",
      "created_utc": 1722207510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfeu1t8",
      "author": "embarassedcoochie",
      "body": "Last week… I forgot that I ate a raspberry pie. 🫥",
      "created_utc": 1722210019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lffvg8m",
      "author": "FlameFiasco",
      "body": "One time I forgot I had Oreos, I was terrified thinking it was dried/aged blood",
      "created_utc": 1722226453.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfg5ev9",
      "author": "Randomaccount707",
      "body": "This happens to me ALL the time 😭 Anything dark brown/red gets me panicking I’m internally bleeding until my brain finally remembers that oh, I had cherries, I’m NOT dying ",
      "created_utc": 1722232088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfis4m4",
      "author": "None",
      "body": "Sometimes I forget about meals earlier and have thrown up some oddly coloured things like red jelly, seaweed, one time I threw up a noodle but was convinced I had worms 😅",
      "created_utc": 1722275626.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfmaecb",
      "author": "o0SinnQueen0o",
      "body": "Vomiting pieces of mushroom I ate one day ago and being like \"Yup, that's digested blood that turned brown. Yippie! This is the day.\"",
      "created_utc": 1722327129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfl6en9",
      "author": "zotrocks",
      "body": "I always close my eyes now and flush like five times so I won’t see anything lol",
      "created_utc": 1722305595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfdjgji",
      "author": "Aphrasia88",
      "body": "Omfg lol\n\nBut fr I used to only purge light liquidly/soft foods so I could tell if there was blood.",
      "created_utc": 1722192751.0,
      "score": 6,
      "context": [
        {
          "id": "lfbnp9x",
          "author": "Aggressive-Mall6879",
          "body": "Last week when I was almost done i started vomiting dark red pieces of cherries, forgetting that I ate them as a snack after lunch, and when I saw them I was like \" Yea this is it I fucked up\" thinking they were pieces of my own stomach ☠️☠️",
          "created_utc": 1722166836.0
        }
      ]
    }
  ]
}