{
  "id": "1eftghy",
  "subreddit": "bulimia",
  "author": "GrapefruitPerfect149",
  "created_utc": 1722346403.0,
  "title": "I’m sorry for existing ",
  "selftext": "Whenever I purge, this thought always passes through my mind. \n\nIf I never existed, my family wouldn’t have to deal with me, I wouldn’t be wasting food, my body wouldn’t have to go through this, the childhood me wouldn’t feel helpless. Everything will be so much better without me.\n\nI’m sorry for the negative energy, but I have no where to vent… and this is truly how I feel",
  "url": "https://www.reddit.com/r/bulimia/comments/1eftghy/im_sorry_for_existing/",
  "score": 75,
  "num_comments": 7,
  "comments": [
    {
      "id": "lfnih5o",
      "author": "Disastrous-Purpose-1",
      "body": "I feel the same way.. my life is so pointless. I've no desire to live, no ambition, no plan, no future. Just eat, purge, eat, purge .. 🤧",
      "created_utc": 1722349278.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lfnlhaw",
      "author": "rottingglitter",
      "body": "Yeah im not even suicidal but after i purge i hope i dont wake up",
      "created_utc": 1722350275.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lfnirjr",
      "author": "Old-Wishbone-4937",
      "body": "Same here, I’m so sorry",
      "created_utc": 1722349375.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lfnydiz",
      "author": "hallowmean",
      "body": "Honestly? Whatever. Your life is your own, you are your own. I get what it is to feel like you're a burden, I know it. But you are your own. This won't be your forever, things will change. Even if the b'p stays, you will live your life, new things will happen, you will see new things happen to people you care about. Getting through today, tomorrow and the day after is enough, do it enough times and your life will be different.",
      "created_utc": 1722354440.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lfpngd4",
      "author": "None",
      "body": "Same",
      "created_utc": 1722373500.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfsd02i",
      "author": "None",
      "body": "i feel this so badly. every morning, especially after purging, i just feel sorry. i’m sorry you feel the same.",
      "created_utc": 1722417906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg2rku3",
      "author": "GoIdpaw",
      "body": "Me too I ruin everything my parents life my own I betrayed everyone, myself included, I can’t believe I did this to that child I was I am not me anymore, I wish I never grew up so I never had to become this",
      "created_utc": 1722564198.0,
      "score": 1,
      "context": []
    }
  ]
}