{
  "id": "1ezuazs",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1724465114.0,
  "title": "Has anyone ever been so fed up with bulimia they’ve considered suicide? ",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/1ezuazs/has_anyone_ever_been_so_fed_up_with_bulimia/",
  "score": 114,
  "num_comments": 42,
  "comments": [
    {
      "id": "ljn9rh8",
      "author": "Soft-Bike7599",
      "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
      "created_utc": 1724465819.0,
      "score": 82,
      "context": []
    },
    {
      "id": "ljnfox2",
      "author": "Excellent-World-476",
      "body": "50%% of people with eating disorders that die do so by suicide sadly.",
      "created_utc": 1724468370.0,
      "score": 33,
      "context": []
    },
    {
      "id": "ljnhofo",
      "author": "ArticleNo9805",
      "body": "Yeah currently have suicidal thoughts bc of the ED",
      "created_utc": 1724469266.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ljnitry",
      "author": "Just-Rough-4621",
      "body": "Yes, it's a daily thought for me",
      "created_utc": 1724469789.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ljnkuuj",
      "author": "vbgirl24",
      "body": "I have; a few months ago, I was in a really dark mental space. My life was nothing but bulimia and despair. I still struggle with binging and purging, but I don't have suicidal ideation at this moment. I am thankful that life is a little bit brighter, and in these moments, I try to remember that nothing is forever...even the darkest moments with my bulimia did not last forever. Not to be preachy, but I care about you and I hope life can look up for you too (and everyone else here on this thread). Bulimia is such a cruel and isolating illness. It's hard to go through it alone and sit with those thoughts. Tonight, I send you my solidarity and support!",
      "created_utc": 1724470743.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ljnjz2y",
      "author": "leotoad",
      "body": "Yep. When I was bulimic I was hoping everyday that it would kill me lol",
      "created_utc": 1724470320.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ljpacnf",
      "author": "Safetychick92",
      "body": "Yes. About 13 years ago I tried to commit suicide. I was in a coma for about 4 weeks. I was just so sick of living this way and struggling. I hate when people say “just stop. You’re already skinny” . It’s not even about weight anymore. I wouldn’t wish this on my worst enemy.",
      "created_utc": 1724506429.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ljnsgjn",
      "author": "SakuraSkye16",
      "body": "Tried. More than once. 🙃\nOn the plus side; now I live life with literally zero fears or fucks to give cuz waking up in hospital hooked up to machines and unsure how you got there beats everything.\n\n\nAttempting to end my life ended up giving me a better outlook on it; even if it's a life where I have an ED that'll never go away ;u;\n\n\nHowever 10/10 don't recommend it because there is no shame like having to stand in the corner of a hospital room waiting for your sheets to be changed cuz you barfed frothy OD vomit all over yourself;-;",
      "created_utc": 1724474572.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ljol09v",
      "author": "No-Banana-9377",
      "body": "Yes I’ve reached the point of being fed up with obsessing over my weight and being afraid to go over a certain number, but I also use purging as a way to seek relief so it’s confusing that it makes me want to die and keeps me from wanting to die at the same time",
      "created_utc": 1724493232.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljobcj5",
      "author": "strawberrydietcola",
      "body": "yes i really canr keep doing this anymore it takes up all my time and energy i feel like more of a shell of a person than i did when i was restricting",
      "created_utc": 1724486436.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljq3zob",
      "author": "Good-of-Rome",
      "body": "More so just exhausted with having to do a thing I don't like that hurts every 3 or 4 hours. I'm so tired of it.",
      "created_utc": 1724516891.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ljoaaop",
      "author": "AVERYLOUDFART",
      "body": "Yes, since I started with this disorder I became more anxious and depressed, my libido went down a lot as did my excitement about things I enjoy. Not only is it killing me, it's also consuming everything in me.",
      "created_utc": 1724485711.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljosdsc",
      "author": "Recent_Asparagus7428",
      "body": "I used to be. Then I started trying to quiet the noise with drugs instead. Absolutely do NOT recommend, though I figured I’m already an addict, why not try something new? \n\n\n\nThough honestly, proper medications like antidepressants, ADHD medication; anti-anxiety meds work wonders, too. Unfortunately, there is still that allure to continue self-medicating.  Very slippery slope, and I can very easily destroy myself.",
      "created_utc": 1724497994.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljsjgih",
      "author": "5star-my-notebook",
      "body": "Yeah, when I was in and out of treatment a lot as a teen and very depressed. Now I’m just resigned to it and I feel less distress over the powerlessness and hopelessness that come along with daily b/p. I’ve given up on fighting it. I still feel like garbage but I’m a bit more at peace now at least.",
      "created_utc": 1724548702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljsugn0",
      "author": "None",
      "body": "Yes. It wasn’t bulimia per se, but I was just in a dark place overall which made for the environment to be bulimic. I stopped 18 years ago. Find people to hold you accountable. Find a healthy physical activity. You can get through this. You are worthy of love and it begins with yourself. Treat yourself as you would a child. Being kind to yourself is the least selfish thing you can do. 💖",
      "created_utc": 1724553393.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljnobie",
      "author": "HerElectronicHaze",
      "body": "Frequently",
      "created_utc": 1724472427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljnthr2",
      "author": "Longjumping_Laugh337",
      "body": "Yes, when I see the number on the scale, even though I’m putting my body through so much. When I look in the mirror, get dressed. Every single day",
      "created_utc": 1724475137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljnw30d",
      "author": "weedfat",
      "body": "yes, made me so miserable i either tried killing myself or wish it’d take the wheel for me",
      "created_utc": 1724476593.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljo1ul9",
      "author": "Commercial_Active141",
      "body": "right here",
      "created_utc": 1724480090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljpclur",
      "author": "Desperate_Fault3506",
      "body": "yes",
      "created_utc": 1724507305.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljpidra",
      "author": "rachrachcalero",
      "body": "Yeaaaa I figured that if I died with the disease then it didn’t matter anyway, it’s not like I want to live regardless of that",
      "created_utc": 1724509471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljqppa8",
      "author": "Due-Egg-8460",
      "body": "It's such a viscous cycle bc when I tried to remove my thoughts away from my body, I just became totally dissociated to my body but also everything else in my life, which made me want to kill myself even more. \n\nPS this is not to put of anyone getting better, I just did in a poorly self managed way!",
      "created_utc": 1724524119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljqrqzb",
      "author": "Megatr0n96",
      "body": "Been so beat down by life that it’s the only thing that comforts me .",
      "created_utc": 1724524800.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljqst4u",
      "author": "orangepepsicola",
      "body": "Yeah but it was only bc I gained weight",
      "created_utc": 1724525153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljrksxr",
      "author": "fireflashthirteen",
      "body": "Attempted, and like the overwhelming majority of suicides, it didn't work out. \n\nGet busy living or get busy dying imo - and I'd highly recommend the former over the latter having tried both",
      "created_utc": 1724535005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljrol2e",
      "author": "BilboCatSock",
      "body": "I feel like b/p-ing is what keeps me from killing myself. I quit for approximately 7 months because I got diagnosed with pcos and decided I should be healthier. It was awful. Trying to deal with an illness that makes it hard to lose weight and without the emotional crutch of puking was awful. I’m now occasionally having b/p sessions and as awful as it sounds I feel so much better mentally that it’s “worth it”. Lowkey, hope it kills me anyway though.",
      "created_utc": 1724536422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljrto80",
      "author": "None",
      "body": "no actually...funny enough bulimia was an escape from it",
      "created_utc": 1724538392.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljrxtjz",
      "author": "Dizzy-cat13",
      "body": "Honestly, everyday",
      "created_utc": 1724540010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljs647w",
      "author": "Informal_Bear1130",
      "body": "All the time:(",
      "created_utc": 1724543257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljta7wm",
      "author": "None",
      "body": "Yes :(",
      "created_utc": 1724560861.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljto57n",
      "author": "eggswithlittlehats",
      "body": "I feel this!! I use my bulimia to stop me from trying to kms , but ended up having it increase my suicidal ideation. It’s a hard cycle hey",
      "created_utc": 1724569193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljtp9n5",
      "author": "Scarlet_Hunter5544",
      "body": "I believe here i can speak for almost everyone. Been there too. Have had ED for a decade (27 years.o.) When I realised no one really understood what I was going through, seeking all kind of cures till at some point I admit I gave in to my bulimia. Yes, I talk as if it is a person, it is part of me. Everyone hated it and so did I. Until I started talking with her. Telling her that we should be friends (it is a long and not easy path we walk through) But we are stronger. The fact that you felt secure to open up about your real feelings and struggles, I congratulate you deeply!\n\nI am in my recovery phase, doing psychiatric guidance and stinking to what MY doctor gave me.\n\nI use ti have the same thoughts as you, always asking for a miracle to stop it when i was holding the toilet as if it was a sacred place … until I reached the lowest point in my life of bulimia, stomach operation. I was given less than 25% survival chances, however that’s when the miracle came. A second chance to life. No one has to reach that point, tho, open up, it is not a taboo subject, even if you start here sharing your feelings. I and the community are here for you🤗 keep going life is beautiful",
      "created_utc": 1724569928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lju35bm",
      "author": "Glittering_goat25",
      "body": "I had a nearly fatal attempt yea",
      "created_utc": 1724579463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljw0zok",
      "author": "None",
      "body": "Yup",
      "created_utc": 1724608289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk3wbwh",
      "author": "Some-Contract5297",
      "body": "Always",
      "created_utc": 1724722169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk52r7r",
      "author": "throupandaway",
      "body": "It’s the restriction that makes me more active with suicide. The binging and purging keeps me from doing other stuff. Theres a different type of suicidal I get when I’m hungry and inconsolable and I’m just living like I’m counting the days down vs living my shitty bulimic routine every single day, but still feeling like I’m alive, even if my life is just revolving around eating and throwing up. Restricting but keeping food down, there’s no guarantee the scale will be lighter in the morning. When I’m doing this, I know exactly how much I weigh, I see the scale go down every day. It doesn’t feel like I’m just waiting and praying to be thin, I feel like I am in more control over the number.",
      "created_utc": 1724743785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljnw75y",
      "author": "Real_CatCupcake",
      "body": "Real if I was actually planning to do it before I developed bulimia so in a way it \"saved\" me but It also makes me feel like shit and ig it's slowly killing me anyway",
      "created_utc": 1724476659.0,
      "score": 20,
      "context": [
        {
          "id": "ljn9rh8",
          "author": "Soft-Bike7599",
          "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
          "created_utc": 1724465819.0
        }
      ]
    },
    {
      "id": "ljolt6f",
      "author": "Old-Wishbone-4937",
      "body": "that’s so real. I was so close to killing myself but what pushed me through a bit was the thought that my life could get better if I was skinny-making me develop bulimia",
      "created_utc": 1724493785.0,
      "score": 9,
      "context": [
        {
          "id": "ljn9rh8",
          "author": "Soft-Bike7599",
          "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
          "created_utc": 1724465819.0
        }
      ]
    },
    {
      "id": "ljs6het",
      "author": "Informal_Bear1130",
      "body": "This ong",
      "created_utc": 1724543401.0,
      "score": 2,
      "context": [
        {
          "id": "ljol09v",
          "author": "No-Banana-9377",
          "body": "Yes I’ve reached the point of being fed up with obsessing over my weight and being afraid to go over a certain number, but I also use purging as a way to seek relief so it’s confusing that it makes me want to die and keeps me from wanting to die at the same time",
          "created_utc": 1724493232.0
        }
      ]
    },
    {
      "id": "ljqnv6z",
      "author": "Due-Egg-8460",
      "body": "I think it's that at the beginning you think you've found cheat code for life, so theres hope. To the realisation that this is not the case and it's now making me want to kill myself bc all my hopes are shattered.",
      "created_utc": 1724523515.0,
      "score": 5,
      "context": [
        {
          "id": "ljn9rh8",
          "author": "Soft-Bike7599",
          "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
          "created_utc": 1724465819.0
        },
        {
          "id": "ljolt6f",
          "author": "Old-Wishbone-4937",
          "body": "that’s so real. I was so close to killing myself but what pushed me through a bit was the thought that my life could get better if I was skinny-making me develop bulimia",
          "created_utc": 1724493785.0
        }
      ]
    },
    {
      "id": "ljsogzz",
      "author": "Awkward_Associate338",
      "body": "That was me too. I suffered from depression and suicidal thoughts before bulimia. I started dieting and exercising thinking if I were skinny, I'd be happier. Then the b/p started, and now I'm depressed and I have an ED. So I'm slowly killing myself",
      "created_utc": 1724550826.0,
      "score": 2,
      "context": [
        {
          "id": "ljn9rh8",
          "author": "Soft-Bike7599",
          "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
          "created_utc": 1724465819.0
        },
        {
          "id": "ljolt6f",
          "author": "Old-Wishbone-4937",
          "body": "that’s so real. I was so close to killing myself but what pushed me through a bit was the thought that my life could get better if I was skinny-making me develop bulimia",
          "created_utc": 1724493785.0
        }
      ]
    },
    {
      "id": "ljqyqc9",
      "author": "Old-Wishbone-4937",
      "body": "omfg that’s so real, im so sorry. I literally try and gaslight myself into thinking it’s worth it to get even skinner and the deeper I get into the ed the more I realise it’s not, so I think back to how I looked before the disorder when I had binge and how how this “saved me” and shit but it’s so difficult trying to pretend it has benefits when it’s ruining me even more.",
      "created_utc": 1724527149.0,
      "score": 1,
      "context": [
        {
          "id": "ljn9rh8",
          "author": "Soft-Bike7599",
          "body": "I alternate between bulimia makes me want to kill myself and bulimia is the only thing keeping me from killing myself",
          "created_utc": 1724465819.0
        },
        {
          "id": "ljolt6f",
          "author": "Old-Wishbone-4937",
          "body": "that’s so real. I was so close to killing myself but what pushed me through a bit was the thought that my life could get better if I was skinny-making me develop bulimia",
          "created_utc": 1724493785.0
        },
        {
          "id": "ljqnv6z",
          "author": "Due-Egg-8460",
          "body": "I think it's that at the beginning you think you've found cheat code for life, so theres hope. To the realisation that this is not the case and it's now making me want to kill myself bc all my hopes are shattered.",
          "created_utc": 1724523515.0
        }
      ]
    }
  ]
}