{
  "id": "1f7xc43",
  "subreddit": "bulimia",
  "author": "GrapefruitPerfect149",
  "created_utc": 1725362265.0,
  "title": "Anyone bp everyday?",
  "selftext": "I mean EVERYDAY, not one day another. \nI’ve been bp everyday nonstop for 5 years and multiple times a day. I’m so ashamed of myself. \nThe longest I’ve stay cleaned for is 24 hours…",
  "url": "https://www.reddit.com/r/bulimia/comments/1f7xc43/anyone_bp_everyday/",
  "score": 82,
  "num_comments": 54,
  "comments": [
    {
      "id": "llavhm7",
      "author": "Wise_Instruction6516",
      "body": "I purge after every single meal, binge or not",
      "created_utc": 1725369718.0,
      "score": 53,
      "context": []
    },
    {
      "id": "llakun8",
      "author": "None",
      "body": "yeah. i do it every night. it’s part of my routine at this point. i get really irritable if there’s people around me and i can’t bp too",
      "created_utc": 1725365353.0,
      "score": 49,
      "context": []
    },
    {
      "id": "llatiod",
      "author": "xo_lily_xo",
      "body": "At my worst I did, and multiple times a day too, but god did I feel unbelievably miserable. \n\n Constant sore throat, stomach pains, acid reflux etc and just felt down :( I'm in a better place now and hope to fully recover.",
      "created_utc": 1725368962.0,
      "score": 17,
      "context": []
    },
    {
      "id": "llbcgv5",
      "author": "invader_zimothy",
      "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
      "created_utc": 1725375641.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lldwlea",
      "author": "Desperate_Employee76",
      "body": "It’s gotten to the point where I have to starve myself throughout the day or eat extremely little so I can eat a big meal at the end of the day",
      "created_utc": 1725406628.0,
      "score": 7,
      "context": []
    },
    {
      "id": "llchxtv",
      "author": "benevolent-bastard",
      "body": "yeah, several times a day for the past couple years, daily for about 4 1/2 years i think. at one point it was 10 times a day",
      "created_utc": 1725388975.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llcubbv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1725392930.0,
      "score": 6,
      "context": []
    },
    {
      "id": "llahk98",
      "author": "fatale_x",
      "body": "Hate to say it, but recently I've been doing it once a day. I've Yo-yoed a lot. Managed to do some variations of 2-3days clean before relapsing. Still working on it!\n\nI just don't have the willpower to say no to cravings and that's what causing me to b/p daily. Plus the weighing scale. 😭 September will be a busy month for me, so HOPEFULLY I won't b/p (even though I just did yesterday)\n\nFighting one day at a time for now. 😶 Stay strong too OP!!",
      "created_utc": 1725363837.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llahzsb",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1725364038.0,
      "score": 4,
      "context": []
    },
    {
      "id": "llc6ydc",
      "author": "ihearthetrees",
      "body": "Constantly. It never ends. It’s awful.",
      "created_utc": 1725385463.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llggtke",
      "author": "Critical_Business_18",
      "body": "I have purged since I was 14 years old, I am now 45. \n\nSince 2013 it has been really bad. At my worst I did nothing but eat and purge (I had anorexia binge-purge type) and could not get any sleep or rest, so sometimes I purged every hour for 24 hours. \n\nI was hospitalised several times and they tried to make me eat and gain weight, but as soon as I was discharged I lost weight quickly because I am so «good» at purging.\n\nThese days I purge between 1 and 4 times per day, but I manage to not purge when I am with friends or family. I have this «rule» in my head that I can’t purge food that is given to me by someone who loves me. \n\nOf course….I am quite unable to travel to places and live in the same space/apartment as other people, because of this. I can manage to not purge for 4 days when I’m with others, but there’s my limit. I get extremely tense and anxious as I can feel the food “sitting in my stomach”. My digestion is not functioning well, due to years and years of restricting, binging and purging. \n\nI have managed to get myself weight restored, though. It was hell to go through it, but it has been worth it, since my body isn’t in starvation mode as often anymore, and that means I bp less often now. \n\nIt’s quite fascinating really (and a bit scary) how much the human body can tolerate and survive. I’ve thought multiple times that if “healthy people” had to live my life (binging and purging mostly every day), they would not be able to function. \n\nSo…. Please try and not be hard on yourself for doing what you’re doing. Binging and purging is addictive and once the cycle has started it’s really, really hard to stop. Know that for every single time you’re able to postpone it or even not do it (in spite of strong compulsion to do so) you’re in fact showing great strength and courage. \n\nNo shame… 💛 It only adds to the burden we’re already carrying, and we deserve to treat ourselves with respect and decency, even when we feel that we’re not worth it or should be doing better. \n\nI hope you have told someone you trust about what you’re going through. Are you in therapy, or do you know someone else close to you that struggle with the same? Having someone good to talk to can make a huge difference in how you feel about yourself.",
      "created_utc": 1725453224.0,
      "score": 4,
      "context": []
    },
    {
      "id": "llahofm",
      "author": "sb-2019",
      "body": "Not as bad as 5 years but I have done day after day for long periods.\n\nAre you not completely exhausted? Are you holding any foods down at all? 5 years of everyday will be taking a complete tole on your body :(\n\nHopefully you get some help and get your old self back.",
      "created_utc": 1725363891.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llcq2t3",
      "author": "ThisIsHowRumorsStart",
      "body": "There was a period of time when I was doing it everyday and at times multiples times but I’m a lot better now. I actually found a lot of comfort in reading the Jeanette mccurdy book I’m glad my mom died because she talks about her eating disorder",
      "created_utc": 1725391580.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lldor2v",
      "author": "hey-chickadee",
      "body": "i don't anymore, but that was definitely my life for years. at LEAST once a day (i couldn't go sleep until i'd b/p'd because the day didn't feel complete somehow...) but usually 3x a day or more. got to the point i'd binge in my cubicle and then purge during my break at work. you're definitely not alone. i've known a lot of others who've gone through the same thing with same frequency \n\ni had a three year break during my teens. relapsed and went back to b/p'ing for years... it controlled my life like any other addiction would. but i so rarely do it now. maybe once or twice a year. two years ago i  had a week where i went right back to the cycle, 3x  a day, every day. but it's a lot easier to walk away from now. there is hope, you know?  please don't be ashamed of yourself. this isn't your fault. you didn't chose this disorder. it's very difficult to heal from the trauma that normally causes an ed...  what you're doing and going through is a completely understandable response. and even though i'm sure it goes against your nature, being understanding and forgiving towards yourself will make all of this easier <3  \n\nif you want to know more about how i quit or just to have support in going through this shit, you can always dm me",
      "created_utc": 1725403073.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lleip7v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1725415042.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llf4q4v",
      "author": "ToastyOpal",
      "body": "I do it at least twice every night, on my days off I do it throughout the day.",
      "created_utc": 1725424585.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llcx45e",
      "author": "strawberrydietcola",
      "body": "yeah 😭",
      "created_utc": 1725393810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llek3bt",
      "author": "thenaanprophet",
      "body": "Yes. Gonna come up regardless at this point. My binges are getting so small though and usually only purging once or twice a day now. Kicking my sugar addiction helped tremendously. Slow & Steady.",
      "created_utc": 1725415578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llhmm8o",
      "author": "Scarlet_Hunter5544",
      "body": "Do not be ashamed of yourself. You have a disorder that is somewhat common but seen as a taboo topic. I have had bulimia for 10 years. Used to blame myself because I couldn’t stop. Was even telling myself that today will be the last day I purge, when the following day came and I failed to do so, I was purging even more - as a punishment.\nUntil I changed my way of thinking. A friend of mine that has had intrusive thoughts every day, he would wake up and already set in his mind that he will have them. So he had them. Until he realised it’s his perspective. If they happen they happen. We are humans.\n\nI tried doing that too, didn’t work from first. \nAs an idea, i used to purge even 20 times a day. Right now (i have had stomach operation because of a bad bulimic episode- it’s not something that happens early in the disorder, but can reach that. You don’t have to. Just change your perspective.\n\nTo directly reply to you, don’t tell yourself something you are not ready for. Start little. As an example, i used after o.p. To purge about 5 days. But i was waking up with the thought that I will purge. Then I changed my thinking when I’d wake up and say: “ok, if I purge I purge” .it didn’t take me a day to reach this point, but from 5 eps it dropped down to 3, then 2 and now I sometimes have 1 or  2. Some days I have 4. So what? \nI hope you get my point, feel free to ask anything and I am proud of you for talking about this🤗",
      "created_utc": 1725467543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llnebl7",
      "author": "PhotographSingle2746",
      "body": "Sorry for my English \nI did for 2-5x a day for 3 years, could not keep any food down. I was miserable, broke,suicidal, a bitch to everyone I meet and isolated until my mom forced me to the doctors to take a blood test, which showed that I got kidney failure. \nThat was the best day of my life because after that day I decided to get my life back together and really start my recovery process. Fast forward 1 year my health is so much better, I have a social life and an amazing relationship with my family 🩷 and I’m university studying psychology🩷 and it scares me to think if I never took the blood test my mom forced me to take I would still be bed rotting in my room. So if some one that struggled the way I did  please please get help before it to late, because my doctor told me a quote that still is stuck in my mind which is that “ bulimia is a slow suicide “ I love you and please take care of yourself before it to late🩷",
      "created_utc": 1725553174.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llan1ue",
      "author": "insomniac_queen1",
      "body": "Yeah pretty much once a day for the last 4 years, sometimes twice a day, and drinking wine at night too :( I’m exhausted",
      "created_utc": 1725366324.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llarlph",
      "author": "coffee--beans",
      "body": "I used to, and it went from once a day to 2 or 3 times a day. I can't remember how I got out of it unfortunately sjjssjs but tbh I'm prob gonna find myself back there soon",
      "created_utc": 1725368207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llbfoah",
      "author": "None",
      "body": "Yes",
      "created_utc": 1725376701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lldi48f",
      "author": "StockReporter5",
      "body": "yep, been feeling physically and mentally dead for quite some time now",
      "created_utc": 1725400608.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lldwmrt",
      "author": "Desperate_Employee76",
      "body": "I can’t believe this is. My life lol",
      "created_utc": 1725406642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lle1da3",
      "author": "andriantha",
      "body": "I’m at almost 2 years of this. My teeth have slowly started showing the signs and I’m uninsured…. Freaks me out but i cannot find a way to stop",
      "created_utc": 1725408441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llepr90",
      "author": "kathruins",
      "body": "you aren't alone.  i did that for a few years. I'm one year clean this month :)",
      "created_utc": 1725417784.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llevez3",
      "author": "Fisherman-Kitchen",
      "body": "Me. Every single day",
      "created_utc": 1725420135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llezz57",
      "author": "Ok-Eggplant-6329",
      "body": "I even purge after a singular snack.. such as …example “apple slice” or one string cheese 😔",
      "created_utc": 1725422210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llfcktu",
      "author": "nowayouutt",
      "body": "I do. No matter what i do, i will always bp every single night. Its an addiction idk how to control it",
      "created_utc": 1725429024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llh025o",
      "author": "RoboticStaticShock",
      "body": "I purge multiple times a day.  It's exhausting",
      "created_utc": 1725460222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llnagqg",
      "author": "5star-my-notebook",
      "body": "Every day since June 2019, the only breaks being times I was in treatment and supervised 24/7. Plus 1-5 times a week from October 2017-June 2019. I’m so tired.",
      "created_utc": 1725551948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llpwbkh",
      "author": "sleepymorningjoe",
      "body": "I've been bulimic for 13 years?? And honestly yes. I b/p EVERYDAY. non stop. My new record of the longest I've stayed clean was 3 days. But back then I was unable to make it passed an hour. I just can't help it. It's so addicting. And tiring at the same time. It's like my whole life is based off of this and that's it. Nothing else matters.",
      "created_utc": 1725582720.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llyf7y2",
      "author": "comebackmylove",
      "body": "you’re def not alone on this, I purge multiple times a day if I have the chance",
      "created_utc": 1725717683.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lm6ollv",
      "author": "demoIished",
      "body": "I think i have been purging almost everything for the past 2 years. I can recall like 3 meals that i didn't throw up lol.",
      "created_utc": 1725832703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmj1sm9",
      "author": "CommandRude257",
      "body": "same this was me until my pipes literally broke. now idek what to do",
      "created_utc": 1726015066.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lld4lxr",
      "author": "Old-Wishbone-4937",
      "body": "same here. Its impossible to deal with the guilt anymore",
      "created_utc": 1725396192.0,
      "score": 12,
      "context": [
        {
          "id": "llavhm7",
          "author": "Wise_Instruction6516",
          "body": "I purge after every single meal, binge or not",
          "created_utc": 1725369718.0
        }
      ]
    },
    {
      "id": "llg9ldo",
      "author": "Weary-Bus8436",
      "body": "I get super irritated when people are around stopping me from doing it also!",
      "created_utc": 1725450020.0,
      "score": 8,
      "context": [
        {
          "id": "llakun8",
          "author": "None",
          "body": "yeah. i do it every night. it’s part of my routine at this point. i get really irritable if there’s people around me and i can’t bp too",
          "created_utc": 1725365353.0
        }
      ]
    },
    {
      "id": "lldhdrd",
      "author": "HoldenCaulfield7",
      "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
      "created_utc": 1725400358.0,
      "score": 4,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        }
      ]
    },
    {
      "id": "llhn35s",
      "author": "Scarlet_Hunter5544",
      "body": "Congratulations!!!🥳 very proud of you. Relapse is something that can happen. It may happen in every disorder or addiction. Don’t be scared, you are already on the right path",
      "created_utc": 1725467693.0,
      "score": 2,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        }
      ]
    },
    {
      "id": "llbq3h4",
      "author": "None",
      "body": "hey congrats! I'm hoping the urge gets smaller and smaller as more time goes by?",
      "created_utc": 1725380075.0,
      "score": 4,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        }
      ]
    },
    {
      "id": "lleo3y6",
      "author": "None",
      "body": "Amazing!!",
      "created_utc": 1725417137.0,
      "score": 1,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        }
      ]
    },
    {
      "id": "lljd14d",
      "author": "bqii33",
      "body": "Me too",
      "created_utc": 1725488205.0,
      "score": 1,
      "context": [
        {
          "id": "lldwlea",
          "author": "Desperate_Employee76",
          "body": "It’s gotten to the point where I have to starve myself throughout the day or eat extremely little so I can eat a big meal at the end of the day",
          "created_utc": 1725406628.0
        }
      ]
    },
    {
      "id": "ly1uup8",
      "author": "Weekly_Ad_4252",
      "body": "How do you work ",
      "created_utc": 1732077355.0,
      "score": 1,
      "context": [
        {
          "id": "llcubbv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725392930.0
        }
      ]
    },
    {
      "id": "llcqvz8",
      "author": "Cautious_Bandicoot_4",
      "body": "I definitely do. It was by far the worst when I purged daily. But now I can still feel it and see it in my face the day after every time I purge.",
      "created_utc": 1725391840.0,
      "score": 6,
      "context": [
        {
          "id": "llahzsb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725364038.0
        }
      ]
    },
    {
      "id": "llyf40r",
      "author": "comebackmylove",
      "body": "How did you get rid of your sugar addiction??",
      "created_utc": 1725717641.0,
      "score": 1,
      "context": [
        {
          "id": "llek3bt",
          "author": "thenaanprophet",
          "body": "Yes. Gonna come up regardless at this point. My binges are getting so small though and usually only purging once or twice a day now. Kicking my sugar addiction helped tremendously. Slow & Steady.",
          "created_utc": 1725415578.0
        }
      ]
    },
    {
      "id": "llesjfs",
      "author": "hey-chickadee",
      "body": "i've heard rinsing with a warm water / baking soda mix after you purge can help neutralize the acid (and doesn't damage enamel like brushing right after would). it tastes gross, but baking soda is cheap and it seemed to work while i was using it (gave up at one point and stopped rinsing though, so my teeth were ruined anyway...) \n\nsometimes you can find low cost dentists in your area by calling places that accept medicaid, if they can't offer you something low-cost, they'll often refer you to other another dentist that's affordable... had one clinic give me a list of dentists that do 'deep cleaning' and some of them were only $25 ... even if you just go in for a cleaning the dentist can talk with you about how to protect your teeth despite purging \n\nsensodyne makes an enamel protection tooth paste (and i think a mouth wash) that my dentist also recommended \n\nhope this is helpful...",
      "created_utc": 1725418921.0,
      "score": 2,
      "context": [
        {
          "id": "lle1da3",
          "author": "andriantha",
          "body": "I’m at almost 2 years of this. My teeth have slowly started showing the signs and I’m uninsured…. Freaks me out but i cannot find a way to stop",
          "created_utc": 1725408441.0
        }
      ]
    },
    {
      "id": "llhmt9v",
      "author": "Scarlet_Hunter5544",
      "body": "It is possible. It is you that blames yourself, you don’t have to. I replied more detailed in a previous comment 😊",
      "created_utc": 1725467605.0,
      "score": 3,
      "context": [
        {
          "id": "llavhm7",
          "author": "Wise_Instruction6516",
          "body": "I purge after every single meal, binge or not",
          "created_utc": 1725369718.0
        },
        {
          "id": "lld4lxr",
          "author": "Old-Wishbone-4937",
          "body": "same here. Its impossible to deal with the guilt anymore",
          "created_utc": 1725396192.0
        }
      ]
    },
    {
      "id": "llgghrq",
      "author": "Savings-Composer-191",
      "body": "I had bulimia for 10 years. I haven’t BP in about a year. 5 years ago I developed GERD. The most horrible acid reflex, I got through boxes of Alka Seltzer. Sometimes it’s hard to tell if it’s a heart attack. When I would purge it would take me a few minutes to recover, so I’d lay on the floor. During purging my heart would flutter, I’d be lethargic for the rest of the day. Some days I thought I was going die right there. Slumped in the toilet. I started begging God, Jesus Christ to help me. I really wanted me life. He sure has helped me, but the consequences are still with me. As I look in the mirror, the whole bottom row of my teeth are rotten. I have constant stomach pain. GERD. I’m 36. I eat small healthy meals throughout the day, grilled chicken with veggies. Some white rice. I stay away from trigger foods. A year ago the only thing that would come up is acidic liquid. I really encourage you guys to try for your life before it’s to late…..",
      "created_utc": 1725453088.0,
      "score": 5,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        }
      ]
    },
    {
      "id": "llhvgar",
      "author": "invader_zimothy",
      "body": "Honestly it took my thyroid to be so swollen that I could barely swallow to start talking myself out of the urges. I know it seems simple but is literally just start talking to myself asking questions like “what are you feeling right now that you think b/p will fix, will it fix it?” And is constantly be in check with myself and so far it’s worked. I know it’s random but that’s what helped me!",
      "created_utc": 1725470340.0,
      "score": 4,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        }
      ]
    },
    {
      "id": "lm0tsqc",
      "author": "thenaanprophet",
      "body": "I just really wanted to get better and pinpointed that as being one of my biggest cravings. I'd binge like a whole pan of brownies or entire bags of candy in the past. I honestly just made a huge effort with will power, avoiding looking at sweets in the store and not going down the candy aisle for months. I started focusing my binges on more filling things with less sugar. It took probably like 3 months or so. On a daily basis, the sweetest thing I eat now is Frosted Flakes and brown sugar cinnamon oatmeal. I'm able to have candy or baked goods in moderation. When I do have candy, it no longer tastes as good as I think it's going to. I eat things sometimes at special events and think \"omg that's way too sweet\" which is something I'd never thought I'd say. But in short, the longer you go without it, the easier it gets. It was a huge feat for me and I'm very proud of the hard work I put in though lol",
      "created_utc": 1725747518.0,
      "score": 1,
      "context": [
        {
          "id": "llek3bt",
          "author": "thenaanprophet",
          "body": "Yes. Gonna come up regardless at this point. My binges are getting so small though and usually only purging once or twice a day now. Kicking my sugar addiction helped tremendously. Slow & Steady.",
          "created_utc": 1725415578.0
        },
        {
          "id": "llyf40r",
          "author": "comebackmylove",
          "body": "How did you get rid of your sugar addiction??",
          "created_utc": 1725717641.0
        }
      ]
    },
    {
      "id": "llhou2e",
      "author": "Old-Wishbone-4937",
      "body": "thank you😀",
      "created_utc": 1725468250.0,
      "score": 2,
      "context": [
        {
          "id": "llavhm7",
          "author": "Wise_Instruction6516",
          "body": "I purge after every single meal, binge or not",
          "created_utc": 1725369718.0
        },
        {
          "id": "lld4lxr",
          "author": "Old-Wishbone-4937",
          "body": "same here. Its impossible to deal with the guilt anymore",
          "created_utc": 1725396192.0
        },
        {
          "id": "llhmt9v",
          "author": "Scarlet_Hunter5544",
          "body": "It is possible. It is you that blames yourself, you don’t have to. I replied more detailed in a previous comment 😊",
          "created_utc": 1725467605.0
        }
      ]
    },
    {
      "id": "llj61ga",
      "author": "HoldenCaulfield7",
      "body": "This is a really important comment. I’m so sorry to hear this. But proud of you for going a year strong. That’s Incredible. Has your gerd improved? Did you notice during recovery your face swelling went away?\n\nThese are things that encourage people to stop. The health consequences but also the vanity because the swelling is brutal.",
      "created_utc": 1725485737.0,
      "score": 1,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        },
        {
          "id": "llgghrq",
          "author": "Savings-Composer-191",
          "body": "I had bulimia for 10 years. I haven’t BP in about a year. 5 years ago I developed GERD. The most horrible acid reflex, I got through boxes of Alka Seltzer. Sometimes it’s hard to tell if it’s a heart attack. When I would purge it would take me a few minutes to recover, so I’d lay on the floor. During purging my heart would flutter, I’d be lethargic for the rest of the day. Some days I thought I was going die right there. Slumped in the toilet. I started begging God, Jesus Christ to help me. I really wanted me life. He sure has helped me, but the consequences are still with me. As I look in the mirror, the whole bottom row of my teeth are rotten. I have constant stomach pain. GERD. I’m 36. I eat small healthy meals throughout the day, grilled chicken with veggies. Some white rice. I stay away from trigger foods. A year ago the only thing that would come up is acidic liquid. I really encourage you guys to try for your life before it’s to late…..",
          "created_utc": 1725453088.0
        }
      ]
    },
    {
      "id": "llirqlk",
      "author": "HoldenCaulfield7",
      "body": "Sounds like DBT therapy - super good work and keep at it.\nIt helps me to clock emotions too. I can usually shorten the binge if I clock the emotions",
      "created_utc": 1725480796.0,
      "score": 2,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        },
        {
          "id": "llhvgar",
          "author": "invader_zimothy",
          "body": "Honestly it took my thyroid to be so swollen that I could barely swallow to start talking myself out of the urges. I know it seems simple but is literally just start talking to myself asking questions like “what are you feeling right now that you think b/p will fix, will it fix it?” And is constantly be in check with myself and so far it’s worked. I know it’s random but that’s what helped me!",
          "created_utc": 1725470340.0
        }
      ]
    },
    {
      "id": "lls93ir",
      "author": "Scarlet_Hunter5544",
      "body": "Very welcome",
      "created_utc": 1725625517.0,
      "score": 1,
      "context": [
        {
          "id": "llavhm7",
          "author": "Wise_Instruction6516",
          "body": "I purge after every single meal, binge or not",
          "created_utc": 1725369718.0
        },
        {
          "id": "lld4lxr",
          "author": "Old-Wishbone-4937",
          "body": "same here. Its impossible to deal with the guilt anymore",
          "created_utc": 1725396192.0
        },
        {
          "id": "llhmt9v",
          "author": "Scarlet_Hunter5544",
          "body": "It is possible. It is you that blames yourself, you don’t have to. I replied more detailed in a previous comment 😊",
          "created_utc": 1725467605.0
        },
        {
          "id": "llhou2e",
          "author": "Old-Wishbone-4937",
          "body": "thank you😀",
          "created_utc": 1725468250.0
        }
      ]
    },
    {
      "id": "llpz14q",
      "author": "Savings-Composer-191",
      "body": "Yes. My face was so swollen in most of my pictures I would always put something over my photos to cover my face. Now, I recently lost weight. The healthy way by changing my diet & my face has improved so much. I also had a constant feeling of a huge lump in my throat. That has also gotten better. ",
      "created_utc": 1725583684.0,
      "score": 2,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        },
        {
          "id": "llgghrq",
          "author": "Savings-Composer-191",
          "body": "I had bulimia for 10 years. I haven’t BP in about a year. 5 years ago I developed GERD. The most horrible acid reflex, I got through boxes of Alka Seltzer. Sometimes it’s hard to tell if it’s a heart attack. When I would purge it would take me a few minutes to recover, so I’d lay on the floor. During purging my heart would flutter, I’d be lethargic for the rest of the day. Some days I thought I was going die right there. Slumped in the toilet. I started begging God, Jesus Christ to help me. I really wanted me life. He sure has helped me, but the consequences are still with me. As I look in the mirror, the whole bottom row of my teeth are rotten. I have constant stomach pain. GERD. I’m 36. I eat small healthy meals throughout the day, grilled chicken with veggies. Some white rice. I stay away from trigger foods. A year ago the only thing that would come up is acidic liquid. I really encourage you guys to try for your life before it’s to late…..",
          "created_utc": 1725453088.0
        },
        {
          "id": "llj61ga",
          "author": "HoldenCaulfield7",
          "body": "This is a really important comment. I’m so sorry to hear this. But proud of you for going a year strong. That’s Incredible. Has your gerd improved? Did you notice during recovery your face swelling went away?\n\nThese are things that encourage people to stop. The health consequences but also the vanity because the swelling is brutal.",
          "created_utc": 1725485737.0
        }
      ]
    },
    {
      "id": "llt6c0r",
      "author": "HoldenCaulfield7",
      "body": "It’s sooo nice to feel your real face come back!!",
      "created_utc": 1725637162.0,
      "score": 1,
      "context": [
        {
          "id": "llbcgv5",
          "author": "invader_zimothy",
          "body": "At my worst yes it was multiple times a day for a few years. So far I’ve been one year clean and I’m always scared that I’ll relapse.",
          "created_utc": 1725375641.0
        },
        {
          "id": "lldhdrd",
          "author": "HoldenCaulfield7",
          "body": "Any tips on getting clean? Did you start with getting the binges to shorten?",
          "created_utc": 1725400358.0
        },
        {
          "id": "llgghrq",
          "author": "Savings-Composer-191",
          "body": "I had bulimia for 10 years. I haven’t BP in about a year. 5 years ago I developed GERD. The most horrible acid reflex, I got through boxes of Alka Seltzer. Sometimes it’s hard to tell if it’s a heart attack. When I would purge it would take me a few minutes to recover, so I’d lay on the floor. During purging my heart would flutter, I’d be lethargic for the rest of the day. Some days I thought I was going die right there. Slumped in the toilet. I started begging God, Jesus Christ to help me. I really wanted me life. He sure has helped me, but the consequences are still with me. As I look in the mirror, the whole bottom row of my teeth are rotten. I have constant stomach pain. GERD. I’m 36. I eat small healthy meals throughout the day, grilled chicken with veggies. Some white rice. I stay away from trigger foods. A year ago the only thing that would come up is acidic liquid. I really encourage you guys to try for your life before it’s to late…..",
          "created_utc": 1725453088.0
        },
        {
          "id": "llj61ga",
          "author": "HoldenCaulfield7",
          "body": "This is a really important comment. I’m so sorry to hear this. But proud of you for going a year strong. That’s Incredible. Has your gerd improved? Did you notice during recovery your face swelling went away?\n\nThese are things that encourage people to stop. The health consequences but also the vanity because the swelling is brutal.",
          "created_utc": 1725485737.0
        },
        {
          "id": "llpz14q",
          "author": "Savings-Composer-191",
          "body": "Yes. My face was so swollen in most of my pictures I would always put something over my photos to cover my face. Now, I recently lost weight. The healthy way by changing my diet & my face has improved so much. I also had a constant feeling of a huge lump in my throat. That has also gotten better. ",
          "created_utc": 1725583684.0
        }
      ]
    }
  ]
}