{
  "id": "1f8xt7t",
  "subreddit": "bulimia",
  "author": "Extension_Size8422",
  "created_utc": 1725467577.0,
  "title": "Eating normally for one day = I'm fully recovered",
  "selftext": "So I've gone 1 day and 17 hours without purging (almost 2 days). And because I had breakfast and lunch today and a snack, I literally feel like I've recovered and never had bulimia. To the point where I'm like...um, it's been ages since I last purged...and then I'm like but it was less than 2 days ago. \n\nEven just 24h without purging makes me feel like I never had the ED? And it's like I forget how it all works till I go back to binging again. \n\nLike, do you suddenly feel so disconnected from your ED? I had my meeting with the ED services when I was in one of these 'stable' periods (3 days purge free) and I suddenly felt like I was lying about the whole ED and how severe it was. And then when I'm back to multiple purges daily I feel like I'm drowning and desperately need help.\n\nDoes anyone else kinda get me?",
  "url": "https://www.reddit.com/r/bulimia/comments/1f8xt7t/eating_normally_for_one_day_im_fully_recovered/",
  "score": 69,
  "num_comments": 12,
  "comments": [
    {
      "id": "llhozb7",
      "author": "Old-Wishbone-4937",
      "body": "I understand this. I feel like I was faking it the whole time if there’s one thing I don’t purge or if I don’t for a day or so, it drives me insane",
      "created_utc": 1725468295.0,
      "score": 24,
      "context": []
    },
    {
      "id": "llhp8w7",
      "author": "Disastrous-Purpose-1",
      "body": "OMG this is so me!!! You've just described my life basically. Sometimes I catch myself walking at the gym thinking wtf did I ever think I was bulimic, I'm a gym girl, doing her steps, cardio and eating good whole food. I think I'm a liar and I dont recognize myself in bulimia anymore. It even sounds weird to just think I have been bulimic. The difficulties with that is that I often reach the point to cancel my therapist appointments on days like this bc I genuinely think I was never bulimic. I feel ashamed that someone might think I am because I deeply think I'm not. It's like it has never happened and it was just a dream/nightmare. I can't believe someone else is experiencing this too.",
      "created_utc": 1725468379.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lliwxxa",
      "author": "None",
      "body": "This is one of the hardest parts of attempting recovery. For me, (because I am a once-a-week b/per) I usually get this feeling 3-4 weeks into being free of behaviours. The feeling of triumph is so real and you feel invincible for a period. It all come crashing down for me when I relapse. It’s extremely mentally taxing every time it happens… but I keep getting ‘back on the horse’ hoping, knowing… believing that one day it will be the last.",
      "created_utc": 1725482404.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lll40sy",
      "author": "audreyswife",
      "body": "yesssss. when i go a day or two without so much as a binge, i feel like ive \"got this\". then i eat too big a dinner and the cycle starts all over again",
      "created_utc": 1725514012.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llhr1zd",
      "author": "insomniac_queen1",
      "body": "This is me rn, I’ve went 2 days now with no purging or alcohol and feel recovered lmao",
      "created_utc": 1725468948.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llil2h5",
      "author": "xMariko",
      "body": "Yes! 2 weeks no purging, following a meal plan, and then I get it in my mind that I need to check whether I'm still able to purge, because it almost seems like I already forgot I purged to begin with.",
      "created_utc": 1725478713.0,
      "score": 4,
      "context": []
    },
    {
      "id": "llo5eh1",
      "author": "Silent-Acanthaceae41",
      "body": "this is exactly me. it literally can take less than a day for me to think i’ve got it all under control when i really, really don’t",
      "created_utc": 1725561713.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lllgkeu",
      "author": "RedBullWack",
      "body": "sometimes i feel like i ruin the “fixed” days just so i feel disordered again.. but yes, i totally relate",
      "created_utc": 1725521830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lml4riw",
      "author": "None",
      "body": "Til you do it 5 times in one week and think never mind.",
      "created_utc": 1726053087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llmdt63",
      "author": "HoldenCaulfield7",
      "body": "I relate. I also get a sense from health care professionals they don’t take me seriously because I’m good at masking & a healthy weight",
      "created_utc": 1725540639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loew7i9",
      "author": "throupandaway",
      "body": "it means I have been a lying faker the entire time. A dubious person who feigns illness for sympathy. It’s keeping me in this cycle.",
      "created_utc": 1727034161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqbc50r",
      "author": "Osa2Buzyyy",
      "body": "2 mcflurries from McDonald’s was enough to make me relapse",
      "created_utc": 1728055988.0,
      "score": 1,
      "context": []
    }
  ]
}