{
  "id": "1fowoux",
  "subreddit": "bulimia",
  "author": "nowayouutt",
  "created_utc": 1727240380.0,
  "title": "What \"started\" ur bulimia?",
  "selftext": "Ik there isnt any way to \"start\" it but what caused u to develop it? For me was originally being anorexic then extreme hunger made me this way",
  "url": "https://www.reddit.com/r/bulimia/comments/1fowoux/what_started_ur_bulimia/",
  "score": 83,
  "num_comments": 76,
  "comments": [
    {
      "id": "lot813d",
      "author": "t0xicsiren",
      "body": "dieting and losing weight, then never being satisfied anymore; started purging my “cheat meals” which i was allowed to have in my dietary plan. then i became anorexic and started restricting and purging any meals, and then same as you: extreme hunger made me bulimic. the despair and frequent binges made me anorexic again over time and now im in recovery finally",
      "created_utc": 1727241365.0,
      "score": 69,
      "context": []
    },
    {
      "id": "lot7zu6",
      "author": "bilaa135",
      "body": "personally, i wanted to lose weight then remembered reading about it. i tried purging once then never stopped, ik that seems messed up lol.",
      "created_utc": 1727241345.0,
      "score": 33,
      "context": []
    },
    {
      "id": "lotahmi",
      "author": "Queenofwands1212",
      "body": "Was anorexic first. Then forced impatient where I was forced to gain an insane amount of weight in a short period of time. Then the next 12 years of my life was just me trying to lose weight/ bingeing/ exercise bulimia. Then I finally started purging in my early/ mid 20s as a way to lose weight obviously and then it just spiraled over the years and now I have anorexia with purging subtype.",
      "created_utc": 1727242793.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lotrz5s",
      "author": "obsessedpunk",
      "body": "i was restricting. read about it. tried it and “found a shortcut” to eating whatever i want and losing weight",
      "created_utc": 1727254476.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lotqn50",
      "author": "Hot-Error810",
      "body": "Getting fat shamed and wanting to look pretty like the other girls",
      "created_utc": 1727253524.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lotkjst",
      "author": "TotalDramaElizabeth",
      "body": "Had BED, saw online media about bulimia and then it started :(",
      "created_utc": 1727249204.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lotbxc3",
      "author": "ooee_",
      "body": "same it was the extreme hunger",
      "created_utc": 1727243640.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lotn2rv",
      "author": "vitutuskettu",
      "body": "Lonliness, bullying at school and parent’s divorce at the same time. It was too much for me, and I wanted to find a way out of that shit. First, I lost my weight bc everyone called me fat and ugly at school, and after that I started purging. I’ve been a bulimic for 16 years and I haven’t recovered yet but I’m trying my best to stop it.",
      "created_utc": 1727250991.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lou1kx7",
      "author": "migorenglove",
      "body": "watched a tv show where one of the main characters had bulimia and it put the idea in my head. i was around 11-12 and already struggling with body image and eating from ballet and my almond mum.",
      "created_utc": 1727260782.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lotfx5z",
      "author": "Aggressive-Mall6879",
      "body": "Very restricting diet so i allowed myself to binge once per week and purge afterwards cause it wasnt gonna hurt anyone. I don't know why that once per week became a 3+ times per day every day. I wish I could go back to the time I had control over what I ate, all because of that stupid one binge per week.",
      "created_utc": 1727246140.0,
      "score": 5,
      "context": []
    },
    {
      "id": "louf1fy",
      "author": "Easy-Molasses-2495",
      "body": "I was a binge eater beforehand, and i was so unhappy with my weight and the way i looked so i tried to just starve myself to lose weight but my binge eating tendencies always came back",
      "created_utc": 1727267256.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lov5nry",
      "author": "itsSkylahYo",
      "body": "My body doesn't do physical hunger anymore its all mental the struggle is real at night time when my mind can't stop wanting to eat, I cope with excessive running currently got swollen knees and I can't walk properly I don't know if I'm ednos or not but it's like a physical horrible feeling when I eat I'm not confident anymore I'm nervous it changes me so much so I'm forced to run and fast because I'll not be me if not",
      "created_utc": 1727276679.0,
      "score": 5,
      "context": []
    },
    {
      "id": "louzql4",
      "author": "callieann319",
      "body": "Found out when I get really nervous I throw up. Realized that throwing up (along with starvation) really makes you lose weight. Then I found out ways to throw up without the nerves and kept losing weight",
      "created_utc": 1727274781.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lovz22x",
      "author": "Appropriate-Ad-9407",
      "body": "Poor self esteem. I was average looking with a sister that looked like a model and everyone made sure I knew it...",
      "created_utc": 1727285834.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lotbpku",
      "author": "watawatatchi",
      "body": "Very long story, but I think the closest thing to what ‘started’ it, would have to be appendicitis",
      "created_utc": 1727243511.0,
      "score": 3,
      "context": []
    },
    {
      "id": "loucobm",
      "author": "Squintz_ATB",
      "body": "I've always kinda teeter-tottered between anorexia and bulimia. I remember my bulimia starting when I was about 14 or 15 though. I ran cross country through HS and the night before a meet we would always have a really short and light practice then go to one of the guy's houses for a big spaghetti dinner (the moms all kinda took turns hosting). It was always encouraged that we eat a lot of starch so we could carb load but it was just incredibly uncomfortable for me to be that full and I didn't want to gain any weight. I'd always end up purging in the bathroom and then it just kinda went from there.",
      "created_utc": 1727266252.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lovcai0",
      "author": "ChoiceInformal7823",
      "body": "finding a brand of cookie i wanted to eat so bad. but it was too many calories, so i thought, if i just did it once or twice it would be okay. almost 2 years later now",
      "created_utc": 1727278766.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lovtxfy",
      "author": "Extension-Working638",
      "body": "Mine was guilt. I just felt so guilty for eating anything at all",
      "created_utc": 1727284258.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lotut48",
      "author": "MonkRepresentative63",
      "body": "I was always overweight my whole life but when I was 16 I was sick of it. I always tried to starve when I was 12-16 but I always ended up bing in at night which kept me at same weight. So I said eff it and started purging at 16 so that I could still enjoy food lol",
      "created_utc": 1727256475.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lotyvw6",
      "author": "firewalks_withme",
      "body": "I know exactly the moment when it started, I remember the first time very well. It was caused by a situation in my life, which made me feel abandoned, replaced, useless, isolated, ugly and unlovable.",
      "created_utc": 1727259161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lou1uzt",
      "author": "Thinspolover2004",
      "body": "Noting: I've always dreamed about being deathly skinny since before the age of 10 because I was an obese kid\n\n\n\nfinally seeing my scale reading the \"under 200lbs\". first, I was heavily restricting and working on a house walking over 20,000 steps a day. \n\nthen started being hungry all the time and just being angry at my ex. I knew he'd either find it grotesque and stop loving me or worry and stopped doing the things he was doing. so, I started binging and purging and ever since I can't stop. out of that bad situation but still finding it hard to let some things go. and I will never stop worrying about my weight until I reach my UGW.",
      "created_utc": 1727260940.0,
      "score": 2,
      "context": []
    },
    {
      "id": "louvuhx",
      "author": "Responsible-Diet-427",
      "body": "I was happy in my body always,until I started modeling.I never be the same after made my living by looking a certain way.\nI stopped modeling and I still didn’t fully recover",
      "created_utc": 1727273492.0,
      "score": 2,
      "context": []
    },
    {
      "id": "louxo3w",
      "author": "ConsciousBar8877",
      "body": "My mom shamed me for being a little overweight as early as 1st/2nd grade. I was obsessed with food even younger than that. All I could think about was eating, constantly. When I was in 7th grade (12-13 yrs) I tried purging a cheese stick for the first time (testing the waters). I don’t think I did it again until I was in 11th grade (17 yrs). That’s when I started restricting, but then when I got free food at my job I would eat on break, and purge it in the bathroom. My mom had passed away by that point, and my dad and stepmom had a lock on our pantry, and wouldn’t allow my siblings and I to pick out our own food. I didn’t even weigh too much, but they shamed me terribly for my weight and would call me porky pig. They put me on an exercise plan and were weighing me at random. I lost a lot of weight pretty quickly. When I stopped restricting, I continued to binge and gained an insane amount of weight. I am now morbidly obese, and weigh more than I EVER have. Now I am 22 yrs old and b/p 7-12 times a week.",
      "created_utc": 1727274100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovaet5",
      "author": "vareenoo",
      "body": "starved myself, and then, when i eventually got so hungry, i thought that i could just purge any “cheat meals” (binges really). so then i would plan moments where i would let myself go around some type of food i was craving (cake, cookies, pasta, whatever) and then just purge it and not do it again for a week or so.",
      "created_utc": 1727278175.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovo1af",
      "author": "MillyDally",
      "body": "My mom restricted my food a LOT as a kid - she has exercise bulimia and would make me run with her when I was like around 10. I would start walking because I have asthma and didn't know at the time. I would tell her I couldn't breathe and tasted blood and she would roll her eyes at me and say I was being so dramatic. She signed me up for weight watchers and made me go to meetings with her. She would have no snack foods in the house. \n\n However, my dad kept a stash of snacks on the bottom shelf of the pantry and sometimes on the weekend he would take me fishing and we would stop by the market to get snacks but we had to finish them before we got home or mom would know. \n\nSo I think BED came pretty easily to me. Add the fear of my mom getting mad that I was still overweight and checking my food log and accusing me of not logging everything... purging was pretty much the next natural step.",
      "created_utc": 1727282440.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lovu6ir",
      "author": "Winnipegwonderland19",
      "body": "Severely anorexic for two years.\nWent to rehab. Gained weight back but didn’t recover mentally.\nRestricting/over exercising was really hard on my brain bc I was so hungry and didn’t have the will power my anorexic brain did.\nRestricting during the day. purging at night and over exercising was also hard but with junk food.",
      "created_utc": 1727284337.0,
      "score": 2,
      "context": []
    },
    {
      "id": "low278n",
      "author": "BlkBimboBrat",
      "body": "I worked at an eating disorder clinic to gain experience for my resume and picked up many of their behaviors. I knew I had bad eating habits, but it wasn’t until I started working there that I realized my eating habits weren’t just bad, I possibly have an ED.",
      "created_utc": 1727286799.0,
      "score": 2,
      "context": []
    },
    {
      "id": "low3vk1",
      "author": "UnrliablNrrtr666",
      "body": "Severe restriction in my teens, probably anorexia but never diagnosed or got treatment for it just forced to “recover” by family (they honestly did their best as no way would I have gone to therapy or anything), I just got better at hiding it and it morphed into bulimia",
      "created_utc": 1727287310.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lowgal7",
      "author": "TwatFaceDC",
      "body": "I think I truly l blame media influencing me and my mother. I never had a healthy relationship with food. Then Tumblr came along and I was at my worst",
      "created_utc": 1727291192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lowl9o6",
      "author": "LoreleiInMetropolis",
      "body": "Being overweight growing upp, bullying and being an outcast. Hated myself so much, so lost weight to fell better about myself. I also think constantly seating girls with \"perfect\" bodys all over social media and in movies made me feel like nobody would find me attractive unless I was skinny.",
      "created_utc": 1727292738.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lowmew3",
      "author": "kheysaaa",
      "body": "BED and regretting the binges made me try to « puke it away », its been 7years. Havent stopped, still addicted to food, b/p at least 5x a day. Things i experience to this day :  massive hair/period/weight loss, teeth brittle, face looks like a roblox character (swollen jaw) and a skeleton at the same time, almost had a heart attack (went to intensive care ) & (havent had a period in 2 years)\n\nANYWAAAAAY pls get help if you dont want to end up like me",
      "created_utc": 1727293091.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lox44zk",
      "author": "tHerose47",
      "body": "extreme hunger from restricting for so long i was so triggered from the amount of weight i started gaining so i started purging and here we are. \n(1 1/2 years of restricting and now almost a year bulimic 🥲)",
      "created_utc": 1727298541.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxje3o",
      "author": "Odd_Panic_6574",
      "body": "Stress basically",
      "created_utc": 1727303771.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxoge0",
      "author": "derederellama",
      "body": "i induced vomiting while super drunk to make myself feel better... it worked... so one thing led to another and i started doing it while sober. i wasn't initially doing it to lose weight, but once i realized i was, i couldn't stop myself. 😔",
      "created_utc": 1727305610.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxpz79",
      "author": "Proud_Fig3756",
      "body": "I had stomach issues where I couldn't keep food down for a short while, found it cool that I could eat whatever and still look skinny. but it made my health anxiety so so so much worse and now trying to recover",
      "created_utc": 1727306164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxukmk",
      "author": "Reasonable-Charge580",
      "body": "Both my parents are obsessed with diet culture. I was put on diets and made to weigh myself. I started skipping meals and restricting and over exercising when I was just 12. By 16, I was counting all my calories, then I started making myself throw up. I’m 22 and making small steps to recover.",
      "created_utc": 1727307848.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxunhz",
      "author": "None",
      "body": "i’d purged a few times and had ednos for a couple years but it never turned into full blown bulimia until i watched the crown last year lmfao",
      "created_utc": 1727307877.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loxzzxf",
      "author": "Hour-Reception6386",
      "body": "me too! it’s refreshing to hear someone with the same story",
      "created_utc": 1727309847.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loy5qkj",
      "author": "apackoflemurs",
      "body": "I had BED and was obese. I purged the first time as a way to fix my binge. I told myself it was just a tool until I got over my binging. And it did help for a while, but eventually my body got used to the purging and so the binges went back up and passed what they were originally. But by that point I was in denial and kept thinking my purging wasn’t bulimia because I was using it as a “tool” and justified it by thinking that being fat is unhealthy so what does it matter if I use an unhealthy method to get a more healthy weight. \n\nA lot of denialism in mine.",
      "created_utc": 1727311958.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loy68on",
      "author": "Weekly_Variation253",
      "body": "to be honest, i think it was my weed addiction because food tastes so good when im high. once i started binging i wasn’t able to stop and i gained a lot of weight. it became a huge emotional crutch for me. i started purging because of my body image issues and then THAT became a huge relief. its hard for my to pinpoint the exact moment i started because my memory of that time is really foggy due to the weed usage.",
      "created_utc": 1727312145.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loy80ll",
      "author": "Feisty-Potato-81",
      "body": "Being forced to eat in treatment for anorexia, after they said they'd slowly up my calories. But I was so unbelievably uncomfortably full... so at night I'd purge and that was thar 😅🫠",
      "created_utc": 1727312817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loyh6og",
      "author": "Objective_Ad3091",
      "body": "IBS. After years of severe IBS and barely being able to stomach anything but chicken and rice without being in excruciating pain I started binging and purging foods that I was craving but I knew my stomach couldn’t handle.\n\nI know I didn’t get everything out if my stomach flares up afterwards but that rarely happens. \n\nTbh it’s the only thing that keeps me sane and quiets the constant food noise/cravings from not being able to eat a lot but I know it’s super unhealthy 😪",
      "created_utc": 1727316327.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loyjbw5",
      "author": "ashleereed_0331",
      "body": "I read a book about it in middle school and i was like whoa I didn't know you could lose weight that way. The ironic part is the book didn't really glorify it it was supposed to be a cautionary tale but clearly I'm stupid. Here I am over a decade later still doing this bs.",
      "created_utc": 1727317167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lozgd2u",
      "author": "astarays",
      "body": "i was anorexic first, then i was being forced to eat nd gain weight by my parents. I started purging as a way to get rid of the food, then i realised i could just eat more and throw it up anyway so i started eating more and more each time and developed bulimia. Now i am addicted and my binges r huge.",
      "created_utc": 1727334099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lozj1z2",
      "author": "livmargo",
      "body": "TW: mentions of CSA\n\ntrauma. when i was 12 i was envisioning purging as “getting rid of what happened to me” in a metaphorical sense from CSA, while also trying to stop myself from developing physically anymore than i already had as i began puberty at a very young age. \n\nhowever being an impressionable child it started to change focuses and became more about getting thinner and thinner, because of this i also developed anorexia. \n\nbut yeah, not great! i still struggle with it somewhat, but considered myself relatively recovered which came after my largest relapse two years ago, in which i ended up in treatment for the disorder. some days are still harder than others, especially when im struggling with my C-PTSD, but doing considerably better than i once was 😊",
      "created_utc": 1727335943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lp0tyj5",
      "author": "Material-Tank5689",
      "body": "Bullies. Getting called “fat” throughout school. I’m 32 now and still struggle. I’ve never even been overweight :(",
      "created_utc": 1727360023.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lp2cn5w",
      "author": "Pitiful-Seaweed-432",
      "body": "comparing myself to others and being overweight.",
      "created_utc": 1727377124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lp2f9bw",
      "author": "railsisswag",
      "body": "i was anorexic for about six months and started really missing food so i would just start eating and not keeping it down",
      "created_utc": 1727377961.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loti94w",
      "author": "None",
      "body": "my story is actually crazy\n\nokay so, my mum was an alcoholic since i was alive, so our family situation began to struggle very early. im not getting into that much, but i broke down the contact to my mum when i turned 11. it was hard to see her fall apart, her skin changed, her eyes turned yellow, she was eugenia cooney looking so i never talked to her again it scared me as a kid \n\nbut then 2021 she died cause of the alcohol\n\nand i never talked with her. but my sister told me that she past away, and my reaction was normal, i didn’t cry, i wasn’t sad. i was sad that she never actually tried to get sober but i was so used to this shit it didn’t bother „much“\nbut then i remember i ate pizza or something that day since i had no motivation to cook, i still was overwhelmed. but when it was in me, i felt so sick and stressed from the whole situation that i puked it back out, so there it all started \n\nfirst it was coping, i did it here n there\nthen an addiction, then an obsession, and now im sure it will kill me. \n my story :)",
      "created_utc": 1727247655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lotyro5",
      "author": "Real_CatCupcake",
      "body": "Same for me I was anorexic and terrified of food but still craved it then extreme hunger made me gain all the weight back which I was desperate to loose and I started dieting and using disordered behaviours but it was taking too long and I hated my body then one day I just had it and purged and this spiralled using bulimia as a way to eat what I want and lose weight even faster.",
      "created_utc": 1727259089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loual40",
      "author": "JadeBubbles_",
      "body": "Extreme hunger, like you. I tried to recover, and instead I fell into a neverending binge cycle because I was just so hungry and food-obsessed.",
      "created_utc": 1727265321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loubflt",
      "author": "ikissedblackphillip",
      "body": "I think mine started because I used to try to diet as a young child and then would end up binge eating?",
      "created_utc": 1727265704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loudqbr",
      "author": "One-Artichoke-4952",
      "body": "I have untreated bipolar disorder and I was hypomanic at a time, binge ate like 5 pieces of bread at once and although in the episode, as I was not myself whatsoever control-wise, I didn't really care in the moment, after I got out of the episode I was left with a whole 'oh crap I need to work harder now to make sure I don't gain weight and reverse all my efforts'; I had been on a fitness kick and managed to lose a fair bit of weight, healthily, but this first binge spiralled my paranoia about regaining the weight. Then, found myself restricting, becoming a bit obsessive with the calories burnt from my workouts, and sure enough, exercising to extremes to try and panicky offset my binges.",
      "created_utc": 1727266709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "louk0gn",
      "author": "ToastyOpal",
      "body": "Maybe when my boyfriend got really into fitness and dieting it kinda triggered something in me. Also his dad said to him he thinks I am too fat and ugly to be with him and that really made me want to lose weight.",
      "created_utc": 1727269229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loum7qc",
      "author": "Eversky2",
      "body": "Starting keto really was the first step for me. I think the restriction of that certain food group wasn’t good for my brain as I became a bit obsessive over it. Started eating less and less. I distinctly remember getting to a cheat day and said to myself “what if I just… don’t eat this and eat something keto”. And thus safe foods were born. The rest is like you said, extreme hunger, bingeing, guilt, purging. Repeat. Doing better now thankfully",
      "created_utc": 1727270063.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp4p1qa",
      "author": "flightofraven",
      "body": "I read ‘Wintergirls’ lol.  just thought hey her friend lost a lot of weight purging & I can’t get away with that much restricting.  Totally ignored the ending of that book.  \n\nI started purging first to lose weight, then I was over exercising, restricting & purging.  Developed anorexia binge purge, went to treatment & now it’s Bulimia.  I was living in a toxic environment & didn’t know how to cope & felt out of control.  Weight & food was the only thing to control",
      "created_utc": 1727406989.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp55nty",
      "author": "QuestionAskingOne",
      "body": "my “best friend” (biggest bully) told me i should try “this” (she did a motion of putting two fingers down her throat) in second/third grade or so\nif anything, over a decade ago\n\nso, that day, i went home not knowing wtf i was doing and tried it in the shower. first person to hear my gags and come check me: my dad, who passed away before he could see me recover. (i told the damn man to wait a lil bit oh well)\nanyways\n\nit began there. i was.. 10? 11? but eating issues in general started way before that. familial eating disorder projection at its finest… from multiple members, bless them. \none of my earliest memories is hiding an entire load of bread in my “toy kitchen” in mine and my young-mid teenage sisters room. i’d run there when no one knew/was looking and scarf down pieces of bread, like i was starving. i of course got caught by her (she won’t admit it today, but she had anorexia for a while, and my family suspects bulimia) and she’d rip it away. it felt like i was being punished.\nthere are many other things but i wont go on\n\nthrowing up became a crutch for years. when i was 13 (or 14? don’t remember), my father got diagnosed with cancer. we had a big move. by this point, someone at church, fellow kid, educated me on what it was. it’s called bulimia. it’s when you _____ so on so forth. i hadn’t known any of this up until this point, i just threw up, and knew i didn’t ever want to stop.\nage 15, my father gets the death sentence. by this point, i’m purging multiple times a day, every day, and the only thing i’m keeping down is alcohol.\n16, he’s passed away, i begin dating a guy id met at school, and i slowly get sober, but can’t kick bulimia. i also begin other forms of sh, but i wont go into it. but “it’s” also a part of me until age 21. \n\ni just now, finally, have recovered. it was just a mental switch flipped this past june… it’s also the same time i simultaneously began going to the gym, and learning catholicism/taking classes. i’m sure both played their part in my recovery, but i personally feel i figured out my key to it.\n\nwhen i used to try to receive therapy, they’d ask me what my end goal was. it for years was always “i just want to be content… okay, fine with myself”\n\nthe day i stopped feeling the need to purge, was the same day i gained a sense of self respect. i have a sense of love for myself, and understanding. all along, i had no respect for myself. reckless as hell. still am, but not that bad. there are many times people say there must be someone watchin out for me with how i got out alive. and im thankful. i’ve had so many second chances in life.. but i can confidently say, ive figured it out. and i’m slowly figuring more out day by day. \n\nbulimia WAS my personality. IT was ME. \n\nrecovery has been so much more than i ever would have expected it to be. i have interests.. hobbies.. personal opinions.. a voice.. i didn’t know that. all i was, was my eating disorder. day in, day out, morning noon and night. don’t forget in your sleep too. \n\nbut yeah. sorry for the big rant. this is the most i’ve ever spoke about my recovery, first time confidently. you’re a big organ wrapped around a lot of other organs, and it’s all pumping and twisting for you. give it some good stuff.\n\nedit: key point to recovery was being single. he and i are still close friends.\nbut being single was necessary for me to finally find an identity beyond what my mind conditioned for myself over half of my life.",
      "created_utc": 1727415239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lph3fd2",
      "author": "EREjoe",
      "body": "restricted to very unhealthy weight. Maintained that for a while, and eventually figure out I could purge my food. It's made eating easier, but now I go through this hell consistently.",
      "created_utc": 1727607450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3bxw1k",
      "author": "Prestigious_Talk6562",
      "body": "Really least answer but I need to vent it anyways. Kind of just started by me eating mangoes right before training and then not being able to keep it down. Idk why but over time that just did something to my already hyper insecure brain",
      "created_utc": 1734898176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8oaz49",
      "author": "OwlPositive2009",
      "body": "noticing that i wasn't as skinny as I used to be like two years ago and seeing how being insanely skinny was all over social media. then I started by dieting like going the entire day without eating sugar, then sometimes fasting, but then couldn't diet because i would just end up overeating. then i would go on ed twt and force myself to look at triggers so that i could stop eating. then wanting to lose weight very fast so i forced myself to start purging.",
      "created_utc": 1737608205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkywuci",
      "author": "trinstarr14",
      "body": "My boyfriend ridiculing me for my weight so I’ve started purging after every meal",
      "created_utc": 1743564791.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mur99hu",
      "author": "Lit_Met3or_0n_M3th",
      "body": "Well, an old friend of mine who was skinnier than me ( and constantly mentioning it, triggering me) told me she throws her food after eating. I asked her how she lost weight and that was the answer. Then i tried it and never stopped. It was 3 years ago. But i remember how when i was younger like. 8 or 9  i did the same thing quite often but didn’t knew what is it. \nHopefully, i found somewhere ti share this with, because i don’t feel comfortable sharing this with anyone. Im trying to quit, but never really made it.\nI would like to hear from u guys, if someone has been through this, please share me some tips!",
      "created_utc": 1748461662.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv83i6k",
      "author": "Effective-Emu-348",
      "body": "I don't think I'm bullemic but I binge and purge. It's not about weight but more about getting things out of me. I'm the type of person who keeps every negative emotions inside and IV done that my whole life so now I need a way to get something out. The easiest thing is food ",
      "created_utc": 1748688255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lourv1o",
      "author": "ClayCrafter02",
      "body": "I was molested as a child and I needed some control in my life. my mom has issues with weight and food, therefore I already had issues with my body. I started being bulimic so I could control at least an aspect of my life, and it made me look skinny so I though “a win is a win”. sike",
      "created_utc": 1727272127.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lou9pz5",
      "author": "Lopsided-Criticism13",
      "body": "May I ask, how do you do recovery from an-bp? Do you give in to extreme hunger? How are you doing it?",
      "created_utc": 1727264927.0,
      "score": 10,
      "context": [
        {
          "id": "lot813d",
          "author": "t0xicsiren",
          "body": "dieting and losing weight, then never being satisfied anymore; started purging my “cheat meals” which i was allowed to have in my dietary plan. then i became anorexic and started restricting and purging any meals, and then same as you: extreme hunger made me bulimic. the despair and frequent binges made me anorexic again over time and now im in recovery finally",
          "created_utc": 1727241365.0
        }
      ]
    },
    {
      "id": "lpctht7",
      "author": "zombiesrcominn",
      "body": "this is where i am now, i’m glad i’m not alone",
      "created_utc": 1727539118.0,
      "score": 1,
      "context": [
        {
          "id": "lot813d",
          "author": "t0xicsiren",
          "body": "dieting and losing weight, then never being satisfied anymore; started purging my “cheat meals” which i was allowed to have in my dietary plan. then i became anorexic and started restricting and purging any meals, and then same as you: extreme hunger made me bulimic. the despair and frequent binges made me anorexic again over time and now im in recovery finally",
          "created_utc": 1727241365.0
        }
      ]
    },
    {
      "id": "louaoc6",
      "author": "StewdFartsNapplPeels",
      "body": "It was kind of the same for me except it was bc my bf at the time was a wrestler, and told me he purged to make weight. I tried it once like you and never stopped.  It turned into a never ending cycle between anorexia and bulimia.",
      "created_utc": 1727265361.0,
      "score": 4,
      "context": [
        {
          "id": "lot7zu6",
          "author": "bilaa135",
          "body": "personally, i wanted to lose weight then remembered reading about it. i tried purging once then never stopped, ik that seems messed up lol.",
          "created_utc": 1727241345.0
        }
      ]
    },
    {
      "id": "loxvbd7",
      "author": "Rare-Peanut-9111",
      "body": "Honestly I felt like a genius when I came up with this idea of being able to eat whatever I want and then “cancel” it. Fast forward twenty years and I’m still doing it even though I’ve recognised that it’s very bad for me and it’s not a great way to lose weight. It’s just so addictive.",
      "created_utc": 1727308120.0,
      "score": 9,
      "context": [
        {
          "id": "lotrz5s",
          "author": "obsessedpunk",
          "body": "i was restricting. read about it. tried it and “found a shortcut” to eating whatever i want and losing weight",
          "created_utc": 1727254476.0
        }
      ]
    },
    {
      "id": "lowlewm",
      "author": "LoreleiInMetropolis",
      "body": "Same for me",
      "created_utc": 1727292783.0,
      "score": 2,
      "context": [
        {
          "id": "lotqn50",
          "author": "Hot-Error810",
          "body": "Getting fat shamed and wanting to look pretty like the other girls",
          "created_utc": 1727253524.0
        }
      ]
    },
    {
      "id": "lovuo5c",
      "author": "Winnipegwonderland19",
      "body": "You are me. It’s crazy how the pendulum swings from one side to the other. If someone told anorexic me I’d eat junk and throw it all up until nothing was left I’d think you were crazy bc I’d still think I was consuming calories through my tongue or whatever it is people told me about caloric consumption :p",
      "created_utc": 1727284487.0,
      "score": 3,
      "context": [
        {
          "id": "lotyro5",
          "author": "Real_CatCupcake",
          "body": "Same for me I was anorexic and terrified of food but still craved it then extreme hunger made me gain all the weight back which I was desperate to loose and I started dieting and using disordered behaviours but it was taking too long and I hated my body then one day I just had it and purged and this spiralled using bulimia as a way to eat what I want and lose weight even faster.",
          "created_utc": 1727259089.0
        }
      ]
    },
    {
      "id": "louehm7",
      "author": "Squintz_ATB",
      "body": "I have bipolar disorder as well. I'm on meds and fairly stable but still have episodes (they're much more mild, don't last as long, and don't happen as often thanks to my meds though). It always fucks with my eating. I tend to restrict and not need/want food if I'm feeling manic but when I'm in a depressive state I tend to binge and purge more.",
      "created_utc": 1727267029.0,
      "score": 1,
      "context": [
        {
          "id": "loudqbr",
          "author": "One-Artichoke-4952",
          "body": "I have untreated bipolar disorder and I was hypomanic at a time, binge ate like 5 pieces of bread at once and although in the episode, as I was not myself whatsoever control-wise, I didn't really care in the moment, after I got out of the episode I was left with a whole 'oh crap I need to work harder now to make sure I don't gain weight and reverse all my efforts'; I had been on a fitness kick and managed to lose a fair bit of weight, healthily, but this first binge spiralled my paranoia about regaining the weight. Then, found myself restricting, becoming a bit obsessive with the calories burnt from my workouts, and sure enough, exercising to extremes to try and panicky offset my binges.",
          "created_utc": 1727266709.0
        }
      ]
    },
    {
      "id": "louzzjo",
      "author": "t0xicsiren",
      "body": "In my experience it felt impossible to just stop so I started slowly reducing it; I noticed my binges would always be on sweet things so I started allowing myself a sweet treat here and there, while trying to eat at least 2 or 3 healthy meals a day\nI gotta admit the first days were terrible and the urges to purge every meal were just hideous, I suffered a lot trying to wash this urge away but I started distracting myself after eating for about 30 minhtes or an hour and after that I’d be phisically incapable of purging, so I kinda forced myself into it for the first days. After that it gets a bit easier as you learn that eating actually really stops the cycle because allowing yourself all foods make you understand you don’t have to binge on any, because you can eat whatever and still mantain a decent weight if you keep it in moderation \n\nwhat I had to do though was giving up on my sick body which I think is the worst part, because at first its just hard to accept and find yourself pretty again, but at first I just tried focusing on the nutrition and im not 100% yet, but my weight is healthy now and I feel like this helps with everything else coz I got much more energy and my head’s much better now too!!! \n\nim not 100% free from purging, but from what used to be almost everyday I do it sometimes twice a month now, when I feel too desperate about some specific meal. which i honestly think it’s an improvement!!!",
      "created_utc": 1727274861.0,
      "score": 9,
      "context": [
        {
          "id": "lot813d",
          "author": "t0xicsiren",
          "body": "dieting and losing weight, then never being satisfied anymore; started purging my “cheat meals” which i was allowed to have in my dietary plan. then i became anorexic and started restricting and purging any meals, and then same as you: extreme hunger made me bulimic. the despair and frequent binges made me anorexic again over time and now im in recovery finally",
          "created_utc": 1727241365.0
        },
        {
          "id": "lou9pz5",
          "author": "Lopsided-Criticism13",
          "body": "May I ask, how do you do recovery from an-bp? Do you give in to extreme hunger? How are you doing it?",
          "created_utc": 1727264927.0
        }
      ]
    },
    {
      "id": "lozjq82",
      "author": "obsessedpunk",
      "body": "yup same here. “only” been about three years now. but im a pre professional dancer and my body is at its limits",
      "created_utc": 1727336425.0,
      "score": 3,
      "context": [
        {
          "id": "lotrz5s",
          "author": "obsessedpunk",
          "body": "i was restricting. read about it. tried it and “found a shortcut” to eating whatever i want and losing weight",
          "created_utc": 1727254476.0
        },
        {
          "id": "loxvbd7",
          "author": "Rare-Peanut-9111",
          "body": "Honestly I felt like a genius when I came up with this idea of being able to eat whatever I want and then “cancel” it. Fast forward twenty years and I’m still doing it even though I’ve recognised that it’s very bad for me and it’s not a great way to lose weight. It’s just so addictive.",
          "created_utc": 1727308120.0
        }
      ]
    },
    {
      "id": "loxmec4",
      "author": "Real_CatCupcake",
      "body": "Omg the fear of absorbing cals thing is so real 😭",
      "created_utc": 1727304857.0,
      "score": 1,
      "context": [
        {
          "id": "lotyro5",
          "author": "Real_CatCupcake",
          "body": "Same for me I was anorexic and terrified of food but still craved it then extreme hunger made me gain all the weight back which I was desperate to loose and I started dieting and using disordered behaviours but it was taking too long and I hated my body then one day I just had it and purged and this spiralled using bulimia as a way to eat what I want and lose weight even faster.",
          "created_utc": 1727259089.0
        },
        {
          "id": "lovuo5c",
          "author": "Winnipegwonderland19",
          "body": "You are me. It’s crazy how the pendulum swings from one side to the other. If someone told anorexic me I’d eat junk and throw it all up until nothing was left I’d think you were crazy bc I’d still think I was consuming calories through my tongue or whatever it is people told me about caloric consumption :p",
          "created_utc": 1727284487.0
        }
      ]
    },
    {
      "id": "loxomyn",
      "author": "One-Artichoke-4952",
      "body": "Yeah, it's not fun sadlyyy",
      "created_utc": 1727305677.0,
      "score": 2,
      "context": [
        {
          "id": "loudqbr",
          "author": "One-Artichoke-4952",
          "body": "I have untreated bipolar disorder and I was hypomanic at a time, binge ate like 5 pieces of bread at once and although in the episode, as I was not myself whatsoever control-wise, I didn't really care in the moment, after I got out of the episode I was left with a whole 'oh crap I need to work harder now to make sure I don't gain weight and reverse all my efforts'; I had been on a fitness kick and managed to lose a fair bit of weight, healthily, but this first binge spiralled my paranoia about regaining the weight. Then, found myself restricting, becoming a bit obsessive with the calories burnt from my workouts, and sure enough, exercising to extremes to try and panicky offset my binges.",
          "created_utc": 1727266709.0
        },
        {
          "id": "louehm7",
          "author": "Squintz_ATB",
          "body": "I have bipolar disorder as well. I'm on meds and fairly stable but still have episodes (they're much more mild, don't last as long, and don't happen as often thanks to my meds though). It always fucks with my eating. I tend to restrict and not need/want food if I'm feeling manic but when I'm in a depressive state I tend to binge and purge more.",
          "created_utc": 1727267029.0
        }
      ]
    }
  ]
}