{
  "id": "1fxfpwm",
  "subreddit": "bulimia",
  "author": "GrapefruitPerfect149",
  "created_utc": 1728218905.0,
  "title": "i admit. i’m happy when i binge ",
  "selftext": "i wonder what causes this, i feel happier when i’m able to binge. but i would feel annoyed when i can’t. does anyone relate to this?",
  "url": "https://www.reddit.com/r/bulimia/comments/1fxfpwm/i_admit_im_happy_when_i_binge/",
  "score": 64,
  "num_comments": 9,
  "comments": [
    {
      "id": "lqm0oik",
      "author": "aliceangelbb",
      "body": "Probably because it is an addiction. You might feel bad about the act of binging but when it is happening it can feel very comforting, like a drug.",
      "created_utc": 1728220547.0,
      "score": 51,
      "context": []
    },
    {
      "id": "lqm5k7x",
      "author": "None",
      "body": "Me too, I hoard so many snacks and food for a binge, it’s the only thing I look forward to",
      "created_utc": 1728222515.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lqmax2a",
      "author": "wintersaffron",
      "body": "I feel you. I'm almost excited to binge, I only feel terrible the next day.",
      "created_utc": 1728224451.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lqnwin1",
      "author": "champagnecrate",
      "body": "I hear you so hard! My binges started of as (i know how silly this sounds) a symptom of crushing boredom, being controlled & lacking freedom- my brain was so understimulated & my life so stifled that food was one of the only ways I could stimulate my mind & feel that sweet sweet dopamine & that gave me absolutely wild joy. It still hurts remember what life was like. \n\n\nThen ofc I began to get scared of gaining weight & then desparate to lose weight (its a bit confused but I think my logic was if I could make myself visibly different then I'd be treated differently too) so bingeing became FORBIDDEN, which only made me obsess over it more & made the rush of crazy joy when I'd inevitably crack & binge even more intense- really, it was ecstatic. ",
      "created_utc": 1728242983.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lqmw3sr",
      "author": "Turbulent-Truth-4059",
      "body": "The only thing I crave is the stupid domino’s marble cookie and even if I’m tired of them after eating them. Around 24 hours later the cravings back. So strange. But at least I keep a nutritious meal down every night after purge. Thank god I trained my brain to be able to!",
      "created_utc": 1728231503.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lqrdnfu",
      "author": "Kooky_Expression_795",
      "body": "I 100% relate, when I manage not to b/p for a few days I start to miss it. It’s like a hobby I can’t do, I get moody and on edge. Its relief from everyday life.",
      "created_utc": 1728299760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lqrbgrw",
      "author": "Artistic-Ostrich-591",
      "body": "ofc you are, everything comes down to the hormones that are released in your brain when you binge, you get a rush of dopamine, that’s why it’s an addiction",
      "created_utc": 1728298541.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqudzn9",
      "author": "peridotcore",
      "body": "I used to be happy, now I’m just miserable.",
      "created_utc": 1728337114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqmmo3e",
      "author": "Sea-Two3954",
      "body": "The b/p cycle consumes a lot of energy. The effort in purging can also tire a ton and have a toll on mental health. Food is a natural source of pleasure, especially if you're starved. Having this explosion of pleasure hormones after a long period of deprivation, suffering and malnutrition (during which a lot of stress hormones are secreted) multiple times in a row activates a natural mechanism called conditioning,.. You start looking forward to bingeing and your brain sees it as a reward for purging. At least that's my view on it, as I'm a binge-then-fast-and-do-sports bulimic (who's trying to recover like all of us). I'm sure there are interesting and informative studies about the subject at a neurological level\n\nIf anyone here has further knowledge that would be really cool\n\nEdit : worth mentioning too that most of us bulimics use food as a way to soothe emotions and feel comforted. Every single day living with bulimia can be challenging mentally/emotionally and we tend to turn to food for the alleviation of these heavy feelings",
      "created_utc": 1728228405.0,
      "score": 13,
      "context": [
        {
          "id": "lqm0oik",
          "author": "aliceangelbb",
          "body": "Probably because it is an addiction. You might feel bad about the act of binging but when it is happening it can feel very comforting, like a drug.",
          "created_utc": 1728220547.0
        }
      ]
    }
  ]
}