{
  "id": "1g1bvdn",
  "subreddit": "bulimia",
  "author": "Fr3dericx_",
  "created_utc": 1728658946.0,
  "title": "Please, please PLEASE jump into recovery now",
  "selftext": "I’m begging you, this illness is not worth it, AT ALL!!!\nI’m crying while writing this, facing all the consequences this ed gave me, both Ana and Mia.\nI know it’s hard, I still want to get thinner and thinner, I still hate the feeling of having food sitting on my stomach and all of that, but for god’s sakes it’s not worth it. \nMy teeth are damaged, my stomach is too, I cannot poop anymore due to lax abuse and this also gave me hemorrhoids problems, it hurts so fucking much you have no idea.\nAll because I couldn’t accept me being a normal human being. Because it’s not about weight, and we all know that. It’s about being comfortable in your own hell. But there’ll come a time where, TRUST ME, that hell won’t be comfortable anymore. It’ll burn, it’ll be exhausting at the point you’ll have no more reasons to live, being thin neither will be enough for you to continue with life. \nPlease listen to me, you’re loved and nobody actually cares about your weight, nobody cares about your legs touching together, nobody. NOBODY. and you shouldn’t either. You have so much potential, you can do so many things with your mind and your hands, why are you precluding yourself that. Why. \nI really hope to get better, step by step. I’ve started taking meds three days ago for bulimia and BPD and it’s an enormous step for me. I’ve made the choice to start living. And you should too. 💜\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1g1bvdn/please_please_please_jump_into_recovery_now/",
  "score": 123,
  "num_comments": 9,
  "comments": [
    {
      "id": "lrgyblv",
      "author": "Informal-Ad-7356",
      "body": "Beautiful post!  Keep going...you can Recover,  baby step by baby step.  Always forgive yourself.   You are doing the best you can.",
      "created_utc": 1728679905.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lrgzn5j",
      "author": "AlliteraryAnalysis",
      "body": "Well said, OP. \n\nRecovery is always the best option, and even if you think you just wanna shed a few pounds, it isn't worth it. \nAnd you ARE sick enough to get help, even if you're overweight or your legs touch! Just DO it!",
      "created_utc": 1728680361.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lri7rs9",
      "author": "Downtown-Effect-7450",
      "body": "I wish this made me care :( its hard when the reason behind your ed is bc u hate yourself and want to put yourself through as much as possible",
      "created_utc": 1728697847.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lrjkric",
      "author": "lisa6547",
      "body": "I took your words to heart as much as I could. I'm kind of drunk right now to be honest \n\nI wish the best for you in your recovery, and in your life ❤️",
      "created_utc": 1728726413.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrjst0p",
      "author": "Nordcodics",
      "body": "Good luck , I wish you best wishes",
      "created_utc": 1728731708.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrm8b9e",
      "author": "notfrom3arth",
      "body": "i totally agree i feel the same and want ppl to know this. you couldn’t have said it better",
      "created_utc": 1728764017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrowoqc",
      "author": "Left-Requirement9267",
      "body": "Hell yes OP. The older I get the less weight matters. Feeling good matters. That’s it.",
      "created_utc": 1728807390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrilsyf",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1728704131.0,
      "score": 1,
      "context": []
    }
  ]
}