{
  "id": "1g61yfi",
  "subreddit": "bulimia",
  "author": "EchoWhisperer_",
  "created_utc": 1729200530.0,
  "title": "my doctor said it’s unlikely that i will ever recover from my ED",
  "selftext": "i was reading through forms she filled out for me regarding my eating disorder, and she wrote that i will likely deteriorate & never improve. it hurts seeing that, but she’s right. i’ve been diagnosed with anorexia b/p since i was 15 and i just turned 24. i’ve done countless inpatient & day treatment programs with no success. i was sent to residential when i was 17 which was a “last resort” and that failed too. \n\ni feel hopeless and keep thinking about this woman i met in treatment when i was 18. she was in her 60s and developed an ED around the same time as i did. i’m scared that will be me (if i don’t die prematurely). i’ve already been told i’ve done irreversible damage to my digestive system & esophagus. \n\nshe has no hope in me. so why should i have hope in myself? ",
  "url": "https://www.reddit.com/r/bulimia/comments/1g61yfi/my_doctor_said_its_unlikely_that_i_will_ever/",
  "score": 72,
  "num_comments": 36,
  "comments": [
    {
      "id": "lsg223d",
      "author": "sweetfaerieface",
      "body": "I have hope for you! You are stronger than you think. Doctors should never do/say something that will cause hopelessness in a patient. I am 9 months into recovery. The ED started when I was 9. I will be 70 in December. Yes, I have worked on recovery off and on for years. Anytime spent in recovery is a win! Don’t let someone who hasn’t experienced what you have make you feel hopeless! Doctors don’t know everything.",
      "created_utc": 1729208265.0,
      "score": 54,
      "context": []
    },
    {
      "id": "lsga8r5",
      "author": "Babybirdbean",
      "body": "I developed bulimia at 16 and I'm 31 now. I had 18 months b/p free at one point. Despite my relapse I still believe that I can recover at some point. \n\nDon't lose hope ❤️",
      "created_utc": 1729211260.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lsfk4oo",
      "author": "127may",
      "body": "i’m so sorry OP, i have hope in you, i believe in you. please dont give up, there is still life out there that’s worth seeing and you deserve to give yourself a chance to. it will be hard work but it doesn’t mean you can’t do it <3 sending you luck and love <3",
      "created_utc": 1729201682.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lsgfs7k",
      "author": "db_anon8452",
      "body": "I developed my ED at 13 and didn’t fully recover until 29 when I became pregnant. I had 8 years of full recovery where I built a wondeful life (husband, 2 kids, career, home). I recently relapsed at 38 due to some really stressful life stuff but I know I’ll recover again. Don’t lose hope 💕",
      "created_utc": 1729213297.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lsfy28z",
      "author": "Excellent-World-476",
      "body": "You have hope in yourself because that is the only hope that matters at all.",
      "created_utc": 1729206775.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lsghgyq",
      "author": "FayrisDraconis",
      "body": "Doctors constantly get proven wrong, you don't need her to believe in you. You need yourself to believe in you and that's when things will start to turn around.",
      "created_utc": 1729213924.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lsgkm4o",
      "author": "lolalolaloves",
      "body": "Doctors write the most brutal things. I've been diagnosed with many things and told I need lifelong therapy, and I'm an attention seeker. Despite the knowledge, they can be very wrong and judgemental. I've done many treatment programs for my issues, sometimes the timing isn't right but it will be one day. Please don't lose hope.",
      "created_utc": 1729215109.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lsfuujc",
      "author": "LadyIlithyia",
      "body": "I am sorry, OP.  Doctors are not always right!  I have had mine for over ten years now and am in treatment and recovery.  It is possible!  \n\nI have hope for you.  Many others here do as well 💜",
      "created_utc": 1729205581.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lsh92hn",
      "author": "International-Chip99",
      "body": "Oof, that's a hard thing to hear. But doctors are scientists- they're trained to judge probabilities based on past cases. That's sensible, but you don't need to resign yourself to it. It is emphatically NOT a certainty, and your doctor would love to be proven wrong.  ",
      "created_utc": 1729225435.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lsh7v86",
      "author": "addblocc",
      "body": "fuck that! op, we put doctors on a pedestal, but they are often very wrong. \n\ni was just like you, resigned to the idea that i was never going to recover. ED therapy and support groups weren't working for me. i figured that it was just going to kill me eventually. now, it's been over a year since i last purged. you absolutely CAN do it, so please don't ever think that you are incapable. \n\ni think therapy, inpatient, etc can be great for some people. other times, i think recovery can only come from work you do yourself. which sounds daunting, but i think it's actually really empowering. \n\nas for the damage to your body - if you quit, your body is going to recover a remarkable amount. maybe there will be some lasting damage, but there are advancements in medicine all the time. things that used to be considered permanent damage in the past have become reversible through new discoveries. i wouldn't lose hope in that regard either. \n\nif you truly want to, you WILL recover, i swear you will. please believe me that it's possible no matter how deep in you feel.",
      "created_utc": 1729224825.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lshgfjw",
      "author": "elsie14",
      "body": "that’s just simply not true. you are 24. please don’t feel this way just because someone wrote it. i met someone elderly in tx too who was arguing over her chickpeas. as i refused to eat IP, I remember thinking i don’t want to be arguing over chickpeas when im elderly. so, use this thought as fuel to improve and get yourself toward your healthy goals.  good luck.",
      "created_utc": 1729229432.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lshl4dk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1729232280.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsigbvc",
      "author": "sb-2019",
      "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
      "created_utc": 1729251952.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lshnysx",
      "author": "Turbulent-Truth-4059",
      "body": "What a joke of a doctor",
      "created_utc": 1729234110.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsij7tu",
      "author": "PoldiL",
      "body": "Hi, I’m kinda in the same boat, I’ve come to accept I’ll never fully recover but I can try and be the best version possible, I’ve also done irreversible damage and I’m about to go on HRT at 23… I’m trying to deal and handle all the Damage I have caused to my body, mind and heal relationships with my family, friends and partner. \n\nNo I’m not comfortable eating out but I can, and that’s good enough for me and my family - it means I can be at family events, go to my bestfriends birthday brunch, yeah I won’t finish the meal, sometimes I’ll barely touch it if I’m having a bad day, but I’m present and that’s more than what I could have done a couple of years ago. \n\nThere will always be little things we hold on to, and we will always be overcoming new things and overcoming fears, recovery for a lot of us is going to be a constant thing in our lives, and that’s okay, we can be proud of ourselves for getting to a healthier place. And sometimes that’s enough. \n\nAm I recovered? No, do I have periods where I’m worse, yes, buttt am I a healthier weight, the strongest and happiest I’ve been in years, yes. That’s good enough for me :) \n\nStop putting pressure on yourself to ‘fully’ recover and to recover ‘perfectly’, you just need to move forward, little by little, baby steps :)",
      "created_utc": 1729253265.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lskfdaw",
      "author": "KissMeSlowlyPlease",
      "body": "Now why tf would they say some silly shit like this \n\nI’m a therapist & professor with an eating disorder. I’ve never said anything like that to my clients or students, ever. \n\nPlease report her to your nearest state licensure board because she should not be practicing in any capacity. JFC.\n\nSide bar: I’ve had an ED since 12, and I’m 31. I’m outraged on your behalf.",
      "created_utc": 1729276270.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsiwr7w",
      "author": "None",
      "body": "Your doctor needs to listen to a Ted talk or something for real… you’re 24. Nothing about you is fixed. \nIf it helps, I developed my ED very early like 12ish and struggled for 10+ years… nowadays even when I plan to relapse (bulimia swag, buy the binge food) I find myself not even able to relapse beyond one or two purges. Would’ve been unimaginable for me 5 years ago to feel that way. \n\nSeriously that doctor needs to take a class idk",
      "created_utc": 1729258667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsk4r9a",
      "author": "Wtfisthis66",
      "body": "I was in treatment with a woman who was in her 80s, she had been ill off and on her whole life,",
      "created_utc": 1729272870.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lslpw0o",
      "author": "chanelau",
      "body": "Screw your doctor. \n\nI had an ED my entire life. Bulimia, Anorexia, ARFID, the whole shebang. \n\nI recovered for like 6-7 years, no purging. Then had a relapse. Recovered again. It is possible. Relapse was triggered by a very stressful time, mostly because of my job, and COVID.\n\nIt is possible to recover. Recovery looks different for everyone. It is ok if you relapse too. Give yourself grace. I have good and bad days, but trying to life the life I have the best I can for the moment. I suggest this as a floor for a goal. You might have a more custom ceiling.",
      "created_utc": 1729292057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lslqulo",
      "author": "Alive-Way7725",
      "body": "Just get a healthy relationship with food, it will take time but you are the solution.",
      "created_utc": 1729292417.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsm5yt9",
      "author": "fadingaurora9828",
      "body": "Bullshit anyone can recover it’s the hardest thing you will ever do but it’s fully possible. I recommend searching for a new provider if possible that is more supportive and knowledgeable",
      "created_utc": 1729298261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsmfo34",
      "author": "EchoWhisperer_",
      "body": "thank you everyone 🤍",
      "created_utc": 1729302210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsmknuf",
      "author": "penismusic666",
      "body": "Hey queen this is insanely unprofessional of her. If you feel comfortable enough, I’d encourage you to report what she told you. I would be yelling at that doctor if they spoke to my client like that. I’m genuinely sorry that this happened to you, and please don’t give up on recovery. You deserve to feel hopeful and to live a fulfilling life without an ED",
      "created_utc": 1729304293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsnph9v",
      "author": "itsSkylahYo",
      "body": "Brain plasticity plus if it's not exercise bulimia it'll probably have medical thing that will force you",
      "created_utc": 1729327363.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsrkigs",
      "author": "Violete_Hayes",
      "body": "You can get better, there’s are a lot of people who do. I have been weight restored for years. Yes, if it is part of your past you will never forget, the thoughts may linger but your actions don’t have to stay the same.",
      "created_utc": 1729382286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lssff5c",
      "author": "Informal-Ad-7356",
      "body": "Doctors certainly don't know everything.  They receive virtually no training about eating disorders.  I was way UW, hair falling out and went to seek help, and my GP said \"oh, you don't look that bad \".   I had ED for 35 years.  I think I know more about my disorder than any Dr I have come across.   \n\nI recovered into Menopause.   It was not easy or fast.  It took repeated on-purpose actions AGAINST the screaming ED voices.  Slow and steady.   It started out very painful and panicky, but over time with very specific changed behaviors and reactions,  it started to hurt less and less. Repeat every day, every meal. Every snack.    Step by step.\n\nNo one wants to hear it, but Recovery takes surrender and then slowly acceptance.  It takes letting the body gain and weigh what it wants to.  I don't exactly love my Recovered body now, but I LOVE my calm quiet mind.   I can have a dessert without major internal anxiety or judgment...and I know I won't change my weight either way.  My number casually floats 3-5 lbs either way, with NO attempt on my part to change it.   And there-in is the Peace....whether I eat the dessert or choose not to, it doesn't matter to my weight or size.   It's a beautiful FREEDOM in letting go.\n\nBut it all starts with baby steps, celebrating EVERY small win, getting rid of all clothes that only fit you with ED behaviors..and weaning yourself from the taunting scale.\n\nRecovery is totally Worth it.  Mental freedom is PRICELESS.",
      "created_utc": 1729394572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lssgm4n",
      "author": "Mission-Kiwi-7985",
      "body": "please, please don’t give up. these “medical predictions” are not factual, but a product of a patriarchal system. this disease is deadly, but because treatments that fail most patients failed you is NOT indicative of your ability to heal. the fact that you made this post is evidence that you want to beat this, to thrive. please don’t let one “professional” opinion make your recovery an impossibility",
      "created_utc": 1729395093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsflv7d",
      "author": "EchoWhisperer_",
      "body": "thank you 🤍",
      "created_utc": 1729202287.0,
      "score": 5,
      "context": [
        {
          "id": "lsfk4oo",
          "author": "127may",
          "body": "i’m so sorry OP, i have hope in you, i believe in you. please dont give up, there is still life out there that’s worth seeing and you deserve to give yourself a chance to. it will be hard work but it doesn’t mean you can’t do it <3 sending you luck and love <3",
          "created_utc": 1729201682.0
        }
      ]
    },
    {
      "id": "lssssmm",
      "author": "Informal-Ad-7356",
      "body": "Awesome for your Recovery!   I'm in my 2nd year Recovered.   I'm never going back to that Hell.",
      "created_utc": 1729400831.0,
      "score": 1,
      "context": [
        {
          "id": "lshl4dk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1729232280.0
        }
      ]
    },
    {
      "id": "lsmku7d",
      "author": "penismusic666",
      "body": "I love this so much thank u for sharing :,)",
      "created_utc": 1729304367.0,
      "score": 1,
      "context": [
        {
          "id": "lsigbvc",
          "author": "sb-2019",
          "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
          "created_utc": 1729251952.0
        }
      ]
    },
    {
      "id": "lssswno",
      "author": "Informal-Ad-7356",
      "body": "Excellent Post!!  Good for you! So nice to read something so positive.",
      "created_utc": 1729400891.0,
      "score": 1,
      "context": [
        {
          "id": "lsigbvc",
          "author": "sb-2019",
          "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
          "created_utc": 1729251952.0
        }
      ]
    },
    {
      "id": "lsssygt",
      "author": "Informal-Ad-7356",
      "body": "Excellent Post!!  Good for you! So nice to read something so positive. I recovered too.  It's so wonderful to be free.",
      "created_utc": 1729400917.0,
      "score": 1,
      "context": [
        {
          "id": "lsigbvc",
          "author": "sb-2019",
          "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
          "created_utc": 1729251952.0
        }
      ]
    },
    {
      "id": "lsknf27",
      "author": "kompassionatekoala",
      "body": "I am also a therapist and professor with AN. Infuriating, isn’t this?!",
      "created_utc": 1729278886.0,
      "score": 1,
      "context": [
        {
          "id": "lskfdaw",
          "author": "KissMeSlowlyPlease",
          "body": "Now why tf would they say some silly shit like this \n\nI’m a therapist & professor with an eating disorder. I’ve never said anything like that to my clients or students, ever. \n\nPlease report her to your nearest state licensure board because she should not be practicing in any capacity. JFC.\n\nSide bar: I’ve had an ED since 12, and I’m 31. I’m outraged on your behalf.",
          "created_utc": 1729276270.0
        }
      ]
    },
    {
      "id": "lst8krl",
      "author": "sb-2019",
      "body": "Love the name 😂😂\n\nYour welcome. It's been an up and down ride but it's been worth it",
      "created_utc": 1729410744.0,
      "score": 2,
      "context": [
        {
          "id": "lsigbvc",
          "author": "sb-2019",
          "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
          "created_utc": 1729251952.0
        },
        {
          "id": "lsmku7d",
          "author": "penismusic666",
          "body": "I love this so much thank u for sharing :,)",
          "created_utc": 1729304367.0
        }
      ]
    },
    {
      "id": "lsmfqmw",
      "author": "KissMeSlowlyPlease",
      "body": "Mad infuriating, pretty sure in our list of rules, this is clearly a ethical violation: Non-maleficence - do no harm & she does not respect her clients dignity - all grounds to have her licensed revoked, expeditiously.",
      "created_utc": 1729302239.0,
      "score": 2,
      "context": [
        {
          "id": "lskfdaw",
          "author": "KissMeSlowlyPlease",
          "body": "Now why tf would they say some silly shit like this \n\nI’m a therapist & professor with an eating disorder. I’ve never said anything like that to my clients or students, ever. \n\nPlease report her to your nearest state licensure board because she should not be practicing in any capacity. JFC.\n\nSide bar: I’ve had an ED since 12, and I’m 31. I’m outraged on your behalf.",
          "created_utc": 1729276270.0
        },
        {
          "id": "lsknf27",
          "author": "kompassionatekoala",
          "body": "I am also a therapist and professor with AN. Infuriating, isn’t this?!",
          "created_utc": 1729278886.0
        }
      ]
    },
    {
      "id": "lst8ya3",
      "author": "penismusic666",
      "body": "Lmao thank u friend",
      "created_utc": 1729411004.0,
      "score": 1,
      "context": [
        {
          "id": "lsigbvc",
          "author": "sb-2019",
          "body": "Hey :)\n\nYour in control if you want to be.\n\nI was bulimic for 15 years. 15 years! I stopped and recovered after that length of time. I never used a drug or any support. I woke up one day and was finished with it. I was sick of being sick. Lost all my friends. I was a recluse. Anxious. Depressed.\n\nA year later and I haven't purged in a year. I've reconnected with old friends. I spend time more then ever with my partner. I go out for meals and it doesn't phase me anymore.\n\nI won't lie. Recovery was tough. Those urges are so strong. Every minute of the day. Urges. Cravings. What helped the most was keeping my blood sugar stable. 3 meals and snacks. Never letting myself actually become hungry. If I let myself get hungry I would get horrid urges.\n\nAlso in recovery. Once your body starts to sense more food coming in. It goes crazy and you want to eat thousands of calories. I just gave in alot of the time and enjoyed a binge. You have to stay off your scales. Infact smash those poisonous devices. If your weighing yourself everyday sometimes numerous times then your setting yourself up for failure.\n\nProve this doctor wrong. Get your life back. Just to wake up everyday and feel fresh. No swollen throat. No bloated face. No depression and anxiety. Honestly that's worth it.\n\nI don't crave binges anymore. It's because my body is now nourished. It trusts me again.\n\nYou got this. Prove them wrong 👍",
          "created_utc": 1729251952.0
        },
        {
          "id": "lsmku7d",
          "author": "penismusic666",
          "body": "I love this so much thank u for sharing :,)",
          "created_utc": 1729304367.0
        },
        {
          "id": "lst8krl",
          "author": "sb-2019",
          "body": "Love the name 😂😂\n\nYour welcome. It's been an up and down ride but it's been worth it",
          "created_utc": 1729410744.0
        }
      ]
    },
    {
      "id": "lsmgna8",
      "author": "kompassionatekoala",
      "body": "It is absolutely an ethical violation! Always always first, do no harm.",
      "created_utc": 1729302618.0,
      "score": 2,
      "context": [
        {
          "id": "lskfdaw",
          "author": "KissMeSlowlyPlease",
          "body": "Now why tf would they say some silly shit like this \n\nI’m a therapist & professor with an eating disorder. I’ve never said anything like that to my clients or students, ever. \n\nPlease report her to your nearest state licensure board because she should not be practicing in any capacity. JFC.\n\nSide bar: I’ve had an ED since 12, and I’m 31. I’m outraged on your behalf.",
          "created_utc": 1729276270.0
        },
        {
          "id": "lsknf27",
          "author": "kompassionatekoala",
          "body": "I am also a therapist and professor with AN. Infuriating, isn’t this?!",
          "created_utc": 1729278886.0
        },
        {
          "id": "lsmfqmw",
          "author": "KissMeSlowlyPlease",
          "body": "Mad infuriating, pretty sure in our list of rules, this is clearly a ethical violation: Non-maleficence - do no harm & she does not respect her clients dignity - all grounds to have her licensed revoked, expeditiously.",
          "created_utc": 1729302239.0
        }
      ]
    }
  ]
}