{
  "id": "1glhrqb",
  "subreddit": "bulimia",
  "author": "Professional_Nail365",
  "created_utc": 1730951854.0,
  "title": "Recovered bulimic with a 14 year old daughter that now has bulimia ",
  "selftext": "I used to have bulimia. I once in a few years might experience an episode. But it would take a lot. This is a tale of recovery and regression. It is an incredibly long story, frankly I do not have the energy to explain all of the details. It is a sad day for me, I am in the US. I recently found out my daughter has bulimia. I struggled with bulimia from 14-19. I was a long distance runner who had a twin (also long distance runner). We were extremely competitive, to the point it makes me sick now. She remained in denial about how dangerous it was, while I tried to get better. She's dead now, and I was pregnant with my daughter when she died. I swore to myself it would never happen to her, but the comments I made about my body the poor relationship with food, personal appearance, excellence & success, my family's weird relationship with womanhood and sensuality it was all related and it is coming to a head. I have not been on this sub very long but I am so deeply sad for all of us. If I can give any reassurance to anyone just know recovery is possible but you will have to change completely. You need to realize that whatever happens, whatever you think looking good will accomplish it is no comparison to finally be free of this. Please realize how dangerous this is & how valuable you all are intrinsically. You might not see it now, but there is a different version of you out there that isn't scared to eat and that actually feels good.",
  "url": "https://www.reddit.com/r/bulimia/comments/1glhrqb/recovered_bulimic_with_a_14_year_old_daughter/",
  "score": 80,
  "num_comments": 10,
  "comments": [
    {
      "id": "lvuekg7",
      "author": "None",
      "body": "I have a twin who I've recently suspected to be disordered and this felt like a slap in the face (not like a mean one but more of a \"Snap out of it!\"\" slap) So I cant imagine how difficult it must've been to loose your twin. I hope you and your daughter heal from this completely.",
      "created_utc": 1730952642.0,
      "score": 34,
      "context": []
    },
    {
      "id": "lvuor9u",
      "author": "Sweetnspicy77",
      "body": "I’m a daughter of a mom with an Ed. The fact you’re recovered is amazing and the best thing you can do is be an example. \nThere is most def a genetic component.\n\nHang in there and I wish I had more to say. Prayers 💕",
      "created_utc": 1730957114.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lvvbdd3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1730970272.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lvui0fk",
      "author": "Downtown-Effect-7450",
      "body": "Im sorry for your loss",
      "created_utc": 1730954075.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lvxy5hj",
      "author": "sgknight",
      "body": "i’m just so glad you acknowledged it. my mom made so many comments about my body and then i developed anorexia. i was severely underweight to the point i could barely function. they didn’t want me to get treatment because they thought it would reflect poorly on me getting jobs later. i pushed myself out of it but then developed bulimia. my parents are anti-mental health so i’ve basically been on my own. i know you feel like it’s your fault but it’s not. i promise.",
      "created_utc": 1731005409.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lvv9koc",
      "author": "None",
      "body": "I hope you know it’s not your fault and I’m sorry you are going through this",
      "created_utc": 1730969068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lvz5in3",
      "author": "PriorityHead6833",
      "body": "hi friend! i’m so so so sorry you’re going through this i can’t imagine how heartbreaking and even frustrating this is for you. i know my word is not helpful but i can promise you that this isn’t something that is your fault or something you induced even if it really really feels like it ☹️ i am also so so so sorry for your loss i can imagine how hard this is considering the trauma you have experienced with bulimia, ur twin, etc which is what makes this feel so much worse. i will keep you in my prayers tonight friend and i really wish you the very best. please you know what to do and you know you need to help your daughter so please get her the help she needs so ofc this doesn’t progress into anything worse than jt already is. 💗",
      "created_utc": 1731017726.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lvug6au",
      "author": "Professional_Nail365",
      "body": "Please take care of each other",
      "created_utc": 1730953306.0,
      "score": 13,
      "context": [
        {
          "id": "lvuekg7",
          "author": "None",
          "body": "I have a twin who I've recently suspected to be disordered and this felt like a slap in the face (not like a mean one but more of a \"Snap out of it!\"\" slap) So I cant imagine how difficult it must've been to loose your twin. I hope you and your daughter heal from this completely.",
          "created_utc": 1730952642.0
        }
      ]
    },
    {
      "id": "lvupg0h",
      "author": "Professional_Nail365",
      "body": "Thank you so much hope you and your mom are ok. Being able to talk about it is a big deal.",
      "created_utc": 1730957451.0,
      "score": 7,
      "context": [
        {
          "id": "lvuor9u",
          "author": "Sweetnspicy77",
          "body": "I’m a daughter of a mom with an Ed. The fact you’re recovered is amazing and the best thing you can do is be an example. \nThere is most def a genetic component.\n\nHang in there and I wish I had more to say. Prayers 💕",
          "created_utc": 1730957114.0
        }
      ]
    },
    {
      "id": "lvxuq4p",
      "author": "chronaloid",
      "body": "How is your daughter doing? Thank you for sharing.",
      "created_utc": 1731004461.0,
      "score": 1,
      "context": [
        {
          "id": "lvvbdd3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1730970272.0
        }
      ]
    },
    {
      "id": "lvujijp",
      "author": "Professional_Nail365",
      "body": "Thank you",
      "created_utc": 1730954719.0,
      "score": 6,
      "context": [
        {
          "id": "lvui0fk",
          "author": "Downtown-Effect-7450",
          "body": "Im sorry for your loss",
          "created_utc": 1730954075.0
        }
      ]
    }
  ]
}