{
  "id": "1gwhnbw",
  "subreddit": "bulimia",
  "author": "Nervous_Extreme2199",
  "created_utc": 1732199594.0,
  "title": "Don't know what else to do with my ED partner anymore...",
  "selftext": "Me and my girlfriend are together for 6 years.  \n4 years ago I found out she has bulimia and I have been trying my best to be the supportive and understanding boyfriend that she needs.\n\nHowever for 4 years the situation did not improve even an inch.\n\nNow some details:\n\nWhen you consult the frequency charts her condition is **beyond extreme**.  \nShe does this every day, multiple times a day...  \nBasically half the day is groceries, cooking, eating and purging...\n\nThis is going on for years before we got together... around 15 years now... so by her words for at least 10 years  she is doing this every day, 3-4 times a night purging...\n\nThe situation is so distorted in her mind that all kinds of health issues she may have she is not even considering her ED to be a factor in it. One example is her teeth which are going increasingly bad due to stomach acid going on through them for 15 years, but she is just \"yeah i might need to do facets or something cause I got problematic teeth\"...\n\nAll activities we might do spontaneously are now source of frustrations cause spontaneous means the B/P schedule is disrupted... So everything has to be planned days in advance... so friends now call us for a night out to a bars or restaurants very rarely cause we always decline... Even if the planets align and we go out we need to be home early cause she needs to \"catch up\" so to speak...\n\nGroceries shopping is like buying for 8 people family. And then we constantly cook and we constantly don't have food and we constantly order tons of food to the point where we are now spending 4 times more than people usually do. So even financially we are not doing ok...\n\nWe had multiple conversations about this and me reading everywhere that I need to be supportive and understanding am not doing any ultimatums, not doing bad remarks, not picking up fights about all that.\n\nI asked her to go see a therapist and she did but the moment they went past the onboarding get-to-know-each-other and started touching the ED seriously she said it's taking an emotional toll on her so she stopped going...\n\nI am not even going to describe in details all the neurotic outbursts, and mood swings that are happening on a daily basis due to ED cause you know them better than me.\n\nI am not going to mention that because I spend all my spare time with her watching something while munching I occasionally slip myself and also do junk food but since I only do B and don't do P my weight got fucked up and I am now 40 pounds overweight...\n\nI am not going to mention her regular frustrations with me not participating with the cooking enough (which is cause I lost all excitement of preparing something for hours and then hear it being purged)...\n\nOr her regular frustrations with me not paying attention what and when to buy cause I don't think 2 people should do 4 grocery shoppings per week containing 4 big bags each time...\n\nFrankly all that doesn't even matter...  \nShe is just completely delusional about her health! It's really difficult to plan your life with someone who is in such condition but still insists what she does is still \"a little cheat\". She completely understand the severity of her condition but still refer to it as a cheat to not feel bloated after dinner. Which I think simply leads to the conclusion that deep down she is just ok with it.\n\nI think it's similar to if you live with an alcoholic. They know they have a problem but deep down they just enjoy that problem and are delusional about it. But yah if you confront them about it sure -> it's a problem... \n\n\"I am not purging everything, so I get plenty of nutritions, so don't worry about my health!\"\n\n\"I can stop for the pregnancy, so don't worry about the child's health!\" \n\nSo what are my options here?\n\nWe have to think about children, marriage, etc. How can we do that... On what baseline can we build?\n\nIf this is the situation currently then:  \n\\- How are we going to manage health-wise? We are not getting younger...  \n\\- How are we going to manage financially? What happens when our parents also stat needing extra help from us cause they also growing old...  \n\\- How are we going to, conceive and carry out healthy child? How are we going to parent it if we can have it at all? What kind of relationship with food are we going to show to it? \n\nFrankly the situation is absurd.... I have been very relaxed about her dictating the tempo and everything but the years are passing by, and we are getting older and nothing is improving... My \"understanding\" is just useful to her to avoid dealing with the problem...\n\nAt what point is ok to have an ultimatum? Cause I cannot live like that anymore....  \nI don't have any dreams about anything anymore...  \nI cannot imagine anything like \"we are going to get married and buy a house, etc\" cause everything is coloured in ED...\n\nPlease help me!",
  "url": "https://www.reddit.com/r/bulimia/comments/1gwhnbw/dont_know_what_else_to_do_with_my_ed_partner/",
  "score": 76,
  "num_comments": 35,
  "comments": [
    {
      "id": "ly9est5",
      "author": "econroy",
      "body": "I am like your girlfriend. It's actually mindblowing to me that someone out there exists in the same way as I do. My heart breaks for her. \n\nThat said, I am single. I've been single for 10 years. I will be single for the rest of my life. \n\nIt is insane that she allows HER disorder to run YOUR life. It's even more insane that she is so open about these deeply personal routines - doing them out in the open, knowing you see it, knowing you hear it - I can't even fathom that. Making you fund her habit as well as buy and cook the food with her/for her is fucking unreal. \n\nYou have to start putting yourself first. It's like you said, you are living with an addict. You can't change her, and she is not ready to change. Frankly, if she's like me, she might never be capable of change, even if she so desperately wants to (like myself). \n\nIt's selfish of her to inflict her illness so openly upon you and so without shame. There's no way around that. Please start considering that it might be time to separate yourself from the situation for your own mental, social and financial health.",
      "created_utc": 1732204273.0,
      "score": 120,
      "context": []
    },
    {
      "id": "ly9bizr",
      "author": "kimchiplug",
      "body": " I don’t think you want to hear this, but I suspect you know the answer. She has to want to get better. You can’t force that on anyone. It’s an awful addiction, crossing mental/physical/emotional levels of addiction. So you can only control yourself, that may mean leaving.",
      "created_utc": 1732200570.0,
      "score": 73,
      "context": []
    },
    {
      "id": "ly9sq0h",
      "author": "rotten_maevv",
      "body": "You are enabling the behavior and calling it support. You can support her while separating yourself from her disorder. You shouldn’t be buying her food. She can use her money for b/p. You should not cook her food. She can take the time out of her day to cook food to b/p. When your friends call, go out with them even if she doesn’t want to go. The b/p routine won’t keep you from living YOUR life. If she comes to you upset, you can support her and let her know that you have empathy for her situation and whenever she’s ready, you’ll take her to get help. If she tries to bring up marriage, kids, let her know that you won’t discuss it until she gets better. Sorry to put it so harshly, but you have to think about yourself first. Put up boundaries. You shouldn’t have to live your life this way because she is choosing to.",
      "created_utc": 1732208884.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ly9h7u5",
      "author": "LadyIlithyia",
      "body": "So, I was almost exactly like your girlfriend.  Always b/p when home, buying a lot of groceries to then purge (weekly), getting upset if we had plans because it delayed the b/p sessions.  Most of my blood work came back fine, my teeth were fine so I kept deluding myself that I was not causing any real harm.  My husband has been with me for ten years.  He has only known me with the disorder.\n\nHe had sat me down some months ago now and told me flat out he cannot keep doing this anymore.  Watching me harm myself on the daily, wasting money, etc.  Being afraid that if we continued to build a future that I would pass from the disorder.  \n\nI needed to hear it.  I needed to hear his feelings and really take them into account.  After all, this was the person I loved the most in this world.   It took me a couple months to also really want to recover for myself after he said it.  Without wanting it - I do not think I could do it.  He always said I loved my illness more than him.  I do not believe it to be true, but I knew I could not recover for anyone without wanting it myself. \n\nIt hurts to hear, but she needs to want it for herself.  I do not think there is anything you can do except be honest about your feelings.  I do not think an ultimatum would work.  Tell her you cannot continue to live like this - those are your true feelings. Maybe she will do some soul searching after that.  I did, and I am five months b/p free.  I still struggle with aspects of the disorder (fear of foods, food noise), but I am a lot happier.  I actually can be present in the moments with my husband.  I realized how much of it I missed due to always being preoccupied with my thoughts of b/ping.\n\nBest of luck to you both, OP.  It is truly a hard situation.  You deserve peace and happiness too.",
      "created_utc": 1732205309.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ly9binc",
      "author": "127may",
      "body": "wow this sounds really difficult and has put a lot of things in perspective for me. i’m currently in recovery and i’m going to give you my honest opinion - you cannot help someone who doesn’t want to get better.\n\nmy dietician had actually said those words to me because even though i was receiving help i definitely wasn’t following it because i was scared. letting go of your ed behaviours is so so difficult, especially when you have been with it for as long as your girlfriend has.\n\nalthough i will say it definitely seems as though you are/have been an understanding partner for her through all of this OP. I think your girlfriend definitely needs some kind of professional help, maybe even rehab if she is that reliant on b/p sessions to cope. it is more of a coping mechanism or addiction than anything else imo. i also don’t think it would be healthy for you to stay living like this for much longer as it definitely seems as though everything is taking a toll on you mentally, we can only go through so much. i’m not saying break up with her, and i wouldn’t recommend giving any kind of ultimatum but she needs to consider real recovery soon, for her health and yours! eating disorders are serious but it is not up to you to make her recover. i hope she chooses recovery and gets help though, but she needs to know she deserves recovery, she deserves a good life and so do you OP. but before you guys think about a future with kids or anything, you need to put health first.",
      "created_utc": 1732200567.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ly9clbp",
      "author": "Nervous_Extreme2199",
      "body": "To be fair I think I also contributed to this situation because I strongly suspect that my \"understanding\" behaviour is just me being a conflict avoider...  \nSo the same way she is staying in her comfort zone I am staying also... But this at the end just resulted in me enabling her to continue with this destructive behaviour.... \n\nSo I also don't have much excuses other than \"I tried my best to be the most helpful I can, but I am not born proficient in all that\"...",
      "created_utc": 1732200934.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ly9pvqx",
      "author": "ooofx1000",
      "body": "I broke up with my ex bc of my own bulimia, even though he was willing to turn a blind eye to it for so long...\n\nSame situation, 17 years of stomach acid erosion since I was 11, teeth issues that I would have outbursts about becuase it is SO financially draining, even developing a complicated relationship with alcohol during the relationship just to deal with it and adding to the financial issues too. Leaving someone who was willing to \"put up\" with it or face a blind eye to it catapulted me into my own ultimatum. The past few months have literally been the longest period of time in my entire life that I've been able to eat like a relatively \"normal\" person and get back on my own feet. She has to do the same. \n\nEven if she can stop for a pregnancy it has WAY more to do with the influence that kind of mental illness would have on a child. It would still be so unfair to raise a child under the influence of disorder. It really is an addiction and addiction creates an atmosphere of hopelessness and despair that no one deserves to live in.\n\n If she can recover, she can develop the empathy and understanding to become an incredible mother, trust me, but one way or another there needs to be a mirror held up to her face about what's going on, and you don't deserve to have to feel guilty for being the one to hold that mirror up, trust me, it does reach a life and death point and her life itself will hold that mirror up along the way.\n\nYou seem like a very understanding person, even my ex wouldn't consult other people about it and treaded so lightly around it that it felt like a phantom or third party in the relationship the whole time, addiction always does. When he tried to bring it up a couple times I lied my way out of it and we both knew I was lying but that was better than talking completely honestly. It is really awesome that you have been willing to work with her to this point, if she can't see that in you then you do deserve better. \n\nNot becuase she can't BE better, because you can't live in that atmosphere of hopelessness. Because you seem understanding, I'm sure you can understand how uncomfortable it makes her feel, too, trust me being this old and still having to work through an issue that is typically associated with pre-teens is embarassing and makes me feel like a child, a failure, and unworthy of the kind of partner who would be so understanding. But that is not a reason to stay, she has to get herself to the point of feeling worthy of recovery. That also doesnt mean the relationship cant come back together in a way that is healthier and stronger, it just cant continue on the same path or it will ruin you too...",
      "created_utc": 1732208027.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ly9pfvg",
      "author": "Enough_Cow6484",
      "body": "Imagine living like this for the rest of your life. Do you like the picture you're seeing? By that decide if you really want this for the rest of your life.",
      "created_utc": 1732207894.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lya9jl1",
      "author": "darknessandpolaroids",
      "body": "I used to purge 3+ times a day and suffered with an ED for 10 years. Im now like 90% recovered and haven’t purged for about 7m. \nThe point that made me recover was realising how much damage id done to myself. The big one was finally going to the dentist and knowing that I didn’t stop I was going to lose my teeth. \n\nI think the only way to break that cycle is sheer realisation of the extent of the problem. Also, this will absolutely be seen as a controversial option but (depending on the laws where you are) if you can get her taken involuntarily inpatient. It’s a harsh option but would help break the cycle. The issue with purging is that it’s so fucking addictive and the more you do it, the more you want to do it.",
      "created_utc": 1732213863.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lyagnae",
      "author": "None",
      "body": "I will premise by saying that this is just your perspective so I acknowledge that her voice hasn’t been shared… \n\nSaying that, this whole thing screams toxic. I want out for you. You shouldn’t have to live like this. I would never do this to my partner. Yes, the emotional outbursts are there for sure, which I am still trying to work through in recovery. But all these behaviours of hers are just not on. I won’t even tick them off. In my ED, it was once a week, but even then it hurt my partner. The emotional and psychological tax it has placed on you is immense. \n\nThe pregnancy thing is real. I was bulimic during my pregnancy on and off and my husband was emotionally distraught. We had so many scans to ensure everything was okay. I ate enough food, and I purged infrequently - which was the main thing in keeping the foetus healthy - but believe me when I say, it’s not that simple to just stop during pregnancy. I tried and failed. If she were to engage in this behaviour daily, it would put the baby at so much risk. \n\nPlease, please don’t get pregnant with this person until they can reduce frequency. \n\nI don’t know you or her or am your therapist … but holy shit you deserve so much better",
      "created_utc": 1732215985.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lyb30ft",
      "author": "Cumbersomesockthief",
      "body": "This isn't a way to live, for anyone, and it's ruining your life as well. I would be humiliated if my disorder was running someone's life to this extent. There needs to be an ultimatum, and that is inpatient or you take a break. She needs to at least get a job or something, because I know as well as anyone at this point that food is a goddamn luxury purchase in this economy. You need to set hard boundaries, and some this has to change, because it sounds like you're dating bulimia personified.",
      "created_utc": 1732222778.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ly9lvll",
      "author": "CarpetDisastrous1963",
      "body": "You’re definitely an enabler op. She needs an ultimatum, she’s not going to stop and it sounds like it’s deeply effecting your mental illness and financial situation",
      "created_utc": 1732206804.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ly9ezjb",
      "author": "gregy165",
      "body": "Only way is if she gets help she’s to far deep in the disorder",
      "created_utc": 1732204376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lybob00",
      "author": "BradleyNowellLives",
      "body": "I’m so sorry for what you’re going through. But much like an addiction, she has to want to get well. It sounds like she needs therapy, and I would suggest you go as well. If she won’t accept therapy, then you have your answer and you know. \n  \nOn another note, I’m bulimic. My husband knows very little of it and I prefer it that way. My disorder shouldn’t also be his. The thought of asking him to prepare binge food with me, know what it is, makes me feel sick.",
      "created_utc": 1732229536.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lycappz",
      "author": "springcat413",
      "body": "I’m very sad to say that I think you need to move on. She will not change - it’s hard for people who are actively trying to get better, but she won’t do anything and the future seems impossible. Your own life has taken such a toll, I really want you to go live your life as you seem like such a caring person. \nI say this as a person who divorced an alcoholic. He ended up dying 2 years ago and leaving our 8 yr old son. He died from alcoholism. I know as someone who has struggled with bulimia that even wanting to get better and trying very hard is hard, but there is hope because I keep trying, but unfortunately your partner does not seem even close to that. \nYou need to take care of yourself!",
      "created_utc": 1732237465.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ly9co0e",
      "author": "wowithinkalot",
      "body": "IMO, This is one of my nightmares- having my disorder affect my relationship and my partner financially and overall, However I feel like your patience, caring and understanding somewhat enabled this in a relationship too, she feels comfortable enough to b/p  at this extreme pace and it seems like she won’t be looking for help anytime soon as it’s getting to the point of her teeth getting affected and it seems more normalized in your relationship. \n\n\n\nOP.. this is starting to affect your life too. I would bring this up ASAP, being the person in your girlfriend shoes (i’m in a relationship as well-long distance) I would of initially wanted to get clean for the person, not have mood swings, not spend a great amount of groceries, look and feel beautiful, while not engaging in such an embarrassing disorder.\n\n\n\nI think your heart is in the right place but this disorder is like an addiction, it can lead to stealing/shoplifting, bad mood swings (which i’m sure you’re aware of), being infertile, big medical bills, and secrecy and shame. I feel like these things will be an even bigger issue in the future.\n\n\n\nTake some time to talk to her about this. If things don’t work out or she doesn’t make an effort to get better, I'd end that relationship. ",
      "created_utc": 1732200960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyd5s14",
      "author": "JustaVet-MedGirl",
      "body": "I have been in a place like this before, but I would never allow it to drag someone down with me. You deserve to live just as much as she does. I think for your own well-being, it would be best for you to set an ultimatum. She 100% needs a higher level of care, and if she isn't willing, then she isn't ready for a relationship. This is truly an insane situation, and I wish both of you the best ❤️",
      "created_utc": 1732249195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyfbo65",
      "author": "Street_Housing_109",
      "body": "I'm in a similar relationship. We've been living together for over 5 years and I had started b/ping regularly after a few weeks (had been suffering for over 2 years before that). He tried to be understanding and kinda let me do my thing. I was very open about it from the start and even now I binge in front of him. I would never expect him to buy me food or cook for me but me b/ping almost everyday has become somewhat normal. It affects him a lot and it makes me feel terrible. I have often wondered why he doesn't just leave me.\nWe argue a lot, he gets frustrated and angry. It has made him cry way too often. It breaks my heart every time. I often think he'd be better off without me but I can't even imagine leaving him.\nEarlier this year I decided to try recovery. I started therapy and I'm gonna go inpatient in January. I can't stop b/ping on my own and I also need help to gain weight adequately (and deal with it mentally).\nThe other day we had an argument again and he said if I quit inpatient early (like I did last year) he won't be here when I come back. I had already set myself an ultimatum though, I'm seeing it as my last chance and if I can't get better then I'm gonna need to leave him, he deserves a better life. \nImo you need to have a serious talk and maybe set her an ultimatum too. It might help her bc for me having a future with him is my only motivation rn. If I can't do it for myself, I can do it for us. \nIf she doesn't even want to try to get better you need to do what's best for yourself and leave.\nWishing you all the best ♡",
      "created_utc": 1732288528.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyfnrf9",
      "author": "sonic2cool",
      "body": "This is painfully relatable as I'm just like your girlfriend. I still live at home with my family but say no to all plans so the disorder comes first. I have no friends and have never dated which I think is because of my need for control and because I cant give up the eating disorder. I work and spend my wages on binge food only to throw it up. \n\nReading this has made me tear up.. I can imagine that when the day comes that someone finally looks me in the eye and says they love me, it will end up just like this. I think when you're so far gone, you believe it's normal. I've been bulimic for 7 years, and still brush off my heart problems as anxiety, the teeth sensitivity as \"oops, I shouldn't of put ice in my drink\" and everything is just because \"I havent had enough sleep\" - I make my own excuses for the ed like its nothing. It's ruining my health. I have no solid advice for you.. I think if you was my partner I'd not want you to do anything, but then thats letting it win :(",
      "created_utc": 1732292405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyky968",
      "author": "Much_Pass_1886",
      "body": "Hi friend! \nHey I was like her a few months ago (now I'm in recovery) and I understand how she might be feeling, but believe me, things cannot stay like this. And I think you already know the answer but you're afraid to accept it because you love her. Buuut, you need to think about yourself first and you need to use the ultimatum right now. If she doesn't want to go to therapy, if she doesn't want to accept she has an ED and it's affecting her health and your relationship then you're off. Because you're right, how are you gonna raise children under an ED culture? how are you gonna show them a good food relationship? Also, doing BP over 15 years might have affected her system already and future pregnancy is already a risk. \n\nShe is in a comfort zone because you allow it every day by helping her to sabotage herself. She doesn't want to accept she is not ok because she knows you're there and \"nothing bad is going to happen\". It's important to bring an existing ED to the table because that's the kind of stuff an ED does: pretending it doesn't exist and is something necessary for your daily basis instead. So please do not ignore it and give her an ultimatum. It will be better for you and her.\n\nI send you all the best wishes and support for both. You know we're here for anything ♡",
      "created_utc": 1732372038.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyek0y6",
      "author": "Yumi77Hime",
      "body": "As girl with bulimia i still struggle a bit but not like in the years before! \n\nTHE KEY IS: STOP BEEING SO PLEASEFUL \n\nYou need to say out loud, that she is not healthy. Did you really speak with her in that way you do to us? \n\nI never would have stoped doing purging if i haven't had a bf which said \"it's enough\".\n\nHe cried. He is so emotional by seeing me hurting myself that this helps a bit.. \n\nThe fact that you are overwheight because of doing the rituals with her ecp. purging is really sad! \nYou NEED to tell her how much you suffer! \n\nBefore my bf was in my side, i had another partner which where understanding like you.. \n\nI bought so much food, cooked tons.. had dues.  \nWhen i could not purge, i ate chrisps and spilt it in the bag back. I lost 3 Tooths in the back. \nHe bought me the food, cause i was ashamed to had so much chrisps. \nAnd all of it got worse! \nMore foid, more pain, i almost choked a few times and my money was gone. \nThe pizza guy new my name . \n\nJust because my partner on the time let this happen and said nothing, i got sicker and sicker cause for me ther was no problem..",
      "created_utc": 1732277878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lycj11d",
      "author": "Weekly_Ad_4252",
      "body": "I wish you to get better ♥️",
      "created_utc": 1732240653.0,
      "score": 11,
      "context": [
        {
          "id": "ly9est5",
          "author": "econroy",
          "body": "I am like your girlfriend. It's actually mindblowing to me that someone out there exists in the same way as I do. My heart breaks for her. \n\nThat said, I am single. I've been single for 10 years. I will be single for the rest of my life. \n\nIt is insane that she allows HER disorder to run YOUR life. It's even more insane that she is so open about these deeply personal routines - doing them out in the open, knowing you see it, knowing you hear it - I can't even fathom that. Making you fund her habit as well as buy and cook the food with her/for her is fucking unreal. \n\nYou have to start putting yourself first. It's like you said, you are living with an addict. You can't change her, and she is not ready to change. Frankly, if she's like me, she might never be capable of change, even if she so desperately wants to (like myself). \n\nIt's selfish of her to inflict her illness so openly upon you and so without shame. There's no way around that. Please start considering that it might be time to separate yourself from the situation for your own mental, social and financial health.",
          "created_utc": 1732204273.0
        }
      ]
    },
    {
      "id": "lydbtas",
      "author": "triciani23",
      "body": "Hi friend, I will comment more tomorrow — but how old are you? I just turned 40. I’ve had an eating disorder since I was 12, and your comment “I will be single for the rest of my life” just broke my heart. I have been single my whole life because of my eating disorder. Please get help if you can. I wish I had tried harder in my 20s.",
      "created_utc": 1732251814.0,
      "score": 8,
      "context": [
        {
          "id": "ly9est5",
          "author": "econroy",
          "body": "I am like your girlfriend. It's actually mindblowing to me that someone out there exists in the same way as I do. My heart breaks for her. \n\nThat said, I am single. I've been single for 10 years. I will be single for the rest of my life. \n\nIt is insane that she allows HER disorder to run YOUR life. It's even more insane that she is so open about these deeply personal routines - doing them out in the open, knowing you see it, knowing you hear it - I can't even fathom that. Making you fund her habit as well as buy and cook the food with her/for her is fucking unreal. \n\nYou have to start putting yourself first. It's like you said, you are living with an addict. You can't change her, and she is not ready to change. Frankly, if she's like me, she might never be capable of change, even if she so desperately wants to (like myself). \n\nIt's selfish of her to inflict her illness so openly upon you and so without shame. There's no way around that. Please start considering that it might be time to separate yourself from the situation for your own mental, social and financial health.",
          "created_utc": 1732204273.0
        }
      ]
    },
    {
      "id": "lyjkfmg",
      "author": "satinewolf",
      "body": "You can recover. I have done it, and I believe you can, too. My heart is with you.",
      "created_utc": 1732344166.0,
      "score": 2,
      "context": [
        {
          "id": "ly9est5",
          "author": "econroy",
          "body": "I am like your girlfriend. It's actually mindblowing to me that someone out there exists in the same way as I do. My heart breaks for her. \n\nThat said, I am single. I've been single for 10 years. I will be single for the rest of my life. \n\nIt is insane that she allows HER disorder to run YOUR life. It's even more insane that she is so open about these deeply personal routines - doing them out in the open, knowing you see it, knowing you hear it - I can't even fathom that. Making you fund her habit as well as buy and cook the food with her/for her is fucking unreal. \n\nYou have to start putting yourself first. It's like you said, you are living with an addict. You can't change her, and she is not ready to change. Frankly, if she's like me, she might never be capable of change, even if she so desperately wants to (like myself). \n\nIt's selfish of her to inflict her illness so openly upon you and so without shame. There's no way around that. Please start considering that it might be time to separate yourself from the situation for your own mental, social and financial health.",
          "created_utc": 1732204273.0
        }
      ]
    },
    {
      "id": "ly9l00f",
      "author": "prematurehooray",
      "body": "As a someone who has bulimia, it’s very sad, but i totally agree.",
      "created_utc": 1732206531.0,
      "score": 18,
      "context": [
        {
          "id": "ly9bizr",
          "author": "kimchiplug",
          "body": " I don’t think you want to hear this, but I suspect you know the answer. She has to want to get better. You can’t force that on anyone. It’s an awful addiction, crossing mental/physical/emotional levels of addiction. So you can only control yourself, that may mean leaving.",
          "created_utc": 1732200570.0
        }
      ]
    },
    {
      "id": "lydc0od",
      "author": "triciani23",
      "body": "💯I’m 40. I’ve had an eating disorder since I was 12. It’s my friend’s passing this week that may push me into rehab. And even then is maybe. Bulimia is such an insidious disease.",
      "created_utc": 1732251911.0,
      "score": 3,
      "context": [
        {
          "id": "ly9bizr",
          "author": "kimchiplug",
          "body": " I don’t think you want to hear this, but I suspect you know the answer. She has to want to get better. You can’t force that on anyone. It’s an awful addiction, crossing mental/physical/emotional levels of addiction. So you can only control yourself, that may mean leaving.",
          "created_utc": 1732200570.0
        }
      ]
    },
    {
      "id": "lyn9j52",
      "author": "TransFat88",
      "body": "I came here to say something very similar. Support and enabling are two very different things. Support in this situation is understanding she is sick and it’s not a choice. Buying her binge foods is not. \n\nI don’t know what kind of talks you’ve had with her before, but the comment above from ladyllithyia has some helpful talking points. I think “I don’t know how much longer I can watch/feel/worry” kind of statements are really\nImportant because they show you do care and don’t want to issue an ultimatum, but they also emphasize how destructive this is for you.",
      "created_utc": 1732399737.0,
      "score": 1,
      "context": [
        {
          "id": "ly9sq0h",
          "author": "rotten_maevv",
          "body": "You are enabling the behavior and calling it support. You can support her while separating yourself from her disorder. You shouldn’t be buying her food. She can use her money for b/p. You should not cook her food. She can take the time out of her day to cook food to b/p. When your friends call, go out with them even if she doesn’t want to go. The b/p routine won’t keep you from living YOUR life. If she comes to you upset, you can support her and let her know that you have empathy for her situation and whenever she’s ready, you’ll take her to get help. If she tries to bring up marriage, kids, let her know that you won’t discuss it until she gets better. Sorry to put it so harshly, but you have to think about yourself first. Put up boundaries. You shouldn’t have to live your life this way because she is choosing to.",
          "created_utc": 1732208884.0
        }
      ]
    },
    {
      "id": "lydc4vp",
      "author": "triciani23",
      "body": "That’s amazing for you!!",
      "created_utc": 1732251966.0,
      "score": 2,
      "context": [
        {
          "id": "ly9h7u5",
          "author": "LadyIlithyia",
          "body": "So, I was almost exactly like your girlfriend.  Always b/p when home, buying a lot of groceries to then purge (weekly), getting upset if we had plans because it delayed the b/p sessions.  Most of my blood work came back fine, my teeth were fine so I kept deluding myself that I was not causing any real harm.  My husband has been with me for ten years.  He has only known me with the disorder.\n\nHe had sat me down some months ago now and told me flat out he cannot keep doing this anymore.  Watching me harm myself on the daily, wasting money, etc.  Being afraid that if we continued to build a future that I would pass from the disorder.  \n\nI needed to hear it.  I needed to hear his feelings and really take them into account.  After all, this was the person I loved the most in this world.   It took me a couple months to also really want to recover for myself after he said it.  Without wanting it - I do not think I could do it.  He always said I loved my illness more than him.  I do not believe it to be true, but I knew I could not recover for anyone without wanting it myself. \n\nIt hurts to hear, but she needs to want it for herself.  I do not think there is anything you can do except be honest about your feelings.  I do not think an ultimatum would work.  Tell her you cannot continue to live like this - those are your true feelings. Maybe she will do some soul searching after that.  I did, and I am five months b/p free.  I still struggle with aspects of the disorder (fear of foods, food noise), but I am a lot happier.  I actually can be present in the moments with my husband.  I realized how much of it I missed due to always being preoccupied with my thoughts of b/ping.\n\nBest of luck to you both, OP.  It is truly a hard situation.  You deserve peace and happiness too.",
          "created_utc": 1732205309.0
        }
      ]
    },
    {
      "id": "ly9h0sn",
      "author": "kathruins",
      "body": "I would say you are definitely enabling the behavior. if you stop, she may want to leave you, but honestly is this the life you want for yourself? it seems she's completely fine living like this. I would suggest that you separate your finances and groceries. tell her that she's isn't allowed to eat your food and vice versa. at least then, she will face SOME consequences for her actions.",
      "created_utc": 1732205240.0,
      "score": 11,
      "context": [
        {
          "id": "ly9clbp",
          "author": "Nervous_Extreme2199",
          "body": "To be fair I think I also contributed to this situation because I strongly suspect that my \"understanding\" behaviour is just me being a conflict avoider...  \nSo the same way she is staying in her comfort zone I am staying also... But this at the end just resulted in me enabling her to continue with this destructive behaviour.... \n\nSo I also don't have much excuses other than \"I tried my best to be the most helpful I can, but I am not born proficient in all that\"...",
          "created_utc": 1732200934.0
        }
      ]
    },
    {
      "id": "lyabgtr",
      "author": "ooofx1000",
      "body": "It is much better for her to see you as understanding when she is in a healthy, recovered position than for her to have a distorted view of what empathy is in her own addiction. My mom was my enabler for a while and it is extremely complicated but the core if it was that she didn't want to face the reality of what was happening behind closed doors. It may be sincere but don't distort your OWN understanding of what it means to be empathetic to fit the framework of a disorder, don't be a part of the disorder itself. If she gets better she will be able to see you as truly understanding",
      "created_utc": 1732214441.0,
      "score": 4,
      "context": [
        {
          "id": "ly9clbp",
          "author": "Nervous_Extreme2199",
          "body": "To be fair I think I also contributed to this situation because I strongly suspect that my \"understanding\" behaviour is just me being a conflict avoider...  \nSo the same way she is staying in her comfort zone I am staying also... But this at the end just resulted in me enabling her to continue with this destructive behaviour.... \n\nSo I also don't have much excuses other than \"I tried my best to be the most helpful I can, but I am not born proficient in all that\"...",
          "created_utc": 1732200934.0
        }
      ]
    },
    {
      "id": "lydwbvt",
      "author": "econroy",
      "body": "Hello, I'm really sorry to hear that. I'm 31, been sick since 8. I've been in and out of hospitals and tried all sorts of approaches, and nothing has ever worked. I think some of us just aren't capable of recovery, and even if I was there's no way I can explain away the financial, social and physical damage of the last 20 years to a man, and still hold that man's romantic interest. So regardless of if I someday am able to \"recover,\" I will still never find someone to be with.  \n\nYou speak as if your 20s were such a long time ago, but you're barely 40. Your life is not over. It may be hypocritical coming from me, but you can still find someone. It will take effort, but it does at any age. You aren't as old as you feel, although I can definitely understand feeling it or even older. This illness ages you. \n\nTake care friend 💙",
      "created_utc": 1732263353.0,
      "score": 3,
      "context": [
        {
          "id": "ly9est5",
          "author": "econroy",
          "body": "I am like your girlfriend. It's actually mindblowing to me that someone out there exists in the same way as I do. My heart breaks for her. \n\nThat said, I am single. I've been single for 10 years. I will be single for the rest of my life. \n\nIt is insane that she allows HER disorder to run YOUR life. It's even more insane that she is so open about these deeply personal routines - doing them out in the open, knowing you see it, knowing you hear it - I can't even fathom that. Making you fund her habit as well as buy and cook the food with her/for her is fucking unreal. \n\nYou have to start putting yourself first. It's like you said, you are living with an addict. You can't change her, and she is not ready to change. Frankly, if she's like me, she might never be capable of change, even if she so desperately wants to (like myself). \n\nIt's selfish of her to inflict her illness so openly upon you and so without shame. There's no way around that. Please start considering that it might be time to separate yourself from the situation for your own mental, social and financial health.",
          "created_utc": 1732204273.0
        },
        {
          "id": "lydbtas",
          "author": "triciani23",
          "body": "Hi friend, I will comment more tomorrow — but how old are you? I just turned 40. I’ve had an eating disorder since I was 12, and your comment “I will be single for the rest of my life” just broke my heart. I have been single my whole life because of my eating disorder. Please get help if you can. I wish I had tried harder in my 20s.",
          "created_utc": 1732251814.0
        }
      ]
    },
    {
      "id": "lykz3i0",
      "author": "Much_Pass_1886",
      "body": "I feel you :( I was able to go into recovery and it's hard sometimes but you can do it, it's really worth it! Send you all my best wishes (:",
      "created_utc": 1732372364.0,
      "score": 2,
      "context": [
        {
          "id": "ly9bizr",
          "author": "kimchiplug",
          "body": " I don’t think you want to hear this, but I suspect you know the answer. She has to want to get better. You can’t force that on anyone. It’s an awful addiction, crossing mental/physical/emotional levels of addiction. So you can only control yourself, that may mean leaving.",
          "created_utc": 1732200570.0
        },
        {
          "id": "lydc0od",
          "author": "triciani23",
          "body": "💯I’m 40. I’ve had an eating disorder since I was 12. It’s my friend’s passing this week that may push me into rehab. And even then is maybe. Bulimia is such an insidious disease.",
          "created_utc": 1732251911.0
        }
      ]
    },
    {
      "id": "lydt17t",
      "author": "kimchiplug",
      "body": "Yeah I’m on year 18…",
      "created_utc": 1732261294.0,
      "score": 1,
      "context": [
        {
          "id": "ly9bizr",
          "author": "kimchiplug",
          "body": " I don’t think you want to hear this, but I suspect you know the answer. She has to want to get better. You can’t force that on anyone. It’s an awful addiction, crossing mental/physical/emotional levels of addiction. So you can only control yourself, that may mean leaving.",
          "created_utc": 1732200570.0
        },
        {
          "id": "lydc0od",
          "author": "triciani23",
          "body": "💯I’m 40. I’ve had an eating disorder since I was 12. It’s my friend’s passing this week that may push me into rehab. And even then is maybe. Bulimia is such an insidious disease.",
          "created_utc": 1732251911.0
        }
      ]
    },
    {
      "id": "lyfq3d8",
      "author": "LadyIlithyia",
      "body": "Thank you so much 💜",
      "created_utc": 1732293136.0,
      "score": 1,
      "context": [
        {
          "id": "ly9h7u5",
          "author": "LadyIlithyia",
          "body": "So, I was almost exactly like your girlfriend.  Always b/p when home, buying a lot of groceries to then purge (weekly), getting upset if we had plans because it delayed the b/p sessions.  Most of my blood work came back fine, my teeth were fine so I kept deluding myself that I was not causing any real harm.  My husband has been with me for ten years.  He has only known me with the disorder.\n\nHe had sat me down some months ago now and told me flat out he cannot keep doing this anymore.  Watching me harm myself on the daily, wasting money, etc.  Being afraid that if we continued to build a future that I would pass from the disorder.  \n\nI needed to hear it.  I needed to hear his feelings and really take them into account.  After all, this was the person I loved the most in this world.   It took me a couple months to also really want to recover for myself after he said it.  Without wanting it - I do not think I could do it.  He always said I loved my illness more than him.  I do not believe it to be true, but I knew I could not recover for anyone without wanting it myself. \n\nIt hurts to hear, but she needs to want it for herself.  I do not think there is anything you can do except be honest about your feelings.  I do not think an ultimatum would work.  Tell her you cannot continue to live like this - those are your true feelings. Maybe she will do some soul searching after that.  I did, and I am five months b/p free.  I still struggle with aspects of the disorder (fear of foods, food noise), but I am a lot happier.  I actually can be present in the moments with my husband.  I realized how much of it I missed due to always being preoccupied with my thoughts of b/ping.\n\nBest of luck to you both, OP.  It is truly a hard situation.  You deserve peace and happiness too.",
          "created_utc": 1732205309.0
        },
        {
          "id": "lydc4vp",
          "author": "triciani23",
          "body": "That’s amazing for you!!",
          "created_utc": 1732251966.0
        }
      ]
    }
  ]
}