{
  "id": "1gx7ki7",
  "subreddit": "bulimia",
  "author": "StrongBox5258",
  "created_utc": 1732281295.0,
  "title": "For anyone still purging... ",
  "selftext": "I'm currently back and forth to the dentist. I'm having to have 6 teeth removed. I need 3 fillings. 1 root canal treatment and 2 of my teeth crowned. I use to have amazing teeth. I always got nice comments about my teeth. Even during being bulimic I tried everything to keep them good. It's impossible. Also. All this damage just seemed to appear so quickly aswell. I genuinely thought I was getting away with it. Nope. Apart from completely destroying my smile it's costing a fortune. I don't binge/Purge anymore but I've still done so much damage. \n\nTry and do everything in your power to stop. This illness isn't as guilt free as some seem to think. My digestive system is also completely destroyed. I had to use drugs and supplements and probiotics to get my digestion working properly again. Your also throwing your potassium levels off also. Not just potassium but every nutrient and vitamin needed to sustain you. I feel alot better since nourishing my body. If your using an anti depressant to try and fix your mental health your probably just lacking the nutrients to sustain your brain chemistry. \n\nThis illness will eventually make you lose everything from your looks to your friends and family. You just become a recluse that hides inside all day just to binge and purge. \n\nRecovering was tough but it can be done. I honestly thought I would never stop and I have. It took discipline and willpower but it can be done. Just gotta accept that you won't feel good until you finally nourish your body. You only get one chance on this planet and this isn't living. \n\nGood luck",
  "url": "https://www.reddit.com/r/bulimia/comments/1gx7ki7/for_anyone_still_purging/",
  "score": 96,
  "num_comments": 25,
  "comments": [
    {
      "id": "lyet2u1",
      "author": "dippyhippy_",
      "body": "Got my first dentist appointment since 2022 in December. Honestly dreading it. Been holding off due to bulimia and the fact my teeth have deteriorated. Even in recovery I'm mega self conscious about my teeth so I completely understand the sentiment behind this post.\n\nI think the problem is is that when you're deep in it you honestly don't care about how it destroys your body. Purging is a compelling behaviour and it tricks your mind in to believing it will help regulate your emotions. It's tricky, I wish everyone could see the light at the end of the tunnel and believe that recovery is so worth it. It can just take people a while to get there.",
      "created_utc": 1732281812.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lyfgusz",
      "author": "sonic2cool",
      "body": "This is heartbreaking and so scary man.. I'm 7 years into bulimia, I'm 21f now and it truly is catching up to me, my teeth are so sensitive, I get chest pains now but I'm unsure if its the anxiety or bulimia. I havent been to the dentist since lockdown because of the shame and being unable to admit why my enamel is wearing away and why my teeth have chipped.. I know it's all the disorders fault.",
      "created_utc": 1732290215.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lygvr60",
      "author": "ooofx1000",
      "body": "ugh...on my second implant literally dont have enough savings to finish the work i still need done bc the money i spent on food. its so insane i can't believe its my life sometimes. i never thought id have this much dental work in my 20s",
      "created_utc": 1732305981.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lyetsrd",
      "author": "calfreak",
      "body": "It’s so sad my dentist doesn’t say anything as they could be the ones to turn things around for people. With bulimia (and anorexia) they’re the ones that can see the signs. Mine just say just brush lightly even though I have admitted I’m purging…",
      "created_utc": 1732282096.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lyha6fp",
      "author": "jarofonions",
      "body": "how do people afford dental care, seriously? i desperately need to see a dentist but i can’t afford for them to actually do anything ):",
      "created_utc": 1732310620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lymy4d2",
      "author": "ObsessiveDeleter",
      "body": "Thank you for this. I've always been proud of my teeth and I know they're not what they used to be...",
      "created_utc": 1732395854.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lypnby8",
      "author": "psychofeline72",
      "body": "Unfortunately the addiction to bulimia will usually override any sense of perspective about our teeth & health. Good luck all .",
      "created_utc": 1732436477.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lylw49k",
      "author": "kawaiigothbabe",
      "body": "can I ask how long you've been bulimic before it caught up to you? I have the same mentality that I'm getting away with it and taking care of my teeth enough as I've had no issues yet and I'm going on 10 years...I used to get motivated to get better but never have cared enough to I guess. But messing up my teeth has always been the one thing I don't want 😞",
      "created_utc": 1732383572.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lymcz9s",
      "author": "swirlygrey",
      "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
      "created_utc": 1732388901.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyjfl2j",
      "author": "triciani23",
      "body": "I just turned 40. I’ve had an eating disorder since I was 12. I’m so glad that you are doing better! Our existence is really very sad. I equate it to being part of the walking dead. I want to say that I’ve spent 50k on dental work — veneers, crowns, etc to hide the damage that bulimia has done.",
      "created_utc": 1732341427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyfv0gr",
      "author": "StrongBox5258",
      "body": "Hey.\n\n7 years and your 21? Jeez. I'm sorry to hear this. You started purging at 14? Do you mind if I ask what triggered it?\n\nI told my dentist I was bulimic for years and that's why my teeth will be damaged. She said to me that she knows who is bulimic and she can see all the signs. She also thanked me for being tough and able to come in.\n\nYou should get an appointment and go for it. I was honestly shaking my last appointment. 3 teeth pulled in one sitting and the week before that my face was a mess with an abscess. I'm regretting all the years of being bulimic but I'm slowly repairing myself. I got all my bloodwork back to normal. I also had to eat in a surplus to fix my hunger signals (Stephanie buttermore all in videos are good for understanding this). I am now fixing all my teeth. I knew I had damaged teeth but she showed me my x-rays and their was infections all under my teeth into my jaw bone. I'm currently fixing this. My digestion also needed tons of work.\n\nYour so young and deserve a much better life than this illness. It gets worse as you get deeper and deeper. We sort of tell ourself's that purging isn't that bad. We tell ourself's that being overweight is much more unhealthy. Carrying some extra fluff is 1000x healthier than being bulimic honestly. This illness isn't spoke about enough by doctors and even online. It's almost hidden.\n\nAre you suffering any issues yet? How is your daily mood? How is your hair skin and nails etc?\n\nWhat scared me was thinking I was getting away with it. I still looked good and it was like a light switch and my body failed so fast. I've also lost 50% of my hair. I need to spray hair fibres on everytime I leave the house.\n\nA horrible illness. I wish everyone could recover but it's a hard process.\n\nHave you ever tried to stop? If so. How did you get on?",
      "created_utc": 1732294635.0,
      "score": 9,
      "context": [
        {
          "id": "lyfgusz",
          "author": "sonic2cool",
          "body": "This is heartbreaking and so scary man.. I'm 7 years into bulimia, I'm 21f now and it truly is catching up to me, my teeth are so sensitive, I get chest pains now but I'm unsure if its the anxiety or bulimia. I havent been to the dentist since lockdown because of the shame and being unable to admit why my enamel is wearing away and why my teeth have chipped.. I know it's all the disorders fault.",
          "created_utc": 1732290215.0
        }
      ]
    },
    {
      "id": "lyjxm4u",
      "author": "StrongBox5258",
      "body": "Have you had alot done?\n\nIt's also a part of your body that you can't really hide. Your smile. I want to be able to laugh again without feeling embaressed. I had amazing teeth a few years ago and had loads of comments.",
      "created_utc": 1732352484.0,
      "score": 3,
      "context": [
        {
          "id": "lygvr60",
          "author": "ooofx1000",
          "body": "ugh...on my second implant literally dont have enough savings to finish the work i still need done bc the money i spent on food. its so insane i can't believe its my life sometimes. i never thought id have this much dental work in my 20s",
          "created_utc": 1732305981.0
        }
      ]
    },
    {
      "id": "lyj2g13",
      "author": "twodogsandabeer",
      "body": "They probably don't know what to say anymore. They are not therapists. They're just trying to give advice... If any.",
      "created_utc": 1732334950.0,
      "score": 4,
      "context": [
        {
          "id": "lyetsrd",
          "author": "calfreak",
          "body": "It’s so sad my dentist doesn’t say anything as they could be the ones to turn things around for people. With bulimia (and anorexia) they’re the ones that can see the signs. Mine just say just brush lightly even though I have admitted I’m purging…",
          "created_utc": 1732282096.0
        }
      ]
    },
    {
      "id": "lyjxg36",
      "author": "StrongBox5258",
      "body": "Are you spending money on food still?\n\nIf you can start to stop being bulimic it may allow you to save some funds? Also isn't their some sort of health care service?",
      "created_utc": 1732352372.0,
      "score": 1,
      "context": [
        {
          "id": "lyha6fp",
          "author": "jarofonions",
          "body": "how do people afford dental care, seriously? i desperately need to see a dentist but i can’t afford for them to actually do anything ):",
          "created_utc": 1732310620.0
        }
      ]
    },
    {
      "id": "lyn3jte",
      "author": "StrongBox5258",
      "body": "Get yourself into recovery before you do get to my stage. You honestly don't want to get to the point that your teeth are all needing taken out and then being told your face is collapsing in due to an infection eating all your jaw bone.\n\nIt's not worth it honestly.",
      "created_utc": 1732397701.0,
      "score": 2,
      "context": [
        {
          "id": "lymy4d2",
          "author": "ObsessiveDeleter",
          "body": "Thank you for this. I've always been proud of my teeth and I know they're not what they used to be...",
          "created_utc": 1732395854.0
        }
      ]
    },
    {
      "id": "lyprfo7",
      "author": "StrongBox5258",
      "body": "Sadly your 100% right. During my worst bulimia days I just refused to accept I was destroying my health. I was though.\n\nI'm older now and completely destroyed my looks. I know I could have looked much better and had far more going for me if I never got into this disorder.\n\nThough. Since I stopped. I've noticed my skin improving. My mood is 1000x better. I just look healthier but I know I've still done irreversible damage.\n\nI just hope that people can get themself's better. Bulimia won't make you one of those slim toned fitness influencers that your always browsing through. It will destroy your looks. Not improve it.",
      "created_utc": 1732439095.0,
      "score": 2,
      "context": [
        {
          "id": "lypnby8",
          "author": "psychofeline72",
          "body": "Unfortunately the addiction to bulimia will usually override any sense of perspective about our teeth & health. Good luck all .",
          "created_utc": 1732436477.0
        }
      ]
    },
    {
      "id": "lyn2de3",
      "author": "StrongBox5258",
      "body": "I was bulimic for 13 years. Not all of that time though. I did have periods where I stopped. This is the longest I have went and I know I won't ever start again. After seeing the damage it's done aswell. I honestly thought I wqs getting away with it but being honest. I wasn't. I never even knew my full jaw was covered in an infection. The dentist also said to me. If I had left it much longer the infection would have eaten all my jaw bone and my face would have collapsed in. She showed me where all the damage had already started also. I didn't have a clue. I suspect most of us have this happening and have no clue tbh. \n\nIt's not just your teeth. It's your full body it's damaging. Get a bloodwork panel with hormones on it and have a look also. It's every cell of your body getting destroyed.\n\nI honestly thought I wouldn't be able to stop and I did. It's finding what works for you. The first few months are very rough I won't lie. The urges get so strong. Once you fight through them it all disappears. I can eat a meal now and not even finish it. During bulimia I could easily eat 5-7 thousand calories in one sitting. I could never do that now because my body is nourished and my satiety signals have returned.\n\nJust gotta battle that first part and then get into a routine and never let yourself start to slip again.",
      "created_utc": 1732397298.0,
      "score": 2,
      "context": [
        {
          "id": "lylw49k",
          "author": "kawaiigothbabe",
          "body": "can I ask how long you've been bulimic before it caught up to you? I have the same mentality that I'm getting away with it and taking care of my teeth enough as I've had no issues yet and I'm going on 10 years...I used to get motivated to get better but never have cared enough to I guess. But messing up my teeth has always been the one thing I don't want 😞",
          "created_utc": 1732383572.0
        }
      ]
    },
    {
      "id": "lyn36p5",
      "author": "StrongBox5258",
      "body": "Yeh it puts alot of strain on your mid section. I'm glad people are sharing their problems. People need to know that this could be their future. I thought I was getting away with being bulimic and honestly it all just hit me how much damage I had done. I actually think this illness plays with your mind and you ignore any issues. \n\nHave you managed to get into recovery? Are you needing the hernia repaired?",
      "created_utc": 1732397576.0,
      "score": 2,
      "context": [
        {
          "id": "lymcz9s",
          "author": "swirlygrey",
          "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
          "created_utc": 1732388901.0
        }
      ]
    },
    {
      "id": "lyghhsr",
      "author": "sonic2cool",
      "body": "Can I private message you instead? X",
      "created_utc": 1732301514.0,
      "score": 2,
      "context": [
        {
          "id": "lyfgusz",
          "author": "sonic2cool",
          "body": "This is heartbreaking and so scary man.. I'm 7 years into bulimia, I'm 21f now and it truly is catching up to me, my teeth are so sensitive, I get chest pains now but I'm unsure if its the anxiety or bulimia. I havent been to the dentist since lockdown because of the shame and being unable to admit why my enamel is wearing away and why my teeth have chipped.. I know it's all the disorders fault.",
          "created_utc": 1732290215.0
        },
        {
          "id": "lyfv0gr",
          "author": "StrongBox5258",
          "body": "Hey.\n\n7 years and your 21? Jeez. I'm sorry to hear this. You started purging at 14? Do you mind if I ask what triggered it?\n\nI told my dentist I was bulimic for years and that's why my teeth will be damaged. She said to me that she knows who is bulimic and she can see all the signs. She also thanked me for being tough and able to come in.\n\nYou should get an appointment and go for it. I was honestly shaking my last appointment. 3 teeth pulled in one sitting and the week before that my face was a mess with an abscess. I'm regretting all the years of being bulimic but I'm slowly repairing myself. I got all my bloodwork back to normal. I also had to eat in a surplus to fix my hunger signals (Stephanie buttermore all in videos are good for understanding this). I am now fixing all my teeth. I knew I had damaged teeth but she showed me my x-rays and their was infections all under my teeth into my jaw bone. I'm currently fixing this. My digestion also needed tons of work.\n\nYour so young and deserve a much better life than this illness. It gets worse as you get deeper and deeper. We sort of tell ourself's that purging isn't that bad. We tell ourself's that being overweight is much more unhealthy. Carrying some extra fluff is 1000x healthier than being bulimic honestly. This illness isn't spoke about enough by doctors and even online. It's almost hidden.\n\nAre you suffering any issues yet? How is your daily mood? How is your hair skin and nails etc?\n\nWhat scared me was thinking I was getting away with it. I still looked good and it was like a light switch and my body failed so fast. I've also lost 50% of my hair. I need to spray hair fibres on everytime I leave the house.\n\nA horrible illness. I wish everyone could recover but it's a hard process.\n\nHave you ever tried to stop? If so. How did you get on?",
          "created_utc": 1732294635.0
        }
      ]
    },
    {
      "id": "lynlkn7",
      "author": "ooofx1000",
      "body": "same, especially my front teeth. i luckily found a dentist who is absolutely amazing and i trust him with my mouth so much. i literally have like 2 (if that) natural teeth left in tact i think haha. But i still get compliments on my teeth all the time. thought my front teeth would need to be replaced with crowns they were completely gone in the back, and he managed to use bonding to fix them and only cost me $150 to make them look even better than before! there is *always* a bright side...\n\nDont let yourself get ripped off! and don't let dentists push you to get work done (if you're young) that will impact you for the rest of your life. my dentist is always so transparent about what i'll need done and takes into consideration my health and money before his own business, not all doctors are like that! I still have the option and probably will get crowns or veneers when I am in my 30s, fully recovered, and financially stable but its so amazing to know there are affordable options",
      "created_utc": 1732404043.0,
      "score": 1,
      "context": [
        {
          "id": "lygvr60",
          "author": "ooofx1000",
          "body": "ugh...on my second implant literally dont have enough savings to finish the work i still need done bc the money i spent on food. its so insane i can't believe its my life sometimes. i never thought id have this much dental work in my 20s",
          "created_utc": 1732305981.0
        },
        {
          "id": "lyjxm4u",
          "author": "StrongBox5258",
          "body": "Have you had alot done?\n\nIt's also a part of your body that you can't really hide. Your smile. I want to be able to laugh again without feeling embaressed. I had amazing teeth a few years ago and had loads of comments.",
          "created_utc": 1732352484.0
        }
      ]
    },
    {
      "id": "lyyxfbz",
      "author": "jarofonions",
      "body": "I have never had thousands of dollars, even deep in my BPing",
      "created_utc": 1732569468.0,
      "score": 1,
      "context": [
        {
          "id": "lyha6fp",
          "author": "jarofonions",
          "body": "how do people afford dental care, seriously? i desperately need to see a dentist but i can’t afford for them to actually do anything ):",
          "created_utc": 1732310620.0
        },
        {
          "id": "lyjxg36",
          "author": "StrongBox5258",
          "body": "Are you spending money on food still?\n\nIf you can start to stop being bulimic it may allow you to save some funds? Also isn't their some sort of health care service?",
          "created_utc": 1732352372.0
        }
      ]
    },
    {
      "id": "lyn3kre",
      "author": "swirlygrey",
      "body": "Yeah i’m the same i was always like “nothing will ever happen to me i’m fine”, but just cos i couldnt see the damage on the outside it tricked me. I just had my endoscopy yesterday and found out so now i’m going to see the doctor to see what they can do. I’m sort of in recovery but i’m on a waiting list for CBT therapy that 18 months long so not really:/",
      "created_utc": 1732397709.0,
      "score": 1,
      "context": [
        {
          "id": "lymcz9s",
          "author": "swirlygrey",
          "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
          "created_utc": 1732388901.0
        },
        {
          "id": "lyn36p5",
          "author": "StrongBox5258",
          "body": "Yeh it puts alot of strain on your mid section. I'm glad people are sharing their problems. People need to know that this could be their future. I thought I was getting away with being bulimic and honestly it all just hit me how much damage I had done. I actually think this illness plays with your mind and you ignore any issues. \n\nHave you managed to get into recovery? Are you needing the hernia repaired?",
          "created_utc": 1732397576.0
        }
      ]
    },
    {
      "id": "lyn47f4",
      "author": "StrongBox5258",
      "body": "Are you having days your managing not to purge? Recovery isn't perfect btw. You take each day as it comes.\n\nIs your hernia very noticeable?",
      "created_utc": 1732397921.0,
      "score": 2,
      "context": [
        {
          "id": "lymcz9s",
          "author": "swirlygrey",
          "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
          "created_utc": 1732388901.0
        },
        {
          "id": "lyn36p5",
          "author": "StrongBox5258",
          "body": "Yeh it puts alot of strain on your mid section. I'm glad people are sharing their problems. People need to know that this could be their future. I thought I was getting away with being bulimic and honestly it all just hit me how much damage I had done. I actually think this illness plays with your mind and you ignore any issues. \n\nHave you managed to get into recovery? Are you needing the hernia repaired?",
          "created_utc": 1732397576.0
        },
        {
          "id": "lyn3kre",
          "author": "swirlygrey",
          "body": "Yeah i’m the same i was always like “nothing will ever happen to me i’m fine”, but just cos i couldnt see the damage on the outside it tricked me. I just had my endoscopy yesterday and found out so now i’m going to see the doctor to see what they can do. I’m sort of in recovery but i’m on a waiting list for CBT therapy that 18 months long so not really:/",
          "created_utc": 1732397709.0
        }
      ]
    },
    {
      "id": "lyn4pll",
      "author": "swirlygrey",
      "body": "Yes i have definitely been purging less recently purely because i’m just tired of it i cant be bothered anymore but some days i do, the hernia is awful because i have really bad acid reflux after anything i eat, i even get reflux from water. My mouth fills up with sick. I’m in a cycle because to stop the reflux i end up purging!  But thats whats caused the hernia in the first place, i hope i will get help for it soon because its debilitating",
      "created_utc": 1732398093.0,
      "score": 1,
      "context": [
        {
          "id": "lymcz9s",
          "author": "swirlygrey",
          "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
          "created_utc": 1732388901.0
        },
        {
          "id": "lyn36p5",
          "author": "StrongBox5258",
          "body": "Yeh it puts alot of strain on your mid section. I'm glad people are sharing their problems. People need to know that this could be their future. I thought I was getting away with being bulimic and honestly it all just hit me how much damage I had done. I actually think this illness plays with your mind and you ignore any issues. \n\nHave you managed to get into recovery? Are you needing the hernia repaired?",
          "created_utc": 1732397576.0
        },
        {
          "id": "lyn3kre",
          "author": "swirlygrey",
          "body": "Yeah i’m the same i was always like “nothing will ever happen to me i’m fine”, but just cos i couldnt see the damage on the outside it tricked me. I just had my endoscopy yesterday and found out so now i’m going to see the doctor to see what they can do. I’m sort of in recovery but i’m on a waiting list for CBT therapy that 18 months long so not really:/",
          "created_utc": 1732397709.0
        },
        {
          "id": "lyn47f4",
          "author": "StrongBox5258",
          "body": "Are you having days your managing not to purge? Recovery isn't perfect btw. You take each day as it comes.\n\nIs your hernia very noticeable?",
          "created_utc": 1732397921.0
        }
      ]
    },
    {
      "id": "lypni6a",
      "author": "StrongBox5258",
      "body": "Jeez. Sorry to hear this. I know someone personally with a hiated hernia and they have huge relieve with a drug. I will get the name of it later for you and send you it ok.\n\nI hope you get the help you deserve",
      "created_utc": 1732436587.0,
      "score": 1,
      "context": [
        {
          "id": "lymcz9s",
          "author": "swirlygrey",
          "body": "Id also like to add i have given myself a hiatal hernia from purging everyday for 6 years, i’m 23. Please everyone reach out for help before its too late🩷",
          "created_utc": 1732388901.0
        },
        {
          "id": "lyn36p5",
          "author": "StrongBox5258",
          "body": "Yeh it puts alot of strain on your mid section. I'm glad people are sharing their problems. People need to know that this could be their future. I thought I was getting away with being bulimic and honestly it all just hit me how much damage I had done. I actually think this illness plays with your mind and you ignore any issues. \n\nHave you managed to get into recovery? Are you needing the hernia repaired?",
          "created_utc": 1732397576.0
        },
        {
          "id": "lyn3kre",
          "author": "swirlygrey",
          "body": "Yeah i’m the same i was always like “nothing will ever happen to me i’m fine”, but just cos i couldnt see the damage on the outside it tricked me. I just had my endoscopy yesterday and found out so now i’m going to see the doctor to see what they can do. I’m sort of in recovery but i’m on a waiting list for CBT therapy that 18 months long so not really:/",
          "created_utc": 1732397709.0
        },
        {
          "id": "lyn47f4",
          "author": "StrongBox5258",
          "body": "Are you having days your managing not to purge? Recovery isn't perfect btw. You take each day as it comes.\n\nIs your hernia very noticeable?",
          "created_utc": 1732397921.0
        },
        {
          "id": "lyn4pll",
          "author": "swirlygrey",
          "body": "Yes i have definitely been purging less recently purely because i’m just tired of it i cant be bothered anymore but some days i do, the hernia is awful because i have really bad acid reflux after anything i eat, i even get reflux from water. My mouth fills up with sick. I’m in a cycle because to stop the reflux i end up purging!  But thats whats caused the hernia in the first place, i hope i will get help for it soon because its debilitating",
          "created_utc": 1732398093.0
        }
      ]
    }
  ]
}