{
  "id": "1h0zqhj",
  "subreddit": "bulimia",
  "author": "unremarkable_sapien",
  "created_utc": 1732696142.0,
  "title": "“Extreme” bulimia ",
  "selftext": "I want to preface this post by saying that this isn’t a competition and I honestly have no desire to get into the “sick enough” bullshit. Everyone with bulimia is suffering, regardless of how often you engage in behaviours.\n\nI’ve been feeling somewhat alone even in ED spaces because I read about people with families, children, jobs, who are studying etc., and that is so far from my reality. My bulimia takes over my life. I b/p for 6+ hrs of my day and only stop to go and buy (or, shamefully, steal) more food. I have no time or energy for anything else. I have no friends or significant relationships and am on disability payments. My life is my ED. General ED subs seem to be filled with teens who are new to all this and still have lives outside of it, and adult-specific subs seem to be full of people juggling their EDs with having a family and employment or education. I wish I could connect with others with similar experiences to me. It gets so lonely here…\n\nI’m not sure exactly what the point of this post is. I guess I just need to hear that I’m not the only one that’s fallen this far into the hole. Is there anyone else out there with “extreme” bulimia?\n\nEdit: wow, I didn’t expect to see so much solidarity in the comments. Honestly hearing all of you express similar thoughts and describe going through the same tortures as me has left me a little teary. This is such an isolating disorder. The thought of all these people scattered across the world binging and purging on repeat in small rooms and apartments littered with trash, all living the same life… it makes me so sad. I can only hope that there is a way out.",
  "url": "https://www.reddit.com/r/bulimia/comments/1h0zqhj/extreme_bulimia/",
  "score": 135,
  "num_comments": 46,
  "comments": [
    {
      "id": "lz7xh69",
      "author": "AmberSal21",
      "body": "I’ve wanted to write a post like this but I’ve never found the courage to because I’ve felt like I was the only one doing stuff like this. I feel you on a personal level dearly. All the stuff you mentioned is what I do on a regular basis. Each time I tell myself it’ll be the last time but I know it’ll never be. \n\nEvery store I live next to basically knows me on a personal level because of how much I visit there. I go out to the same stores everyday at a certain time and buy certain foods because I know what’s easy for me to purge. Been doing this for seven years straight and it’s finally catching up to me. All the side effects are now showing and I’m only 23. I’ll be lucky to have my teeth if I ever hit 28. This ED has taken almost everything from me and I quite frankly don’t care what happens next to me. It’s sad to say but I’m nothing without bulimia.",
      "created_utc": 1732700968.0,
      "score": 73,
      "context": []
    },
    {
      "id": "lz8e5h6",
      "author": "sasspup",
      "body": "im exactly like you. i dont have friends, a relationship with my parents or a job. i too live off of disability because of other mental health problems and most of my money goes to food for b/p. i don't do anything besides eating and purging or thinking about eating and purging and occasionaly watching a movie lol. im sorry i hope we can get out of this one day",
      "created_utc": 1732710751.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lz82yt7",
      "author": "Thin-Yogurtcloset172",
      "body": "Yes, I'm the same, more or less. I've become my sickness, my sickness is my whole life now. I have no job, no friends, no future. I've been slipping deeper and deeper into this hole gradually over the past couple of years. The lack of anything else has been making my bulimia worse, and also the bulimia has been making the prospects of me achieving anything else ever more distant.\n\nI guess the only thing going for me is that I've been seeing an ED-specialized therapist since earlier this fall. Except even with her we only end up sitting in silence for most of our sessions. It's as though she doesn't even know what to say to me. It truly feels like I'm beyond help.",
      "created_utc": 1732704525.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lz7z370",
      "author": "econroy",
      "body": "I am you, and vice versa. You aren't alone.",
      "created_utc": 1732702026.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lz9e291",
      "author": "lisa6547",
      "body": "I do steal food unfortunately too. The only reason that I stopped throwing it up is because I can't afford enough as it is already. I can't afford to throw it up anymore. I'll die if I keep doing this stuff",
      "created_utc": 1732723910.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lz8p8vd",
      "author": "AstridAura",
      "body": "Feels like I could've written this post myself.Im struggling so much ...thank you for finding the courage to post this\nI'm glad I'm not the only one feeling this way.stay strong I know it's hard.",
      "created_utc": 1732715423.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lz9ruhz",
      "author": "Real_CatCupcake",
      "body": "Yep even tho I'm young and just about to turn 18 this is my life. I miss so much school and sleep all day cus I'm exhausted and I spend hours bingeing and purging every night. I'm in the process of getting help but I can't help but feel like I've ruined my life before it's even really started.",
      "created_utc": 1732728173.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lzdz9dd",
      "author": "kitastrofee",
      "body": "I don’t comment often because I find the posts extremely triggering.\n\nTrust me when I say, it only gets worse.. if you can even believe it.\n\nI’ve had this awful disease for over 20 years. \nDone things I can’t even type.\n\nNo life. Fucked up teeth and failing heart and kidneys are only part of it.\n\nIf you are underweight like me, there is a very high reality of severe osteoporosis.\nIt’s incurable. \nBut even though we hear of it. The reality is literally another level.\n\nMy bones are literally crumbling and snapping in half with no fall or accident.\nMy femur has just snapped in half. \nDidn’t fall. Didn’t hurt it.\nJust woke up one day and couldn’t walk. Then bang, snapped in half like a twig.\nWorse pain of my life. \nHad to have a metal pole inserted. I still can’t walk because it’s not healing. Now my other leg is going. My spine is even worse. \nI could end up paralysed like my mum (who also has it and now is in a wheelchair for life) \nBut how to stop when I can’t remember this not being my life.\n\nIt’s just gets worse and more intwined with who you are. It becomes a part of you. So it is you. Like there’s no you without it.\n\nEvery waking thought so you don’t want to think. But it’s the only thing that allows you not to think.\n\nIt’s all consuming. \n\nI wish I had gotten help in my twenties or sooner. \n\nI just want to cry for all you young girls. If you are able to please get help. I honestly beg of you. I pray for you and  myself too.",
      "created_utc": 1732789768.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lzak0os",
      "author": "Zealousideal_Pie_754",
      "body": "I live a very similar way. Daily, constantly from morning right until I go to bed… I can’t go to bed unless I’ve gotten that urge out of my system once more. It’s like 8 hours a day on days I have no commitments… like today. Just constant deliveries, bingeing, cooking, purging, sometimes napping if I’m exhausted, no friends, away from family… I can’t be productive and I feel useless and stuck and lost. My digestion is fucked, I get water retention, low potassium, fatigue, having to lie about how I’m thin or what I do all day, I avoid seeing people, I avoid leaving my house.\n\n\nI can’t face my thoughts and anxieties and trauma. This stops that. It’s stupid but I think I would be overtly a complete mess without such a severe coping mechanism.",
      "created_utc": 1732736890.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzap9pz",
      "author": "salientmould",
      "body": "Hey OP, I know exactly what you mean about the other subs. The over 30 ED sub is wonderful, but most of those people have full lives with homes, partners, careers, children. The young posters in all the subs drive me crazy if I'm being honest. (Their struggles are valid but things are very different when you've been suffering for a long time).\n\nI am also on disability and unable to work more than a couple of days a week. I have no life outside of this. My health problems have been compounding at a rapid pace lately and I've been in and out of the ER lots this past year. My teeth are fucked and my options (and finances) are limited. I feel hopeless to recover at this point and know I can't cope with the weight gain anyways. \n\nI don't have any answers, just solidarity.",
      "created_utc": 1732738554.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzaldns",
      "author": "None",
      "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
      "created_utc": 1732737318.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzayewq",
      "author": "5star-my-notebook",
      "body": "I work about 30 hours a week and have a boyfriend, but I binge and purge at work and in front of my partner. I only leave my house for work. I’m a college dropout and my life revolves around my ED. I don’t really have friends or hobbies and I am perpetually broke. I started stealing food a few months ago out of desperation. I spend 10-12 hours a day bingeing and purging on average. You’re not alone.",
      "created_utc": 1732741446.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lz995hi",
      "author": "CheesecakeHots",
      "body": "Yeah dude. I feel the same and I’m doing the exact same thing. Nothing going on for me. It feels utterly hopeless, and I feel ridiculous even dreaming about changing or experiencing good things in the future. I’m honestly scared, no matter how many times I pray or wake up with motivation , it ends the same. Im tired",
      "created_utc": 1732722354.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzc26w7",
      "author": "Samantha-Noice",
      "body": "hi, 17 year old extreme bulimic here. currently in residential treatment and have been for past 4 months. before entering treatment i’d been twice before for my bulimia as i’ve been binging purging 3-5x a day, stealing food, revolving life around anything food, etc since 14. it’s driven huge rifts in my relationships, esp w my parents. to this day, even while in treatment, i still struggle with my urges and behaviors. i can’t exactly binge purge here but i do overeat and purge when given opportunity. stopping feels hopeless. i feel hopeless. i’m scared to be an adult with this. sending love to you. we will get better someday. you are never alone.",
      "created_utc": 1732755407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzbnvr2",
      "author": "sj0714",
      "body": "I am so glad I found this post. It’s been three years since my parents found my apartment overridden with the remnants of binge and purge food that had been going on for six months and basically forced me to move back in with them and monitored my eating behaviors Since then I have continued to binge and purge and secret and had been caught multiple times despite having intensive outpatient and therapy, I still cannot seem to quit. It seems like I am living a complete lie, and I am scared and can’t trust myself because I know the minute I’m alone the first thing and the only thing I want to do is binge and purge. It’s scary to know that the minute I try to do something other than live at home I will just revert back to old ways and I don’t know why and I can’t explain why it’s just so comfortable and so addictive. I don’t wish this upon anyone but nonetheless the solidarity makes me feel like I am human even if sometimes I feel like I’m only my disorder. So thank you op and fellow commenters",
      "created_utc": 1732749958.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzbwc1p",
      "author": "JustaVet-MedGirl",
      "body": "You are NOT alone. This is me a lot of the time, and before I went to treatment, I was in the same boat. I know exactly how isolating it it is, and how insane it makes you feel. I wish there was something I could do ❤️ You deserve recovery, and I'm sorry if anyone has made you feel differently.",
      "created_utc": 1732753178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzdn7mi",
      "author": "Mandsee",
      "body": "you are soooo not alone.  and im so sorry for that.  sending you a hug.",
      "created_utc": 1732781823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzdoby4",
      "author": "satinewolf",
      "body": "Everyone.. there is hope.. there is help avalibale. I have been b/p free now for over 3 years.. check out the National Alliance for Eating Disorders. They offer free online weekly meetings. I encourage anyone suffering to reach out for help.  Please know there are people who care about you. I believe you can get better. [meetings](https://www.allianceforeatingdisorders.com/groups/)",
      "created_utc": 1732782547.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzch4uv",
      "author": "fadingaurora9828",
      "body": "Can relate to this so damn much on so many levels .. I’m in my 30s and have been struggling since age 11 with AN b/p and it’s nothing short of a nightmare existence. Know there is hope and you are not alone",
      "created_utc": 1732761203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzckmjv",
      "author": "Babybirdbean",
      "body": "You're not alone friend. The only way to stop it is to get help. I'm not saying you need to make any immediate decisions but please start exploring options. \n\nYou can always go back to the eating disorder. Even if you do treatment, even if you gain weight, even if you recover for a period of time. It will always be an option. I promise you won't regret getting better. \n\nNot sure where you're located but I'm happy to share resources. You deserve life. You deserve friends. You deserve happiness. This disorder will never afford you that. \n\nLove you ❤️",
      "created_utc": 1732762584.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzcn2pe",
      "author": "Odd-Violinist546",
      "body": "I’m curious if you’ve had some successes — like going for a day or two without it?",
      "created_utc": 1732763570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzgdeqs",
      "author": "Weary-Bus8436",
      "body": " I b/p up to 5 times a day sometimes, and also steal food. I am also on disability benefits. You are not alone, we can recover. Stay connected.",
      "created_utc": 1732823499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzhlxai",
      "author": "WalnutWitch",
      "body": "You are not alone. Thank you for making this post, this has been on my mind/bothering me a lot lately. I am also on disability, have no life outside of this, just eat, purge, and only leave to get more food. While I wish that no one else suffered from this, at least we can all come together in solidarity to support each other, thanks to posts like yours❤️",
      "created_utc": 1732840256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzk23sd",
      "author": "Fearless-Respect-829",
      "body": "I sadly do complety understand I started at 15 ended up dropping out of school because my day consisted of binged purging for the entire day and to tired to do anything else I'm now 35 and I dont have husband boyfriend friends job education or much of anything else I have septic tank so purging in toilet is outta the question. More like digging giant holes in back part of the yard to hide the puke I'm now on heart medication and need dentures due to all the years of this sadly I stopped drugs but can't seem to stop this ",
      "created_utc": 1732887233.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lznsxwe",
      "author": "Evening-Affect6091",
      "body": "i’m so sorry you are going through this. i am in a very similar situation. i am on disability. the ed’s have taken my life almost two times now. i’ve tried to recover but always end up slipping into the habits again. i am always so weak. suffer from extreme electrolyte imbalances. i don’t really see friends. i can’t do much because i am so weak or i get very dizzy trying to move around. it’s hard everytime i eat feeling the pressure of needing to purge and trying to be careful i don’t get caught up by anyone.",
      "created_utc": 1732937205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzs41vt",
      "author": "Silent-Equipment-919",
      "body": "My b/p episodes can last for hours. I have never had the support or help I need. So it just progressively has gotten worse. You’re not alone.. there’s a lot of us out here we just remain silent because of the shame",
      "created_utc": 1733005306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m02si20",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1733165824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz80fqo",
      "author": "unremarkable_sapien",
      "body": "Thank you, of course I don’t want anyone to be going through this, but it does make me feel less alone. Bulimia has nearly killed me twice now and honestly it’s a miracle that I’m still alive. And yet I still do the same behaviours. \n\nSometimes I get glimpses of things that used to excite me. I listen to a song, or hear about a topic that I used to love. But the flame fizzles out quicky. I’m trying not to lose hope. The real me is hiding somewhere amongst all the piles of trash. And the real you is too. They’ll come out eventually, I hope.",
      "created_utc": 1732702897.0,
      "score": 24,
      "context": [
        {
          "id": "lz7xh69",
          "author": "AmberSal21",
          "body": "I’ve wanted to write a post like this but I’ve never found the courage to because I’ve felt like I was the only one doing stuff like this. I feel you on a personal level dearly. All the stuff you mentioned is what I do on a regular basis. Each time I tell myself it’ll be the last time but I know it’ll never be. \n\nEvery store I live next to basically knows me on a personal level because of how much I visit there. I go out to the same stores everyday at a certain time and buy certain foods because I know what’s easy for me to purge. Been doing this for seven years straight and it’s finally catching up to me. All the side effects are now showing and I’m only 23. I’ll be lucky to have my teeth if I ever hit 28. This ED has taken almost everything from me and I quite frankly don’t care what happens next to me. It’s sad to say but I’m nothing without bulimia.",
          "created_utc": 1732700968.0
        }
      ]
    },
    {
      "id": "lz7xz3n",
      "author": "None",
      "body": "what side effects are you experiencing? i’m so sorry that you’re going through this too :( you deserve to have a life that is full of so much more than an ed",
      "created_utc": 1732701293.0,
      "score": 11,
      "context": [
        {
          "id": "lz7xh69",
          "author": "AmberSal21",
          "body": "I’ve wanted to write a post like this but I’ve never found the courage to because I’ve felt like I was the only one doing stuff like this. I feel you on a personal level dearly. All the stuff you mentioned is what I do on a regular basis. Each time I tell myself it’ll be the last time but I know it’ll never be. \n\nEvery store I live next to basically knows me on a personal level because of how much I visit there. I go out to the same stores everyday at a certain time and buy certain foods because I know what’s easy for me to purge. Been doing this for seven years straight and it’s finally catching up to me. All the side effects are now showing and I’m only 23. I’ll be lucky to have my teeth if I ever hit 28. This ED has taken almost everything from me and I quite frankly don’t care what happens next to me. It’s sad to say but I’m nothing without bulimia.",
          "created_utc": 1732700968.0
        }
      ]
    },
    {
      "id": "lzbrbyi",
      "author": "taniaz415",
      "body": "congrats on getting help.",
      "created_utc": 1732751268.0,
      "score": 0,
      "context": [
        {
          "id": "lz82yt7",
          "author": "Thin-Yogurtcloset172",
          "body": "Yes, I'm the same, more or less. I've become my sickness, my sickness is my whole life now. I have no job, no friends, no future. I've been slipping deeper and deeper into this hole gradually over the past couple of years. The lack of anything else has been making my bulimia worse, and also the bulimia has been making the prospects of me achieving anything else ever more distant.\n\nI guess the only thing going for me is that I've been seeing an ED-specialized therapist since earlier this fall. Except even with her we only end up sitting in silence for most of our sessions. It's as though she doesn't even know what to say to me. It truly feels like I'm beyond help.",
          "created_utc": 1732704525.0
        }
      ]
    },
    {
      "id": "lzanv5b",
      "author": "unremarkable_sapien",
      "body": "I feel this… When I’m binging, I don’t have to think about anything else. It numbs out all the trauma and pain. And I relate about the lying. I’m constantly telling people that I have plans to meet up with friends but in reality I’m off to a buffet. I’m also very underweight so it must be confusing for people to see me buying so much food all the time. But I’ve really stopped caring about what other people think, I need my fix.",
      "created_utc": 1732738110.0,
      "score": 4,
      "context": [
        {
          "id": "lzak0os",
          "author": "Zealousideal_Pie_754",
          "body": "I live a very similar way. Daily, constantly from morning right until I go to bed… I can’t go to bed unless I’ve gotten that urge out of my system once more. It’s like 8 hours a day on days I have no commitments… like today. Just constant deliveries, bingeing, cooking, purging, sometimes napping if I’m exhausted, no friends, away from family… I can’t be productive and I feel useless and stuck and lost. My digestion is fucked, I get water retention, low potassium, fatigue, having to lie about how I’m thin or what I do all day, I avoid seeing people, I avoid leaving my house.\n\n\nI can’t face my thoughts and anxieties and trauma. This stops that. It’s stupid but I think I would be overtly a complete mess without such a severe coping mechanism.",
          "created_utc": 1732736890.0
        }
      ]
    },
    {
      "id": "lzaoeoz",
      "author": "unremarkable_sapien",
      "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
      "created_utc": 1732738282.0,
      "score": 7,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        }
      ]
    },
    {
      "id": "lzcp657",
      "author": "unremarkable_sapien",
      "body": "I’ve had so much help. I’m in hospital or inpatient treatment every couple of months. I have extensive outpatient support and therapy. I feel like I’ve exhausted all options, there’s nothing that I haven’t tried, apart from something like psychedelics. It’s so hard to hold on to hope",
      "created_utc": 1732764429.0,
      "score": 2,
      "context": [
        {
          "id": "lzckmjv",
          "author": "Babybirdbean",
          "body": "You're not alone friend. The only way to stop it is to get help. I'm not saying you need to make any immediate decisions but please start exploring options. \n\nYou can always go back to the eating disorder. Even if you do treatment, even if you gain weight, even if you recover for a period of time. It will always be an option. I promise you won't regret getting better. \n\nNot sure where you're located but I'm happy to share resources. You deserve life. You deserve friends. You deserve happiness. This disorder will never afford you that. \n\nLove you ❤️",
          "created_utc": 1732762584.0
        }
      ]
    },
    {
      "id": "lzcoqcf",
      "author": "unremarkable_sapien",
      "body": "Possibly a day or so during inpatient stays, but I always find a way even while inpatient. Other than those times, this has been ongoing for years",
      "created_utc": 1732764247.0,
      "score": 1,
      "context": [
        {
          "id": "lzcn2pe",
          "author": "Odd-Violinist546",
          "body": "I’m curious if you’ve had some successes — like going for a day or two without it?",
          "created_utc": 1732763570.0
        }
      ]
    },
    {
      "id": "lz7ypq2",
      "author": "AmberSal21",
      "body": "Thank you, I appreciate the kind words <3 The side effects that I’m experiencing right now is rapid tooth decay, major hair loss, no period for three years, weak esophagus, weak muscles, dehydration, gastrointestinal issues, electrolyte imbalance, and mind fog. It’s taken so much from me but I’ve been doing it for so long it feels like it apart of me now.",
      "created_utc": 1732701779.0,
      "score": 23,
      "context": [
        {
          "id": "lz7xh69",
          "author": "AmberSal21",
          "body": "I’ve wanted to write a post like this but I’ve never found the courage to because I’ve felt like I was the only one doing stuff like this. I feel you on a personal level dearly. All the stuff you mentioned is what I do on a regular basis. Each time I tell myself it’ll be the last time but I know it’ll never be. \n\nEvery store I live next to basically knows me on a personal level because of how much I visit there. I go out to the same stores everyday at a certain time and buy certain foods because I know what’s easy for me to purge. Been doing this for seven years straight and it’s finally catching up to me. All the side effects are now showing and I’m only 23. I’ll be lucky to have my teeth if I ever hit 28. This ED has taken almost everything from me and I quite frankly don’t care what happens next to me. It’s sad to say but I’m nothing without bulimia.",
          "created_utc": 1732700968.0
        },
        {
          "id": "lz7xz3n",
          "author": "None",
          "body": "what side effects are you experiencing? i’m so sorry that you’re going through this too :( you deserve to have a life that is full of so much more than an ed",
          "created_utc": 1732701293.0
        }
      ]
    },
    {
      "id": "lzbbhuo",
      "author": "Zealousideal_Pie_754",
      "body": "Same 😔 oh I’m sending you strength & love.",
      "created_utc": 1732745587.0,
      "score": 1,
      "context": [
        {
          "id": "lzak0os",
          "author": "Zealousideal_Pie_754",
          "body": "I live a very similar way. Daily, constantly from morning right until I go to bed… I can’t go to bed unless I’ve gotten that urge out of my system once more. It’s like 8 hours a day on days I have no commitments… like today. Just constant deliveries, bingeing, cooking, purging, sometimes napping if I’m exhausted, no friends, away from family… I can’t be productive and I feel useless and stuck and lost. My digestion is fucked, I get water retention, low potassium, fatigue, having to lie about how I’m thin or what I do all day, I avoid seeing people, I avoid leaving my house.\n\n\nI can’t face my thoughts and anxieties and trauma. This stops that. It’s stupid but I think I would be overtly a complete mess without such a severe coping mechanism.",
          "created_utc": 1732736890.0
        },
        {
          "id": "lzanv5b",
          "author": "unremarkable_sapien",
          "body": "I feel this… When I’m binging, I don’t have to think about anything else. It numbs out all the trauma and pain. And I relate about the lying. I’m constantly telling people that I have plans to meet up with friends but in reality I’m off to a buffet. I’m also very underweight so it must be confusing for people to see me buying so much food all the time. But I’ve really stopped caring about what other people think, I need my fix.",
          "created_utc": 1732738110.0
        }
      ]
    },
    {
      "id": "lzaz2g4",
      "author": "5star-my-notebook",
      "body": "I have been exactly the same in treatment and I have no idea what to do now because it feels like inpatient just isn’t designed to help with b/p urges to such an extreme level. I experience physical withdrawal symptoms after a few hours of not b/ping and it’s genuinely scary.",
      "created_utc": 1732741654.0,
      "score": 3,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        },
        {
          "id": "lzaoeoz",
          "author": "unremarkable_sapien",
          "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
          "created_utc": 1732738282.0
        }
      ]
    },
    {
      "id": "lzbuclc",
      "author": "None",
      "body": "Considering that you may have exhausted all other options, It might be worth seeing a psychiatrist for anti-psychotic, antidepressant or stimulant medication as you may have an underlying condition that is hindering you from moving forward like depression, anxiety, OCD, bipolar or ADHD etc etc (just a thought, I’m just throwing ideas out there…not offering medical advice at all) if you want to get better, and you’re underweight, you need to put on weight to stop the constant BP voices. When you’re in it that deep, it’s really hard to stop the constant ED chatter. Sometimes medication is a good temporary (or permanent) measure to pull you out of it and stop the mind racing. Don’t give up OP.",
      "created_utc": 1732752419.0,
      "score": 3,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        },
        {
          "id": "lzaoeoz",
          "author": "unremarkable_sapien",
          "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
          "created_utc": 1732738282.0
        }
      ]
    },
    {
      "id": "lzmk38g",
      "author": "Odd-Violinist546",
      "body": "Well, that’s  better than nothing.",
      "created_utc": 1732919418.0,
      "score": 1,
      "context": [
        {
          "id": "lzcn2pe",
          "author": "Odd-Violinist546",
          "body": "I’m curious if you’ve had some successes — like going for a day or two without it?",
          "created_utc": 1732763570.0
        },
        {
          "id": "lzcoqcf",
          "author": "unremarkable_sapien",
          "body": "Possibly a day or so during inpatient stays, but I always find a way even while inpatient. Other than those times, this has been ongoing for years",
          "created_utc": 1732764247.0
        }
      ]
    },
    {
      "id": "lzbvpo2",
      "author": "unremarkable_sapien",
      "body": "I do see a psychiatrist and have tried basically every antidepressant and a ton of antipsychotics. Nothing takes away the urges. I did actually get to trial a stimulant (I have a tentative diagnosis of ADHD - psychiatrist thinks so but I need a formal evaluation). It did work to some extent, at least better than anything else I’ve tried. I’m too underweight now to get back on it but it’s definitely something that I want to try again in the future.\n\nI am very aware that a big contributor to my urges is the fact that I am malnourished and my brain is screaming out for sustenance. The problem is that every time I try a meal plan, or I try to keep food down, I just end up craving it even more. It’s like I’ve opened the gates and a single meal doesn’t satisfy me so I keep going and end up back in the b/p cycle. It’s so hard.",
      "created_utc": 1732752940.0,
      "score": 3,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        },
        {
          "id": "lzaoeoz",
          "author": "unremarkable_sapien",
          "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
          "created_utc": 1732738282.0
        },
        {
          "id": "lzbuclc",
          "author": "None",
          "body": "Considering that you may have exhausted all other options, It might be worth seeing a psychiatrist for anti-psychotic, antidepressant or stimulant medication as you may have an underlying condition that is hindering you from moving forward like depression, anxiety, OCD, bipolar or ADHD etc etc (just a thought, I’m just throwing ideas out there…not offering medical advice at all) if you want to get better, and you’re underweight, you need to put on weight to stop the constant BP voices. When you’re in it that deep, it’s really hard to stop the constant ED chatter. Sometimes medication is a good temporary (or permanent) measure to pull you out of it and stop the mind racing. Don’t give up OP.",
          "created_utc": 1732752419.0
        }
      ]
    },
    {
      "id": "lzbxibo",
      "author": "None",
      "body": "For sure, I struggle with satiety after developing bulimia . Nothing fills me up except a small number of foods or huge volumes of veggies. So in recovery I rely on foods that ‘psychologically’ fill me up in the sense that it satisfies my cravings. It’s a daily struggle though… always hungry and wanting more. But I realise a lot of it is mental and that it’s anxiety/boredom. Food blocks the void. I try to keep myself busy as I work through improving my mental state… \n\nBut I get it - nothing compares to the satiety of shovelling highly palatable food in your body until you can’t fit any more… I never feel that level of fullness unless it’s first thing in the morning and I’m nauseous or I’m unwell with bloating/stomach ache..",
      "created_utc": 1732753622.0,
      "score": 2,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        },
        {
          "id": "lzaoeoz",
          "author": "unremarkable_sapien",
          "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
          "created_utc": 1732738282.0
        },
        {
          "id": "lzbuclc",
          "author": "None",
          "body": "Considering that you may have exhausted all other options, It might be worth seeing a psychiatrist for anti-psychotic, antidepressant or stimulant medication as you may have an underlying condition that is hindering you from moving forward like depression, anxiety, OCD, bipolar or ADHD etc etc (just a thought, I’m just throwing ideas out there…not offering medical advice at all) if you want to get better, and you’re underweight, you need to put on weight to stop the constant BP voices. When you’re in it that deep, it’s really hard to stop the constant ED chatter. Sometimes medication is a good temporary (or permanent) measure to pull you out of it and stop the mind racing. Don’t give up OP.",
          "created_utc": 1732752419.0
        },
        {
          "id": "lzbvpo2",
          "author": "unremarkable_sapien",
          "body": "I do see a psychiatrist and have tried basically every antidepressant and a ton of antipsychotics. Nothing takes away the urges. I did actually get to trial a stimulant (I have a tentative diagnosis of ADHD - psychiatrist thinks so but I need a formal evaluation). It did work to some extent, at least better than anything else I’ve tried. I’m too underweight now to get back on it but it’s definitely something that I want to try again in the future.\n\nI am very aware that a big contributor to my urges is the fact that I am malnourished and my brain is screaming out for sustenance. The problem is that every time I try a meal plan, or I try to keep food down, I just end up craving it even more. It’s like I’ve opened the gates and a single meal doesn’t satisfy me so I keep going and end up back in the b/p cycle. It’s so hard.",
          "created_utc": 1732752940.0
        }
      ]
    },
    {
      "id": "lzcv5jn",
      "author": "None",
      "body": "ugh i feel you so much.  it seems like as soon as I start eating, i just want to eat more and more.   this isn't a solution or easy fix but one that has helped me just a tad is avoiding the ultra processed foods.  i know its not that easy, especially if you live with others, they are there, just staring you in the face.  i try to stick with my \"safe\" meals, meals I know that wont send me off into lala binge land but even then, I have to have a plan for when I'm done eating my safe food b/c that too makes me want more.  I sometimes eat right right before I need to leave to go somewhere, or go right upstairs after eating.   it really takes a continuous effort to keep this monster away.  \n\n  \nI also think that my meals aren't big enough so thus the want to keep eating but if i make them too big and get full, that also sends me spiraling.  it's really hard to win.   I just keep telling myself this is going to take a huge effort, i can't just  hope one day this stops bc it won't if I think like that.",
      "created_utc": 1732766997.0,
      "score": 1,
      "context": [
        {
          "id": "lzaldns",
          "author": "None",
          "body": "I’m sorry you’re in this so deep OP. I hope for you to escape this. Is therapy or in patient an option for you?",
          "created_utc": 1732737318.0
        },
        {
          "id": "lzaoeoz",
          "author": "unremarkable_sapien",
          "body": "Thanks, I hope to escape this too some day. I’ve had about 8 years of therapy and countless inpatient stays. The urges are always too strong and I end up sneaking off to buy food, purging in secret, stealing food from the hospital kitchen, the list goes on. I become like a rabid animal when I can’t b/p and I’ll do anything to get my hands on some food. It’s very isolating being surrounded by people with restrictive anorexia. I look the part but I’m hiding this dirty secret.",
          "created_utc": 1732738282.0
        },
        {
          "id": "lzbuclc",
          "author": "None",
          "body": "Considering that you may have exhausted all other options, It might be worth seeing a psychiatrist for anti-psychotic, antidepressant or stimulant medication as you may have an underlying condition that is hindering you from moving forward like depression, anxiety, OCD, bipolar or ADHD etc etc (just a thought, I’m just throwing ideas out there…not offering medical advice at all) if you want to get better, and you’re underweight, you need to put on weight to stop the constant BP voices. When you’re in it that deep, it’s really hard to stop the constant ED chatter. Sometimes medication is a good temporary (or permanent) measure to pull you out of it and stop the mind racing. Don’t give up OP.",
          "created_utc": 1732752419.0
        },
        {
          "id": "lzbvpo2",
          "author": "unremarkable_sapien",
          "body": "I do see a psychiatrist and have tried basically every antidepressant and a ton of antipsychotics. Nothing takes away the urges. I did actually get to trial a stimulant (I have a tentative diagnosis of ADHD - psychiatrist thinks so but I need a formal evaluation). It did work to some extent, at least better than anything else I’ve tried. I’m too underweight now to get back on it but it’s definitely something that I want to try again in the future.\n\nI am very aware that a big contributor to my urges is the fact that I am malnourished and my brain is screaming out for sustenance. The problem is that every time I try a meal plan, or I try to keep food down, I just end up craving it even more. It’s like I’ve opened the gates and a single meal doesn’t satisfy me so I keep going and end up back in the b/p cycle. It’s so hard.",
          "created_utc": 1732752940.0
        }
      ]
    }
  ]
}