{
  "id": "1hjc1aw",
  "subreddit": "bulimia",
  "author": "ziewanna",
  "created_utc": 1734794809.0,
  "title": "My little sister died recently, I now know she was purging and I'm afraid I've had a bad influence on her ",
  "selftext": "I love her so so so so much and I don't know what to do now, and I don't know how to live. I've struggled with eating disorders for about 7 years now, first it was anorexia (restricting subtype) and then bulimia (or anorexia b/p subtype as my therapist suggests, but that's not important). We lived together for most of that time and I know my disorderded eating must have impacted her too. We've been living seperately for about 3 years. She has mentioned it to me a few months ago that she has an eating disorder and it scared me so I wanted her to tell me about it, but she thought it would be too embarrassing. I suspected that she might be purging, but I didn't want to push her to tell me that, and so I gave her time to do so when she feels more comfortable. She was already in therapy and was seeing a psychiatrist who gave her antidepressants. She overdosed on those antidepressants and all other pills she could take and she died three weeks ago. I had too look through her phone to find some email addresses I needed to contact to tell them she's dead and I saw that she had her notes app opened on the phone, she made some notes from therapy there and they confirmed that she was actually purging and struggling with it a lot. I'm now angry at everyone around me, angry at her for not telling me she needed help and most of all angry at myself for letting that happen. I'm scared I was a bad influence on her with my awful eating habits even though I wanted to help her always as much as I could. I'm angry at mysel, because maybe she thought she couldn't rely on me because of that. And I could have helped, I would have tried, because I actually know what it feels like, she should know she musnt feel embarrassed in front of me. I don't know what to do anymore, I have no reason to even try now.",
  "url": "https://www.reddit.com/r/bulimia/comments/1hjc1aw/my_little_sister_died_recently_i_now_know_she_was/",
  "score": 124,
  "num_comments": 11,
  "comments": [
    {
      "id": "m35bo1k",
      "author": "iconicpistol",
      "body": "I'm so sorry darling 💔 You're not at fault here. Feeling angry and blaming yourself is a normal grief response; I felt the same way when my friend killed himself. But you're not the reason she died. You couldn't have known how much she was hurting inside. I'm sure you are a great sibling. I'm very sorry for your loss.",
      "created_utc": 1734795348.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m35czvh",
      "author": "Margaet_moon",
      "body": "Oh love. I am so sorry, loosing a sibling especially one you are close to is absolutely devastating and I’m so sorry. I am sending you so much love and prayer. \n\nBut listen, this is not in any way shape or form your fault. Anyone who has been ravaged with bulimia or any other ED really knows when we are in bulimia mode nothing anyone does or can do will help.  You gave her space when she requested it and sometimes all we can do is love them and kinda support from afar. As someone with bulimia I personally don’t want people helping and being in my personal space about You did everything right. x",
      "created_utc": 1734795829.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m35il63",
      "author": "Weekly_Variation253",
      "body": "i am so sorry for your loss. this is not your fault, please don’t carry the blame. your sister battled with mental illness. it’s like living with a physical illness- it’s no one’s fault yet so many people are hurt by it. i hope your sister is at peace now and that, with time, you find your own peace. please stay safe and take care of yourself.",
      "created_utc": 1734797809.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m36gzyz",
      "author": "Particular_Clock2354",
      "body": "I am so, so, so sorry. I know that nothing that anybody can ever say to you will ever take away your grief and guilt. But please, please remember this is NOT your fault. and it will NEVER be your fault. You have to imagine that if the roles were switched and you were the one in that casket whether or not she influenced you, you would forgive her and never want her to feel guilty. shes your sister, she loved you so so much and she wouldnt want you to feel this way. I know you must want to not talk to anyone, but please please talk to somebody. You can even talk to me. Please just shoot me a DM i’ll be here to try to help if what you need is anonymity. if you let yourself keep digging this hole you’ll never get out of it, let this be the end of what was and the start of a beginning. i wish you the best and may your sister rest in peace. 🤍🤍🤍",
      "created_utc": 1734809673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4gw5ib",
      "author": "MongooseBeginning447",
      "body": "First of all, I am so, so sorry for your loss! You mustn’t blame yourself. Her eating disorder is not because of you. Many times disordered eating is part of various mental health disorders that are genetic. I’m reading tonight because my son has recently battling with extreme binging and purging. I am praying that a telehealth psych appointment will prescribe Vyvanse and Lamictal to help control the binges. Prior he was eating an extremely clean diet of body building meal prep. Many things trigger the eating disorders and the depression can take a terrible toll. My son has had suicidal moments in this last 2 months and has ADHD and possibly bipolar disorder. ED’s are very common with both. My prayers for you and your family! Please don’t blame yourself and please don’t ever give up. She wouldn’t want that for you.",
      "created_utc": 1735530308.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m367dum",
      "author": "No-Action578",
      "body": "Im so sorry for your loss:( feeling like your disorder is weighing on your loved ones and even \" seeing\" signs that may lead u to this conclusion is such a heavy burden to carry and live with, and in your case you have reached the highest level of tolerating this. However, please read the other replies what everyone is saying resonated so well with my takes on this too. Im praying you find ease amongst your sorrows and safe comfort in the upcoming times, this illness is beyond words i am sending you a tight hug",
      "created_utc": 1734806401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m37f2np",
      "author": "black-coffee-skinny",
      "body": "Absolutely not your fault. I had the same worries with my younger brother. It turned out, as it often does, that he had been led down that path by the same factors that led me down it too. The only difference for us was that he got help first and inspired me to get the help too. Please don’t blame yourself for this.",
      "created_utc": 1734822164.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m38n37q",
      "author": "pancakes529",
      "body": "I can’t imagine having to lose a sibling. I’m so sorry, op. None of that was your fault x",
      "created_utc": 1734840899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m39apdj",
      "author": "Queenofwands1212",
      "body": "I’m so very sorry for your loss. Was it health complications directly linked to her ED? I’m so sorry you’re going through this. We’re all here for you. My inbox is open",
      "created_utc": 1734855190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3fg98k",
      "author": "Aivellac",
      "body": "A lot goes into these sorts of problems and decisions, you aren't responsible.",
      "created_utc": 1734957547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3d13gh",
      "author": "ziewanna",
      "body": "No, it wasn't directly linked, she did it herself. I think it was very impulsive, not something she has thought out and planned to do that day, and I think ED related stress and hopelessness could also play a role in that. I will never know for sure. Still, I feel awful that she also went through this and never really told me.",
      "created_utc": 1734911913.0,
      "score": 1,
      "context": [
        {
          "id": "m39apdj",
          "author": "Queenofwands1212",
          "body": "I’m so very sorry for your loss. Was it health complications directly linked to her ED? I’m so sorry you’re going through this. We’re all here for you. My inbox is open",
          "created_utc": 1734855190.0
        }
      ]
    }
  ]
}