{
  "id": "1iglc9y",
  "subreddit": "bulimia",
  "author": "ABoyNamedMary",
  "created_utc": 1738575039.0,
  "title": "Feeling a disconnect between normal people's food portions and mine",
  "selftext": "Whenever I see photos people post online of their food, especially food they cooked themselves, I can't help but think that it's such a tiny amount of food that wouldn't satisfy anyone. Earlier I saw a photo of a plate of pasta and wondered how that would fill anyone up, and thought about how if I made that meal, I wouldn't be able to stop myself from making 4 times as much plus garlic bread and dessert, knowing full well it's all going in the toilet the moment I'm done eating.\n\n But seeing photos like that makes me feel like getting better is impossible because I'll never have that much self control to eat those pitiful portions of pasta, or eat 1 burger and a smattering of french fries, and then just move on with my day.. And those look like average socially accepted portions of food too. No amount of food is enough for me. I'm so cooked fr fr :(",
  "url": "https://www.reddit.com/r/bulimia/comments/1iglc9y/feeling_a_disconnect_between_normal_peoples_food/",
  "score": 67,
  "num_comments": 7,
  "comments": [
    {
      "id": "mapn155",
      "author": "Queenofwands1212",
      "body": "I relate so fuckinf hard, I am an anorexic volume eater with purging. I need to eat volume amounts of food to feel full, and then I feel too full and purge. But if I were to eat a small portion of food I would still be hungry. I am UW and utterly malnourished so I feel like the volume rating goes along with that but I am also addicted to eating volume amounts of my safe foods. I don’t understand how people can eat such small portions either. It blows my mind and it makes me feel like a monster and so much shame and guilt with how much I eat.",
      "created_utc": 1738575494.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mapn376",
      "author": "unremarkable_sapien",
      "body": "Uhhh I feel this so much. The thought of spending the rest of my life feeling like I have to restrict myself to “normal” portions just fills me with dread.",
      "created_utc": 1738575529.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mapr7t5",
      "author": "None",
      "body": "Wow, I relate to this so much. I always try to restrict my portions to make them look “normal,” but honestly, I could easily eat three times that amount. I know it sounds kinda pick me to say I eat more than my friends, but it’s true. If I actually ate as much as I wanted, I could probably keep up with any guy.\n\nThe worst part is that it never feels like enough. I know that if I let myself eat freely, it would just turn into a binge, because my brain goes, screw it, you’re already eating too much, might as well go all in and purge later. It’s a horrible cycle, and it feels impossible to break.",
      "created_utc": 1738578079.0,
      "score": 13,
      "context": []
    },
    {
      "id": "maq5cta",
      "author": "NarcoticGreen",
      "body": "I wondered and worried about this as well until I realized, that they are satisfied with these \"normal\" portions because they never starved or restricted / purged / messed up their food and hunger perception. There is no scarcity mindset. \n\nRationally, when a person overeats on day one, they tend to automatically eat a bit less the next day. This is not necessarily the case for people with EDs. \nImagine placing a starving puppy in front of a bowl of food. You can’t expect it to eat a \"normal acceptable\" portion of food and move on with it’s day. It will eat as much as it can, because it doesn’t know when there will be food available next time. Restriction and deprivation mess with your hunger HARD. \n\nAdding to this, you never or rarely see the full picture, especially on social media. Maybe they are more satisfied with a smaller portion because they ate plenty for breakfast? Maybe they ate enough the day before so they are less hungry? Perhaps they raided their entire fridge afterwards. You never know.\n \"Normal people\" typically don’t have issues with food - people with EDs do. So ofc we have different requirements and standards regarding food. And that’s okay.",
      "created_utc": 1738585695.0,
      "score": 7,
      "context": []
    },
    {
      "id": "maqj1fa",
      "author": "neverblameJ",
      "body": "I feel the exact same way! Volume eating helps me tbh.",
      "created_utc": 1738591133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "maroo5y",
      "author": "funkyfoodiebutnot",
      "body": "you have put it into words so well. i don’t think i could ever just sit down, eat a burger snd 5 fries and go on with the next part of my day feeling fulfilled. to stop feeling hunger i have to be popping at the seams ready to blow. it would be in my mind all day that i didn’t have enough, but it would irk me that i had something that small. if im going to eat i might as well eat eat.",
      "created_utc": 1738603683.0,
      "score": 8,
      "context": [
        {
          "id": "mapn155",
          "author": "Queenofwands1212",
          "body": "I relate so fuckinf hard, I am an anorexic volume eater with purging. I need to eat volume amounts of food to feel full, and then I feel too full and purge. But if I were to eat a small portion of food I would still be hungry. I am UW and utterly malnourished so I feel like the volume rating goes along with that but I am also addicted to eating volume amounts of my safe foods. I don’t understand how people can eat such small portions either. It blows my mind and it makes me feel like a monster and so much shame and guilt with how much I eat.",
          "created_utc": 1738575494.0
        }
      ]
    },
    {
      "id": "mat3mrh",
      "author": "MilliMilie",
      "body": "Exactly what I feel, just exercising instead of purging. It’s so exhausting to do the same thing all over again. Eat > guilt > get it “out” > feel okay~ repeat🥲 I’m so tired of this",
      "created_utc": 1738617794.0,
      "score": 1,
      "context": [
        {
          "id": "mapn155",
          "author": "Queenofwands1212",
          "body": "I relate so fuckinf hard, I am an anorexic volume eater with purging. I need to eat volume amounts of food to feel full, and then I feel too full and purge. But if I were to eat a small portion of food I would still be hungry. I am UW and utterly malnourished so I feel like the volume rating goes along with that but I am also addicted to eating volume amounts of my safe foods. I don’t understand how people can eat such small portions either. It blows my mind and it makes me feel like a monster and so much shame and guilt with how much I eat.",
          "created_utc": 1738575494.0
        }
      ]
    }
  ]
}