{
  "id": "1ikh2bf",
  "subreddit": "bulimia",
  "author": "Unknown__Weirdo",
  "created_utc": 1738996336.0,
  "title": "8 y/o me would never imagine I would be pulling vomit out of the toilet at 1am",
  "selftext": "After a ~10 hour binge, I felt so sick that I was about to throw up without touching my throat. (Usually it's very hard for me to vomit) I went to the toilet and purged so much and the toilet clogged. After 15-30 of trying to unclog it, the water got to the top and vomit water spilt all over the floor. This is at 1am mind you. My two siblings and parents are sleeping rkght now. I tried a plunger and snake but neither worked. I ended up scooping the water into the tub, cup by cup. When that was almost done, I stuck my hand in the brown water and pulled the paper towels out. (Yes I know very dumb on my part; we are out of toilet paper) This what such a miserable expiernece and I am so ashamed of myself. While I wish I dcould say this was a wake-up call, and I've been trying recover, I am losing hope",
  "url": "https://www.reddit.com/r/bulimia/comments/1ikh2bf/8_yo_me_would_never_imagine_i_would_be_pulling/",
  "score": 75,
  "num_comments": 7,
  "comments": [
    {
      "id": "mbmlbws",
      "author": "throwawayiguess532",
      "body": "im so sorry this is genuinely so stress inducing for anyone suffering w bulimia. please take care, rest, hope you feel better soon🫂",
      "created_utc": 1739001721.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mbmm1qk",
      "author": "ryiots",
      "body": "Im so sorry, bulimia is miserable. The shame you feel for b/p, feeling disgusting, the intense anxiety, shame and guilt, its all too real. Recovery isn't linear, it's scary and really hard, and trying, STARTING recovery is the one of the hardest hurdles to overcome. I'm proud of you for trying, and it doesn't mean you failed. please be kind to yourself, rest and drink water ❤️",
      "created_utc": 1739002131.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mbmn2eg",
      "author": "chicken_waffling",
      "body": "I’m so sorry, but also I laughed at this. I hope you can also laugh at this in the future. It’s such a weird disorder we have that makes us do these unhinged things!! I’ve never had exactly your scenario happen, but I kinda chuckle to myself every time I get splashed in the eyeball by puke or other vomit mishaps. Then I imagine laughing and making fun of myself to friends, then I’m like oh wait… no one can ever know about this… 🙃\n\nAlso you sound way too young to have seen Trainspotting (cult 90s movie) but there’s an iconic scene really similar to this but so, sooo much worse (the movie is about heroin addicts) \n\nAnyway hope that’s not taken in any way negative. Better luck tomorrow!",
      "created_utc": 1739002719.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mbq1gsq",
      "author": "Fuzzy-Condition-8919",
      "body": "I have been there. I had to scoop old rotten vomit out of my sinks pipes that had gotten severely backed up a few years ago. It felt horrible and degrading. Just know u aren’t alone and can get better. You aren’t too far gone. Back then when I was in the situation it felt like I would always be like that but now I’m almost completely recovered. I wish you the best!!",
      "created_utc": 1739048155.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mbxxepg",
      "author": "Prestigious_Care_886",
      "body": "This happened to me but in my bathtub and it was one of the most stressful moments of my life. I’m sorry you had to go through this too and good luck 💕",
      "created_utc": 1739150724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mcmgk3p",
      "author": "Perfect_Reaction8455",
      "body": "Been there done that, you aren’t alone sweetie. I have so many stories that would make you feel better. When I was in treatment I used to throw up in our group puzzle boxes… now that is hard to cover up ",
      "created_utc": 1739482746.0,
      "score": 2,
      "context": []
    }
  ]
}