{
  "id": "1ikk82s",
  "subreddit": "bulimia",
  "author": "dogfannr1",
  "created_utc": 1739009616.0,
  "title": "i have no hobbies besides my disorder",
  "selftext": "I feel like all my passion for things that make me happy is gone. \nI used to love art and drawing but if someone asked me now what I do for fun or what my hobbies are, all I could think of is the fact that I eat & throw up all day everyday. Theres no time left for fun in my life... This is all I have at this point.",
  "url": "https://www.reddit.com/r/bulimia/comments/1ikk82s/i_have_no_hobbies_besides_my_disorder/",
  "score": 87,
  "num_comments": 8,
  "comments": [
    {
      "id": "mbnarc1",
      "author": "Any_Lingonberry9967",
      "body": "Sameee. Nothing feels happier than this",
      "created_utc": 1739016626.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mbmzyci",
      "author": "HelicopterMotor5449",
      "body": "Although I have a demanding job along with like 3 hobbies and it still isn’t enough of a distraction from the illness. I was doing so well until I slipped recently and I realized that no matter how many hobbies I have it’ll never get rid of it :/",
      "created_utc": 1739010435.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mbro9fv",
      "author": "throupandaway",
      "body": "“maybe I’ll quit having an eating disorder and train for a bikini competition”",
      "created_utc": 1739067453.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mbrdl0n",
      "author": "Harmonyinheart",
      "body": "I get it completely. Reading was my number one. I have thousands of books. But the last few months I haven’t even been able to read when I used to average three books a week, about 1,000 pages a week. And my bulimic side has been out of control for a few months now. And tho I’m uw but my blood levels are deemed to be fine “for me” quote my doc they are all out of range mostly. I think my brain is slowly being eaten. I can’t concentrate can’t find words and rarely find enjoyment. Not even food excites me now. So I b and p trying to maximize anything to give me a “bump up” if you will. I’m sorry I don’t have good advice.  Recovering from our Ed’s may be the only way. Will be think in g of you",
      "created_utc": 1739063696.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbrl76m",
      "author": "aliceangelbb",
      "body": "Yea tbf from my understanding EDs often take away any sort of passion or hobbies",
      "created_utc": 1739066362.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbsn3e1",
      "author": "None",
      "body": "the holidays threw me off so hard. i was clean for 6 days last week and slipped last night. it’s so disheartening so i feel u.. i try to distract myself in any way i can but it doesn’t ever seem to work when i get the urge",
      "created_utc": 1739081791.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mccjxau",
      "author": "PotentialJury7148",
      "body": "i fear im the same",
      "created_utc": 1739359154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbzg283",
      "author": "Weary-Bus8436",
      "body": "Everything takes time, dont give up ❤️❤️",
      "created_utc": 1739174320.0,
      "score": 3,
      "context": [
        {
          "id": "mbmzyci",
          "author": "HelicopterMotor5449",
          "body": "Although I have a demanding job along with like 3 hobbies and it still isn’t enough of a distraction from the illness. I was doing so well until I slipped recently and I realized that no matter how many hobbies I have it’ll never get rid of it :/",
          "created_utc": 1739010435.0
        }
      ]
    }
  ]
}