{
  "id": "1is0669",
  "subreddit": "bulimia",
  "author": "nomattress",
  "created_utc": 1739840194.0,
  "title": "the longer I have bulimia, the more I realise that nobody knows what bulimia actually is.",
  "selftext": "other than other bulimics, of course.\n\nthis is gonna be a kind of long and incoherent ramble. I just want to put this thought into words.\n\nbefore I developed bulimia, I had the same harmful idea in my head that the rest of the world has - a skinny, sick-looking person who throws up every time they eat because they want to lose weight.\n\nI believed that bulimics are wasting food. I believed that bulimics have full control over the decision to throw up their food. I believed that bulimics were totally fine health-wise and didn't get dizzy or tired from it. I had no idea there were so many health complications involved, I thought the only health issues would just be from weight loss. \n\nthen I developed bulimia in the form of, surprise-surprise, throwing up most of what I ate. however, due to a prior habit of binge-eating weekly and usually feeling guilty after, I started throwing up my binges too. so basically I was now binging and purging  I began getting too drained from the b/p to throw up the normal meals I'd eat in the day, so I'd starve myself and just purge my binges, and the timeline goes on with my condition developing into the more and more nuanced, chaotic, back-and-forth-pendulum of bulimia that a lot of people who are actually bulimic know all too well about.\n\nI got worse, but none of it was surprising, since I had researched bulimia after realising I had it and just saw it as \"oh, yeah, I read about this symptom. oh, I read someone's experience about losing control over their eating completely but then restricting other times and never being free from the b/p cycle. I read that most bulimics are average weight or slightly overweight. I learned that my body will become severely dehydrated after a purge. I knew that a lot of bulimics do eat normally besides their b/p\". i also developed other methods of purging, such as excessive exercise, restriction and chewing+spitting. I knew about them for my research, so it just felt like a natural \"yeah, I'm bulimic, this is just a normal bulimic thing to do\".\n\nit only occurred to me recently that if I hadn't been bulimic at all, I wouldn't even know that this is the true nature of bulimia: an addiction of BINGING and then purging, the binging being uncontrollable, and the purging taking many forms, overall leading to a severely damaged body and mind.\n\nI realised this because of something my dad said. we were talking about my sister's weight loss - it's due to a lack of appetite making her eat significantly less and therefore lose weight, but it's not anorexia in her case since she doesn't even care about weight, it's a physical thing. I know this, she's said this, she's telling the truth, but my dad is convinced she's anorexic. me and him were discussing it and then he said \"I think it's bulimia, because I've been noticing traces of what looks like vomit around the toilet seat\".\n\nobviously this was a weird moment for me; I'm the bulimic one, not her, and at the time I just changed the subject and said nothing on the matter to avoid 1. 'framing' her or 2. giving myself away.\n\nanyway, that conversation made me realise, my dad has that same notion that I used to have. he thinks bulimia is throwing up all your food and getting skinny because of it. he doesn't know about binge eating and other methods of purging and all the other side effects like Russell's sign, dehydration, extreme fatigue and puffy cheeks (all of which I have, very obviously in fact, which he somehow hasn't noticed). he doesn't know about the true nature of bulimia - nor does the rest of the world.\n\nthe same applies to several of my friends. when I've opened up about bulimia, their advice has never been helpful, because they simply don't know what bulimia even is.\n\none friend who was a recovered anorexic thought I was simply throwing up every meal to lose weight - they gave me advice on keeping meals down, avoiding skipping meals, not feeling guilty, etc. they didn't know I was addicted to the binging aspect, not just self conscious about my body.\n\nanother friend had never had an eating disorder. she was telling me that I could binge on healthier foods to avoid the guilt and not purge them - she didn't realise that cravings for specific foods were all consuming and intense. she thought I would purge ANY meal at all; we went out for dinner once and she slept round after too, and thought so strongly that I would purge everything that she stood outside the bathroom while I was peeing to make sure I wouldn't purge, even though I explained that I could never purge a nice restaurant dinner, especially when she was literally in my house with me. a lot of bulimics still eat food and keep it down, not all of us purge everything, but how could she believe me for saying that when she only has the ideas that everyone else has about it?\n\nit's just frustrating, you know? my condition, even if I open up about it, will always be misunderstood by non bulimics. they don't understand the addictive, draining, destructive nature of it. they just think it's \"that eating disorder that means you throw up and get skinny\". bulimia is NOTHING like that. and I'm realising that *that's* why I'm so reluctant to open up about having it. I don't want my parents to think I'm just \"wasting\" food, or choosing to waste all my time and money on stuffing my face like a pig with no self control, or that throwing up comes easily and naturally with zero damage to my body. they would treat me with disrespect, because they don't know anything about how bulimia functions, and nor does anyone else.",
  "url": "https://www.reddit.com/r/bulimia/comments/1is0669/the_longer_i_have_bulimia_the_more_i_realise_that/",
  "score": 335,
  "num_comments": 24,
  "comments": [
    {
      "id": "mdcqw7t",
      "author": "MelodyMuse24xo",
      "body": "Thank you **so** much for posting this, it's very real and relatable. You're not alone in that desperation & frustration. I agree with every point made! 💯 \nHoping one day there will be true public awareness as to the reality of what we struggle with on a daily basis.",
      "created_utc": 1739841672.0,
      "score": 49,
      "context": []
    },
    {
      "id": "mddw2k5",
      "author": "Equivalent-Ad-6877",
      "body": "The CRAVINGS. i thought i was just crazy.",
      "created_utc": 1739857501.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mddcsys",
      "author": "Key_Significance_179",
      "body": "you worded this so perfectly. this common view has even negatively affected the way I've received treatment. no matter how much I explain that BINGING and purging is my main issue; I get disregarded and told to \"eat enough\" so that I \"don't get too hungry and make [myself] sick\". ive even been told that \"most anorexics\" think that they're binging when they're actually just eating a normal amount of food. I DONT EVEN HAVE ANA ANYMORE!! I can assure you my binges are BINGES!!",
      "created_utc": 1739849335.0,
      "score": 45,
      "context": []
    },
    {
      "id": "mddov67",
      "author": "Stranger-Little",
      "body": "100%. I am a nurse and opened up to one of the doctors i work closely with about my history and how i gained weight in college because of the cycle and she said “that’s so weird you gained weight. usually bulimics are skinny. you did the opposite” granted it wasn’t a psychologist or ED specialist but an anesthesiologist. just goes to show anyone can have the wrong information.",
      "created_utc": 1739854182.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mdeh2jh",
      "author": "None",
      "body": "This is why its important to note the differences between the eds and give them fair representation becuase the “bulimia” most people imagine when they arent disordered is Anorexia binge purge subtype which is inherently different at the base of things",
      "created_utc": 1739869350.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mdewo42",
      "author": "KukaVex",
      "body": "You're absolutely right. I've been bulimic since 14, I'm 29 now. But I remember finding out a friend had bulimia before, and laughing about it like dumb kids do. But now it's me I know, it truly is such an insidious disease, draining you from within. I have to have regular blood tests to check my levels because when my bulimia is at its worst I start having heart problems, because the act of being sick puts your electrolytes into imbalance. Mouth ulcers, sore throat and sores on your hand. Timing food to when you'll have a private bathroom, judgement from significant others or family. \n\nIt really is a special kind of hell. But it's one we have to bear, and having the right support is really important. I've got a fabulous GP who's helping me, and a couple of friends. It's the kind of illness that revels in secrecy, you've got to bite the bullet sometimes and try to make people understand.",
      "created_utc": 1739878572.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mdj99nd",
      "author": "ann3h2529",
      "body": "Recovered bulimic here—I think no one can truly grasp the absolute chaos of it without experiencing it themselves, but I’ve found the best thing to compare it to is OCD (the compulsory behaviors) when talking with people that don’t really get it",
      "created_utc": 1739927191.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mdfokcz",
      "author": "Realistic-Shallot288",
      "body": "100%, and the worst for me is that even doctors misunderstand it. Most of the 15+ professionals I have seen were completely missing the point, and that for me is the most desperate part of my disorder because it means that nobody can help me (or I’ll have to keep seeking for THE good doctor who gets it all and I’m seriously tired at that point.)",
      "created_utc": 1739889729.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mdeho3c",
      "author": "AphroditeMoon23",
      "body": "Someone I love and care about has this; thank you for helping me understand them better. I’m familiar with anorexia, but I didn’t understand the “cycle” part of their addiction. 👍❤️",
      "created_utc": 1739869721.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mdlihbl",
      "author": "o0SinnQueen0o",
      "body": "After a while it stopped being about my weight. Now b/p is like the thing that I do every day for fun because I hate myself. Honestly it's no longer even an uncontrollable binge anymore. I go out to buy food with the purpose of eating all of it and throwing up and then when I get home I do it. It became a part of my routine.",
      "created_utc": 1739964429.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mdj2mqo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1739925066.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mdlhgtm",
      "author": "o0SinnQueen0o",
      "body": "Shout out to that one hospital that treated all EDs like anorexia, which meant that they were overfeeding BED sufferers and bulimics and then we're surprised when everyone was getting worse.",
      "created_utc": 1739963891.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdq0dau",
      "author": "i-need-friends15",
      "body": "I either eat nothing at all or binge then purge there is no in between.",
      "created_utc": 1740013290.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxzmgxh",
      "author": "curvipossum",
      "body": "Thank you for this. My partner struggles with bulimia, something that I know I do not understand in the slightest but I am doing my best to be a good girlfriend",
      "created_utc": 1750028775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n09vepr",
      "author": "Broad_Alternative214",
      "body": "thank you for this. i feel so understood",
      "created_utc": 1751132276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms6tos3",
      "author": "whatthefudgeever",
      "body": "valid take but ima just say..... as a seasoned MIA👆👉 lol I throw up expensive meals and afterward literally say \"I'm sorry\" into the toilet. Mostly I'm never the one paying. But sometimes I am LOL. And I stilllll fucking do it. this is a really shitty ED",
      "created_utc": 1747182956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "memn1rs",
      "author": "Daring-Mango11",
      "body": "Omg yess, i feel like when I tell people, they're first pieces of advice are, \"you need food to live...don't forget to eat..don't feel bad.\" Babe, binging on food is *killing* is me.",
      "created_utc": 1740448130.0,
      "score": 4,
      "context": [
        {
          "id": "mddcsys",
          "author": "Key_Significance_179",
          "body": "you worded this so perfectly. this common view has even negatively affected the way I've received treatment. no matter how much I explain that BINGING and purging is my main issue; I get disregarded and told to \"eat enough\" so that I \"don't get too hungry and make [myself] sick\". ive even been told that \"most anorexics\" think that they're binging when they're actually just eating a normal amount of food. I DONT EVEN HAVE ANA ANYMORE!! I can assure you my binges are BINGES!!",
          "created_utc": 1739849335.0
        }
      ]
    },
    {
      "id": "n1rmonh",
      "author": "Empty-Dirt3208",
      "body": "this!!! I tried eating “normally” (regular meals, normal portion sizes…), but i was still binging. to avoid weight gain i purged since i knew i couldn’t compensate by skipping meals… it’s so twisted",
      "created_utc": 1751870834.0,
      "score": 2,
      "context": [
        {
          "id": "mddcsys",
          "author": "Key_Significance_179",
          "body": "you worded this so perfectly. this common view has even negatively affected the way I've received treatment. no matter how much I explain that BINGING and purging is my main issue; I get disregarded and told to \"eat enough\" so that I \"don't get too hungry and make [myself] sick\". ive even been told that \"most anorexics\" think that they're binging when they're actually just eating a normal amount of food. I DONT EVEN HAVE ANA ANYMORE!! I can assure you my binges are BINGES!!",
          "created_utc": 1739849335.0
        }
      ]
    },
    {
      "id": "mdla532",
      "author": "Old-Squirrel290",
      "body": "Listen, I’ve been diagnosed with severe anxiety and depression and mild ocd, now, I’ve had an ed for years, but I never thought about ocd influencing b/p cycles, that the obsession with something, all consuming, you can’t think about anything else but THAT, which could manifest as binging, and then that urge to control and fix and pattern and organise as purging. Your comment made me THINK",
      "created_utc": 1739959690.0,
      "score": 9,
      "context": [
        {
          "id": "mdj99nd",
          "author": "ann3h2529",
          "body": "Recovered bulimic here—I think no one can truly grasp the absolute chaos of it without experiencing it themselves, but I’ve found the best thing to compare it to is OCD (the compulsory behaviors) when talking with people that don’t really get it",
          "created_utc": 1739927191.0
        }
      ]
    },
    {
      "id": "mdeiouh",
      "author": "nomattress",
      "body": "it's worth doing a little more research! just reading people's stories on here is helpful to find out how it works in a real person's head. I'm sure your loved one will feel seen and supported, and have a less stressful time reckvering. ❤️",
      "created_utc": 1739870352.0,
      "score": 7,
      "context": [
        {
          "id": "mdeho3c",
          "author": "AphroditeMoon23",
          "body": "Someone I love and care about has this; thank you for helping me understand them better. I’m familiar with anorexia, but I didn’t understand the “cycle” part of their addiction. 👍❤️",
          "created_utc": 1739869721.0
        }
      ]
    },
    {
      "id": "mdq081u",
      "author": "i-need-friends15",
      "body": "I do this too.",
      "created_utc": 1740013242.0,
      "score": 3,
      "context": [
        {
          "id": "mdlihbl",
          "author": "o0SinnQueen0o",
          "body": "After a while it stopped being about my weight. Now b/p is like the thing that I do every day for fun because I hate myself. Honestly it's no longer even an uncontrollable binge anymore. I go out to buy food with the purpose of eating all of it and throwing up and then when I get home I do it. It became a part of my routine.",
          "created_utc": 1739964429.0
        }
      ]
    },
    {
      "id": "mdkvvjq",
      "author": "nomattress",
      "body": "that's possibly also bulimia, it's not a monolith just like anorexia isn't. personally I'm addicted to the binging. it's so strong that sometimes eating is all I can think about and I can't tear myself away from the kitchen until I run out of things to eat. I hate purging but I'm compelled to do it once I get full enough. I think it's cause of how it develops or how long you have it that affects its severity. when I first became bulimic I could go a week without binging and be just fine; now it's a struggle to not binge every second of my life.",
      "created_utc": 1739951113.0,
      "score": 2,
      "context": [
        {
          "id": "mdj2mqo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739925066.0
        }
      ]
    },
    {
      "id": "mdng86o",
      "author": "ann3h2529",
      "body": "I’m glad I could help you see a connection! I can’t take credit though—I read wasted when I was like 18 and she made a throwaway comment about her disorder manifesting in a similar way to OCD in the footnotes. I don’t love that book but I thought that was really poignant/a good way to help people understand the BP urge.",
      "created_utc": 1739987315.0,
      "score": 4,
      "context": [
        {
          "id": "mdj99nd",
          "author": "ann3h2529",
          "body": "Recovered bulimic here—I think no one can truly grasp the absolute chaos of it without experiencing it themselves, but I’ve found the best thing to compare it to is OCD (the compulsory behaviors) when talking with people that don’t really get it",
          "created_utc": 1739927191.0
        },
        {
          "id": "mdla532",
          "author": "Old-Squirrel290",
          "body": "Listen, I’ve been diagnosed with severe anxiety and depression and mild ocd, now, I’ve had an ed for years, but I never thought about ocd influencing b/p cycles, that the obsession with something, all consuming, you can’t think about anything else but THAT, which could manifest as binging, and then that urge to control and fix and pattern and organise as purging. Your comment made me THINK",
          "created_utc": 1739959690.0
        }
      ]
    }
  ]
}