{
  "id": "1jd5i34",
  "subreddit": "bulimia",
  "author": "Expensive-Conflict26",
  "created_utc": 1742189389.0,
  "title": "This shit is making me so broke",
  "selftext": "I used to be so careful with my money. I was great at saving and RARELY treated myself.\n\nNow I spend all my money on food and I live with my mom (who recently found out about my ED) so she notices when food disappears and it’s so embarrassing having to make something up every time because she probably doesn’t believe me.\n\nI’m not ready to recover at all but I don’t know what to do. I don’t have a car so I can’t drive to the stores who have good deals. \n\nThe closest store happens to be the most expensive one in my town as well… 2025 is such a shit year already",
  "url": "https://www.reddit.com/r/bulimia/comments/1jd5i34/this_shit_is_making_me_so_broke/",
  "score": 92,
  "num_comments": 14,
  "comments": [
    {
      "id": "mi7u27s",
      "author": "DeviceLazy1193",
      "body": "real af. nothing to add, just wanted to say ur not alone",
      "created_utc": 1742191001.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mi7xijj",
      "author": "Local-Regret7831",
      "body": "Same. I started doing bad jobs to have money and I hate it. It’s ruining my life. But the more you make, the more you start to spend.",
      "created_utc": 1742193101.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mibjv45",
      "author": "yourfavouritelola",
      "body": "Fr fr ive spent a large majority of my student loan on B/P food (like £600 a month) and have had to work multiple jobs to pay my rent meaning i dont actually have time for my lectures and seminars. its so tragic, id have thousands saved up by now but its all literally down the toilet. glad to know its not just me",
      "created_utc": 1742242926.0,
      "score": 11,
      "context": []
    },
    {
      "id": "miefhsq",
      "author": "Weary-Bus8436",
      "body": "You are definitely not alone. Every month I tell myself I’ll save, I’ll be careful with money, budget etc - end up b/ping it all away, along with all my energy and money, till I’ve got nothing for a good few weeks till I get paid again. It’s a repetitive cycle very similar to addiction - hell, it is an addiction. I wish I never started this. I can’t even imagine what being normal with food is.",
      "created_utc": 1742282698.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mid126j",
      "author": "funkyfoodiebutnot",
      "body": "This is me. All my life i have been so good at saving up and only spending when i need to or truly truly want something like clothes or books. I left school last year and got a part time job, and since then half of my wages go to food. 100£ a week ish on shit that ends up in the toilet. and i have no idea how to stop. i would have saved so much more if i didn’t have this.",
      "created_utc": 1742259766.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mi8031e",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1742194707.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mid3kbw",
      "author": "audreyswife",
      "body": "definitely, this is my main source of guilt from purging. when i used to only binge, i at least felt full for awhile after eating. i spent a lot of money on food, but i would actually eat it all and keep it down. now i just feel like im buying food to throw in the trash",
      "created_utc": 1742260645.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mieb5r1",
      "author": "prematurehooray",
      "body": "Real. I have had those 100€ / weekend binges in addition to everything else, and i have literally eated my savings.",
      "created_utc": 1742279893.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mifpp9u",
      "author": "danny_milk",
      "body": "I spent my student support on binging food, 1000€ down the drain. And I don't even feel good about it, I should since it was stuff I wanted, but instead I feel quilty about it.",
      "created_utc": 1742305827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mi9a0a2",
      "author": "unusualrotting",
      "body": "same, it literally feels like flushing money down the toilet 😩🥲 i easily spend at least 40$ a day on food",
      "created_utc": 1742218854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mimkf4q",
      "author": "lost-marbles69",
      "body": "I can totally relate. My dad died in a car accident and I was left with $71,000 at the peak of my ED. The money that I spent on my disorder makes me hate myself and feel like my dad would too.",
      "created_utc": 1742395602.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj6km71",
      "author": "ImportantAd2822",
      "body": "Guys get semaglutide online it will help w the binges !!!",
      "created_utc": 1742667030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjkcrip",
      "author": "Beneficial_Tap9787",
      "body": "I feel the same way, and tbh that’s one of the main reasons I wanna stop bc it’s just soooo expensive n I hate it",
      "created_utc": 1742858027.0,
      "score": 2,
      "context": []
    },
    {
      "id": "midmydc",
      "author": "HoldenCaulfield7",
      "body": "Which environment?",
      "created_utc": 1742267670.0,
      "score": 2,
      "context": [
        {
          "id": "mi8031e",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742194707.0
        }
      ]
    },
    {
      "id": "mieb73x",
      "author": "prematurehooray",
      "body": "YES! Exactly the same here.",
      "created_utc": 1742279917.0,
      "score": 2,
      "context": [
        {
          "id": "mid3kbw",
          "author": "audreyswife",
          "body": "definitely, this is my main source of guilt from purging. when i used to only binge, i at least felt full for awhile after eating. i spent a lot of money on food, but i would actually eat it all and keep it down. now i just feel like im buying food to throw in the trash",
          "created_utc": 1742260645.0
        }
      ]
    }
  ]
}