{
  "id": "1jhtiwc",
  "subreddit": "bulimia",
  "author": "LeylaBA",
  "created_utc": 1742713379.0,
  "title": "Bulimia should be treated like addiction - I am an addict",
  "selftext": "When an addict relapses, they shouldn’t be left alone. They should get frequent support until they are able to get back on track. I relapsed so badly. It hurt so much because I hate bread and have carbs. I was doing so well. My therapist has been indirectly pushing me away (towards independence). I wish bulimia had a sponsor system. \n",
  "url": "https://www.reddit.com/r/bulimia/comments/1jhtiwc/bulimia_should_be_treated_like_addiction_i_am_an/",
  "score": 242,
  "num_comments": 44,
  "comments": [
    {
      "id": "mja0sq4",
      "author": "FunkoSkunko",
      "body": "I ABSOLUTELY think that it functions in the brain like an addiction. They are both compulsive, self destructive behaviors that people do because we need an escape. And it's hard to recover, that urge is kind of always lurking.",
      "created_utc": 1742716184.0,
      "score": 111,
      "context": []
    },
    {
      "id": "mja8a8l",
      "author": "Longjumping_Laugh337",
      "body": "Yes absolutely. And it’s so hard to beat bc we can’t go without food but people don’t necessarily need drugs or alcohol",
      "created_utc": 1742720910.0,
      "score": 65,
      "context": []
    },
    {
      "id": "mjaqj0x",
      "author": "liefelijk",
      "body": "Yep, agreed. Few therapists specialize in bulimia, but many focus on overcoming addiction. When I was looking for a new therapist, I chose an addiction counselor and her methods were super helpful.",
      "created_utc": 1742731627.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mjavhvf",
      "author": "Ok_Animator6428",
      "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
      "created_utc": 1742733871.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mja3g9l",
      "author": "Queenofwands1212",
      "body": "This is why support and meetings and community is so important. Go to Ed recovery meetings, they’re all free. EDA, OA, anorexics bulimics anonymous. Also all the Ed orginzarions like MEDA, EDF, ANAD and alliance for Ed hold free zoom meetings everyday / week. Tons of them.",
      "created_utc": 1742717877.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mjavf2z",
      "author": "Cute-Cherry7323",
      "body": "I’ve mentioned this to my psychiatrist as well. It’s overwhelming and scary",
      "created_utc": 1742733837.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mjb7hc0",
      "author": "Pawsywawsy3",
      "body": "Totally. I was doing so well and I can’t even describe what came over me the other day. It was out of my control. I couldn’t stop it, couldn’t help it.",
      "created_utc": 1742738552.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjbbnkn",
      "author": "cott00n68",
      "body": "I agree. My therapist and psychiatrist said bulimia is not that serious so I relapsed.",
      "created_utc": 1742739981.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjc81u8",
      "author": "ilovecats-3000",
      "body": "I’ve struggled with bulimia since middle school, i’m in my 20s now and im still struggling and fighting the urges. It’s one of the hardest things i’ve gone through. It 100% feels like an addiction. Even when I want to stop or I know deep down I should stop (especially because i’ve experienced side effects from it), it’s like I can’t? My brain won’t let me? I’ve seen so many dr’s and have been admitted multiple times but sometimes I feel like it controls me :(",
      "created_utc": 1742750302.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mjb39kz",
      "author": "CocoaButterNice",
      "body": "Wholeheartedly agree",
      "created_utc": 1742737006.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjc54nd",
      "author": "SweetxKiss",
      "body": "I absolutely agree. I had to lock up all the food in my house because if I’m left alone with it I WILL b/p it. It’s not a matter of if, it’s when. As soon as the slightest bit of stress enters my life it’ll call to me. I use it to self soothe. I hate being around food unexpectedly (people deciding we need to go out to eat if I’m out, people at work bringing snacks, people offering food, etc.) because the self control vanishes. It’s the same as people who can’t say no when confronted with alcohol or weed or anything",
      "created_utc": 1742749406.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjdf2xx",
      "author": "frankincentss",
      "body": "I've thought about this so much too and I agree completely. A sponsor system would be cool to implement. I've been in a few ed centered anonymous meetings before and their structure is less, well structured than regular AA or NA meetings, which was disappointing to see. Considering how much support we need. I think we have a long way to go in how we approach treatments and how we go about re-shaping our perspectives on what bulimia really is but hopefully we'll get there or somewhere eventually.",
      "created_utc": 1742763542.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjfg8o6",
      "author": "RuthMaudeJameison",
      "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
      "created_utc": 1742790059.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjc17jc",
      "author": "061300",
      "body": "It is definitely an addiction in pretty much every sense of the term, but especially psychologically. Eating disorders in many cases are cognitively almost if not completely the same as other addictions. It always kills me that treatment for the two seems to be so different, when addiction treatment is proven to really help for a lot of people. Treating my own bulimia that way when trying to recover helped me so much more than anything else was.",
      "created_utc": 1742748200.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjc4r98",
      "author": "xSweetMiseryx",
      "body": "I went to a rehab where they include patients with eating disorders and childhood trauma as there’s such an overlap and common symptoms and thought patterns with substance addictions.  It changed my whole outlook. It really is very very similar.",
      "created_utc": 1742749292.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjcevqs",
      "author": "Normal_Grape9430",
      "body": "Yes finally someone who understands that it’s an addiction and not just something that you can automatically stop doing.",
      "created_utc": 1742752356.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjdg9ef",
      "author": "Key_Significance_179",
      "body": "this is so true! I feel like a sponsor system would've really helped me in early recovery. idk why there isn't something like that, already!",
      "created_utc": 1742763914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjdxuw0",
      "author": "LucidianQuill",
      "body": "I co pletely agree. I have been sober from purging for 8 years and fully in recovery from the b&p cycle for about four, minus a few relapses. But I still think if myself as bulimic, I will always want to be bulimic, because I will always want to relapse. Choosing not to is a recurring daily struggle.",
      "created_utc": 1742769663.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjfeb2r",
      "author": "Traditional_Use_4543",
      "body": "It's (EDs in gen.) actually categorized under addition in the DSM and is a absolutely a behavioral addiction (at the very least imo)",
      "created_utc": 1742789127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjg3epa",
      "author": "Recent_Asparagus7428",
      "body": "I am literally trying to replace my eating disorder with abusing drugs. Literally. \n\n\n\nAnd every time I don’t take them? I end up binging and purging.",
      "created_utc": 1742804214.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjeaaqo",
      "author": "lil_squib",
      "body": " Maybe try Anorexics and Bulimics anonymous? Or Eating Disorders Anonymous meetings?",
      "created_utc": 1742773795.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjesaq4",
      "author": "gomichan",
      "body": "I'm lucky I found a psychiatrist that does treat it like one - to the point where I was prescribed naltrexone to treat it. It's helped me a lot. I also have a sobriety counter on my phone to keep track of binging and purging",
      "created_utc": 1742780237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mji76e6",
      "author": "littleshrewpoo",
      "body": "Yes. I honestly think this is why over half of us do not respond well and are even made worse by traditional ED treatment. If it’s truly just a matter of insecurity, and developing better self love and habits, it is much easier to fix. The addiction aspect is chemical and often stems from a true chemical imbalance that often needs to be treated with meds, often healthy exercise, and/or severely moderating and for many at least temporarily eliminating processed/addictive foods and simply not being in situations that trigger an episode… The obsession never goes away unless you can truly clear your head and step away from that stuff and heal on a physical/mental/chemical level for a significant period of time.",
      "created_utc": 1742835163.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjimlc1",
      "author": "JumpyAd4465",
      "body": "It IS an addiction. Especially if you treat it as a way to get rid of calories you consumed. Every time I eat, I think, \"Should I just get rid of it?\" I hate that it's become this way, but it's like a safety net every time I overeat.",
      "created_utc": 1742839520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjii20e",
      "author": "dreamgrl_",
      "body": "well i saw this while being in relapse so its a sign i guess",
      "created_utc": 1742838238.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkg2u63",
      "author": "dogcatboyfriend",
      "body": "I totally agree that it’s definitely an addiction. I struggled with it for a good couple of years in my early 20s, then recovered somewhat but lately have been turning to alcohol and it’s slowly becoming a problem. I think my brain gets addicted easily",
      "created_utc": 1743295898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjbrsat",
      "author": "Squintz_ATB",
      "body": "I agree. I was addicted to heroin for about 10+ years (been off that stuff for about 10 years at this point in time though) and have been dealing with disordered eating for about 20 years. Not that either of them are *easy* to recover from, but eating disorders are just different.\n\nLike you're saying, once you get clean/sober from drugs or alcohol it can still be difficult at times but you don't *need* them to survive. I think about it like flipping it around. It'd be like telling a heroin addict \"ok, this is clearly fucking up your life in a lot of different ways but you also need it to live. You have to learn how to do *juuuuust the right amount* of heroin. Don't do it too much because that's really bad but you also can't stop consuming it because you will literally die.\"",
      "created_utc": 1742745220.0,
      "score": 47,
      "context": [
        {
          "id": "mja8a8l",
          "author": "Longjumping_Laugh337",
          "body": "Yes absolutely. And it’s so hard to beat bc we can’t go without food but people don’t necessarily need drugs or alcohol",
          "created_utc": 1742720910.0
        }
      ]
    },
    {
      "id": "mjbx847",
      "author": "Ok_Animator6428",
      "body": "Me too.  It is the right treatment!",
      "created_utc": 1742746945.0,
      "score": 3,
      "context": [
        {
          "id": "mjaqj0x",
          "author": "liefelijk",
          "body": "Yep, agreed. Few therapists specialize in bulimia, but many focus on overcoming addiction. When I was looking for a new therapist, I chose an addiction counselor and her methods were super helpful.",
          "created_utc": 1742731627.0
        }
      ]
    },
    {
      "id": "mjhlzso",
      "author": "insomniac_queen1",
      "body": "Brilliant idea, thank you",
      "created_utc": 1742828879.0,
      "score": 2,
      "context": [
        {
          "id": "mjaqj0x",
          "author": "liefelijk",
          "body": "Yep, agreed. Few therapists specialize in bulimia, but many focus on overcoming addiction. When I was looking for a new therapist, I chose an addiction counselor and her methods were super helpful.",
          "created_utc": 1742731627.0
        }
      ]
    },
    {
      "id": "mjc4z2x",
      "author": "Middle-Teaching5177",
      "body": "Same. On Ozempic. Day 57 B/P free.  I am training myself not to get triggered when I eat forbidden foods, and to be ok to consume a big meal without needing to purge.  It’s working. I have a history of eating disorders, heroin addiction, cocaine addiction, alcohol dependence and compulsive shopping. I guarantee all these behaviors hang out together in the same part of my brain, and the Ozempic is addressing it.",
      "created_utc": 1742749358.0,
      "score": 4,
      "context": [
        {
          "id": "mjavhvf",
          "author": "Ok_Animator6428",
          "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
          "created_utc": 1742733871.0
        }
      ]
    },
    {
      "id": "mjbzztb",
      "author": "Cute-Cherry7323",
      "body": "I did terzapatide for a month and it really cleared my mind and food noise. I looked for it on my own loved it. \nWas it recommended by your dr and do you think you’ll stay on it for a long time?",
      "created_utc": 1742747819.0,
      "score": 4,
      "context": [
        {
          "id": "mjavhvf",
          "author": "Ok_Animator6428",
          "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
          "created_utc": 1742733871.0
        }
      ]
    },
    {
      "id": "mjbs93t",
      "author": "Squintz_ATB",
      "body": "Absolutely. When I started getting clean I went to AA and NA meetings but I would also go to ABA meetings occasionally. I worked my steps in AA so I didn't feel it necessary to work them in all 3, but ABA was definitely beneficial for me.",
      "created_utc": 1742745367.0,
      "score": 6,
      "context": [
        {
          "id": "mja3g9l",
          "author": "Queenofwands1212",
          "body": "This is why support and meetings and community is so important. Go to Ed recovery meetings, they’re all free. EDA, OA, anorexics bulimics anonymous. Also all the Ed orginzarions like MEDA, EDF, ANAD and alliance for Ed hold free zoom meetings everyday / week. Tons of them.",
          "created_utc": 1742717877.0
        }
      ]
    },
    {
      "id": "mjgdnnu",
      "author": "LeylaBA",
      "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
      "created_utc": 1742810994.0,
      "score": 2,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        }
      ]
    },
    {
      "id": "mjg65fi",
      "author": "LeylaBA",
      "body": "Omg tell me why after purging for the first time in ages, I suddenly had the urge to smoke (haven’t smoked in years). Unfortunately picked up vaping and now I’m addicted and it’s only been 2 days",
      "created_utc": 1742806126.0,
      "score": 1,
      "context": [
        {
          "id": "mjg3epa",
          "author": "Recent_Asparagus7428",
          "body": "I am literally trying to replace my eating disorder with abusing drugs. Literally. \n\n\n\nAnd every time I don’t take them? I end up binging and purging.",
          "created_utc": 1742804214.0
        }
      ]
    },
    {
      "id": "mji7lip",
      "author": "LeylaBA",
      "body": "I smoked a vape once - I was addicted for months. Started again after a bulimia relapse, and now I can’t stop - trying to though",
      "created_utc": 1742835283.0,
      "score": 1,
      "context": [
        {
          "id": "mji76e6",
          "author": "littleshrewpoo",
          "body": "Yes. I honestly think this is why over half of us do not respond well and are even made worse by traditional ED treatment. If it’s truly just a matter of insecurity, and developing better self love and habits, it is much easier to fix. The addiction aspect is chemical and often stems from a true chemical imbalance that often needs to be treated with meds, often healthy exercise, and/or severely moderating and for many at least temporarily eliminating processed/addictive foods and simply not being in situations that trigger an episode… The obsession never goes away unless you can truly clear your head and step away from that stuff and heal on a physical/mental/chemical level for a significant period of time.",
          "created_utc": 1742835163.0
        }
      ]
    },
    {
      "id": "mjfozpe",
      "author": "carrotcakexpress",
      "body": "Yes this exactly what I say all the time about ED. We cannot just quit eating and work on recovery, we instead have to face our demons 3 times a day every freaking day for the rest of our lives.",
      "created_utc": 1742794819.0,
      "score": 11,
      "context": [
        {
          "id": "mja8a8l",
          "author": "Longjumping_Laugh337",
          "body": "Yes absolutely. And it’s so hard to beat bc we can’t go without food but people don’t necessarily need drugs or alcohol",
          "created_utc": 1742720910.0
        },
        {
          "id": "mjbrsat",
          "author": "Squintz_ATB",
          "body": "I agree. I was addicted to heroin for about 10+ years (been off that stuff for about 10 years at this point in time though) and have been dealing with disordered eating for about 20 years. Not that either of them are *easy* to recover from, but eating disorders are just different.\n\nLike you're saying, once you get clean/sober from drugs or alcohol it can still be difficult at times but you don't *need* them to survive. I think about it like flipping it around. It'd be like telling a heroin addict \"ok, this is clearly fucking up your life in a lot of different ways but you also need it to live. You have to learn how to do *juuuuust the right amount* of heroin. Don't do it too much because that's really bad but you also can't stop consuming it because you will literally die.\"",
          "created_utc": 1742745220.0
        }
      ]
    },
    {
      "id": "mjca8gw",
      "author": "Ok_Animator6428",
      "body": "I also eat trigger foods and it’s amazing — I can handle so much variety now — I even had theee short bread cookies the other day.  Nothing happened :).",
      "created_utc": 1742750961.0,
      "score": 5,
      "context": [
        {
          "id": "mjavhvf",
          "author": "Ok_Animator6428",
          "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
          "created_utc": 1742733871.0
        },
        {
          "id": "mjc4z2x",
          "author": "Middle-Teaching5177",
          "body": "Same. On Ozempic. Day 57 B/P free.  I am training myself not to get triggered when I eat forbidden foods, and to be ok to consume a big meal without needing to purge.  It’s working. I have a history of eating disorders, heroin addiction, cocaine addiction, alcohol dependence and compulsive shopping. I guarantee all these behaviors hang out together in the same part of my brain, and the Ozempic is addressing it.",
          "created_utc": 1742749358.0
        }
      ]
    },
    {
      "id": "mjc9f59",
      "author": "Ok_Animator6428",
      "body": "I am soooo happy for you.  And for us.  It is a miracle.  I’ve heard about it treating no end of addictions so you are right on target.  My therapist suggested I try it and I love her for it.  Some therapists would be very reluctant and I understand it completely.",
      "created_utc": 1742750716.0,
      "score": 3,
      "context": [
        {
          "id": "mjavhvf",
          "author": "Ok_Animator6428",
          "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
          "created_utc": 1742733871.0
        },
        {
          "id": "mjc4z2x",
          "author": "Middle-Teaching5177",
          "body": "Same. On Ozempic. Day 57 B/P free.  I am training myself not to get triggered when I eat forbidden foods, and to be ok to consume a big meal without needing to purge.  It’s working. I have a history of eating disorders, heroin addiction, cocaine addiction, alcohol dependence and compulsive shopping. I guarantee all these behaviors hang out together in the same part of my brain, and the Ozempic is addressing it.",
          "created_utc": 1742749358.0
        }
      ]
    },
    {
      "id": "mjc9vlf",
      "author": "Ok_Animator6428",
      "body": "Hey!  Yep, same drug basically.  I’m going to go to the lowest dose and stay on it as long as I need to.  And if that’s forever, that’s ok by me.  I lost weight I didn’t need to lose on the higher dose which is why I’m going down.",
      "created_utc": 1742750853.0,
      "score": 6,
      "context": [
        {
          "id": "mjavhvf",
          "author": "Ok_Animator6428",
          "body": "It’s an addiction.  I’m on day 94 binge and purge free and it is a miracle.  I found an addictions therapist, joined OA and started taking Semaglutide.",
          "created_utc": 1742733871.0
        },
        {
          "id": "mjbzztb",
          "author": "Cute-Cherry7323",
          "body": "I did terzapatide for a month and it really cleared my mind and food noise. I looked for it on my own loved it. \nWas it recommended by your dr and do you think you’ll stay on it for a long time?",
          "created_utc": 1742747819.0
        }
      ]
    },
    {
      "id": "mjgfkjx",
      "author": "RuthMaudeJameison",
      "body": "I feel like I’m chasing a high, you know? Purging gave me endorphins and that dopamine rush. Compulsively eating too. It’s hard to find the healthy things to get it, because that impulsivity is so strong! My meds help with a decent portion that. Slowing down my impulsive urges is one of area I’ve found them to be helpful.",
      "created_utc": 1742812136.0,
      "score": 1,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        },
        {
          "id": "mjgdnnu",
          "author": "LeylaBA",
          "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
          "created_utc": 1742810994.0
        }
      ]
    },
    {
      "id": "mjgfmc9",
      "author": "RuthMaudeJameison",
      "body": "Also helps me not to drink.",
      "created_utc": 1742812165.0,
      "score": 1,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        },
        {
          "id": "mjgdnnu",
          "author": "LeylaBA",
          "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
          "created_utc": 1742810994.0
        },
        {
          "id": "mjgfkjx",
          "author": "RuthMaudeJameison",
          "body": "I feel like I’m chasing a high, you know? Purging gave me endorphins and that dopamine rush. Compulsively eating too. It’s hard to find the healthy things to get it, because that impulsivity is so strong! My meds help with a decent portion that. Slowing down my impulsive urges is one of area I’ve found them to be helpful.",
          "created_utc": 1742812136.0
        }
      ]
    },
    {
      "id": "mjgfpd1",
      "author": "LeylaBA",
      "body": "I’m lucky I have one creative outlet that give me that same rush but not always and it takes a lot of time. Need to dedicate more time to my art",
      "created_utc": 1742812214.0,
      "score": 2,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        },
        {
          "id": "mjgdnnu",
          "author": "LeylaBA",
          "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
          "created_utc": 1742810994.0
        },
        {
          "id": "mjgfkjx",
          "author": "RuthMaudeJameison",
          "body": "I feel like I’m chasing a high, you know? Purging gave me endorphins and that dopamine rush. Compulsively eating too. It’s hard to find the healthy things to get it, because that impulsivity is so strong! My meds help with a decent portion that. Slowing down my impulsive urges is one of area I’ve found them to be helpful.",
          "created_utc": 1742812136.0
        },
        {
          "id": "mjgfmc9",
          "author": "RuthMaudeJameison",
          "body": "Also helps me not to drink.",
          "created_utc": 1742812165.0
        }
      ]
    },
    {
      "id": "mjgfqtb",
      "author": "RuthMaudeJameison",
      "body": "Shit, sorry, I should say the naltrexone I’m on also is very helpful. Vyvanse is the other.",
      "created_utc": 1742812238.0,
      "score": 1,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        },
        {
          "id": "mjgdnnu",
          "author": "LeylaBA",
          "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
          "created_utc": 1742810994.0
        },
        {
          "id": "mjgfkjx",
          "author": "RuthMaudeJameison",
          "body": "I feel like I’m chasing a high, you know? Purging gave me endorphins and that dopamine rush. Compulsively eating too. It’s hard to find the healthy things to get it, because that impulsivity is so strong! My meds help with a decent portion that. Slowing down my impulsive urges is one of area I’ve found them to be helpful.",
          "created_utc": 1742812136.0
        },
        {
          "id": "mjgfmc9",
          "author": "RuthMaudeJameison",
          "body": "Also helps me not to drink.",
          "created_utc": 1742812165.0
        }
      ]
    },
    {
      "id": "mjgh0jy",
      "author": "RuthMaudeJameison",
      "body": "Dance, for me.",
      "created_utc": 1742812970.0,
      "score": 1,
      "context": [
        {
          "id": "mjfg8o6",
          "author": "RuthMaudeJameison",
          "body": "Please read. \n\nHell, yes. I’m an anorexic, ADHD Alcoholic. I have been severely bulimic, too. Compulsive over eating has also been in my life. I have recently learned that one, I do indeed have/am ADHD. Dx’d at freaking 54! And because I hyperfocus on subjects I become passionate about, I have learned so, so fucking much about women and ADHD. The short version is that eating disorders, especially bulimia and binge eating disorder are inexplicably connected, and many specialists are saying that everyone that is showing eating disorder signs should be screened for ADHD. The impulsive behavior from ADHD stems from lack of dopamine, so the search is constantly happening. Binging and purging create dopamine…so anyway, they are often comorbid. They coexist so, so very often. \n\nSo please, all. Take a look into it. \n\nAnd addicts and alcoholics do better with compassion vs punitive measures. Absolutely. Treat we with eating disorders the same. We deserve the care. \n\nHugs, all.",
          "created_utc": 1742790059.0
        },
        {
          "id": "mjgdnnu",
          "author": "LeylaBA",
          "body": "When I take Prozac it suppresses dopamine but increases serotonin. I find that all my problems come from this lack of balance between dopamine and serotonin. I’m super creative but when I take Prozac the drive disappears because I can’t achieve a dopamine rush",
          "created_utc": 1742810994.0
        },
        {
          "id": "mjgfkjx",
          "author": "RuthMaudeJameison",
          "body": "I feel like I’m chasing a high, you know? Purging gave me endorphins and that dopamine rush. Compulsively eating too. It’s hard to find the healthy things to get it, because that impulsivity is so strong! My meds help with a decent portion that. Slowing down my impulsive urges is one of area I’ve found them to be helpful.",
          "created_utc": 1742812136.0
        },
        {
          "id": "mjgfmc9",
          "author": "RuthMaudeJameison",
          "body": "Also helps me not to drink.",
          "created_utc": 1742812165.0
        },
        {
          "id": "mjgfpd1",
          "author": "LeylaBA",
          "body": "I’m lucky I have one creative outlet that give me that same rush but not always and it takes a lot of time. Need to dedicate more time to my art",
          "created_utc": 1742812214.0
        }
      ]
    }
  ]
}