{
  "id": "1jm8voq",
  "subreddit": "bulimia",
  "author": "sasspup",
  "created_utc": 1743204713.0,
  "title": "severe bulimia",
  "selftext": "I only live to eat and purge. Nothing else fills my days. I wake up have a bowl of oatmeal and then wait four hours before turning on a show and starting my first b/p session. The moment I finish purging I’m already setting up for the next one. This repeats over and over with no breaks in between until well past midnight when I either collapse on the floor or force myself into bed shaking and do it all again the next day. Even half asleep all I can think about is eating. It never stops. I have no hobbies, no friends, no dreams, no passions. Every thought is about food. I don’t even care about my weight anymore. I used to obsess over maintaining an underweight bmi but honestly now I wouldn't even care if I got fat if it meant I wouldn't have to live another day like this. I’m not even 20 yet and I'm afraid I'll die but I can't get myself to accept help because deep down I think I deserve this. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1jm8voq/severe_bulimia/",
  "score": 229,
  "num_comments": 35,
  "comments": [
    {
      "id": "mk9zfo8",
      "author": "Stasiaandsunny",
      "body": "i understand you. this is hell on earth. i wish i could hug you and i wish we didn’t suffer. life is so empty this way",
      "created_utc": 1743206585.0,
      "score": 62,
      "context": []
    },
    {
      "id": "mkaby82",
      "author": "arabellaboobooo",
      "body": "go to inpatient! i’ve been to inpatient couple years ago when i was superrrrr bad the people there are rlly nice (depends) they have therapy there and food stuff and like you can go outside and get sun u can sit outside you can watch tv you can do everythinggggg!",
      "created_utc": 1743211008.0,
      "score": 57,
      "context": []
    },
    {
      "id": "mka4ilc",
      "author": "SailorRD",
      "body": "Do you have anyone IRL that you can talk to, that might be able to connect you to help? This sounds like absolute hell and I’m so sorry for you.",
      "created_utc": 1743208367.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mkaomik",
      "author": "luvanilla",
      "body": "That’s really rough :/\nMaybe try and break the cycle even a little bit.\nAim for 1 binge a day, then every other day, etc.\nObviously it helps to keep binge food out of the house (or just tiny amounts).\nAnd i know its hard, but its also important to eat small healthy meals before you get really hungry.\nFind something to do outside the house if possible, when you know you might feel the urge to binge. \nIt’s really hard at first, but you can get to a more normal situation.\nAiming to binge less can be easier than trying to completely stop, at least as a first step.",
      "created_utc": 1743215644.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mkc6ico",
      "author": "Freely_Unwilling",
      "body": "Working helped me with this problem. It gave me a semi purpose/time where I’m not doing it. However, it does not halt the obsession. The urge. Sometimes if I don’t b/p I get so grumpy, feel like I can’t function, I feel off. As soon as I do it, I’m back to normal. It is an addiction. Inpatient/treatment did not help me. That does not mean it can’t help you. I have not found a solution to solve it. To fix it. I wish I have.",
      "created_utc": 1743246103.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mkac2wj",
      "author": "arabellaboobooo",
      "body": "but also talk to someone you have and make sure h have a support system! i’m just turned 17 im super young too you got this girl ❤️❤️❤️",
      "created_utc": 1743211054.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mkalh7s",
      "author": "rescuecatmomlover",
      "body": "You don't deserve this, you deserve to live a happy and fulfilling life.  Is there anyone you can talk to for help? Have you ever seen a therapist?  I'm sorry you are going through this, it's hell, I know.",
      "created_utc": 1743214434.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mkcgc47",
      "author": "Ok_Animator6428",
      "body": "It sounds like you have hit your bottom.  This is a good thing.  I had to get there to recover.  I like two comments on this string a lot — one is the idea of just cutting back.  A binge or two a day to start and see if you can maintain that for a day or two.  And build from there.  The other comment was to go inpatient which is solid advice.  I wouldn’t normally say that but I think you are hitting your bottom and are probably deeply addicted right now and it may take a structured environment for you to turn this around.",
      "created_utc": 1743251197.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mkc3t6b",
      "author": "Margaet_moon",
      "body": "When I was a bit younger and going through something similar my dad gave me this advise—\n\nThere was a author of a book he read, the author was a World War II vet and wrote about his time in combat over seas. This author said when he was in the trenches on the German borders, up to his knees in mud, muck, bodies etc. and with days on end of constant overheard incoming fire, bombs, screaming all of it he wrote how he got through it mentally. \n\nHis method was to focus on 5 minutes at a time. He would constantly set his watch for 5 minutes and spend those 5 minutes focusing on survival and doing what he could to help himself. As soon as the 5 minutes was up he would start again. \n\nObvious that’s a extreme example but I think about this often and practice the same method in 30 minute intervals. Spend 30 minutes delaying the b/p by going on a walk. Spend 30 minutes after that reading a book, spend 30 minutes preparing a healthy thoughtful lunch with nutrition and love, then spend 30 minutes eating it. Even if you just manage to fight for 30 minutes one day, the next day aim to fight for 2 30 minute intervals, then 3, then maybe back down to 1. It’s a back and forth process but use it to give yourself some power back. Sending love xx",
      "created_utc": 1743244453.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mkcfhvw",
      "author": "Hellterskellter44",
      "body": "Hell on earth. This was me in my 20s before I went to my last treatment. I was ready. I was exhausted of this lifestyle you described. You are a shell of a person because of Bulimia. Please consider inpatient because you are worthy of a happy and fulfilling life. I’m here for you",
      "created_utc": 1743250810.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mkbnmoe",
      "author": "Queenofwands1212",
      "body": "It doesn’t really sound like this is sustainable and it’s not like you’re doing it out of fear of weight gain so I don’t dealt know what’s stopping you from getting treatment. Like go to inpatient.\nYou’re like the perfect candidate.",
      "created_utc": 1743233546.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mkc4sp0",
      "author": "unremarkable_sapien",
      "body": "I could have written this. What you are describing has been my life for the last few years. Hundreds of thousands of dollars down the drain, no friends, no hobbies, nothing. My life is meaningless. I’m sorry that you too are going through this. I can only hope that one day we find a way out.",
      "created_utc": 1743245070.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkfcjg9",
      "author": "StockReporter5",
      "body": "dude i have been. here. and it really truly makes life feel like it’s not worth living. i agree with the ppl saying aim for less, like 3x a day and decrease from there, bc that has helped me. i also had success with focusing just on incorporating other things into my day. like doing one thing i enjoy doing (that i can’t b/p during) every day when i would normally be b/p-ing. for me that was crochet, going on walks, hanging out w a friend, playing an instrument, or just getting outside for a little bit. there are things worth your time that will add value to your life that make binging and purging a less attractive option. if treatment is an option for u, inpatient would probably help u break this cycle and it seems like u really need it. i hope things get better <3",
      "created_utc": 1743286619.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkcd2mu",
      "author": "penismusic666",
      "body": "I was like this too before 20. Please go to treatment. It can get better and you are worth it",
      "created_utc": 1743249649.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mkb6chr",
      "author": "oohyeahgetitiguess",
      "body": "I’m right there with you",
      "created_utc": 1743223286.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkdgloe",
      "author": "GoIdpaw",
      "body": "me too :( literally all of this exactly",
      "created_utc": 1743264368.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkfpk15",
      "author": "triciani23",
      "body": "Hi friend, would love to chat with you. I’m 40, and I WISH I could go back to being 12 when I first threw up and be like “don’t do it!” Believe me — as you can already tell — this is not the life that you want. I’m alone. I’m bulimic. I’m now an alcoholic to cope with all of it. And now I’ll have to spend $10k MORE on fixing my teeth AGAIN. Please get help. I’m sorry that my message is so negative. I’ve had, well, too much to drink. I’ll try to write something inspiring tomorrow. But I’m begging you to get help. Talk to someone who you trust bc this “life” is just not it. We’re the walking dead.",
      "created_utc": 1743291176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkidakv",
      "author": "Astrologicalboy",
      "body": "I can relate to this on severe levels. I am so far gone it’s beyond belief, I forgot Mother’s Day today because I was too busy thinking about my bulimia and what to purge next. Feel so guilty 😓 No one will ever understand the hold it can have unless they experience it first hand for themself",
      "created_utc": 1743338706.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkbyf47",
      "author": "Kaisinishe",
      "body": "this was literally me a few months ago. Now I'm kinda recovered and it's a completely different life! As soon as you stop everything gets better! You'll get friends, hobbies and will for life! Please fight for yourself! I believe you can stop this cycle",
      "created_utc": 1743240929.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkhd4av",
      "author": "addblocc",
      "body": "i used to spend so many days doing the exact same thing - even down to the bowl of oatmeal at the beginning of the day. if you do truly want to quit, then you can, no matter how deep in you are right now. when i was at the point you're describing, i was convinced that it was impossible for me to stop, but it was also during one of these exact sessions that i did end up quitting purging forever.",
      "created_utc": 1743316987.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mko3dtg",
      "author": "CateoftheWoods",
      "body": "I went inpatient several times and the reoccurring deep theme to beating this is finding a hobby or passion. Or a hobby you're passionate about. I have several now and while my eating habits toe the line w anorexia, I'm much such healthier and not exactly anorexic. \n\nTo stop the cycle I had to isolate myself from food for 3-4 days entirely, it was soooo hard, but it shrank my stomach and appetite down. I was as severe as you, if not worse and for at least 8 years. Now it's been almost 15 years recovered. Again my eating is still borderline being quite restrictive but my health is so much better. As my eating is restrictive and a little disordered when I've been in situations where I had to eat when not hungry nor ready, I have thrown it up after but never triggered back into  binging and purging.\nThere is hope.",
      "created_utc": 1743420894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkeinjz",
      "author": "cafeorcaphe",
      "body": "I’m really sorry you’re feeling this way. I can’t fully understand what you’re going through, but I’ve had moments when things felt really overwhelming too. Sometimes keeping busy helps me cope, but when I’m stressed and have too much time to think, it all gets worse. I know it’s not the same, but I hope you find some relief soon. You don’t deserve to feel this way, and I really believe things can get better.",
      "created_utc": 1743276607.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkkiepp",
      "author": "-hxneybun-",
      "body": "i'm so sorry, i'm sorry that your life has been stripped to its bare bones and, no, you don't deserve this. stay strong, you won't die and there is a future. even if you have no passions or dreams now, there is a future. i know this is just a vent but if you need more advice, please ask anyone here but especially ask someone irl. you're so strong.",
      "created_utc": 1743363823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml4v2rz",
      "author": "Pretend-Resident8129",
      "body": "I suffered for over 20 years. Purging up to 15 times a day. I know how you’re feeling. I didn’t have options growing up. I recovered through time and hitting rock bottom. A lot of time wasted. If you are looking for quick help In A dyer situation I would suggest talking to a doctor about Vyvanse. It’s used to treat binge eating disorders. I will warn you tho it isn’t a permanent fix… you need to do a lot of recovery work to ensure you don’t risk relapse or dependency. A drug can almost become just as bad as the actual disorder if you don’t put in the effort to change your mindset/addiction/obsessive thoughts. I found it provided relief from the thoughts and gave me an opportunity to recover… I wish I had it as an option 20 years ago to assist me in relieving me From my constant thoughts… and save me a decade or 2 of suffering ",
      "created_utc": 1743646727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moxb3uv",
      "author": "Outrageous_Show_551",
      "body": "Has anyone delt with their paranoid glands inflaming terribly after going a day or two without throwing up? If u go atleast two days your glands right next to your ears will inflame the size of golf balls and it’ll take awhile to heal- maybe a week - three weeks. It scared me straight and I was recovered for two weeks until I guess I just forgot how terrible the pain from my glands were. Guess I’ll go through that again.",
      "created_utc": 1745560118.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkcwy7j",
      "author": "starredlornelei",
      "body": "Get busy. Get a job or go to school",
      "created_utc": 1743257799.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mkd1do0",
      "author": "Fin_Elln",
      "body": "You are either very sick or very bored. Get help if you want to change your day to day life.",
      "created_utc": 1743259330.0,
      "score": -4,
      "context": []
    },
    {
      "id": "mkcfvcz",
      "author": "Ok_Animator6428",
      "body": "That’s great advice.",
      "created_utc": 1743250984.0,
      "score": 3,
      "context": [
        {
          "id": "mkaomik",
          "author": "luvanilla",
          "body": "That’s really rough :/\nMaybe try and break the cycle even a little bit.\nAim for 1 binge a day, then every other day, etc.\nObviously it helps to keep binge food out of the house (or just tiny amounts).\nAnd i know its hard, but its also important to eat small healthy meals before you get really hungry.\nFind something to do outside the house if possible, when you know you might feel the urge to binge. \nIt’s really hard at first, but you can get to a more normal situation.\nAiming to binge less can be easier than trying to completely stop, at least as a first step.",
          "created_utc": 1743215644.0
        }
      ]
    },
    {
      "id": "mkfd01t",
      "author": "StockReporter5",
      "body": "i love this. it’s not going to get you through the whole day every day, but taking back a half hour of your life is still so valuable!",
      "created_utc": 1743286783.0,
      "score": 4,
      "context": [
        {
          "id": "mkc3t6b",
          "author": "Margaet_moon",
          "body": "When I was a bit younger and going through something similar my dad gave me this advise—\n\nThere was a author of a book he read, the author was a World War II vet and wrote about his time in combat over seas. This author said when he was in the trenches on the German borders, up to his knees in mud, muck, bodies etc. and with days on end of constant overheard incoming fire, bombs, screaming all of it he wrote how he got through it mentally. \n\nHis method was to focus on 5 minutes at a time. He would constantly set his watch for 5 minutes and spend those 5 minutes focusing on survival and doing what he could to help himself. As soon as the 5 minutes was up he would start again. \n\nObvious that’s a extreme example but I think about this often and practice the same method in 30 minute intervals. Spend 30 minutes delaying the b/p by going on a walk. Spend 30 minutes after that reading a book, spend 30 minutes preparing a healthy thoughtful lunch with nutrition and love, then spend 30 minutes eating it. Even if you just manage to fight for 30 minutes one day, the next day aim to fight for 2 30 minute intervals, then 3, then maybe back down to 1. It’s a back and forth process but use it to give yourself some power back. Sending love xx",
          "created_utc": 1743244453.0
        }
      ]
    },
    {
      "id": "mkc2nlj",
      "author": "ScottishWidow64",
      "body": "Please get yourself to inpatient care asap. I’m sure you are already aware how dangerous b/p cycle is. I went to inpatient when I was 19 and I’m 60 now with only one relapse when my husband died. I hope you have support, if not call a crisis line. I wish you well young lady.",
      "created_utc": 1743243711.0,
      "score": 10,
      "context": [
        {
          "id": "mkbnmoe",
          "author": "Queenofwands1212",
          "body": "It doesn’t really sound like this is sustainable and it’s not like you’re doing it out of fear of weight gain so I don’t dealt know what’s stopping you from getting treatment. Like go to inpatient.\nYou’re like the perfect candidate.",
          "created_utc": 1743233546.0
        }
      ]
    },
    {
      "id": "mkfpzn5",
      "author": "triciani23",
      "body": "Me too. Our life is so sad. Positive: I know where everything bathroom in the city is — especially the solo ones. SMH. It’s a terrible existence. That said, I am so surprised and grateful that I’ve made it to 40. I never expected that.",
      "created_utc": 1743291326.0,
      "score": 2,
      "context": [
        {
          "id": "mkc4sp0",
          "author": "unremarkable_sapien",
          "body": "I could have written this. What you are describing has been my life for the last few years. Hundreds of thousands of dollars down the drain, no friends, no hobbies, nothing. My life is meaningless. I’m sorry that you too are going through this. I can only hope that one day we find a way out.",
          "created_utc": 1743245070.0
        }
      ]
    },
    {
      "id": "moxa9db",
      "author": "Outrageous_Show_551",
      "body": "You’re not too far gone 💔 I’m 22 I started two and half years ago. I had rumination syndrome which is a behavioral problem, my body automatically regurgitated food one day. From the first time it happened, it took about six months for this to turn into extreme bulimia. I spent all day throwing up. I would spend thousands a month on food that I knew wasn’t gonna stay in my body. I would go into grocery stores and gas stations throughout the day stealing (literally don’t know how I didn’t get caught). I literally felt like a was a rat addicted to food. Now I’m just over two years into this and I genuinely have made so much progress. I still will once a day binge something like a box of donuts and purge that but in comparison to all day everyday - starting therapy next week too. I see everyone else saying this and it’s so true but anyone relating and going through this - it is literally hell. I seriously cannot believe how fucked this is - I’ve gone a few days even maybe a week binge and purge free - I felt a sense of freedom, I felt hope for myself. \nBinging gives me a feeling a relief - even a feeling of relief from the pain in bulimia itself. - so, if u need a different outlet of relief - I smoke so much weed now and I’m honestly trying to transfer the relief purging gives me into weed - not working out too well but….\nI’ve taken sleeping pills in the mornings and mid days to make myself pass out cause that was once the only thing that would stop me from bulimia. I’m always finding myself trying to hide from it but u can’t hide from it. It’s not something u can suppress cause itll always be there literally changes our brain chemistry forever. I just have gotten better at holding it back. - might literally go find someone to hypnotize me into having a fear of toilets or something - lowk funny but like I’m so serious 😭 we all need to vent and ik im not alone in this which could be comforting but honestly just devastated sm people go through this.",
      "created_utc": 1745559667.0,
      "score": 1,
      "context": [
        {
          "id": "mkidakv",
          "author": "Astrologicalboy",
          "body": "I can relate to this on severe levels. I am so far gone it’s beyond belief, I forgot Mother’s Day today because I was too busy thinking about my bulimia and what to purge next. Feel so guilty 😓 No one will ever understand the hold it can have unless they experience it first hand for themself",
          "created_utc": 1743338706.0
        }
      ]
    },
    {
      "id": "ml4vyou",
      "author": "Pretend-Resident8129",
      "body": "Also I know how hard it is to admit to having this problem. I couldn’t talk to my family friends or doctor… you can find specialized nurses online to talk to who you don’t know via a video link. Costs a small fee. I found it easier to talk to a stranger about it freely. Not that anyone o know would have judged me but I found it easier talking to a complete stranger myself.",
      "created_utc": 1743647061.0,
      "score": 1,
      "context": [
        {
          "id": "ml4v2rz",
          "author": "Pretend-Resident8129",
          "body": "I suffered for over 20 years. Purging up to 15 times a day. I know how you’re feeling. I didn’t have options growing up. I recovered through time and hitting rock bottom. A lot of time wasted. If you are looking for quick help In A dyer situation I would suggest talking to a doctor about Vyvanse. It’s used to treat binge eating disorders. I will warn you tho it isn’t a permanent fix… you need to do a lot of recovery work to ensure you don’t risk relapse or dependency. A drug can almost become just as bad as the actual disorder if you don’t put in the effort to change your mindset/addiction/obsessive thoughts. I found it provided relief from the thoughts and gave me an opportunity to recover… I wish I had it as an option 20 years ago to assist me in relieving me From my constant thoughts… and save me a decade or 2 of suffering ",
          "created_utc": 1743646727.0
        }
      ]
    },
    {
      "id": "mkctzt1",
      "author": "luvanilla",
      "body": "Thanks, this is just from experience…\nIt feels like occasionally “cheating” on your diet, but making an effort to eat healthy and work out. It’s easier to progress from there. Giving yourself credit for the good days.\nIt’s not a complete fix but it’s way easier to live with and feel sane.",
      "created_utc": 1743256747.0,
      "score": 3,
      "context": [
        {
          "id": "mkaomik",
          "author": "luvanilla",
          "body": "That’s really rough :/\nMaybe try and break the cycle even a little bit.\nAim for 1 binge a day, then every other day, etc.\nObviously it helps to keep binge food out of the house (or just tiny amounts).\nAnd i know its hard, but its also important to eat small healthy meals before you get really hungry.\nFind something to do outside the house if possible, when you know you might feel the urge to binge. \nIt’s really hard at first, but you can get to a more normal situation.\nAiming to binge less can be easier than trying to completely stop, at least as a first step.",
          "created_utc": 1743215644.0
        },
        {
          "id": "mkcfvcz",
          "author": "Ok_Animator6428",
          "body": "That’s great advice.",
          "created_utc": 1743250984.0
        }
      ]
    },
    {
      "id": "mketyy9",
      "author": "Ok_Animator6428",
      "body": "I’m not OP :)",
      "created_utc": 1743280321.0,
      "score": 1,
      "context": [
        {
          "id": "mkaomik",
          "author": "luvanilla",
          "body": "That’s really rough :/\nMaybe try and break the cycle even a little bit.\nAim for 1 binge a day, then every other day, etc.\nObviously it helps to keep binge food out of the house (or just tiny amounts).\nAnd i know its hard, but its also important to eat small healthy meals before you get really hungry.\nFind something to do outside the house if possible, when you know you might feel the urge to binge. \nIt’s really hard at first, but you can get to a more normal situation.\nAiming to binge less can be easier than trying to completely stop, at least as a first step.",
          "created_utc": 1743215644.0
        },
        {
          "id": "mkcfvcz",
          "author": "Ok_Animator6428",
          "body": "That’s great advice.",
          "created_utc": 1743250984.0
        },
        {
          "id": "mkctzt1",
          "author": "luvanilla",
          "body": "Thanks, this is just from experience…\nIt feels like occasionally “cheating” on your diet, but making an effort to eat healthy and work out. It’s easier to progress from there. Giving yourself credit for the good days.\nIt’s not a complete fix but it’s way easier to live with and feel sane.",
          "created_utc": 1743256747.0
        }
      ]
    }
  ]
}