{
  "id": "1jntgcr",
  "subreddit": "bulimia",
  "author": "YellowBowl468",
  "created_utc": 1743389311.0,
  "title": "do you know anybody whose died of bulimia?",
  "selftext": "i feel like its really easy to hide behind the 4% mortality rate. \"it could be me, but it wont be me\". i just want to know how those people die. i bet everyone's seen the medusa link. with the girl slumped over a toilet covered in bruises. its scary, but how do most bulimics die? if not die what are the worst complications from your ed. ive recently developed bulimia, and i want to know what to expect long term from binging and purging 4x a day for six months.",
  "url": "https://www.reddit.com/r/bulimia/comments/1jntgcr/do_you_know_anybody_whose_died_of_bulimia/",
  "score": 67,
  "num_comments": 53,
  "comments": [
    {
      "id": "mkmleu4",
      "author": "HerElectronicHaze",
      "body": "Dying isn’t the worst thing. It’s being alive with this ED and suffering. Living a half life, trapped for decades. Rotting away. Body slowly decaying.\n\nOtherwise \n\n- seizures (You could end up in a vegetative state, see the Terry Schiavo case)\n- heart attacks \n- kidney failure \n- gastric rupture \n- aspirating vomit \n\nA lot of people with EDs die by suicide, because it’s so unbearable.",
      "created_utc": 1743390313.0,
      "score": 149,
      "context": []
    },
    {
      "id": "mkmobf3",
      "author": "banana-itch",
      "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
      "created_utc": 1743391583.0,
      "score": 74,
      "context": []
    },
    {
      "id": "mknb3yt",
      "author": "Twigsintheforest",
      "body": "Every person I know that's died from their ED was a purger. I don't know if they were all officially diagnosed w bulimia nervosa but most of them would b/p pretty regularly and that's what ultimately did them in. I know four people that died, two of them from cardiac/electrolyte related issues, one I don't know since I only knew them online, and one died of kidney, and subsequent organ failure. They were 27, 31, 25 and 15 years old respectively. Their deaths were horrible and painful and extremely slow. Towards the end they were always sick and in pain, it must've been hell on earth. No one deserves to suffer like that, please take care of yourselves as best you can and take your goddamn supplements.",
      "created_utc": 1743403611.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mkmtyw1",
      "author": "fakesk8r",
      "body": "My aunt died of complications from bulimia/laxative abuse",
      "created_utc": 1743394170.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mkmu95t",
      "author": "Cumbersomesockthief",
      "body": "I ended up in the ER for severe electrolyte imbalances. Hyponatremia, hypokalemia so dangerous they wanted to transfuse me, low protein, pre diabetes (somehow), significant anemia.\n\nGuess what I did immediately after getting out?\n\nAnd then I went to work.",
      "created_utc": 1743394307.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mknakl2",
      "author": "laurandisorder",
      "body": "Read up on Terri Shiavo. There are fates worse than death imho.",
      "created_utc": 1743403276.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mkncphn",
      "author": "TemporaryQuantity802",
      "body": "I used to work in a Bulimia related blog as an Illustrator. And there was a girl in our Facebook group who later we had to make a post about because she just died in her sleep from electrolyte imbalance issues if I'm not wrong.",
      "created_utc": 1743404606.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mkmlr1x",
      "author": "morgan5409",
      "body": "from what i understand, most of the worst complications come from purging. \n\n“[Long term effects of bulimia](https://www.eatingrecoverycenter.com/conditions/bulimia#signs-symptoms):\n• Bulimia teeth or tooth decay and staining (caused by stomach acids/frequent vomiting)\n• Bulimia face or cheek swelling caused by self-induced vomiting\n• Cardiac complications (irregular heartbeat and heart failure stemming from electrolyte imbalances such as potassium, sodium, and chloride)\n• Dehydration\n• Edema (stemming from periods of purging cessation)\n• Ulcers, pancreatitis\n• Esophageal inflammation and/rupture, acid reflux (resulting from vomiting)\n• Digestive irregularity (chronic irregular bowel movements and constipation, sometimes stemming from laxative abuse)\n• Fatigue and muscle weakness (from over-exercise or electrolyte imbalances)\n• Risks associated with diabulimia (manipulating insulin for weight loss in Type 1 Diabetics), including organ damage and peripheral neuropathy”\n\nBulimics are at a greater risk of esophageal cancer, a very serious and potentially deadly diagnosis. They can also eventually develop severe hypokalemia or severely low potassium levels, which can cause a cascade of health issues, including potentially fatal episodes of muscle weakness or paralysis of key respiratory muscles. ([link](https://bulimia.com/bulimia-health-risks/can-kill-you/))",
      "created_utc": 1743390459.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mkoe8js",
      "author": "ZtoA_Limited",
      "body": "I was a purging anorexic and literally almost died two years ago, medically observably - I had lost consciousness and was unresponsive for hours - by the grace of god someone had called a welfare check on me, had to be intubated and given chest compressions, body temperature dropped to 90 degrees. If they had been even an hour or two later I wouldn’t be here - maybe they were exaggerating, but I don’t think so, several doctors and nurses told me that in the hospital. (I pieced all the info together from emt/dr reports and the person that unlocked the door for the welfare check). I probably almost died several times before from chronic “critically low” potassium - causing frequent dizziness and hitting my head, seizures; I couldn’t drive. I could barely get out of bed most days at the end. I went from being so athletic I made a garden bed from hauling logs out of the woods beside my house, to needing assistance walking up the two steps to my front door. Really.\n\nI’m still putting my life back together after beginning recovery that day I woke up in the hospital. It got worse before it got better, but I’m finally healing - my period came back after being gone 4 years! I just drove for the first time in 3 years a month ago! I feel like a kid going through milestones again… I will be 39 this year. I am sad that I will probably die much sooner than I had without this disease….after all these years I am finally happy and at peace, and wish nothing more than to spend many happy years with my family. And I probably will not get to. Please don’t waste your years. Regret is the saddest emotion of all. I considered myself pretty much dead - like being in a coma - all the years I was sick. I just stalled out & lost 5 years. I am so lucky I made it through that hell, but now I’m realizing how much damage I did - I was getting severe gastroenteritis every 6 weeks, you don’t even want to know about my teeth, my bones are crumbling and causing nerve compression and numbness/pain, and now that I’m emotionally ready to eat, it seems my body cannot handle a good majority of foods in a cruel ironic joke. I promise you won’t regret recovery - only however long it takes you to get there 💜",
      "created_utc": 1743425507.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mkn0yvr",
      "author": "Excellent-World-476",
      "body": "Yes. Multiple people.",
      "created_utc": 1743397717.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mko72oe",
      "author": "Extra-Catsup",
      "body": "You don’t die from “bulimia” itself. You die from all the complications it causes. Like drug overdose isn’t the actual cause of death it’s cardiac arrest. \n\nSame with bulimia, you die from liver issues, or any of the dozen other things people have listed here. Those who struggle with Bulimia always think it’s not bad until X (that can be until I’m fainting, I’m the ER, admitted in the hospital). The truth is if you have to think of a what “bad” is limit, it’s already bad.",
      "created_utc": 1743422564.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mkokyb3",
      "author": "Winter-Platypus-2828",
      "body": "Please stop I know it’s hard but you’ll be so glad for it",
      "created_utc": 1743427969.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mkoscvi",
      "author": "Odd-Economy-4235",
      "body": "My 19 year old sister died last year. She had bulimia for one year. Low potassium. High strain on her heart. She had lost a lot of weight too. She looked so sick we thought potassium pills and ivs would help. It was shocking and awful. They found throw up in the toilet from the night before. She died suffering. She was a musician and it took away her creativity it took her away. I’ve had it for 4 years and my potassium is great, Almost too high. But it depends on the person. It sucks I feel like I set such a bad example she thought there would be no side effects for just one year. But I am dealing with so many now they all came at once that I wish I was dead. This disorder is the hardest thing I’ve gone through mentally. My sister passing made it 100% worse. I’m trying to stop so bad. I feel her trying to help me call me crazy… I was buying binge food and a rare song that was played at her funeral came on the radio. I never have heard anyone play it. I broke down put the food back. If anyone has any tips at all how to stop I would greatly appreciate it! I don’t want to die because I’ve seen how grief is I’ve felt it nonstop. My teeth are clear and see through i am constantly tired. Shell of a person for years now. It is a prison I’m getting nowhere in life I live to eat and purge I have no spark at all anymore and I’m broke as hell living this shameful double life. I have lost 35 pounds since she died I am underweight the only thing is she had low potassium that’s the difference between life and death. Your heart can stop at ANY time",
      "created_utc": 1743430428.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mko4vi6",
      "author": "bebe_inferno",
      "body": "I have an order relative (older meaning 60s, around my mom’s age) who is very sickly and looks unwell and older than she is due to decades of eating disorders including bulimia. She has been in and out of the hospital many times.",
      "created_utc": 1743421590.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mkpk0fc",
      "author": "RainbowTowers9",
      "body": "I do know of someone whose stomach ruptured during a binge. They eventually ended up having most of it removed and now can’t digest anything at all.",
      "created_utc": 1743438816.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkpw2sh",
      "author": "madijm",
      "body": "I had a close friend die from the effects of bulimia. Her heart gave out. She was binging and purging multiple times a day, probably for a year - a few years. It can absolutely kill you~ at the very least you will have health effects that can & will affect you for the rest of your life. \n\nI b/ped regularly in middle school; I am 20 now and only do it occasionally (old habits die hard!), but I developed costochondritis, heart issues, and my teeth are a bit fucked up now. I used to have really nice teeth.",
      "created_utc": 1743442409.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkwn7er",
      "author": "Dzeactia",
      "body": "This is a very tragic thing to comment but yes on twt there is a girl known as “toilet girl” because no one knows her actual name. She died because her stomach burst after a binge and she was hunched over a toilet, and just died there. There is a picture but I don’t recommend searching for it, it’s very sad and hard to look at☹️",
      "created_utc": 1743536002.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mknxm70",
      "author": "Nothing2Hyde",
      "body": "A friend of mine died of complications from her bulimia",
      "created_utc": 1743417957.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mkrq5jj",
      "author": "CorporateC",
      "body": "I have posted about this multiple times in other threads, but I have SO many health issues from 19 years of bulimia. I am 40. You can go through my post history and see what I've written about - I freaking regret the fact I ever purged in my life due to all the long list of health symptoms I'm currently experiencing. It's so depressing. I'm 4+ months purge-free and finally done with ever doing it again.",
      "created_utc": 1743462872.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mksws23",
      "author": "Charming_Sport_6197",
      "body": "I recommend one teaspoon of baking NoSalt substitute with some lemon juice and water and sweetener to replenish your electrolytes. On a long binge you lose 20meQ  which is like 75  gatorades, so use Nosalt. One teaspoon in a quart of water. Also you lost acid, so return the acid to your body with lemon juice in water. After you binge, brush with baking soda to neutralize the stomach acid. This will go a long way to keeping you out of the hospital or dentist",
      "created_utc": 1743478956.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mktj1zc",
      "author": "SaturnFlyTrap",
      "body": "Knowing I spent at least half my life as a slave to bulimia is tragic enough for me. So many years I feel were wasted, and it just makes me so sad for my younger self",
      "created_utc": 1743491236.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mkz50aa",
      "author": "Middle-Teaching5177",
      "body": "Another way you can die is through drugs and alcohol.  Bulimics are more likely to abuse drugs and alcohol than the normal population.  I know from experience. \n\nAfter 20 years of bulimia I switched addictions to heroin and cocaine (this was the pre-fentanyl era) and of course I OD’ed, not once but twice. I’m lucky to be alive.",
      "created_utc": 1743568671.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkrkdjx",
      "author": "Yumi77Hime",
      "body": "It's killing you slow from the inside.. I also did it after a stomach surgery where its possible that the stomach is breaking.. there were blood and i knew, if i survive i need to change.. since then, i have a real pain in my troath and my stomach when i just try to puke.. it feels like if i don't again like i did back then I will die.. beside smal accidents ones in a month ( if i feel sick bc of a wrong food) i stoped after that.. and the fact that i also was feeling something strange and tought it might be a tumor helped me out...i finally realized, i dont deserve this. All the moments when i thought i choke on food and got red while my heart was beating and hurting so fast.. \n3 weeks ago i was going to the toilet and was thinking how happy i am for not suffer like back then.. and going for pee to toilet not for loosing control.. (sry for my broken english - its so late.. )",
      "created_utc": 1743460906.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mks95az",
      "author": "Moo_chii",
      "body": "Personally, yes, I was close to one person online, and another person a distant friend knew online. And here's a list of complications that anybody can get: first-time purge or a year into their disorder.  \n \n\nSeizures  \n\nAlways smelling of vomit (even after brushing, the smell of stomach acid starts to stick to your clothes and hair and lingers)  \n\nBurst blood vessels\n\nOrgan damage and failure (dealt with organ damage)\n\nEsophagus rupture \n\nStomach rupture  \n\nStomach prolapse \n\nIncontinence (uncontrollable bladder)  \n\nUncontrollable bowel movements  \n\nInternal bleeding  \n\nLiver damage  \n\nPancreatitis  \n\nGastritis  \n\nGastroparesis  \n\nGallbladder damage (I've dealt with this) \n\nHair loss  \n\nVisual impairment \n\nFainting  \n\nCardiac issues (from as small as palpitations to full-on cardiac failure) \n\nAnd of course ✨ death ✨   ",
      "created_utc": 1743469705.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkmw1l2",
      "author": "YellowBowl468",
      "body": "just to clarify, i dont want to know what could happen to me. i want to know what has happened to you, and at what point in your ed is accord. and im not trying to get shocked out of my ed. i know its hell. i have the damn disorder, it sucks, my teeth hurt.",
      "created_utc": 1743395181.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mknj9hl",
      "author": "ClassicCompetitive29",
      "body": "How do you know when you have electrolyte imbalance? B/P for 20+ years and my doc says I’m “healthy” but I know I’m not….",
      "created_utc": 1743408955.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkr2clo",
      "author": "StockReporter5",
      "body": "perforated esophagus and aspiration",
      "created_utc": 1743454986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mktvqsx",
      "author": "veronicatandy",
      "body": "i have stomach problems that have persisted even tho I'm like 6 years into recovery/recovered. I lost out on truly living and being happy. I was miserable. and I do know someone who passed due to their ED.",
      "created_utc": 1743499950.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlaatv1",
      "author": "None",
      "body": "I personally ended up in the hospital with a ruptured esophagus. I’ve also had internal bleeding and passed out completely. If you read the Libby Rose case that one always really got to me. But living with this disorder is the most exhausting and painful thing in the world. It’s like you want to stop but you just can’t and everybody around you keeps telling you you’re ruining their lives but you’re just ruining your own and you don’t know how to stop. It’s hell. This is hell.",
      "created_utc": 1743722090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkrv8qf",
      "author": "noconsideration2001",
      "body": "sorry, what do you mean by aspirating vomit? you mean during purging or for example during sleep? it happens to me a lot to throw up during sleep and i risk suffocation every single night",
      "created_utc": 1743464631.0,
      "score": 4,
      "context": [
        {
          "id": "mkmleu4",
          "author": "HerElectronicHaze",
          "body": "Dying isn’t the worst thing. It’s being alive with this ED and suffering. Living a half life, trapped for decades. Rotting away. Body slowly decaying.\n\nOtherwise \n\n- seizures (You could end up in a vegetative state, see the Terry Schiavo case)\n- heart attacks \n- kidney failure \n- gastric rupture \n- aspirating vomit \n\nA lot of people with EDs die by suicide, because it’s so unbearable.",
          "created_utc": 1743390313.0
        }
      ]
    },
    {
      "id": "mkokeba",
      "author": "Impressive-Top8639",
      "body": "I experienced all of this and yeah. I stay the same weight so it's really all for nothing.",
      "created_utc": 1743427770.0,
      "score": 19,
      "context": [
        {
          "id": "mkmobf3",
          "author": "banana-itch",
          "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
          "created_utc": 1743391583.0
        }
      ]
    },
    {
      "id": "mksbe2p",
      "author": "Straight_Wonder_9125",
      "body": "Holy shit, that's one of the most reliable and realistic things i've ever read about bulimia",
      "created_utc": 1743470543.0,
      "score": 5,
      "context": [
        {
          "id": "mkmobf3",
          "author": "banana-itch",
          "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
          "created_utc": 1743391583.0
        }
      ]
    },
    {
      "id": "mkveahs",
      "author": "Lilllithh",
      "body": "that hit so hard. it's crazy I managed to live like this, looking at it now, but honestly, I'm happy to even be alive at this point. stay strong.",
      "created_utc": 1743522222.0,
      "score": 2,
      "context": [
        {
          "id": "mkmobf3",
          "author": "banana-itch",
          "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
          "created_utc": 1743391583.0
        }
      ]
    },
    {
      "id": "ml0fwuf",
      "author": "Intelligent-Tax-8401",
      "body": "This hit me like a rock.",
      "created_utc": 1743596396.0,
      "score": 2,
      "context": [
        {
          "id": "mkmobf3",
          "author": "banana-itch",
          "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
          "created_utc": 1743391583.0
        }
      ]
    },
    {
      "id": "mkoybo2",
      "author": "ihateorangejuice",
      "body": "The rest are so young too but 15??? :((((",
      "created_utc": 1743432291.0,
      "score": 9,
      "context": [
        {
          "id": "mknb3yt",
          "author": "Twigsintheforest",
          "body": "Every person I know that's died from their ED was a purger. I don't know if they were all officially diagnosed w bulimia nervosa but most of them would b/p pretty regularly and that's what ultimately did them in. I know four people that died, two of them from cardiac/electrolyte related issues, one I don't know since I only knew them online, and one died of kidney, and subsequent organ failure. They were 27, 31, 25 and 15 years old respectively. Their deaths were horrible and painful and extremely slow. Towards the end they were always sick and in pain, it must've been hell on earth. No one deserves to suffer like that, please take care of yourselves as best you can and take your goddamn supplements.",
          "created_utc": 1743403611.0
        }
      ]
    },
    {
      "id": "mkn4hpb",
      "author": "morgan5409",
      "body": "if you feel comfortable, could you elaborate? how did the laxative abuse contribute?",
      "created_utc": 1743399657.0,
      "score": 5,
      "context": [
        {
          "id": "mkmtyw1",
          "author": "fakesk8r",
          "body": "My aunt died of complications from bulimia/laxative abuse",
          "created_utc": 1743394170.0
        }
      ]
    },
    {
      "id": "mkr1x1s",
      "author": "StockReporter5",
      "body": "shit, i’d known about her case but i had no idea that’s how she went into cardiac arrest initially. terrifying.",
      "created_utc": 1743454852.0,
      "score": 1,
      "context": [
        {
          "id": "mknakl2",
          "author": "laurandisorder",
          "body": "Read up on Terri Shiavo. There are fates worse than death imho.",
          "created_utc": 1743403276.0
        }
      ]
    },
    {
      "id": "mkn08av",
      "author": "3beansIn",
      "body": "My esophagus hurts erryday and I have severe GERD, gastritis, constipation and hemorrhoids and I’m 29. \nSometimes when I eat it feels like food is trapped in my esophagus, and then I can only consume liquid/very soft food cuz of the pain and feeling that “something is stuck”\nI really wish I could do this over again and never have started",
      "created_utc": 1743397325.0,
      "score": 14,
      "context": [
        {
          "id": "mkmlr1x",
          "author": "morgan5409",
          "body": "from what i understand, most of the worst complications come from purging. \n\n“[Long term effects of bulimia](https://www.eatingrecoverycenter.com/conditions/bulimia#signs-symptoms):\n• Bulimia teeth or tooth decay and staining (caused by stomach acids/frequent vomiting)\n• Bulimia face or cheek swelling caused by self-induced vomiting\n• Cardiac complications (irregular heartbeat and heart failure stemming from electrolyte imbalances such as potassium, sodium, and chloride)\n• Dehydration\n• Edema (stemming from periods of purging cessation)\n• Ulcers, pancreatitis\n• Esophageal inflammation and/rupture, acid reflux (resulting from vomiting)\n• Digestive irregularity (chronic irregular bowel movements and constipation, sometimes stemming from laxative abuse)\n• Fatigue and muscle weakness (from over-exercise or electrolyte imbalances)\n• Risks associated with diabulimia (manipulating insulin for weight loss in Type 1 Diabetics), including organ damage and peripheral neuropathy”\n\nBulimics are at a greater risk of esophageal cancer, a very serious and potentially deadly diagnosis. They can also eventually develop severe hypokalemia or severely low potassium levels, which can cause a cascade of health issues, including potentially fatal episodes of muscle weakness or paralysis of key respiratory muscles. ([link](https://bulimia.com/bulimia-health-risks/can-kill-you/))",
          "created_utc": 1743390459.0
        }
      ]
    },
    {
      "id": "mkrb1z7",
      "author": "Financial_Oil_1646",
      "body": "Heartbreaking. Me an my sister both suffer from bulimia. \nI’m so sorry this disease took your sister.. I can’t even imagine the pain.. although just the thought of it breaks me into pieces \nI wish you all the best in life. I hope you with help from your sister someday will be free from this. I hope that for all reading this. This kills us.",
      "created_utc": 1743457756.0,
      "score": 3,
      "context": [
        {
          "id": "mkoscvi",
          "author": "Odd-Economy-4235",
          "body": "My 19 year old sister died last year. She had bulimia for one year. Low potassium. High strain on her heart. She had lost a lot of weight too. She looked so sick we thought potassium pills and ivs would help. It was shocking and awful. They found throw up in the toilet from the night before. She died suffering. She was a musician and it took away her creativity it took her away. I’ve had it for 4 years and my potassium is great, Almost too high. But it depends on the person. It sucks I feel like I set such a bad example she thought there would be no side effects for just one year. But I am dealing with so many now they all came at once that I wish I was dead. This disorder is the hardest thing I’ve gone through mentally. My sister passing made it 100% worse. I’m trying to stop so bad. I feel her trying to help me call me crazy… I was buying binge food and a rare song that was played at her funeral came on the radio. I never have heard anyone play it. I broke down put the food back. If anyone has any tips at all how to stop I would greatly appreciate it! I don’t want to die because I’ve seen how grief is I’ve felt it nonstop. My teeth are clear and see through i am constantly tired. Shell of a person for years now. It is a prison I’m getting nowhere in life I live to eat and purge I have no spark at all anymore and I’m broke as hell living this shameful double life. I have lost 35 pounds since she died I am underweight the only thing is she had low potassium that’s the difference between life and death. Your heart can stop at ANY time",
          "created_utc": 1743430428.0
        }
      ]
    },
    {
      "id": "mkxpoxt",
      "author": "YellowBowl468",
      "body": "her name was amiee moore, she was purging 150 times a day, and ate over 5.6 liters of food before she died. she had been anorexic b/p for over 15 years. she was 39 and passed away in 2019. may she rest in peace.",
      "created_utc": 1743548393.0,
      "score": 5,
      "context": [
        {
          "id": "mkwn7er",
          "author": "Dzeactia",
          "body": "This is a very tragic thing to comment but yes on twt there is a girl known as “toilet girl” because no one knows her actual name. She died because her stomach burst after a binge and she was hunched over a toilet, and just died there. There is a picture but I don’t recommend searching for it, it’s very sad and hard to look at☹️",
          "created_utc": 1743536002.0
        }
      ]
    },
    {
      "id": "mkodvco",
      "author": "Sporknut",
      "body": "Blood work up! You should get one if you haven’t in a while",
      "created_utc": 1743425366.0,
      "score": 2,
      "context": [
        {
          "id": "mknj9hl",
          "author": "ClassicCompetitive29",
          "body": "How do you know when you have electrolyte imbalance? B/P for 20+ years and my doc says I’m “healthy” but I know I’m not….",
          "created_utc": 1743408955.0
        }
      ]
    },
    {
      "id": "mkrr0ho",
      "author": "rescuecatmomlover",
      "body": "Oh my god, what’s the treatment for this? So sorry. <3",
      "created_utc": 1743463165.0,
      "score": 1,
      "context": [
        {
          "id": "mkr2clo",
          "author": "StockReporter5",
          "body": "perforated esophagus and aspiration",
          "created_utc": 1743454986.0
        }
      ]
    },
    {
      "id": "mks8len",
      "author": "Moo_chii",
      "body": "it just means choking on your vomit. So it can be both!!",
      "created_utc": 1743469500.0,
      "score": 8,
      "context": [
        {
          "id": "mkmleu4",
          "author": "HerElectronicHaze",
          "body": "Dying isn’t the worst thing. It’s being alive with this ED and suffering. Living a half life, trapped for decades. Rotting away. Body slowly decaying.\n\nOtherwise \n\n- seizures (You could end up in a vegetative state, see the Terry Schiavo case)\n- heart attacks \n- kidney failure \n- gastric rupture \n- aspirating vomit \n\nA lot of people with EDs die by suicide, because it’s so unbearable.",
          "created_utc": 1743390313.0
        },
        {
          "id": "mkrv8qf",
          "author": "noconsideration2001",
          "body": "sorry, what do you mean by aspirating vomit? you mean during purging or for example during sleep? it happens to me a lot to throw up during sleep and i risk suffocation every single night",
          "created_utc": 1743464631.0
        }
      ]
    },
    {
      "id": "mkth369",
      "author": "No-Foundation-1856",
      "body": "Pneumonia is also a possibility when aspirating vomit",
      "created_utc": 1743489951.0,
      "score": 5,
      "context": [
        {
          "id": "mkmleu4",
          "author": "HerElectronicHaze",
          "body": "Dying isn’t the worst thing. It’s being alive with this ED and suffering. Living a half life, trapped for decades. Rotting away. Body slowly decaying.\n\nOtherwise \n\n- seizures (You could end up in a vegetative state, see the Terry Schiavo case)\n- heart attacks \n- kidney failure \n- gastric rupture \n- aspirating vomit \n\nA lot of people with EDs die by suicide, because it’s so unbearable.",
          "created_utc": 1743390313.0
        },
        {
          "id": "mkrv8qf",
          "author": "noconsideration2001",
          "body": "sorry, what do you mean by aspirating vomit? you mean during purging or for example during sleep? it happens to me a lot to throw up during sleep and i risk suffocation every single night",
          "created_utc": 1743464631.0
        }
      ]
    },
    {
      "id": "mkrb2re",
      "author": "marmalademeowmeow",
      "body": "this is the most relatable thing ever 😭😭",
      "created_utc": 1743457763.0,
      "score": 3,
      "context": [
        {
          "id": "mkmobf3",
          "author": "banana-itch",
          "body": "What you can expect in the long term is hell - excruciating cramps all the time,  your teeth yellow and crumbling out of your mouth one after the other, constant brain fog and exhaustion that make it impossible to graduate school or keep a job or relationships, not to mention lying to, stealing from and disappointing over and over those you love the most to the point they don't trust you anymore and give up on you. Urine and stool incontinence: you will have multiple instances of wetting or shitting yourself with no warning, but at least you might get used to it eventually and it won't be so humiliating anymore. Chapped lips and painful ripped corners of your mouth,  your hair falling out and leaving bald patches that you can't hide with a combover, poverty and debt because you're spending all your money on binges and can't keep a job, and potentially criminal charges from shoplifting binge food. Constant dry and flaky skin, debilitating acid reflux and the inability to keep even a small meal down without your body expelling it automatically, sores in your mouth, brittle nails, a swollen moonface that doesn't go away no matter how much gua sha you're doing. The only thoughts you'll ever have will be about binging and purging and that dreadful existential guilt. Wasting your youth, wasting your twenties, having nothing to show for all the pain you're going through every single day. Oh, and weight loss is probably not something you can expect.",
          "created_utc": 1743391583.0
        },
        {
          "id": "mkokeba",
          "author": "Impressive-Top8639",
          "body": "I experienced all of this and yeah. I stay the same weight so it's really all for nothing.",
          "created_utc": 1743427770.0
        }
      ]
    },
    {
      "id": "mktek8s",
      "author": "Slvt4CalorieDeficit",
      "body": ":(",
      "created_utc": 1743488352.0,
      "score": 2,
      "context": [
        {
          "id": "mknb3yt",
          "author": "Twigsintheforest",
          "body": "Every person I know that's died from their ED was a purger. I don't know if they were all officially diagnosed w bulimia nervosa but most of them would b/p pretty regularly and that's what ultimately did them in. I know four people that died, two of them from cardiac/electrolyte related issues, one I don't know since I only knew them online, and one died of kidney, and subsequent organ failure. They were 27, 31, 25 and 15 years old respectively. Their deaths were horrible and painful and extremely slow. Towards the end they were always sick and in pain, it must've been hell on earth. No one deserves to suffer like that, please take care of yourselves as best you can and take your goddamn supplements.",
          "created_utc": 1743403611.0
        },
        {
          "id": "mkoybo2",
          "author": "ihateorangejuice",
          "body": "The rest are so young too but 15??? :((((",
          "created_utc": 1743432291.0
        }
      ]
    },
    {
      "id": "mkn4nwl",
      "author": "fakesk8r",
      "body": "She died before I was even born so I’m *not totally sure. But I know that she absolutely could not go to the bathroom without using a laxative because she had abused them so severely. I think ultimately she died of some sort of electrolyte balance/heart problem",
      "created_utc": 1743399755.0,
      "score": 18,
      "context": [
        {
          "id": "mkmtyw1",
          "author": "fakesk8r",
          "body": "My aunt died of complications from bulimia/laxative abuse",
          "created_utc": 1743394170.0
        },
        {
          "id": "mkn4hpb",
          "author": "morgan5409",
          "body": "if you feel comfortable, could you elaborate? how did the laxative abuse contribute?",
          "created_utc": 1743399657.0
        }
      ]
    },
    {
      "id": "mkn45uq",
      "author": "morgan5409",
      "body": "i’m so sorry :( i’m fortunate enough to have non-purging bulimia so i’ve been able to avoid a lot of the negative consequences, but i’m sure the constant binge/restrict/exercise cycle is taking its toll",
      "created_utc": 1743399472.0,
      "score": 2,
      "context": [
        {
          "id": "mkmlr1x",
          "author": "morgan5409",
          "body": "from what i understand, most of the worst complications come from purging. \n\n“[Long term effects of bulimia](https://www.eatingrecoverycenter.com/conditions/bulimia#signs-symptoms):\n• Bulimia teeth or tooth decay and staining (caused by stomach acids/frequent vomiting)\n• Bulimia face or cheek swelling caused by self-induced vomiting\n• Cardiac complications (irregular heartbeat and heart failure stemming from electrolyte imbalances such as potassium, sodium, and chloride)\n• Dehydration\n• Edema (stemming from periods of purging cessation)\n• Ulcers, pancreatitis\n• Esophageal inflammation and/rupture, acid reflux (resulting from vomiting)\n• Digestive irregularity (chronic irregular bowel movements and constipation, sometimes stemming from laxative abuse)\n• Fatigue and muscle weakness (from over-exercise or electrolyte imbalances)\n• Risks associated with diabulimia (manipulating insulin for weight loss in Type 1 Diabetics), including organ damage and peripheral neuropathy”\n\nBulimics are at a greater risk of esophageal cancer, a very serious and potentially deadly diagnosis. They can also eventually develop severe hypokalemia or severely low potassium levels, which can cause a cascade of health issues, including potentially fatal episodes of muscle weakness or paralysis of key respiratory muscles. ([link](https://bulimia.com/bulimia-health-risks/can-kill-you/))",
          "created_utc": 1743390459.0
        },
        {
          "id": "mkn08av",
          "author": "3beansIn",
          "body": "My esophagus hurts erryday and I have severe GERD, gastritis, constipation and hemorrhoids and I’m 29. \nSometimes when I eat it feels like food is trapped in my esophagus, and then I can only consume liquid/very soft food cuz of the pain and feeling that “something is stuck”\nI really wish I could do this over again and never have started",
          "created_utc": 1743397325.0
        }
      ]
    },
    {
      "id": "ml3ijz0",
      "author": "Odd-Economy-4235",
      "body": "Thank you so much. Yes we were a year apart she was my whole life. I am lost without her. The last text she sent me was about how much weight she had lost and how happy she was. It’s just not worth dying over. Everyone I’ve met with eating disorders are the best, kindest, sweetest people. It’s heartbreaking to see how we treat ourselves. I know you and your sister can both recover hold onto her tight. You deserve a life full of health and happiness❤️",
      "created_utc": 1743630198.0,
      "score": 2,
      "context": [
        {
          "id": "mkoscvi",
          "author": "Odd-Economy-4235",
          "body": "My 19 year old sister died last year. She had bulimia for one year. Low potassium. High strain on her heart. She had lost a lot of weight too. She looked so sick we thought potassium pills and ivs would help. It was shocking and awful. They found throw up in the toilet from the night before. She died suffering. She was a musician and it took away her creativity it took her away. I’ve had it for 4 years and my potassium is great, Almost too high. But it depends on the person. It sucks I feel like I set such a bad example she thought there would be no side effects for just one year. But I am dealing with so many now they all came at once that I wish I was dead. This disorder is the hardest thing I’ve gone through mentally. My sister passing made it 100% worse. I’m trying to stop so bad. I feel her trying to help me call me crazy… I was buying binge food and a rare song that was played at her funeral came on the radio. I never have heard anyone play it. I broke down put the food back. If anyone has any tips at all how to stop I would greatly appreciate it! I don’t want to die because I’ve seen how grief is I’ve felt it nonstop. My teeth are clear and see through i am constantly tired. Shell of a person for years now. It is a prison I’m getting nowhere in life I live to eat and purge I have no spark at all anymore and I’m broke as hell living this shameful double life. I have lost 35 pounds since she died I am underweight the only thing is she had low potassium that’s the difference between life and death. Your heart can stop at ANY time",
          "created_utc": 1743430428.0
        },
        {
          "id": "mkrb1z7",
          "author": "Financial_Oil_1646",
          "body": "Heartbreaking. Me an my sister both suffer from bulimia. \nI’m so sorry this disease took your sister.. I can’t even imagine the pain.. although just the thought of it breaks me into pieces \nI wish you all the best in life. I hope you with help from your sister someday will be free from this. I hope that for all reading this. This kills us.",
          "created_utc": 1743457756.0
        }
      ]
    },
    {
      "id": "mkxqkep",
      "author": "Dzeactia",
      "body": "I think we might be thinking of different people but that’s really sad too😕 \n\nHere’s the link to what I was talking about but tw bc there is a picture of the girl\n\nhttp://www.2medusa.com/2008/09/bulimia-killswarning-graphic-pictures.html?m=1",
      "created_utc": 1743548701.0,
      "score": 5,
      "context": [
        {
          "id": "mkwn7er",
          "author": "Dzeactia",
          "body": "This is a very tragic thing to comment but yes on twt there is a girl known as “toilet girl” because no one knows her actual name. She died because her stomach burst after a binge and she was hunched over a toilet, and just died there. There is a picture but I don’t recommend searching for it, it’s very sad and hard to look at☹️",
          "created_utc": 1743536002.0
        },
        {
          "id": "mkxpoxt",
          "author": "YellowBowl468",
          "body": "her name was amiee moore, she was purging 150 times a day, and ate over 5.6 liters of food before she died. she had been anorexic b/p for over 15 years. she was 39 and passed away in 2019. may she rest in peace.",
          "created_utc": 1743548393.0
        }
      ]
    },
    {
      "id": "mkskiy1",
      "author": "StockReporter5",
      "body": "perforated esophagus is tricky, it’s super often fatal. i’ve never had it thank GOD but i know someone who died from it when she was already in the hospital. look it up, it’s scary. same deal with aspirating vomit. she just choked to death in her bathroom. every time u purge it’s a gamble and it’s hard to remember that.",
      "created_utc": 1743473962.0,
      "score": 3,
      "context": [
        {
          "id": "mkr2clo",
          "author": "StockReporter5",
          "body": "perforated esophagus and aspiration",
          "created_utc": 1743454986.0
        },
        {
          "id": "mkrr0ho",
          "author": "rescuecatmomlover",
          "body": "Oh my god, what’s the treatment for this? So sorry. <3",
          "created_utc": 1743463165.0
        }
      ]
    },
    {
      "id": "mksn3tj",
      "author": "Eastern_Bug5217",
      "body": "I was a binge/restrict/exercise bulimic for 4 of the 7 years I’ve had anorexia/bulimia. It’s worse than “regular” anorexia or “regular bulimia” in some ways , better in others. I’m sorry you are struggling 😞",
      "created_utc": 1743474956.0,
      "score": 1,
      "context": [
        {
          "id": "mkmlr1x",
          "author": "morgan5409",
          "body": "from what i understand, most of the worst complications come from purging. \n\n“[Long term effects of bulimia](https://www.eatingrecoverycenter.com/conditions/bulimia#signs-symptoms):\n• Bulimia teeth or tooth decay and staining (caused by stomach acids/frequent vomiting)\n• Bulimia face or cheek swelling caused by self-induced vomiting\n• Cardiac complications (irregular heartbeat and heart failure stemming from electrolyte imbalances such as potassium, sodium, and chloride)\n• Dehydration\n• Edema (stemming from periods of purging cessation)\n• Ulcers, pancreatitis\n• Esophageal inflammation and/rupture, acid reflux (resulting from vomiting)\n• Digestive irregularity (chronic irregular bowel movements and constipation, sometimes stemming from laxative abuse)\n• Fatigue and muscle weakness (from over-exercise or electrolyte imbalances)\n• Risks associated with diabulimia (manipulating insulin for weight loss in Type 1 Diabetics), including organ damage and peripheral neuropathy”\n\nBulimics are at a greater risk of esophageal cancer, a very serious and potentially deadly diagnosis. They can also eventually develop severe hypokalemia or severely low potassium levels, which can cause a cascade of health issues, including potentially fatal episodes of muscle weakness or paralysis of key respiratory muscles. ([link](https://bulimia.com/bulimia-health-risks/can-kill-you/))",
          "created_utc": 1743390459.0
        },
        {
          "id": "mkn08av",
          "author": "3beansIn",
          "body": "My esophagus hurts erryday and I have severe GERD, gastritis, constipation and hemorrhoids and I’m 29. \nSometimes when I eat it feels like food is trapped in my esophagus, and then I can only consume liquid/very soft food cuz of the pain and feeling that “something is stuck”\nI really wish I could do this over again and never have started",
          "created_utc": 1743397325.0
        },
        {
          "id": "mkn45uq",
          "author": "morgan5409",
          "body": "i’m so sorry :( i’m fortunate enough to have non-purging bulimia so i’ve been able to avoid a lot of the negative consequences, but i’m sure the constant binge/restrict/exercise cycle is taking its toll",
          "created_utc": 1743399472.0
        }
      ]
    },
    {
      "id": "mksr5hm",
      "author": "rescuecatmomlover",
      "body": "off to google myself.  I know scare tactics don't work on everyone but they work on me, I'm on day 8 now no BP b/c my freaking throat was hurting and I'm so god damn scared of fucking up my esophagus for good.",
      "created_utc": 1743476562.0,
      "score": 3,
      "context": [
        {
          "id": "mkr2clo",
          "author": "StockReporter5",
          "body": "perforated esophagus and aspiration",
          "created_utc": 1743454986.0
        },
        {
          "id": "mkrr0ho",
          "author": "rescuecatmomlover",
          "body": "Oh my god, what’s the treatment for this? So sorry. <3",
          "created_utc": 1743463165.0
        },
        {
          "id": "mkskiy1",
          "author": "StockReporter5",
          "body": "perforated esophagus is tricky, it’s super often fatal. i’ve never had it thank GOD but i know someone who died from it when she was already in the hospital. look it up, it’s scary. same deal with aspirating vomit. she just choked to death in her bathroom. every time u purge it’s a gamble and it’s hard to remember that.",
          "created_utc": 1743473962.0
        }
      ]
    }
  ]
}