{
  "id": "1jo74p6",
  "subreddit": "bulimia",
  "author": "User666142",
  "created_utc": 1743437987.0,
  "title": "What my life is with diagnosed severe anorexia-bulimia",
  "selftext": "Hi I’m 21 years old and live in finland. I’m so thankful for all help I have been given over the years and I want nothing else as much as to be free from this hell\n\nOnly thing I do is b/p. I often binge for 1-1,5h straight and become so full I cannot walk or keep my body up. After purging I start binging again and this repeats over and over again. I steal from stores. I keep spending over 100€ a day to buy binge food. I’m broke. My health is shit. I have osteoporosis bc i have been severely underweight and in life threathing BMI for years. I have no real teeth left because of purging and I have been out and in of mentalhospitals. I have Been kept there against my will for months even one year. I eat 15-20000 calories a day. I purge without my hands. It’s too easy but it breaks my body and mind. I’m so depressed I feel like there’s no hope for me. But I really wanna recover for my family and boyfriend. They don’t deserve this. I’m in very intense outpatient program. But like i told you. It’s no use. I can’t eat without purging.\n\nI want to find people who thought they have lost everything to their eating disorder. But have not lost hope. I wan’t to know if there’s anyone who is going through same things as I. Please tell your story and how are you doing even if you are in almost exact same situation as me right now.\n\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1jo74p6/what_my_life_is_with_diagnosed_severe/",
  "score": 82,
  "num_comments": 18,
  "comments": [
    {
      "id": "mkppwi7",
      "author": "PhotographSingle2746",
      "body": "I can relate to this so much. I’m 24 years old from Sweden, and I recovered the same year I turned 21 after being diagnosed with anorexia and bulimia specifically ANA-BP. The two years before my recovery were the darkest of my life. I spent them locked away in my room, binging and purging at least three times a day. I lost all my friends, dropped out of a prestigious university in Stockholm, was cruel to my entire family, and lost so much of my hair.\n\nAnd worst of all I was extremely suicidal.\n\nBut I can tell you this: You have already gotten through the hardest part, which is deciding to recover. That is a huge step, and I am so proud of you.\n\nI believe Sweden and Finland are quite similar in that you can get state-supported help for recovery, and I can honestly say that seeking help was the best decision I have ever made. After my time in a hospital, I found out I had kidney failure, and something about that realization changed something in my brain. I knew I had to recover.\n\nNow, I’m back to my normal life I’m studying again, I’ve made new friends, and I’m rebuilding everything I lost. Even thinking back to my 21-year-old self, consumed by my eating disorder, gives me so much anxiety. And knowing that you’re going through this now honestly breaks my heart—I could cry for you.\n\nBut please, listen to me: Seek help. Your life is worth so much more than this illness. You deserve to live. If You can get help through the state please tryt i get it. I  believe you will kick this illness in the butt and get you dream life, virtual hugs 🩷🩷🩷",
      "created_utc": 1743440596.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mkq4j9g",
      "author": "madeofstardust___",
      "body": "I’m going to an appointment right now but I’ll respond soon. I relate so much to this. I’m so sorry you’re struggling so much too 🩷",
      "created_utc": 1743444895.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mkrtbka",
      "author": "User666142",
      "body": "Thank you so much for being so empathetic and kind because you’re right that’s what we all need❤️ this illness makes me feel so much shame and selfhate, it really does feel like I’m a failure because I have failed to recover🥺I have to repeat how much your messages mean to me and how I see so much more hope and light for the future because of you💘 You’re so inspiring and an example how you can turn your life around, when accepting all the help from others and this eating disorder hell doesn’t need to be forever<3 \n\nI’m gonna recover and do everything it takes, if you were brave enough to do it and got back life that’s worth living, why coudn’t I do the same? I can because I have desided🥹❤️\n\nYou’re so lovely and perfect the way you are<3 I don’t even know you but I think you are one of the strongest person I Know🩷 Thank you for making me realize I’m not a hopeless case😭",
      "created_utc": 1743463968.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkscf4v",
      "author": "madeofstardust___",
      "body": "My life with AN-BP is basically non-existent. I’m 34. I was diagnosed with AN at 13, started purging two years later and it’s been like that since. I’ve lost count of how many times I’ve been in treatment. I’ve lost count of how many friends and acquaintances I’ve met in treatment who have lost their lives. I’m incredibly lucky I’m not one of them but I’m terrified I will be. Every day I wake up and it’s like living the same day over and over and over. Every waking moment is about food. Even when I sleep I have night terrors often and usually they’re related to my ED in some aspect. I don’t have time for anything because of how much time I spend on my ED. Or how much time I waste really. I don’t really have any friends anymore. My health has deteriorated so much, especially over the last few years. I have gastroparesis, osteoporosis, tachycardia, GERD, chronic constipation (hardly anything helps anymore), awful dental damage (I’m going to have to get full dentures now). I feel like shit all the time. And the thing is I desperately want to get better but I can’t get the level of treatment I need. My labs are okay so the hospital won’t admit me (but I take a lot of supplements prescribed so of course my electrolytes are okay). The last 10 years or so I always end up developing refeeding syndrome so I need to be in a medical hospital first. It would be too unsafe for me to go to straight ED IP. So I don’t even know what to do right now and to be honest I am really scared. I never ever imagined my life would turn out like this. Or that I’d be struggling still for so long.",
      "created_utc": 1743470932.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mkqf326",
      "author": "Fuwa_Fuwa_",
      "body": "I feel you, this condition has ruined my life.\n\nI've been trying to seek treatment here in Canada. I've flip-flopped between anorexia and bulimia for 20+ years, and only been able to to get into IOP for 2 months in 2018, only to relapse and been left on my own since then. Recently been trying again since I moved to another province, but since I don't look sick enough/can't afford to take time off of my full-time job, its probbaly gonna be another dead end. \n\n Feeling like I will die with this disease: liver damage, hair loss, tooth decay, anemia, electrolyte imbalances, poor blood circulation...",
      "created_utc": 1743448055.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mksmrfk",
      "author": "sp00kyd00kieee",
      "body": "I'm 21F from the other side of the world, and I can relate to every single word. Diagnosed with AN-BP since I was 16 and life has felt like a surreal dream where nothing but the same vicious cycle would repeat over and over and over again. \n\nI was in and out of hospitals, had unstable potassium levels, irregular and struggling heart rate, low BMI, would purge up to 9 times a day, my teeth are see-through and bones are fragile. I lost my personality, thoughts, desires, hopes and dreams to this disease.\n\nI've only recently started to really recover.\n\nI can tell you it DOES get better, I can do normal things now, but it's hard. You deserve to live, you deserve to eat and keep it in, you deserve to be your true self without the shadow of an eating disorder over you. I know how hard it is to get better but it's even worse staying in it and watching yourself rot.\n\nYou're stronger than you know.\n\nLife is beautiful, you just need to give yourself enough adequate energy to see it.\n\n**EDIT: Also, I went into an inpatient program and was made to eat a normal amount (felt like way too much at the start of it), but I came out of it able to think and speak better, make decisions easier, and deal with hard emotions far easier than before. Your brain needs a base amount of calories in regular amounts just to function without it impacting weight, don't let your ED tell you otherwise.",
      "created_utc": 1743474824.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mku61jq",
      "author": "kitastrofee",
      "body": "I feel for you so much because I know what is coming once it hits osteoporosis stage. \nPlease make sure you get treatment for that (and I mean at the very least,  the daily injections) \n\nMy osteoporosis is really severe. My bones are breaking. And I mean literally snapping in half with no fall, no knock, no accident. \n\nMy femur snapped right in half at the top. By me just scooting up bum up in bed. It’s not healing. \n\nI’m left disabled because of this awful disease. Mine is so far gone now that there is no reversal of the damage done. \n\nMy spine is the worst affected according to the scans. I could end up not being able to move at all if it breaks in the wrong place. It’s terrifying! \n\nThis awful disease takes everything. \n\nAnd how can we eat without purging when we can’t cure ourselves by abstaining like an alcoholic or a gambler. \n\nWe need a magic pill. Something to block that part of the brain. \n\nI’m sorry I have nothing but solidarity darling. \nMy hearts breaks for you and me and all of us.",
      "created_utc": 1743506042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm62m5h",
      "author": "True-Ad4667",
      "body": "Oh love 😭💗 It’s like I’m reading my own story.. I’m so so so sorry… Also the money thing: same girl. I’m so ashamed of that :( I lost everything too… Like, everything. I’ve also not lost hope but the only reason for that is my faith!! Thank you SO much for writing your story\n\nHow are your electrolytes since you are not keeping anything in? 🥺🤍 Sending you all the love",
      "created_utc": 1744178435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkpso8c",
      "author": "User666142",
      "body": "Thank you so much😭 your words mean so much to me and I can’t put it into words how proud of you I am🥹 \nYour whole recovery story gives me so much hope and makes me realize that even if you feel like you have lost literally EVERYTHING it’s not true at all. \n\nI’m gonna take my life back and build it again like you did❤️but I won’t be able to do it on my own I have to accept that i need lots of help and I’m very privileged to live in a country that has so good heathcare system. And I’m gonna be goven the support I need<3 we don’t have to survive this all alone!\nThank you so much for your message this was exactly what I needed to hear🥹 we got this! Love you💘",
      "created_utc": 1743441418.0,
      "score": 7,
      "context": [
        {
          "id": "mkppwi7",
          "author": "PhotographSingle2746",
          "body": "I can relate to this so much. I’m 24 years old from Sweden, and I recovered the same year I turned 21 after being diagnosed with anorexia and bulimia specifically ANA-BP. The two years before my recovery were the darkest of my life. I spent them locked away in my room, binging and purging at least three times a day. I lost all my friends, dropped out of a prestigious university in Stockholm, was cruel to my entire family, and lost so much of my hair.\n\nAnd worst of all I was extremely suicidal.\n\nBut I can tell you this: You have already gotten through the hardest part, which is deciding to recover. That is a huge step, and I am so proud of you.\n\nI believe Sweden and Finland are quite similar in that you can get state-supported help for recovery, and I can honestly say that seeking help was the best decision I have ever made. After my time in a hospital, I found out I had kidney failure, and something about that realization changed something in my brain. I knew I had to recover.\n\nNow, I’m back to my normal life I’m studying again, I’ve made new friends, and I’m rebuilding everything I lost. Even thinking back to my 21-year-old self, consumed by my eating disorder, gives me so much anxiety. And knowing that you’re going through this now honestly breaks my heart—I could cry for you.\n\nBut please, listen to me: Seek help. Your life is worth so much more than this illness. You deserve to live. If You can get help through the state please tryt i get it. I  believe you will kick this illness in the butt and get you dream life, virtual hugs 🩷🩷🩷",
          "created_utc": 1743440596.0
        }
      ]
    },
    {
      "id": "mkq50k0",
      "author": "User666142",
      "body": "Hope you have a good appointment love💘 sorry to hear you relate to this but can’t wait for your respond🥹🩷",
      "created_utc": 1743445037.0,
      "score": 5,
      "context": [
        {
          "id": "mkq4j9g",
          "author": "madeofstardust___",
          "body": "I’m going to an appointment right now but I’ll respond soon. I relate so much to this. I’m so sorry you’re struggling so much too 🩷",
          "created_utc": 1743444895.0
        }
      ]
    },
    {
      "id": "mksrwqk",
      "author": "User666142",
      "body": "First of alll thank you so much for sharing your story I’m here for you<3 I can realite to your situation so much and it’s so wrong you have been left without enough support, it’s literally costing you your life mentally and eventually your body will give up.\n\nEverytime I go to treatment the doctors are educated on refeeding syndrom and I am made very small meal plan that they very carefully increase as they monitor my labs and make sure my body handles it, is there any chance for you to get same type of treatment in the country you live in?🥺\n\nThere’s still hope for you I know it feels like you have lost everything and there’s no future or maybe it even feels like there’s no reason to live since you have lost so much already and there are things, years and people you will never get back, but you really can rebuild your life once you are better. You can make so much friends and reconnect with family, start your dream job and start dating! Maybe you wanna study something or travel and see world? Remember you have not failed for being still sick! You didn’t ask for this❤️\n\nI believe we can get through this together will free to message me and I will share you my instragram where we can continue to support eatch other, love you🥹💘",
      "created_utc": 1743476877.0,
      "score": 3,
      "context": [
        {
          "id": "mkscf4v",
          "author": "madeofstardust___",
          "body": "My life with AN-BP is basically non-existent. I’m 34. I was diagnosed with AN at 13, started purging two years later and it’s been like that since. I’ve lost count of how many times I’ve been in treatment. I’ve lost count of how many friends and acquaintances I’ve met in treatment who have lost their lives. I’m incredibly lucky I’m not one of them but I’m terrified I will be. Every day I wake up and it’s like living the same day over and over and over. Every waking moment is about food. Even when I sleep I have night terrors often and usually they’re related to my ED in some aspect. I don’t have time for anything because of how much time I spend on my ED. Or how much time I waste really. I don’t really have any friends anymore. My health has deteriorated so much, especially over the last few years. I have gastroparesis, osteoporosis, tachycardia, GERD, chronic constipation (hardly anything helps anymore), awful dental damage (I’m going to have to get full dentures now). I feel like shit all the time. And the thing is I desperately want to get better but I can’t get the level of treatment I need. My labs are okay so the hospital won’t admit me (but I take a lot of supplements prescribed so of course my electrolytes are okay). The last 10 years or so I always end up developing refeeding syndrome so I need to be in a medical hospital first. It would be too unsafe for me to go to straight ED IP. So I don’t even know what to do right now and to be honest I am really scared. I never ever imagined my life would turn out like this. Or that I’d be struggling still for so long.",
          "created_utc": 1743470932.0
        }
      ]
    },
    {
      "id": "mkqsl0b",
      "author": "User666142",
      "body": "That’s so horrible I feel so bad for you😭 there’s no ”sick look” you can never tell how much someone is struggling just looking at them😫 you deserve help and that is fucking insane that you have been left all alone waiting your body and mind to die. \n\nI don’t know how the health care system works in Canada, but saving your literal life, should never be dependent on your full-time job. Is there possible to get paid on sick leave so you can take time off and use all your energy to get help and recover? Your body will eventually fail and then it’s too late😩\n\nSending love over there, your situation breaks my heart🥺❤️",
      "created_utc": 1743452069.0,
      "score": 3,
      "context": [
        {
          "id": "mkqf326",
          "author": "Fuwa_Fuwa_",
          "body": "I feel you, this condition has ruined my life.\n\nI've been trying to seek treatment here in Canada. I've flip-flopped between anorexia and bulimia for 20+ years, and only been able to to get into IOP for 2 months in 2018, only to relapse and been left on my own since then. Recently been trying again since I moved to another province, but since I don't look sick enough/can't afford to take time off of my full-time job, its probbaly gonna be another dead end. \n\n Feeling like I will die with this disease: liver damage, hair loss, tooth decay, anemia, electrolyte imbalances, poor blood circulation...",
          "created_utc": 1743448055.0
        }
      ]
    },
    {
      "id": "mkst81m",
      "author": "User666142",
      "body": "You are so inspiring than you for sharing your story! It gives me so much hope that life without this illness is possible🥹💘\n\nDid your labs and heart recover?My calium drops easily dangerously low because of purging but the worst thing is hiw I have totally lost my real self. I’m just a shell of person I used to be😫\n\nIf you got through this so will I! Thank you again for your message, you are so strong and I’m proud of you. You literally saved your own life!❤️\n\nSending love<3",
      "created_utc": 1743477425.0,
      "score": 3,
      "context": [
        {
          "id": "mksmrfk",
          "author": "sp00kyd00kieee",
          "body": "I'm 21F from the other side of the world, and I can relate to every single word. Diagnosed with AN-BP since I was 16 and life has felt like a surreal dream where nothing but the same vicious cycle would repeat over and over and over again. \n\nI was in and out of hospitals, had unstable potassium levels, irregular and struggling heart rate, low BMI, would purge up to 9 times a day, my teeth are see-through and bones are fragile. I lost my personality, thoughts, desires, hopes and dreams to this disease.\n\nI've only recently started to really recover.\n\nI can tell you it DOES get better, I can do normal things now, but it's hard. You deserve to live, you deserve to eat and keep it in, you deserve to be your true self without the shadow of an eating disorder over you. I know how hard it is to get better but it's even worse staying in it and watching yourself rot.\n\nYou're stronger than you know.\n\nLife is beautiful, you just need to give yourself enough adequate energy to see it.\n\n**EDIT: Also, I went into an inpatient program and was made to eat a normal amount (felt like way too much at the start of it), but I came out of it able to think and speak better, make decisions easier, and deal with hard emotions far easier than before. Your brain needs a base amount of calories in regular amounts just to function without it impacting weight, don't let your ED tell you otherwise.",
          "created_utc": 1743474824.0
        }
      ]
    },
    {
      "id": "mkuikkq",
      "author": "User666142",
      "body": "No I’m literally crying over this😭 realizing this is not some story gone very wrong but reality you have to live in for the rest of your life. If that’s not heartbreaking I don’t know what is😓\n\nI’m not religious, but I’m praying for you love. The spine thing is terrifying and no one should have to fear about their spine breaking while doing basic tasks🥺 If you ever need someone to talk to you can come to me❤️\n\nI truly hope it gets better for us even when there’s damage that cannot be repaired😫And feel you with the magic pill part, it feels like I have tried everything and no matter how many inpatient treatments I go through, How many different doctors I see or medicine I took I never seem to change. I always hit rock bottom deeper than the latter😔\n\nYou didn’t ask for this hell to ruin your life it feels so unfair but Remember you are not alone in this❤️ thank you for telling your story<3 sending love over there💘",
      "created_utc": 1743511569.0,
      "score": 1,
      "context": [
        {
          "id": "mku61jq",
          "author": "kitastrofee",
          "body": "I feel for you so much because I know what is coming once it hits osteoporosis stage. \nPlease make sure you get treatment for that (and I mean at the very least,  the daily injections) \n\nMy osteoporosis is really severe. My bones are breaking. And I mean literally snapping in half with no fall, no knock, no accident. \n\nMy femur snapped right in half at the top. By me just scooting up bum up in bed. It’s not healing. \n\nI’m left disabled because of this awful disease. Mine is so far gone now that there is no reversal of the damage done. \n\nMy spine is the worst affected according to the scans. I could end up not being able to move at all if it breaks in the wrong place. It’s terrifying! \n\nThis awful disease takes everything. \n\nAnd how can we eat without purging when we can’t cure ourselves by abstaining like an alcoholic or a gambler. \n\nWe need a magic pill. Something to block that part of the brain. \n\nI’m sorry I have nothing but solidarity darling. \nMy hearts breaks for you and me and all of us.",
          "created_utc": 1743506042.0
        }
      ]
    },
    {
      "id": "mkrmyo7",
      "author": "PhotographSingle2746",
      "body": "Thank you ❤️During my own struggle, I met so many girls who were fighting the same battle, and we all supported each other. So please, if you ever need someone to talk to, don’t hesitate to reach out to me. I see myself in you\n\nAnd I want you to remember this illness is not your fault. It’s an illness, and that’s something many people forget. But those of us who understand it, who have lived it, know how much empathy and kindness are needed to get through it. That’s why we have to lift each other up and remind each other that we’re not alone.\n\nI know you will get through this. You will beat this illness. And one day, I’m certain you’ll look back on the place you are in right now, and barely recognize yourself because you will have rebuilt your life into something beautiful.\n\nEverything you dream of will come true. I remember something a doctor once told me: people with this illness are often perfectionists. And if we put all the energy we used on the eating disorder into something else, we could achieve anything. And that’s the truth. You are capable of so much more than you realize luv.🩷🩷🩷",
      "created_utc": 1743461785.0,
      "score": 9,
      "context": [
        {
          "id": "mkppwi7",
          "author": "PhotographSingle2746",
          "body": "I can relate to this so much. I’m 24 years old from Sweden, and I recovered the same year I turned 21 after being diagnosed with anorexia and bulimia specifically ANA-BP. The two years before my recovery were the darkest of my life. I spent them locked away in my room, binging and purging at least three times a day. I lost all my friends, dropped out of a prestigious university in Stockholm, was cruel to my entire family, and lost so much of my hair.\n\nAnd worst of all I was extremely suicidal.\n\nBut I can tell you this: You have already gotten through the hardest part, which is deciding to recover. That is a huge step, and I am so proud of you.\n\nI believe Sweden and Finland are quite similar in that you can get state-supported help for recovery, and I can honestly say that seeking help was the best decision I have ever made. After my time in a hospital, I found out I had kidney failure, and something about that realization changed something in my brain. I knew I had to recover.\n\nNow, I’m back to my normal life I’m studying again, I’ve made new friends, and I’m rebuilding everything I lost. Even thinking back to my 21-year-old self, consumed by my eating disorder, gives me so much anxiety. And knowing that you’re going through this now honestly breaks my heart—I could cry for you.\n\nBut please, listen to me: Seek help. Your life is worth so much more than this illness. You deserve to live. If You can get help through the state please tryt i get it. I  believe you will kick this illness in the butt and get you dream life, virtual hugs 🩷🩷🩷",
          "created_utc": 1743440596.0
        },
        {
          "id": "mkpso8c",
          "author": "User666142",
          "body": "Thank you so much😭 your words mean so much to me and I can’t put it into words how proud of you I am🥹 \nYour whole recovery story gives me so much hope and makes me realize that even if you feel like you have lost literally EVERYTHING it’s not true at all. \n\nI’m gonna take my life back and build it again like you did❤️but I won’t be able to do it on my own I have to accept that i need lots of help and I’m very privileged to live in a country that has so good heathcare system. And I’m gonna be goven the support I need<3 we don’t have to survive this all alone!\nThank you so much for your message this was exactly what I needed to hear🥹 we got this! Love you💘",
          "created_utc": 1743441418.0
        }
      ]
    },
    {
      "id": "mkq56bn",
      "author": "madeofstardust___",
      "body": "Thank you dear 🩷 I’ll respond soon! 😊",
      "created_utc": 1743445085.0,
      "score": 3,
      "context": [
        {
          "id": "mkq4j9g",
          "author": "madeofstardust___",
          "body": "I’m going to an appointment right now but I’ll respond soon. I relate so much to this. I’m so sorry you’re struggling so much too 🩷",
          "created_utc": 1743444895.0
        },
        {
          "id": "mkq50k0",
          "author": "User666142",
          "body": "Hope you have a good appointment love💘 sorry to hear you relate to this but can’t wait for your respond🥹🩷",
          "created_utc": 1743445037.0
        }
      ]
    },
    {
      "id": "mkqwb4p",
      "author": "Fuwa_Fuwa_",
      "body": "Thank you hun, sending little hearts your way 💗",
      "created_utc": 1743453175.0,
      "score": 2,
      "context": [
        {
          "id": "mkqf326",
          "author": "Fuwa_Fuwa_",
          "body": "I feel you, this condition has ruined my life.\n\nI've been trying to seek treatment here in Canada. I've flip-flopped between anorexia and bulimia for 20+ years, and only been able to to get into IOP for 2 months in 2018, only to relapse and been left on my own since then. Recently been trying again since I moved to another province, but since I don't look sick enough/can't afford to take time off of my full-time job, its probbaly gonna be another dead end. \n\n Feeling like I will die with this disease: liver damage, hair loss, tooth decay, anemia, electrolyte imbalances, poor blood circulation...",
          "created_utc": 1743448055.0
        },
        {
          "id": "mkqsl0b",
          "author": "User666142",
          "body": "That’s so horrible I feel so bad for you😭 there’s no ”sick look” you can never tell how much someone is struggling just looking at them😫 you deserve help and that is fucking insane that you have been left all alone waiting your body and mind to die. \n\nI don’t know how the health care system works in Canada, but saving your literal life, should never be dependent on your full-time job. Is there possible to get paid on sick leave so you can take time off and use all your energy to get help and recover? Your body will eventually fail and then it’s too late😩\n\nSending love over there, your situation breaks my heart🥺❤️",
          "created_utc": 1743452069.0
        }
      ]
    }
  ]
}