{
  "id": "1jpc75f",
  "subreddit": "bulimia",
  "author": "Positive-Secret7893",
  "created_utc": 1743555872.0,
  "title": "One year b/p-free thanks to semaglutide. And no, “food noise” is not just hunger",
  "selftext": "A quick note before I start - I know how controversial this can be and it’s not a solution for everyone. But I want to start a conversation around the stigma of medical weight loss. Please be kind to me and others!\n\nI’ve struggled with bulimia for over 20 years. I’m 35 now. From the outside, I’ve always looked “healthy” - skinny even - BMI around 19-21, fit, good habits. People thought I’d recovered a decade ago. But the truth is, I never stopped binging and purging (b/p) It dominated my life - until this year.\n\nExactly one year ago, I started taking compounded semaglutide. Since then, I can count how many times I’ve b/p-d on one hand. Even at my “most recovered” in over 20 years, it’s never been less than at least 1x/week. That’s over 52 times a year. AT MY BEST. At my worst, I would b/p multiple times a day. And the worst part? I was suffering in complete silence.\n\nAnd now - for the first time in two decades, the food noise is quiet. Not silenced completely, but no longer running the show. No longer dictating my thoughts, my energy, my life.\n\nI’ve done everything else: years of therapy (which I’m still in), in-patient treatment twice, medications, support groups, workbooks, psychedelics, even hypnosis. And none of it ever truly worked. Nothing quieted the obsessive loop until this.\n\nAnd yet… I still see articles like The New York Times op-ed asking, “What if food noise is just hunger?” And I want to scream. Because if you’ve lived with an eating disorder - bulimia, binge eating, or any kind of food addiction -you know food noise is not just hunger. It’s not a rebrand. It’s not a cute TikTok term. It’s a constant, exhausting, suffocating obsession. It’s heroin in the form of a cereal, cookies, ice cream, and whatever else you can get your hands on that will “come back up easily”. It’s planning, hiding, punishing, spiraling. It’s your entire day, entire life swallowed whole by a thought.\n\nNo, this isn’t an ideal solution. I didn’t take this lightly. I’m not using it to lose weight, I didn’t need to. Did I drop 10 lbs from finally NOT binging? Yes, but my weight has been stable for 10 months. And it gave me a chance to build a life beyond survival. That’s something every person with an eating disorder deserves.\n\nSo yeah, I wish I could shout this from the rooftops. But there’s so much stigma, especially when you “look fine” on the outside. So I’m saying it here: semaglutide changed my life. And whether or not it’s the solution for everyone, it needs to be part of the conversation.\n\nIf you’re struggling in silence, or scared to admit that this has helped you too, you’re not alone. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1jpc75f/one_year_bpfree_thanks_to_semaglutide_and_no_food/",
  "score": 141,
  "num_comments": 53,
  "comments": [
    {
      "id": "mkyf9r7",
      "author": "unremarkable_sapien",
      "body": "Were you prescribed it? I can’t imagine a doctor green-lighting a weight-loss med for someone with a borderline underweight bmi. Regardless, I’m really glad that this is working for you. I too wish that people could recognise that food noise and hunger are different.",
      "created_utc": 1743557809.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mkyhhct",
      "author": "strawbeemocha",
      "body": "not the even close to the same class of medication - but i finally reached out to my primary doc and he Rx’d a low dose of sertraline for me and the food noise just *poof* disappeared. i can actually differentiate when i’m hungry vs yearning for a sweat treat. im not obsessing over when i can eat the leftovers in the fridge. i’ve only been on it for a little over a week but i’m actually shocked. i dont know how long it’ll last but i’m glad i finally reached out. i feel like i can do things now without constantly seeking snacks which leads to b/p \n\nthe idea of being medicated was really aversive to me. i totally agree about the stigma around medication being SO strong. even as a nursing student learning about these medications and administering them to people, i was too scared to take or try antidepressants or any CNS medication for a LONG while \n\nit’s like a breath of fresh air",
      "created_utc": 1743558626.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mkycl9s",
      "author": "UnitDisastrous4429",
      "body": "Girl I've been meaning to write this same post. Semaglutide has saved my life. \n\nFor those that don't know, semaglutide -- and other GLP-1 Inhibitors -- are being used in trials for addiction treatment. It has proven to help people who are addicted to substances including alcohol and COCAINE. So it's NOT just about food and hunger. For me it quiets that constant, rampaging voice in my head. I come from a family of addicts. Bulimia is an addiction. SG allows me to have the wheel. My greatest concern actually is the fact that is slows GI mobility. So I'm careful to take the least possible. The LAST thing I want is staying full for long or indigestion!",
      "created_utc": 1743556786.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mkzpgym",
      "author": "senatorstupid",
      "body": "Man this is crazy huge. I will look into this. \n\nBulimia is definitely an addiction. \n\nThank you for this post",
      "created_utc": 1743580989.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ml1lcx2",
      "author": "turnipkitty112",
      "body": "This is such a complex and interesting issue. While I admit I have concerns about ppl obtaining GLP-1s illicitly and abusing them (ie. ppl with restrictive EDs), I also recognize that they can be game-changers for other folks. I’m glad to hear that your quality of life has improved; as someone who strongly believes in harm reduction, I’m all for that. I’m curious, do you see yourself taking semaglutide long term, or do you plan to taper off at some point? Have you discussed with your therapist how to sustain this amazing progress long term? I encourage you to think about this, in case your access or life circumstances change.",
      "created_utc": 1743610198.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mkyyz1u",
      "author": "Middle-Teaching5177",
      "body": "You could be writing my story. Except I’m older than you. And just 70 days into my journey with Oz.  I have a very long history of bulimia (20 years) then switched addictions to cocaine and heroin. Eight years later and multiple treatment centers I finally became drug and bulimia abstinent for 14 whole years, in a great relationship, my best years. I thought I had all these demons licked. Then my partner suddenly died and the bulimia came roaring back. After four years bulimic again (and trying therapy) I finally decided to try Oz - and it’s working. I am distressed to hear about the person upthread who it stopped working for.  I have no idea how long I will be on this but it has also helped me stop drinking and I haven’t wanted to pick up drugs again. Nor am I impulse shopping like I used to. My blood pressure quickly corrected on Oz too so I stopped bp meds.",
      "created_utc": 1743565760.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mkyos41",
      "author": "rescuecatmomlover",
      "body": "Can I ask how you get it if you aren't overweight & how much you pay for it?",
      "created_utc": 1743561393.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mkzjyc0",
      "author": "11brooke11",
      "body": "Maybe I'm wrong, but the fact that it does work for you seems to align with the theory that it suppresses hunger? It slows the digestion. Or maybe I'm misunderstanding your comment on food noise.",
      "created_utc": 1743577242.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml4fvkl",
      "author": "Designer_Ad_9593",
      "body": "So many parallels to my own situation. Started SG a year ago after 20 plus years of BP. It's not a magic bullet, but It's made an incredible difference. Over 7+ months BP free except for a handful of slips, which is astronomically better than where I've been at the past few years. My weight has stayed stable after a small initial loss... I take the lowest dose possible, and that's enough to cut down the food noise to a manageable level.",
      "created_utc": 1743641316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml4r5wa",
      "author": "Moo_chii",
      "body": "Also on semaglutide, and it definitely is a life changer!!!!",
      "created_utc": 1743645301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml9vt0o",
      "author": "candy9012",
      "body": "I find it extremely unfair and discriminatory that I would have to be a certain BMI for this shit. It’s like free thin cure for not really trying a thing. Everyone is doing it and it pisses me off. From Amy Schumer, Oprah, all the singers. Literally no one has to be fat if you are fat.",
      "created_utc": 1743716925.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mldg3ef",
      "author": "litbrit",
      "body": "I just wanted to thank you for this thoughtful and very well-written post. It's important to discuss different approaches to managing this disorder--as we all know, as with all addiction disorders, there \\*is\\* no cure, just that time-tested one-day-at-a-time (and then another day and another) management.\n\nI especially appreciate the discussion surrounding \"food noise\", which has nothing to do with actual hunger, but which is a hallmark of addictive behavior: that low drumbeat in the back our mind that is always there, sometimes becoming loud and unbearable, needing to be quieted with another \"fix\".\n\nAs a 64-year-old who has suffered with this awful, soul-draining disorder since her late teens (when there wasn't even a name for it, and reaching out to a medical professional only resulted in being told \"You don't look like there's a problem--just eat a normal meal!\"), and who only became free from the BP cycles about seven-eight years ago, I will tell you, the drumbeat never stops, not even after months and years have passed since the last BP.  One has to acknowledge its existence, and then, every single day, make the choice to \\*ignore\\* the drumbeat and to listen instead to what our psyche is asking for: am I tired? Irritated? Having ghastly memories of abuse? Feeling deprived in some way, whether it's profound--being passed over for a promotion--or more superficial, like losing out on an eBay auction we really wanted? Bored? Overly self-critical of our appearance that morning (noticing gray hairs, feeling as though we hate everything in our closet, etc.), and on and on.\n\nWhat I'm saying is, in the state of recovery--absent the frenzy and fog of stuffing ourselves with comfort food; then being weighed-down with guilt and panic; then vomiting it up; then castigating ourselves for doing it yet again and promising it was the last time--there is freedom and release, of course, but the quotidian stressors will always be there for the recovered person. Just as they are for every other human being, whether or not they suffer--or ever suffered--from an addiction.\n\nSo, a vital part of recovery is rewiring one's own brain to address all these opressive, negative thoughts and feelings in a positive (as opposed to self-destructive) manner. All the cliché self-care measures like checking in with ourselves; being kind to ourselves; writing down all the miserable things we say to ourselves in our heads and then reading them and realizing how needlessly brutal and hateful we are being to someone we know better than anyone in the world does and toward whom we ought to be loving and kind, not combative: our one and only self.\n\nThe \"food noise\" we all know so well came about because at some point in our earlier years, we fell into a maladaptive cognitive process: we dealt with abuse, sadness, frustration, boredom, grief, resentment, etc. by overloading our bodies with comfort foods (whatever those may be for each of us), and our bloodstreams with big blasts of sugar and fats, knowing we could eliminate at least some of the caloric damage by purging, and then--at least temporarily--being rewarded with blissful relief and peace.\n\nThe new studies about treating addiction disorders with GLP-1s are incredibly promising.  It may be that a year or two course of GLP-1s will help some BP sufferers quiet that food noise long enough for them to learn (or re-learn) the art and science of self-care, self-love, and ultimately, self-preservation. Which, no matter what path one takes to recovery, is the part of the road that is at once freeing and joyful, but also enduring and lifelong. Because the stressors themselves, as we all know, aren't going anywhere (especially right now).\n\nBe well, my friends.",
      "created_utc": 1743774283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkye44x",
      "author": "user4957572",
      "body": "It wears off :/",
      "created_utc": 1743557372.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mkz2loh",
      "author": "springcat413",
      "body": "I totally agree and only wished GLPs worked for me. I’ve been increasing to a crazy high dose over the past 6 months and I have no reaction at all! I really thought it would be the last step I needed, but alas, no.",
      "created_utc": 1743567478.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkzg9p6",
      "author": "blindly24",
      "body": "I had the same experience!",
      "created_utc": 1743574905.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml09lcu",
      "author": "prematurehooray",
      "body": "Op and others, how did you get semaglutine? Your situation and feelings sound a lot like mine, but i think no doctor will prescribe it to me, since i’m mostly bmi 20-24",
      "created_utc": 1743593555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml2u0wq",
      "author": "caviardominotuna",
      "body": "Are you allowed to post the telemedicine place that prescribed for you. I’d really like to see if this helps me, with the compulsion, but like you, i do not have weight to lose.",
      "created_utc": 1743623147.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlgd8rk",
      "author": "esoterique87",
      "body": "There’s no one-size-fits-all path to recovery — only what works for *you*. I’m genuinely so happy for you and proud that you’ve found something that helped quiet the noise after so many years. That’s no small thing. Thank you for being brave enough to share this, especially knowing how controversial it can be.\n\nI understand why some people might be uncomfortable with this — it’s a complex topic, and the idea of using medication in recovery challenges a lot of deeply held beliefs. But that doesn’t mean it’s irresponsible to talk about. Eating disorders have the highest mortality rate of any mental illness, and for many people, traditional treatment alone isn’t enough. We *have* to be open to conversations about what actually helps people survive — and ultimately, recover.\n\nSemaglutide and similar meds are tools, and for some people, they can be life-changing *when* used responsibly and thoughtfully, like you’ve done. I 100% agree they deserve a place in the conversation because we obviously cannot ignore such a powerful option. You deserve to live a life that isn’t ruled by ED thoughts, and I hope this is just the beginning of so much more peace for you.❤️",
      "created_utc": 1743807085.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlky8jm",
      "author": "Head-Shock4733",
      "body": "I don't see the difference between taking Wellbutrin to stop smoking or an antidepressant to stop Selfharming behaviors. You are bulimic bc you can't stop the food noise then you throw up bc you couldn't control it. If you can control the urge to eat and binge and it makes you healthier then why would you not take a glp-1? It's not just about losing weight but being healthier physically and mentally. It's a great solution and there should be no shame. Most people that are overweight are binging but not necessarily purging so I don't understand why it is a great solution to control the appetite/binging, take away the guilt which then causes you to throw up, and makes you healthier. Good for you!",
      "created_utc": 1743879290.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1ektjm",
      "author": "RiskEmotional3098",
      "body": "Thank you for posting this… I agree with everything you said 🤍",
      "created_utc": 1751680095.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkz2bo5",
      "author": "kimchijihye",
      "body": "CONGRATULATIONS!!!!!!!!!!! \n\n\nIt is so good to hear that someone who started a glp-1 has been able to free themselves from “food noise.” Because it really isn’t just hunger. I just started zepbound and the thoughts are gone. I asked my wife, “is this what its like to actually have NO thoughts? is this what its like to be normal?” I hope I can reach one year without b/p! You’re giving me hope!",
      "created_utc": 1743567342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml457sa",
      "author": "poopysquatch",
      "body": "When you talked to the telemedicine folks, did you mention your bulimia? I’m worried if I were to mention my ED that they’d deny me. I just want the food noise to stop :(",
      "created_utc": 1743637606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpkllpa",
      "author": "Subject-Pension-3027",
      "body": "What dose did you start with? I wish I could find somewhere reputable and affordable that provides the smallest doses possible bc I’m very sensitive to medications",
      "created_utc": 1745884058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkzlrbg",
      "author": "candyred1",
      "body": "I almost cried reading. I was heavy as a child so I thought hey I am going to do what all the models do, and I lost 70lbs in two years. I was 13. I have had bulimia since age 13. I am 47.\n\nI have twin girls who are teenagers, which is a miracle as they were born full term and healthy. For over a year now one has anorexia & bulimia. She was in patient twice, PHP then IOP. None of that even existed when I was younger, at least not unless you had $40,000 burning a hole in your pocket. We all know its years of recovering and you dont finish program and come out \"cured\". But still, the treatment she got had major flaws. It seemed so experimental, of course ED treatment is still in its infancy. One thing was the fact that every patient was not allowed exercise which I get but taking a walk everyday is healthy and good for mental health just as well. It wasnt allowed, even for patients who never engaged in strenuous exercise as part of ED. They had to finish 3 meals and two snacks daily or suppliment. We as a family have never really done 3 meals a day more than a few days of the week. Humans \"invented\" the 3 meal routine only in recent years, and its not because we \"finally have enough food to do so\". When she was in IOP we had to follow a strict schedule and provide and \"plate\" the 3 meals plus two snacks of course and the fact shes vegitarian (rest of family isnt) made options more difficult and I was literally exhausted trying to keep up. Shes doing better now 6 months at home. \n\nI look normal on the outside but the damage ive done to my body has been starting to creep up into daily life where I can't just be in denial anymore. The first 10 or so years was the worst of my bulimia, the last 10-15 years it wasnt every day anymore, but most. I am going to ask my doctor and show her your post. If she isnt willing to at least let me try it then I will keep asking till I find a doctor who will. Im at a \"normal\" weight for my height but just gained 15lbs in last year. This isnt my usual weight, and its caused my ED to get worse and im having a really hard time with it. As if getting older wasnt hard enough.",
      "created_utc": 1743578431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkzi6mc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1743576109.0,
      "score": -2,
      "context": []
    },
    {
      "id": "ml4e396",
      "author": "beepbopboopbop69",
      "body": "you must have some deep pockets, OP $$$$",
      "created_utc": 1743640692.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mkyg32h",
      "author": "Positive-Secret7893",
      "body": "I was not, and I agree a doctor would not have. But honestly after all the harm I put my body through with decades of purging, I was willing to do as much research as I could on my own and take the risk. I really hope they study it more because it’s something that should be done with a doctors approval and oversight",
      "created_utc": 1743558111.0,
      "score": 21,
      "context": [
        {
          "id": "mkyf9r7",
          "author": "unremarkable_sapien",
          "body": "Were you prescribed it? I can’t imagine a doctor green-lighting a weight-loss med for someone with a borderline underweight bmi. Regardless, I’m really glad that this is working for you. I too wish that people could recognise that food noise and hunger are different.",
          "created_utc": 1743557809.0
        }
      ]
    },
    {
      "id": "mkyiiop",
      "author": "Positive-Secret7893",
      "body": "I’m SO glad you found something that’s working for you. I was prescribed fluoxetine awhile back and it helped a little but the side effects became unbearable, I could barely make it through the day without multiple naps. \n\nEating disorders are so tough bc you face your addiction all day, every day. There’s no “abstaining” and people still think it’s “in your head” or vanity - or if you could “just get to the bottom of emotions it will fix it.” Then when something like medication works you realize that while yes there’s definitely other issues at play, sometimes it’s just plain chemical and coping mechanisms turned brain wiring. So so happy for you.",
      "created_utc": 1743559007.0,
      "score": 11,
      "context": [
        {
          "id": "mkyhhct",
          "author": "strawbeemocha",
          "body": "not the even close to the same class of medication - but i finally reached out to my primary doc and he Rx’d a low dose of sertraline for me and the food noise just *poof* disappeared. i can actually differentiate when i’m hungry vs yearning for a sweat treat. im not obsessing over when i can eat the leftovers in the fridge. i’ve only been on it for a little over a week but i’m actually shocked. i dont know how long it’ll last but i’m glad i finally reached out. i feel like i can do things now without constantly seeking snacks which leads to b/p \n\nthe idea of being medicated was really aversive to me. i totally agree about the stigma around medication being SO strong. even as a nursing student learning about these medications and administering them to people, i was too scared to take or try antidepressants or any CNS medication for a LONG while \n\nit’s like a breath of fresh air",
          "created_utc": 1743558626.0
        }
      ]
    },
    {
      "id": "mkycyo9",
      "author": "Positive-Secret7893",
      "body": "I’m so glad to hear that you’ve gotten relief too! I really hope this starts to be something that doctors actually prescribe. \nAnd yeah I hear you, miralax is also a godsend! But wildly enough SG also helped my IBS??",
      "created_utc": 1743556930.0,
      "score": 8,
      "context": [
        {
          "id": "mkycl9s",
          "author": "UnitDisastrous4429",
          "body": "Girl I've been meaning to write this same post. Semaglutide has saved my life. \n\nFor those that don't know, semaglutide -- and other GLP-1 Inhibitors -- are being used in trials for addiction treatment. It has proven to help people who are addicted to substances including alcohol and COCAINE. So it's NOT just about food and hunger. For me it quiets that constant, rampaging voice in my head. I come from a family of addicts. Bulimia is an addiction. SG allows me to have the wheel. My greatest concern actually is the fact that is slows GI mobility. So I'm careful to take the least possible. The LAST thing I want is staying full for long or indigestion!",
          "created_utc": 1743556786.0
        }
      ]
    },
    {
      "id": "ml2xtgw",
      "author": "Positive-Secret7893",
      "body": "It’s definitely in the back of my mind and something I’m nervous about. As of now, I’m not planning on tapering but I’m not opposed in the future - and especially if I have no choice! I hopeeee that a taste a freedom helps propel me forward",
      "created_utc": 1743624218.0,
      "score": 1,
      "context": [
        {
          "id": "ml1lcx2",
          "author": "turnipkitty112",
          "body": "This is such a complex and interesting issue. While I admit I have concerns about ppl obtaining GLP-1s illicitly and abusing them (ie. ppl with restrictive EDs), I also recognize that they can be game-changers for other folks. I’m glad to hear that your quality of life has improved; as someone who strongly believes in harm reduction, I’m all for that. I’m curious, do you see yourself taking semaglutide long term, or do you plan to taper off at some point? Have you discussed with your therapist how to sustain this amazing progress long term? I encourage you to think about this, in case your access or life circumstances change.",
          "created_utc": 1743610198.0
        }
      ]
    },
    {
      "id": "mkzd8r7",
      "author": "Theabsoluteworst1289",
      "body": "That’s what I’m wondering. I feel like I finally want to give in to the millions of ads blasted at me for it every day, but there’s no way I’d be prescribed it at my current size, which I’m not comfortable at but which isn’t majorly overweight.",
      "created_utc": 1743573071.0,
      "score": 7,
      "context": [
        {
          "id": "mkyos41",
          "author": "rescuecatmomlover",
          "body": "Can I ask how you get it if you aren't overweight & how much you pay for it?",
          "created_utc": 1743561393.0
        }
      ]
    },
    {
      "id": "mkzmswv",
      "author": "Positive-Secret7893",
      "body": "I honestly think there’s more to it that isn’t fully explained or talked about yet, because it’s definitely more. Binging never had anything to do with hunger, because it’s something you’re compelled to do even when you’re past the point of uncomfortably full. It’s starting to be documented as helpful for people with other addictions and overall impulse control (alcoholism, cocaine, etc) as a secondary benefit - but I think because food addiction is associated with obesity and people stigmatize “healthy weight people” taking it, actual eating disorders have taken a backseat.",
      "created_utc": 1743579148.0,
      "score": 8,
      "context": [
        {
          "id": "mkzjyc0",
          "author": "11brooke11",
          "body": "Maybe I'm wrong, but the fact that it does work for you seems to align with the theory that it suppresses hunger? It slows the digestion. Or maybe I'm misunderstanding your comment on food noise.",
          "created_utc": 1743577242.0
        }
      ]
    },
    {
      "id": "ml06ka0",
      "author": "springcat413",
      "body": "Food noise to me is different than hunger. Not being hungry has nothing to do with binging for me. Otherwise I’d stop when full…that’s why drugs that simply make me less hungry have never worked. It’s the unending need to eat - constantly, no matter what. It’s the addiction part of it, it actually is supposed to do something different in the brain, perhaps not yet fully understood.",
      "created_utc": 1743592047.0,
      "score": 4,
      "context": [
        {
          "id": "mkzjyc0",
          "author": "11brooke11",
          "body": "Maybe I'm wrong, but the fact that it does work for you seems to align with the theory that it suppresses hunger? It slows the digestion. Or maybe I'm misunderstanding your comment on food noise.",
          "created_utc": 1743577242.0
        }
      ]
    },
    {
      "id": "mkyeufc",
      "author": "Positive-Secret7893",
      "body": "After how long did you notice? For me the effect isn’t as strong but it’s still 1000x better than where I was a year ago",
      "created_utc": 1743557649.0,
      "score": 6,
      "context": [
        {
          "id": "mkye44x",
          "author": "user4957572",
          "body": "It wears off :/",
          "created_utc": 1743557372.0
        }
      ]
    },
    {
      "id": "ml0p687",
      "author": "Positive-Secret7893",
      "body": "Telemedicine, there are so many companies out there now",
      "created_utc": 1743600082.0,
      "score": 2,
      "context": [
        {
          "id": "ml09lcu",
          "author": "prematurehooray",
          "body": "Op and others, how did you get semaglutine? Your situation and feelings sound a lot like mine, but i think no doctor will prescribe it to me, since i’m mostly bmi 20-24",
          "created_utc": 1743593555.0
        }
      ]
    },
    {
      "id": "ml4zzn3",
      "author": "Positive-Secret7893",
      "body": "I’m not comfortable posting but I did find it via researching on subreddits!",
      "created_utc": 1743648612.0,
      "score": 1,
      "context": [
        {
          "id": "ml2u0wq",
          "author": "caviardominotuna",
          "body": "Are you allowed to post the telemedicine place that prescribed for you. I’d really like to see if this helps me, with the compulsion, but like you, i do not have weight to lose.",
          "created_utc": 1743623147.0
        }
      ]
    },
    {
      "id": "ml4ztmb",
      "author": "Positive-Secret7893",
      "body": "No, I focused on the binge behaviors",
      "created_utc": 1743648545.0,
      "score": 2,
      "context": [
        {
          "id": "ml457sa",
          "author": "poopysquatch",
          "body": "When you talked to the telemedicine folks, did you mention your bulimia? I’m worried if I were to mention my ED that they’d deny me. I just want the food noise to stop :(",
          "created_utc": 1743637606.0
        }
      ]
    },
    {
      "id": "mkzn8dy",
      "author": "Positive-Secret7893",
      "body": "I’m so sorry you’re going through that. I remember that “routine” very well - it was so rigid but more focused on those with anorexia, not bulimia. Also such a shame that insurance didn’t even cover most of it.\nStay strong!",
      "created_utc": 1743579446.0,
      "score": 2,
      "context": [
        {
          "id": "mkzlrbg",
          "author": "candyred1",
          "body": "I almost cried reading. I was heavy as a child so I thought hey I am going to do what all the models do, and I lost 70lbs in two years. I was 13. I have had bulimia since age 13. I am 47.\n\nI have twin girls who are teenagers, which is a miracle as they were born full term and healthy. For over a year now one has anorexia & bulimia. She was in patient twice, PHP then IOP. None of that even existed when I was younger, at least not unless you had $40,000 burning a hole in your pocket. We all know its years of recovering and you dont finish program and come out \"cured\". But still, the treatment she got had major flaws. It seemed so experimental, of course ED treatment is still in its infancy. One thing was the fact that every patient was not allowed exercise which I get but taking a walk everyday is healthy and good for mental health just as well. It wasnt allowed, even for patients who never engaged in strenuous exercise as part of ED. They had to finish 3 meals and two snacks daily or suppliment. We as a family have never really done 3 meals a day more than a few days of the week. Humans \"invented\" the 3 meal routine only in recent years, and its not because we \"finally have enough food to do so\". When she was in IOP we had to follow a strict schedule and provide and \"plate\" the 3 meals plus two snacks of course and the fact shes vegitarian (rest of family isnt) made options more difficult and I was literally exhausted trying to keep up. Shes doing better now 6 months at home. \n\nI look normal on the outside but the damage ive done to my body has been starting to creep up into daily life where I can't just be in denial anymore. The first 10 or so years was the worst of my bulimia, the last 10-15 years it wasnt every day anymore, but most. I am going to ask my doctor and show her your post. If she isnt willing to at least let me try it then I will keep asking till I find a doctor who will. Im at a \"normal\" weight for my height but just gained 15lbs in last year. This isnt my usual weight, and its caused my ED to get worse and im having a really hard time with it. As if getting older wasnt hard enough.",
          "created_utc": 1743578431.0
        }
      ]
    },
    {
      "id": "mkzn0l8",
      "author": "Positive-Secret7893",
      "body": "No one has asks outside of DMs! I got it via telemedicine, and I focused on the binging behaviors when I shared my medical history.",
      "created_utc": 1743579295.0,
      "score": 4,
      "context": [
        {
          "id": "mkzi6mc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743576109.0
        }
      ]
    },
    {
      "id": "ml4yoxb",
      "author": "rescuecatmomlover",
      "body": "she DMed me the info.",
      "created_utc": 1743648106.0,
      "score": 2,
      "context": [
        {
          "id": "mkzi6mc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743576109.0
        }
      ]
    },
    {
      "id": "ml4z4uw",
      "author": "Positive-Secret7893",
      "body": "I get it compounded and it just takes some research to figure out how and where. Also… you know what ain’t cheap? Buying a bunch of food you’re just going to purge 🙃",
      "created_utc": 1743648280.0,
      "score": 7,
      "context": [
        {
          "id": "ml4e396",
          "author": "beepbopboopbop69",
          "body": "you must have some deep pockets, OP $$$$",
          "created_utc": 1743640692.0
        }
      ]
    },
    {
      "id": "mkyh5cw",
      "author": "unremarkable_sapien",
      "body": "Agreed. It always strikes me as quite odd that doctors are so risk-averse when considering starting meds like GLP-1 agonists and stimulants for people with bulimia. I would argue that it’s riskier and more life-threatening to leave a patient b/p-ing for hours every day.",
      "created_utc": 1743558503.0,
      "score": 27,
      "context": [
        {
          "id": "mkyf9r7",
          "author": "unremarkable_sapien",
          "body": "Were you prescribed it? I can’t imagine a doctor green-lighting a weight-loss med for someone with a borderline underweight bmi. Regardless, I’m really glad that this is working for you. I too wish that people could recognise that food noise and hunger are different.",
          "created_utc": 1743557809.0
        },
        {
          "id": "mkyg32h",
          "author": "Positive-Secret7893",
          "body": "I was not, and I agree a doctor would not have. But honestly after all the harm I put my body through with decades of purging, I was willing to do as much research as I could on my own and take the risk. I really hope they study it more because it’s something that should be done with a doctors approval and oversight",
          "created_utc": 1743558111.0
        }
      ]
    },
    {
      "id": "ml5emni",
      "author": "Excellent-Guava6216",
      "body": "With all due respect - this is kind of dangerous to post then. As the above commenter mentioned, you’re borderline underweight, and I can see this post encouraging those with restrictive eating disorders to get their hands on a glp1\n\nAlso you must have massively lied about your weight even to get it perscribed via telemedicine, so I hope you’re comfortable being more honest with your pcp",
      "created_utc": 1743654929.0,
      "score": 4,
      "context": [
        {
          "id": "mkyf9r7",
          "author": "unremarkable_sapien",
          "body": "Were you prescribed it? I can’t imagine a doctor green-lighting a weight-loss med for someone with a borderline underweight bmi. Regardless, I’m really glad that this is working for you. I too wish that people could recognise that food noise and hunger are different.",
          "created_utc": 1743557809.0
        },
        {
          "id": "mkyg32h",
          "author": "Positive-Secret7893",
          "body": "I was not, and I agree a doctor would not have. But honestly after all the harm I put my body through with decades of purging, I was willing to do as much research as I could on my own and take the risk. I really hope they study it more because it’s something that should be done with a doctors approval and oversight",
          "created_utc": 1743558111.0
        }
      ]
    },
    {
      "id": "mkyk0cd",
      "author": "strawbeemocha",
      "body": "i’m glad yours is working for you too!!\n\nso far my only side effects are headaches so hopefully it stays that way and i don’t get any others lol \n\nit really is hard cuz even for substance abuse disorders there’s a lot of medications to help with sobriety. but ED is more of a hit and a miss with different medications because like you said, you can’t abstain from food. \n\ni’m just still shook bcoz this hasn’t felt real for me lol",
      "created_utc": 1743559568.0,
      "score": 3,
      "context": [
        {
          "id": "mkyhhct",
          "author": "strawbeemocha",
          "body": "not the even close to the same class of medication - but i finally reached out to my primary doc and he Rx’d a low dose of sertraline for me and the food noise just *poof* disappeared. i can actually differentiate when i’m hungry vs yearning for a sweat treat. im not obsessing over when i can eat the leftovers in the fridge. i’ve only been on it for a little over a week but i’m actually shocked. i dont know how long it’ll last but i’m glad i finally reached out. i feel like i can do things now without constantly seeking snacks which leads to b/p \n\nthe idea of being medicated was really aversive to me. i totally agree about the stigma around medication being SO strong. even as a nursing student learning about these medications and administering them to people, i was too scared to take or try antidepressants or any CNS medication for a LONG while \n\nit’s like a breath of fresh air",
          "created_utc": 1743558626.0
        },
        {
          "id": "mkyiiop",
          "author": "Positive-Secret7893",
          "body": "I’m SO glad you found something that’s working for you. I was prescribed fluoxetine awhile back and it helped a little but the side effects became unbearable, I could barely make it through the day without multiple naps. \n\nEating disorders are so tough bc you face your addiction all day, every day. There’s no “abstaining” and people still think it’s “in your head” or vanity - or if you could “just get to the bottom of emotions it will fix it.” Then when something like medication works you realize that while yes there’s definitely other issues at play, sometimes it’s just plain chemical and coping mechanisms turned brain wiring. So so happy for you.",
          "created_utc": 1743559007.0
        }
      ]
    },
    {
      "id": "ml4e56p",
      "author": "Groundbreaking_Pie94",
      "body": "I would imagine not binging and purging has helped your IBS lol",
      "created_utc": 1743640711.0,
      "score": 3,
      "context": [
        {
          "id": "mkycl9s",
          "author": "UnitDisastrous4429",
          "body": "Girl I've been meaning to write this same post. Semaglutide has saved my life. \n\nFor those that don't know, semaglutide -- and other GLP-1 Inhibitors -- are being used in trials for addiction treatment. It has proven to help people who are addicted to substances including alcohol and COCAINE. So it's NOT just about food and hunger. For me it quiets that constant, rampaging voice in my head. I come from a family of addicts. Bulimia is an addiction. SG allows me to have the wheel. My greatest concern actually is the fact that is slows GI mobility. So I'm careful to take the least possible. The LAST thing I want is staying full for long or indigestion!",
          "created_utc": 1743556786.0
        },
        {
          "id": "mkycyo9",
          "author": "Positive-Secret7893",
          "body": "I’m so glad to hear that you’ve gotten relief too! I really hope this starts to be something that doctors actually prescribe. \nAnd yeah I hear you, miralax is also a godsend! But wildly enough SG also helped my IBS??",
          "created_utc": 1743556930.0
        }
      ]
    },
    {
      "id": "mkznc2j",
      "author": "Positive-Secret7893",
      "body": "I did get it through telemedicine and focused on the binging behaviors when sharing my medical history",
      "created_utc": 1743579514.0,
      "score": 1,
      "context": [
        {
          "id": "mkyos41",
          "author": "rescuecatmomlover",
          "body": "Can I ask how you get it if you aren't overweight & how much you pay for it?",
          "created_utc": 1743561393.0
        },
        {
          "id": "mkzd8r7",
          "author": "Theabsoluteworst1289",
          "body": "That’s what I’m wondering. I feel like I finally want to give in to the millions of ads blasted at me for it every day, but there’s no way I’d be prescribed it at my current size, which I’m not comfortable at but which isn’t majorly overweight.",
          "created_utc": 1743573071.0
        }
      ]
    },
    {
      "id": "mkyqd3h",
      "author": "user4957572",
      "body": "After about a year and a half. It came back worse :(",
      "created_utc": 1743562020.0,
      "score": 7,
      "context": [
        {
          "id": "mkye44x",
          "author": "user4957572",
          "body": "It wears off :/",
          "created_utc": 1743557372.0
        },
        {
          "id": "mkyeufc",
          "author": "Positive-Secret7893",
          "body": "After how long did you notice? For me the effect isn’t as strong but it’s still 1000x better than where I was a year ago",
          "created_utc": 1743557649.0
        }
      ]
    },
    {
      "id": "ml7tl1z",
      "author": "ziggye13",
      "body": "Did they ask for medical records or anything like vitals and blood work? I've been curious about how it works with all these telemedicine prescribers. Also, do you still see a PCP that is aware of it or do you follow up with the same telemedicine doctor?",
      "created_utc": 1743694841.0,
      "score": 1,
      "context": [
        {
          "id": "ml457sa",
          "author": "poopysquatch",
          "body": "When you talked to the telemedicine folks, did you mention your bulimia? I’m worried if I were to mention my ED that they’d deny me. I just want the food noise to stop :(",
          "created_utc": 1743637606.0
        },
        {
          "id": "ml4ztmb",
          "author": "Positive-Secret7893",
          "body": "No, I focused on the binge behaviors",
          "created_utc": 1743648545.0
        }
      ]
    },
    {
      "id": "ml06aeo",
      "author": "springcat413",
      "body": "Oh! That is a Rx. I actually was confused by “not having it prescribed” getting it online through telemedicine is the same as seeing a dr in real time. I had to go that way as I was getting it through a program at my gyno until they refused to refill due to “binging” not being something they could deal with. It’s frustrating since I probably understand the psych aspects of it so much more than a random person, but alas.",
      "created_utc": 1743591904.0,
      "score": 6,
      "context": [
        {
          "id": "mkzi6mc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1743576109.0
        },
        {
          "id": "mkzn0l8",
          "author": "Positive-Secret7893",
          "body": "No one has asks outside of DMs! I got it via telemedicine, and I focused on the binging behaviors when I shared my medical history.",
          "created_utc": 1743579295.0
        }
      ]
    },
    {
      "id": "mpkolor",
      "author": "Subject-Pension-3027",
      "body": "Straight facts!!! I’ve probably spent over 40k in my lifetime on food, drinks, supplements to undo the damage, etc. oh wait, nevermind, the food noise has cost me well over 6 figures if you include the treatment centers I went to, and the useless therapy.",
      "created_utc": 1745885099.0,
      "score": 2,
      "context": [
        {
          "id": "ml4e396",
          "author": "beepbopboopbop69",
          "body": "you must have some deep pockets, OP $$$$",
          "created_utc": 1743640692.0
        },
        {
          "id": "ml4z4uw",
          "author": "Positive-Secret7893",
          "body": "I get it compounded and it just takes some research to figure out how and where. Also… you know what ain’t cheap? Buying a bunch of food you’re just going to purge 🙃",
          "created_utc": 1743648280.0
        }
      ]
    },
    {
      "id": "mlcozcn",
      "author": "Positive-Secret7893",
      "body": "I was prescribed it in the sense that I worked with and continue to work with the same telehealth provider. I also acknowledge this is not a solution for everyone, but the purpose of this post was to help remove the stigma (which is something clearly you’re still dealing with) as I was NOT underweight, but felt listing my weights could be triggering for people. I was 21 BMI when I started. And my provider honestly didn’t even focus as much on my weight when I explained that I could consume 1000s of calories in a sitting multiple times a week. \n\nWhat you’re saying is like going on a sub for severe depression and anxiety and commenting on a post that says “hey everyone this may not work for you but this drug saved my life! But everyone is judging me for taking it, so I want to help break the stigma!” And saying: “your post is dangerous bc people could misuse it.” \n\nI would say that 80-90% of this sub are people who suffer from binging, and this drug helps for binging. There’s a reason I didn’t post it in the general eating disorder or ano sub.\n\nThat being said, thank you for sharing your thoughts. I’m sorry you feel that way and am glad it’s seemed to help so many others",
      "created_utc": 1743763052.0,
      "score": 2,
      "context": [
        {
          "id": "mkyf9r7",
          "author": "unremarkable_sapien",
          "body": "Were you prescribed it? I can’t imagine a doctor green-lighting a weight-loss med for someone with a borderline underweight bmi. Regardless, I’m really glad that this is working for you. I too wish that people could recognise that food noise and hunger are different.",
          "created_utc": 1743557809.0
        },
        {
          "id": "mkyg32h",
          "author": "Positive-Secret7893",
          "body": "I was not, and I agree a doctor would not have. But honestly after all the harm I put my body through with decades of purging, I was willing to do as much research as I could on my own and take the risk. I really hope they study it more because it’s something that should be done with a doctors approval and oversight",
          "created_utc": 1743558111.0
        },
        {
          "id": "ml5emni",
          "author": "Excellent-Guava6216",
          "body": "With all due respect - this is kind of dangerous to post then. As the above commenter mentioned, you’re borderline underweight, and I can see this post encouraging those with restrictive eating disorders to get their hands on a glp1\n\nAlso you must have massively lied about your weight even to get it perscribed via telemedicine, so I hope you’re comfortable being more honest with your pcp",
          "created_utc": 1743654929.0
        }
      ]
    },
    {
      "id": "ml4xrup",
      "author": "Positive-Secret7893",
      "body": "Lol 🤷🏼‍♀️🤷🏼‍♀️",
      "created_utc": 1743647752.0,
      "score": 1,
      "context": [
        {
          "id": "mkycl9s",
          "author": "UnitDisastrous4429",
          "body": "Girl I've been meaning to write this same post. Semaglutide has saved my life. \n\nFor those that don't know, semaglutide -- and other GLP-1 Inhibitors -- are being used in trials for addiction treatment. It has proven to help people who are addicted to substances including alcohol and COCAINE. So it's NOT just about food and hunger. For me it quiets that constant, rampaging voice in my head. I come from a family of addicts. Bulimia is an addiction. SG allows me to have the wheel. My greatest concern actually is the fact that is slows GI mobility. So I'm careful to take the least possible. The LAST thing I want is staying full for long or indigestion!",
          "created_utc": 1743556786.0
        },
        {
          "id": "mkycyo9",
          "author": "Positive-Secret7893",
          "body": "I’m so glad to hear that you’ve gotten relief too! I really hope this starts to be something that doctors actually prescribe. \nAnd yeah I hear you, miralax is also a godsend! But wildly enough SG also helped my IBS??",
          "created_utc": 1743556930.0
        },
        {
          "id": "ml4e56p",
          "author": "Groundbreaking_Pie94",
          "body": "I would imagine not binging and purging has helped your IBS lol",
          "created_utc": 1743640711.0
        }
      ]
    },
    {
      "id": "ml7tvzw",
      "author": "Positive-Secret7893",
      "body": "They did not. I follow up with the same telemedicine doctor. My PCP does do regular bloodwork for me, but no I haven’t told her - I know I should but I also know I’ll get lectured and it’s something I’m going to do regardless. I stay on top of research of what to look out for",
      "created_utc": 1743694929.0,
      "score": 2,
      "context": [
        {
          "id": "ml457sa",
          "author": "poopysquatch",
          "body": "When you talked to the telemedicine folks, did you mention your bulimia? I’m worried if I were to mention my ED that they’d deny me. I just want the food noise to stop :(",
          "created_utc": 1743637606.0
        },
        {
          "id": "ml4ztmb",
          "author": "Positive-Secret7893",
          "body": "No, I focused on the binge behaviors",
          "created_utc": 1743648545.0
        },
        {
          "id": "ml7tl1z",
          "author": "ziggye13",
          "body": "Did they ask for medical records or anything like vitals and blood work? I've been curious about how it works with all these telemedicine prescribers. Also, do you still see a PCP that is aware of it or do you follow up with the same telemedicine doctor?",
          "created_utc": 1743694841.0
        }
      ]
    }
  ]
}