{
  "id": "1jrk1q1",
  "subreddit": "bulimia",
  "author": "wrenvevrain",
  "created_utc": 1743794007.0,
  "title": "Binging is sooo quirky 🤪",
  "selftext": "Every time someone notices that I overeat, they don't find it concerning, they find it to be a silly little trait. Just me having a sweet tooth. Big appetite.\n\nThe worst is when I tried to tell my mom about my binging problem. She just said to just not eat so much, that I just need to tell myself no... Like... She keeps making comments about my overeating, even to others. And the absolutely worst is she keeps buying my fear foods AFTER I begged her not to. \"Just control yourself\" \"You don't have to eat it in one sitting.\"\n\nI hate how it's Not viewed as a problem, but the moment she found out I went a day without eating anything she became so concerned, telling me how dangerous it is, how I need to eat ASAP or I might collapse or develop an eating disorder (💀).\n\nRestricting is disorded, but so is binging and I am so tired of listening to people talking about it as if it's just me being a little bit more hungry and not a problem. It is a problem.\n\nSo many people don't get help because of this...",
  "url": "https://www.reddit.com/r/bulimia/comments/1jrk1q1/binging_is_sooo_quirky/",
  "score": 79,
  "num_comments": 10,
  "comments": [
    {
      "id": "mlffefv",
      "author": "Vegetable-Ranger2972",
      "body": "Oml you’re so real for that. I swear, when I told my mom about it she was like “it’s normal to eat that much when you’re under stress or when you’re on your period.” I mean, yeah I can eat a whole bag of chocolate chip cookies in one sit when I’m stressed, but a binge is wanting to eat two chocolate bars, then a whole plate of pasta and then five different types of cookies, so it’s not really “normal” as everyone thinks. It’s painful because you can’t even control your own body, so it’s not only physically but psychologically devastating also. It sucks, but only if you’re in that situation you’ll understand it lol",
      "created_utc": 1743795981.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mlfgmr9",
      "author": "ExistingWallflower",
      "body": "Oh my god I HATE when people say shit like that. I had problems with binging before my eating disorder became restrictive, and I tried to reach out for help back then but was ignored. People didn't take me seriously because my ED behaviours didn't lead to weight loss. Now that I'm smaller, people are suddenly concerned... It definitely doesn't help with the \"I'm not worth caring about unless I'm skinny\" mindset that so many ED sufferers have.",
      "created_utc": 1743796357.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mlhd4z7",
      "author": "None",
      "body": "Bulimia is the worst thing ever honest to god the amount of sick bags about my room that I’m waiting for my mum to leave so a can fling them out is disgusting why would anyone want to live this way? It’s so bad my bestfriend cried in my face drunk in my face to stop with tears down her face",
      "created_utc": 1743820937.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mlhdbso",
      "author": "None",
      "body": "Sorry I’m just posting to get this off my chest but if I could turn back time and never do it I wish it’s start off as the one time I’m going to be sick eating to much then it’s every time then it’s every time you eat it’s disgusting I hate myself for it",
      "created_utc": 1743821016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mls12g0",
      "author": "audreyswife",
      "body": "i totally relate. i've always been a binger, it was my first vice way back in middle school. even before that i loved eating and food in general, my mom told me i would always ask for seconds at lunch during preschool. as much as it would have hurt at the time, i wish someone would have said something. i wish i would have been able to stop that habit before it became a problem, i'm doing way better now but it's going to take me at least a year to get down to my goal weight. i wish someone would have recognized that it wasn't just a silly quirk, but a really unhealthy habit that was going to cause lots of issues for me down the line.",
      "created_utc": 1743981416.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm0d7ml",
      "author": "None",
      "body": "Relatable as fuck",
      "created_utc": 1744106836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlfrgxu",
      "author": "wrenvevrain",
      "body": "They think it's normal because they don't see the mental pain we feel after binging.",
      "created_utc": 1743799677.0,
      "score": 6,
      "context": [
        {
          "id": "mlffefv",
          "author": "Vegetable-Ranger2972",
          "body": "Oml you’re so real for that. I swear, when I told my mom about it she was like “it’s normal to eat that much when you’re under stress or when you’re on your period.” I mean, yeah I can eat a whole bag of chocolate chip cookies in one sit when I’m stressed, but a binge is wanting to eat two chocolate bars, then a whole plate of pasta and then five different types of cookies, so it’s not really “normal” as everyone thinks. It’s painful because you can’t even control your own body, so it’s not only physically but psychologically devastating also. It sucks, but only if you’re in that situation you’ll understand it lol",
          "created_utc": 1743795981.0
        }
      ]
    },
    {
      "id": "mlfl3ao",
      "author": "Zestyclose_Power_392",
      "body": "Not to mention the public and cultural fascination and repulsion with thinness. Such a catch 22. Western culture is so twisted and demoralizing.",
      "created_utc": 1743797715.0,
      "score": 7,
      "context": [
        {
          "id": "mlfgmr9",
          "author": "ExistingWallflower",
          "body": "Oh my god I HATE when people say shit like that. I had problems with binging before my eating disorder became restrictive, and I tried to reach out for help back then but was ignored. People didn't take me seriously because my ED behaviours didn't lead to weight loss. Now that I'm smaller, people are suddenly concerned... It definitely doesn't help with the \"I'm not worth caring about unless I'm skinny\" mindset that so many ED sufferers have.",
          "created_utc": 1743796357.0
        }
      ]
    },
    {
      "id": "mlhrvqn",
      "author": "Zestyclose_Power_392",
      "body": "Right?!?!! No one wants this life. No one wants these neverending thoughts--it's physical/emotional torture (esp the shame). But oooh I guess we're all just dumb and vain, only wanting be be skinny, right... Ugh. People are so fucking callous and ignorant.",
      "created_utc": 1743827744.0,
      "score": 4,
      "context": [
        {
          "id": "mlhd4z7",
          "author": "None",
          "body": "Bulimia is the worst thing ever honest to god the amount of sick bags about my room that I’m waiting for my mum to leave so a can fling them out is disgusting why would anyone want to live this way? It’s so bad my bestfriend cried in my face drunk in my face to stop with tears down her face",
          "created_utc": 1743820937.0
        }
      ]
    }
  ]
}