{
  "id": "1jtva12",
  "subreddit": "bulimia",
  "author": "HungryProfessor8362",
  "created_utc": 1744057348.0,
  "title": "My friend said that \"thin privilege\" isn't real",
  "selftext": "I was trauma dumping to my friend today about how i was called fat a lot as a kid so i lost lots of weight in high school and people started treating me differently, and were overall just nicer to me. But she thinks that that was just something i made up in my head? It felt really shitty and i got all defensive. But people did genuinely treat me better, it was so much easier to talk to others and make friends when i was thinner. Maybe she doesnt think its real because she hasn't experienced it?\n\n Do you guys think thin privilege is real? Or is it something we make up in our minds?",
  "url": "https://www.reddit.com/r/bulimia/comments/1jtva12/my_friend_said_that_thin_privilege_isnt_real/",
  "score": 95,
  "num_comments": 32,
  "comments": [
    {
      "id": "mlx9fly",
      "author": "Agreeable-Dog-1131",
      "body": "anyone who’s been fat and gotten thin will tell you people treat them very differently. some people might get testy about the word “privilege” even if it’s accurate, but there’s no denying that the halo effect for thin people is very real.",
      "created_utc": 1744058129.0,
      "score": 98,
      "context": []
    },
    {
      "id": "mlx9dl6",
      "author": "Traditional_Use_4543",
      "body": "I definitely think it can be real and it can also have to do with you having more confidence in yourself/body.  It really depends on the people involved imo.  But I also think it can be similar to pretty privilege with how that also depends on the ppl involved but in general you are given a lot more grace.  Same applies to thin privilege.  On average I think non fat/obese people are given more understanding and grace but it also has a horse shoe kinda effect where if you're too skinny you face the same kind of judgement as heavier set people",
      "created_utc": 1744058111.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mlxa8kt",
      "author": "derederellama",
      "body": "I'm sorry she said that to you. It is absolutely fucking real, and I will die on that hill. I was teased for being chubby my whole childhood, even by a couple of adults. My mother was also obese for most of my childhood, and I still vividly remember the cruel way she was treated by so many people. So much of my life has been consumed with shame and anxiety about my weight. It is the reason I developed bulimia at age sixteen and have been struggling on and off with it since. I couldn't get a boyfriend until I'd lost forty pounds. A person who has never been overweight has the *privilege* of not having to endure all the stigma.",
      "created_utc": 1744058375.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mlxsrax",
      "author": "sanguinesecretary",
      "body": "The only people who would say that are people who have never been big. I’ve never met anyone who’s been fat who wouldn’t confirm this as truth",
      "created_utc": 1744064444.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mlxdckd",
      "author": "TrooperJordan",
      "body": "As someone that’s been UW —> obese and everything in between- I was definitely treated better when “skinny”. People approached me more, more women were attracted to me, more people wanted to be my friend and socialize/go out with me. When I was presenting as a woman (I’m ftm) I got to skip lines at the club compared to when I was larger. \n\nIt’s definitely a thing. It didn’t impact important things like my job, school or true friends, but it came in to play in the little things. Because it impacts little things, people who have been “skinny” their whole lives may not notice. People are still kind to me now and I can still make friends and find women to date now that I’m at the “higher end of normal weight”, but it was definitely easier the less I weighed.",
      "created_utc": 1744059344.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlxgyei",
      "author": "TransFat88",
      "body": "(Long, potentially triggering, discussion of fatphobia and discrimination.)\n\nOh it’s 100% real. I’ve experienced medical discrimination more than once from multiple sources over my weight. My LW was overweight and right now I’m considered obese. A medication that literally saved my life was initially denied to me (I contacted someone above the provider’s head) in 2013(?) because it might raise my blood pressure. All of my labs and stuff were normal at that point. \n\nAlso tell me when skinny people have to pay extra for clothing being smaller than more common sizes? I get that some very petite individuals have trouble finding sizes in stores, but they’re not charged a premium or anything. \n\nAnyway, all you have to do for sources is go on google. There have been plenty of studies showing that hiring managers discriminate against bigger people when it comes to workplace employment and there are tons of other examples in other fora. People assume smaller people understand nutrition and bigger folks are just too stupid to understand how to eat a vegetable or something. \n\nEven Harry Potter is fatphobic. Every single character who is described as not-thin is a villain. She even goes into details about just HOW not-thin they are to emphasize it.",
      "created_utc": 1744060504.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mm04bi0",
      "author": "Cumbersomesockthief",
      "body": "I've never been big, but I have gained a ton of weight in a short duration of time. People treat me noticeably different from when I was thinner. This is partially because high school is awful and girls have no shame in admitting that they put you on a pedestal because of your body. I feel so obtrusive now that I've gained weight; like I'm so huge I disturb things.",
      "created_utc": 1744101069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlykrrb",
      "author": "EducationalCheetah79",
      "body": "It exists and there’s science and papers backing it lol…maybe your freind is young or hasn’t experienced much of the world",
      "created_utc": 1744074362.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlylv08",
      "author": "lisa6547",
      "body": "I wouldn't call it a \"privilege\" but people definitely treat you differently based on how you look. It's very real",
      "created_utc": 1744074761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm07r11",
      "author": "Mylove-kikishasha",
      "body": "I don’t really believe in thin privilege, but I do believe in pretty privilege, and I think this so called thin privilege is kinda part of it, though not exactly. Of course human beings treat other humans different if they find then physically more attractive or healthy looking. It is a part of life that will not change. But also fat people often have a certain defeatist attitude that they don’t realise impact their interactions with others. \nI think thin privilege is sometimes the kind of term people use when complaining about fatness instead of doing something To change it. This kind of narrative has led some fat activist to compare fatness with skin colour, sexual orientation and other. I stay away from that kind of langage. I’ve never truly been medicaly obese, rather I have been some level of « overweight » my whole life with some « normal » weight in my twenties (but I was also restricting a lot). This is how I feel about that term.",
      "created_utc": 1744103377.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlxlgoj",
      "author": "Additional_Disk1145",
      "body": "To some extent I’m sure people do treat you differently. I also know that people who lose weight because they’re bullied typically disliked their fatter bodies and themselves. They were likely more insecure and this reflected in how they interacted with others and how others perceived them. Once they lose the weight, they change their self-perception and start seeing themselves as more “attractive”, “desirable”,  “outgoing” and this reflects in their personality and behaviour. So yes there are people who are shallow and will treat you differently simply because you’re thin vs fat, however most people are simply reacting to how you present yourself in your actions, speech, and behaviour. \nKeep in mind there are fat people who have lots of friends and people love being around them, and there are thin people who no one wants to be around because their attitude is trash",
      "created_utc": 1744061983.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlyd8um",
      "author": "BilboCatSock",
      "body": "Thin privilege is so real. I went from morbidly obese to a normal weight and the way I’m treated is shocking. When I lost the weight people straight up told me that I was prettier. Even, my own family treats me better. It’s genuinely so depressing.",
      "created_utc": 1744071606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm2srkp",
      "author": "maryamsayagh",
      "body": "Regardless of if it's real, your experience is your experience and no one has a say about it but only you. \nAnyone who unvalidates your experience regardless if it's a singular or global phenomenon shouldn't belong next to you unless they start treating you better.",
      "created_utc": 1744136852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm2tux8",
      "author": "maryamsayagh",
      "body": "If you are thin you have thin privilege unless you are anorexia kinda thin. Thin people with bad body image won't feel that it's a privilege tho, the more people say it the more their body image gets worst. \nSo fat shaming is a global experience, but skinny shaming is also some people's experience",
      "created_utc": 1744137178.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm3s37c",
      "author": "Bitter-Major-5595",
      "body": "100000000000% REAL. I’ve been morbidly obese & “skinny”, made fun of & then catcalled & whistled at, while just walking to class (25yrs ago). There’s no doubt there’s a difference, lol!! I’m 48yo now, & it’s probably the #1 reason I still struggle with BD & self esteem issues as my weight increases. Weight is people’s 1st impression of you; even though it’s not accurate, people use it to judge your self control & motivation before you even open your mouth. It’s sad…",
      "created_utc": 1744147132.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm4vcrh",
      "author": "CateoftheWoods",
      "body": "It is absolutely a thing! As an adult I've been both thin &pretty then overweight and less conventionally attractive after breaking my neck in a bad accident. You can't tell I'm disabled so it's only my looks that changed on the outside. The way I'm perceived and treated is soooooo different. 3 years after my injury I'm slipping back into anorexia, losing weight quickly and regaining my old looks thru physical therapy and the last of my surgeries. \n\nI'm now again regaining pretty privilege and it's shocking how differently I'm being treated as of a few months ago.",
      "created_utc": 1744160372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm500ic",
      "author": "pipedreamweed",
      "body": "The halo effect is real and weight is a playing factor in that. Anyone who doesn't think that weight affects how you are treated is in denial. It doesn't mean that all skinny people are treated better than all fat people. There are for sure people out there who are bigger than me who are more attractive and treated better. But overall attractiveness impacts how people treat you and weight plays a part.",
      "created_utc": 1744162030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm81njw",
      "author": "danceforthesky",
      "body": "I mean in this situation the word might be wrong, is it right to see being not bullied as a privilege? It should be the norm, a basic right that everyone should be entitled to (safety), and it's awful that it's not. because people are awful. I was bullied and was \"thin\" growing up, they just find something else to target you for. I might just be getting caught up on the words though..",
      "created_utc": 1744211226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmek7dg",
      "author": "Ok_Froyo_6202",
      "body": "It's definitely real. But people who were never fat can hardly understand it.",
      "created_utc": 1744299378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmidxy8",
      "author": "AmberSal21",
      "body": "I’ve experienced it first hand. I was being made fun of when I was at the heaviest and when I started to lose the weight I started to get the attention the ED craved. Craved it so much that I ended up at a life threatening weight. “Thin privilege” or however people put it, it’s a real thing.",
      "created_utc": 1744344899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mn2nlwe",
      "author": "Willing-Ad2342",
      "body": "hah, as someone who's literally been simply average for the past few years after recovery and then relapsed I promise you that thin privilege is so real. I literally get paid more in tips at my job because of it. People will hold doors for me. People in general are more welcoming and friendly to me. And no, it's not because I'm more confident. It's because I'm a petite, thin woman with good bone structure so people see me as the beauty standard.\n\nLittle do they know I'm dying inside. I used to be FAT (like bmi 30 fat.) Living with this knowledge has made it so any weight gain is life-ruining to my brain.",
      "created_utc": 1744643686.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlxe6xj",
      "author": "CacaoMilfMama",
      "body": "ive been through it so ik it’s real and probably why i have been in limbo w my ed. i hate the idea that if i gained weight id be treated differently bc ik it’s coming",
      "created_utc": 1744059609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlxhcgc",
      "author": "lonely-blue-sheep",
      "body": "Japan is proof that thin privilege is real",
      "created_utc": 1744060633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlxiish",
      "author": "Common_Willingness51",
      "body": "I would say... when you arrived a normal line. No much difference? I feel if you were relatively fat, yes much different. If you had been normal. Normal vs skinny, no much difference?",
      "created_utc": 1744061012.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlxz6je",
      "author": "fireflashthirteen",
      "body": "Both.   \n  \nI'm sure people do treat us better.   \n  \nBut do they treat us THAT much better, as well as we think they do? Probably not.",
      "created_utc": 1744066664.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlz2h3o",
      "author": "Rioltan",
      "body": "As someone that was a fat teen and then I became a thin young adult in college, I can tell the difference in how people will treat me. And now I'm a fat adult I can tell the difference.\n\nWhen I was a fat teen, most of the people working at clothing stores will give me the biggest size they had just to make fun of me, and will laugh out loud especially after I returned the blouse or the dress because it was too small for me.\n\nOn the other hand, when I was a young adult at 18, most girls at working stores would treat me with a big smile, and will help me to find anything, will always be nice and make nice compliments to me. Not a single laugh, not a single bad comment. \n\nAnd this will apply to almost every interaction: any male will give me their spot at the public transport, or will let me go first in line, overall and no just males but everyone would always have a good mood and nice manners towards me.\n\nPart of why it was so hard to accept recovery from bulimia was because the fact that people will treat me better was like being on a hard drug. They will treat you like an actual human being.\n\nNowadays I'm conscious a lot of people on the street will give me side eyes or will directly stare at me but I'm going through a process to get better because my ED has its origin on complex trauma.\n\nYou are not imagining any of this. If your friend has been always considered thin, there's no way they can understand you.",
      "created_utc": 1744080948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlxilng",
      "author": "One-Importance7269",
      "body": "Both.  I think the energy you really give off is reflected back to you.  I am baffled when heavier people have such great personalities and confidence and are genuinely blessed and happy in life.  It’s like seeing a unicorn 🦄 \nIt makes me realize how heavily programmed I am tho.  I would love to be so confident no matter what I look like I can admit I’m not there yet but I’m working on it.  My motto is the world will treat me how I treat myself.  I believe there has been some elitist agenda that has perpetuated pretty well so far, but I also believe we are entering a new time where we can clear all that away by choice.  They know we create our own realities that’s why they preach to us so hard and manipulate.  Nobody can really “make” you do anything it’s always your choice every time.  For every thought you don’t prefer insert a thought you would like until it’s automatically your belief.",
      "created_utc": 1744061038.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mm1tl3j",
      "author": "RainbowTowers9",
      "body": "I came here to say this too. There’s a fine line. They treat you better yes but when you are judged to be too thin you get shut out again.",
      "created_utc": 1744126682.0,
      "score": 2,
      "context": [
        {
          "id": "mlx9dl6",
          "author": "Traditional_Use_4543",
          "body": "I definitely think it can be real and it can also have to do with you having more confidence in yourself/body.  It really depends on the people involved imo.  But I also think it can be similar to pretty privilege with how that also depends on the ppl involved but in general you are given a lot more grace.  Same applies to thin privilege.  On average I think non fat/obese people are given more understanding and grace but it also has a horse shoe kinda effect where if you're too skinny you face the same kind of judgement as heavier set people",
          "created_utc": 1744058111.0
        }
      ]
    },
    {
      "id": "mlxbx4w",
      "author": "HungryProfessor8362",
      "body": "Im so sorry for what you had to experience as a kid, i was also name called alot and mostly by adults. Kids wouldnt joke about my weight but they weren't exactly friendly towards me either.  If only people realized the weight of their words and how it can affect a child",
      "created_utc": 1744058897.0,
      "score": 4,
      "context": [
        {
          "id": "mlxa8kt",
          "author": "derederellama",
          "body": "I'm sorry she said that to you. It is absolutely fucking real, and I will die on that hill. I was teased for being chubby my whole childhood, even by a couple of adults. My mother was also obese for most of my childhood, and I still vividly remember the cruel way she was treated by so many people. So much of my life has been consumed with shame and anxiety about my weight. It is the reason I developed bulimia at age sixteen and have been struggling on and off with it since. I couldn't get a boyfriend until I'd lost forty pounds. A person who has never been overweight has the *privilege* of not having to endure all the stigma.",
          "created_utc": 1744058375.0
        }
      ]
    },
    {
      "id": "mlxh7ld",
      "author": "TransFat88",
      "body": "Seriously send your friend to me, I will write them an essay and source it.",
      "created_utc": 1744060588.0,
      "score": 0,
      "context": [
        {
          "id": "mlxgyei",
          "author": "TransFat88",
          "body": "(Long, potentially triggering, discussion of fatphobia and discrimination.)\n\nOh it’s 100% real. I’ve experienced medical discrimination more than once from multiple sources over my weight. My LW was overweight and right now I’m considered obese. A medication that literally saved my life was initially denied to me (I contacted someone above the provider’s head) in 2013(?) because it might raise my blood pressure. All of my labs and stuff were normal at that point. \n\nAlso tell me when skinny people have to pay extra for clothing being smaller than more common sizes? I get that some very petite individuals have trouble finding sizes in stores, but they’re not charged a premium or anything. \n\nAnyway, all you have to do for sources is go on google. There have been plenty of studies showing that hiring managers discriminate against bigger people when it comes to workplace employment and there are tons of other examples in other fora. People assume smaller people understand nutrition and bigger folks are just too stupid to understand how to eat a vegetable or something. \n\nEven Harry Potter is fatphobic. Every single character who is described as not-thin is a villain. She even goes into details about just HOW not-thin they are to emphasize it.",
          "created_utc": 1744060504.0
        }
      ]
    },
    {
      "id": "mm2t7y1",
      "author": "maryamsayagh",
      "body": "\"Instead of doing something to change it\"?? Do you recognize that you are saying this in a bulimia subredit? Do you understand that you are literally telling sick people to \"just stop being sick\" ??",
      "created_utc": 1744136986.0,
      "score": 3,
      "context": [
        {
          "id": "mm07r11",
          "author": "Mylove-kikishasha",
          "body": "I don’t really believe in thin privilege, but I do believe in pretty privilege, and I think this so called thin privilege is kinda part of it, though not exactly. Of course human beings treat other humans different if they find then physically more attractive or healthy looking. It is a part of life that will not change. But also fat people often have a certain defeatist attitude that they don’t realise impact their interactions with others. \nI think thin privilege is sometimes the kind of term people use when complaining about fatness instead of doing something To change it. This kind of narrative has led some fat activist to compare fatness with skin colour, sexual orientation and other. I stay away from that kind of langage. I’ve never truly been medicaly obese, rather I have been some level of « overweight » my whole life with some « normal » weight in my twenties (but I was also restricting a lot). This is how I feel about that term.",
          "created_utc": 1744103377.0
        }
      ]
    },
    {
      "id": "mm3xd6x",
      "author": "Mylove-kikishasha",
      "body": "Well I am specifically talking about the people from the fat activist community. I have suffered from ED most of my whole life, and stand by what I say in that comment. Being bullimic and being in denial about your fatness through the fat activist community is not the same",
      "created_utc": 1744148774.0,
      "score": 0,
      "context": [
        {
          "id": "mm07r11",
          "author": "Mylove-kikishasha",
          "body": "I don’t really believe in thin privilege, but I do believe in pretty privilege, and I think this so called thin privilege is kinda part of it, though not exactly. Of course human beings treat other humans different if they find then physically more attractive or healthy looking. It is a part of life that will not change. But also fat people often have a certain defeatist attitude that they don’t realise impact their interactions with others. \nI think thin privilege is sometimes the kind of term people use when complaining about fatness instead of doing something To change it. This kind of narrative has led some fat activist to compare fatness with skin colour, sexual orientation and other. I stay away from that kind of langage. I’ve never truly been medicaly obese, rather I have been some level of « overweight » my whole life with some « normal » weight in my twenties (but I was also restricting a lot). This is how I feel about that term.",
          "created_utc": 1744103377.0
        },
        {
          "id": "mm2t7y1",
          "author": "maryamsayagh",
          "body": "\"Instead of doing something to change it\"?? Do you recognize that you are saying this in a bulimia subredit? Do you understand that you are literally telling sick people to \"just stop being sick\" ??",
          "created_utc": 1744136986.0
        }
      ]
    }
  ]
}