{
  "id": "1k6odnw",
  "subreddit": "bulimia",
  "author": "Due-Green2873",
  "created_utc": 1745488609.0,
  "title": "My 14 yo daughter just told me she’s bulimic 🥺",
  "selftext": "Feeling very heartbroken for my beautiful daughter who at Easter, admitted that she’s been binging and throwing up for the last 2 to 3 years.  She’s hidden it very well, but in the last couple of weeks, I’ve noticed a few signs.  I’m taking her to the GP next week and we’ll be asking for a referral to SEDS (Australian Service). But I’m wondering if anyone is able to tell me what we’re in for. Is this potentially something that we will be able to stop completely given that she’s so young or am I being naïve? Is this something that’s going to last her lifetime? I’m just so scared for her.",
  "url": "https://www.reddit.com/r/bulimia/comments/1k6odnw/my_14_yo_daughter_just_told_me_shes_bulimic/",
  "score": 138,
  "num_comments": 39,
  "comments": [
    {
      "id": "morh4c3",
      "author": "127may",
      "body": "recovery is always possible, it’s hard work but it’s possible. please don’t give up on her. you are doing the right thing getting her help, even if services aren’t always notorious for being “the best”. it’s better than nothing.\ni don’t know what australian services are like, but just keep being there for your daughter.\nbulimia is hard because it is like an addiction, there is most likely a deep rooted problem that needs addressing, but she can do it ❤️",
      "created_utc": 1745489098.0,
      "score": 73,
      "context": []
    },
    {
      "id": "morgwbn",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1745488974.0,
      "score": 32,
      "context": []
    },
    {
      "id": "morrajl",
      "author": "-ExistentialNihilist",
      "body": "It's a great sign that she's opened up to you. Keep being there for her and check in with her ❤️\n\nBulimia is not the problem, just the coping mechanism. There is something going on underneath this that is causing her pain. She likely is not aware of what is truly wrong or why she is doing this. Therapy should be able to help. Is she having problems at school, with friendships, any family problems?\n\nYou can help her with meals and stay with her afterwards to avoid purging if she would like you to. You could try distraction activities together for half an hour after meals or just stay with her and hug her/talk to her/hold her hand. It's best to ask her how you can help so she's comfortable or suggests things and ask her if that would be okay. But it's important to not be too controlling or force her to stop the bulimic behaviours. The most important thing is letting her know she is loved by you no matter what and that you'll always be there for her. \n\nIf you can get to the root of the psychological wound that is causing the eating disorder and heal it, she will be able to stop the behaviours. That's why I believe eating disorder relapse is so common because treatment tends to focus on stopping the behaviours without treating the underlying causes. If you take away someone's coping mechanism but not the cause of it, it won't be sustainable long term.\n\nBut please try not to worry, the fact you're here asking and trying to help her means she is already at a huge advantage to make a full recovery ❤️\n\nEdit: I was 14 when I became bulimic. I'm 25 and recovered now.",
      "created_utc": 1745494132.0,
      "score": 25,
      "context": []
    },
    {
      "id": "morpynd",
      "author": "unremarkable_sapien",
      "body": "You’re in for a long hard battle. Up until now, she’s kept it hidden, but now that you know and are trying to intervene, it’s going to feel like everything is blowing up. Recovery is absolutely possible, and she’s so young, she really does have a good chance of completely getting better. Please be there for her and love her no matter what. There will be arguments and you might feel like your daughter is slipping away, but I promise she’s still there. She’s just scared and needs her mum.\n\nIf you’re going through the public system, don’t expect much support. Although I’m not sure where you are and so it might be better than what was offered to me what I was your daughter’s age. Try to get her a good GP that you both like and trust. She’ll need regular monitoring. And get her an EDP so that she can access 40 medicare-rebated psychologist sessions a year. Early intervention is key and you sound like an amazing mum so please don’t give up and don’t settle for anything less than recovery. I wish my parents had pushed me harder when I was a teenager. \n\nI’m in NSW, if you have any questions at all please feel free to ask. This post has honestly stirred something up inside of me and I want to do anything that I can to stop someone going down the path that I went.",
      "created_utc": 1745493543.0,
      "score": 23,
      "context": []
    },
    {
      "id": "moruftc",
      "author": "troad5678",
      "body": "17 years bulimia completely free. Hugs from Italy. It Is so much worth It.",
      "created_utc": 1745495467.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mot06hm",
      "author": "ThestralBreeder",
      "body": "If you can actually have her willingly engage in intensive inpatient or a daily outpatient program, I would HIGHLY recommend it. I told my parents that I was bulimic at 15 (started at age 8) and they just sort of handed me to a 1x a week therapist and didn’t really stay involved in my treatment. I didn’t actually stop purging until 27! There are many times I look back and wish that I had really done an intensive program, but at the time I was so focused on school and not wanting any disruptions.",
      "created_utc": 1745508997.0,
      "score": 8,
      "context": []
    },
    {
      "id": "moso7ft",
      "author": "Dull-Veterinarian-59",
      "body": "Can’t give you advice that wasn’t already given, but I CAN tell you that I am sososo happy she told you and that you are giving her help and support. I know from my own parents how hard it’s been for them too, and it’s important that you talk to someone about how you feel as well because being the parent of a sick child is sometimes even harder than it is for the person suffering from the illness. Sending hugs and prayers that she’ll pull through soon enough 🫶🫶",
      "created_utc": 1745505542.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mot9usd",
      "author": "cybertrains",
      "body": "i became bulimic at 12, i am now 21. it is a lifelong struggle. for me, i have my good days and bad days. i would say that mine is not as bad as it was several years ago but i still have body issues urges i have to fight. sometimes i win, sometimes i lose. she CAN recover but may still struggle at times. please, please, please be there for her as much as possible. this disease is awful. i had told my mother that i am bulimic and begged her to take me to get my throat looked at because i was worried i had caused damage. she took me but neither of my parents provided support. they would make jokes and my father would yell at me if he caught me. this will be difficult for both of you guys. you may feel lost and angry because you feel like your help is not enough but i can promise you, any kind of support is appreciated. i’m wishing you both luck in this. ",
      "created_utc": 1745511742.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mot1ufz",
      "author": "AgreeableMoose",
      "body": "My heart breaks for you and your child. The upside is she can lead a wonderful life if she follows the program. It’s an addiction that comes the all the things that come with addiction. Comorbidity must be addressed to determine the underlying cause. Depression, anxiety, bipolar, and a few others will get explored as one does not simply wake up one day with bulimia. Don’t waste time on traditional counseling. Care, time and money is wasted if the counselor(s) do not specialize in eating disorders. Those counselors should be able to provide you with a Friends and Family support group. In the US they are held every Wednesday at 7pm local time online via Zoom. Your daughter coming to you is a positive sign that she is willing to work this out, that’s significant. Regarding counseling, her perspectives, the way she hears things, and her information processing is different than ours. The counselor lead in my area sets it up this way- you and or /partner/sibling get a counselor and she gets a counselor and a third counselor is assigned for the other 2 counselors to cross talk with and compare notes (3 sides to every story). Then they proceed with solutions and options. In 3-5 months you and your daughter can be a changed young lady.",
      "created_utc": 1745509468.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mos2up6",
      "author": "laurandisorder",
      "body": "Hi OP - I have sent you a DM with some names that may be able to help out as I am also Adelaide based x",
      "created_utc": 1745498698.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mow4sip",
      "author": "Celui-the-Maggot",
      "body": "I struggled for a decade. But now I'm in my thirties and have no desire to continue the eating disorder. She needs to be willing to make the changes and do the hard work and it may take years of battling it. But recovery is absolutely possible. Getting her support now is a great first step. This stuff is not easy, for her or for you. But you're already going in the right direction.",
      "created_utc": 1745543287.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mow56br",
      "author": "lisa6547",
      "body": "It's been a long struggle in my life personally, (I'm 35 by the way)...for me it was started with emotional issues that were never resolved 😞 \n\nThe only reason I stopped forcing myself to throw up was because I started getting so addicted to vodka to the point where it was lethal. I've been seeing therapists and psychiatrists, but nothing has helped much so far\n\nIt's a hard journey to go down, but all I can say is just get all of the professional help that you can.\n\nBecause one addiction leads to another...😟 In my case at least, and likely for a lot of others",
      "created_utc": 1745543420.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mox0rtr",
      "author": "candyred1",
      "body": "Ive had bulimia for 35 years. 1.5 yrs ago one of my twin girls became anorexic & bulimic at times. She didnt know about mine until I shared with her at that point. \n\nShes 15. Last year she spent months in residential, then few more PHP, then IOP. I am very thankful for the help she got. However, I know that its going to be a long hard journey still. Some aspects of the program I completely disagreed with. \n\nFeel free to message me with questions.",
      "created_utc": 1745555004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moxwzxc",
      "author": "eisheth13",
      "body": "First off, I want to congratulate YOU. Your daughter opened up to you, and that is huuuuge!!! From personal experience I’ve found that shame and secrecy are bulimia’s best friends, but having a safe person to open up to is step one on the road to recovery. You’re the safe person. You’ve done step one. Please give yourself some kudos for that!\nNow, onto what to expect from here. I’m in NZ, so similar-but-also-very-different to you in Aussie. In my experience, the specialised eating disorder services were useless, since I wasn’t clinically underweight, so they basically wouldn’t take me as a patient. However, they did refer me to the general mental health services, where I was able to have free weekly meetings with a therapist to unpack the underlying issues I had. Bulimia doesn’t just pop up out of nowhere, there are always underlying things going on, could be depression, anxiety, ocd, or in my case, ptsd. Whatever is going on with your daughter, it seems like she’s ready to talk about it and unpack it, so finding a therapist that she ‘clicks’ with is very important. Once you find that therapist, they may not be willing to share the details of what was discussed in the therapy session, and that’s ok! I know that as a loving parent you’ll want to know every bit of whatever has caused your daughter to develop this disorder, but you gotta push that aside. For now, she needs a space that’s fully confidential, not a space where she’s worrying if what she says will be told to mum/dad.\nSorry for throwing a wall of text at you, but as a 28 year old gal who went down the bulimia route at about the same age as your daughter and wishes her parents were half as good as you… I just wanted to add my experience in case it’s helpful. Wishing nothing but the best for you and your daughter. If it’s ok with you, I’ll add you, your daughter, and your family to my daily prayers. Go well, stranger. You got this",
      "created_utc": 1745573410.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moyn622",
      "author": "copperviolin",
      "body": "I struggled with anorexia and bulimia for five years and started recovery two months ago. It is possible to recover fully and I'm now starting to see light at the end of the tunnel. Still a long road ahead but it's getting better. \n\nProfessional help is needed and you have to be ready to face all kinds of professionals. Some are understanding, some are not. Be ready to fight together with your daughter. Bulimia sucks but I believe in your daughter. Don't be afraid to seek professional help yourself since eating disorders hurt the whole family, not just the one suffering. Sending you and your daughter so much love 🤍",
      "created_utc": 1745585566.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp3ef2s",
      "author": "Bright_Stand_8434",
      "body": "One thing id say as someone who’s been in recovery as a kid before with her parents… please remember she’s not just a sickness she’s still your daughter as before. don’t treat her just as a sickness. She’s a person struggling with an illness not the illness itself . Another thing is this may not happen for her but it’s happened to me she might someday day feel like she’s losing control and maybe want relapse or could slip back to get that coping mechanism back back like to have that routine  like someone else mention it’s a coping mechanism and taking that away or stopping is letting that coping mechanism go so id say make sure she has things that are safe and good for her wellbeing, goals to work to and other coping mechanisms that are good for her that aren’t harmful for her and I’m just sharing another personal experience but I wish people wouldn’t have just forgotten and think I’m fully fine because I may not be engaging in this specific disordered behavior anymore but she could switch ed behaviors example go from binging and purging to just binging and no purging or go to binging and purging to restriction or orthorexia or using different ways to “purge” example laxatives, over exercising or fasting to “compensate” for the food she ate. Nonetheless I’ll be wishing the best for you two and be patient with her. ❤️",
      "created_utc": 1745641103.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpe6srn",
      "author": "improve-indefinitely",
      "body": "Note from someone who was bulimic for 15 years, starting at 12.\n\n\nJust believe her. Anytime she tells you even the smallest thing. Believe her. As someone who was \"sick\" during puberty, it made it so much worse that my parents didn't take it seriously. Didn't take ME seriously. Name it. Call it bulimia. Don't try to give it a cute nickname or beat around the bush. It made me want to \"try harder\" to \"be sicker\". That if I was sicker they would care. If you take her to therapy, commit to taking her... Don't take her and expect a couple sessions to do it. Don't insists she tells you what she is talking about in the sessions. Trust a therapist to do their job, and commit to taking her... For a prolonged period of time. Having her open up to a therapist then not following through on taking her, even if she down plays it, is ultimately really harmful. \n\n\n\n\nAlso know at a very deep core level.... It's all about control. Feeling out of control in some way. Maybe how she is feeling at home, at school, on her social group, but if she can just control how she looks and/or the food that's in her body, she has control over something. \n\n\nAlso...Very hard truth and VERY ASSUMPTIVE.. hear me when I say not this is not every one... But there is research to suggest that a decent percentage of girls/women who develop consistent or prolonged bulimia were sexually abused. At her age..... In my absolute uninformed, unprofessional, just-a-person-on-reddit..... Know there's a chance. About 50% of sexual abuse happens before the age of 12. \n*It also could have nothing to do with that*. ",
      "created_utc": 1745795070.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpy8bsh",
      "author": "Old_Firefighter_9120",
      "body": "Hello, I just found this here. I am in Australia too and started therapy for other stuff like anxiety and insomnia. I think finding a really solid practitioner who works with body based trauma practices might be helpful for your daughter to slowly have a different relationship with her body. Perhaps somatic experiencing or trauma informed therapists. I never threw up as a teenager but had terrible body image and self hatred and had disordered eating for years. It took a lot of self worth building to shift things but it is so so so so possible. I really hope your daughter finds her way.",
      "created_utc": 1746065225.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moviv8n",
      "author": "okaysweaty167",
      "body": "Since you’re in Australia finding good treatment could be hard unless she’s seconds away from death. (I live in the US, this is just what I’ve been told by online friends who live there so don’t attack me)",
      "created_utc": 1745535884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "movvfcn",
      "author": "Becchoy",
      "body": "Can I just say it’s so lovely to hear how concerned you are? I’ve heard too many stories of parents being angry at their child. Anger will only ever make things worse. You’ve got this, all the best of luck for the future💗💗",
      "created_utc": 1745540093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "movtvxz",
      "author": "Hot_Republic_451",
      "body": "Leave her alone, but get a good talk therapist.",
      "created_utc": 1745539565.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mow3gcj",
      "author": "Due-Green2873",
      "body": "♥️ thank you",
      "created_utc": 1745542829.0,
      "score": 5,
      "context": [
        {
          "id": "morh4c3",
          "author": "127may",
          "body": "recovery is always possible, it’s hard work but it’s possible. please don’t give up on her. you are doing the right thing getting her help, even if services aren’t always notorious for being “the best”. it’s better than nothing.\ni don’t know what australian services are like, but just keep being there for your daughter.\nbulimia is hard because it is like an addiction, there is most likely a deep rooted problem that needs addressing, but she can do it ❤️",
          "created_utc": 1745489098.0
        }
      ]
    },
    {
      "id": "mow5n7f",
      "author": "lisa6547",
      "body": "TRUTH 👏👏",
      "created_utc": 1745543579.0,
      "score": 2,
      "context": [
        {
          "id": "morh4c3",
          "author": "127may",
          "body": "recovery is always possible, it’s hard work but it’s possible. please don’t give up on her. you are doing the right thing getting her help, even if services aren’t always notorious for being “the best”. it’s better than nothing.\ni don’t know what australian services are like, but just keep being there for your daughter.\nbulimia is hard because it is like an addiction, there is most likely a deep rooted problem that needs addressing, but she can do it ❤️",
          "created_utc": 1745489098.0
        }
      ]
    },
    {
      "id": "mow3h4c",
      "author": "Due-Green2873",
      "body": "♥️ thank you",
      "created_utc": 1745542837.0,
      "score": 3,
      "context": [
        {
          "id": "morgwbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745488974.0
        }
      ]
    },
    {
      "id": "morsomt",
      "author": "Due-Green2873",
      "body": "Thank you that’s such wonderful advice. For the last couple of years, we’ve been trying to get to the bottom of why my daughter has been having “dizzy spells”. At first we thought it was not eating enough as she did eat like a bird, but  we increased what she ate (which has always been very healthfully e.g. very little processed foods,). then we thought it may be low blood pressure and low iron so we treated that, then it became apparent that it was some kind of anxiety/depression.  For the last three months, she’s been on a mild antidepressant and we’ve seen a real change in her. She seems to be a lot happier. She has a good friend base at school. But no real best friend. I’ve often checked in with her to see if anything is troubling her but she’s always said she’s fine. There is a history of mental illness on her dad side.  I’ll talk to her about how usually this type of behavior is caused by something else and see if she’s willing to open up at all. Hopefully we can get to the root cause. Thanks again for your reply.",
      "created_utc": 1745494736.0,
      "score": 13,
      "context": [
        {
          "id": "morrajl",
          "author": "-ExistentialNihilist",
          "body": "It's a great sign that she's opened up to you. Keep being there for her and check in with her ❤️\n\nBulimia is not the problem, just the coping mechanism. There is something going on underneath this that is causing her pain. She likely is not aware of what is truly wrong or why she is doing this. Therapy should be able to help. Is she having problems at school, with friendships, any family problems?\n\nYou can help her with meals and stay with her afterwards to avoid purging if she would like you to. You could try distraction activities together for half an hour after meals or just stay with her and hug her/talk to her/hold her hand. It's best to ask her how you can help so she's comfortable or suggests things and ask her if that would be okay. But it's important to not be too controlling or force her to stop the bulimic behaviours. The most important thing is letting her know she is loved by you no matter what and that you'll always be there for her. \n\nIf you can get to the root of the psychological wound that is causing the eating disorder and heal it, she will be able to stop the behaviours. That's why I believe eating disorder relapse is so common because treatment tends to focus on stopping the behaviours without treating the underlying causes. If you take away someone's coping mechanism but not the cause of it, it won't be sustainable long term.\n\nBut please try not to worry, the fact you're here asking and trying to help her means she is already at a huge advantage to make a full recovery ❤️\n\nEdit: I was 14 when I became bulimic. I'm 25 and recovered now.",
          "created_utc": 1745494132.0
        }
      ]
    },
    {
      "id": "morrb11",
      "author": "Due-Green2873",
      "body": "Thanks so much for your feedback. We’re in Adelaide. It’s good to know about the rebated visits information. I was afraid it may only be 5 per year like most other CDMs. Fingers crossed the public system will work for us, as like most people, funds are pretty tight these days, but I’ll sell the house if we have to to make sure that this gets sorted for her.  I really appreciate your comments and hope that you’re doing well.",
      "created_utc": 1745494138.0,
      "score": 9,
      "context": [
        {
          "id": "morpynd",
          "author": "unremarkable_sapien",
          "body": "You’re in for a long hard battle. Up until now, she’s kept it hidden, but now that you know and are trying to intervene, it’s going to feel like everything is blowing up. Recovery is absolutely possible, and she’s so young, she really does have a good chance of completely getting better. Please be there for her and love her no matter what. There will be arguments and you might feel like your daughter is slipping away, but I promise she’s still there. She’s just scared and needs her mum.\n\nIf you’re going through the public system, don’t expect much support. Although I’m not sure where you are and so it might be better than what was offered to me what I was your daughter’s age. Try to get her a good GP that you both like and trust. She’ll need regular monitoring. And get her an EDP so that she can access 40 medicare-rebated psychologist sessions a year. Early intervention is key and you sound like an amazing mum so please don’t give up and don’t settle for anything less than recovery. I wish my parents had pushed me harder when I was a teenager. \n\nI’m in NSW, if you have any questions at all please feel free to ask. This post has honestly stirred something up inside of me and I want to do anything that I can to stop someone going down the path that I went.",
          "created_utc": 1745493543.0
        }
      ]
    },
    {
      "id": "mow3dvf",
      "author": "Due-Green2873",
      "body": "♥️ thank you",
      "created_utc": 1745542805.0,
      "score": 1,
      "context": [
        {
          "id": "moruftc",
          "author": "troad5678",
          "body": "17 years bulimia completely free. Hugs from Italy. It Is so much worth It.",
          "created_utc": 1745495467.0
        }
      ]
    },
    {
      "id": "mow3w49",
      "author": "Due-Green2873",
      "body": "Thank you so much. That’s definitely something we’ll consider. I hope things are all well for you now. ♥️",
      "created_utc": 1745542978.0,
      "score": 1,
      "context": [
        {
          "id": "mot06hm",
          "author": "ThestralBreeder",
          "body": "If you can actually have her willingly engage in intensive inpatient or a daily outpatient program, I would HIGHLY recommend it. I told my parents that I was bulimic at 15 (started at age 8) and they just sort of handed me to a 1x a week therapist and didn’t really stay involved in my treatment. I didn’t actually stop purging until 27! There are many times I look back and wish that I had really done an intensive program, but at the time I was so focused on school and not wanting any disruptions.",
          "created_utc": 1745508997.0
        }
      ]
    },
    {
      "id": "mow8cep",
      "author": "Due-Green2873",
      "body": "I’m so glad to hear you no longer have the desire. This does give me hope. Thank you for sharing!!",
      "created_utc": 1745544498.0,
      "score": 1,
      "context": [
        {
          "id": "mow4sip",
          "author": "Celui-the-Maggot",
          "body": "I struggled for a decade. But now I'm in my thirties and have no desire to continue the eating disorder. She needs to be willing to make the changes and do the hard work and it may take years of battling it. But recovery is absolutely possible. Getting her support now is a great first step. This stuff is not easy, for her or for you. But you're already going in the right direction.",
          "created_utc": 1745543287.0
        }
      ]
    },
    {
      "id": "mow8qni",
      "author": "Due-Green2873",
      "body": "Thanks for sharing. Addiction is cruel. I do hope you are doing well. Definitely need to look into what may have started this all off. Take care.",
      "created_utc": 1745544634.0,
      "score": 2,
      "context": [
        {
          "id": "mow56br",
          "author": "lisa6547",
          "body": "It's been a long struggle in my life personally, (I'm 35 by the way)...for me it was started with emotional issues that were never resolved 😞 \n\nThe only reason I stopped forcing myself to throw up was because I started getting so addicted to vodka to the point where it was lethal. I've been seeing therapists and psychiatrists, but nothing has helped much so far\n\nIt's a hard journey to go down, but all I can say is just get all of the professional help that you can.\n\nBecause one addiction leads to another...😟 In my case at least, and likely for a lot of others",
          "created_utc": 1745543420.0
        }
      ]
    },
    {
      "id": "moy8hkm",
      "author": "Due-Green2873",
      "body": "That is so kind 🥰. Thank you so much. It really means a lot. Xx",
      "created_utc": 1745579639.0,
      "score": 2,
      "context": [
        {
          "id": "moxwzxc",
          "author": "eisheth13",
          "body": "First off, I want to congratulate YOU. Your daughter opened up to you, and that is huuuuge!!! From personal experience I’ve found that shame and secrecy are bulimia’s best friends, but having a safe person to open up to is step one on the road to recovery. You’re the safe person. You’ve done step one. Please give yourself some kudos for that!\nNow, onto what to expect from here. I’m in NZ, so similar-but-also-very-different to you in Aussie. In my experience, the specialised eating disorder services were useless, since I wasn’t clinically underweight, so they basically wouldn’t take me as a patient. However, they did refer me to the general mental health services, where I was able to have free weekly meetings with a therapist to unpack the underlying issues I had. Bulimia doesn’t just pop up out of nowhere, there are always underlying things going on, could be depression, anxiety, ocd, or in my case, ptsd. Whatever is going on with your daughter, it seems like she’s ready to talk about it and unpack it, so finding a therapist that she ‘clicks’ with is very important. Once you find that therapist, they may not be willing to share the details of what was discussed in the therapy session, and that’s ok! I know that as a loving parent you’ll want to know every bit of whatever has caused your daughter to develop this disorder, but you gotta push that aside. For now, she needs a space that’s fully confidential, not a space where she’s worrying if what she says will be told to mum/dad.\nSorry for throwing a wall of text at you, but as a 28 year old gal who went down the bulimia route at about the same age as your daughter and wishes her parents were half as good as you… I just wanted to add my experience in case it’s helpful. Wishing nothing but the best for you and your daughter. If it’s ok with you, I’ll add you, your daughter, and your family to my daily prayers. Go well, stranger. You got this",
          "created_utc": 1745573410.0
        }
      ]
    },
    {
      "id": "mow84lr",
      "author": "Due-Green2873",
      "body": "Thank you. This is definitely a learning curve for me because in the past before I knew, I would be angry because she’d eaten “all the stuff” again. But now that I know I’ve promised her that I’ll never be angry over this - that I have no right to be.",
      "created_utc": 1745544426.0,
      "score": 1,
      "context": [
        {
          "id": "movvfcn",
          "author": "Becchoy",
          "body": "Can I just say it’s so lovely to hear how concerned you are? I’ve heard too many stories of parents being angry at their child. Anger will only ever make things worse. You’ve got this, all the best of luck for the future💗💗",
          "created_utc": 1745540093.0
        }
      ]
    },
    {
      "id": "morwslo",
      "author": "-ExistentialNihilist",
      "body": "You're welcome, I hope she will get the help she needs ❤️ \n\nYeah, it's a good idea to ask again gently if there's anything that's upsetting her or causing her worry. There may be issues at school or with friendships that she's not willing to confide as she may feel embarrassed. A therapist may be a good idea to try if she's comfortable with it as sometimes confiding in a stranger can be easier. I used to say I was 'fine' too when I was her age as I didn't want to be a burden or I felt like the problems I was having were my fault. Children have a tendency to blame themselves and the eating disorder could be her way of expressing pain, hurting herself or crying for help. At her age, I didn't have insight into what was causing my behaviour. I just knew something was wrong and I was bulimic but didn't understand why or what I needed so she might not either.\n\nAll you can do is be there for her like you are and make sure she knows you love her and always have time for her. Maybe think about organising some time where you two do something together that she enjoys (shopping, cinema, bowling, anything non-food related) to hopefully give her a little break from her problems and make her smile. She might not feel up to it if she's really struggling but you can always ask and let her know you want to do something together. If you can, try to do it in a casual way and not an 'I'm offering because I'm worried about you' way. \n\nI just want you to know too that I'd have loved my mom to care as much as you do about your daughter and I'm sure she'll recover with time, help and support ❤️",
      "created_utc": 1745496414.0,
      "score": 6,
      "context": [
        {
          "id": "morrajl",
          "author": "-ExistentialNihilist",
          "body": "It's a great sign that she's opened up to you. Keep being there for her and check in with her ❤️\n\nBulimia is not the problem, just the coping mechanism. There is something going on underneath this that is causing her pain. She likely is not aware of what is truly wrong or why she is doing this. Therapy should be able to help. Is she having problems at school, with friendships, any family problems?\n\nYou can help her with meals and stay with her afterwards to avoid purging if she would like you to. You could try distraction activities together for half an hour after meals or just stay with her and hug her/talk to her/hold her hand. It's best to ask her how you can help so she's comfortable or suggests things and ask her if that would be okay. But it's important to not be too controlling or force her to stop the bulimic behaviours. The most important thing is letting her know she is loved by you no matter what and that you'll always be there for her. \n\nIf you can get to the root of the psychological wound that is causing the eating disorder and heal it, she will be able to stop the behaviours. That's why I believe eating disorder relapse is so common because treatment tends to focus on stopping the behaviours without treating the underlying causes. If you take away someone's coping mechanism but not the cause of it, it won't be sustainable long term.\n\nBut please try not to worry, the fact you're here asking and trying to help her means she is already at a huge advantage to make a full recovery ❤️\n\nEdit: I was 14 when I became bulimic. I'm 25 and recovered now.",
          "created_utc": 1745494132.0
        },
        {
          "id": "morsomt",
          "author": "Due-Green2873",
          "body": "Thank you that’s such wonderful advice. For the last couple of years, we’ve been trying to get to the bottom of why my daughter has been having “dizzy spells”. At first we thought it was not eating enough as she did eat like a bird, but  we increased what she ate (which has always been very healthfully e.g. very little processed foods,). then we thought it may be low blood pressure and low iron so we treated that, then it became apparent that it was some kind of anxiety/depression.  For the last three months, she’s been on a mild antidepressant and we’ve seen a real change in her. She seems to be a lot happier. She has a good friend base at school. But no real best friend. I’ve often checked in with her to see if anything is troubling her but she’s always said she’s fine. There is a history of mental illness on her dad side.  I’ll talk to her about how usually this type of behavior is caused by something else and see if she’s willing to open up at all. Hopefully we can get to the root cause. Thanks again for your reply.",
          "created_utc": 1745494736.0
        }
      ]
    },
    {
      "id": "mp4b0x1",
      "author": "Optimal-Difficulty87",
      "body": "I am also in adelaide and am currently in hospital. I have tried to get into Seds however they are very hard to get into and i have been sent away multiple times even when I was very sick. Good luck to you and your daughter xx",
      "created_utc": 1745659219.0,
      "score": 1,
      "context": [
        {
          "id": "morpynd",
          "author": "unremarkable_sapien",
          "body": "You’re in for a long hard battle. Up until now, she’s kept it hidden, but now that you know and are trying to intervene, it’s going to feel like everything is blowing up. Recovery is absolutely possible, and she’s so young, she really does have a good chance of completely getting better. Please be there for her and love her no matter what. There will be arguments and you might feel like your daughter is slipping away, but I promise she’s still there. She’s just scared and needs her mum.\n\nIf you’re going through the public system, don’t expect much support. Although I’m not sure where you are and so it might be better than what was offered to me what I was your daughter’s age. Try to get her a good GP that you both like and trust. She’ll need regular monitoring. And get her an EDP so that she can access 40 medicare-rebated psychologist sessions a year. Early intervention is key and you sound like an amazing mum so please don’t give up and don’t settle for anything less than recovery. I wish my parents had pushed me harder when I was a teenager. \n\nI’m in NSW, if you have any questions at all please feel free to ask. This post has honestly stirred something up inside of me and I want to do anything that I can to stop someone going down the path that I went.",
          "created_utc": 1745493543.0
        },
        {
          "id": "morrb11",
          "author": "Due-Green2873",
          "body": "Thanks so much for your feedback. We’re in Adelaide. It’s good to know about the rebated visits information. I was afraid it may only be 5 per year like most other CDMs. Fingers crossed the public system will work for us, as like most people, funds are pretty tight these days, but I’ll sell the house if we have to to make sure that this gets sorted for her.  I really appreciate your comments and hope that you’re doing well.",
          "created_utc": 1745494138.0
        }
      ]
    },
    {
      "id": "mow59a1",
      "author": "ThestralBreeder",
      "body": "Yes they are - recovery and a happy and healthy life are absolutely possible. I’m nearly 31 and married to the most wonderful and kind man with a wonderful career. I hope the same for your daughter one day 💗",
      "created_utc": 1745543447.0,
      "score": 1,
      "context": [
        {
          "id": "mot06hm",
          "author": "ThestralBreeder",
          "body": "If you can actually have her willingly engage in intensive inpatient or a daily outpatient program, I would HIGHLY recommend it. I told my parents that I was bulimic at 15 (started at age 8) and they just sort of handed me to a 1x a week therapist and didn’t really stay involved in my treatment. I didn’t actually stop purging until 27! There are many times I look back and wish that I had really done an intensive program, but at the time I was so focused on school and not wanting any disruptions.",
          "created_utc": 1745508997.0
        },
        {
          "id": "mow3w49",
          "author": "Due-Green2873",
          "body": "Thank you so much. That’s definitely something we’ll consider. I hope things are all well for you now. ♥️",
          "created_utc": 1745542978.0
        }
      ]
    },
    {
      "id": "mowz7pu",
      "author": "lisa6547",
      "body": "Thank you friend ♥️ \n\nYou too, and I just hope that your daughter is ok too",
      "created_utc": 1745554322.0,
      "score": 1,
      "context": [
        {
          "id": "mow56br",
          "author": "lisa6547",
          "body": "It's been a long struggle in my life personally, (I'm 35 by the way)...for me it was started with emotional issues that were never resolved 😞 \n\nThe only reason I stopped forcing myself to throw up was because I started getting so addicted to vodka to the point where it was lethal. I've been seeing therapists and psychiatrists, but nothing has helped much so far\n\nIt's a hard journey to go down, but all I can say is just get all of the professional help that you can.\n\nBecause one addiction leads to another...😟 In my case at least, and likely for a lot of others",
          "created_utc": 1745543420.0
        },
        {
          "id": "mow8qni",
          "author": "Due-Green2873",
          "body": "Thanks for sharing. Addiction is cruel. I do hope you are doing well. Definitely need to look into what may have started this all off. Take care.",
          "created_utc": 1745544634.0
        }
      ]
    },
    {
      "id": "mp9mwf6",
      "author": "eisheth13",
      "body": "Hey, it also means a lot that you’re ready and willing to do what it takes to help your daughter. You’ve GOT this! Just keep being yourself and keep being there for her. Brighter days are ahead, my friend",
      "created_utc": 1745730675.0,
      "score": 2,
      "context": [
        {
          "id": "moxwzxc",
          "author": "eisheth13",
          "body": "First off, I want to congratulate YOU. Your daughter opened up to you, and that is huuuuge!!! From personal experience I’ve found that shame and secrecy are bulimia’s best friends, but having a safe person to open up to is step one on the road to recovery. You’re the safe person. You’ve done step one. Please give yourself some kudos for that!\nNow, onto what to expect from here. I’m in NZ, so similar-but-also-very-different to you in Aussie. In my experience, the specialised eating disorder services were useless, since I wasn’t clinically underweight, so they basically wouldn’t take me as a patient. However, they did refer me to the general mental health services, where I was able to have free weekly meetings with a therapist to unpack the underlying issues I had. Bulimia doesn’t just pop up out of nowhere, there are always underlying things going on, could be depression, anxiety, ocd, or in my case, ptsd. Whatever is going on with your daughter, it seems like she’s ready to talk about it and unpack it, so finding a therapist that she ‘clicks’ with is very important. Once you find that therapist, they may not be willing to share the details of what was discussed in the therapy session, and that’s ok! I know that as a loving parent you’ll want to know every bit of whatever has caused your daughter to develop this disorder, but you gotta push that aside. For now, she needs a space that’s fully confidential, not a space where she’s worrying if what she says will be told to mum/dad.\nSorry for throwing a wall of text at you, but as a 28 year old gal who went down the bulimia route at about the same age as your daughter and wishes her parents were half as good as you… I just wanted to add my experience in case it’s helpful. Wishing nothing but the best for you and your daughter. If it’s ok with you, I’ll add you, your daughter, and your family to my daily prayers. Go well, stranger. You got this",
          "created_utc": 1745573410.0
        },
        {
          "id": "moy8hkm",
          "author": "Due-Green2873",
          "body": "That is so kind 🥰. Thank you so much. It really means a lot. Xx",
          "created_utc": 1745579639.0
        }
      ]
    },
    {
      "id": "mow3aef",
      "author": "Due-Green2873",
      "body": "Thank you so so much. I think everything you’ve suggested sounds like a great idea. I do believe she may be like you were - just not quite sure what’s wrong but she knows things aren’t quite right. But I will definitely do as you’ve suggested. Thanks again.",
      "created_utc": 1745542773.0,
      "score": 2,
      "context": [
        {
          "id": "morrajl",
          "author": "-ExistentialNihilist",
          "body": "It's a great sign that she's opened up to you. Keep being there for her and check in with her ❤️\n\nBulimia is not the problem, just the coping mechanism. There is something going on underneath this that is causing her pain. She likely is not aware of what is truly wrong or why she is doing this. Therapy should be able to help. Is she having problems at school, with friendships, any family problems?\n\nYou can help her with meals and stay with her afterwards to avoid purging if she would like you to. You could try distraction activities together for half an hour after meals or just stay with her and hug her/talk to her/hold her hand. It's best to ask her how you can help so she's comfortable or suggests things and ask her if that would be okay. But it's important to not be too controlling or force her to stop the bulimic behaviours. The most important thing is letting her know she is loved by you no matter what and that you'll always be there for her. \n\nIf you can get to the root of the psychological wound that is causing the eating disorder and heal it, she will be able to stop the behaviours. That's why I believe eating disorder relapse is so common because treatment tends to focus on stopping the behaviours without treating the underlying causes. If you take away someone's coping mechanism but not the cause of it, it won't be sustainable long term.\n\nBut please try not to worry, the fact you're here asking and trying to help her means she is already at a huge advantage to make a full recovery ❤️\n\nEdit: I was 14 when I became bulimic. I'm 25 and recovered now.",
          "created_utc": 1745494132.0
        },
        {
          "id": "morsomt",
          "author": "Due-Green2873",
          "body": "Thank you that’s such wonderful advice. For the last couple of years, we’ve been trying to get to the bottom of why my daughter has been having “dizzy spells”. At first we thought it was not eating enough as she did eat like a bird, but  we increased what she ate (which has always been very healthfully e.g. very little processed foods,). then we thought it may be low blood pressure and low iron so we treated that, then it became apparent that it was some kind of anxiety/depression.  For the last three months, she’s been on a mild antidepressant and we’ve seen a real change in her. She seems to be a lot happier. She has a good friend base at school. But no real best friend. I’ve often checked in with her to see if anything is troubling her but she’s always said she’s fine. There is a history of mental illness on her dad side.  I’ll talk to her about how usually this type of behavior is caused by something else and see if she’s willing to open up at all. Hopefully we can get to the root cause. Thanks again for your reply.",
          "created_utc": 1745494736.0
        },
        {
          "id": "morwslo",
          "author": "-ExistentialNihilist",
          "body": "You're welcome, I hope she will get the help she needs ❤️ \n\nYeah, it's a good idea to ask again gently if there's anything that's upsetting her or causing her worry. There may be issues at school or with friendships that she's not willing to confide as she may feel embarrassed. A therapist may be a good idea to try if she's comfortable with it as sometimes confiding in a stranger can be easier. I used to say I was 'fine' too when I was her age as I didn't want to be a burden or I felt like the problems I was having were my fault. Children have a tendency to blame themselves and the eating disorder could be her way of expressing pain, hurting herself or crying for help. At her age, I didn't have insight into what was causing my behaviour. I just knew something was wrong and I was bulimic but didn't understand why or what I needed so she might not either.\n\nAll you can do is be there for her like you are and make sure she knows you love her and always have time for her. Maybe think about organising some time where you two do something together that she enjoys (shopping, cinema, bowling, anything non-food related) to hopefully give her a little break from her problems and make her smile. She might not feel up to it if she's really struggling but you can always ask and let her know you want to do something together. If you can, try to do it in a casual way and not an 'I'm offering because I'm worried about you' way. \n\nI just want you to know too that I'd have loved my mom to care as much as you do about your daughter and I'm sure she'll recover with time, help and support ❤️",
          "created_utc": 1745496414.0
        }
      ]
    },
    {
      "id": "moxm1j8",
      "author": "-ExistentialNihilist",
      "body": "You're welcome. Wishing you and your daughter all the best. I'm so glad I could help ❤️",
      "created_utc": 1745566509.0,
      "score": 1,
      "context": [
        {
          "id": "morrajl",
          "author": "-ExistentialNihilist",
          "body": "It's a great sign that she's opened up to you. Keep being there for her and check in with her ❤️\n\nBulimia is not the problem, just the coping mechanism. There is something going on underneath this that is causing her pain. She likely is not aware of what is truly wrong or why she is doing this. Therapy should be able to help. Is she having problems at school, with friendships, any family problems?\n\nYou can help her with meals and stay with her afterwards to avoid purging if she would like you to. You could try distraction activities together for half an hour after meals or just stay with her and hug her/talk to her/hold her hand. It's best to ask her how you can help so she's comfortable or suggests things and ask her if that would be okay. But it's important to not be too controlling or force her to stop the bulimic behaviours. The most important thing is letting her know she is loved by you no matter what and that you'll always be there for her. \n\nIf you can get to the root of the psychological wound that is causing the eating disorder and heal it, she will be able to stop the behaviours. That's why I believe eating disorder relapse is so common because treatment tends to focus on stopping the behaviours without treating the underlying causes. If you take away someone's coping mechanism but not the cause of it, it won't be sustainable long term.\n\nBut please try not to worry, the fact you're here asking and trying to help her means she is already at a huge advantage to make a full recovery ❤️\n\nEdit: I was 14 when I became bulimic. I'm 25 and recovered now.",
          "created_utc": 1745494132.0
        },
        {
          "id": "morsomt",
          "author": "Due-Green2873",
          "body": "Thank you that’s such wonderful advice. For the last couple of years, we’ve been trying to get to the bottom of why my daughter has been having “dizzy spells”. At first we thought it was not eating enough as she did eat like a bird, but  we increased what she ate (which has always been very healthfully e.g. very little processed foods,). then we thought it may be low blood pressure and low iron so we treated that, then it became apparent that it was some kind of anxiety/depression.  For the last three months, she’s been on a mild antidepressant and we’ve seen a real change in her. She seems to be a lot happier. She has a good friend base at school. But no real best friend. I’ve often checked in with her to see if anything is troubling her but she’s always said she’s fine. There is a history of mental illness on her dad side.  I’ll talk to her about how usually this type of behavior is caused by something else and see if she’s willing to open up at all. Hopefully we can get to the root cause. Thanks again for your reply.",
          "created_utc": 1745494736.0
        },
        {
          "id": "morwslo",
          "author": "-ExistentialNihilist",
          "body": "You're welcome, I hope she will get the help she needs ❤️ \n\nYeah, it's a good idea to ask again gently if there's anything that's upsetting her or causing her worry. There may be issues at school or with friendships that she's not willing to confide as she may feel embarrassed. A therapist may be a good idea to try if she's comfortable with it as sometimes confiding in a stranger can be easier. I used to say I was 'fine' too when I was her age as I didn't want to be a burden or I felt like the problems I was having were my fault. Children have a tendency to blame themselves and the eating disorder could be her way of expressing pain, hurting herself or crying for help. At her age, I didn't have insight into what was causing my behaviour. I just knew something was wrong and I was bulimic but didn't understand why or what I needed so she might not either.\n\nAll you can do is be there for her like you are and make sure she knows you love her and always have time for her. Maybe think about organising some time where you two do something together that she enjoys (shopping, cinema, bowling, anything non-food related) to hopefully give her a little break from her problems and make her smile. She might not feel up to it if she's really struggling but you can always ask and let her know you want to do something together. If you can, try to do it in a casual way and not an 'I'm offering because I'm worried about you' way. \n\nI just want you to know too that I'd have loved my mom to care as much as you do about your daughter and I'm sure she'll recover with time, help and support ❤️",
          "created_utc": 1745496414.0
        },
        {
          "id": "mow3aef",
          "author": "Due-Green2873",
          "body": "Thank you so so much. I think everything you’ve suggested sounds like a great idea. I do believe she may be like you were - just not quite sure what’s wrong but she knows things aren’t quite right. But I will definitely do as you’ve suggested. Thanks again.",
          "created_utc": 1745542773.0
        }
      ]
    }
  ]
}