{
  "id": "1k80t7r",
  "subreddit": "bulimia",
  "author": "Narrow_Road_890",
  "created_utc": 1745629147.0,
  "title": "What triggers a binge for you?",
  "selftext": "Just asking because I'm genuinely curious. Identifying why you binge is like a huge first step.\n\nFor me, I think I stress/emotionally binge. Just tonight some bad news got spread out, and I've had control all day, but I just lost it.\n\nNot only that that but I think I also use b/ping to cope in a weird way, for me- it's  the dopamine of eating so so much food, then the guilt, shame, and being so uncomfortably full that follows right after, then the relief/aftereffect of getting all that food back out, my brain tells me \"you fixed the problem, good job!\". Cause I can control what comes in and what comes out, not the problems happening around me. Almost like a weird sense of accomplishment ! :(",
  "url": "https://www.reddit.com/r/bulimia/comments/1k80t7r/what_triggers_a_binge_for_you/",
  "score": 64,
  "num_comments": 32,
  "comments": [
    {
      "id": "mp2p4pu",
      "author": "Specific-Ad8491",
      "body": "All of this, but more recently, it has been boredom. Bulimia has become my hobby. Any free moment I just want to eat and eat",
      "created_utc": 1745631350.0,
      "score": 56,
      "context": []
    },
    {
      "id": "mp379p9",
      "author": "draoikat",
      "body": "Nothing. It's an emotionless ritual for me. In the beginning, when I started bingeing and then eventually purging as well, it was probably my body's reaction to starving it. That was several decades ago (my ED began at 14; I'm 40 now). So I did it out of hunger. My original diagnosis of AN-R became AN-b/p and the bingeing and purging part just became... Something I Do. Usually every night before I go to sleep, unless I'm feeling really medically unstable or I'm randomly sick (like the flu or something unrelated to my ED). The longest I've gone without doing it is about six months, 20 years ago, after I spent a while in hospital because I was critically ill and very underweight, and I was scared and giving recovery a genuine attempt for a while.\n\nAnyway. It's pretty much always the same foods in the exact same order every time I do it. I mean, they change here and there over time, but I go months and sometimes years bingeing on more or less the same stuff. I kind of suspect the way I binge and purge is related to my OCD and autism, I'm a pretty rigid/routinised person in general, so. But yeah, there's no trigger. It's not spontaneous and it's as unemotional as taking a shower every day. Occasionally I have what I think of as 'bad days' where I let things get away from me and I just can't stop and end up doing it for hours on end and feel really out of control... that happens more when I'm overwhelmed and exhausted with life stuff, and I think it's how I just totally mentally check out for a while... but that's the closest I can think of to having a trigger.",
      "created_utc": 1745638077.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mp2wbn2",
      "author": "None",
      "body": "lowkey atp i think eating just feels good and is fun— for the first 15 minutes of a binge…..",
      "created_utc": 1745633905.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mp3dgqn",
      "author": "Aggravating-March920",
      "body": "Boredom, loneliness, something triggering a core wound",
      "created_utc": 1745640677.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mp3gjes",
      "author": "KatMac6013",
      "body": "Honestly certain foods are a trigger for me more than any emotion or situation. I try to keep most sweets and pastries out of the house if possible because once I begin eating them any sense of moderation goes out the window. \nI have not binged/purged in almost 4 years now and I’d probably be considered fully recovered at this point, thank God. I eat ‘normally’, or at least not in a disordered manner and have an okay relationship with food. But I still choose not to have certain foods available so I’m not tempted.",
      "created_utc": 1745642049.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mp3athl",
      "author": "fakesk8r",
      "body": "Stress, restricting food that day or previous days, anger, and also mostly self confidence reasons",
      "created_utc": 1745639537.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mp4r4ii",
      "author": "Tight_Drawing_2725",
      "body": "eating a chip",
      "created_utc": 1745668207.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mp3lazk",
      "author": "True-Ad4667",
      "body": "Wanting to escape from myself and the world…. 😖",
      "created_utc": 1745644362.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mp3kai5",
      "author": "Marthology",
      "body": "Trauma stuff I didn‘t want to face mostly and probably everything else told",
      "created_utc": 1745643837.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mp9raqd",
      "author": "Commercial-Race-5702",
      "body": "For me, it’s just how my brain reacts to eating anything. One little bite of food makes me not want to stop eating because I’ve got this all-or-nothing mindset around food. It’s not even about calories anymore. I’ve had bulimia for about five years now (since I was 14), and the longest I’ve gone without b/p-ing is three days during that whole time. Psych wards, getting sick—nothing has stopped the cycle. I’ve procured food using bad methods when I didn’t have access to it (I cut that habit a long time ago, but the memories are shameful). \n\nFood is just something I can’t resist; the moment I taste something or feel even a little full, the combination of the dopamine hit from the food and the ED mindset kicks in. That whole “fuck it, we ate, might as well binge because it’s just how we are—plus, it feels good” mentality.\n\nThat little dopamine hit just sets me off. I’ve got chronic depression, OCD, and autism, and my life’s just generally pretty crappy, so it’s an escape for me. And it doesn’t take much to push me past that precipice. It makes me feel good, and nothing else works as quickly or as powerfully as that food-dopamine hit. I can try distracting myself with exercise, studying, walking, maybe seeing friends (I’m kinda asocial though, so that’s not something I can do often lol)… but in the end, I always end up back at bingeing because none of those other things keep me feeling okay for long. I slip into a bad headspace, and once I start slipping, it’s just too easy to fix it again with a binge. Then the cycle repeats when the feeling comes back.\n\nHopefully one day I’ll figure out how to break out of this, but until then, it’s basically Groundhog Day for me haha. Sending well wishes to you!",
      "created_utc": 1745733079.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mp6f0cu",
      "author": "kstocc",
      "body": "when i feel out of control in a situation and my emotions just cloud everything in my life. i look for a quick fix and that’s binging most of the time",
      "created_utc": 1745688660.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mpb9zol",
      "author": "Critical_Business_18",
      "body": "This is such a good question! Thanks for asking, because it offers me the time to really reflect.   \nI am 40 something and I have had various eating disorders since I was 15 yo.  When I started purging at 16 it was because I came from anorexia and was forced to begin eating and as I gained weight and had absolutely no support, I started to freak out. So the binges then were very different from the binges I have now, as my eating disorder has transformed over the years. When I was young I had small binges. I would almost call them subjective binges, not objective binges, i.e I ended up eating to more pieces of whatever I was eating, and then that was to more than what I had decided on, and that triggered me to purge. I was all about control and feeling like I could eat exactly what I set out to eat, not more. \n\nWhat triggers me to binge today mostly about how I feel in my body. If I look bloated (for example, if my face looks bloated) that can trigger a binge, since I know that purging reduces the bloat. Likewise, if I am constipated and feel bloated/full because of that, that can trigger me to binge, because in my experience binges can make me need to...well...poop. So binges today are very much about how I feel inside my body. It´s an internal trigger, it is not triggered by anything inside me.\n\nBut of course, sometimes there are outer triggers too. A huge trigger for me is a feeling of not being in control/that my living situation is unpredictable. For example, right now I am not in control of wheter I will get access to care for my adhd and autism, and that feels overwhelming and scary. That has triggered me to binge many times. Likewise, I am in a situation at my job that is really difficult, given that I have been on sick leave for so long and now I am about to end up on social welfare because I don´t function at all. The thought of how this will end for me can also trigger me to binge. \n\nTo me, bingeing and then purging is much like you describe how it is for you, but I will add that it is also a form of purification. What I mean by that is it is almost as if I am eating the problem and then purging it out of me, and this gives me some breating room from the mental chatter. \n\nAlso, sometimes I binge and purge in order to go to sleep. If I feel to full or my stomach hurts late at night, binge and then purge and that solves the stomach pain and the feeling of fullness and so I am able to go to sleep because I don´t have those things nagging me. I binge and purge almost every night, because of this. I can´t stand the feeling of being full before going to bed. I need emptyness and control so that I can meet the next day as a blanc sheet, not a \"full and dirty\" sheet. I know it sounds funny. I guess I´m really weird.",
      "created_utc": 1745762120.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp8n2xe",
      "author": "None",
      "body": "Fasting for longer than I can. Usually ends in a wasteful, shameful binge and purge. That's why I need peanuts or something to munch on from time to time",
      "created_utc": 1745715503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpanu5y",
      "author": "bulimiawallace",
      "body": "1. Hormones \n2. a specific event, like being sexually harassed or something. There’s usually an antecedent/precursor to the behavior. \n3. Legitimate hunger \n\nWhen it was really bad though my pattern of food consumption was only eating if it was a binge/purge, so I’d binge every single night and purge after.",
      "created_utc": 1745752763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpcmw4s",
      "author": "Terrible-Ad-1178",
      "body": "waking up in the morning its always a 50/50 on whether or not i have to fight a binge, after my vyvanse wears out around 7pm its another mental battle with boredom and cravings",
      "created_utc": 1745777356.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpuubuq",
      "author": "OkFirefighter2779",
      "body": "Feeling my stomach fill up, or seeing my body change, or seeing someone thinner than me.",
      "created_utc": 1746027388.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp43oa6",
      "author": "_ravioli_buster_",
      "body": "Overwhelming stress",
      "created_utc": 1745654733.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp4s2rr",
      "author": "Brandyscloset9",
      "body": "Mine is when I'm upset, feel like I'm losing control related to my finances or stress. I know this sounds weird but it comforts me while I'm doing it but than afterwards, I'll disappointed in myself",
      "created_utc": 1745668635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp8pi1m",
      "author": "Dull-Bus9522",
      "body": "Lately it has been stress. For some reason it’s like a coping mechanism.",
      "created_utc": 1745716435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpa8jqp",
      "author": "eatmeat2016",
      "body": "I probably notice by the time I eat the second or third different item. At that point there is a quiet resignation that its gonna happen so why not just go with it. \n\nHowever, of late I have got better at not purging. I’d days away from a hip replacement and it’s been delayed due to anaemia. So I’m giving my body a chance for once. Supplementing iron, b12 and just gritting my teeth through the urge to get rid. I failed once but managed to stop as soon as I felt I’d got rid of about half. Which was a small win.",
      "created_utc": 1745743501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpbggji",
      "author": "candynymph",
      "body": "Stress and being dopamine starved :(",
      "created_utc": 1745764313.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpjwvkl",
      "author": "Complex_Ad_761",
      "body": "Restricting foods and counting calories is a huge trigger for me. Specific foods, like chips, are foods I typically binge so I try to not buy them.",
      "created_utc": 1745875641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpl3mau",
      "author": "PinImpossible4470",
      "body": "I just like food 🤷‍♀️ I keep myself away from it as much as I can but sometimes I lose control. And I eat everything I want. The minute I feel a resemblance of “fullness” I feel guilty",
      "created_utc": 1745890393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp2wbug",
      "author": "rescuecatmomlover",
      "body": "I was also going to say this.  I must account for any down time with something to do otherwise my mind wanders...",
      "created_utc": 1745633907.0,
      "score": 9,
      "context": [
        {
          "id": "mp2p4pu",
          "author": "Specific-Ad8491",
          "body": "All of this, but more recently, it has been boredom. Bulimia has become my hobby. Any free moment I just want to eat and eat",
          "created_utc": 1745631350.0
        }
      ]
    },
    {
      "id": "mp58wdm",
      "author": "SweetxKiss",
      "body": "This gave me whiplash, are we the same person? AN-R to AN b/p, OCD, been going at this 20+ years… it’s literally just “that thing I do”. It’s a quirk, like people that need to cut the crusts off their bread. It’s just how I operate. Like some kind of robotic programming. \n\nI know how soul-sucking and draining it is. I hope one day you experience peace and I hope your health woes stay small",
      "created_utc": 1745675269.0,
      "score": 8,
      "context": [
        {
          "id": "mp379p9",
          "author": "draoikat",
          "body": "Nothing. It's an emotionless ritual for me. In the beginning, when I started bingeing and then eventually purging as well, it was probably my body's reaction to starving it. That was several decades ago (my ED began at 14; I'm 40 now). So I did it out of hunger. My original diagnosis of AN-R became AN-b/p and the bingeing and purging part just became... Something I Do. Usually every night before I go to sleep, unless I'm feeling really medically unstable or I'm randomly sick (like the flu or something unrelated to my ED). The longest I've gone without doing it is about six months, 20 years ago, after I spent a while in hospital because I was critically ill and very underweight, and I was scared and giving recovery a genuine attempt for a while.\n\nAnyway. It's pretty much always the same foods in the exact same order every time I do it. I mean, they change here and there over time, but I go months and sometimes years bingeing on more or less the same stuff. I kind of suspect the way I binge and purge is related to my OCD and autism, I'm a pretty rigid/routinised person in general, so. But yeah, there's no trigger. It's not spontaneous and it's as unemotional as taking a shower every day. Occasionally I have what I think of as 'bad days' where I let things get away from me and I just can't stop and end up doing it for hours on end and feel really out of control... that happens more when I'm overwhelmed and exhausted with life stuff, and I think it's how I just totally mentally check out for a while... but that's the closest I can think of to having a trigger.",
          "created_utc": 1745638077.0
        }
      ]
    },
    {
      "id": "mpbcodx",
      "author": "Critical_Business_18",
      "body": "Wow, me too! I was recently diagnosed with autisme and ADHD, but my eating disorder came when I was 15 and back then it was firstly AN-R, then it became AN-binge-purge type, then it became BN (bulimia), and then \"Eating disorder unspecified\" and then back to AN-b/p (which is where I am now, although I am only slightly underweight and I am not going back to treatment again, that´s for sure). But what I eat and in which order can change from time to time. What I binge on reflect whatever was on sale in the store, really. I don´t have much money so I can´t buy whatever I want.",
      "created_utc": 1745763055.0,
      "score": 1,
      "context": [
        {
          "id": "mp379p9",
          "author": "draoikat",
          "body": "Nothing. It's an emotionless ritual for me. In the beginning, when I started bingeing and then eventually purging as well, it was probably my body's reaction to starving it. That was several decades ago (my ED began at 14; I'm 40 now). So I did it out of hunger. My original diagnosis of AN-R became AN-b/p and the bingeing and purging part just became... Something I Do. Usually every night before I go to sleep, unless I'm feeling really medically unstable or I'm randomly sick (like the flu or something unrelated to my ED). The longest I've gone without doing it is about six months, 20 years ago, after I spent a while in hospital because I was critically ill and very underweight, and I was scared and giving recovery a genuine attempt for a while.\n\nAnyway. It's pretty much always the same foods in the exact same order every time I do it. I mean, they change here and there over time, but I go months and sometimes years bingeing on more or less the same stuff. I kind of suspect the way I binge and purge is related to my OCD and autism, I'm a pretty rigid/routinised person in general, so. But yeah, there's no trigger. It's not spontaneous and it's as unemotional as taking a shower every day. Occasionally I have what I think of as 'bad days' where I let things get away from me and I just can't stop and end up doing it for hours on end and feel really out of control... that happens more when I'm overwhelmed and exhausted with life stuff, and I think it's how I just totally mentally check out for a while... but that's the closest I can think of to having a trigger.",
          "created_utc": 1745638077.0
        }
      ]
    },
    {
      "id": "mpbbu7i",
      "author": "Critical_Business_18",
      "body": "Wow, I can see myself in what you write. Boredom is definitely a factor too, for me as well. I forgot to mention it in my original reply. I have both adhd and autism and I think the bingeing and purging has ended up being a weird type of coping tool in order to downregulate my nervous system. I get overstimulated very easily so I keep mostly to myself (I am very asocial).",
      "created_utc": 1745762767.0,
      "score": 2,
      "context": [
        {
          "id": "mp9raqd",
          "author": "Commercial-Race-5702",
          "body": "For me, it’s just how my brain reacts to eating anything. One little bite of food makes me not want to stop eating because I’ve got this all-or-nothing mindset around food. It’s not even about calories anymore. I’ve had bulimia for about five years now (since I was 14), and the longest I’ve gone without b/p-ing is three days during that whole time. Psych wards, getting sick—nothing has stopped the cycle. I’ve procured food using bad methods when I didn’t have access to it (I cut that habit a long time ago, but the memories are shameful). \n\nFood is just something I can’t resist; the moment I taste something or feel even a little full, the combination of the dopamine hit from the food and the ED mindset kicks in. That whole “fuck it, we ate, might as well binge because it’s just how we are—plus, it feels good” mentality.\n\nThat little dopamine hit just sets me off. I’ve got chronic depression, OCD, and autism, and my life’s just generally pretty crappy, so it’s an escape for me. And it doesn’t take much to push me past that precipice. It makes me feel good, and nothing else works as quickly or as powerfully as that food-dopamine hit. I can try distracting myself with exercise, studying, walking, maybe seeing friends (I’m kinda asocial though, so that’s not something I can do often lol)… but in the end, I always end up back at bingeing because none of those other things keep me feeling okay for long. I slip into a bad headspace, and once I start slipping, it’s just too easy to fix it again with a binge. Then the cycle repeats when the feeling comes back.\n\nHopefully one day I’ll figure out how to break out of this, but until then, it’s basically Groundhog Day for me haha. Sending well wishes to you!",
          "created_utc": 1745733079.0
        }
      ]
    },
    {
      "id": "mpbbk6y",
      "author": "Narrow_Road_890",
      "body": "That's amazing ! Still a win anyways even If small :) good job!\n\n\nThe urge to purge is so, so hard to fight. I've been fighting the urge the past 2 days, the only thing stopping me is a promise I made to my mom😔",
      "created_utc": 1745762670.0,
      "score": 2,
      "context": [
        {
          "id": "mpa8jqp",
          "author": "eatmeat2016",
          "body": "I probably notice by the time I eat the second or third different item. At that point there is a quiet resignation that its gonna happen so why not just go with it. \n\nHowever, of late I have got better at not purging. I’d days away from a hip replacement and it’s been delayed due to anaemia. So I’m giving my body a chance for once. Supplementing iron, b12 and just gritting my teeth through the urge to get rid. I failed once but managed to stop as soon as I felt I’d got rid of about half. Which was a small win.",
          "created_utc": 1745743501.0
        }
      ]
    },
    {
      "id": "mpgqbm1",
      "author": "imminentheartburn",
      "body": "This is me as well ",
      "created_utc": 1745838881.0,
      "score": 1,
      "context": [
        {
          "id": "mp379p9",
          "author": "draoikat",
          "body": "Nothing. It's an emotionless ritual for me. In the beginning, when I started bingeing and then eventually purging as well, it was probably my body's reaction to starving it. That was several decades ago (my ED began at 14; I'm 40 now). So I did it out of hunger. My original diagnosis of AN-R became AN-b/p and the bingeing and purging part just became... Something I Do. Usually every night before I go to sleep, unless I'm feeling really medically unstable or I'm randomly sick (like the flu or something unrelated to my ED). The longest I've gone without doing it is about six months, 20 years ago, after I spent a while in hospital because I was critically ill and very underweight, and I was scared and giving recovery a genuine attempt for a while.\n\nAnyway. It's pretty much always the same foods in the exact same order every time I do it. I mean, they change here and there over time, but I go months and sometimes years bingeing on more or less the same stuff. I kind of suspect the way I binge and purge is related to my OCD and autism, I'm a pretty rigid/routinised person in general, so. But yeah, there's no trigger. It's not spontaneous and it's as unemotional as taking a shower every day. Occasionally I have what I think of as 'bad days' where I let things get away from me and I just can't stop and end up doing it for hours on end and feel really out of control... that happens more when I'm overwhelmed and exhausted with life stuff, and I think it's how I just totally mentally check out for a while... but that's the closest I can think of to having a trigger.",
          "created_utc": 1745638077.0
        },
        {
          "id": "mp58wdm",
          "author": "SweetxKiss",
          "body": "This gave me whiplash, are we the same person? AN-R to AN b/p, OCD, been going at this 20+ years… it’s literally just “that thing I do”. It’s a quirk, like people that need to cut the crusts off their bread. It’s just how I operate. Like some kind of robotic programming. \n\nI know how soul-sucking and draining it is. I hope one day you experience peace and I hope your health woes stay small",
          "created_utc": 1745675269.0
        }
      ]
    },
    {
      "id": "mpbqhlc",
      "author": "eatmeat2016",
      "body": "I’ve found Mounjaro helps.",
      "created_utc": 1745767509.0,
      "score": 3,
      "context": [
        {
          "id": "mpa8jqp",
          "author": "eatmeat2016",
          "body": "I probably notice by the time I eat the second or third different item. At that point there is a quiet resignation that its gonna happen so why not just go with it. \n\nHowever, of late I have got better at not purging. I’d days away from a hip replacement and it’s been delayed due to anaemia. So I’m giving my body a chance for once. Supplementing iron, b12 and just gritting my teeth through the urge to get rid. I failed once but managed to stop as soon as I felt I’d got rid of about half. Which was a small win.",
          "created_utc": 1745743501.0
        },
        {
          "id": "mpbbk6y",
          "author": "Narrow_Road_890",
          "body": "That's amazing ! Still a win anyways even If small :) good job!\n\n\nThe urge to purge is so, so hard to fight. I've been fighting the urge the past 2 days, the only thing stopping me is a promise I made to my mom😔",
          "created_utc": 1745762670.0
        }
      ]
    }
  ]
}