{
  "id": "1kcraz7",
  "subreddit": "bulimia",
  "author": "Narrow_Road_890",
  "created_utc": 1746156053.0,
  "title": "Bulimia representation in media sucks",
  "selftext": "It only ever shows it as a a pretty, thin, popular teenage girl purging her normal sized meals. I never really see the bingeing side of bulimia mentioned in quite literally everything.\n\nbulimia is often made fun of in shows or movies too and its genuinely so sad dude\n\nAnd plus, I feel like purging Disorder is misinterpreted as bulimia, when it's NOT.\n\nAnother thing- was watching an older movie about it (Kate's secret I think?) And they show purging as so clean and pretty, and FAST. When it's the literal opposite. For me personally, drool down my arms, in my hair, nose runny, it's shown so bad on the internet.\n\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1kcraz7/bulimia_representation_in_media_sucks/",
  "score": 296,
  "num_comments": 44,
  "comments": [
    {
      "id": "mq52mnb",
      "author": "this-rotten-mind",
      "body": "i feel like the short series Binge on youtube was the best representation i’ve seen, but i completely agree- it’s often a joke like “oh there goes the thin blonde cheerleader to go throw up her salad! silly little girl things” and media like to erase the pain of the disorder",
      "created_utc": 1746158031.0,
      "score": 81,
      "context": []
    },
    {
      "id": "mq4zlwv",
      "author": "greasyhamburgesa",
      "body": "I agree completely. Bulimia has horrible unrealistic representation. As you said it seems to be made out to be a joke more than an issue most of the time. There’s an extreme lack of media covering the realities that bulimics face.",
      "created_utc": 1746156759.0,
      "score": 69,
      "context": []
    },
    {
      "id": "mq59npk",
      "author": "oohyeahgetitiguess",
      "body": "I always think of people like Erik the electric. He gets so much praise for his “challenges” but he def purges and then exercises a lot. It’s a weird glamorization that doesn’t show the devastating effects",
      "created_utc": 1746161263.0,
      "score": 64,
      "context": []
    },
    {
      "id": "mq608g1",
      "author": "fettseck",
      "body": "Yeeeep it really bothers me, especially how the representation for all EDs are shown as frail underweight women when in reality most people with bulimia are \"normal\" or overweight. Actually im pretty positive only a sliver of all ED sufferers are classified as underweight",
      "created_utc": 1746176849.0,
      "score": 36,
      "context": []
    },
    {
      "id": "mq6bo9i",
      "author": "dissess",
      "body": "If I see one more bulimic scene that includes the following points I'll go crazy:\n* teenage girl\n* purging for 5 seconds then being done\n* hair not even tied up\n* purging while sitting\n* purging a normal portion/family dinner",
      "created_utc": 1746183378.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mq6ewgq",
      "author": "LiaSpecter",
      "body": "I'm thin, but not underweight, so literally no one would guess I'm going through this. It's so frustrating how bulimia (and EDs in general) are always associated with being underweight. It makes me feel like I'm not 'sick enough",
      "created_utc": 1746184885.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mq6nvmk",
      "author": "Squintz_ATB",
      "body": "I thought the same thing recently when I was rewatching some episodes of Seinfeld. There's one where a woman George is seeing goes to the bathroom after they eat at restaurants and he thinks she's bulimic. George and Jerry's main concern is that George is paying for them to go out to eat but she's potentially not keeping her food down, thus wasting his money. Then they try to devise a plan to catch her in the act and know for sure.\n\nI was kinda like \"ehhhhh 🤦🏻‍♂️\"",
      "created_utc": 1746188605.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mq6ikte",
      "author": "yourtypicalINFP",
      "body": "Watch Parachute. I absolutely loved it. The movie doesn’t focus entirely on the eating disorder but rather the way it affects every aspect of your life",
      "created_utc": 1746186476.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mq8twte",
      "author": "FutureAd108",
      "body": "I would love to see bullimia without vomit purging, like lax abuse, exercise etc. Exercise bullimia goes undiagnosed in so many people, especially men, because media doesn’t show that kind of bullimia",
      "created_utc": 1746211924.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mq92lyh",
      "author": "Helen_Cheddar",
      "body": "Bulimia has only made me gain more and more weight- but you never see that on TV.",
      "created_utc": 1746214513.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mq75cbk",
      "author": "TiredandIHateThis",
      "body": "The closest I've ever seen to average binge-purge behavior representation was Manny from Degrassi the next gen in the late 00s\nNot perfect, but close.",
      "created_utc": 1746194582.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mq7ixm2",
      "author": "bridgeoveroceanblvd",
      "body": "See: Heathers and the Heathers Musical",
      "created_utc": 1746198545.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mqaowl7",
      "author": "okaysweaty167",
      "body": "The ONLY accurate bulimia movie is a short(ish) film that’s super old called The Secret Life of Mary Margaret. It’s based on an actual woman’s experience and she helped write it. It’s shows her vomiting in jars and storing them in her closet, losing some much money on binge shopping, her ED friend dies in college, depressive episode where she b/p for 2 weeks straight. It’s hard to watch but very accurate.",
      "created_utc": 1746233620.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqajw1t",
      "author": "Key_Significance_179",
      "body": "THISSS OMG. bulimia is specifically binging and purging😭 and purging is probably the least clean/easy thing on earth. it's depicted so inaccurately",
      "created_utc": 1746231803.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqbrxp0",
      "author": "Numerous-Crew2851",
      "body": "Yeah purging in movies is always shown as fast but it takes me a bit to get it all up sometimes, and it gets all over me and wherever I’m doing it.",
      "created_utc": 1746250264.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqc8cy9",
      "author": "None",
      "body": "I think regular people would find it too jarring.\n\n\nAnd even talking about it. For me to talk about half of what I did would be classified as tips and tricks which are banned on most forums including this one, I can't even say half the things I want because I'd put ideas in people's heads.",
      "created_utc": 1746260051.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqs5q2p",
      "author": "Comfortable-Milk8397",
      "body": "Seeing these people on tv be bulimic with relative “success” is one of the primary reasons I started as a kid.",
      "created_utc": 1746481895.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mr73dn0",
      "author": "Correct_Internet_890",
      "body": "im writing a novel where the main character has bulimia :) ☝️ its a slow moving project, as i’m a full-time student on top of having a full-time job. however, it’s based on my own experiences as well as what i’ve seen in my almost decade of having an ED (i would finally consider myself recovered now)\n\nsorry, i just had to say that because these posts are what i still come on this subreddit for. it’s helpful to know what not to include, and what there could be more of",
      "created_utc": 1746681073.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqb3si9",
      "author": "None",
      "body": "it’s really upsetting how it’s always a joke on shows. like when im randomly watching a show i get a bulimic joke and that just puts me off from the show. im so sick of this shit",
      "created_utc": 1746239215.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqbgwth",
      "author": "shartlobsterdog",
      "body": "Especially for purging other than vomiting, like the only lax abuse representation I’ve seen is Daisy randone from girl interrupted",
      "created_utc": 1746244712.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqc1dk9",
      "author": "DyskoliHyneka",
      "body": "I always think about that scene in Stupid Girls by pink",
      "created_utc": 1746255736.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqjxkm0",
      "author": "SoupNo2785",
      "body": "literally. I was watching sharing the secret and honestly it’s probably the best representation i’ve seen in the media however the purging was just so clean and fast. I wish it was that easy and quick lol….",
      "created_utc": 1746373949.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqyur9k",
      "author": "Material-Site-7950",
      "body": "Yeah, earlier tonight I was texting my boyfriend about it. I was complaining about how no one talks about everything that happens around bulimia. I mean, it's like it take no more than a minute to purge, whatever kind of purging, and then on with the day like nothing happened. It's so unfair. People get the wrong idea about what it is to be bulimic. \n\nI mentioned the episode in which Serena (gossip girl) goes to Blair and sits in the bathroom with her. They just stay there, no judgement. Serena really is there for her. She is feeling terrible about it. I love this scene. I wish I had a Serena whom I could call and would help me be compassionate towards myself by showing me compassion, love and care. I wish I had a Serena.",
      "created_utc": 1746570913.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqc56k2",
      "author": "bulimiawallace",
      "body": "Aaron the professional bulimic or whatever his channel is",
      "created_utc": 1746258074.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqpopnv",
      "author": "SubstantialSlide4068",
      "body": "I thought the representation of bulimia in gossip girl with blare was quite good but still quite overlooked, it would be interesting to see more of how it affects her but I know that’s not what the show is about 🤷‍♀️",
      "created_utc": 1746455636.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqxrjbd",
      "author": "UsefulManner9520",
      "body": "In Waterloo Road (on BBC iplayer/Netflix,for the UK atleast) there is representation of a boy with bulimia and he binges and out of the trash and alot but the storyline is only really mentioned a couple times, after a heart attack he just seems to \"Get better\" and not have an ed anymore(obviously very unrealistic)",
      "created_utc": 1746559381.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrnoe8y",
      "author": "FearlessStudy805",
      "body": "IKR ! but I actually kinda liked Blair Waldorfs representation of bulimia ,it showed that her condition came back when stressed and showed her binging and then being sad in the aftermath. Despite Blair being popular and thin she had a more realistic portrayal then shitty 2000's movies .",
      "created_utc": 1746915258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mq6yvov",
      "author": "Missjess5500",
      "body": "That's exactly what I think about his challenges. He has at least sports bulimia.",
      "created_utc": 1746192537.0,
      "score": 19,
      "context": [
        {
          "id": "mq59npk",
          "author": "oohyeahgetitiguess",
          "body": "I always think of people like Erik the electric. He gets so much praise for his “challenges” but he def purges and then exercises a lot. It’s a weird glamorization that doesn’t show the devastating effects",
          "created_utc": 1746161263.0
        }
      ]
    },
    {
      "id": "mqc8jug",
      "author": "None",
      "body": "I watched him a few times until I realised he was and it just pissed me right the fuck off.\n I even worked out what his approximate game plan would be and it's plain old bulimic behaviour in extreme form.\n\n\nI've read he gets negative comments removed.",
      "created_utc": 1746260170.0,
      "score": 5,
      "context": [
        {
          "id": "mq59npk",
          "author": "oohyeahgetitiguess",
          "body": "I always think of people like Erik the electric. He gets so much praise for his “challenges” but he def purges and then exercises a lot. It’s a weird glamorization that doesn’t show the devastating effects",
          "created_utc": 1746161263.0
        }
      ]
    },
    {
      "id": "mq637wg",
      "author": "Narrow_Road_890",
      "body": "No LITERALLY. I've always been overweight/obese, and it triggers me everytime. Cause you're only taken seriously when underweight or skinny! I'm not trying to downplay anorexia either- it's just sad not all eds are treated with the same sympathy :(",
      "created_utc": 1746178725.0,
      "score": 19,
      "context": [
        {
          "id": "mq608g1",
          "author": "fettseck",
          "body": "Yeeeep it really bothers me, especially how the representation for all EDs are shown as frail underweight women when in reality most people with bulimia are \"normal\" or overweight. Actually im pretty positive only a sliver of all ED sufferers are classified as underweight",
          "created_utc": 1746176849.0
        }
      ]
    },
    {
      "id": "mq6f95x",
      "author": "Narrow_Road_890",
      "body": "YES OMG purging is so time consuming. Especially after a huge binge. And I notice people assume this too. My mom is aware of my purging and she'll ask me \"you won't purge dinner won't you?\" No?? Or in restaurants too, I'm not purging EVERYTHING that goes in my mouth.",
      "created_utc": 1746185045.0,
      "score": 24,
      "context": [
        {
          "id": "mq6bo9i",
          "author": "dissess",
          "body": "If I see one more bulimic scene that includes the following points I'll go crazy:\n* teenage girl\n* purging for 5 seconds then being done\n* hair not even tied up\n* purging while sitting\n* purging a normal portion/family dinner",
          "created_utc": 1746183378.0
        }
      ]
    },
    {
      "id": "mq81vn3",
      "author": "lonely-blue-sheep",
      "body": "Exactly!! It’s like really? Like okay that could be an actual thing, but that’s NOT ALL OF IT. Show the horrible parts of it too, like the blotchy purge-face from bursting too many blood vessels in your face, or getting vomit splashing back on you (gross), or eating 14 packs of fruit snacks in one sitting and then hating the weird sour aftertaste you get when you’re done purging. Like I get it shouldn’t all be gross, but these are the unfortunate side effects of binging and purging. It’s not just vomiting sunshine and rainbows, it really sucks",
      "created_utc": 1746203923.0,
      "score": 13,
      "context": [
        {
          "id": "mq6bo9i",
          "author": "dissess",
          "body": "If I see one more bulimic scene that includes the following points I'll go crazy:\n* teenage girl\n* purging for 5 seconds then being done\n* hair not even tied up\n* purging while sitting\n* purging a normal portion/family dinner",
          "created_utc": 1746183378.0
        }
      ]
    },
    {
      "id": "mqbs6y4",
      "author": "Numerous-Crew2851",
      "body": "Same",
      "created_utc": 1746250404.0,
      "score": 1,
      "context": [
        {
          "id": "mq6ewgq",
          "author": "LiaSpecter",
          "body": "I'm thin, but not underweight, so literally no one would guess I'm going through this. It's so frustrating how bulimia (and EDs in general) are always associated with being underweight. It makes me feel like I'm not 'sick enough",
          "created_utc": 1746184885.0
        }
      ]
    },
    {
      "id": "mqaq1qk",
      "author": "okaysweaty167",
      "body": "I wish they would’ve had Emma relapse eventually, would’ve made it way more realistic. I did like how they showed Emma pressuring Manny to “join her” because that does actually happen often in irl.",
      "created_utc": 1746234037.0,
      "score": 2,
      "context": [
        {
          "id": "mq75cbk",
          "author": "TiredandIHateThis",
          "body": "The closest I've ever seen to average binge-purge behavior representation was Manny from Degrassi the next gen in the late 00s\nNot perfect, but close.",
          "created_utc": 1746194582.0
        }
      ]
    },
    {
      "id": "mqapod7",
      "author": "okaysweaty167",
      "body": "“Bulimia is so ‘87” my mom loves the movie Heathers but after my ED that line rly pisses her off. And then in the show Make It Or Break It, her teammate hears her puking and the bathroom and says, “you know that’s sooo bad for your electrolytes” and the girl puking says “what can I say, I’m addicted to breakfast biscuits🤷🏼‍♀️” and ofc it’s never mentioned again. It’s really ironic because then in the next season there’s a big anorexia story with one of the gymnasts.",
      "created_utc": 1746233902.0,
      "score": 3,
      "context": [
        {
          "id": "mq7ixm2",
          "author": "bridgeoveroceanblvd",
          "body": "See: Heathers and the Heathers Musical",
          "created_utc": 1746198545.0
        }
      ]
    },
    {
      "id": "mqanbdj",
      "author": "Narrow_Road_890",
      "body": "Literally. binging is required for a genuine bulimia diagnosis yet its never acknowledged🥲 they never show the financial cost, cleaning up after, and so much more!",
      "created_utc": 1746233046.0,
      "score": 3,
      "context": [
        {
          "id": "mqajw1t",
          "author": "Key_Significance_179",
          "body": "THISSS OMG. bulimia is specifically binging and purging😭 and purging is probably the least clean/easy thing on earth. it's depicted so inaccurately",
          "created_utc": 1746231803.0
        }
      ]
    },
    {
      "id": "mrahzt5",
      "author": "astr1787",
      "body": "Would live to read it.<33",
      "created_utc": 1746729922.0,
      "score": 1,
      "context": [
        {
          "id": "mr73dn0",
          "author": "Correct_Internet_890",
          "body": "im writing a novel where the main character has bulimia :) ☝️ its a slow moving project, as i’m a full-time student on top of having a full-time job. however, it’s based on my own experiences as well as what i’ve seen in my almost decade of having an ED (i would finally consider myself recovered now)\n\nsorry, i just had to say that because these posts are what i still come on this subreddit for. it’s helpful to know what not to include, and what there could be more of",
          "created_utc": 1746681073.0
        }
      ]
    },
    {
      "id": "mqkee7q",
      "author": "bridgeoveroceanblvd",
      "body": "Ugh, yeah. 🙄 Of course the anorexia takes center stage.",
      "created_utc": 1746379086.0,
      "score": 2,
      "context": [
        {
          "id": "mq7ixm2",
          "author": "bridgeoveroceanblvd",
          "body": "See: Heathers and the Heathers Musical",
          "created_utc": 1746198545.0
        },
        {
          "id": "mqapod7",
          "author": "okaysweaty167",
          "body": "“Bulimia is so ‘87” my mom loves the movie Heathers but after my ED that line rly pisses her off. And then in the show Make It Or Break It, her teammate hears her puking and the bathroom and says, “you know that’s sooo bad for your electrolytes” and the girl puking says “what can I say, I’m addicted to breakfast biscuits🤷🏼‍♀️” and ofc it’s never mentioned again. It’s really ironic because then in the next season there’s a big anorexia story with one of the gymnasts.",
          "created_utc": 1746233902.0
        }
      ]
    },
    {
      "id": "mqaxz55",
      "author": "Key_Significance_179",
      "body": "exactly!!😭💔",
      "created_utc": 1746236981.0,
      "score": 2,
      "context": [
        {
          "id": "mqajw1t",
          "author": "Key_Significance_179",
          "body": "THISSS OMG. bulimia is specifically binging and purging😭 and purging is probably the least clean/easy thing on earth. it's depicted so inaccurately",
          "created_utc": 1746231803.0
        },
        {
          "id": "mqanbdj",
          "author": "Narrow_Road_890",
          "body": "Literally. binging is required for a genuine bulimia diagnosis yet its never acknowledged🥲 they never show the financial cost, cleaning up after, and so much more!",
          "created_utc": 1746233046.0
        }
      ]
    },
    {
      "id": "mqis7bi",
      "author": "Time-Information-657",
      "body": "it makes me feel so invalidated like i’m faking this ed because i binge 😭",
      "created_utc": 1746359100.0,
      "score": 2,
      "context": [
        {
          "id": "mqajw1t",
          "author": "Key_Significance_179",
          "body": "THISSS OMG. bulimia is specifically binging and purging😭 and purging is probably the least clean/easy thing on earth. it's depicted so inaccurately",
          "created_utc": 1746231803.0
        },
        {
          "id": "mqanbdj",
          "author": "Narrow_Road_890",
          "body": "Literally. binging is required for a genuine bulimia diagnosis yet its never acknowledged🥲 they never show the financial cost, cleaning up after, and so much more!",
          "created_utc": 1746233046.0
        }
      ]
    },
    {
      "id": "mrbedeb",
      "author": "Correct_Internet_890",
      "body": "when i have a complete and edited draft, i will probably post on here and other ed subreddits looking for ed-cognizant beta-readers :)",
      "created_utc": 1746739571.0,
      "score": 2,
      "context": [
        {
          "id": "mr73dn0",
          "author": "Correct_Internet_890",
          "body": "im writing a novel where the main character has bulimia :) ☝️ its a slow moving project, as i’m a full-time student on top of having a full-time job. however, it’s based on my own experiences as well as what i’ve seen in my almost decade of having an ED (i would finally consider myself recovered now)\n\nsorry, i just had to say that because these posts are what i still come on this subreddit for. it’s helpful to know what not to include, and what there could be more of",
          "created_utc": 1746681073.0
        },
        {
          "id": "mrahzt5",
          "author": "astr1787",
          "body": "Would live to read it.<33",
          "created_utc": 1746729922.0
        }
      ]
    }
  ]
}