{
  "id": "1kf2x6s",
  "subreddit": "bulimia",
  "author": "Sower2Sweet",
  "created_utc": 1746418638.0,
  "title": "You know what’s SO frustrating?",
  "selftext": "Wanna know what’s SO frustrating? Binging, then going to the bathroom to purge. You get ready, and when you go to do it nothing comes out. I literally just sat there trying and trying but nothing… then sat there crying because I was SO frustrated. It feels like I’ve lost my one thing I usually have control over. The second day in a row this happened. This last week has been so horrible and it makes the binge feel 10X more awful when I can’t get it out of me after. Maybe I’m waiting too long after the binge? Not drinking enough water? It’s driving me insane because (shamefully) I almost look forward to my purge after a binge. It gives me a tiny bit of control over my life. It scares me so much; makes me fear any little thing I put in my mouth because what if my body rejects me the sweetness of getting taking it right back out?",
  "url": "https://www.reddit.com/r/bulimia/comments/1kf2x6s/you_know_whats_so_frustrating/",
  "score": 74,
  "num_comments": 22,
  "comments": [
    {
      "id": "mqocitj",
      "author": "boredhousewaifu",
      "body": "Such a painful and anxious feeling, I feel ya :( it would happen to me when I was purging too frequently, I took it as a sign that my escape route was no longer available. \n\nWhich is an even more painful and anxious feeling! until I realised that if my body was no longer capable of purging then I probably wouldn't feel so 'free' to binge all the time",
      "created_utc": 1746434532.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mqosg78",
      "author": "SweetBabyMona",
      "body": "This sometimes happens to me too and it makes me feel even worse about myself! Like you said it made me feel even more out of control and I'd cry and it'd just be a horrible time. I noticed that certain \"safe\" foods were causing it for me cause I cut out some things and now I'm down to only 2 foods I know I can get up no matter what. I hate that we both know that feeling of shame after binging and not being able to purge. It's so terrible",
      "created_utc": 1746443620.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mqqu53t",
      "author": "JustaVet-MedGirl",
      "body": "I wish I could hug you and show you that you aren't alone in this. Everything you described is like something I could have written, and I'm sure it's the same for many on this forum. This crap is absolute torture, like the closest thing to hell on earth, but please keep your chin up. It does get better, I promise ❤️ Someday food will just be food. Please dm me if you ever need a place to vent or a shoulder to lean on. 🫂",
      "created_utc": 1746467767.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqr5nj8",
      "author": "idk_2464",
      "body": "This had been happening to me for like a week and my gag reflex is like GONE or I’ll just dry heave, it’s so exhausting and I feel your pain. I’m glad somebody else is experiencing this because I didn’t understand why it was happening",
      "created_utc": 1746471142.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqo70e0",
      "author": "finnyyy-winnyyy",
      "body": "Dude this happened to me and I haven’t been able to purge for 6 months at all, just happened one day",
      "created_utc": 1746430986.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mr19qxp",
      "author": "IndividualRemote6213",
      "body": "Hii. This happened to me when i was purging to frequently, or if i didn’t have enough water. Sometimes you’re so stressed that your body just refuses to follow your instructions (for good reason though). I know it feels awful, you feel bloated and like you will gain 10kg for that one binge, but you know i feel like bulimia is more mental than physical, you FEEL like it’s literally the end but it is actually not. The next day you’ll feel awful sure, the next one probably the same. But if you just handle this suffering for a bit more (trying to break this never ending cycle) im sure it can get better. \n\nA few things that helped me so far is trying to be more religious, i know this sounds strange but believing that there is a higher power that wants you here, that made you exactly this way and that loves you unconditionally can be very strengthening for our hearts. I for example believe in God but am actually a Buddhist (those things aren’t incompatible by the way) and there is a lot of accepting suffering to be liberated and the sacredness of food in this eastern religions. It’s beautiful really, and make us see food in this whole other way. \nThis is a more superficial advice, but when the binge was really bad i just repeated to myself/almost gaslighting me “so what, this just means i have one more week in my health/fitness journey”.\nThis is a controversial subject, but i am trying to loose weight IN recovery. And i don’t feel like this is a bad thing, knowing how much it matters to me i know myself enough to recognize that it doesn’t feel good when i say “let’s just eat whatever i want because i can be an intuitive eater” the thing is intuitive eating is really fucking hard for bulimics and can be a trap. I for instance binged A LOT of times trying this. So i am honest to myself. It’s okay really to like yourself skinnier. it’s okay. you’re not superficial and insecure and disgusting because of that. the problem is when you hate yourself now so much you never allow yourself to change. To be at peace with yourself. It is essential to remember though that loosing fat is the consequence (and NOT the cause) of being healthy and well. Focus on living everyday and every minute for those causes (and that means more than food, it means relationships, family, study/work, hobbies, exercise etc). A good tip to start is to fix one filling breakfast you’ll have everyday. This one thing felt really safe for me because i could just rely on that one meal to not binge when everything else felt so overwhelming. I like to do banana oatmeal with nuts. It’s warm and sweet and comforting. \nSo having said that. I send my love to you. you’re not alone. we’re not alone. Stay true to yourself. Practice awareness in every bite. Make food sacred and it will heal you, not poison you.\n\nAnother thing is that i would love to have a partner/friend to share my struggles and help each other figuring this out. Im looking for a reliable and committed relationship to help recovery. kinda like a sponsor things (but more horizontal since we’ll be helping each other out) they have in the 12 steps. If anyone is interested dm me please😊A bit more about me: Im from Brazil, São Paulo. I have 19 and am currently in med school.",
      "created_utc": 1746608330.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mr23wg1",
      "author": "Straight_Wonder_9125",
      "body": "Omg, I remember one time when I had eaten just a piece of cake, completely freaked out, went to the bathroom to purge, couldn’t do it, started to cry, and then I just ate the whole cake (crying)",
      "created_utc": 1746622715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrqu47t",
      "author": "probablyauggie0",
      "body": "ohmygod i came to this sub because this has been happening to me these past few days and i have the sorest jaw and the reddest knuckles for nothing, ill be trying for half an hour and all ill get is saliva all over myself :(",
      "created_utc": 1746969733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mrkmton",
      "author": "772219353",
      "body": "I make sure to drink Coke, helps bring it up easily or I have that tea that is like laxatives. Either way extremely exhausting wrapping your self around a bowl with your fingers down your throat then being trigged when all of it isn’t coming out. Horrible cycle",
      "created_utc": 1746876645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqoexgk",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1746436070.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqnqzqa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1746421451.0,
      "score": -18,
      "context": []
    },
    {
      "id": "mquajgh",
      "author": "ToastyOpal",
      "body": "were there any signs of it happening???",
      "created_utc": 1746511043.0,
      "score": 2,
      "context": [
        {
          "id": "mqo70e0",
          "author": "finnyyy-winnyyy",
          "body": "Dude this happened to me and I haven’t been able to purge for 6 months at all, just happened one day",
          "created_utc": 1746430986.0
        }
      ]
    },
    {
      "id": "mr5ccws",
      "author": "Sower2Sweet",
      "body": "I feel this! It feels 10x worse when you can’t get it out of your body and your body goes to its most reliable comfort method, which is another binge. I wish I could just not eat anything, or at least eat healthier, but my living conditions don’t allow that. Maybe go on a liquid diet?",
      "created_utc": 1746657287.0,
      "score": 3,
      "context": [
        {
          "id": "mr23wg1",
          "author": "Straight_Wonder_9125",
          "body": "Omg, I remember one time when I had eaten just a piece of cake, completely freaked out, went to the bathroom to purge, couldn’t do it, started to cry, and then I just ate the whole cake (crying)",
          "created_utc": 1746622715.0
        }
      ]
    },
    {
      "id": "mrud1sw",
      "author": "Sower2Sweet",
      "body": "Right! Maybe I don’t drink enough water or something?",
      "created_utc": 1747013099.0,
      "score": 1,
      "context": [
        {
          "id": "mrqu47t",
          "author": "probablyauggie0",
          "body": "ohmygod i came to this sub because this has been happening to me these past few days and i have the sorest jaw and the reddest knuckles for nothing, ill be trying for half an hour and all ill get is saliva all over myself :(",
          "created_utc": 1746969733.0
        }
      ]
    },
    {
      "id": "mqp5gre",
      "author": "bulimia-ModTeam",
      "body": "This post or comment was removed for: \nSharing ‘tips and tricks’ on how to do ED behaviors.",
      "created_utc": 1746449142.0,
      "score": 1,
      "context": [
        {
          "id": "mqoexgk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746436070.0
        }
      ]
    },
    {
      "id": "mqnzhyh",
      "author": "DropExtension5909",
      "body": "not helpful…",
      "created_utc": 1746426267.0,
      "score": 9,
      "context": [
        {
          "id": "mqnqzqa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746421451.0
        }
      ]
    },
    {
      "id": "mqqurxb",
      "author": "JustaVet-MedGirl",
      "body": "What a cruel thing to write on a post like this. Trying to give tips, or one-up OP, is very inappropriate. Please think about what you've done wrong and do better in the future. You truly don't gain anything from acting this way.",
      "created_utc": 1746467945.0,
      "score": 5,
      "context": [
        {
          "id": "mqnqzqa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746421451.0
        }
      ]
    },
    {
      "id": "mqv6mz1",
      "author": "finnyyy-winnyyy",
      "body": "No I just stopped for like a bit cuz I was restricting more and once I decided to try to purge again it didn’t work, I have been able to like twice since and not successfully/not without spending 45 minutes putting my body through the ringer",
      "created_utc": 1746530300.0,
      "score": 3,
      "context": [
        {
          "id": "mqo70e0",
          "author": "finnyyy-winnyyy",
          "body": "Dude this happened to me and I haven’t been able to purge for 6 months at all, just happened one day",
          "created_utc": 1746430986.0
        },
        {
          "id": "mquajgh",
          "author": "ToastyOpal",
          "body": "were there any signs of it happening???",
          "created_utc": 1746511043.0
        }
      ]
    },
    {
      "id": "mqrnds2",
      "author": "arabellaboobooo",
      "body": "one up? you said it not me. i wasn’t trying to do anything like that.",
      "created_utc": 1746476369.0,
      "score": 1,
      "context": [
        {
          "id": "mqnqzqa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746421451.0
        },
        {
          "id": "mqqurxb",
          "author": "JustaVet-MedGirl",
          "body": "What a cruel thing to write on a post like this. Trying to give tips, or one-up OP, is very inappropriate. Please think about what you've done wrong and do better in the future. You truly don't gain anything from acting this way.",
          "created_utc": 1746467945.0
        }
      ]
    },
    {
      "id": "mqrnno3",
      "author": "arabellaboobooo",
      "body": "i’m not trying to one up anyone or trying to make it into a competition but i agree i apologize for possibly giving  tips  i can see that now xxxxx ill delete my comment",
      "created_utc": 1746476448.0,
      "score": 1,
      "context": [
        {
          "id": "mqnqzqa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746421451.0
        },
        {
          "id": "mqqurxb",
          "author": "JustaVet-MedGirl",
          "body": "What a cruel thing to write on a post like this. Trying to give tips, or one-up OP, is very inappropriate. Please think about what you've done wrong and do better in the future. You truly don't gain anything from acting this way.",
          "created_utc": 1746467945.0
        }
      ]
    },
    {
      "id": "mqrna6b",
      "author": "arabellaboobooo",
      "body": "i don’t mean to be rude or anything i was just agreeing w the OP but sorry i made u feel that way",
      "created_utc": 1746476340.0,
      "score": 0,
      "context": [
        {
          "id": "mqnqzqa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1746421451.0
        },
        {
          "id": "mqqurxb",
          "author": "JustaVet-MedGirl",
          "body": "What a cruel thing to write on a post like this. Trying to give tips, or one-up OP, is very inappropriate. Please think about what you've done wrong and do better in the future. You truly don't gain anything from acting this way.",
          "created_utc": 1746467945.0
        }
      ]
    }
  ]
}