{
  "id": "1kpugcy",
  "subreddit": "bulimia",
  "author": "OkFirefighter2779",
  "created_utc": 1747602310.0,
  "title": "People thinking I don’t eat",
  "selftext": "I started a new job, I never eat on my lunch break or snacks. They constantly say I don’t eat. I had to make up allergies I don’t have to get out of it. I can’t purge working 12 hours straight. It hurts so bad to hear “oh she doesn’t eat” when I’m dreaming and drooling about being able to enjoy the plain sandwich that’s probably dry in the staff fridge. The stomach pain when I smell someone’s hot meal in the break room. “Oh she doesn’t eat”…. God I wish I could. Why do people say this sh* lol",
  "url": "https://www.reddit.com/r/bulimia/comments/1kpugcy/people_thinking_i_dont_eat/",
  "score": 80,
  "num_comments": 11,
  "comments": [
    {
      "id": "mt0xbdw",
      "author": "RiskyRisk117",
      "body": "It pisses me off when people think it’s easy too - like “oh yea she just doesn’t rlly like biscuits” and “she’s just one of those people that barley gets hungry” AAAAAAAAAA",
      "created_utc": 1747605935.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mt10agi",
      "author": "avoidingmyboss",
      "body": "This was a big thing at work for me. I have the babiest digestive system and also was restricting and I knew that if I ate a donut it wouldn’t be just one, anytime I ate even my safe food I would bloat, so I kept my food intake really low residue and safe and I know it appeared like I never ate. AND it never helped that there was a constant supply of food. My supervisor would order donuts like every other morning and make sure all of us had one or two, or we’d have team meeting and food would be there for all of us. There were always comments, you’re not eating? I’d say I already ate, and was always hit back with yeah but you can eat again!! (No…but thank you) So my go-to was to always take the food, take a plate and stack donuts, stack the birthday cake slices, the croissants and cookies, sandwiches, pizza slices, whatever it was, and keep it at my desk for ‘later’. I was always the last person to clock out anyway so no one saw me eating it but they did see it on my desk and the comments stopped. Now this part I didn’t like, but I’d take those things and toss them on my way out when I knew no one was around or looking. I didn’t want to binge on any of those things. If the food was sealed then I’d donate to a friend but if it wasn’t I’d toss it. So keeping food at my desk, in plain sight for all to see, really helped curb their idea of me never eating.",
      "created_utc": 1747606964.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mt2qggp",
      "author": "Missjess5500",
      "body": "I've always felt that way. She's so thin she doesn't eat anything or is just healthy 😂",
      "created_utc": 1747632102.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mt3fbam",
      "author": "beepbopboopbop69",
      "body": "lol i always told my team i'm into intermittent fasting 💀",
      "created_utc": 1747647305.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mt1ufnr",
      "author": "arabellaboobooo",
      "body": "i kind of like it",
      "created_utc": 1747618072.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mt48sp8",
      "author": "fatale_x",
      "body": "Yeah I hate this too. That's why I usually have lunch by myself, so they don't judge/comment on what I eat/don't eat.",
      "created_utc": 1747660883.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mt5u4fm",
      "author": "FarBeyondDriv3n",
      "body": "Yes especially being underweight ppl think i just dont get cravings and survive off of healthy food",
      "created_utc": 1747678239.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mt7dtaq",
      "author": "Common_Willingness51",
      "body": "I can relate to almost all the answers here!!!",
      "created_utc": 1747695511.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt8fl39",
      "author": "shartlobsterdog",
      "body": "No for reallll.. like I won't eat anything at school the entire day because I go home and binge bro 😭",
      "created_utc": 1747709434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt2j4pv",
      "author": "OkFirefighter2779",
      "body": "I know what you mean, it’s like ‘my work is paying off….’ But it’s still hurts to hear",
      "created_utc": 1747628306.0,
      "score": 4,
      "context": [
        {
          "id": "mt1ufnr",
          "author": "arabellaboobooo",
          "body": "i kind of like it",
          "created_utc": 1747618072.0
        }
      ]
    },
    {
      "id": "mt5u9ts",
      "author": "FarBeyondDriv3n",
      "body": "Meanwhile i eat the amount of food they eat in one week in a sitting.",
      "created_utc": 1747678282.0,
      "score": 6,
      "context": [
        {
          "id": "mt5u4fm",
          "author": "FarBeyondDriv3n",
          "body": "Yes especially being underweight ppl think i just dont get cravings and survive off of healthy food",
          "created_utc": 1747678239.0
        }
      ]
    }
  ]
}