{
  "id": "1ksw484",
  "subreddit": "bulimia",
  "author": "teeniesquishy",
  "created_utc": 1747933770.0,
  "title": "\"yes, you have body.\"",
  "selftext": "the other night my fiancé and i were sitting on our couch watching our show. we usually smoke in the evenings and he will always make a bunch of snacks after. i either don't touch them, or i end up binging them and then panicking about having to secretly purge. \n\nthis was a night where i actually had the self control to stop, but not before i was uncomfortably full. the feeling of being full in general is a massive purge trigger for me, especially as i am a very petite woman (4'9\") so my stomach visibly swells. i don't normally verbalize my struggles with bulimia to my fiancé, or talk about it very much at all in general. in fact, nearly all of the discussions we have had about it, he has always been the one to bring up the subject.\n\nsometimes we talk to each other without determiners in our sentences, 'baby talk,' if you will. (i know that's cringey, but it's besides the point.) anyways, after finishing a large amount but not BINGE amount of snacks, i started to squirm around and become physically and mentally uncomfortable. he asked me what was wrong, and i explained the fullness feeling and why. i told him i can't handle seeing how big my stomach gets when im full.\n\nhe chuckles and says \"you have [a] body, sweetheart. sorry to break it to you. can't control that you have [a] body and that [your] body does body things.\"\n\nfor some reason, that simple, horrifically grammatically incorrect statement was a true moment of clarity for me. \"you have body, sorry to break it to you. can't control that you have body and that body does body things.\" \n\nit really is that simple. i've been saying it to myself a lot since and it's helped me so much to ground myself to back to reality whenever i start getting triggered. it's also helped me give myself grace and 'forgive' myself for things like being hungry. i am sharing in hopes that it could possibly help someone else too. :).",
  "url": "https://www.reddit.com/r/bulimia/comments/1ksw484/yes_you_have_body/",
  "score": 76,
  "num_comments": 3,
  "comments": [
    {
      "id": "mtpsgf2",
      "author": "elitost",
      "body": "I really like this. It's such a simple statement but holds so much weight for those of us struggling with EDs. It's true, day in and day out I'm fighting my body being a body and it's exhausting and silly and ultimately I'll never be satisfied because I want my body to just stop doing body things. I totally understand the feeling of fullness and how anxiety-provoking it is. The stomach swelling after eating, ugh. Those are huge triggers for me too. I like this. Take care xo",
      "created_utc": 1747944795.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mttsaj7",
      "author": "Odd_Panic_6574",
      "body": "Well said \nHope u doing fine now",
      "created_utc": 1748004779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mtvivun",
      "author": "FarBeyondDriv3n",
      "body": "I cried reading the last 3 paragraphs",
      "created_utc": 1748023109.0,
      "score": 3,
      "context": []
    }
  ]
}