{
  "id": "1l03eph",
  "subreddit": "bulimia",
  "author": "daisy_s21",
  "created_utc": 1748714547.0,
  "title": "It happened. I ruptured my esophagus and had to rush to the hospital.",
  "selftext": "Hi all. Mods feel free to delete if inappropriate. \n\nThree days ago, I had purged and for some reason it triggered uncontrollable retching. I thought I felt fine after, but an hour later I felt the need to (uncontrollably, not self induced) vomit and it was about half blood. I was in denial. Until a few hours later, around 3am, I woke up knowing I was going to throw up immediately. Ran to my bathroom didn’t even make it to the toilet but puked in the sink. I was absolutely HORRIFIED, TERRIFIED, of what I saw. A sink full of blood and huge blood clots. Imagine 20 giant red worms, double the size of your biggest finger. It sent me into absolute panic. I woke up my partner and while sobbing asked him to drive me to the ER. Once I was there, I threw up more blood clots. they did many many tests including an endoscopy and confirmed I had ruptured my esophagus causing stomach bleeding and the first thing they asked me was “do you struggle with bulimia or purging disorder?” And I just sobbed and sobbed. TWELVE YEARS of purging and it happened. The thing that I was always warned about. It’s been the most terrifying thing I’ve ever experienced, I truly thought that I was somehow throwing up my intestines because the clots were so big. I would never ever ever wish that on another person. Mallory-Weise syndrome. On the way to the hospital I called my mother weeping because I thought I was truly dying. I had to spend 3 nights in the hospital while they did test after test, for a minute they thought I could possibly have esophagus cancer (my grandmother did) and I was so, so scared until I admitted my purging. Thankfully my partner was incredibly supportive (we’ve been together 2 years and he had no idea of my purging past/current habits.) I am okay now, but I’m so scared if I ever purge again. I’ve had nightmares replaying the sink full of clots. I don’t know exactly where I’m going with this, but I am so scared that I won’t be able to stop myself next time I feel the urge and it’ll happen again. I just don’t know what to do. This has made me want to be better and stop. But I don’t know if I can, please all I am looking for is some supportive words. I was so terrified. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1l03eph/it_happened_i_ruptured_my_esophagus_and_had_to/",
  "score": 392,
  "num_comments": 58,
  "comments": [
    {
      "id": "mvab8ci",
      "author": "silkmoths",
      "body": "well this story has me scared shitless and i may never purge again so thank you for that. not that i wasnt already trying to avoid it but now i don't think I'll be able to even consider it without vividly picturing what you described. god bless you 💜",
      "created_utc": 1748716372.0,
      "score": 151,
      "context": []
    },
    {
      "id": "mva7pga",
      "author": "StockReporter5",
      "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
      "created_utc": 1748715246.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mvai0os",
      "author": "rescuecatmomlover",
      "body": "holy shit, I'm so glad you went to the ER and got checked out.  Was it a bigger BP than usual or just a typical BP that  triggered this? I truly hope this can help you get on the road to recovery, how freaking terrifying!   Also, thank you for writing this out, I'm currently almost 70 days into a no BP streak and reading stuff like this keeps me going.   You can do this too <3",
      "created_utc": 1748718547.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mvb7aiy",
      "author": "Svedish_f1sh",
      "body": "Hi so this might be the thing that finally makes me quit. Took me this long to find out this can happen 😛",
      "created_utc": 1748726469.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mvb637h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748726075.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mvarqfc",
      "author": "Murky-Jellyfish7619",
      "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
      "created_utc": 1748721624.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvctqpm",
      "author": "calamity--",
      "body": "Same thing happened to me 2 years ago. The tear was so big I had to have surgery.\nI feel for you love, you can get through this <3",
      "created_utc": 1748747892.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvb2x1v",
      "author": "elitost",
      "body": "oh no that sounds absolutely terrifying, I'm so so glad you had someone there with you to rush you to the hospital!! I'm so relieved you made it out okay and don't have esophageal cancer. That sounds like such a traumatizing experience to live through. I've been hospitalized and at my sickest the doctors didn't think I'd make it, so I understand how frightening things like that can be. I can't offer much advice since I'm in the middle of a relapse, but just wanted to say that you're not alone. Take care op xoxo",
      "created_utc": 1748725075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mvb807w",
      "author": "Excellent-World-476",
      "body": "Can you do hospital based or residential based treatment. That is a good place to go.",
      "created_utc": 1748726702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvcb3ve",
      "author": "vbgirl24",
      "body": "I am so happy you’re okay and are here to share your experience. That sounds so terrifying and traumatic. I hope this can be an impetus to change, because you matter and you deserve better than this. I never want you to experience something like this again! It definitely makes me want to get better and give up purging, so thank you for that  ❤️‍🩹",
      "created_utc": 1748740732.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvcegdh",
      "author": "DimensionThin147",
      "body": "I didn't even know this was possible. I am so sorry",
      "created_utc": 1748742020.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvcijrr",
      "author": "softtrashh",
      "body": "since finding out this a long while ago i have stopped. im so sorry you have to go through this.",
      "created_utc": 1748743552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvgnbgw",
      "author": "lurky_in_bezerkerly",
      "body": "This is terrifying! I’m glad you’re okay. It seems like inpatient treatment could be a good option if you’re still struggling with urges to purge so that you can be under medical supervision while your body recovers?",
      "created_utc": 1748804415.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvxiisu",
      "author": "Organic-Cod1285",
      "body": "I Had A Similar Thing Happen Roughly 24 Hours Before My 19th Birthday",
      "created_utc": 1749034940.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvbtljp",
      "author": "oblivi0n_x",
      "body": "Oh my god. I'm so glad you went to the hospital and you're okay ❤️‍🩹 wake up calls are super rough but you will get past this and you've got another chance. Right now try to be kind to yourself and not stress about forever, just what you can do to heal today. You can do this, rooting for you 🩵",
      "created_utc": 1748734176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvbv5uj",
      "author": "withextracheesepls",
      "body": "i’m so sorry, and so glad you’re okay. i’ve never experienced an esophageal rupture but i have had a mallory weiss tear before, and seeing the toilet full of blood scared me so much. for some reason i didn’t go to the emergency room though, and it kinda just resolved on it’s own (i did see a gastroenterologist not long after but still)… to anyone reading this, if you throw up blood, go to the hospital. don’t be stupid like i was, i’m lucky it wasn’t more serious for me than it was.",
      "created_utc": 1748734738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvdiw0v",
      "author": "three_d0wn",
      "body": "Oh I’m so so sorry. That’s completely traumatic. I really really hope that this turns things around for you, and I’m so grateful you shared because, quite frankly, it’s making me terrified too. You’ve got this. I wish you all the best as you heal.",
      "created_utc": 1748760275.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvp878y",
      "author": "Typical-Display3714",
      "body": "Wow thank you for sharing. This has really motivated me to stop purging.",
      "created_utc": 1748916862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvpa9j7",
      "author": "Potential_Vacation52",
      "body": "Hope you are feeling better now.",
      "created_utc": 1748917621.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvptx0v",
      "author": "Ok_ab_1",
      "body": "Thank you for sharing. It must be a very hard thing to talk about, but it’s good people understand how much this can harm you over time. Hope you recover and hope anyone else struggling with this can as well.",
      "created_utc": 1748925778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwjnsiq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1749327751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "my0iy84",
      "author": "Chuck_Bassfannacc",
      "body": "i’m so sorry this happened to you. I’ve been warned by doctors and therapists about this for a long time coming. I’ve been bulimic for about three years now and have still convinced myself that this will never happen to me. Wondering how long you’ve been purging for, your story really motivated me to stop, so thank you for sharibg",
      "created_utc": 1750040808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mytlwwa",
      "author": "feverdream800",
      "body": "can you get help? like psychological help? therapy has helped me. I was bullimic in highschool. I know the feeling of not knowing how to control the urge and not even caring if you die in that moment bc the urge is soo strong. but I finally told my mom and she was so supportive my boyfriend, ex husband at the time was also very supportive and we I  went to rehab (it wasn't fun I won't lie) and i started therapy. its been 12 years since the last time I purged and Im still on therapy. i'll always have the thought of wanting to purge but when I do, I list the things that are triggering it, I literally just go on like a 2-3 hour walk, there's a lot of stuff I do to help me not focus on it. you just have to find what works for you.",
      "created_utc": 1750431460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz9thgv",
      "author": "GeroFaust",
      "body": "I’m really sorry you went through this, that sounds horrifying. I hope you’re able to recover alright.",
      "created_utc": 1750651060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzqqsa8",
      "author": "Itry_Ifail_Itryagain",
      "body": "Hi OP, I'm so sorry to hear what happened to you and it has me holding back tears.\n\n I used to struggle doing this years ago and the urge has been slowly coming back as mine is based on anxiety and sometimes I can't control it either.\n\nReading this made me hurt for you, I'm so sorry. I hope you're doing better and I'm happy to hear your partner is supportive. Please know I'm here thinking of you and wishing for you to get better.",
      "created_utc": 1750875930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mztlj83",
      "author": "garlicgato",
      "body": "Thank you for sharing your story, that is truly terrifying and I wish you a peaceful recovery 💚",
      "created_utc": 1750908744.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvacclt",
      "author": "daisy_s21",
      "body": "That’s all I can hope for, to have people realize those horror stories can actually happen to us, they aren’t just myths. It was so, so scary I truly thought my life was on the line. I wish you the absolute, absolute best in your recovery. I know how incredibly hard it is, but believe me that you are STRONGER than the urge. It’s something to take day by day. relapses can happen of course but as long as you actively work toward stopping that’s all we can do. I sincerely wish you the best and you can always DM for support if needed.",
      "created_utc": 1748716733.0,
      "score": 60,
      "context": [
        {
          "id": "mvab8ci",
          "author": "silkmoths",
          "body": "well this story has me scared shitless and i may never purge again so thank you for that. not that i wasnt already trying to avoid it but now i don't think I'll be able to even consider it without vividly picturing what you described. god bless you 💜",
          "created_utc": 1748716372.0
        }
      ]
    },
    {
      "id": "mvbxyo2",
      "author": "Glenchables",
      "body": "I was going go say the same thing. I am so sorry about this and i hope u recover well. But you just saved some lives today.",
      "created_utc": 1748735749.0,
      "score": 10,
      "context": [
        {
          "id": "mvab8ci",
          "author": "silkmoths",
          "body": "well this story has me scared shitless and i may never purge again so thank you for that. not that i wasnt already trying to avoid it but now i don't think I'll be able to even consider it without vividly picturing what you described. god bless you 💜",
          "created_utc": 1748716372.0
        }
      ]
    },
    {
      "id": "mva8er9",
      "author": "daisy_s21",
      "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
      "created_utc": 1748715468.0,
      "score": 46,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        }
      ]
    },
    {
      "id": "mvamuxz",
      "author": "daisy_s21",
      "body": "It was a normal one, no bigger than usual which is why it was especially scary that it can happen so suddenly. Thank you for your kind words, and holy congratulations on almost hitting 70 days! That is truly amazing and inspiring. It’s hard but I know we can do this <3",
      "created_utc": 1748720078.0,
      "score": 21,
      "context": [
        {
          "id": "mvai0os",
          "author": "rescuecatmomlover",
          "body": "holy shit, I'm so glad you went to the ER and got checked out.  Was it a bigger BP than usual or just a typical BP that  triggered this? I truly hope this can help you get on the road to recovery, how freaking terrifying!   Also, thank you for writing this out, I'm currently almost 70 days into a no BP streak and reading stuff like this keeps me going.   You can do this too <3",
          "created_utc": 1748718547.0
        }
      ]
    },
    {
      "id": "mvchnkb",
      "author": "daisy_s21",
      "body": "I never, ever thought it would happen to me. Doctors and therapists for years warned me but I was too proud to ever think I’d ever experience it. And then i did. And it was awful, horrible, truly scary beyond words. It was the slap in the face I needed. I didn’t think anything would ever motivate me to stop but then this happened and I realize how fragile life is and how much we are fucking with it by doing what we do. I would never, ever judge someone on a relapse because I get it, but please do not ever let it get to the point that I did. I truly thought I was speaking to my mother for the last time. Nothing is worth that feeling.",
      "created_utc": 1748743220.0,
      "score": 8,
      "context": [
        {
          "id": "mvb7aiy",
          "author": "Svedish_f1sh",
          "body": "Hi so this might be the thing that finally makes me quit. Took me this long to find out this can happen 😛",
          "created_utc": 1748726469.0
        }
      ]
    },
    {
      "id": "mvcgm3d",
      "author": "daisy_s21",
      "body": "This absolutely was my rock bottom. I’ve been pulled out of school as a teen, taken to rehab centers, family therapy. Nothing has ever slapped me in the face the way this did. Truly motivation to finally get my shit together and actually take care of myself and stop destroying my health. Thank you. Wishing you the best on any journey you are on.",
      "created_utc": 1748742825.0,
      "score": 6,
      "context": [
        {
          "id": "mvb637h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748726075.0
        }
      ]
    },
    {
      "id": "mvat6ag",
      "author": "daisy_s21",
      "body": "Thank you. I can honestly say, after 12 years and two treatment centers, being removed from school for inpatient, etc, this has actually been the biggest wake up call. I think this is the slap in the face that, unfortunately, I had to experience to finally understand and truly realize the importance of stopping.",
      "created_utc": 1748722084.0,
      "score": 5,
      "context": [
        {
          "id": "mvarqfc",
          "author": "Murky-Jellyfish7619",
          "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
          "created_utc": 1748721624.0
        }
      ]
    },
    {
      "id": "mvfncfe",
      "author": "rescuecatmomlover",
      "body": "Wow so glad you are ok! Did you manage to turn things around after that?",
      "created_utc": 1748793731.0,
      "score": 3,
      "context": [
        {
          "id": "mvctqpm",
          "author": "calamity--",
          "body": "Same thing happened to me 2 years ago. The tear was so big I had to have surgery.\nI feel for you love, you can get through this <3",
          "created_utc": 1748747892.0
        }
      ]
    },
    {
      "id": "mvcwqf3",
      "author": "daisy_s21",
      "body": "I’m so, so sorry that happened to you. I’m so glad to see you’re still here and living it up! It’s genuinely so scary. Such a slap in the face. Thank you for the kindness <3 I truly want to get better after this.",
      "created_utc": 1748749151.0,
      "score": 2,
      "context": [
        {
          "id": "mvctqpm",
          "author": "calamity--",
          "body": "Same thing happened to me 2 years ago. The tear was so big I had to have surgery.\nI feel for you love, you can get through this <3",
          "created_utc": 1748747892.0
        }
      ]
    },
    {
      "id": "mvch6w2",
      "author": "daisy_s21",
      "body": "I know we aren’t alone, we are kicking this in the butt together even when relapses happen. No one and no recovery is perfect. Relapses will happen but all that matters is that we TRY. I am truly wishing the best for you to fight this disease. It’s a scary, scary thing and it’s horrifying to learn those horror stories aren’t just stories but can happen to us. I wish you the best.",
      "created_utc": 1748743047.0,
      "score": 3,
      "context": [
        {
          "id": "mvb2x1v",
          "author": "elitost",
          "body": "oh no that sounds absolutely terrifying, I'm so so glad you had someone there with you to rush you to the hospital!! I'm so relieved you made it out okay and don't have esophageal cancer. That sounds like such a traumatizing experience to live through. I've been hospitalized and at my sickest the doctors didn't think I'd make it, so I understand how frightening things like that can be. I can't offer much advice since I'm in the middle of a relapse, but just wanted to say that you're not alone. Take care op xoxo",
          "created_utc": 1748725075.0
        }
      ]
    },
    {
      "id": "mvcj91u",
      "author": "daisy_s21",
      "body": "Absolutely a slap in the face to change. I never, ever want to experience that again. It was truly terrifying beyond words. I have had many “rock bottom” moments with my ED, but NOTHING has ever scared me the way this did. I truly would never wish this on anyone else, I was so scared. I was scared I would never see my family again. I was scared I would never get to tell my mother and father I love them again. I truly felt as though my life was on the line, and if I had kept it up, it probably was. This community and your comments have all been such a beautiful sense of love and motivation. Thank you.",
      "created_utc": 1748743817.0,
      "score": 2,
      "context": [
        {
          "id": "mvcb3ve",
          "author": "vbgirl24",
          "body": "I am so happy you’re okay and are here to share your experience. That sounds so terrifying and traumatic. I hope this can be an impetus to change, because you matter and you deserve better than this. I never want you to experience something like this again! It definitely makes me want to get better and give up purging, so thank you for that  ❤️‍🩹",
          "created_utc": 1748740732.0
        }
      ]
    },
    {
      "id": "mvci0ve",
      "author": "daisy_s21",
      "body": "It was terrible and so, so scary but in a way I am glad that I FINALLY understand how much I am fucking with my life by doing this. It is truly a rock bottom moment and as scary as it is to experience and come back from that, I now know the severe physical consequences of this that I thought were a myth for years. Thank you so so much for your kind words. It’s hard but I’m going to make sure I get through this.",
      "created_utc": 1748743358.0,
      "score": 3,
      "context": [
        {
          "id": "mvbtljp",
          "author": "oblivi0n_x",
          "body": "Oh my god. I'm so glad you went to the hospital and you're okay ❤️‍🩹 wake up calls are super rough but you will get past this and you've got another chance. Right now try to be kind to yourself and not stress about forever, just what you can do to heal today. You can do this, rooting for you 🩵",
          "created_utc": 1748734176.0
        }
      ]
    },
    {
      "id": "mvcir3t",
      "author": "daisy_s21",
      "body": "It is so, so scary to look down and see the toilet/sink full of blood. Please, next time, if this happens again please go to the ER. I know it is so scary, I didn’t want to go initially, I was scared out of my mind and didn’t want to go in case they told me it was something even worse (cancer, liver rupture, etc) but my partner convinced me. is so serious, please do not ignore it if it happens again. It is so scary. I am SO glad you ended up okay but please please do not hesitate to see a doctor if it happens again <3",
      "created_utc": 1748743629.0,
      "score": 2,
      "context": [
        {
          "id": "mvbv5uj",
          "author": "withextracheesepls",
          "body": "i’m so sorry, and so glad you’re okay. i’ve never experienced an esophageal rupture but i have had a mallory weiss tear before, and seeing the toilet full of blood scared me so much. for some reason i didn’t go to the emergency room though, and it kinda just resolved on it’s own (i did see a gastroenterologist not long after but still)… to anyone reading this, if you throw up blood, go to the hospital. don’t be stupid like i was, i’m lucky it wasn’t more serious for me than it was.",
          "created_utc": 1748734738.0
        }
      ]
    },
    {
      "id": "mwk3bhf",
      "author": "daisy_s21",
      "body": "I’m 26 as well, been purging since I was 14. Honestly, as cliche as it sounds, i highly, highly urge you to get therapy if you haven’t already. I can only speak for the effectiveness of that from others, because I was in inpatient and that didn’t even really stop me. I know it’s so fucking hard to have the care to stop. It’s been my biggest struggle in life and it becomes so normal and habitual to you that it doesn’t even feel like a struggle anymore. But I can honestly say, puking up a fuck ton of blood clots has never scared me so bad. My family lives far away, so I thought I was going to die without getting to hug them again. Never getting to see my friends again. Never getting to kiss my partner again. Never getting to feel the things I love in life again, like sun on my skin on a beautiful day or the sound of my favorite song or having a good stomach-ache-causing laugh with a friend, not that I have many of them, but those moments are what crossed my mind. Never getting to cuddle my moms dog again. It’s cliche, again, but you’re the only one who can truly help you. Losing a tooth is HORRIBLE, it happened to me last year, but if therapy and that doesn’t make you want to stop, maybe like me, it takes that life or death feeling to understand what you are doing to yourself. Although I do truly hope it doesn’t come to that for you. Whatever you can find to motivate you, I am sending you so much love and light and truly, truly hope you can overcome this. It is not easy. It is not fun. But I am rooting for you.",
      "created_utc": 1749332886.0,
      "score": 1,
      "context": [
        {
          "id": "mwjnsiq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1749327751.0
        }
      ]
    },
    {
      "id": "mzr6xtr",
      "author": "daisy_s21",
      "body": "This is so, so incredibly sweet of you. I know what it’s like to have those relapsed urges, especially from anxiety. I sincerely appreciate your words so much and I am hoping the absolute best for you and you continue with this battle. You are strong, you can do this. Hugs to you",
      "created_utc": 1750880567.0,
      "score": 1,
      "context": [
        {
          "id": "mzqqsa8",
          "author": "Itry_Ifail_Itryagain",
          "body": "Hi OP, I'm so sorry to hear what happened to you and it has me holding back tears.\n\n I used to struggle doing this years ago and the urge has been slowly coming back as mine is based on anxiety and sometimes I can't control it either.\n\nReading this made me hurt for you, I'm so sorry. I hope you're doing better and I'm happy to hear your partner is supportive. Please know I'm here thinking of you and wishing for you to get better.",
          "created_utc": 1750875930.0
        }
      ]
    },
    {
      "id": "mvcaryq",
      "author": "None",
      "body": "Your life literally IS on the line. You should seek in patient treatment immediately. Sounds harsh. I was hospitalized for low potassium on the verge of heart failure, and still purged after getting released. This is a disease and you have to want to help yourself. I continued the battle for 20 more years.",
      "created_utc": 1748740603.0,
      "score": 16,
      "context": [
        {
          "id": "mvab8ci",
          "author": "silkmoths",
          "body": "well this story has me scared shitless and i may never purge again so thank you for that. not that i wasnt already trying to avoid it but now i don't think I'll be able to even consider it without vividly picturing what you described. god bless you 💜",
          "created_utc": 1748716372.0
        },
        {
          "id": "mvacclt",
          "author": "daisy_s21",
          "body": "That’s all I can hope for, to have people realize those horror stories can actually happen to us, they aren’t just myths. It was so, so scary I truly thought my life was on the line. I wish you the absolute, absolute best in your recovery. I know how incredibly hard it is, but believe me that you are STRONGER than the urge. It’s something to take day by day. relapses can happen of course but as long as you actively work toward stopping that’s all we can do. I sincerely wish you the best and you can always DM for support if needed.",
          "created_utc": 1748716733.0
        }
      ]
    },
    {
      "id": "mvekr0s",
      "author": "Eddie_1027",
      "body": "I’m so sorry you went through this. This sounds like you need more than your own willpower to get through it, though. Have you considered reaching out to medical professionals? I’d really urge you to consider it. Please take care of yourself and you’re in my prayers 🙏",
      "created_utc": 1748781096.0,
      "score": 4,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        },
        {
          "id": "mva8er9",
          "author": "daisy_s21",
          "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
          "created_utc": 1748715468.0
        }
      ]
    },
    {
      "id": "mvaqtt3",
      "author": "rescuecatmomlover",
      "body": "Thanks for answering! Besides the tear, did they say anything about the shape of your esophagus?   As in potential for Barrett’s or anything like that?  What’s the treatment plan look like now and is painful to eat? Sending you all the healing vibes!",
      "created_utc": 1748721339.0,
      "score": 5,
      "context": [
        {
          "id": "mvai0os",
          "author": "rescuecatmomlover",
          "body": "holy shit, I'm so glad you went to the ER and got checked out.  Was it a bigger BP than usual or just a typical BP that  triggered this? I truly hope this can help you get on the road to recovery, how freaking terrifying!   Also, thank you for writing this out, I'm currently almost 70 days into a no BP streak and reading stuff like this keeps me going.   You can do this too <3",
          "created_utc": 1748718547.0
        },
        {
          "id": "mvamuxz",
          "author": "daisy_s21",
          "body": "It was a normal one, no bigger than usual which is why it was especially scary that it can happen so suddenly. Thank you for your kind words, and holy congratulations on almost hitting 70 days! That is truly amazing and inspiring. It’s hard but I know we can do this <3",
          "created_utc": 1748720078.0
        }
      ]
    },
    {
      "id": "mvateq5",
      "author": "daisy_s21",
      "body": "It won’t be easy, I know that, but this has truly made me actually want to try. I even had a tooth fall out last year due to purging and still didn’t realize the reality of the consequences until this.",
      "created_utc": 1748722160.0,
      "score": 5,
      "context": [
        {
          "id": "mvarqfc",
          "author": "Murky-Jellyfish7619",
          "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
          "created_utc": 1748721624.0
        },
        {
          "id": "mvat6ag",
          "author": "daisy_s21",
          "body": "Thank you. I can honestly say, after 12 years and two treatment centers, being removed from school for inpatient, etc, this has actually been the biggest wake up call. I think this is the slap in the face that, unfortunately, I had to experience to finally understand and truly realize the importance of stopping.",
          "created_utc": 1748722084.0
        }
      ]
    },
    {
      "id": "mvjffsd",
      "author": "calamity--",
      "body": "thankyou <3 sadly no, my addictions stronger than anything life's thrown at me (multiple near death experiences 😭)",
      "created_utc": 1748840775.0,
      "score": 2,
      "context": [
        {
          "id": "mvctqpm",
          "author": "calamity--",
          "body": "Same thing happened to me 2 years ago. The tear was so big I had to have surgery.\nI feel for you love, you can get through this <3",
          "created_utc": 1748747892.0
        },
        {
          "id": "mvfncfe",
          "author": "rescuecatmomlover",
          "body": "Wow so glad you are ok! Did you manage to turn things around after that?",
          "created_utc": 1748793731.0
        }
      ]
    },
    {
      "id": "mvjfb4c",
      "author": "calamity--",
      "body": "I'm really glad you're still here too, you have so much left to do and shit can get better <3",
      "created_utc": 1748840711.0,
      "score": 3,
      "context": [
        {
          "id": "mvctqpm",
          "author": "calamity--",
          "body": "Same thing happened to me 2 years ago. The tear was so big I had to have surgery.\nI feel for you love, you can get through this <3",
          "created_utc": 1748747892.0
        },
        {
          "id": "mvcwqf3",
          "author": "daisy_s21",
          "body": "I’m so, so sorry that happened to you. I’m so glad to see you’re still here and living it up! It’s genuinely so scary. Such a slap in the face. Thank you for the kindness <3 I truly want to get better after this.",
          "created_utc": 1748749151.0
        }
      ]
    },
    {
      "id": "mvck5r4",
      "author": "withextracheesepls",
      "body": "definitely. i pray it never happens again, and i’ve been doing so much better with purging, but have been having issues with involuntary vomiting which can cause it too so i’m still scared… it’s such a terrifying possibility that’s too too real",
      "created_utc": 1748744168.0,
      "score": 2,
      "context": [
        {
          "id": "mvbv5uj",
          "author": "withextracheesepls",
          "body": "i’m so sorry, and so glad you’re okay. i’ve never experienced an esophageal rupture but i have had a mallory weiss tear before, and seeing the toilet full of blood scared me so much. for some reason i didn’t go to the emergency room though, and it kinda just resolved on it’s own (i did see a gastroenterologist not long after but still)… to anyone reading this, if you throw up blood, go to the hospital. don’t be stupid like i was, i’m lucky it wasn’t more serious for me than it was.",
          "created_utc": 1748734738.0
        },
        {
          "id": "mvcir3t",
          "author": "daisy_s21",
          "body": "It is so, so scary to look down and see the toilet/sink full of blood. Please, next time, if this happens again please go to the ER. I know it is so scary, I didn’t want to go initially, I was scared out of my mind and didn’t want to go in case they told me it was something even worse (cancer, liver rupture, etc) but my partner convinced me. is so serious, please do not ignore it if it happens again. It is so scary. I am SO glad you ended up okay but please please do not hesitate to see a doctor if it happens again <3",
          "created_utc": 1748743629.0
        }
      ]
    },
    {
      "id": "mvjm8x5",
      "author": "daisy_s21",
      "body": "It’s something I have been considering. I did outpatient in high school and had to be pulled from school for months and still lied through my teeth to every doctor I had and I’m not at all proud of it. That’s one of the scariest parts of this disease is how much it makes you lie, lie, lie to the people who want to help you. But this has made me seriously want to help myself, and it’s sad it took this extreme of a situation to finally want to truly get my shit together. I’m 100% going back to at least outpatient therapy and seriously thinking about inpatient. Looking into my options that I have near me and would need to figure out what that would look like taking me out of work for however long (gotta love American healthcare sigh) but my life is worth finding a way to make it work.",
      "created_utc": 1748844389.0,
      "score": 6,
      "context": [
        {
          "id": "mvab8ci",
          "author": "silkmoths",
          "body": "well this story has me scared shitless and i may never purge again so thank you for that. not that i wasnt already trying to avoid it but now i don't think I'll be able to even consider it without vividly picturing what you described. god bless you 💜",
          "created_utc": 1748716372.0
        },
        {
          "id": "mvacclt",
          "author": "daisy_s21",
          "body": "That’s all I can hope for, to have people realize those horror stories can actually happen to us, they aren’t just myths. It was so, so scary I truly thought my life was on the line. I wish you the absolute, absolute best in your recovery. I know how incredibly hard it is, but believe me that you are STRONGER than the urge. It’s something to take day by day. relapses can happen of course but as long as you actively work toward stopping that’s all we can do. I sincerely wish you the best and you can always DM for support if needed.",
          "created_utc": 1748716733.0
        },
        {
          "id": "mvcaryq",
          "author": "None",
          "body": "Your life literally IS on the line. You should seek in patient treatment immediately. Sounds harsh. I was hospitalized for low potassium on the verge of heart failure, and still purged after getting released. This is a disease and you have to want to help yourself. I continued the battle for 20 more years.",
          "created_utc": 1748740603.0
        }
      ]
    },
    {
      "id": "mvjmso6",
      "author": "daisy_s21",
      "body": "You are so kind, thank you. I have multiple follow up appointments scheduled and going back to outpatient therapy. Considering inpatient. Luckily my boss has been very understanding and I am fortunate to have PTO built up to take time off to recover as my job is pretty physically demanding. Its so easy to convince yourself it isn’t as serious as it is until the unthinkable happens :(",
      "created_utc": 1748844694.0,
      "score": 2,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        },
        {
          "id": "mva8er9",
          "author": "daisy_s21",
          "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
          "created_utc": 1748715468.0
        },
        {
          "id": "mvekr0s",
          "author": "Eddie_1027",
          "body": "I’m so sorry you went through this. This sounds like you need more than your own willpower to get through it, though. Have you considered reaching out to medical professionals? I’d really urge you to consider it. Please take care of yourself and you’re in my prayers 🙏",
          "created_utc": 1748781096.0
        }
      ]
    },
    {
      "id": "mvasojc",
      "author": "daisy_s21",
      "body": "Thank you so so much for your kindness. This community means a lot to me right now. They did say that I urgently needed to stop purging or it could reopen and worsen the tear (which could result in needing metal pins put in to keep it closed.) they only briefly mentioned potential of Barrets once at the beginning but it didn’t come up again. \n\nI’m on a lot of different medications they prescribed me for about a month, and I’ve been told to take a week off of work as my work involves a lot of physical movement (hotel housekeeping manager so a lot of lifting and bending and pushing). I was only permitted to have clear liquids (though also more sold-ish things like jello and ice chips) while in the hospital and now that I’m out I’ve been instructed a soft food only diet for a few days, so not sure what it’ll be like when I return to harder foods.",
      "created_utc": 1748721927.0,
      "score": 9,
      "context": [
        {
          "id": "mvai0os",
          "author": "rescuecatmomlover",
          "body": "holy shit, I'm so glad you went to the ER and got checked out.  Was it a bigger BP than usual or just a typical BP that  triggered this? I truly hope this can help you get on the road to recovery, how freaking terrifying!   Also, thank you for writing this out, I'm currently almost 70 days into a no BP streak and reading stuff like this keeps me going.   You can do this too <3",
          "created_utc": 1748718547.0
        },
        {
          "id": "mvamuxz",
          "author": "daisy_s21",
          "body": "It was a normal one, no bigger than usual which is why it was especially scary that it can happen so suddenly. Thank you for your kind words, and holy congratulations on almost hitting 70 days! That is truly amazing and inspiring. It’s hard but I know we can do this <3",
          "created_utc": 1748720078.0
        },
        {
          "id": "mvaqtt3",
          "author": "rescuecatmomlover",
          "body": "Thanks for answering! Besides the tear, did they say anything about the shape of your esophagus?   As in potential for Barrett’s or anything like that?  What’s the treatment plan look like now and is painful to eat? Sending you all the healing vibes!",
          "created_utc": 1748721339.0
        }
      ]
    },
    {
      "id": "mvb6b9w",
      "author": "Murky-Jellyfish7619",
      "body": "I’m have nightmares about losing teeth. My teeth are wearing down. Just remember you are a whole ass person and should be loved and valued for who you actually are. You have so much more ti offer. Fuck this disease",
      "created_utc": 1748726149.0,
      "score": 7,
      "context": [
        {
          "id": "mvarqfc",
          "author": "Murky-Jellyfish7619",
          "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
          "created_utc": 1748721624.0
        },
        {
          "id": "mvat6ag",
          "author": "daisy_s21",
          "body": "Thank you. I can honestly say, after 12 years and two treatment centers, being removed from school for inpatient, etc, this has actually been the biggest wake up call. I think this is the slap in the face that, unfortunately, I had to experience to finally understand and truly realize the importance of stopping.",
          "created_utc": 1748722084.0
        },
        {
          "id": "mvateq5",
          "author": "daisy_s21",
          "body": "It won’t be easy, I know that, but this has truly made me actually want to try. I even had a tooth fall out last year due to purging and still didn’t realize the reality of the consequences until this.",
          "created_utc": 1748722160.0
        }
      ]
    },
    {
      "id": "mvcl5tp",
      "author": "daisy_s21",
      "body": "I absolutely understand the struggle with involuntary vomiting. It gets to a point where you do it so much, your body just…is used to it? And does it regardless. And it is scary. Because as much as you consciously want to stop, your body still does it. It’s hard. I sincerely am sending you all the love and good thoughts in your recovery because I truly understand where you are with that. Much, much love. Hoping the absolute best for you.",
      "created_utc": 1748744553.0,
      "score": 1,
      "context": [
        {
          "id": "mvbv5uj",
          "author": "withextracheesepls",
          "body": "i’m so sorry, and so glad you’re okay. i’ve never experienced an esophageal rupture but i have had a mallory weiss tear before, and seeing the toilet full of blood scared me so much. for some reason i didn’t go to the emergency room though, and it kinda just resolved on it’s own (i did see a gastroenterologist not long after but still)… to anyone reading this, if you throw up blood, go to the hospital. don’t be stupid like i was, i’m lucky it wasn’t more serious for me than it was.",
          "created_utc": 1748734738.0
        },
        {
          "id": "mvcir3t",
          "author": "daisy_s21",
          "body": "It is so, so scary to look down and see the toilet/sink full of blood. Please, next time, if this happens again please go to the ER. I know it is so scary, I didn’t want to go initially, I was scared out of my mind and didn’t want to go in case they told me it was something even worse (cancer, liver rupture, etc) but my partner convinced me. is so serious, please do not ignore it if it happens again. It is so scary. I am SO glad you ended up okay but please please do not hesitate to see a doctor if it happens again <3",
          "created_utc": 1748743629.0
        },
        {
          "id": "mvck5r4",
          "author": "withextracheesepls",
          "body": "definitely. i pray it never happens again, and i’ve been doing so much better with purging, but have been having issues with involuntary vomiting which can cause it too so i’m still scared… it’s such a terrifying possibility that’s too too real",
          "created_utc": 1748744168.0
        }
      ]
    },
    {
      "id": "mvjsl4t",
      "author": "Eddie_1027",
      "body": "I’m glad to hear that! It sounds like you know exactly what to do. I’m wishing you all the best in your recovery. I’m currently dealing with some esophagus issues as well and it is NOT fun.",
      "created_utc": 1748847997.0,
      "score": 2,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        },
        {
          "id": "mva8er9",
          "author": "daisy_s21",
          "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
          "created_utc": 1748715468.0
        },
        {
          "id": "mvekr0s",
          "author": "Eddie_1027",
          "body": "I’m so sorry you went through this. This sounds like you need more than your own willpower to get through it, though. Have you considered reaching out to medical professionals? I’d really urge you to consider it. Please take care of yourself and you’re in my prayers 🙏",
          "created_utc": 1748781096.0
        },
        {
          "id": "mvjmso6",
          "author": "daisy_s21",
          "body": "You are so kind, thank you. I have multiple follow up appointments scheduled and going back to outpatient therapy. Considering inpatient. Luckily my boss has been very understanding and I am fortunate to have PTO built up to take time off to recover as my job is pretty physically demanding. Its so easy to convince yourself it isn’t as serious as it is until the unthinkable happens :(",
          "created_utc": 1748844694.0
        }
      ]
    },
    {
      "id": "mvbua9d",
      "author": "rescuecatmomlover",
      "body": "best of luck to you!  I'd be interested in any updates if you feel like posting them, <3",
      "created_utc": 1748734423.0,
      "score": 4,
      "context": [
        {
          "id": "mvai0os",
          "author": "rescuecatmomlover",
          "body": "holy shit, I'm so glad you went to the ER and got checked out.  Was it a bigger BP than usual or just a typical BP that  triggered this? I truly hope this can help you get on the road to recovery, how freaking terrifying!   Also, thank you for writing this out, I'm currently almost 70 days into a no BP streak and reading stuff like this keeps me going.   You can do this too <3",
          "created_utc": 1748718547.0
        },
        {
          "id": "mvamuxz",
          "author": "daisy_s21",
          "body": "It was a normal one, no bigger than usual which is why it was especially scary that it can happen so suddenly. Thank you for your kind words, and holy congratulations on almost hitting 70 days! That is truly amazing and inspiring. It’s hard but I know we can do this <3",
          "created_utc": 1748720078.0
        },
        {
          "id": "mvaqtt3",
          "author": "rescuecatmomlover",
          "body": "Thanks for answering! Besides the tear, did they say anything about the shape of your esophagus?   As in potential for Barrett’s or anything like that?  What’s the treatment plan look like now and is painful to eat? Sending you all the healing vibes!",
          "created_utc": 1748721339.0
        },
        {
          "id": "mvasojc",
          "author": "daisy_s21",
          "body": "Thank you so so much for your kindness. This community means a lot to me right now. They did say that I urgently needed to stop purging or it could reopen and worsen the tear (which could result in needing metal pins put in to keep it closed.) they only briefly mentioned potential of Barrets once at the beginning but it didn’t come up again. \n\nI’m on a lot of different medications they prescribed me for about a month, and I’ve been told to take a week off of work as my work involves a lot of physical movement (hotel housekeeping manager so a lot of lifting and bending and pushing). I was only permitted to have clear liquids (though also more sold-ish things like jello and ice chips) while in the hospital and now that I’m out I’ve been instructed a soft food only diet for a few days, so not sure what it’ll be like when I return to harder foods.",
          "created_utc": 1748721927.0
        }
      ]
    },
    {
      "id": "mvcgvz2",
      "author": "daisy_s21",
      "body": "Thank you so much for your lovely words. Losing a tooth was scary af and I do not want it to happen again. I’m finally realizing the physical consequences of this disease and it’s been a kick in the ass to do my best to stop. Sending you the most positive vibes I can <3",
      "created_utc": 1748742930.0,
      "score": 2,
      "context": [
        {
          "id": "mvarqfc",
          "author": "Murky-Jellyfish7619",
          "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
          "created_utc": 1748721624.0
        },
        {
          "id": "mvat6ag",
          "author": "daisy_s21",
          "body": "Thank you. I can honestly say, after 12 years and two treatment centers, being removed from school for inpatient, etc, this has actually been the biggest wake up call. I think this is the slap in the face that, unfortunately, I had to experience to finally understand and truly realize the importance of stopping.",
          "created_utc": 1748722084.0
        },
        {
          "id": "mvateq5",
          "author": "daisy_s21",
          "body": "It won’t be easy, I know that, but this has truly made me actually want to try. I even had a tooth fall out last year due to purging and still didn’t realize the reality of the consequences until this.",
          "created_utc": 1748722160.0
        },
        {
          "id": "mvb6b9w",
          "author": "Murky-Jellyfish7619",
          "body": "I’m have nightmares about losing teeth. My teeth are wearing down. Just remember you are a whole ass person and should be loved and valued for who you actually are. You have so much more ti offer. Fuck this disease",
          "created_utc": 1748726149.0
        }
      ]
    },
    {
      "id": "mvclbuc",
      "author": "withextracheesepls",
      "body": "<3 i wish you the best as well",
      "created_utc": 1748744617.0,
      "score": 1,
      "context": [
        {
          "id": "mvbv5uj",
          "author": "withextracheesepls",
          "body": "i’m so sorry, and so glad you’re okay. i’ve never experienced an esophageal rupture but i have had a mallory weiss tear before, and seeing the toilet full of blood scared me so much. for some reason i didn’t go to the emergency room though, and it kinda just resolved on it’s own (i did see a gastroenterologist not long after but still)… to anyone reading this, if you throw up blood, go to the hospital. don’t be stupid like i was, i’m lucky it wasn’t more serious for me than it was.",
          "created_utc": 1748734738.0
        },
        {
          "id": "mvcir3t",
          "author": "daisy_s21",
          "body": "It is so, so scary to look down and see the toilet/sink full of blood. Please, next time, if this happens again please go to the ER. I know it is so scary, I didn’t want to go initially, I was scared out of my mind and didn’t want to go in case they told me it was something even worse (cancer, liver rupture, etc) but my partner convinced me. is so serious, please do not ignore it if it happens again. It is so scary. I am SO glad you ended up okay but please please do not hesitate to see a doctor if it happens again <3",
          "created_utc": 1748743629.0
        },
        {
          "id": "mvck5r4",
          "author": "withextracheesepls",
          "body": "definitely. i pray it never happens again, and i’ve been doing so much better with purging, but have been having issues with involuntary vomiting which can cause it too so i’m still scared… it’s such a terrifying possibility that’s too too real",
          "created_utc": 1748744168.0
        },
        {
          "id": "mvcl5tp",
          "author": "daisy_s21",
          "body": "I absolutely understand the struggle with involuntary vomiting. It gets to a point where you do it so much, your body just…is used to it? And does it regardless. And it is scary. Because as much as you consciously want to stop, your body still does it. It’s hard. I sincerely am sending you all the love and good thoughts in your recovery because I truly understand where you are with that. Much, much love. Hoping the absolute best for you.",
          "created_utc": 1748744553.0
        }
      ]
    },
    {
      "id": "mvpjxa9",
      "author": "daisy_s21",
      "body": "Esophagus issues are really not a good time by any means. Wishing you the best as well. <3",
      "created_utc": 1748921396.0,
      "score": 1,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        },
        {
          "id": "mva8er9",
          "author": "daisy_s21",
          "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
          "created_utc": 1748715468.0
        },
        {
          "id": "mvekr0s",
          "author": "Eddie_1027",
          "body": "I’m so sorry you went through this. This sounds like you need more than your own willpower to get through it, though. Have you considered reaching out to medical professionals? I’d really urge you to consider it. Please take care of yourself and you’re in my prayers 🙏",
          "created_utc": 1748781096.0
        },
        {
          "id": "mvjmso6",
          "author": "daisy_s21",
          "body": "You are so kind, thank you. I have multiple follow up appointments scheduled and going back to outpatient therapy. Considering inpatient. Luckily my boss has been very understanding and I am fortunate to have PTO built up to take time off to recover as my job is pretty physically demanding. Its so easy to convince yourself it isn’t as serious as it is until the unthinkable happens :(",
          "created_utc": 1748844694.0
        },
        {
          "id": "mvjsl4t",
          "author": "Eddie_1027",
          "body": "I’m glad to hear that! It sounds like you know exactly what to do. I’m wishing you all the best in your recovery. I’m currently dealing with some esophagus issues as well and it is NOT fun.",
          "created_utc": 1748847997.0
        }
      ]
    },
    {
      "id": "mvpjxrk",
      "author": "daisy_s21",
      "body": "Esophagus issues are really not a good time by any means. Wishing you the best as well. <3",
      "created_utc": 1748921402.0,
      "score": 1,
      "context": [
        {
          "id": "mva7pga",
          "author": "StockReporter5",
          "body": "oh my fucking god that’s terrifying. what did they do in the hospital to fix it? how are u feeling now?",
          "created_utc": 1748715246.0
        },
        {
          "id": "mva8er9",
          "author": "daisy_s21",
          "body": "It really was, I don’t think I’ve ever been so scared in my life. It’s one of those things where therapists and doctors tell you it can happen, but you don’t think it’ll ever actually happen to you. They did EKGs, X-rays, Ultrasounds, IVs, 2 endoscopy’s, plenty of meds meant to anti-acid the stomach lining. They said if the tear had been even the SLIGHTEST bit bigger they would have had to put metal pins in my esophagus to keep it closed, which terrified me even more. I’m feeling okay now, and I am really motivated to stop purging due to this experience, but I’m just worried that my stupid brain will overpower that and urge to purge again. But I really don’t want to after all of this. I’m going to do my absolute best to stay strong and not get triggered.",
          "created_utc": 1748715468.0
        },
        {
          "id": "mvekr0s",
          "author": "Eddie_1027",
          "body": "I’m so sorry you went through this. This sounds like you need more than your own willpower to get through it, though. Have you considered reaching out to medical professionals? I’d really urge you to consider it. Please take care of yourself and you’re in my prayers 🙏",
          "created_utc": 1748781096.0
        },
        {
          "id": "mvjmso6",
          "author": "daisy_s21",
          "body": "You are so kind, thank you. I have multiple follow up appointments scheduled and going back to outpatient therapy. Considering inpatient. Luckily my boss has been very understanding and I am fortunate to have PTO built up to take time off to recover as my job is pretty physically demanding. Its so easy to convince yourself it isn’t as serious as it is until the unthinkable happens :(",
          "created_utc": 1748844694.0
        },
        {
          "id": "mvjsl4t",
          "author": "Eddie_1027",
          "body": "I’m glad to hear that! It sounds like you know exactly what to do. I’m wishing you all the best in your recovery. I’m currently dealing with some esophagus issues as well and it is NOT fun.",
          "created_utc": 1748847997.0
        }
      ]
    },
    {
      "id": "mvicjm3",
      "author": "Murky-Jellyfish7619",
      "body": "Thanks ❤️our kind gotta look out for one another perfect or not",
      "created_utc": 1748824645.0,
      "score": 3,
      "context": [
        {
          "id": "mvarqfc",
          "author": "Murky-Jellyfish7619",
          "body": "I know how hard it is to stop and I know the feeling of helplessness. I am glad you are ok, \nBut to put it in perspective would the pins, has a made you stop? \nI believe in you",
          "created_utc": 1748721624.0
        },
        {
          "id": "mvat6ag",
          "author": "daisy_s21",
          "body": "Thank you. I can honestly say, after 12 years and two treatment centers, being removed from school for inpatient, etc, this has actually been the biggest wake up call. I think this is the slap in the face that, unfortunately, I had to experience to finally understand and truly realize the importance of stopping.",
          "created_utc": 1748722084.0
        },
        {
          "id": "mvateq5",
          "author": "daisy_s21",
          "body": "It won’t be easy, I know that, but this has truly made me actually want to try. I even had a tooth fall out last year due to purging and still didn’t realize the reality of the consequences until this.",
          "created_utc": 1748722160.0
        },
        {
          "id": "mvb6b9w",
          "author": "Murky-Jellyfish7619",
          "body": "I’m have nightmares about losing teeth. My teeth are wearing down. Just remember you are a whole ass person and should be loved and valued for who you actually are. You have so much more ti offer. Fuck this disease",
          "created_utc": 1748726149.0
        },
        {
          "id": "mvcgvz2",
          "author": "daisy_s21",
          "body": "Thank you so much for your lovely words. Losing a tooth was scary af and I do not want it to happen again. I’m finally realizing the physical consequences of this disease and it’s been a kick in the ass to do my best to stop. Sending you the most positive vibes I can <3",
          "created_utc": 1748742930.0
        }
      ]
    }
  ]
}