{
  "id": "1l0ikd6",
  "subreddit": "bulimia",
  "author": "Intelligent-Tax-8401",
  "created_utc": 1748760728.0,
  "title": "The truth about bulimia",
  "selftext": "In the media, they show young, thin — often white — girls bent over a toilet, mascara smeared, ribs protruding, faces twisted in sadness. That’s their version of bulimia. A cautionary tale. A broken girl who just wants to be pretty. They assume it’s about vanity. About fitting into a dress. About being thin for the sake of being thin. They reduce it to a phase or a shallow obsession.\n\nThey think the fix is simple. Therapy. Food management. \"Just eat healthy.\" \"Just love yourself.\" Like it’s that easy. Like a mantra or a meal plan can reach down into the darkness and pull you out. Some people are even disgusted. “Why would you *make* yourself throw up? That’s gross. That’s a waste. That’s *weak.*” Or worse, they offer pity disguised as hierarchy — “Well, at least you’re not *anorexic.* You still look... normal.”\n\nBut what they don’t see is the real disease. The one that hides in silence. The one that lives behind locked doors and under the bed. They don’t see the self-loathing that hangs over you like a fog. They don’t see the bruised knuckles, raw throat, cracked lips. They don’t know about the jars, the bags, the bowls filled with vomit hidden behind the shoes in your closet, behind the stacks of books under your bed. The frantic panic of needing to *get it out.* Not because of weight — not always — but because it feels *wrong* to keep it in. Because the body feels foreign, bloated with shame. And you know the ritual. You know the release.\n\nThey don’t see the moments leading up to it — the compulsion to eat, not even to taste, but to *numb.* To feel nothing. To fill the void, only to punish yourself for daring to do so. To cry on a bathroom floor not because you’re sad, but because the act has become the only form of control you still own. The only comfort left.\n\nAnd they definitely don’t see the way you function. The way you wear the mask so well. You’re “fine.” You’re “normal.” You’re smiling, productive, funny. You know how to be what they expect. “You’re one of the happiest people I’ve ever met,” a client told me once as I rang up his groceries. I smiled back, the lie automatic. “I try to stay positive.” But he didn’t see the night before, when I was on the floor of my bedroom, trying to save my carpet from the bucket of vomit that I accidentally spilled on it. He didn’t see the war I fight every day just to seem okay.\n\nWhat did I do to deserve this?  \nThat question loops in my mind. Over and over.  \nWhat did I *do* to make my own body feel like an enemy?  \nWhat did I *do* to lose the ability to eat a meal without guilt?  \nWhat did I *do* to feel so empty that pain became a ritual?\n\nBut maybe it's not about what I did.  \nMaybe it’s about what I carry.  \nThe expectations. The pressure. The silence. The need to be perfect. The fear of being *seen.*  \nMaybe it’s about a world that praises thinness but shames the methods people take to get there. That glamorizes discipline but demonizes disorder.\n\nAnd maybe... just maybe... someone reading this will see past the stereotype. Will understand that bulimia isn’t just about throwing up food — it’s about throwing up pain. It’s not about looking a certain way — it’s about surviving in a way that makes sense to the chaos in your mind.\n\nWe are not disgusting. We are not weak.  \nWe are hurting. We are hiding.  \nAnd we are desperately trying to find a way out.",
  "url": "https://www.reddit.com/r/bulimia/comments/1l0ikd6/the_truth_about_bulimia/",
  "score": 231,
  "num_comments": 13,
  "comments": [
    {
      "id": "mvetswc",
      "author": "buttonlessbutton",
      "body": "They also show the purging in a weirdly romantized way ,  quick , no mess, open hair and just some tears. No snot and puke running down your face. They make it seem quick and easy and bingeing is pretty much never shown and the whole thing is always made into strange romantized thing thats made to seem kinda \"tragically beautifull\".  \nThey never show the reality of bulimia because its ugly and filthy and cant be made into something pretty . Reality isnt nice to look at.",
      "created_utc": 1748784540.0,
      "score": 64,
      "context": []
    },
    {
      "id": "mvezyca",
      "author": "Ach00_G",
      "body": "Yes to all of this… my previous boss told me when I resigned (because of Bulimia and other mental struggles) “you do a great job of masking whatever is going on!” And I still wonder if that is a compliment.",
      "created_utc": 1748786657.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mvetdz1",
      "author": "Margaet_moon",
      "body": "I hope this was therapeutic to write, I felt ever ounce of pain you described so perfectly. Sending you so much love. We don’t deserve this.",
      "created_utc": 1748784389.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mvfhypp",
      "author": "Key_Significance_179",
      "body": "in a way, this is really poetic. each sentence i read reminded me of past experiences. bulimia really is watered down in the media and even in some medical spaces. oddly enough, although dark, this post was really refreshing to read. it's nice to see somebody talk about the truth behind this disease. it's not all thin white girls puking after dinner; it's an addiction; a life destroying addiction :( sending hugs and support, internet stranger🫂💕",
      "created_utc": 1748792117.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mvejdqd",
      "author": "canteventhinkabout",
      "body": "I cried after reading the last partt 😭 it's been pretty rough for me lately and I relate to a lot of these words. Thank you for this post",
      "created_utc": 1748780527.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mvhpsp7",
      "author": "genuinelytrapped",
      "body": "i usually can’t explain what’s wrong with me when asked, i can’t get out how i feel because i think words arenot enough to express how this feels like hell because i can’t “justify” my bulimia, i don’t have a reason why, im not fat, im not thin i have a normal weight, a normal and happy life and a normal and able body that i like; its something that goes beyond my appearance (as it does nothing for it lol) but its still super connected to it. It’s very hard to explain how it feels to live like this and you did an amazing job, i felt seen reading this. Thank you 💓",
      "created_utc": 1748816572.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mvieyy5",
      "author": "Ambitious_Air_6737",
      "body": "This hit home for me it’s good to know we’re not alone.",
      "created_utc": 1748825555.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mviufv6",
      "author": "Apathetic_Bourbon",
      "body": "🫂",
      "created_utc": 1748831432.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvklzxq",
      "author": "maya0145",
      "body": "Wow this really hit me i can relate to every single word you said. I hope my Family will realise one day that this is not all about being thin. I wish everyone the best for the future and seek help for your addiction. I always thought i had to get through everything alone because all my life it had been like this, but tomorrow i will go to a mental hospital and hopefully will get through this. This disprder really destroyed me, my body and also relationships with friends and family. I wish everyone the best and if you need to talk to someone who can relate feel free to text me🙏",
      "created_utc": 1748864543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvwsugv",
      "author": "Charlieisme89",
      "body": "I love Reddit posts that read like a poem",
      "created_utc": 1749020326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz9trnq",
      "author": "GeroFaust",
      "body": "The romanticizing of e.ds is straight up horrific",
      "created_utc": 1750651182.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvigc2t",
      "author": "Temporary-Wrap-6694",
      "body": "They never show how distorted the body looks before purging. The girls they show go to purge with a flat stomach, not a distended 6-months-pregnant one. Sometimes my stomach gets distended so much, I can barely walk straight, because it's too damn painful.",
      "created_utc": 1748826065.0,
      "score": 27,
      "context": [
        {
          "id": "mvetswc",
          "author": "buttonlessbutton",
          "body": "They also show the purging in a weirdly romantized way ,  quick , no mess, open hair and just some tears. No snot and puke running down your face. They make it seem quick and easy and bingeing is pretty much never shown and the whole thing is always made into strange romantized thing thats made to seem kinda \"tragically beautifull\".  \nThey never show the reality of bulimia because its ugly and filthy and cant be made into something pretty . Reality isnt nice to look at.",
          "created_utc": 1748784540.0
        }
      ]
    },
    {
      "id": "mvqd975",
      "author": "Single_Ad_4915",
      "body": "And then when I don't purge, I'm not actually able to keep food down and have thrown up on myself multiple times. It's so not \"cutesy.\" My room very often smells like straight vomit because I can't keep things down and throw up constantly throughout the day into a cup. It's disgusting and embarrassing. ",
      "created_utc": 1748936143.0,
      "score": 4,
      "context": [
        {
          "id": "mvetswc",
          "author": "buttonlessbutton",
          "body": "They also show the purging in a weirdly romantized way ,  quick , no mess, open hair and just some tears. No snot and puke running down your face. They make it seem quick and easy and bingeing is pretty much never shown and the whole thing is always made into strange romantized thing thats made to seem kinda \"tragically beautifull\".  \nThey never show the reality of bulimia because its ugly and filthy and cant be made into something pretty . Reality isnt nice to look at.",
          "created_utc": 1748784540.0
        }
      ]
    }
  ]
}