{
  "id": "1l21tr6",
  "subreddit": "bulimia",
  "author": "dosginf",
  "created_utc": 1748921218.0,
  "title": "Skinny privilege is not what you think it is for bulimia.",
  "selftext": "We all know skinny privilege is so large in EDs. \n\nI’m staying at an all inclusive and I really wanted to binge, but I already had dinner earlier. I was thinking about how the waitress would make fun of me for eating twice. Then I realized im no longer that obese girl. I’m a mid size, 6/8, but I’m quite tall. She’s not gonna think what a pig she’s eating again. She’ll probably not think anything at all. But if she did, she’d probably just think I got hungry again. \n\nSame with buying binge food. Whenever I get self conscious about buying binge food, I remember that I’m in a socially acceptable body and that unlike when I was obese, they won’t think I’m a disgusting fat pig. They’ll think I’m just having a cheat day, or going to a party or whatever. They’ll never assume that I’m actually consuming so much food because I’m mid size. ",
  "url": "https://www.reddit.com/r/bulimia/comments/1l21tr6/skinny_privilege_is_not_what_you_think_it_is_for/",
  "score": 178,
  "num_comments": 13,
  "comments": [
    {
      "id": "mvpmjjc",
      "author": "einhornschlag",
      "body": "As someone that has worked in hospitality for FAR too many years, I promise that service folks won’t think of you like that. \n\nI ran a gourmet ice cream place for a few years and sometimes people would get a scoop, love it, and come back in and get a few pints to take home. That always made me happy! I never judged anyone for enjoying their treats how they see fit (:\n\nI find myself getting into my own head like this a lot but remind myself like… it’s me making this shit up in my head to punish myself. Know what I mean?",
      "created_utc": 1748922494.0,
      "score": 67,
      "context": []
    },
    {
      "id": "mvpum1l",
      "author": "Eastern_Yam_5975",
      "body": "Up to this day I still wonder what the folks at my local grocery store thought of me going in 3x a day for just ice cream, biscuits and pizza.\n\nI’m not bulimic anymore (thankfully) but I was borderline underweight the whole time I was. I wonder if they realized I was consuming all of it myself.",
      "created_utc": 1748926099.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mvqbd7f",
      "author": "marshmallo_floof",
      "body": "It depends on how skinny you are though. Granted, I've been underweight my entire life so I can't say I've experience the stigma of buying binge food at a higher weight but I've still definitely gotten weird stares and rude remarks from cashiers while buying binge food since it's not everyday you see someone at a BMI of >!13!< hauling enough food for a family for 5 days in a row at 10pm",
      "created_utc": 1748935011.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mvsvcr8",
      "author": "ratcrispytreat",
      "body": "I have always been so anxious about buying binge food and what grocery store associates must think, but I have seen what other people buy at self-checkout, and although I’m still anxious about it, I don’t care as much anymore. I did it when I was underweight, now I’m a normal weight and I just look like… some guy. No one has ever commented on what I’m buying other than really normal things to say anyways. Like man least im not shoplifting who gaf I’m buying frosting and chips and snacks and ice cream i’m not having fun 🤷🏻‍♂️🤷🏻‍♂️",
      "created_utc": 1748970308.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mvsxqzx",
      "author": "pipedreamweed",
      "body": "This is something I'm worried will happen if I continue gaining weight and surpass my heaviest weigh in again. I've rapidly put on over a stone since my lightest weight, when the binges started again back then I didn't care about what people thought of me when I ate abnormally large meals, went for seconds and thirds, or bought binge food. They wouldn't assume that I was eating like that all the time or that I had a problem with food. Heck maybe even some people thought I just had a fast metabolism and was lucky, and didn't see the disordered patterns. But as I get heavier I realise that people's perception of me doing these things might change, and that brings about so much more shame with this disorder :(",
      "created_utc": 1748970962.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mwgbcqe",
      "author": "throupandaway",
      "body": "Amy winehouse…",
      "created_utc": 1749279864.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwgbljz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1749280010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvqklzz",
      "author": "Fair_Package8612",
      "body": "I think it largely depends on which country you’re in. In the US, I’m not self conscious about it… But for example in Asian countries (such as where I am now), I almost always get a comment or straight confusion if I ask for more than a normal sized portion in one sitting. It’s probably more like they’re shocked I can eat so much since I’m so skinny and/or are just double checking that I’m communicating what I want properly, but it still makes me constantly second guess myself in the moment.",
      "created_utc": 1748940579.0,
      "score": 21,
      "context": [
        {
          "id": "mvpmjjc",
          "author": "einhornschlag",
          "body": "As someone that has worked in hospitality for FAR too many years, I promise that service folks won’t think of you like that. \n\nI ran a gourmet ice cream place for a few years and sometimes people would get a scoop, love it, and come back in and get a few pints to take home. That always made me happy! I never judged anyone for enjoying their treats how they see fit (:\n\nI find myself getting into my own head like this a lot but remind myself like… it’s me making this shit up in my head to punish myself. Know what I mean?",
          "created_utc": 1748922494.0
        }
      ]
    },
    {
      "id": "mvqbudb",
      "author": "dosginf",
      "body": "Yeah definitely I wanted to add that actually where because I’m a “average” size I don’t get the stigma that underweight or severely overweight people do. I feel like when people see very underweight people buy only junk food they think they’re underweight because all they eat is junk, just the same as overweight people. There is a blessing in mediocrity.",
      "created_utc": 1748935291.0,
      "score": 7,
      "context": [
        {
          "id": "mvqbd7f",
          "author": "marshmallo_floof",
          "body": "It depends on how skinny you are though. Granted, I've been underweight my entire life so I can't say I've experience the stigma of buying binge food at a higher weight but I've still definitely gotten weird stares and rude remarks from cashiers while buying binge food since it's not everyday you see someone at a BMI of >!13!< hauling enough food for a family for 5 days in a row at 10pm",
          "created_utc": 1748935011.0
        }
      ]
    },
    {
      "id": "mwgbn3z",
      "author": "throupandaway",
      "body": "Gets banned because my eating disorder is different than someone larger and their insecurity with their body is my problem because I mentioned sizes",
      "created_utc": 1749280036.0,
      "score": 1,
      "context": [
        {
          "id": "mwgbljz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1749280010.0
        }
      ]
    },
    {
      "id": "mwgbub7",
      "author": "throupandaway",
      "body": "I think I’m living in crazy town because I’m a size 2 typically and a size 6-8 unless you’re tall is sort of big. And I hear people here saying bmi 13 and at bmi 18.5 I was looking crackhead",
      "created_utc": 1749280153.0,
      "score": 1,
      "context": [
        {
          "id": "mwgbljz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1749280010.0
        }
      ]
    },
    {
      "id": "mwgbolu",
      "author": "throupandaway",
      "body": "then I don’t get banned because this is an inclusive space but it isn’t but it is dice roll what is it now?",
      "created_utc": 1749280061.0,
      "score": 1,
      "context": [
        {
          "id": "mwgbljz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1749280010.0
        },
        {
          "id": "mwgbn3z",
          "author": "throupandaway",
          "body": "Gets banned because my eating disorder is different than someone larger and their insecurity with their body is my problem because I mentioned sizes",
          "created_utc": 1749280036.0
        }
      ]
    }
  ]
}