{
  "id": "1lwpzgd",
  "subreddit": "bulimia",
  "author": "Narrow_Road_890",
  "created_utc": 1752185873.0,
  "title": "Not purging after a binge is ROUGH",
  "selftext": "Like..I know I could just purge and make myself feel \"better\", but I know stopping the throwing up is big for me😭\n\nIt makes binging seem \"Acceptable\" so if I can't purge..then what's the point of binging!\n\nEven then, I'm sweaty and shrimp posed, my stomche is so uncomfortably full it hurts. This SUCKS.\n\nUgh😣",
  "url": "https://www.reddit.com/r/bulimia/comments/1lwpzgd/not_purging_after_a_binge_is_rough/",
  "score": 64,
  "num_comments": 5,
  "comments": [
    {
      "id": "n2gtfiu",
      "author": "ElvenFinn",
      "body": "I’m in the same boat now babes. I’m not binging heavily but still I can’t seem to wait for my ” breakfast ” until the morning so even though I eat well over 2k calories everyday I still eat just about 1200 calories more as my 10pm breakfast before the actual breakfast next day lol. But it’s better than binging and throwing more life away 🙃",
      "created_utc": 1752195031.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n2gtg4n",
      "author": "medium_problems",
      "body": "I’ve been experiencing this too😭😭it’s AWFUL and yet I know i HAVE to be willing to go thru it so I can stop the binge/purge cycle. Best of luck to you my friend. We can do this!! ",
      "created_utc": 1752195037.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n2gu1zd",
      "author": "mercedeswooten",
      "body": "I’m going through the same thing right now. I try to talk myself out of it by telling myself I’ll lose my teeth if I keep going. But then like you said the purging makes me feel better and it’s a never ending cycle. I have hope for all of us though that we will find peace one day!",
      "created_utc": 1752195246.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2md973",
      "author": "internerderner2",
      "body": "Time for an unethical life pro tip!\n\nThe other day I took my anxiety and sleep medications. Then I binged right afterwards (it wasn't planned). Then I went to bed without purging. I know I didn't purge because I don't remember purging and because I woke up all bloated and with the taste of the food still in my mouth. But somehow it wasn't a problem. I vaguely remember eating the food and then just going to sleep and not caring. It was so weird. I may or may not be recommending this to people.",
      "created_utc": 1752268521.0,
      "score": 3,
      "context": []
    }
  ]
}