{
  "id": "1lxosdr",
  "subreddit": "bulimia",
  "author": "Willing-Ad2342",
  "created_utc": 1752285567.0,
  "title": "For those who want to stop - here are a few tips as someone who has been binge-purge free for over 2 months:",
  "selftext": "1. You've got to stop purging entirely.\n\nNo weaning, none of that. Because the truth is, each time you purge, you are conditioning your brain to seek dopamine from that behavior, and so the urges will just continue to come, and you will be miserable the entire time because it will feel like restriction but 10x worse. Also, it just perpetuates the cycle. And purging is extremely dangerous, and over time, ineffective for weight loss.\n\n\\*Now, I am one of those people who lost weight while purging. But over time, you will stop losing weight. This isn't because you can't get everything out. It's because you destroy your body's metabolism by not taking in any nutrition. You lose all your muscle mass, which drives the speed of your metabolism. By losing it, you basically tank everything. On top of that, your organs shrink, and your bone mass and even brain mass shrinks. You aren't JUST losing fat, and the same goes with anorexic levels of restriction. Just stop that dumb behavior altogether. Being \"skinny\" is not worth that price. Osteoporosis is irreversible. And the reason you either maintain or gain weight is because frankly, most people aren't effective at purging. This is a good thing, because purging is absolutely TERRIBLE for you. The brain stimulates the gag reflex when it feels it's been POISONED, so it's basically a last-resort survival mechanism. It's just not natural to be purging daily, weekly, or even monthly. Can you think of the last time you threw up uncontrollably? Yeah, me neither.\n\n2. You need to eat more.\n\nI understand many of you are here because you want to lose weight, or want to maintain a slim weight. It's okay. There's no shame in that. But hear me out; eating more (TDEE OR MORE) reduces your binge urges, which reduces the chances of you purging again. It also rewires your brain, so overtime you actually lose the desire to be sickly thin. Because you'll start seeing things more rationally, because food is fuel! When you're underfed, your brain starts to \"cope\" by making you perceive your own body or even other's (normal sized) bodies as fat. This will stop if you eat well. Literally, the solution is to eat well enough. It's going to be fucking hard at first. The bloating will feel like it will never stop. But the sooner you stop purging and start digesting food, the faster the adjustment period will go. \n\n3. Recognize that the weight you gain from keeping down food is NOT FAT.\n\nSome of this weight is rehydration, as purging is incredibly dehydrating. **And that weight won't go away.** So learn to expect it, and cope with that. Any extra weight gained will be edema due to the body wanting to hold onto extra water because it has gotten used to you abusing it, and is releasing a hormone which causes the retention (people who menstruate also experience this during ovulation and right before bleeding!!) to keep you somewhat hydrated. The general consensus is that as long as you've been purging, is as long as that edema will stay. But in my personal case, I found that the extra edema dropped off pretty quick as I kept myself hydrated and watched my sodium intake (at first, I don't believe in restricting food groups but I recognize bloating from sodium can feel incredibly distressing as it can look like weight gain, it's not.)\n\n4. Develop coping mechanisms that utilize your hands.\n\nThis is a little weird one, but it helped me tremendously. Each time I had an urge to binge/purge, I would resort to doing my nails. It is stimulating and it felt similar to binging in a way, because I was moving my arms often.\n\nSome other ideas, if you can't think of any on the top of your head:\n\n\\- reading a paperback book\n\n\\- crochet\n\n\\- drawing\n\n\\- cleaning \n\n\\- video games\n\n(I really suggest something that doesn't need the internet to do/isn't just doom-scrolling or looking at social media, because that's a whole other can of worms regarding dopamine and addiction. It's also more rewarding because when you engage in creative activities, you get the good kind of dopamine hits, because you're getting an output equal to your creative input - which scrolling on your phone won't do.)\n\n  \nThese are the tips I can think of on the top of my head. I may add more later, but I hope to help people who are ready to recover!\n\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1lxosdr/for_those_who_want_to_stop_here_are_a_few_tips_as/",
  "score": 77,
  "num_comments": 6,
  "comments": [
    {
      "id": "n2opav2",
      "author": "No-Action578",
      "body": "to anyone confused, \" that weight wont go away\" as in the rehydration weight gained is necessary and you need it and thats why it should NOT go away. you can lose the same amount of that weight if u want to in actual fat or edema thats dangerous. Not the needed water weight that dropped when ur electrolytes were in literal danger because of heart health.",
      "created_utc": 1752300738.0,
      "score": 10,
      "context": []
    },
    {
      "id": "n2tpakz",
      "author": "None",
      "body": "Thank you for putting this together, I appreciate you and found it helpful during a weak ish moment!!",
      "created_utc": 1752369733.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n2o9vhs",
      "author": "Luckypenny4683",
      "body": "Seconding all of this!",
      "created_utc": 1752293214.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n35i57i",
      "author": "Either_Sea628",
      "body": "Thank you for this advice. I know it will be helpful for some.\n\nHowever, from my experience, eating more doesn’t stop my binges. Even if I eat just slightly below my TDEE ( my TDEE is 2000-2100 and I aim for 1700/1800) I still get cravings and urges to binge. So I have no choice but to restrict even further to avoid weight gain.",
      "created_utc": 1752529326.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3a72a1",
      "author": "Junksonder",
      "body": "thank you!",
      "created_utc": 1752595536.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3kx31k",
      "author": "Atthatgirlsummer",
      "body": "Thank you for this, this is my second time trying to recover from bulimia, in January I tried but as soon as my weight hit a certain number I kinda freaked out and went back to binging and purging, this time around I think bulimia has taken a bad toll on my health even more and maybe I’ve gained some maturity and extra knowledge on this disorder, so I’m gonna try to stop, again thank u",
      "created_utc": 1752730396.0,
      "score": 1,
      "context": []
    }
  ]
}