{
  "id": "1lzb7yj",
  "subreddit": "bulimia",
  "author": "Comfortable_Life_437",
  "created_utc": 1752461198.0,
  "title": "Dose anyone else do this more as a fucked up hobby than anything",
  "selftext": "Like like in my younger years it was more about weight loss and control but now it's just because eating food feels good and I guess habits are hard to break and the purging is just so I don't gain weight like I don't do it for control I do it because watching YouTube which is probably what I would have done anyway while eating is more enjoyable does anyone else feel like this ",
  "url": "https://www.reddit.com/r/bulimia/comments/1lzb7yj/dose_anyone_else_do_this_more_as_a_fucked_up/",
  "score": 109,
  "num_comments": 10,
  "comments": [
    {
      "id": "n30fgmw",
      "author": "RedBullWack",
      "body": "i feel the exact same way, i feel like i have a food addiction and i purge just so i dont gain, but i dont necessarily care for losing. like yes i dont like my body atm, but its not a dying need like when i first had my ed and was sobbing every time i looked in the mirror\n\nbut yeah, having an ed for a long time is weird cause the reasoning is different than when it first developed",
      "created_utc": 1752461734.0,
      "score": 44,
      "context": []
    },
    {
      "id": "n30km0x",
      "author": "AlaskanGrower101",
      "body": "I’d say addiction rather than hobby. I have an insanely addictive personality. I don’t think I have a single hobby. I do have a long list of addictions tho.",
      "created_utc": 1752463823.0,
      "score": 30,
      "context": []
    },
    {
      "id": "n30fac5",
      "author": "rescuecatmomlover",
      "body": "yeah...I feel like after a while I didn't care as much about losing weight, I just wanted to eat a lot of good food b/c I love eating...but I didn't want to gain weight.  I mean, who doesn't like to eat good food? Unfortunately the purging is not sustainable and gets out of control real fast.",
      "created_utc": 1752461665.0,
      "score": 25,
      "context": []
    },
    {
      "id": "n3cbn1k",
      "author": "kitastrofee",
      "body": "This hits hard!!!!\n\nAnd I’ve often felt this. Like is this a problem I’m causing for myself to stop me being a real person? Am I doing this because I want a problem. A reason to be like this? \nBut then I want to stop so badly and I just can’t. \n\nI’ve had it for so long I legit do not remember what it’s like to not be like this.\n\nBut it’s taken everything including my ability to walk. So I’m determined I’m going to beat this. Or even just better than I am.",
      "created_utc": 1752616999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3ksley",
      "author": "GeroFaust",
      "body": "Yeah I know for me it’s very little about the weight loss. Maybe a little to stave off gaining a huge amount of weight from my food addiction. But mostly the dopamine rush from purging.",
      "created_utc": 1752728219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3mn0gz",
      "author": "StrictAd5289",
      "body": "I feel like this in some way. When I started it was about weight but now it is more or less some weird compulsion or addiction.",
      "created_utc": 1752759228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n44ys91",
      "author": "Secure_Medicine_3892",
      "body": "I'm 41 and been at this for 20 years. Definitely has become a horrific habit I look forward to....I look forward to being home alone so I can binge and purge without having to sneak around. ",
      "created_utc": 1753002327.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4dy0a3",
      "author": "edelricsautomail",
      "body": "Addiction definitely, a weird adrenaline junky kind of hobby. I definitely feel excited and happy after successfully purging, and lately I've been falling into major restriction...now my therapist is starting all over again and I don't even know what ED I have anymore. \n\nOverall, I feel happy and excited about it. Watching numbers go down in the scale is what I enjoy. I need reminders that my body is literally not functioning properly at the moment. It's so hard right now. \n\nMy heart goes out to everyone who's going through this right now.",
      "created_utc": 1753122881.0,
      "score": 1,
      "context": []
    }
  ]
}