{
  "id": "1m04fd0",
  "subreddit": "bulimia",
  "author": "Sweaterweatherwaste",
  "created_utc": 1752541984.0,
  "title": "How tf do other ppl not eat 24/7",
  "selftext": "If I ever want a life I have to suck it up and only eat at meal and snack times. But I just want to eat all the time. After food, I just whats the point in keeping it down (and gaining weight) if it means I can't eat more and throw it up after. Like I know I'll want to eat more even if I keep it down, I ALWAYS want to eat more. I can't turn it off. Its ruining everything in my life. Would glp 1 help? Idk what to do, if I can't change life isn't worth living, but every day I give up. My system is so broken, I don't even have the 'stop drinking' signal so when not bping I end up drinking over a litre in 30 mins. I panic whenever I'm not eating. I'm so scared I'll grow old with this. I'm spending money I don't have. I feel like a lost cause. Idek why I'm posting this I'm just so frustrated with myself.\n",
  "url": "https://www.reddit.com/r/bulimia/comments/1m04fd0/how_tf_do_other_ppl_not_eat_247/",
  "score": 102,
  "num_comments": 7,
  "comments": [
    {
      "id": "n37dpgq",
      "author": "Able_Tumbleweed_3424",
      "body": "I always felt the same. It was like relief to just accept that I wasn't going to stop eating so might as well manage it the way I knew how-vomiting it up. I hate to say it but the only way I got to manage it was not buying food. I eat right before I go to the grocery store, only buy food for the next couple days, no snack food, not easy to eat desserts, mostly things that I'd have to prepare (either by mixing stuff together or having it cook in the oven) and then not go back. Anytime I started craving something or desperately wanting food, and I'd get ready to leave to get it, I'd think about the money and then fight against myself and not go buy it. It sucks, and I'll never have a \"healthy\" relationship with food, but I got used to my new normal.",
      "created_utc": 1752552849.0,
      "score": 25,
      "context": []
    },
    {
      "id": "n37zzm4",
      "author": "Upper-Reply-4681",
      "body": "i used to have that problem pretty bad, and my dad would comment on how i’m always eating. then i switched to chewing on other things like pencils, myself, or sticks and it kinda helps. also helps that there’s no food in my house lmao",
      "created_utc": 1752564134.0,
      "score": 16,
      "context": []
    },
    {
      "id": "n388dm3",
      "author": "Human_Membership3839",
      "body": "I don't know your situation but if you have been binging and purging for a long time, sometimes your stomach can physically expand from the binges and you only feel satiated with larger amounts of food.  This happened to me, it eventually got better in recovery bc my stomach got used to 'normal' portions of food and keeping that down, but during those first 2 weeks it was such a struggle to not let mealtimes turn into binge sessions because I didn't feel satiated",
      "created_utc": 1752569060.0,
      "score": 17,
      "context": []
    },
    {
      "id": "n3ah4bq",
      "author": "dissess",
      "body": "Low cal high volume foods.",
      "created_utc": 1752598307.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3ma9m1",
      "author": "Time-Information-657",
      "body": "I'm thinking the exact same thing. Like how do normal people not eat all the time and not feel the urge to keep eating after they already ate? I'm sorry you're going through this, I'm also going through something similar and I am terrified of my future. I used to be excited because I thought I wouldn't be bulimic anymore but now I doubt it.",
      "created_utc": 1752755002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3tg4xh",
      "author": "lostinthought333",
      "body": "I used to feel like this all the time. For me it helped to just eat how much I wanted. I gained weight, kinda a lot of weight. Around 25 kgs. Then with time my body didn’t ask for food all the time and naturally I dropped all of those 25 kgs off. Sometimes you just need to let the body do its thing. It doesn’t ask for food 24/7 if it didn’t have a reason behind it.",
      "created_utc": 1752847030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3atfbx",
      "author": "Thr3awaybf",
      "body": "omg i thought i was the only one chewing paper 🥲",
      "created_utc": 1752601606.0,
      "score": 3,
      "context": [
        {
          "id": "n37zzm4",
          "author": "Upper-Reply-4681",
          "body": "i used to have that problem pretty bad, and my dad would comment on how i’m always eating. then i switched to chewing on other things like pencils, myself, or sticks and it kinda helps. also helps that there’s no food in my house lmao",
          "created_utc": 1752564134.0
        }
      ]
    }
  ]
}