{
  "id": "8fqrqv",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1525000960.0,
  "title": "Bulimia is the one of the most expensive diseases out there.",
  "selftext": "How the hell did I just pay $25 for a steak just to throw it up?",
  "url": "https://www.reddit.com/r/bulimia/comments/8fqrqv/bulimia_is_the_one_of_the_most_expensive_diseases/",
  "score": 80,
  "num_comments": 8,
  "comments": [
    {
      "id": "dy5tx7x",
      "author": "MojaveMilkman",
      "body": "I feel you there. I always justify it by telling myself I only eat for the momentary satisfaction of eating, and purging is just a way to make myself feel better afterward. But still, there's that lingering thought that I'd have been better off not eating at all. :(",
      "created_utc": 1525010028.0,
      "score": 22,
      "context": []
    },
    {
      "id": "dy6p8b2",
      "author": "None",
      "body": "Oh yeah. Let me go get my 3rd dinner of the evening to purge. ",
      "created_utc": 1525043490.0,
      "score": 16,
      "context": []
    },
    {
      "id": "dy6vbwe",
      "author": "None",
      "body": "Exactly! I don't even want to imagine how much money I've LITERALLY flushed down the toilet in the 1.5 years I've had this disease. I could have easily gone on an overseas vacation or something. ",
      "created_utc": 1525050900.0,
      "score": 10,
      "context": []
    },
    {
      "id": "dy5v3xy",
      "author": "lizziecatford",
      "body": "So so true",
      "created_utc": 1525011547.0,
      "score": 6,
      "context": []
    },
    {
      "id": "dy796gz",
      "author": "bouchi25",
      "body": "Oh my God that is so true, it's really a huge problem for me too, the amount of money I spend on this is crazy and for me it's been 10 years since I had bulimia l. but recently I have hit a new low I binge every single day I'm dealing with a lot of stress so It only makes it worst",
      "created_utc": 1525070837.0,
      "score": 6,
      "context": []
    },
    {
      "id": "dy634bs",
      "author": "Aszuna1974",
      "body": "Especially for those of us who purge by using laxatives. After a while your body builds an immunity to them so you have to take more and more to get the same result. ",
      "created_utc": 1525020648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dz4r3tb",
      "author": "orcaenthusiast",
      "body": "And it’s literally not even just the money for food. I’ve had to spend $6K alone just this year repairing my teeth. Fuck this disease.",
      "created_utc": 1526567520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dyap7u4",
      "author": "hydrangeanoway",
      "body": "put some money into a savings account that is not easily accessible to you, like a tfsa. you won't go broke and it could help you from being able to buy the binge. if it's possible,  give your credit card to someone you can trust. ",
      "created_utc": 1525219722.0,
      "score": 1,
      "context": []
    }
  ]
}