{
  "id": "9ts8q2",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1541229606.0,
  "title": "How I beat bulimia",
  "selftext": "**Disclaimer: I am not a doctor. The only advice I can give is things that worked for me.**\n\nIn this sub lately I have noticed a lot of posts looking for help and not a lot of recovery stories. So let me share mine. I recovered at age 22 after 5 years of disordered eating. (This post is catered to those with a more severe level of bulimia however I hope everyone can obtain some value from it.)\n\nThe background story is pretty standard. I was anorexic age 17-18 (probably due to the lethal combination of being obsessive, type A, and wanting to lose a few kg). I ‘recovered’ from anorexia (obtained a healthy BMI) after about a year because I was losing mental faculties and needed to do well in my final highschool exams. However, I put the weight on in a very disordered way (eating a lot because I was starving and needed to put on weight, but then purging because I didn’t want to put on *too* much weight) which rapidly phased into full-blown bulimia, lasting from age 18-22. At my lowest point I would B/P literally all day if I got the chance. After 5 years of thoroughly disordered eating I would consider myself ‘recovered’ as of about March/April this year. Recovery took about 9 months of serious work. \n\nI wanted to recover for a long time, but didn’t know how. Advice I got from scouring the internet and calling helplines simply did not help me. Distracting myself after eating was not enough. Meditation and self-care were not enough. Accepting myself for who I was and ‘loving my body’ were not enough. Meal planning was not enough. I’m sure these strategies work for some people, but they absolutely did not work for me. I, personally, was not mentally strong enough to overcome it this way. I was beyond being able to reason with myself. I was addicted to bulimia. Once I felt compelled to purge, there was absolutely no way I could stop myself from doing it. \n\nHere are my main tips:\n\n1. **Check yourself in to a ward.** One of the main things that precluded me from this was that I didn’t think I had it ‘bad enough’. I was very much mistaken. If I hadn’t let it get as bad as I did before checking in, I would have recovered much quicker and easier. I will also say that you should go to every length to do this even if it will be difficult financially. Wards can be expensive (depending on the state of your (or your country’s) health insurance) but saving your health is, by all means, priceless. I know some people have positive inpatient experiences. Personally, I hated every second I spent in the place, spent the whole time wishing I was home and left early, against medical advice. But it was my first time keeping food down in *years*. Mealtimes were structured to a militaristic degree. It was my first hint of how recovery actually works.\n\n2. **Know that if you don’t stop, you will ruin your life.** Yes, you will ruin your teeth. No one thinks it will happen to them, by the way. My dentist kept saying my teeth were fine. Once the deterioration starts, though, it is rapid, and extremely painful. You will also ruin your finances. Dental repair is seriously expensive (trust me, I would know), and food is a waste of money if you're not going to digest it. To recover, you have to really, genuinely want recovery. I know that for a long time, there was a little part of me that thought bulimia wasn't the worst thing ever. I could eat without gaining weight - brilliant! - and as long as I had a 'healthy' BMI then no one would question anything. I thought it wasn't that bad. Wrong. I assure you, it is that bad. If it’s not bad now it will be in a year from now, or 2 years, or 5. Do not delude yourself into thinking you can get away with abusing your body forever. My first few months of recovery involved rumination disorder (which is revolting), as well as GERD (heartburn) (which still flares up occasionally, though less and less frequently as time goes on). The pain of both severe heartburn and stripped enamel are utterly unbearable and I would not wish it upon my worst enemy. Also, tell your doctor you are bulimic and get some damn blood tests to make sure you are not dying. It's surprising how okay you can feel when your body is very not okay.\n\n3. **Work out what it is you want.** I don't think this is self-evident at all. Why was I purging? Because I didn't want to gain weight. There are much better methods of doing that than bulimia, though. Bulimia doesn't really help you with weight; it's mostly compensatory, and you're bloated all the time due to your sodium levels being out of whack (at least I was). For me, I knew that I would stop purging if I was eating properly, but I was scared of even trying to eat properly because I didn't want to gain weight. What I finally realised was that I was not going to gain weight from eating breakfast, lunch and dinner like a normal human being (sounds obvious, but it wasn't to me). Realising this made me think maybe I could give recovery a go.\n\n4. **Negotiate with yourself.** You won’t stop being bulimic immediately. You can’t. You must accept that from the moment you get serious about recovery, you are still going to B/P a hundred times more. That’s fine. What matters is that you are doing it *less*; that is the only thing you need to worry about. It sounds wrong, I know, but once you realise this, you won’t be so overwhelmed and you can actually start making changes.\n\n5. **Take yourself out of situations where you would normally B/P.** Bulimia is lonely. I am a natural introvert and don’t like being around people all the time. Doesn’t matter, you don’t get the luxury of being alone all the time until you can look after yourself. Hang out with people all the time. Study with friends. Make dinner for your family. Whenever your want to B/P ask a friend to get coffee with you. Get a job, or get more hours at your current job (referring to students specifically here), or take up a hobby that uses your hands (if you are wasting hours a week on maintaining an eating disorder, you have time for this). Take yourself out of situations where you engage in disordered behaviour. B/P when you're high? Stop smoking. Always purge when drunk? Drink less. You might not be able to control the compulsions once they come, but you can control which situations you put yourself in.\n\n6. **Start sleeping properly.** This is so critical. I slept horrendously for most of my life (stay up all night, sleep in til 12, nap all day, etc), but there was a major correlation with me fixing my sleeping pattern and me fixing my eating patterns. Go as slow as you need. Stage one of fixing my sleep schedule was “be in my pyjamas and bed from 12am every night”. I could be on my phone, on my laptop, whatever, I just had to be in there. Then I started having an alarm on at the exact same time every day (even weekends) - this was crucial. Then I had to be in bed by 11pm. Then my phone had to be put away on Do Not Disturb at 11pm. If you do anything long enough, *you will adjust*. Humans are very adaptive. Now I sleep 8 hours every night, 10pm - 6am every day. I wake up feeling good every day. I didn’t even know it was possible to wake up without feeling tired. It marked a profound increase in my quality of life\n\n7. **Strictly schedule your eating.** It’s a big ask, I know. But start small. B/P as much as you want as long as it is only at breakfast, lunch and dinner. This is how I started out (though I started out in a particularly bad place; choose a starting point that is appropriate for your circumstances). A lot of recovery tips are big on lots of snacking so you don't get hungry. Didn't work for me; would just make me confused as to how much I was meant to eat at the next meal and, to be frank, being hungry was not an issue since my digestive system had given up on bothering to tell me when I was hungry or full by this point. So I focused on 3 meals a day. No rules other than that. 7am, 1pm, 7pm, every single day, eat something resembling a meal. Purge it if you have to. Once you've done that for a couple months or until it becomes easy, there's a new rule: you have to have an adequate breakfast and you keep it down (lunch and dinner still don't matter as long as you have something). Eventually you will extend it to a proper breakfast and lunch, and then a proper 3 meals. Keep the scheduling militaristic.  During the latter stages of my recovery a boy asked me on a lunch date, and I suggested 12:30pm specifically because I figured once we'd had a chat and ordered, the food would probably arrive at 1pm. Your 'hungry' and 'full' signals come back eventually - slowly, and not all the time. That's when I started incorporating snacks and such, if I felt hungry between meals I would have something small. I know that sounds really obvious or whatever but it was not obvious to me at the time.\n\n7. **Remember that this isn’t your fault, but it is your responsibility.** No one wants an eating disorder. If you are holding on to guilt because you were a teenager and you really wanted to lose weight but you did it wrong and now you have ruined your life - let it go. Personally, I was young and I didn’t know any better. I starved myself and my body reacted primally by making me binge, I felt ashamed and made myself purge, and then suddenly I was trapped in a cycle over which I had no control. This is not my fault, and it is not yours either. Accept that, move on, and fix yourself.\n\n8. **Don’t check your weight.** Another big ask. But this isn’t about weight anymore. You are sick and you need to get better first. Once you’ve sorted your life out you can lose as much weight as you want. You might find, though, that once you have sorted yourself out you won’t care anymore. :)\n\n9. **Recovery sucks.** It’s really hard. It’s painfully slow. You will feel stupid that eating a bowl of yoghurt is so confusing to you. You will feel like you are going nowhere a lot of the time. But remember that going from purging 10 times a day to 8 times a day means you are recovering. I spent a fair bit of money going out to eat so I could learn portion sizes and learn to value the experience of food. I would only recommend that if it is financially viable for you, of course. Otherwise, pay attention to how much other people eat and what is 'normal'. Get other people to plate your food if you don't know how much is too much or too little (I certainly didn't). Take each day at a time. Do *not* write off the day if you mess it up early (and that *will* happen sometimes). Just start again at the next meal.\n\nHappy to answer any questions at any level of TMI in the comments/PM. Godspeed to all of you in making it out of here.",
  "url": "https://www.reddit.com/r/bulimia/comments/9ts8q2/how_i_beat_bulimia/",
  "score": 108,
  "num_comments": 9,
  "comments": [
    {
      "id": "e8yrdll",
      "author": "cassamwich",
      "body": "I’ve been in recovery about as long as you have and I must say, your advice is really sound. I hope this reaches someone and helps them out. Thank you for posting this ❤️",
      "created_utc": 1541232362.0,
      "score": 9,
      "context": []
    },
    {
      "id": "e8z0v22",
      "author": "PizzaCutter",
      "body": "Thank you so much for posting this.\n\nI'm so confused right now, but it is helpful to read your post.\n\nI'm so close to my goal of 100lbs (101lbs) but I don't even know why that's my goal. I'm in the clothing size I wanted to be in, but Im still not happy with my body.\n\nInstead of being dainty and feminine, I'm skeletal and out of proportion.\n\nI have no boobs, skeltor wrists and hands and still my thighs are so big they rub together.\n\nI look like a prepubescent boy, not a sexy, lithe woman.\n\nIt's like it's I'm a slave to some arbitrary number on the scale.\n\nI'm terrified of gaining, so even when I eat a 300 calorie meal, I have to purge.\n\nDid you set a time limit for how long you could eat each meal too?\n\nWhen the binges come, I'm thinking that might help me.\n\nI'm just a little lost now. I guess I want someone to tell me it's ok not to be 100lbs. Hell it's ok to be 110lbs.\n\nI'm 5'4. \n\nMaybe I just want someone to tell me it's ok to be whatever I am.\n\nI just want to stop obsessing about food. I want to be able to concentrate on other things, and be normal.\n\n",
      "created_utc": 1541249432.0,
      "score": 8,
      "context": []
    },
    {
      "id": "e8zy33o",
      "author": "ThatOnePotential",
      "body": "Thank you for posting this--some of the posts I see here seem to be giving advice or condoning bulimia, and its terrifying.\n\nI agree with most of what you have written--this behavior is not okay.  When you are in the middle of it, you might think, \"Well, I could have worse coping mechanisms.\"  Uh, no--that is the ED talking, the behavior is bad.\n\nThank you for being so forthright and honest; everyone suffering needs to understand the physical, mental, financial, and social ramifications of this behavior.",
      "created_utc": 1541281661.0,
      "score": 6,
      "context": []
    },
    {
      "id": "e8yw26h",
      "author": "graamatvede",
      "body": "Thank you so much. ",
      "created_utc": 1541241794.0,
      "score": 3,
      "context": []
    },
    {
      "id": "e8zzxi5",
      "author": "None",
      "body": "Thank you so much for posting this - I feel like this was exactly what I needed to see today, and I’m glad I decided to open the reddit app just now :)\n\nI’m so happy to hear that you’ve gotten to a place where you’d consider yourself recovered now.  The trajectory of your ED sounds pretty similar to mine, and a lot of your advice (especially about bulimia being lonely, the importance of getting yourself out of b/p trigger situations) is pretty spot on for me personally.  In a lot of cases for people I’ve met in treatment or online, the prognosis has been pretty grim, kind of unrealistic hopes or no hope or even wholly committed desire for recovery, so again, thank you for being so real about this, and I may not know you but I’m super glad to hear you’re doing well.",
      "created_utc": 1541283621.0,
      "score": 4,
      "context": []
    },
    {
      "id": "e9chy1b",
      "author": "biochembiscuit",
      "body": "i really needed to read this... i need to get my health together and i appreciate how honest this post was. i got chills. best of luck on your continued recovery. i am working on mine ",
      "created_utc": 1541750830.0,
      "score": 3,
      "context": []
    },
    {
      "id": "echhfxl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1545691161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1tysvq",
      "author": "None",
      "body": "Thank you",
      "created_utc": 1672138801.0,
      "score": 1,
      "context": []
    },
    {
      "id": "e8zr55s",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1541274803.0,
      "score": 5,
      "context": [
        {
          "id": "e8z0v22",
          "author": "PizzaCutter",
          "body": "Thank you so much for posting this.\n\nI'm so confused right now, but it is helpful to read your post.\n\nI'm so close to my goal of 100lbs (101lbs) but I don't even know why that's my goal. I'm in the clothing size I wanted to be in, but Im still not happy with my body.\n\nInstead of being dainty and feminine, I'm skeletal and out of proportion.\n\nI have no boobs, skeltor wrists and hands and still my thighs are so big they rub together.\n\nI look like a prepubescent boy, not a sexy, lithe woman.\n\nIt's like it's I'm a slave to some arbitrary number on the scale.\n\nI'm terrified of gaining, so even when I eat a 300 calorie meal, I have to purge.\n\nDid you set a time limit for how long you could eat each meal too?\n\nWhen the binges come, I'm thinking that might help me.\n\nI'm just a little lost now. I guess I want someone to tell me it's ok not to be 100lbs. Hell it's ok to be 110lbs.\n\nI'm 5'4. \n\nMaybe I just want someone to tell me it's ok to be whatever I am.\n\nI just want to stop obsessing about food. I want to be able to concentrate on other things, and be normal.\n\n",
          "created_utc": 1541249432.0
        }
      ]
    },
    {
      "id": "e8zz0ma",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1541282581.0,
      "score": 1,
      "context": [
        {
          "id": "e8zy33o",
          "author": "ThatOnePotential",
          "body": "Thank you for posting this--some of the posts I see here seem to be giving advice or condoning bulimia, and its terrifying.\n\nI agree with most of what you have written--this behavior is not okay.  When you are in the middle of it, you might think, \"Well, I could have worse coping mechanisms.\"  Uh, no--that is the ED talking, the behavior is bad.\n\nThank you for being so forthright and honest; everyone suffering needs to understand the physical, mental, financial, and social ramifications of this behavior.",
          "created_utc": 1541281661.0
        }
      ]
    },
    {
      "id": "e905iqv",
      "author": "PizzaCutter",
      "body": "Unfortunately I can't take any time off work for a hospital admission at the moment so I've got to do this on my own.\n\nI've got some other things going on too - doesn't everyone lol\n\nThank you for your advice though.\n\nWhen I said I wanted to be told it's ok, I meant that it's ok to be heavier than I am, that I don't have to be this thin.\n\nI'm going out for dinner tonight so my first goal will be eat a normal meal and keep it down.",
      "created_utc": 1541289532.0,
      "score": 4,
      "context": [
        {
          "id": "e8z0v22",
          "author": "PizzaCutter",
          "body": "Thank you so much for posting this.\n\nI'm so confused right now, but it is helpful to read your post.\n\nI'm so close to my goal of 100lbs (101lbs) but I don't even know why that's my goal. I'm in the clothing size I wanted to be in, but Im still not happy with my body.\n\nInstead of being dainty and feminine, I'm skeletal and out of proportion.\n\nI have no boobs, skeltor wrists and hands and still my thighs are so big they rub together.\n\nI look like a prepubescent boy, not a sexy, lithe woman.\n\nIt's like it's I'm a slave to some arbitrary number on the scale.\n\nI'm terrified of gaining, so even when I eat a 300 calorie meal, I have to purge.\n\nDid you set a time limit for how long you could eat each meal too?\n\nWhen the binges come, I'm thinking that might help me.\n\nI'm just a little lost now. I guess I want someone to tell me it's ok not to be 100lbs. Hell it's ok to be 110lbs.\n\nI'm 5'4. \n\nMaybe I just want someone to tell me it's ok to be whatever I am.\n\nI just want to stop obsessing about food. I want to be able to concentrate on other things, and be normal.\n\n",
          "created_utc": 1541249432.0
        },
        {
          "id": "e8zr55s",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1541274803.0
        }
      ]
    },
    {
      "id": "e94nb8q",
      "author": "ThatOnePotential",
      "body": "I don't have anything I deeply disagree with.  However, I am concerned about the idea that checking into inpatient is essential to getting better. Many of us do not have the resources or support or insurance to do this. I still think there is hope for recovery even if you can't afford to go inpatient.  I worry that some people might give up on getting better because they, or rather their ED, will use the excuse that they can't get into a ward.",
      "created_utc": 1541463010.0,
      "score": 1,
      "context": [
        {
          "id": "e8zy33o",
          "author": "ThatOnePotential",
          "body": "Thank you for posting this--some of the posts I see here seem to be giving advice or condoning bulimia, and its terrifying.\n\nI agree with most of what you have written--this behavior is not okay.  When you are in the middle of it, you might think, \"Well, I could have worse coping mechanisms.\"  Uh, no--that is the ED talking, the behavior is bad.\n\nThank you for being so forthright and honest; everyone suffering needs to understand the physical, mental, financial, and social ramifications of this behavior.",
          "created_utc": 1541281661.0
        },
        {
          "id": "e8zz0ma",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1541282581.0
        }
      ]
    }
  ]
}