{
  "id": "9yam4e",
  "subreddit": "bulimia",
  "author": "Laurensstardom",
  "created_utc": 1542580823.0,
  "title": "Bulimia is the loser-version of anorexia",
  "selftext": "I feel really bad about this but every time I binge and purge I look in the mirror and cry and wish I was an anorexic, because at least they have self-control. Of course, both mental illnesses suck but I hate myself for having the loser-version of Anorexia. Bulimics and anorexics both have an ilness but at least the anorexics have something to  be proud of when they lost weight, rigt? Like I said I feel really bad about thinking this way but are there any people out there who feel the same?",
  "url": "https://www.reddit.com/r/bulimia/comments/9yam4e/bulimia_is_the_loserversion_of_anorexia/",
  "score": 120,
  "num_comments": 20,
  "comments": [
    {
      "id": "ea001vs",
      "author": "None",
      "body": "I really hate it, but there are moments that I feel the same. I have periods of time (usually 2 or 3 days, sometimes longer) that I manage to not eat, but then I always lose control again. \nYou know, most of all I wish I could just eat like a normal person. Eat when I'm hungry, stop when I'm full. Exercise more to lose some weight if I feel like it. \nI've tried so hard in the last couple of weeks, but it's all black and white for me. I eat nothing or I eat everything, and most of the time it's everything. I feel proud of myself if I manage to not eat for a couple of days, because it means that I have it under control. So yeah, I know how it feels..",
      "created_utc": 1542581551.0,
      "score": 43,
      "context": []
    },
    {
      "id": "ea0lef5",
      "author": "wickedalice",
      "body": "This hits the nail on the head. Bulimia, to me, is the poser version of an eating disorder. I don't have the strength to be anorexic so I eat everything in sight and purge some of it. My weight stays the same and it feels like an endless, pointless loop. ",
      "created_utc": 1542601386.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ea02yb2",
      "author": "Brittni318",
      "body": "I feel the same way. I wish I was still anorexic. I was losing weight and not going up and down in weight like I am now",
      "created_utc": 1542584079.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ea1io0p",
      "author": "little0ranges",
      "body": "I have thought this for so long. My boyfriend was anorexic when he was younger and when I tell him I would rather have that problem than this one,  he always says \"no you dont\". I mean, ultimately, I would rather be healthy. But if I'm going to be sick either way, at least with anorexia you aren't overweight and you don't waste half your money on food. Ugh I feel so bad for feeling this way. I feel like a fat slob that learned to cheat the system and anything seems better than that. ",
      "created_utc": 1542645502.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ea1bvmp",
      "author": "None",
      "body": "I understand you completely. However. They have something to be \"proud\" of until the skin sags, cracks, and goes gray. Until they go bald and age 25 years into the future. Until they lose the ability to think, stand, sit. The self control around food is a lie. They are not in any better control than you or I. I'm a black or white cyclical person, BMI 43 by age 13 then organ failure due to losing 120lbs in one year and a gradual decline of any routine or usual disorder and I've done everything in the book. Try to remind yourself that there's positivity in being able to nourish yourself to some extent. The end game of a \"properly controlled anorexic\", is death. There is no achievement unlocked, no \"aha!\", no \"I am happy/good enough\", no stopping the war machine we all wish would fix us. I understand you completely, but it makes me sad.",
      "created_utc": 1542640045.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ea4u878",
      "author": "ThatOnePotential",
      "body": "I used to think this before I really started researching recovery. There are theories that suggest that they are not two separate, distinct disorders, but one disorder operating along a continuum. This makes sense in my experience, and I think most people with bulimia, because it starts as a diet that gets more and more restrictive, i.e. anorexia. However, we get to a point where we cannot starve anymore and start to binge, which leads to feeling of shame, which leads to purging, and the cycle continues day after day.\n\nYou might want to read the following post, which might help you understand how this could be [https://edinstitute.org/blog/2013/4/11/bulimia-yes-you-too](https://edinstitute.org/blog/2013/4/11/bulimia-yes-you-too)",
      "created_utc": 1542756754.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ea5wegw",
      "author": "graamatvede",
      "body": "Please don't beat yourself up with such horrible thoughts. You're already suffering and what you need is love, affection, self-care, good night sleep, good food, a friend, a doctor, a hug, not more mean words about the shitty condition we are already in. It is an illness. You might as well say it is winner/loser version of this and that (but whichever illness I think of, it just seems purely offensive), but there is no point comparing. Don't kick yourself in the groin, friend. Plenty of people out there who do the nasty job for us. Give yourself a hug instead.",
      "created_utc": 1542806209.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ea1g3ij",
      "author": "sh00p842",
      "body": "Yea I so feel this dude. Its like I feel terrible for thinking about it like that, but I feel like I'm a cheater. I can't resist food. It's disgusting.",
      "created_utc": 1542643392.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ea0tj4t",
      "author": "kunji1994",
      "body": "Sadly, neither is the winner :( on the flip side, anorexia can be medically more fatal and has a higher rate of moratlity than bulimia because after a certain point, your organs start shutting down...so maybe its not all bad that you have bulimia! I've yo-yoed from anorexia to bulimia over the past 8 years and i'm still fighting for recovery, you can do it too!",
      "created_utc": 1542612831.0,
      "score": 8,
      "context": []
    },
    {
      "id": "eafcni6",
      "author": "None",
      "body": "I think about this too, very often.\nI’ve been anorexic and I always ask myself when did I stop? When did I start binging? Why  me??? Like, couldn’t have I stayed a basic normal anorexic chick? Everyone would know, it would be so linear to figure out, eat, therapy, heal (which isn’t even true and I know VERRRYY WELL).\nNow I don’t know what do I have anymore, I feel like I’m slowly healing, the urges to binge come less often and I gained back an amazing social life, almost graduated uni, have a wonderful boyfriend that cares about me and wants me for who I am, but still. Still I hate myself, just like I hated my self when I was ankles deep in my ED.  What am I missing? What am I doing wrong? Am I just whiny or lazy just not able to break an empty and pointless habit?? I don’t know, I really don’t and I hope to figure it out soon 💕",
      "created_utc": 1543148489.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eaykeux",
      "author": "chomilkoe",
      "body": "I feel the same. See the problem is I was restricting type anorexic a year and a half ago, but midway through treatment I became bulimic instead. \n\nLooking back at how on top of things I was when I was anorexic and how much self control I had is still painful. I keep saying to myself that if I could eat as controlled as I did then, I would be able to feel emotionally stable rather than feel proud of myself for fasting or eating healthy for 3 days straight and then wanting to die after anxiously binging at 4 AM.\n\nBut at the same time, I never want to get to that point ever again. Quality of life was at an all time low: I couldn’t hang out with friends because of fear of eating and exhaustion, couldn’t even exercise after a certain point, and was constantly irritated and depressed. At least now I have enough energy and enthusiasm to live life seemingly normally rather than to basically be a hollow doll on a shelf.",
      "created_utc": 1543790703.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ea22pdf",
      "author": "None",
      "body": "the selfcontrol lasts like a month and then its just hell ",
      "created_utc": 1542660912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ea26hxa",
      "author": "itsemilylmao",
      "body": "I’ve felt this...I get hard on myself for not having self control (aka binging) which results in purging. It sucks.",
      "created_utc": 1542663830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ebazrfj",
      "author": "gracehug",
      "body": "its so shitty, i have anorexia and my family doctor first diagnosed me with bulimia and i started crying because i thought i had failed at being anorexic. it wasnt until i actually saw an ED specialist that u got properly diagnosed. i feel so bad that i even thought of the bulimia diagnosis as me failing, and i was almost happy when i got properly diagnosed........... i guess that’s just how our fucked up brains work :/",
      "created_utc": 1544207225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ee3evbp",
      "author": "MEintheTHING",
      "body": "I feel the same. ",
      "created_utc": 1547521102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ea17ec2",
      "author": "gkfl0831",
      "body": "Man.. I felt like the only one who thought like that.. eat nothing or inhale everything.. \nIt's literally such a curse, I'm so tired of it. I really also just wanna be able to eat normal. \n\nI also admire people with anorexia cause of their \"self control\" but at this point i just want at least a little BIT of it so i can attempt to be normal",
      "created_utc": 1542636301.0,
      "score": 14,
      "context": [
        {
          "id": "ea001vs",
          "author": "None",
          "body": "I really hate it, but there are moments that I feel the same. I have periods of time (usually 2 or 3 days, sometimes longer) that I manage to not eat, but then I always lose control again. \nYou know, most of all I wish I could just eat like a normal person. Eat when I'm hungry, stop when I'm full. Exercise more to lose some weight if I feel like it. \nI've tried so hard in the last couple of weeks, but it's all black and white for me. I eat nothing or I eat everything, and most of the time it's everything. I feel proud of myself if I manage to not eat for a couple of days, because it means that I have it under control. So yeah, I know how it feels..",
          "created_utc": 1542581551.0
        }
      ]
    },
    {
      "id": "eak41j6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1543306070.0,
      "score": 7,
      "context": [
        {
          "id": "ea0lef5",
          "author": "wickedalice",
          "body": "This hits the nail on the head. Bulimia, to me, is the poser version of an eating disorder. I don't have the strength to be anorexic so I eat everything in sight and purge some of it. My weight stays the same and it feels like an endless, pointless loop. ",
          "created_utc": 1542601386.0
        }
      ]
    },
    {
      "id": "ejpkba8",
      "author": "5mokahontas",
      "body": "I really, really, needed this wow.",
      "created_utc": 1553915049.0,
      "score": 1,
      "context": [
        {
          "id": "ea1bvmp",
          "author": "None",
          "body": "I understand you completely. However. They have something to be \"proud\" of until the skin sags, cracks, and goes gray. Until they go bald and age 25 years into the future. Until they lose the ability to think, stand, sit. The self control around food is a lie. They are not in any better control than you or I. I'm a black or white cyclical person, BMI 43 by age 13 then organ failure due to losing 120lbs in one year and a gradual decline of any routine or usual disorder and I've done everything in the book. Try to remind yourself that there's positivity in being able to nourish yourself to some extent. The end game of a \"properly controlled anorexic\", is death. There is no achievement unlocked, no \"aha!\", no \"I am happy/good enough\", no stopping the war machine we all wish would fix us. I understand you completely, but it makes me sad.",
          "created_utc": 1542640045.0
        }
      ]
    },
    {
      "id": "ea1pa0p",
      "author": "Thesocialtaco",
      "body": "This is another reason I feel like OP.\nAnorexia is the deadlier disease. Therefore my bulimia isn’t taken as seriously, or rather that’s what my brain says. \nIt just makes me feel pathetic to have bulimia and not anorexia 😞\nThen when I try to talk about my ED people look at my figure and give you this look like “uhuh. Okay fattie.” ",
      "created_utc": 1542650633.0,
      "score": 7,
      "context": [
        {
          "id": "ea0tj4t",
          "author": "kunji1994",
          "body": "Sadly, neither is the winner :( on the flip side, anorexia can be medically more fatal and has a higher rate of moratlity than bulimia because after a certain point, your organs start shutting down...so maybe its not all bad that you have bulimia! I've yo-yoed from anorexia to bulimia over the past 8 years and i'm still fighting for recovery, you can do it too!",
          "created_utc": 1542612831.0
        }
      ]
    },
    {
      "id": "ea18fpu",
      "author": "None",
      "body": "There are times I admire them too! But don't forget that having anorexia has a whole lot of struggles that come along with it, just as bulimia. Both are not something I'd wish on anyone! Except myself of course, I'm such a self hating sucker 😅 ",
      "created_utc": 1542637223.0,
      "score": 3,
      "context": [
        {
          "id": "ea001vs",
          "author": "None",
          "body": "I really hate it, but there are moments that I feel the same. I have periods of time (usually 2 or 3 days, sometimes longer) that I manage to not eat, but then I always lose control again. \nYou know, most of all I wish I could just eat like a normal person. Eat when I'm hungry, stop when I'm full. Exercise more to lose some weight if I feel like it. \nI've tried so hard in the last couple of weeks, but it's all black and white for me. I eat nothing or I eat everything, and most of the time it's everything. I feel proud of myself if I manage to not eat for a couple of days, because it means that I have it under control. So yeah, I know how it feels..",
          "created_utc": 1542581551.0
        },
        {
          "id": "ea17ec2",
          "author": "gkfl0831",
          "body": "Man.. I felt like the only one who thought like that.. eat nothing or inhale everything.. \nIt's literally such a curse, I'm so tired of it. I really also just wanna be able to eat normal. \n\nI also admire people with anorexia cause of their \"self control\" but at this point i just want at least a little BIT of it so i can attempt to be normal",
          "created_utc": 1542636301.0
        }
      ]
    },
    {
      "id": "eeznac8",
      "author": "JennDamley",
      "body": "Drinking a ton of diet soda helps with that ",
      "created_utc": 1548477540.0,
      "score": 4,
      "context": [
        {
          "id": "ea0lef5",
          "author": "wickedalice",
          "body": "This hits the nail on the head. Bulimia, to me, is the poser version of an eating disorder. I don't have the strength to be anorexic so I eat everything in sight and purge some of it. My weight stays the same and it feels like an endless, pointless loop. ",
          "created_utc": 1542601386.0
        },
        {
          "id": "eak41j6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543306070.0
        }
      ]
    }
  ]
}