{
  "id": "b2oge4",
  "subreddit": "bulimia",
  "author": "h0wl-at-the-m00n",
  "created_utc": 1552945035.0,
  "title": "The aftermath of 14 years of bulimia",
  "selftext": "Hi everyone. I’ve never been to this sub before as I was afraid of being triggered but I feel like I’m ok enough to talk about this now. I know “scare tactics” don’t work. Even stories about people dying from this horrible disease... it wasn’t enough for *me* to stop and I’m sure it won’t be enough for you either. But I wanted to share my story anyway, just to give you guys some insight from someone who has been battling this literally half their life. \n\nAnyway, I am 28 and just a few months ago I started my treatment for bulimia, I opted for partial inpatient. The group changed as time went on as nobody started at the same time. For two months I was there for six hours a day. We basically had to learn to eat all over again, took medication and nutrition classes, did cognitive behavioral therapy (which I think helped me the most), etc. It was one of the most difficult, heart wrenching, significant two months of my life. I have not purged since November 2nd 2018, my longest streak since the first time I did it.\n\nUnfortunately, I’ve been left with scars. And extremely broke from medical bills. \n\nAbout a year ago, I started to have intense, burning pain whenever I eat. I know to people really deep in the disease this sounds like a good thing - an excuse to not eat. But it was **not** fun. I got to the point I couldn’t even drink water without wanting to scream. I got an endoscopy and it turns out I have a permanent [hiatal hernia](https://i.imgur.com/eRyulqD.jpg). This means my stomach is popping up through my diaphragm. I am in intense pain when I eat certain things, or even a little too much. It will never go away on its own. It’s there forever unless I get surgery where I go under general anesthesia and I’ve had anesthesia awareness so I’m not doing that. I have to take pantoprazole 40mg every single day or I won’t even be able to go to work. \n\nSpeaking of work, I made $20,000 less than last year due to missing work because of my illness (lupus) and my eating disorder. I’d stay home, smoke weed, and engage in behaviors all day when my boyfriend was at the office and lie and say I just didn’t feel well. I lied to everyone. And I always considered myself an honest person but I guess when it came to my eating disorder, I’m not.\n\nI caused this. I did this to myself. I never thought I’d have a permanent health problem because of my disease. There is a chance I could actually die from this. If I start purging again, if I get a stomach bug, anything that could make me vomit... my stomach could get stuck, it could lose blood supply and die, and then I’d die soon after. \n\nI have been brushing my teeth twice a day and flossing my whole life. [Here is an x-ray of my front teeth](https://i.imgur.com/GnZRh26.jpg). [Here’s an actual picture I just took](https://i.imgur.com/vqapTDb.jpg). This is from fourteen years of vomiting multiple times a day. To fix these three teeth alone, I am quoted at $6,990. For these THREE. In total, I need **seven** root canals, **seven** fillings, and one tooth pulled. This is literally going to cost me over $14,000* (turns out 12k was wrong lol) and I have insurance. I am a full time [redacted] employee with the “best insurance in the country”. Well, apparently that doesn’t extend to my dental insurance. I found out this total at once btw, I’m not adding up quotes I’ve heard in the past. I’ve been to scared to go to the dentist the last six years because I knew I’d need some fillings. I had no idea I’d need root canals, posts, crowns, fillings, teeth pulled, etc.\n\nI already have almost $25,000 in debt from college. This is going to increase my debt by 50% or else I’ll lose my teeth, one by one, and eventually be essentially toothless. I can’t take out a loan because my credit dropped 96 points in three months because I couldn’t pay my bills due to chronic illness and being out of work/in the hospital. I tried to get my aunt to co-sign and she couldn’t, and we both knew I couldn’t afford an extra $520/mo.\n\nI have so much tooth pain that comes and goes that sometimes I can’t eat anything I actually have to chew. I’m 28, not 78. This problem is freaking me out so much at at the dentist last week that I stopped breathing and literally passed out for a minute. I feel sick to my stomach every day thinking about what I did to myself. How I am left picking up the pieces after the fucking hurricane that is my mental illness. I feel like this disease has ruined my life, and I’m so depressed about it that it’s difficult to make an action plan to turn everything around.\n\nI wish I could go back to being 14. To say this isn’t the way to cope. I wish I could embrace every fourteen year old girl suffering from this and hold her and tell her that she needs to see someone and get help. That bulimia isn’t her friend. That these images she saves of her “goals” are poison to her mind. That I understand and know what she’s went through. That I know it’s an addiction I will be fighting the rest of my life. And that I’ll fight with her, holding her hand, her with the sword and me with the shield. I know boys and nb people get bulimia as well, but it’s just an example of how I feel.\n\nI’m not going to get into why I think I have an ED as that’s another post for another time. I know it won’t cure you. I know it won’t make you enter treatment, that isn’t my goal here. I’m not your life coach. But I hope you see that even if this disease doesn’t kill you, it can make you physically miserable for the rest of your life. It can rack up debt. I’ll probably never be able to own a home, get a new car, and my boyfriend will probably never want to marry me because of my debt becoming his. Everything hurts all the time, even if I’m not purging anymore. Inside and out, everything hurts all the time. \n\n*edited to fix a link",
  "url": "https://www.reddit.com/r/bulimia/comments/b2oge4/the_aftermath_of_14_years_of_bulimia/",
  "score": 154,
  "num_comments": 31,
  "comments": [
    {
      "id": "eiu6nsb",
      "author": "tired-",
      "body": "I read the whole thing and although I'm 22, I'm going to take your advice in the second to last paragraph. After reading this, I feel compelled to make concrete steps to finally begin the recovery that I've been putting up for so long.",
      "created_utc": 1552950936.0,
      "score": 29,
      "context": []
    },
    {
      "id": "eiu0m89",
      "author": "None",
      "body": "Thanks for sharing your story.\n\nI hope recovery goes well, you can do this.",
      "created_utc": 1552946444.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eiul9rm",
      "author": "ezranilla",
      "body": "From the bottom of my heart thank you for sharing. I'm crying rn bc I resonate with your story. \n\nOf course I haven't been through the same thing as you because we all go through our own shit, but I'm so glad you came here because you're not alone and I hope that this community can make you feel at least a little less alone. I haven't b/p since August and I admire your recovery efforts because I know that it's really fucking hard. I am SO PROUD OF YOU for going to the dentist, even if your teeth can't be addressed immediately. I had 8 cavities filled in January, and it was about 8 months between my first time back to the dentist and when I was able to have them filled.\n\nThat 14 year old girl is still there, and you're taking care of her with everything you have. You're doin it dude! Even if it takes years. Every day you add to your recovery adds days or month and eventually years to your life. \n\nThis might sound silly, and idk if it would help you at all, but the ED voice in my head is named Jerry. Jerry is an old white man with very unrealistic body standards. And I can tell Jerry to shut the fuck up. If you think it might help, give your ED/intrusive thoughts a name so you can call it on it's bullshit. \n\nWould you be willing to share any of the things you've been taught in treatment? Also, if you want to share your story of how you developed your ED, we are here to listen.\n\nIf you need ANYTHING, don't hesitate to ask.",
      "created_utc": 1552962189.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eiudbzb",
      "author": "VelvetThunderstorm",
      "body": "This broke my heart. I can't imagine the struggles you have had to endure. I am sure no amount of words would be able to help, but I hope you find a path to health, solidarity and comfort. I don't doubt it will be incredibly challenging, but this random Reddit user wants you to accomplish your goals and get better. I wish the best for you. I really do",
      "created_utc": 1552956048.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eiulw8h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1552962678.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ej8r19g",
      "author": "None",
      "body": "Thank you for this. Thank you for sharing your story, this was something I needed to hear and I hope you know that your words make an impact. \n\nI have been struggling with eating disorders for the past 6 years, and you're right -- scare tactics don't work. I've come across countless stories of the aftermath of this awful disease, yet was never able to shake it from my life. I came across your post at the right time in my mental battle. I had been wanting to recover, but didn't have the push that I needed to stick to the path of moving on from bulimia. \n\nYour story made me want to put an end to this before it's too late. This is my second time reading through your post, and I couldn't help but reach out and thank you for sharing your experience. I read your post the first day you posted, and have been purge free since. My fifth day so far. I've gotten close to going back to my behaviors, even up until the point where I was back at the edge of the toilet bowl. In those moments, I thought of your story. What you went through. All that you're left with as of today. And your plea to the rest of us who are going through the same thing, that it's not worth it. That you understand and that we're not alone. \n\nPlease keep sharing your story. If this could make an impact on me, I know it can touch the lives of others who are going through the same thing. I wish you all the best in your road to recovery. ",
      "created_utc": 1553397148.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eivab3z",
      "author": "None",
      "body": "God. Thanks for posting this. I’ve been purge free for 150 days but I’m having a really stressful life atm and a hard time keeping those urges at bay. I’ve saved this to remind myself that it’s not worth it.  Best of luck with your recovery ❤️",
      "created_utc": 1552993005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ekj2wiy",
      "author": "JadedPineapple",
      "body": "Thank you so much for sharing your story. I can’t say that I can fully understand the pain you’re going through both physically and emotionally, but I am so grateful you’ve chosen use your pain and share your experience in order to help others. \n\nI’ve been battling bulimia for almost 10 years, and have also had 2 root canals and some issues with teeth sensitivity as well. Despite hearing all the warnings about the consequences of this disease like a ruptured esophagus or heart failure, I’ve never really taken them seriously or have never truly considered that they might happen to me. I recently have turned to this community on reddit in hopes of finding support since I am too ashamed to tell any of my loved ones. The crazy thing is, I am very fortunate to have people in my life who care about me and one of my best friends has even struggled with anorexia and bulimia and has gotten treatment/is in recovery, but I am so scared to talk about it to her or anyone else. As much as the fear comes from anticipating how they will react, I think I am more scared about opening up and being so vulnerable and sharing a deep dark secret I’ve hidden for so long. A couple friends know that I have struggled with this in the past, but I’ve always minimized the severity and have really never been honest about my behaviors with another human being. \n\nSince I joined this community and have read about other people’s experiences and engaged with other users, I am making plans to contact an ED therapist that has been recommended to me by someone on this site. Unfortunately, the job I am starting next week working for an early stage startup won’t provide any health insurance or benefits whatsoever, so I’m worried that I may talk myself out of seeing a therapist to help me for financial reasons. I have recently felt now more than ever that this is a wake up call and I need to actually confront this disease and try to beat this thing. \n\nYour post really moved me, thanks again for sharing. If you don’t mind me asking, what was your experience when you finally told someone? How did you bring yourself to do it?\n\nThank you again. Sending love.",
      "created_utc": 1554875870.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eium82u",
      "author": "audreyzoesch",
      "body": "The teeth thing is what’s really stuck with me in terms of recovery... you can’t ever get your teeth back",
      "created_utc": 1552962945.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiup27l",
      "author": "deadcomefebruary",
      "body": "Wow. Just...wow. I always swore, the first time I purged and in the months thereafter, I would stop purging once I lost the weight I wanted to.\n\nOne month turned to six turned to a year turned to 5 years.\n\nAlso, go to Mexico to get your dental work done. Seriously. It's cheap af and contrary to popular belief it is perfectly safe so long ad you do your research.",
      "created_utc": 1552965269.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiuyglx",
      "author": "cornonthecob42069",
      "body": "I had bulimia for 6 years, recovered two years ago. I still get the urge to do it from time to time, and today was especially bad, so I came on here for help. you said scare tactics don’t work, and that this won’t stop anyone from engaging in behaviors but you’re wrong. your post stopped me from breaking tonight. thank you. \n\n\n\nand i’m so sorry for what you’re going through, i hope with time it’ll heal and you’ll be in less pain. you’re so strong. ",
      "created_utc": 1552975383.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eixm82t",
      "author": "None",
      "body": "Could you possibly go to another country for dental work such as Poland? I know a lot of Americans do this. Even with place tickets, hotels, etc. it could be significantly cheaper. \n\nBesides that thank you. Today I was so so angry and hopeless. But you just made me realize I can't give up. I need to keep trying. Thank you for sharing. ",
      "created_utc": 1553052315.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiubhcu",
      "author": "vanillyl",
      "body": "Wow, that was an incredibly moving read that really hit me hard. I’ve just turned 31, which means I’ve officially battled my ED for 18 years now. I’ve cycled back and forth between anorexia and bulimia pretty regularly. I think realistically I probably fit into the EDNOS category, as I don’t restrict enough to be classed as anorexic, and I don’t regularly binge as such, just throw up the little that I have eaten, so I don’t really fit the bulimia model either. \n\nThe last 2? 3? years I’ve been pretty solidly purging, to start with around 5 days a week, which worked it’s way up to 7, currently I’m down to about once every two weeks as I’ve really been working hard on recovery and I have a new, utterly amazing partner who knows and tries to understand my illness. I desperately don’t want to disappoint him, but weirdly enough that has lead me to being really honest with him about when I’ve purged, rather than desperately hiding it. \n\nI’m clearly blessed with good genetics teeth wise - despite my history I’ve never had an adult filling or a root canal. Lately though I’ve felt they are becoming more and more brittle, and they feel thinner than they used to. I’ve been putting off going to the dentist since I regularly got back into the b/p cycle I’ve been riding out for the past few years. Thank you so much for sharing your story. I’m going to suck it up and book myself into the dentist tomorrow, and work even harder on sticking to my recovery plan. I wish you the absolute best and I can only hope that you find some way to get your teeth fixed and that if you can’t get your hernia corrected, it at least does start to cause you less pain and discomfort as you continue your recovery journey and keep establishing and repeating good habits and a healthier diet.\n\nDentally - have you considered surgical tourism as an option? I know a few people who’ve had major reconstructive dental work done in Thailand for a fraction of the price you’d pay in most westernised countries. There are of course risks involved, but if you do your research there are amazing medical/dental facilities in that part of the world that are run by highly skilled medical professionals. I don’t know any resources to suggest personally, but this could be something you might want to look into if it’s just not possible for you to afford to get the work done in your home country. ",
      "created_utc": 1552954635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er3hiu5",
      "author": "TotesMessenger",
      "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_vendermask] [The aftermath of 14 years of bulimia](https://www.reddit.com/r/u_vendermask/comments/c0c17z/the_aftermath_of_14_years_of_bulimia/)\n\n- [/r/u_vendermask] [The aftermath of 14 years of bulimia](https://www.reddit.com/r/u_vendermask/comments/c0c17t/the_aftermath_of_14_years_of_bulimia/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "created_utc": 1560463370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ex0jeyr",
      "author": "youryoureyouier",
      "body": "Thank you for sharing",
      "created_utc": 1565914533.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eiv5pq2",
      "author": "h0wl-at-the-m00n",
      "body": "It’s honestly really scary. I’ve always been one of those people that once I get to know and trust you, I’m an open book... well, 90%. It was the one thing I hesitated talking about. I feel that my disease is rooted in guilt, and for me guilt is a very difficult thing to cope with. I’d tell my boyfriend and my best friend most of it... but not my mother. I am very close to my mother. Always have been. I’ve told her everything, but I just couldn’t talk to her about my eating disorder. \n\nShe knew I had it when I was a teenager, but I played it off and kept it a secret much easier as I got older and everyone in the house was on different schedules. Then when I got my own apartment it was very easy to engage in behaviors. I’m not underweight and haven’t been in a very long time so bulimia isn’t very obvious. I always felt ill but I blamed that on the lupus and fibromyalgia.\n\nI wasn’t making a lot of progress in treatment for a few weeks. Soon, I had a meeting with my therapist at the program, my mother, and myself. I told her what I always felt deep in my heart and saying it out loud was this freeing feeling I’ve never had in my life, and I’m a sensitive individual.\n\nThis is something I thought to myself in treatment - learning to allow yourself to be 100% vulnerable is a learned skill. It takes practice, it’s a muscle that needs to be worked out. And after training making yourself vulnerable, having conversations, exploring yourself and your intentions*, you might feel exhausted. Literally every single day for two months I had a one hour drive to get to program for six hours, then drive to work for a half hour, then work for four hours, then drive home a half hour. I was so fucking exhausted every day, mentally, physically, emotionally. I’d lay my head on the steering wheel and ask him, “Do I really have to do this again tomorrow?” And he’d say “Yes, you do.”\n\nIt’s so so exhausting, whether you opt for partial outpatient, partial inpatient, full inpatient. You need to learn how to let go of control in order to gain control back if makes any sense. I’m a peaceful person and sometimes I felt myself get very angry. I’d want to just not show up every day. But I showed up. I’m the kind of person to pick up a new hobby and drop it. Dropped out of college. Walked out on fine relationships. I’m a flake. But I showed up and I worked that god damn muscle until I couldn’t anymore.\n\nSorry for writing another essay! I just don’t get to talk about this experience very much. I wish you the absolute best of luck. Remember that there are real support networks out there, ones that truly want recovery. Confide in a friend or two if you haven’t already, educate them on what this disease means to you. A lot of people I know don’t understand bulimia and think it’s simply an issue of vanity.\n\nIf you need some advice on looking into a partial inpatient centre and you’re in the US feel free to pm me.",
      "created_utc": 1552986227.0,
      "score": 2,
      "context": [
        {
          "id": "eiu6nsb",
          "author": "tired-",
          "body": "I read the whole thing and although I'm 22, I'm going to take your advice in the second to last paragraph. After reading this, I feel compelled to make concrete steps to finally begin the recovery that I've been putting up for so long.",
          "created_utc": 1552950936.0
        }
      ]
    },
    {
      "id": "eiv5qfm",
      "author": "h0wl-at-the-m00n",
      "body": "I hope so too. It’s cliche but day by day my friend. Best of luck to you as well.",
      "created_utc": 1552986260.0,
      "score": 1,
      "context": [
        {
          "id": "eiu0m89",
          "author": "None",
          "body": "Thanks for sharing your story.\n\nI hope recovery goes well, you can do this.",
          "created_utc": 1552946444.0
        }
      ]
    },
    {
      "id": "eiv6auh",
      "author": "h0wl-at-the-m00n",
      "body": "Funny story about naming your ED - in program one of the therapists suggested giving our EDs a name in order to split your “true” voice and “sick” voice. Every other girl said “I just call mine Ed or Eddie” and I’m just like “nooo that’s my father’s name!” So I just decided to call it “the Beast” because its voice feels like the booming voice of an evil behemoth vibrating through my chest.\n\nThank you for reading my story. I’m glad to hear you got that work done, it really really sucks that I waited so long. Can’t do anything about that now though.\n\nAlso no b/p since August? That’s amazing! I’m so happy to hear that. Its important to remember to give ourselves a pat on the back every day we don’t engage in behaviors. I’m one of those people who can’t handle compliments so *that* was a difficult lesson lol.\n\nAnd if you’re interested, I’d be happy to take a look at my recovery folder this week and share some info with you and everyone else on some important stuff we learned. Of course I am not a licensed therapist so I can’t suggest anyone take any sort of action, but they’re mostly useful exercises found in academic books. They’re very moving forward oriented, specific goal oriented. Not so much talking about specific behaviors, food hang ups, etc. That kind of thing was reserved for your private therapist and nutritionist.",
      "created_utc": 1552987206.0,
      "score": 2,
      "context": [
        {
          "id": "eiul9rm",
          "author": "ezranilla",
          "body": "From the bottom of my heart thank you for sharing. I'm crying rn bc I resonate with your story. \n\nOf course I haven't been through the same thing as you because we all go through our own shit, but I'm so glad you came here because you're not alone and I hope that this community can make you feel at least a little less alone. I haven't b/p since August and I admire your recovery efforts because I know that it's really fucking hard. I am SO PROUD OF YOU for going to the dentist, even if your teeth can't be addressed immediately. I had 8 cavities filled in January, and it was about 8 months between my first time back to the dentist and when I was able to have them filled.\n\nThat 14 year old girl is still there, and you're taking care of her with everything you have. You're doin it dude! Even if it takes years. Every day you add to your recovery adds days or month and eventually years to your life. \n\nThis might sound silly, and idk if it would help you at all, but the ED voice in my head is named Jerry. Jerry is an old white man with very unrealistic body standards. And I can tell Jerry to shut the fuck up. If you think it might help, give your ED/intrusive thoughts a name so you can call it on it's bullshit. \n\nWould you be willing to share any of the things you've been taught in treatment? Also, if you want to share your story of how you developed your ED, we are here to listen.\n\nIf you need ANYTHING, don't hesitate to ask.",
          "created_utc": 1552962189.0
        }
      ]
    },
    {
      "id": "eiv5tlr",
      "author": "h0wl-at-the-m00n",
      "body": "It’s a struggle, but I am just thankful to have the experience of being alive regardless of the pain I am in. And you wouldn’t believe the kinds of things I’ve said to myself. I still have every print out and work sheet from program in a folder. There’s one exercise called “I wouldn’t say that to my worst enemy” and you had to write something down that you feel about yourself that you’d never say to someone else. It was kind of shocking that I was so willing to say such terrible things about myself. Best of luck to you, thanks for reading my story.",
      "created_utc": 1552986409.0,
      "score": 1,
      "context": [
        {
          "id": "eiudbzb",
          "author": "VelvetThunderstorm",
          "body": "This broke my heart. I can't imagine the struggles you have had to endure. I am sure no amount of words would be able to help, but I hope you find a path to health, solidarity and comfort. I don't doubt it will be incredibly challenging, but this random Reddit user wants you to accomplish your goals and get better. I wish the best for you. I really do",
          "created_utc": 1552956048.0
        }
      ]
    },
    {
      "id": "eiv6o4e",
      "author": "h0wl-at-the-m00n",
      "body": "It’s never too late to start. I was in there with a 19 year old and a 63 year old. However, I wouldn’t wait until 63 because unfortunately sometimes people like you and I don’t make it that long. It’s a very serious illness that causes permanent, painful, lifelong health problems. Other stuff can happen from bulimia as well besides your teeth rotting out of your mouth and a hiatal hernia. You can develop gastroparesis, ulcers, a ripped esophagus, constipation leading to impaction, permanent hair loss, bone density loss (a 34 year old woman there with me had advanced osteoporosis), GERD (which you can get from the hiatal hernia and I have as well)... and stomach rupture, kidney failure, heart failure which are life threatening and kill bulimic people, including young ones, all the time. These are very real and I’m living proof of it and I’m lucky I got treatment now and not when I’m knocking on deaths door. \n\n*edit: oh and I just remembered, a girl I was in treatment with had muscles that wasted away so bad that she had a vaginal prolapse!\n\nConsider talking to your psych if you have one, PCP, and insurance company. They’d help find a good fit for you. You just have to learn how to let your guard down. I know that’s hard as hell but when you let that guard down, yeah bad feelings come out but good feelings come in. And the good feelings make if worth everything.",
      "created_utc": 1552987810.0,
      "score": 3,
      "context": [
        {
          "id": "eiulw8h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1552962678.0
        }
      ]
    },
    {
      "id": "eiwzixy",
      "author": "h0wl-at-the-m00n",
      "body": "That’s amazing! I’m really excited to get to that point myself someday :D \n\nI’m so glad my story helped you in some way. Good luck to you as well, remember, you can do this. Even if you don’t think you can, remember that you did it yesterday. <3",
      "created_utc": 1553035554.0,
      "score": 2,
      "context": [
        {
          "id": "eivab3z",
          "author": "None",
          "body": "God. Thanks for posting this. I’ve been purge free for 150 days but I’m having a really stressful life atm and a hard time keeping those urges at bay. I’ve saved this to remind myself that it’s not worth it.  Best of luck with your recovery ❤️",
          "created_utc": 1552993005.0
        }
      ]
    },
    {
      "id": "eln7j1h",
      "author": "h0wl-at-the-m00n",
      "body": "Hi! Sorry for taking so long to reply, this is my alt account for illness/addiction related stuff and I have bipolar disorder so I disappear from social media sometimes. \n\nI’m sorry to hear you’ve been fighting this for so long. I too didn’t think anything major would happen, as I wasn’t “sick” enough. Throughout my fourteen year journey with my ED, I’ve never been underweight. There’s this weird stigma that you need to be severely underweight in order for your disease to be legitimate. I literally had a doctor (primary care medical intern) laugh in my face when I told him that I’m bulimic and need help. I feel that bulimia, in a lot of cases, can be linked to feelings of guilt and shame, but I’m not a psychologist.\n\nAs I’ve said in other comments, vulnerability is a muscle. You need to keep working it out, it’s ok to take days off to recover (it can be very emotionally exhausting) but then you need to get back into it. I would go to IOP 1pm to 7pm, then directly to work 7:30pm - 11:30 pm. I was exhausted, both physically and emotionally, every day. I work with my boyfriend. Every night we’d drive home and I would lay my head on the steering wheel as soon as we pulled into the driveway. I’d ask him “Do I have to do this all again tomorrow?” And he would say “Yes.” Maybe consider talking to that friend of yours. You may be really surprised by their response and they can become a part of your support network. \n\nIt’s important to have a network of support, whether it’s two people or ten. Most people in my life ended up finding out because I went part time at work. I posted a card from the recovery center and shared some thoughts. I normally don’t post very personal stuff, but it was the first time in my life that I’ve *followed through with something* since high school and I’m 28. It’s not for everyone, but I was totally ok with educating others about the disease when possible, hoping to end some of the stigma. I have mental illnesses, but feel like this is one area of my life where I have control for once, but I’m not sure yet if that’s a good or bad thing yet\n\nI’m sorry to hear you’re dealing with insurance issues. Are you American? Maybe you can get some kind of temporary Medicare? If not, you have to weigh your options. How much is your psychical and well-being worth? You said you’ve been struggling for ten years, that’s a long time. Do you think you can continue to live this way? I couldn’t take it anymore. \n\nWhile I may no longer be purging, I still have a lot of issues with mental illness and my journey is far from over. I wish my life was perfect and productive now but sadly it isn’t. You know what though? Some people make an incredible recovery and it kick starts their lives. Mine didn’t, but damn, it beats living like I was *plus* the bulimia.\n\nI really hope you consider seeing a professional, even if it’s just to start planning and nudge you in the right direction. You deserve more out of life, I feel like bulimia is trying to swim upstream. You might make it but you’ll be damn tired when you’re done, or get swept away. There aren’t many cases of people with  bulimia, dying at 93 in bed, due to natural causes, surrounded by friends and family. Something to consider. I don’t mean to frighten you, but this is real shit time. \n\nMy bulimia morphed throughout the years, the first people I told were my middle school friends who didn’t really get it and I was too embarrassed to bring it up again. Every boyfriend I’ve had has known, and my current one has been very understanding. My parents have known on and off throughout the years, I lied a lot, hid it well. When I brought up that I was getting treatment they both said “I thought you dropped that years ago”. I figured fuck it, I need to explain why my schedule has changed so much, they already partially know. I’m sure it’s much more challenging if your legal guardians don’t know, I would not be a good person to ask about that. There may be concern and tears, but there’s not much you can do to stop that.\n\nSorry for an essay. I hope this helped answer some stuff. I hope you are doing well. <3",
      "created_utc": 1556099969.0,
      "score": 2,
      "context": [
        {
          "id": "ekj2wiy",
          "author": "JadedPineapple",
          "body": "Thank you so much for sharing your story. I can’t say that I can fully understand the pain you’re going through both physically and emotionally, but I am so grateful you’ve chosen use your pain and share your experience in order to help others. \n\nI’ve been battling bulimia for almost 10 years, and have also had 2 root canals and some issues with teeth sensitivity as well. Despite hearing all the warnings about the consequences of this disease like a ruptured esophagus or heart failure, I’ve never really taken them seriously or have never truly considered that they might happen to me. I recently have turned to this community on reddit in hopes of finding support since I am too ashamed to tell any of my loved ones. The crazy thing is, I am very fortunate to have people in my life who care about me and one of my best friends has even struggled with anorexia and bulimia and has gotten treatment/is in recovery, but I am so scared to talk about it to her or anyone else. As much as the fear comes from anticipating how they will react, I think I am more scared about opening up and being so vulnerable and sharing a deep dark secret I’ve hidden for so long. A couple friends know that I have struggled with this in the past, but I’ve always minimized the severity and have really never been honest about my behaviors with another human being. \n\nSince I joined this community and have read about other people’s experiences and engaged with other users, I am making plans to contact an ED therapist that has been recommended to me by someone on this site. Unfortunately, the job I am starting next week working for an early stage startup won’t provide any health insurance or benefits whatsoever, so I’m worried that I may talk myself out of seeing a therapist to help me for financial reasons. I have recently felt now more than ever that this is a wake up call and I need to actually confront this disease and try to beat this thing. \n\nYour post really moved me, thanks again for sharing. If you don’t mind me asking, what was your experience when you finally told someone? How did you bring yourself to do it?\n\nThank you again. Sending love.",
          "created_utc": 1554875870.0
        }
      ]
    },
    {
      "id": "eiv6qdb",
      "author": "h0wl-at-the-m00n",
      "body": "Yeah, I think that’s why I am so upset about the teeth, they can’t grow back. I’ve had a few emotional fits over it crying in the floor. At this point a cheaper option might be partial dentures which is kind of insane for someone a few weeks away from her 28th birthday.",
      "created_utc": 1552987913.0,
      "score": 2,
      "context": [
        {
          "id": "eium82u",
          "author": "audreyzoesch",
          "body": "The teeth thing is what’s really stuck with me in terms of recovery... you can’t ever get your teeth back",
          "created_utc": 1552962945.0
        }
      ]
    },
    {
      "id": "eivbvir",
      "author": "Grusinskaya",
      "body": "I'm almost 39 and haven't engaged in active bulimia i.e. binge/purge for so so long, 20 years or so. Slowly, over those years, my back teeth have partially cracked and fallen out, one is dead due to an abscess at age 23, only now are my front teeth beginning to show signs of developing tiny cracks and holes. I'm afraid to smile properly and that my front visible teeth will crack or shatter soon. I thought I'd got lucky with my teeth at the time, but the weakness that binging and vomiting caused was slow to show up I guess. It's crappy  to put it mildly, to have this also to worry about when you're going grey and feeling your 30s slipping away! Like the poem says, I wish I'd looked after me teeth.",
      "created_utc": 1552994822.0,
      "score": 2,
      "context": [
        {
          "id": "eium82u",
          "author": "audreyzoesch",
          "body": "The teeth thing is what’s really stuck with me in terms of recovery... you can’t ever get your teeth back",
          "created_utc": 1552962945.0
        }
      ]
    },
    {
      "id": "eiv6tcz",
      "author": "h0wl-at-the-m00n",
      "body": "Perhaps. I can barely afford anything due to all the work I’ve been missing, I’d have to pull all of my money out of my retirement which is like $2,000, and I already took $2,000 out to help pay for treatment so who knows if I’ll even be approved. \n\nFor me it started as a coping tool and I started to like the results. Then I became physically addicted. ",
      "created_utc": 1552988049.0,
      "score": 1,
      "context": [
        {
          "id": "eiup27l",
          "author": "deadcomefebruary",
          "body": "Wow. Just...wow. I always swore, the first time I purged and in the months thereafter, I would stop purging once I lost the weight I wanted to.\n\nOne month turned to six turned to a year turned to 5 years.\n\nAlso, go to Mexico to get your dental work done. Seriously. It's cheap af and contrary to popular belief it is perfectly safe so long ad you do your research.",
          "created_utc": 1552965269.0
        }
      ]
    },
    {
      "id": "eixw3hm",
      "author": "h0wl-at-the-m00n",
      "body": "I’d legit love to go to Poland but I don’t even have a passport nor more than $2,000 in funds right now. Sad times. \n\nAnd hell yes keep trying! Being angry is normal. I’m sure there’s some actual science behind it, but behaviors are pretty addictive. I used to get moody if I haven’t used behaviors as if I went without caffeine for a few days. I’d wake up with a feeling of frustration. But you know what? This disease has not been kind to you. It’s been a major asshole. Be an even bigger asshole back. Kick it’s ass.",
      "created_utc": 1553063019.0,
      "score": 1,
      "context": [
        {
          "id": "eixm82t",
          "author": "None",
          "body": "Could you possibly go to another country for dental work such as Poland? I know a lot of Americans do this. Even with place tickets, hotels, etc. it could be significantly cheaper. \n\nBesides that thank you. Today I was so so angry and hopeless. But you just made me realize I can't give up. I need to keep trying. Thank you for sharing. ",
          "created_utc": 1553052315.0
        }
      ]
    },
    {
      "id": "eiv6zb6",
      "author": "h0wl-at-the-m00n",
      "body": "18 years is such a long time to suffer. I don’t know you but I know you have people who love you, people who don’t want you to hurt. But you have to want it gone more than you want it to stay. I never realized how fiercely I defended my disease like it was my baby. Learning that I don’t know everything kind of fucked me up at first. You have to be willing to allow yourself to be vulnerable. I wish you the best of luck!\n\nAnd I’m not so sure about dental tourism, I don’t have a passport and have never even left my country, I’d be terrified to be alone. I’ve applied for a grant so I’m hoping to hear back soon.",
      "created_utc": 1552988316.0,
      "score": 1,
      "context": [
        {
          "id": "eiubhcu",
          "author": "vanillyl",
          "body": "Wow, that was an incredibly moving read that really hit me hard. I’ve just turned 31, which means I’ve officially battled my ED for 18 years now. I’ve cycled back and forth between anorexia and bulimia pretty regularly. I think realistically I probably fit into the EDNOS category, as I don’t restrict enough to be classed as anorexic, and I don’t regularly binge as such, just throw up the little that I have eaten, so I don’t really fit the bulimia model either. \n\nThe last 2? 3? years I’ve been pretty solidly purging, to start with around 5 days a week, which worked it’s way up to 7, currently I’m down to about once every two weeks as I’ve really been working hard on recovery and I have a new, utterly amazing partner who knows and tries to understand my illness. I desperately don’t want to disappoint him, but weirdly enough that has lead me to being really honest with him about when I’ve purged, rather than desperately hiding it. \n\nI’m clearly blessed with good genetics teeth wise - despite my history I’ve never had an adult filling or a root canal. Lately though I’ve felt they are becoming more and more brittle, and they feel thinner than they used to. I’ve been putting off going to the dentist since I regularly got back into the b/p cycle I’ve been riding out for the past few years. Thank you so much for sharing your story. I’m going to suck it up and book myself into the dentist tomorrow, and work even harder on sticking to my recovery plan. I wish you the absolute best and I can only hope that you find some way to get your teeth fixed and that if you can’t get your hernia corrected, it at least does start to cause you less pain and discomfort as you continue your recovery journey and keep establishing and repeating good habits and a healthier diet.\n\nDentally - have you considered surgical tourism as an option? I know a few people who’ve had major reconstructive dental work done in Thailand for a fraction of the price you’d pay in most westernised countries. There are of course risks involved, but if you do your research there are amazing medical/dental facilities in that part of the world that are run by highly skilled medical professionals. I don’t know any resources to suggest personally, but this could be something you might want to look into if it’s just not possible for you to afford to get the work done in your home country. ",
          "created_utc": 1552954635.0
        }
      ]
    },
    {
      "id": "eivsaz8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1553007920.0,
      "score": 3,
      "context": [
        {
          "id": "eiu6nsb",
          "author": "tired-",
          "body": "I read the whole thing and although I'm 22, I'm going to take your advice in the second to last paragraph. After reading this, I feel compelled to make concrete steps to finally begin the recovery that I've been putting up for so long.",
          "created_utc": 1552950936.0
        },
        {
          "id": "eiv5pq2",
          "author": "h0wl-at-the-m00n",
          "body": "It’s honestly really scary. I’ve always been one of those people that once I get to know and trust you, I’m an open book... well, 90%. It was the one thing I hesitated talking about. I feel that my disease is rooted in guilt, and for me guilt is a very difficult thing to cope with. I’d tell my boyfriend and my best friend most of it... but not my mother. I am very close to my mother. Always have been. I’ve told her everything, but I just couldn’t talk to her about my eating disorder. \n\nShe knew I had it when I was a teenager, but I played it off and kept it a secret much easier as I got older and everyone in the house was on different schedules. Then when I got my own apartment it was very easy to engage in behaviors. I’m not underweight and haven’t been in a very long time so bulimia isn’t very obvious. I always felt ill but I blamed that on the lupus and fibromyalgia.\n\nI wasn’t making a lot of progress in treatment for a few weeks. Soon, I had a meeting with my therapist at the program, my mother, and myself. I told her what I always felt deep in my heart and saying it out loud was this freeing feeling I’ve never had in my life, and I’m a sensitive individual.\n\nThis is something I thought to myself in treatment - learning to allow yourself to be 100% vulnerable is a learned skill. It takes practice, it’s a muscle that needs to be worked out. And after training making yourself vulnerable, having conversations, exploring yourself and your intentions*, you might feel exhausted. Literally every single day for two months I had a one hour drive to get to program for six hours, then drive to work for a half hour, then work for four hours, then drive home a half hour. I was so fucking exhausted every day, mentally, physically, emotionally. I’d lay my head on the steering wheel and ask him, “Do I really have to do this again tomorrow?” And he’d say “Yes, you do.”\n\nIt’s so so exhausting, whether you opt for partial outpatient, partial inpatient, full inpatient. You need to learn how to let go of control in order to gain control back if makes any sense. I’m a peaceful person and sometimes I felt myself get very angry. I’d want to just not show up every day. But I showed up. I’m the kind of person to pick up a new hobby and drop it. Dropped out of college. Walked out on fine relationships. I’m a flake. But I showed up and I worked that god damn muscle until I couldn’t anymore.\n\nSorry for writing another essay! I just don’t get to talk about this experience very much. I wish you the absolute best of luck. Remember that there are real support networks out there, ones that truly want recovery. Confide in a friend or two if you haven’t already, educate them on what this disease means to you. A lot of people I know don’t understand bulimia and think it’s simply an issue of vanity.\n\nIf you need some advice on looking into a partial inpatient centre and you’re in the US feel free to pm me.",
          "created_utc": 1552986227.0
        }
      ]
    },
    {
      "id": "eizcau0",
      "author": "h0wl-at-the-m00n",
      "body": "I feel you there. It really sucks. It’s almost criminal how expensive dental work is in the US. It’s not like a doctors bill you can pay later. You have to pay up front. I’ve never even had $6,900 in my bank account at once...",
      "created_utc": 1553110390.0,
      "score": 1,
      "context": [
        {
          "id": "eium82u",
          "author": "audreyzoesch",
          "body": "The teeth thing is what’s really stuck with me in terms of recovery... you can’t ever get your teeth back",
          "created_utc": 1552962945.0
        },
        {
          "id": "eivbvir",
          "author": "Grusinskaya",
          "body": "I'm almost 39 and haven't engaged in active bulimia i.e. binge/purge for so so long, 20 years or so. Slowly, over those years, my back teeth have partially cracked and fallen out, one is dead due to an abscess at age 23, only now are my front teeth beginning to show signs of developing tiny cracks and holes. I'm afraid to smile properly and that my front visible teeth will crack or shatter soon. I thought I'd got lucky with my teeth at the time, but the weakness that binging and vomiting caused was slow to show up I guess. It's crappy  to put it mildly, to have this also to worry about when you're going grey and feeling your 30s slipping away! Like the poem says, I wish I'd looked after me teeth.",
          "created_utc": 1552994822.0
        }
      ]
    },
    {
      "id": "eixwpua",
      "author": "h0wl-at-the-m00n",
      "body": "It’s important to try to replace your ED behaviors with healthier alternatives. It sounds cliche but it’s true. Contact a friend, read and make some tea, meditate, an artistic endeavor - something that makes you feel comfortable and safe. \n\nI had a lot of social anxiety until I started to work a retail job, that helped so much because I was forced to deal with the public daily. As happy as I am that I’m no longer in retail, the social experience I gained made it worth it. Do you have a job? If so, ask a coworker you jive with if they’d like to meet up sometime. Especially now that the weather is getting nicer (assuming you’re in the northern hemisphere that is) there are a lot of cool outdoor things to do. Also, maybe check out Groupon! Hanging out doesn’t have to revolve around eating and obsessing about food when you’re just trying to have fun.\n\nThat even applies if you’re just in school. Do you live on campus? Consider joining a club. I know it feels weird putting yourself out there, but if you can find a group that represents a cause you believe in or a hobby you enjoy, consider signing up. You’re basically going to be forced to meet people who have at least one similar interest to you. I just try to think of it as “fuck it, I cannot control the thoughts of others. They probably don’t notice my flaws. And if they do, there’s nothing I can do to stop them so there’s no point in worrying about it”. Most other people are concerned about their own shit and aren’t focusing on you, just like how you aren’t focused on them.\n\nI’m really proud of you. Avoiding the exhaustion binge is hard. It’s comforting. Sadly it’s a slow acting poison and while it feels good now, it’ll inevitably lead to a boiling point. For some it’s loss of loved ones. Permanent health problems. Financial strain. Loss of your own life. Just saying, unfortunately you don’t see many old bulimics. There’s a reason for that.",
      "created_utc": 1553063897.0,
      "score": 2,
      "context": [
        {
          "id": "eiu6nsb",
          "author": "tired-",
          "body": "I read the whole thing and although I'm 22, I'm going to take your advice in the second to last paragraph. After reading this, I feel compelled to make concrete steps to finally begin the recovery that I've been putting up for so long.",
          "created_utc": 1552950936.0
        },
        {
          "id": "eiv5pq2",
          "author": "h0wl-at-the-m00n",
          "body": "It’s honestly really scary. I’ve always been one of those people that once I get to know and trust you, I’m an open book... well, 90%. It was the one thing I hesitated talking about. I feel that my disease is rooted in guilt, and for me guilt is a very difficult thing to cope with. I’d tell my boyfriend and my best friend most of it... but not my mother. I am very close to my mother. Always have been. I’ve told her everything, but I just couldn’t talk to her about my eating disorder. \n\nShe knew I had it when I was a teenager, but I played it off and kept it a secret much easier as I got older and everyone in the house was on different schedules. Then when I got my own apartment it was very easy to engage in behaviors. I’m not underweight and haven’t been in a very long time so bulimia isn’t very obvious. I always felt ill but I blamed that on the lupus and fibromyalgia.\n\nI wasn’t making a lot of progress in treatment for a few weeks. Soon, I had a meeting with my therapist at the program, my mother, and myself. I told her what I always felt deep in my heart and saying it out loud was this freeing feeling I’ve never had in my life, and I’m a sensitive individual.\n\nThis is something I thought to myself in treatment - learning to allow yourself to be 100% vulnerable is a learned skill. It takes practice, it’s a muscle that needs to be worked out. And after training making yourself vulnerable, having conversations, exploring yourself and your intentions*, you might feel exhausted. Literally every single day for two months I had a one hour drive to get to program for six hours, then drive to work for a half hour, then work for four hours, then drive home a half hour. I was so fucking exhausted every day, mentally, physically, emotionally. I’d lay my head on the steering wheel and ask him, “Do I really have to do this again tomorrow?” And he’d say “Yes, you do.”\n\nIt’s so so exhausting, whether you opt for partial outpatient, partial inpatient, full inpatient. You need to learn how to let go of control in order to gain control back if makes any sense. I’m a peaceful person and sometimes I felt myself get very angry. I’d want to just not show up every day. But I showed up. I’m the kind of person to pick up a new hobby and drop it. Dropped out of college. Walked out on fine relationships. I’m a flake. But I showed up and I worked that god damn muscle until I couldn’t anymore.\n\nSorry for writing another essay! I just don’t get to talk about this experience very much. I wish you the absolute best of luck. Remember that there are real support networks out there, ones that truly want recovery. Confide in a friend or two if you haven’t already, educate them on what this disease means to you. A lot of people I know don’t understand bulimia and think it’s simply an issue of vanity.\n\nIf you need some advice on looking into a partial inpatient centre and you’re in the US feel free to pm me.",
          "created_utc": 1552986227.0
        },
        {
          "id": "eivsaz8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1553007920.0
        }
      ]
    },
    {
      "id": "ej0rnsr",
      "author": "Grusinskaya",
      "body": "I'm in the UK, and here it is possible to still get free dentistry on the NHS. I'm just honestly too scared to go,at least until something disastrous...! Crazy you guys have to pay up front though. I thought your hospital bills looked bad enough :(",
      "created_utc": 1553150314.0,
      "score": 1,
      "context": [
        {
          "id": "eium82u",
          "author": "audreyzoesch",
          "body": "The teeth thing is what’s really stuck with me in terms of recovery... you can’t ever get your teeth back",
          "created_utc": 1552962945.0
        },
        {
          "id": "eivbvir",
          "author": "Grusinskaya",
          "body": "I'm almost 39 and haven't engaged in active bulimia i.e. binge/purge for so so long, 20 years or so. Slowly, over those years, my back teeth have partially cracked and fallen out, one is dead due to an abscess at age 23, only now are my front teeth beginning to show signs of developing tiny cracks and holes. I'm afraid to smile properly and that my front visible teeth will crack or shatter soon. I thought I'd got lucky with my teeth at the time, but the weakness that binging and vomiting caused was slow to show up I guess. It's crappy  to put it mildly, to have this also to worry about when you're going grey and feeling your 30s slipping away! Like the poem says, I wish I'd looked after me teeth.",
          "created_utc": 1552994822.0
        },
        {
          "id": "eizcau0",
          "author": "h0wl-at-the-m00n",
          "body": "I feel you there. It really sucks. It’s almost criminal how expensive dental work is in the US. It’s not like a doctors bill you can pay later. You have to pay up front. I’ve never even had $6,900 in my bank account at once...",
          "created_utc": 1553110390.0
        }
      ]
    }
  ]
}