{
  "id": "bkcv6e",
  "subreddit": "bulimia",
  "author": "four_leaf_4",
  "created_utc": 1556914099.0,
  "title": "Bulimia eroded my teeth. Finally reclaimed myself and got my smile back.",
  "selftext": "",
  "url": "https://i.redd.it/vyclzt5gz1w21.jpg",
  "score": 110,
  "num_comments": 32,
  "comments": [
    {
      "id": "emfuf1c",
      "author": "kookyiddo",
      "body": "What kind of process was this to get them fixed? Not that your before picture looks bad, as you have very nice teeth, but mine look very similar to your “before” and I haven’t been to the dentist lately in fear of finding out damage was caused.",
      "created_utc": 1556917267.0,
      "score": 22,
      "context": []
    },
    {
      "id": "emg1vta",
      "author": "drippycup",
      "body": "I'm sorry, but may I ask how long you struggled with bulimia? I know I used to have really nice teeth.. but it's been a long long while now. Somehow my teeth are a part of my dysmorphia and idk what they look like anymore, I dont think your before set is bad bad, but you can def see a ton of progress. I dont want to have to ever have a before if that makes sense",
      "created_utc": 1556922785.0,
      "score": 11,
      "context": []
    },
    {
      "id": "emfx1vw",
      "author": "c4553y",
      "body": "you should post this on r/progresspics !",
      "created_utc": 1556919179.0,
      "score": 9,
      "context": []
    },
    {
      "id": "emgc0wa",
      "author": "None",
      "body": "How much did this cost?",
      "created_utc": 1556931171.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emg7sv9",
      "author": "None",
      "body": "Congratulations!! They look incredible 😁",
      "created_utc": 1556927551.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emgou1s",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1556942711.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k1ivejx",
      "author": "Bath-Huge",
      "body": "Hello, I would love an update on your current situation if you don't mind. I'm going to see a dentist in a week and probably need a lot of work done..but I want to know if crowns or bonding would be better. My teeth are chipping after abusing my body for so long.",
      "created_utc": 1695272257.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k3dj5ho",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1696385982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emgtwet",
      "author": "audreyzoesch",
      "body": "How much did this cost? Did your insurance help?",
      "created_utc": 1556948477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emidxba",
      "author": "None",
      "body": "Beautiful, I am so jealous",
      "created_utc": 1556999562.0,
      "score": 2,
      "context": []
    },
    {
      "id": "en34nsk",
      "author": "KingCalcifer",
      "body": "How did you recover? I am so lost.",
      "created_utc": 1557547107.0,
      "score": 2,
      "context": []
    },
    {
      "id": "enppxn8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1557979385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jz9kome",
      "author": "carbonphootprint",
      "body": "I wanted to ask whether if you did this for yourself or was it required to protect your teeth?",
      "created_utc": 1693936816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhis4a8",
      "author": "dandelionveins333",
      "body": "Thank you so much, OP, for this post! What a nice set you’ve got! I admire your strength and transparency. Seeing this, I’m realizing that I have hope for smiling again. \n\nI’m starting the process of getting crowns this week. As much as I never want my teeth photographed, you’ve inspired me, I’m going to take a before shot of them so I can do what you’ve done and post a before and after. So maybe I can help someone like you’ve helped me. \n \nI don’t know if you’re still responding to comments, but did you provide your dentist with photos of what your teeth used to look like? (Anything will be better than what I have left, just wondering because I used to have quite long front teeth and was actually fond of their former shape.)\n\nAlso, did your front teeth have sensitivity from the enamel erosion? If so, do the crowns help cut down that sensitivity?",
      "created_utc": 1723337779.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emj0umr",
      "author": "four_leaf_4",
      "body": "It took about 5 months of work to fix everything. Had to repair pretty much every tooth because my mouth was so severely eroded. Lots of fillings etc. The crowns on my four front teeth took about 2.5 weeks. It sounds super scary, but they file your teeth down and place porcelain caps (crowns) over what's left of your teeth. The first appointment where they intially file down your teeth, they put temporary teeth on and you wait 2 weeks for a lab to make your porcelain set. The temporary teeth look super natural and you honestly can't tell. I had so much fear of the whole process. I think it's super important to find a dentist you feel comfortable with.",
      "created_utc": 1557015799.0,
      "score": 8,
      "context": [
        {
          "id": "emfuf1c",
          "author": "kookyiddo",
          "body": "What kind of process was this to get them fixed? Not that your before picture looks bad, as you have very nice teeth, but mine look very similar to your “before” and I haven’t been to the dentist lately in fear of finding out damage was caused.",
          "created_utc": 1556917267.0
        }
      ]
    },
    {
      "id": "emg0h28",
      "author": "None",
      "body": "Looks like they got crowns on the top.",
      "created_utc": 1556921709.0,
      "score": 3,
      "context": [
        {
          "id": "emfuf1c",
          "author": "kookyiddo",
          "body": "What kind of process was this to get them fixed? Not that your before picture looks bad, as you have very nice teeth, but mine look very similar to your “before” and I haven’t been to the dentist lately in fear of finding out damage was caused.",
          "created_utc": 1556917267.0
        }
      ]
    },
    {
      "id": "emj00s9",
      "author": "four_leaf_4",
      "body": "No need to be sorry. I've fought Bulimia for 8 years. A lot of people told me they never noticed how bad my teeth were but for me this was something I needed to do to heal. My teeth were a constant reminder of my bulimia. Kind of like a scar on my face- leaving me selfconscious and vulnerable all the time.Not only that they were super painful and I honestly couldn't eat just from the pain they caused. Ultimately you have to do what feels best for you and your health.",
      "created_utc": 1557015089.0,
      "score": 7,
      "context": [
        {
          "id": "emg1vta",
          "author": "drippycup",
          "body": "I'm sorry, but may I ask how long you struggled with bulimia? I know I used to have really nice teeth.. but it's been a long long while now. Somehow my teeth are a part of my dysmorphia and idk what they look like anymore, I dont think your before set is bad bad, but you can def see a ton of progress. I dont want to have to ever have a before if that makes sense",
          "created_utc": 1556922785.0
        }
      ]
    },
    {
      "id": "emiznpq",
      "author": "four_leaf_4",
      "body": "I got four crowns on the front which was $5000.00. I had a lot of other work in the process as well. Ultimately it was around $8000",
      "created_utc": 1557014784.0,
      "score": 2,
      "context": [
        {
          "id": "emgc0wa",
          "author": "None",
          "body": "How much did this cost?",
          "created_utc": 1556931171.0
        }
      ]
    },
    {
      "id": "emizl4e",
      "author": "four_leaf_4",
      "body": "Thank you so much!",
      "created_utc": 1557014726.0,
      "score": 1,
      "context": [
        {
          "id": "emg7sv9",
          "author": "None",
          "body": "Congratulations!! They look incredible 😁",
          "created_utc": 1556927551.0
        }
      ]
    },
    {
      "id": "emizkjz",
      "author": "four_leaf_4",
      "body": "I just turned 25 and this is what 8 years of Bulimia did to my teeth. I've recovered in the last year and this was so healing for me. I wish you all the love and healing. You do deserve it. ❤️",
      "created_utc": 1557014713.0,
      "score": 2,
      "context": [
        {
          "id": "emgou1s",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1556942711.0
        }
      ]
    },
    {
      "id": "k1sxf4m",
      "author": "four_leaf_4",
      "body": "Don’t mind at all. I’m doing wonderfully. Just had my first child which I never woulda thought could have been possible years ago. My teeth I am still not the best at taking care of but the sensitivity/pain has subsided. I had quite a bit of cavity’s I had filled + the four crowns in the front. If you find a dentist your comfortable with, follow their guidance. This was considered a cosmetic procedure, but my dentist wrote a letter to my insurance explaining that this was more then cosmetic and it did help with some of the cost. It’s been such a huge weight lifted off me. I hardly think of it anymore. Sometimes people compliment on my teeth now and I just own it and say thank you I paid for them. Lol. as scary as it is owning it, I have found strength in it. Best of luck. Go easy on yourself and remember this won’t be the first time your dentist has worked with someone with damaged teeth due to our life choices or circumstances. You. Got. This.",
      "created_utc": 1695436226.0,
      "score": 2,
      "context": [
        {
          "id": "k1ivejx",
          "author": "Bath-Huge",
          "body": "Hello, I would love an update on your current situation if you don't mind. I'm going to see a dentist in a week and probably need a lot of work done..but I want to know if crowns or bonding would be better. My teeth are chipping after abusing my body for so long.",
          "created_utc": 1695272257.0
        }
      ]
    },
    {
      "id": "k3hdl9v",
      "author": "four_leaf_4",
      "body": "Yes, I’d say they look as good as the day I got them. If I’m being real and honest. I have had a few relapses since having them too. Nothing like before. Just a few episodes. I also am not the best with oral hygiene. I know eventually they will have to get redone with age tho. My mother who’s in her 60’s has crowns and she’s never got them redone and you can tell 🫤",
      "created_utc": 1696452317.0,
      "score": 2,
      "context": [
        {
          "id": "k3dj5ho",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1696385982.0
        }
      ]
    },
    {
      "id": "emizap0",
      "author": "four_leaf_4",
      "body": "For just the crowns it was $5000. My insurance didn't help because this was considered cosmetic. I don't have the best insurance - and the dentist I went to took my insurance but they were technically \"out of network\". It was super important for me to find a dentist I was comfortable with and this dentist was above and beyond what I could have ever hoped for so the extra money I had to pay was worth it for me.  I all in all- in a span of  5 months spent an estimated $8000 to fix everything. I had severe enamel erosion - practically every tooth in my mouth needed work.",
      "created_utc": 1557014488.0,
      "score": 2,
      "context": [
        {
          "id": "emgtwet",
          "author": "audreyzoesch",
          "body": "How much did this cost? Did your insurance help?",
          "created_utc": 1556948477.0
        }
      ]
    },
    {
      "id": "emizck3",
      "author": "four_leaf_4",
      "body": "Thank you so much. It's been really healing for me ❤️",
      "created_utc": 1557014532.0,
      "score": 1,
      "context": [
        {
          "id": "emidxba",
          "author": "None",
          "body": "Beautiful, I am so jealous",
          "created_utc": 1556999562.0
        }
      ]
    },
    {
      "id": "enrekx1",
      "author": "four_leaf_4",
      "body": "Honestly, I have been through treatment programs and lots of therapy and it never helped me. Within the last 4 years I moved out of my (dysfunctional)parents house, left my abusive boyfriend, made friends who got me out and did fun things, got medicated, got a dog and went vegan. All of this helped me to slowly gain a little more control until I was able to finally curb all my desires to binge and purge. (This is all put in simple terms, but trust me it has been anything but simple) I think it's different for everyone and in my time in treatment when they would tell me there was only one way to recover, and it was there way- it became a challenge. Little steps build up, even through the haze of your ED , you know yourself best and what you need. My heart is with you. As cliche as it is to say, I know if I can do it-then anyone can.",
      "created_utc": 1558013610.0,
      "score": 2,
      "context": [
        {
          "id": "en34nsk",
          "author": "KingCalcifer",
          "body": "How did you recover? I am so lost.",
          "created_utc": 1557547107.0
        }
      ]
    },
    {
      "id": "enrr9s7",
      "author": "four_leaf_4",
      "body": "Thank you so much. It's crazy. I felt going to the dentist was the hardest step in my recovery. Other then people in my immediate family-no one knew about my battle with Bulimia. I had to ask for a quite a bit of work off to get all this done ( My boss is my best friend). I couldn't come up with an excuse or a lie this time. I had to tell her the truth. Same with my current boyfriend. It was gonna take a lot of time and money + the change in my appearance. I couldn't run from it anymore...Once I was able to be vunerable with the closest people to me, It lifted so much off my shoulders. Nobody judged me, thought I was gross or all the things I had been fearful of for so long -Same with the dentist, they aren't there to judge or criticize you. They are there to help you. Realizing that was very healing.",
      "created_utc": 1558019130.0,
      "score": 1,
      "context": [
        {
          "id": "enppxn8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1557979385.0
        }
      ]
    },
    {
      "id": "lhjprdk",
      "author": "four_leaf_4",
      "body": "I appreciate this. Ya know….it’s crazy to think about how I never allowed myself to smile. Not something I ever think about anymore. It becomes your normal so fast. These are just my teeth now. It took some mental training at first, allowing myself to smile after hiding it for so long. Then having this done, I became so self conscious that everyone would notice I had “fake teeth”. I only told the closest to me. They were supportive and honestly didn’t treat me any different or make much comment. So wild what we can do to ourselves in our heads. No one has ever noticed. Other then on occasion someone is kind and says I have a pretty smile. \n\nI’m super excited for you and your future freedom. It really was a huge milestone for me in my journey of self care and acceptance. This is HUGE. What some people do as a simple cosmetic procedure-some of us are doing for much deeper reasons. The fears that comes along with that, facing your demons, owning our shit…is so hard. I commend you. You are BRAVE. Hopefully soon you’ll be smiling all the time and never thinking twice about it again. \n\nI say I appreciate this, because if I am being transparent like I was when I posted this…..this last week is the first time I have purged in years. I feel low and icky. I won’t allow myself to fall back into the depths of this horrid addiction and disease, but it’s a wake up call for me and where I am at in my life at the moment. So thank you for saying this. It’s hard to even allow ourselves to think we could inspire someone for the better. But that’s why I wanted to share this at that time. To speak to a women, girl, man, boy, whoever…..Right now to my past self..just wanting to be that person for others to find hope in. \n\nFor your questions…I took tons of pictures for myself during the process. You will go through stages with it, as I hope they have explained to you. (The temporaries.) These pictures were actually pictures my dentist took and gave me. I was blessed with a beyond supportive dentist, who gifted me these photos. She actually took a lot of professional photos. (With my consent.) for her to use and share as well. I did not provide any pictures of my teeth before the damage. This was all her work. I’d have faith in whoever your seeing. Dentist know what there doing when it comes to jaw+teeth shape, our bites/alignments. I think sharing your fears, wants, etc. are going to be important. I did ask for a more natural look when they asked me questions…I didn’t do any teeth whitening, and asked that they just match the rest of my teeth. I don’t think there is anything wrong with bringing in a former picture of your teeth tho. You are your only advocate. Your investing your time, money, and spirit into this.\n\nLastly, yes it has helped with sensitivity immensely. That was 50% of the reason I went in to do this. Eating, and more so drinking liquids was becoming unbearable. My teeth and mouth would throb all day long. I don’t have any of those sensations/pain anymore. Sometimes I question now if I have cavities in my back molars but that’s just from my own personal neglect 🤦‍♀️\n \nThanks again! Sorry for the story book response. Lol. Best of luck and love to you my friend. ❤️",
      "created_utc": 1723353260.0,
      "score": 1,
      "context": [
        {
          "id": "lhis4a8",
          "author": "dandelionveins333",
          "body": "Thank you so much, OP, for this post! What a nice set you’ve got! I admire your strength and transparency. Seeing this, I’m realizing that I have hope for smiling again. \n\nI’m starting the process of getting crowns this week. As much as I never want my teeth photographed, you’ve inspired me, I’m going to take a before shot of them so I can do what you’ve done and post a before and after. So maybe I can help someone like you’ve helped me. \n \nI don’t know if you’re still responding to comments, but did you provide your dentist with photos of what your teeth used to look like? (Anything will be better than what I have left, just wondering because I used to have quite long front teeth and was actually fond of their former shape.)\n\nAlso, did your front teeth have sensitivity from the enamel erosion? If so, do the crowns help cut down that sensitivity?",
          "created_utc": 1723337779.0
        }
      ]
    },
    {
      "id": "emj36cr",
      "author": "kookyiddo",
      "body": "Thank you so much for the response!",
      "created_utc": 1557017768.0,
      "score": 3,
      "context": [
        {
          "id": "emfuf1c",
          "author": "kookyiddo",
          "body": "What kind of process was this to get them fixed? Not that your before picture looks bad, as you have very nice teeth, but mine look very similar to your “before” and I haven’t been to the dentist lately in fear of finding out damage was caused.",
          "created_utc": 1556917267.0
        },
        {
          "id": "emj0umr",
          "author": "four_leaf_4",
          "body": "It took about 5 months of work to fix everything. Had to repair pretty much every tooth because my mouth was so severely eroded. Lots of fillings etc. The crowns on my four front teeth took about 2.5 weeks. It sounds super scary, but they file your teeth down and place porcelain caps (crowns) over what's left of your teeth. The first appointment where they intially file down your teeth, they put temporary teeth on and you wait 2 weeks for a lab to make your porcelain set. The temporary teeth look super natural and you honestly can't tell. I had so much fear of the whole process. I think it's super important to find a dentist you feel comfortable with.",
          "created_utc": 1557015799.0
        }
      ]
    },
    {
      "id": "jlrsh5n",
      "author": "shedontknowwho",
      "body": "where did you your work done if you mind me asking",
      "created_utc": 1685150632.0,
      "score": 2,
      "context": [
        {
          "id": "emgc0wa",
          "author": "None",
          "body": "How much did this cost?",
          "created_utc": 1556931171.0
        },
        {
          "id": "emiznpq",
          "author": "four_leaf_4",
          "body": "I got four crowns on the front which was $5000.00. I had a lot of other work in the process as well. Ultimately it was around $8000",
          "created_utc": 1557014784.0
        }
      ]
    },
    {
      "id": "jlrsggy",
      "author": "shedontknowwho",
      "body": "where did you your work done if you mind me asking",
      "created_utc": 1685150623.0,
      "score": 1,
      "context": [
        {
          "id": "emgc0wa",
          "author": "None",
          "body": "How much did this cost?",
          "created_utc": 1556931171.0
        },
        {
          "id": "emiznpq",
          "author": "four_leaf_4",
          "body": "I got four crowns on the front which was $5000.00. I had a lot of other work in the process as well. Ultimately it was around $8000",
          "created_utc": 1557014784.0
        }
      ]
    },
    {
      "id": "k6x6mq1",
      "author": "Bath-Huge",
      "body": "thank you so much! i appreicate your response! congrats on having a child! I'm still having a difficult time getting my period back :(",
      "created_utc": 1698559892.0,
      "score": 1,
      "context": [
        {
          "id": "k1ivejx",
          "author": "Bath-Huge",
          "body": "Hello, I would love an update on your current situation if you don't mind. I'm going to see a dentist in a week and probably need a lot of work done..but I want to know if crowns or bonding would be better. My teeth are chipping after abusing my body for so long.",
          "created_utc": 1695272257.0
        },
        {
          "id": "k1sxf4m",
          "author": "four_leaf_4",
          "body": "Don’t mind at all. I’m doing wonderfully. Just had my first child which I never woulda thought could have been possible years ago. My teeth I am still not the best at taking care of but the sensitivity/pain has subsided. I had quite a bit of cavity’s I had filled + the four crowns in the front. If you find a dentist your comfortable with, follow their guidance. This was considered a cosmetic procedure, but my dentist wrote a letter to my insurance explaining that this was more then cosmetic and it did help with some of the cost. It’s been such a huge weight lifted off me. I hardly think of it anymore. Sometimes people compliment on my teeth now and I just own it and say thank you I paid for them. Lol. as scary as it is owning it, I have found strength in it. Best of luck. Go easy on yourself and remember this won’t be the first time your dentist has worked with someone with damaged teeth due to our life choices or circumstances. You. Got. This.",
          "created_utc": 1695436226.0
        }
      ]
    },
    {
      "id": "enutbq3",
      "author": "KingCalcifer",
      "body": "This is so kind of you to write out.\nIf you have any other advice, I would really appreciate hearing it.\n\nMy biggest struggle right now is that I am incredibly anxious and it's the only/best thing to distract my mind for a while. It's sort term temporary relief but it's very effective...\nWhen I try to overcome urges, I can go nearly 24 hours and then my mind is screaming and I'm wrought with paralysing anxiety. It's insane.\n\nThings like exercise for it are really hard to accomplish because I have such deflated energy from not getting enough nourishment too.\nIt's such a hole. ):",
      "created_utc": 1558062363.0,
      "score": 2,
      "context": [
        {
          "id": "en34nsk",
          "author": "KingCalcifer",
          "body": "How did you recover? I am so lost.",
          "created_utc": 1557547107.0
        },
        {
          "id": "enrekx1",
          "author": "four_leaf_4",
          "body": "Honestly, I have been through treatment programs and lots of therapy and it never helped me. Within the last 4 years I moved out of my (dysfunctional)parents house, left my abusive boyfriend, made friends who got me out and did fun things, got medicated, got a dog and went vegan. All of this helped me to slowly gain a little more control until I was able to finally curb all my desires to binge and purge. (This is all put in simple terms, but trust me it has been anything but simple) I think it's different for everyone and in my time in treatment when they would tell me there was only one way to recover, and it was there way- it became a challenge. Little steps build up, even through the haze of your ED , you know yourself best and what you need. My heart is with you. As cliche as it is to say, I know if I can do it-then anyone can.",
          "created_utc": 1558013610.0
        }
      ]
    },
    {
      "id": "lhs84z2",
      "author": "dandelionveins333",
      "body": "Sometimes I really really love the internet, and this is one of those times. Thank you so much for your response. I needed a good cry and being filled with hope brought it out! \n\nI’m so proud of you for responding to a relapse with determination to not fall back into the old ways. It’s the harder path to take, and I commend you for your commitment to your health! Seeing it as a wake up call is the best way to look at it, I think. It’s a hard thing to put words to, but I feel that if something makes you feel icky it means that it doesn’t align with your truth/the path you want in life; so the ick to me means that you truly know in your soul that you deserve health. I’m hoping you aren’t beating yourself up, I know relapses can feel so devastating. A day doesn’t negate all the progress made. You’re doing great. \n\nI appreciate you saying to trust the dentist. They’ve got such a wide range of knowledge that is so far out of my wheelhouse that I didn’t consider that, like… they know what they’re doing. I will be bringing up a more “natural look” and inquiring about some whitening options. (I’m realizing my brain shuts off when I go to healthcare professionals so I’ve got a list made preemptively so I don’t forget anything!) \n\nI cannot wait to smile again. I’m so glad that you are, too. And you’re right, it ain’t just cosmetic. My teeth are a daily reminder of what I put myself through. I need this to heal in a way I haven’t been able to thus far. It’s amazing what our brains can do, and I know that seeing the damage I’ve caused isn’t serving me in any fashion (I’d say it’s rather damaging). I’d done intensive therapy two years ago, and since then I’ve had b/p incidents, and it’s still absolutely a daily battle. But I’ve proved to myself that each day I have the potential to impress myself, and seizing that feels so so so much better than the old habits. The hope comes with the knowledge that I’ll be able to smile without shame, without wondering what strangers think my back story is, just the possibility of a shameless smile is so exciting! \n\nI’m once again going to shout out your bravery on helping absolutely strangers see what’s possible. You’ve contributed something invaluable to humankind by sharing your story (I’m not exaggerating, that’s what you’ve done!). And thank you for calling me brave! Keep fighting the good fight my friend, the universe has a way of taking care of the ones who help others.❤️",
      "created_utc": 1723486825.0,
      "score": 2,
      "context": [
        {
          "id": "lhis4a8",
          "author": "dandelionveins333",
          "body": "Thank you so much, OP, for this post! What a nice set you’ve got! I admire your strength and transparency. Seeing this, I’m realizing that I have hope for smiling again. \n\nI’m starting the process of getting crowns this week. As much as I never want my teeth photographed, you’ve inspired me, I’m going to take a before shot of them so I can do what you’ve done and post a before and after. So maybe I can help someone like you’ve helped me. \n \nI don’t know if you’re still responding to comments, but did you provide your dentist with photos of what your teeth used to look like? (Anything will be better than what I have left, just wondering because I used to have quite long front teeth and was actually fond of their former shape.)\n\nAlso, did your front teeth have sensitivity from the enamel erosion? If so, do the crowns help cut down that sensitivity?",
          "created_utc": 1723337779.0
        },
        {
          "id": "lhjprdk",
          "author": "four_leaf_4",
          "body": "I appreciate this. Ya know….it’s crazy to think about how I never allowed myself to smile. Not something I ever think about anymore. It becomes your normal so fast. These are just my teeth now. It took some mental training at first, allowing myself to smile after hiding it for so long. Then having this done, I became so self conscious that everyone would notice I had “fake teeth”. I only told the closest to me. They were supportive and honestly didn’t treat me any different or make much comment. So wild what we can do to ourselves in our heads. No one has ever noticed. Other then on occasion someone is kind and says I have a pretty smile. \n\nI’m super excited for you and your future freedom. It really was a huge milestone for me in my journey of self care and acceptance. This is HUGE. What some people do as a simple cosmetic procedure-some of us are doing for much deeper reasons. The fears that comes along with that, facing your demons, owning our shit…is so hard. I commend you. You are BRAVE. Hopefully soon you’ll be smiling all the time and never thinking twice about it again. \n\nI say I appreciate this, because if I am being transparent like I was when I posted this…..this last week is the first time I have purged in years. I feel low and icky. I won’t allow myself to fall back into the depths of this horrid addiction and disease, but it’s a wake up call for me and where I am at in my life at the moment. So thank you for saying this. It’s hard to even allow ourselves to think we could inspire someone for the better. But that’s why I wanted to share this at that time. To speak to a women, girl, man, boy, whoever…..Right now to my past self..just wanting to be that person for others to find hope in. \n\nFor your questions…I took tons of pictures for myself during the process. You will go through stages with it, as I hope they have explained to you. (The temporaries.) These pictures were actually pictures my dentist took and gave me. I was blessed with a beyond supportive dentist, who gifted me these photos. She actually took a lot of professional photos. (With my consent.) for her to use and share as well. I did not provide any pictures of my teeth before the damage. This was all her work. I’d have faith in whoever your seeing. Dentist know what there doing when it comes to jaw+teeth shape, our bites/alignments. I think sharing your fears, wants, etc. are going to be important. I did ask for a more natural look when they asked me questions…I didn’t do any teeth whitening, and asked that they just match the rest of my teeth. I don’t think there is anything wrong with bringing in a former picture of your teeth tho. You are your only advocate. Your investing your time, money, and spirit into this.\n\nLastly, yes it has helped with sensitivity immensely. That was 50% of the reason I went in to do this. Eating, and more so drinking liquids was becoming unbearable. My teeth and mouth would throb all day long. I don’t have any of those sensations/pain anymore. Sometimes I question now if I have cavities in my back molars but that’s just from my own personal neglect 🤦‍♀️\n \nThanks again! Sorry for the story book response. Lol. Best of luck and love to you my friend. ❤️",
          "created_utc": 1723353260.0
        }
      ]
    },
    {
      "id": "jlugm0s",
      "author": "four_leaf_4",
      "body": "Not at all. It was done by a family ran dentist in my smaller rural town in Oregon. They are amazing.",
      "created_utc": 1685209055.0,
      "score": 1,
      "context": [
        {
          "id": "emgc0wa",
          "author": "None",
          "body": "How much did this cost?",
          "created_utc": 1556931171.0
        },
        {
          "id": "emiznpq",
          "author": "four_leaf_4",
          "body": "I got four crowns on the front which was $5000.00. I had a lot of other work in the process as well. Ultimately it was around $8000",
          "created_utc": 1557014784.0
        },
        {
          "id": "jlrsh5n",
          "author": "shedontknowwho",
          "body": "where did you your work done if you mind me asking",
          "created_utc": 1685150632.0
        }
      ]
    },
    {
      "id": "enynapo",
      "author": "four_leaf_4",
      "body": "Not a problem at all. It's a very isolated lonely place to be. Wish I had knew about Reddit back then. A community of people who understand what it's like to go through this is such a gift to find. Thanks for sharing also! \n\nI totally can relate to those feelings. When I would try substaine from the pinge-burge cycle my skin would litterly crawl and itch. I think there is a lot of similarly to it and the brain of an addict. \n\nI think it's important to give yourself a lot of grace. If you can make it 24hrs that is something to be proud of in itself. Try to identify your triggers and if you can break through to yourself in the moments when the urge is taking over - ask yourself what is the reason behind this urge, in this moment. Try to distract yourself, leave where your at, go for a walk, take a drive and listen to some music. I could never trust myself to be alone, so I had to make a point to be around people or else I would engage in the cycle. \n\nI don't know how you feel about medications (took me a long time to accept I needed them) or if you struggle with depression, but something that has helped immensely is switching over to an SNRI as apposed to an SSRI. I didn't realize how severely my anxiety effected my life until I got on the medication I'm on now. SNRI's help balance people with Anxiety disorders as well as depression. You can go to a general practitioner and tell them what you are mentally experiencing ( you don't have to share your struggle with eating if your not ready) and they can help you or refer you out. \n\nAs I mentioned, I think Bulimia has a lot of associate with addiction. You litterly have to rewire your brain, break your patterns. They say it takes about 2 months for a behavior to become automatic. Don't beat yourself up if you go a couple days and then give in. Every moment you give yourself the care you deserve is a victory. Lots of love and lots of grace. ❤️",
      "created_utc": 1558131971.0,
      "score": 1,
      "context": [
        {
          "id": "en34nsk",
          "author": "KingCalcifer",
          "body": "How did you recover? I am so lost.",
          "created_utc": 1557547107.0
        },
        {
          "id": "enrekx1",
          "author": "four_leaf_4",
          "body": "Honestly, I have been through treatment programs and lots of therapy and it never helped me. Within the last 4 years I moved out of my (dysfunctional)parents house, left my abusive boyfriend, made friends who got me out and did fun things, got medicated, got a dog and went vegan. All of this helped me to slowly gain a little more control until I was able to finally curb all my desires to binge and purge. (This is all put in simple terms, but trust me it has been anything but simple) I think it's different for everyone and in my time in treatment when they would tell me there was only one way to recover, and it was there way- it became a challenge. Little steps build up, even through the haze of your ED , you know yourself best and what you need. My heart is with you. As cliche as it is to say, I know if I can do it-then anyone can.",
          "created_utc": 1558013610.0
        },
        {
          "id": "enutbq3",
          "author": "KingCalcifer",
          "body": "This is so kind of you to write out.\nIf you have any other advice, I would really appreciate hearing it.\n\nMy biggest struggle right now is that I am incredibly anxious and it's the only/best thing to distract my mind for a while. It's sort term temporary relief but it's very effective...\nWhen I try to overcome urges, I can go nearly 24 hours and then my mind is screaming and I'm wrought with paralysing anxiety. It's insane.\n\nThings like exercise for it are really hard to accomplish because I have such deflated energy from not getting enough nourishment too.\nIt's such a hole. ):",
          "created_utc": 1558062363.0
        }
      ]
    }
  ]
}