{
  "id": "bxzlap",
  "subreddit": "bulimia",
  "author": "willifreemyself",
  "created_utc": 1559940206.0,
  "title": "Recovery Day 126",
  "selftext": "",
  "url": "https://i.redd.it/08z58jglxz231.jpg",
  "score": 71,
  "num_comments": 20,
  "comments": [
    {
      "id": "eqb1wpt",
      "author": "None",
      "body": "I’m actively in therapy,  but managing my ED thoughts is so much harder when my body is bloated and I’m prone to moodiness. If you ever felt that way, how did you learn to deal with it?",
      "created_utc": 1559943726.0,
      "score": 8,
      "context": []
    },
    {
      "id": "eqazpke",
      "author": "None",
      "body": "How",
      "created_utc": 1559942750.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eqbxtn6",
      "author": "RoastPotatoesPls",
      "body": "Hi, congratulations on your progress so far. You’re a much needed light of hope in the realm of this sink hole of a disorder.\n\n\nIt’s been known that recovering from Bulimia can be next to impossible to recover from by yourself, for most people who suffer at least. Assuming you got some support in your recovery so far, how did you cope with the inevitable periods when you were alone with your thoughts? What were the steps you took yourself to ensure you didn’t relapse once you were out of the eyes of your support networks?\n\n\nThis is something that always trips me up when I am trying to recover. Being socially exhausted and feeling anxious and falling back into the cycle as a means of muffling",
      "created_utc": 1559958612.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eqbkrg2",
      "author": "None",
      "body": "You are wonderful! Congrats on making it this far in recovery, you're doing amazing ❤",
      "created_utc": 1559950698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eqbz5mf",
      "author": "None",
      "body": "Damn, you're so strong. I couldn't make it to 7 days 😭 best of luck for your recovery! And thank you for sharing, that must inspire some of us here :)",
      "created_utc": 1559959335.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eqc38n0",
      "author": "Katyakar1",
      "body": "You’re amazing and very inspiring. I actually read back through your history yesterday and was wondering how you’re going, glad to see you crushing it!\n\nAlso, your eyebrow shape is goals",
      "created_utc": 1559961434.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eqbxa3e",
      "author": "liketobeyou",
      "body": "amazing job!! did you ever struggle with feeling “sick enough”? if so, how did you overcome it? i’m so proud of you ♥️",
      "created_utc": 1559958333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqdd1xp",
      "author": "Maddiesin",
      "body": "Hey <3 I've been bulimic for 5 years with almost zero days without binging and purging more than 3 times a day. This shit has destroyed my life, made me forget who I used to be. I've had a lot of mental health issues before and have a BPD diagnosis but bulimia is by far the worst thing I have ever had to go through. My first attempt at a stationary Ed Programm failed and after 5 months I got even worse. Now I'm in one of the best clinics in Germany, waited half a year for this. I've been here for two weeks and really, the amount of food you have to eat here is just so so much.. I'm a little underweight (17.00 bmi) and need to get back to a bmi of 20.00... That's scary enough. But my body is so used to just getting all the food out again, I can't stop throwing up after every meal and this leads to me going back tk the supermarket buying more food. Binging. Purging... And this vicious cycle just doesn't want to end.. Not even here. It's like I lost my motivation. Before I for here I really wanted to make it and get better so much... But the good and the weight gain scare me so, so much... And this feeling of pleasure at the beginning kd a binge... Idk how to do this. How to Pick of the threads of the life I used to live before food was all my life was about. I don't know how to get myself back again. I'm very proud and happy for you. You're strong. I hope I can be too one dY..",
      "created_utc": 1559987333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqeq9x9",
      "author": "pudgypidgey11",
      "body": "You look beautiful, your skin has a healthy glow and complexion, and you're amazing. Be proud every day that you're one day closer to freedom.",
      "created_utc": 1560007866.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqeylf2",
      "author": "None",
      "body": "r/humansbeingbros",
      "created_utc": 1560012017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er2xw7l",
      "author": "who_cares-not_me-83",
      "body": "Since I started with b/p cycles I've only gained weight. Is it easier to loose it again after you stop and start recovering? I'm afraid I'll stay fat even after that.",
      "created_utc": 1560451925.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er3aqhb",
      "author": "willifreemyself",
      "body": "This is something is still struggle with a bit , too. What I do is. Except it and move on. There are more important things in life than your bloated belly, right? No one cares about it anyways. :D like thats the ironic thing about it. If I had a bloated belly right now, would you judge me for it. Would you make me feel shit about it and tell me I wasn't worth being loved because of it. Treat yourself like the person youre responsible for helping.",
      "created_utc": 1560459275.0,
      "score": 1,
      "context": [
        {
          "id": "eqb1wpt",
          "author": "None",
          "body": "I’m actively in therapy,  but managing my ED thoughts is so much harder when my body is bloated and I’m prone to moodiness. If you ever felt that way, how did you learn to deal with it?",
          "created_utc": 1559943726.0
        }
      ]
    },
    {
      "id": "eqe33ut",
      "author": "None",
      "body": "This is also my question",
      "created_utc": 1559998674.0,
      "score": 3,
      "context": [
        {
          "id": "eqazpke",
          "author": "None",
          "body": "How",
          "created_utc": 1559942750.0
        }
      ]
    },
    {
      "id": "er3aa74",
      "author": "willifreemyself",
      "body": "Just keep eating. Literally. Built yourself an army around you. The hardest and most depressing conversation (and it was a necessary one) was that bulimia would slowly but surely make my life miserable and that even if the weight came on, it wouldn't matter because my mind was healed. (and yes I gained a few pounds and no i did not keep gaining weight til sheer obesity like I thought I was going too)  Being skinny isn't something special or something worth achieving.  your'e not some like mythical,  fragile little thing that needs to be protected. Youre lost. And desperate. (at least I was)  Find the underlying issue and also stop the compulsion to binge by eating 3 meals and 3 snacks a day (this is in no way ment to be a strict rule, just a reminder that the worst thing after a binge is to make up for it as u prob already know, and it keeps u in the cycle forever and ever) I know how scary weight gain is during the first months but through my recovery I opened up to so many people in terms of life struggles, love, desires, dreams, passions I have,  things I would have never been able to share because I was to ashamed when I was bulimic. I could feel coming back to life, I would interact with people in such a different way. \n\nIm not religious but:\n\nIm beautiful in my way \nCause god makes no mistakes\nIm on the right track baby\nI was born this way",
      "created_utc": 1560459013.0,
      "score": 2,
      "context": [
        {
          "id": "eqazpke",
          "author": "None",
          "body": "How",
          "created_utc": 1559942750.0
        }
      ]
    },
    {
      "id": "er3bx45",
      "author": "willifreemyself",
      "body": "I did recover on my own and it was absolute shit but I had to do it. I only suffered for maybe half a year but I grew up with intense dieting since I was 12. I cannot tell you how many moments I had when I literally thought this life is not worth living, how do I unfuck everything. To be honest, once I opened up to people and I went to a few group meetings It all sort of became a little bit easier. Find yourself a \"recover buddy\" that you can cry amd bitch with during the process so you dont feel so damn alone.  I wish words could describe this relentless cold pain that bulimia is once you realize you were coping to get through something else. And I wish there was a way to put feelings I felt into words. But I can't, it's too damn complicated and profound. Be patient, be bloated and be accepting and kind to yourself. Even though you might not see it now, I care and love you for even being interested in getting to start recovery, and so should you. As a human being, you know :)",
      "created_utc": 1560459969.0,
      "score": 1,
      "context": [
        {
          "id": "eqbxtn6",
          "author": "RoastPotatoesPls",
          "body": "Hi, congratulations on your progress so far. You’re a much needed light of hope in the realm of this sink hole of a disorder.\n\n\nIt’s been known that recovering from Bulimia can be next to impossible to recover from by yourself, for most people who suffer at least. Assuming you got some support in your recovery so far, how did you cope with the inevitable periods when you were alone with your thoughts? What were the steps you took yourself to ensure you didn’t relapse once you were out of the eyes of your support networks?\n\n\nThis is something that always trips me up when I am trying to recover. Being socially exhausted and feeling anxious and falling back into the cycle as a means of muffling",
          "created_utc": 1559958612.0
        }
      ]
    },
    {
      "id": "er3f229",
      "author": "willifreemyself",
      "body": "Thank you I really appreciate it ^^",
      "created_utc": 1560461864.0,
      "score": 1,
      "context": [
        {
          "id": "eqbkrg2",
          "author": "None",
          "body": "You are wonderful! Congrats on making it this far in recovery, you're doing amazing ❤",
          "created_utc": 1559950698.0
        }
      ]
    },
    {
      "id": "er3cifh",
      "author": "willifreemyself",
      "body": "Yes I had plenty of times where I would make it til day 7 or even 10 and relapse. You gotta have that click moment, that makes you realize how necessary recovery is. You have to not be afraid of eating thousands and thousands of calories and not throw them up but keep them in your body, so you don't feel this psycholgical dependency to binge. Dont be afraid of the weight gain, you are perfect the way you are :) even though bulimia wouldn't allow you to think that way.",
      "created_utc": 1560460304.0,
      "score": 1,
      "context": [
        {
          "id": "eqbz5mf",
          "author": "None",
          "body": "Damn, you're so strong. I couldn't make it to 7 days 😭 best of luck for your recovery! And thank you for sharing, that must inspire some of us here :)",
          "created_utc": 1559959335.0
        }
      ]
    },
    {
      "id": "er3eux9",
      "author": "willifreemyself",
      "body": "No, I knew I was sick enough. Because I knew life without bulimia and for some reason I knew no matter how \"sick\" someone is, it is not worth it.",
      "created_utc": 1560461746.0,
      "score": 2,
      "context": [
        {
          "id": "eqbxa3e",
          "author": "liketobeyou",
          "body": "amazing job!! did you ever struggle with feeling “sick enough”? if so, how did you overcome it? i’m so proud of you ♥️",
          "created_utc": 1559958333.0
        }
      ]
    },
    {
      "id": "er3ed33",
      "author": "willifreemyself",
      "body": "Hey, don't ever think you cannot make it because of how often you binge or how long youve been suffering. You will get better and deserve to get better. Youre in a clinic now and that's good! (hey, im actually from Germany :D) I have this overwhelming empathy for you right now, and it really sucks that I cant just be like \"yeah just stop throwing up\". It does not matter how well a clinic is programmed, because do you know who ultimately decides whether or not you start getting your life back together? YOU. and you only. I know this will blow your mind now, but I dont know how much I weight, I don't know how many calories I eat or how much I exercised. My BMI is probably well over 20. And you know what. My life is incomparable to how I felt when I was a little bit thinner and bulimic. Find yourself a personal support, people you truly truly enjoy spending time with that you can open up about.  The vicious circle start as soon as you get rid of the calories. Starving / binging is not something seperate, it is two halfs of one. You are more than your body, like legit I mean it. Food is food and emotions are emotions. On a good ending: The positive effect, this feeling as if life is \"slowly starting to get back to you\" is a reward that usually comes early in recovery and you will experience that too :)",
      "created_utc": 1560461447.0,
      "score": 1,
      "context": [
        {
          "id": "eqdd1xp",
          "author": "Maddiesin",
          "body": "Hey <3 I've been bulimic for 5 years with almost zero days without binging and purging more than 3 times a day. This shit has destroyed my life, made me forget who I used to be. I've had a lot of mental health issues before and have a BPD diagnosis but bulimia is by far the worst thing I have ever had to go through. My first attempt at a stationary Ed Programm failed and after 5 months I got even worse. Now I'm in one of the best clinics in Germany, waited half a year for this. I've been here for two weeks and really, the amount of food you have to eat here is just so so much.. I'm a little underweight (17.00 bmi) and need to get back to a bmi of 20.00... That's scary enough. But my body is so used to just getting all the food out again, I can't stop throwing up after every meal and this leads to me going back tk the supermarket buying more food. Binging. Purging... And this vicious cycle just doesn't want to end.. Not even here. It's like I lost my motivation. Before I for here I really wanted to make it and get better so much... But the good and the weight gain scare me so, so much... And this feeling of pleasure at the beginning kd a binge... Idk how to do this. How to Pick of the threads of the life I used to live before food was all my life was about. I don't know how to get myself back again. I'm very proud and happy for you. You're strong. I hope I can be too one dY..",
          "created_utc": 1559987333.0
        }
      ]
    },
    {
      "id": "er3en7v",
      "author": "willifreemyself",
      "body": "I had the same fears, worries and anxieties. What happens during recovery, because this is a mental illness, you start to accept and love yourself more and more and more unconditionally. You prob won't lose weight but you will also not become this out of control obese person thst I thought I was gonna become. Everything balances out perfectly",
      "created_utc": 1560461618.0,
      "score": 2,
      "context": [
        {
          "id": "er2xw7l",
          "author": "who_cares-not_me-83",
          "body": "Since I started with b/p cycles I've only gained weight. Is it easier to loose it again after you stop and start recovering? I'm afraid I'll stay fat even after that.",
          "created_utc": 1560451925.0
        }
      ]
    }
  ]
}