{
  "id": "c0lyav",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1560528855.0,
  "title": "To the redditor that was 2 days purge free:",
  "selftext": "If you see this, I was looking for a day 3 update, but your posts and account were deleted; I'm guessing that means that you may have purged, and didn't make it to day 3.\n\nBut that's alright! Recovery is not linear. It's a slippery slope, and that's what makes it so difficult. It's alright to have bad days, you just have to try again. Don't be too hard on yourself.\n\nI hope that maybe you see this, and I hope you're okay. This community will here to support you whenever you come back ❤",
  "url": "https://www.reddit.com/r/bulimia/comments/c0lyav/to_the_redditor_that_was_2_days_purge_free/",
  "score": 89,
  "num_comments": 4,
  "comments": [
    {
      "id": "er661vb",
      "author": "alideb82",
      "body": "I second this!! I made it almost 10 days and then purged again 2 days ago. Almost did yesterday but took a nap instead. I had not binged but we buried my nana's ashes yesterday and then went out to lunch so I was overly emotional and overtired from being at work at 430 am before going to cemetary. Thought purging would make me feel better....turns out a 2 hr nap worked just as well. Urges are strong today but I'm trying to stay distracted.",
      "created_utc": 1560540703.0,
      "score": 14,
      "context": []
    },
    {
      "id": "er6mp7k",
      "author": "TinyLoaf",
      "body": "Absolutely! Even resisting the urge to purge once is a success; an example to show yourself that you CAN resist. I’m on my third day now. It’s so hard sometimes, and once you slip up once, you just get sucked into that awful cycle again. \n\nBut we can do it :) \n\nAs long as we acknowledge our mistakes, keep going, and recognize that we have the strength to keep trying.",
      "created_utc": 1560551371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er9e565",
      "author": "edie43",
      "body": "This is so nice. I love this sub. I second everything! If it were easy we would all be recoverd right now!",
      "created_utc": 1560622305.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er686y0",
      "author": "None",
      "body": "You can do it, stay strong! So sorry about your nana, yesterday must have been so hard, but you are strong and you can do this.",
      "created_utc": 1560542002.0,
      "score": 1,
      "context": [
        {
          "id": "er661vb",
          "author": "alideb82",
          "body": "I second this!! I made it almost 10 days and then purged again 2 days ago. Almost did yesterday but took a nap instead. I had not binged but we buried my nana's ashes yesterday and then went out to lunch so I was overly emotional and overtired from being at work at 430 am before going to cemetary. Thought purging would make me feel better....turns out a 2 hr nap worked just as well. Urges are strong today but I'm trying to stay distracted.",
          "created_utc": 1560540703.0
        }
      ]
    }
  ]
}