{
  "id": "cnfsob",
  "subreddit": "bulimia",
  "author": "kolibri22",
  "created_utc": 1565233702.0,
  "title": "Today, I talked myself out of a B/P",
  "selftext": "  \n\nToday, I talked myself out of a binge/purge (B/P). I was walking to the store with the intention of B/P, grocery bag in hand and I thought to myself, ‘you can stop this now. This is one of those moments they talk about, when you could have turned it around.’ I wasn’t immediately sure that I even wanted to stop it from happening. I thought about what it would feel like, the release as it comes back up. I could sort of feel relief but, mostly it just felt hollow. After that momentary relief would come a wave of disappointment, hopelessness and exhaustion. I thought to myself, ‘if I ever have any hope of becoming the person I want to be, who I believe I can be, I will have to stop this eventually. I either end it or it ends me.’ I went into the store and the angels on either shoulder were arguing. In one ear, “if you do this now it was your choice. You could have stopped it.” In the other ear, “Jennifer Anniston doesn’t eat burritos, fat ass. How are you going to undo this?’ And then there was only one voice, ‘you aren’t Jennifer Anniston.” So, I got a seltzer, some kombucha and some almonds to munch on and I am not going to B/P tonight. With any luck, I won’t B/P tomorrow either. I can’t say for sure that I’ll never B/P again but tonight, after 16 years of fighting, I successfully talked myself out of a B/P and I am actually pretty fuckin’ proud. It turns out this type of control feels good too. Never lose hope, my friends. \n\nI will not purge with you today.",
  "url": "https://www.reddit.com/r/bulimia/comments/cnfsob/today_i_talked_myself_out_of_a_bp/",
  "score": 65,
  "num_comments": 5,
  "comments": [
    {
      "id": "ewb88s8",
      "author": "inadaze319",
      "body": "Yaaay!!!! Congratulations!!!!!!!! Huge step forward!",
      "created_utc": 1565261416.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ewaphnw",
      "author": "aqua_rex",
      "body": "Amazing😍",
      "created_utc": 1565248825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewcq1rx",
      "author": "Firequeeeeeen",
      "body": "Wooooo!!!!! You did so well 😍",
      "created_utc": 1565288643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewhgb6g",
      "author": "None",
      "body": "Nice! Every time is a big win.",
      "created_utc": 1565407179.0,
      "score": 1,
      "context": []
    },
    {
      "id": "exi4wkv",
      "author": "wafflesuit",
      "body": "I hope to channel this thought process in the future. It's so hard!!!! But you're right. If I ever hope to be the person I want to be, I have to start some time. So why not now?",
      "created_utc": 1566321137.0,
      "score": 1,
      "context": []
    }
  ]
}