{
  "id": "d28cnt",
  "subreddit": "bulimia",
  "author": "wafflesuit",
  "created_utc": 1568126027.0,
  "title": "I don't think my therapist understands eating disorders",
  "selftext": "I was telling my therapist how I ate like a 1/4 of a sheet cake yesterday after dinner after being so good all day eating regular healthy meals. I felt so disgusted with myself for eating so much dessert and didn't want my hard work during the day to be for nothing so I threw it up. And her remark was \"why don't next time you just have one piece of cake, or have your husband serve your portion\". I wanted to laugh in her face so bad. I was also angry at this point, but trying not to show it. \n\nI told her I can't \"just have one piece\". My obsession with food is all-consuming. If I have one piece I'm just going to struggle for the rest of the evening in my head, thinking about that damn cake in the refrigerator, how I can sneak another piece or two, the feeling of eating and how it soothes my emotions, constantly thinking of wanting to binge on the cake. I can't concentrate on anything else when I'm trying to overcome am urge to binge, and 9/10 I give in because I'm so damn tired of thinking about the cake that I just eat it. \n\nIf I could eat just one piece of cake like a normal person, my problems would be solved. But it's not that easy.",
  "url": "https://www.reddit.com/r/bulimia/comments/d28cnt/i_dont_think_my_therapist_understands_eating/",
  "score": 82,
  "num_comments": 11,
  "comments": [
    {
      "id": "eztfenx",
      "author": "None",
      "body": "I agree with you. I really think that if you're committed to therapy, you deserve a therapist or team that can properly address your needs and give you the right care for them. It might be worth adding an ED specialist or an addiction therapist to your care plan. You really are worth the effort and seeing someone who doesn't truly understand what you're going through sounds so frustrating. I know they're probably still good at their job in general if you've established trust to get so far as to talk freely about your bulimia, but damn that response is just so completely unhelpful! :( I hope you can get the help you deserve!",
      "created_utc": 1568129037.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ezuox4u",
      "author": "Forrealaf",
      "body": "God damn did I write this. Nothing can stop me thinking about food I want.",
      "created_utc": 1568157575.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eztr0af",
      "author": "OtherwiseDRUNK",
      "body": "my family always act like that, im not in therapy for my ed but they be like just don't eat as much, or just control yourself, or judge every food-related thing i do as if i needed them to do so, it's just so consuming",
      "created_utc": 1568136688.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ezvodnp",
      "author": "UglyFilthyDog",
      "body": "r/thanksimcured",
      "created_utc": 1568187589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ezu15zr",
      "author": "justonium",
      "body": "Totally relate.",
      "created_utc": 1568143210.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezuuova",
      "author": "None",
      "body": "So spot on. I often think sometimes that my eating disorder is so engrained in my identity and that’s why I don’t ever want to let go. It’s all I have.",
      "created_utc": 1568161199.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eztq16d",
      "author": "Stellaeono",
      "body": "There are kind of people whom can control the intake, but there also people who can’t. I have anorexia problems, which is when I totally not eat, then I binging, means that I eat a lot. This two problems happening alternatively, and my ability of controlling changes. Depending on people though. You can try not eat at all, that’s what I do when I realize I’m binging",
      "created_utc": 1568136061.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eztguz4",
      "author": "wafflesuit",
      "body": "I really do want an ED specialist. I had one as a teenager when I was anorexic (though TBH,I didn't take therapy seriously then). But I'm moving across country in a few months so I'll see if my health Care plan will cover one after I move.",
      "created_utc": 1568130018.0,
      "score": 9,
      "context": [
        {
          "id": "eztfenx",
          "author": "None",
          "body": "I agree with you. I really think that if you're committed to therapy, you deserve a therapist or team that can properly address your needs and give you the right care for them. It might be worth adding an ED specialist or an addiction therapist to your care plan. You really are worth the effort and seeing someone who doesn't truly understand what you're going through sounds so frustrating. I know they're probably still good at their job in general if you've established trust to get so far as to talk freely about your bulimia, but damn that response is just so completely unhelpful! :( I hope you can get the help you deserve!",
          "created_utc": 1568129037.0
        }
      ]
    },
    {
      "id": "ezv8lr1",
      "author": "TAYbayybay",
      "body": "That’s like telling a diabetic “just use you pancreas for insulin”",
      "created_utc": 1568170107.0,
      "score": 4,
      "context": [
        {
          "id": "eztr0af",
          "author": "OtherwiseDRUNK",
          "body": "my family always act like that, im not in therapy for my ed but they be like just don't eat as much, or just control yourself, or judge every food-related thing i do as if i needed them to do so, it's just so consuming",
          "created_utc": 1568136688.0
        }
      ]
    },
    {
      "id": "f0fri4l",
      "author": "wafflesuit",
      "body": "I feel this way, too. I've been dealing with eating disorders since I was 13.... I'm 29 now and I don't know what it means to eat normally. To eat without worrying about calories, weighing myself every day, and thinking about food all day.",
      "created_utc": 1568588095.0,
      "score": 2,
      "context": [
        {
          "id": "ezuuova",
          "author": "None",
          "body": "So spot on. I often think sometimes that my eating disorder is so engrained in my identity and that’s why I don’t ever want to let go. It’s all I have.",
          "created_utc": 1568161199.0
        }
      ]
    },
    {
      "id": "f0g3yaf",
      "author": "None",
      "body": "I started when I was 13 too. Now in my early 30’s... I gain weight and then suddenly I get triggered and lose weight. I had an upper gi endoscopy recently cause I was throwing up blood and now am on anti acids to help heal the erosion in my throat.",
      "created_utc": 1568593318.0,
      "score": 1,
      "context": [
        {
          "id": "ezuuova",
          "author": "None",
          "body": "So spot on. I often think sometimes that my eating disorder is so engrained in my identity and that’s why I don’t ever want to let go. It’s all I have.",
          "created_utc": 1568161199.0
        },
        {
          "id": "f0fri4l",
          "author": "wafflesuit",
          "body": "I feel this way, too. I've been dealing with eating disorders since I was 13.... I'm 29 now and I don't know what it means to eat normally. To eat without worrying about calories, weighing myself every day, and thinking about food all day.",
          "created_utc": 1568588095.0
        }
      ]
    }
  ]
}