{
  "id": "e1fhuf",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1574685517.0,
  "title": "FUCK BULIMIA",
  "selftext": "Seriously. Fuck you bulimia. I go through so much food. I prob eat more than those on the BED sub bc I b/p back to back for hours, into the whole night and crack of dawn. I should be 600lbs+ even fatter than ALR, but from my physical appearance people prob think I don’t eat and subsist on air and am a ~breatharian~ or whatever bullshit. I’m a fucking fraud. I hate how I’m imprisoned and controlled by food. I’m trapped in this mental, hellish prison. I b/p constantly and endlessly and basically waste the entire day going through massive quantities of food, it’s ridiculous. I feel sick. I am unwell and weak but I can’t stop. I’m driven by a compulsion almost like a ritual. In a constant dejavu loop of my own personal horror story. Idk what to do when eating is a fucking trigger like what the actual fuck. What backwards logic is this. Fuck this existence. Fuck bulimia. I am being crippled by my own insanity. My existence doesn’t make sense since the whole point of being alive is to live but I am not living. I am decaying. I am an outlier. Fuck bulimia.",
  "url": "https://www.reddit.com/r/bulimia/comments/e1fhuf/fuck_bulimia/",
  "score": 68,
  "num_comments": 1,
  "comments": [
    {
      "id": "f8q03ss",
      "author": "None",
      "body": "The hardest step is the first one. At some point in your life, your routine will become to not purge instead of purge. I swear, you can do it. You have it in yourself. You're stronger than you think, give yourself credit!\n\nBulimia is a disorder. I have a friend who knows and he asked me to explain why I do it and I barely can explain. Sometimes it's anxiety, sometimes it's depression, sometimes it's a routine, sometimes it's nothing and I do it just to feel something. But every time, I regret it. My health went downhills so fast that I had to do something about it or I would either die or lose my job (I love my job, I'd rather die tbh).\n\nTake a step towards health, try to find some support. You're not your disorder, you're not trapped, you can very well kick bulimia in the butt. Maybe that will take a long time, but it's better than what you're doing now and the moment you start making progress you'll feel better almost immediately, I can promise that. I hope something positive happen soon in your life ❤️ you'll always have our support here!",
      "created_utc": 1574710021.0,
      "score": 2,
      "context": []
    }
  ]
}