{
  "id": "eldmt4",
  "subreddit": "bulimia",
  "author": "CriticalAppointment7",
  "created_utc": 1578413883.0,
  "title": "Wife caught me purging",
  "selftext": "Follow up to a previous post. I'm in my 30s, male, and relapsing into bulimia after 12 years healthy. I've been reluctant to get any help because of the sexual side effects I got on Prozac last time I went through this.\n\nBefore I had a chance to talk to my wife about my relapse, she caught me red handed. It was late last night and I thought she was sleeping. We ended up having a huge fight. I know she was upset, but it really hurt that her first response to finding out about my issues was to shout at me. I yelled back and we both brought up a lot of old resentments. I went for a walk to cool off (and finish purging to be honest). When I came back, she apologized and started crying. I cried too, which hurt my pride, but fuck, I feel like I've been bottling up so much and it was almost a relief to finally talk about it. \n\nI really wish I had manned up and told her before she found out. Everyone who replied to me last time told me to tell her, but I was too scared and I thought I could get it together before she found out. I feel stupid for not telling her first. I think it would have been less upsetting for both of us and less humiliating for me. But we talked for a long time and I agreed to put my health first. I have an appointment with a new doctor to ask about Prozac and the sexual side effects. I also agreed to go to couple's counseling with my wife. We've both been under a lot of stress and it's hurting our marriage. It's not just my bulimia. \n\nI want to be a good husband and a good dad. I've handled this before and I'm going to get a grip on it again. I don't know if it's going to be easier or harder as an adult trying to get support from my wife as it was as a teen with my parents. But I know I have to try.",
  "url": "https://www.reddit.com/r/bulimia/comments/eldmt4/wife_caught_me_purging/",
  "score": 73,
  "num_comments": 11,
  "comments": [
    {
      "id": "fdh8hmc",
      "author": "PsychadelicSpaceCat",
      "body": "That must have been a really rough night for you, I'm so sorry. I applaud you for the way you're handling such a stressful situation! Just from the way you expressed yourself in this post, you obviously have a lot of determination to put toward recovery, and that deserves a lot of recognition. I hope your wife can come to a better understanding through couples' therapy. It must be hard for spouses. I'm also married (25F) and I know how much extra strain an ED adds into the mix. It's like fighting two battles at once...trying to recover while keeping your partnership healthy as well, not to mention being a dad. I feel you on Prozac, also. I had the same issues when I was on it. It seems like there are more options these days, so I hope your doc can find you a better fit for medication.\n\n  Reading posts like yours reminds me how hard it is for men with EDs. Allow me to say your struggle is just as valid as anyone else's. Great job getting the medical and therapy support into gear so quickly, and best wishes to you throughout recovery!",
      "created_utc": 1578417672.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fdi8v7h",
      "author": "None",
      "body": "I just want to say that I’m a man in my 30’s who has recently relapsed my bulimia. I’m married also and ended up admitting it to my wife because I felt all alone. I can’t imagine what it would have been like if she’d caught me, I’m so sorry that happened to you. All I can say is you’re not alone, this struggle is real and it isn’t a 16 year old girl problem. That’s great you two are pursuing counseling together, I understand how a stressful and complex life can strain a marriage and bring up ED issues again. I’m struggling having two young kids at home with me, but have a supportive spouse. Hopefully you can be a team together and alleviate some of the triggers.",
      "created_utc": 1578437826.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdhl32h",
      "author": "biggoldie",
      "body": "I can't imagine being caught, that sounds really awful for both of you. :(  I just wanted to say that prozac is not your only option. I was on prozac and it killed my memory so I did the DNA test and found a med that works much better for me. There are a lot of options out there, it can just take time and trial and error to find something that works for you.",
      "created_utc": 1578424930.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdholwd",
      "author": "rachihc",
      "body": "It is ok to cry, no shame, no loosing pride or anything. If you don't like Prozac, then you should say it, there are other options or just therapy.  I hope you two cam work over this, together. You can count on your wife, I know we want to try alone and spare them the problem, not only the difficult part of talking about it. But if it came to my partner, I would want to be there to help, because he should not be alone in this fight and nor should you.",
      "created_utc": 1578427046.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdifhvj",
      "author": "None",
      "body": "Feel you about the prozac. When I got out of treatment in was on 80mg of Prozac. Didn't have an orgasm for months. It was nice for the gf at the time because I could last for days.",
      "created_utc": 1578441728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdh9w2u",
      "author": "CriticalAppointment7",
      "body": "Thank you so much. I'm sure it's not any easier being a woman with bulimia, but there is definitely a stigma for men. I catch myself thinking of it as a teenage girl problem, which adds to my feelings of shame and makes it hard to talk about. \n\nI know it has to be hard for my wife, too, and she's already got a lot going on. She's finding us a marriage counselor today and I hope it can help us both.",
      "created_utc": 1578418525.0,
      "score": 10,
      "context": [
        {
          "id": "fdh8hmc",
          "author": "PsychadelicSpaceCat",
          "body": "That must have been a really rough night for you, I'm so sorry. I applaud you for the way you're handling such a stressful situation! Just from the way you expressed yourself in this post, you obviously have a lot of determination to put toward recovery, and that deserves a lot of recognition. I hope your wife can come to a better understanding through couples' therapy. It must be hard for spouses. I'm also married (25F) and I know how much extra strain an ED adds into the mix. It's like fighting two battles at once...trying to recover while keeping your partnership healthy as well, not to mention being a dad. I feel you on Prozac, also. I had the same issues when I was on it. It seems like there are more options these days, so I hope your doc can find you a better fit for medication.\n\n  Reading posts like yours reminds me how hard it is for men with EDs. Allow me to say your struggle is just as valid as anyone else's. Great job getting the medical and therapy support into gear so quickly, and best wishes to you throughout recovery!",
          "created_utc": 1578417672.0
        }
      ]
    },
    {
      "id": "fdia1z7",
      "author": "CriticalAppointment7",
      "body": "Holy shit, thank you so much. Sometimes it does feel like I'm the only grown-ass man in the world with this issue. It's always a relief to hear that's not true. Good luck to you, man. \n\nMy daughter is way too young to know what's going on, but right now she's one of my biggest motivations to get healthy again. I never want her to experience this and I'm determined to model healthy behavior for her.",
      "created_utc": 1578438447.0,
      "score": 5,
      "context": [
        {
          "id": "fdi8v7h",
          "author": "None",
          "body": "I just want to say that I’m a man in my 30’s who has recently relapsed my bulimia. I’m married also and ended up admitting it to my wife because I felt all alone. I can’t imagine what it would have been like if she’d caught me, I’m so sorry that happened to you. All I can say is you’re not alone, this struggle is real and it isn’t a 16 year old girl problem. That’s great you two are pursuing counseling together, I understand how a stressful and complex life can strain a marriage and bring up ED issues again. I’m struggling having two young kids at home with me, but have a supportive spouse. Hopefully you can be a team together and alleviate some of the triggers.",
          "created_utc": 1578437826.0
        }
      ]
    },
    {
      "id": "fdhm2j0",
      "author": "CriticalAppointment7",
      "body": "Thank you. It was awful for sure, but maybe ultimately for the best. Prozac worked so amazingly well for me last time it was my first thought, but I'll definitely look into some other options. \n\nI've heard most psych meds have some sort of effect on sexual function, so we might just have to deal with it since that was the only downside for me.",
      "created_utc": 1578425528.0,
      "score": 2,
      "context": [
        {
          "id": "fdhl32h",
          "author": "biggoldie",
          "body": "I can't imagine being caught, that sounds really awful for both of you. :(  I just wanted to say that prozac is not your only option. I was on prozac and it killed my memory so I did the DNA test and found a med that works much better for me. There are a lot of options out there, it can just take time and trial and error to find something that works for you.",
          "created_utc": 1578424930.0
        }
      ]
    },
    {
      "id": "fdhr6zn",
      "author": "CriticalAppointment7",
      "body": "You're right, and thanks for saying it. It's hard for me to show \"weakness\" by expressing my feelings, and that's been the cause of fights with my wife before. I grew up with very old fashioned and strict immigrant parents. They were quick to punish or mock me for crying as a kid, as well as bullying me for my weight which contributed heavily to my ED. I'm trying hard to shake off some of the ideas they instilled in me, especially now that I have a child of my own and don't want her to grow up in fear the way I did.\n\nBelieve it or not, I've made a lot of progress with past therapy on the problems my childhood saddled me with. It's just a lot to unpack.",
      "created_utc": 1578428574.0,
      "score": 2,
      "context": [
        {
          "id": "fdholwd",
          "author": "rachihc",
          "body": "It is ok to cry, no shame, no loosing pride or anything. If you don't like Prozac, then you should say it, there are other options or just therapy.  I hope you two cam work over this, together. You can count on your wife, I know we want to try alone and spare them the problem, not only the difficult part of talking about it. But if it came to my partner, I would want to be there to help, because he should not be alone in this fight and nor should you.",
          "created_utc": 1578427046.0
        }
      ]
    },
    {
      "id": "fdiip5r",
      "author": "CriticalAppointment7",
      "body": "Had that happen with some Adderall in college, lol. Unfortunately Prozac just made it quit altogether. No orgasms, no erections, nothing. I don't know if trying something else would be better or if I just need to suck it up and take it. It did work great and that was my only complaint.\n\nSeeing this new doc on Friday, so we'll see what he says.",
      "created_utc": 1578443798.0,
      "score": 2,
      "context": [
        {
          "id": "fdifhvj",
          "author": "None",
          "body": "Feel you about the prozac. When I got out of treatment in was on 80mg of Prozac. Didn't have an orgasm for months. It was nice for the gf at the time because I could last for days.",
          "created_utc": 1578441728.0
        }
      ]
    },
    {
      "id": "fdhrncy",
      "author": "rachihc",
      "body": "Childhood shape us, but we can improve, it is a long tough job to do so. All the best.",
      "created_utc": 1578428839.0,
      "score": 2,
      "context": [
        {
          "id": "fdholwd",
          "author": "rachihc",
          "body": "It is ok to cry, no shame, no loosing pride or anything. If you don't like Prozac, then you should say it, there are other options or just therapy.  I hope you two cam work over this, together. You can count on your wife, I know we want to try alone and spare them the problem, not only the difficult part of talking about it. But if it came to my partner, I would want to be there to help, because he should not be alone in this fight and nor should you.",
          "created_utc": 1578427046.0
        },
        {
          "id": "fdhr6zn",
          "author": "CriticalAppointment7",
          "body": "You're right, and thanks for saying it. It's hard for me to show \"weakness\" by expressing my feelings, and that's been the cause of fights with my wife before. I grew up with very old fashioned and strict immigrant parents. They were quick to punish or mock me for crying as a kid, as well as bullying me for my weight which contributed heavily to my ED. I'm trying hard to shake off some of the ideas they instilled in me, especially now that I have a child of my own and don't want her to grow up in fear the way I did.\n\nBelieve it or not, I've made a lot of progress with past therapy on the problems my childhood saddled me with. It's just a lot to unpack.",
          "created_utc": 1578428574.0
        }
      ]
    }
  ]
}