{
  "id": "f8u7u9",
  "subreddit": "bulimia",
  "author": "tumtumhurt",
  "created_utc": 1582563658.0,
  "title": "I wish food didn’t control my life :/",
  "selftext": "All I think about all day long is what I’m eating, how much I’m eating, what I could be eating, what I wish I was eating, what’s the easiest thing to throw up, why can she eat that and still be skinny, why can’t I just be skinny?",
  "url": "https://www.reddit.com/r/bulimia/comments/f8u7u9/i_wish_food_didnt_control_my_life/",
  "score": 103,
  "num_comments": 4,
  "comments": [
    {
      "id": "finqt7n",
      "author": "Vlad480",
      "body": "I was in the same case as you when I wanted to control everything in my diet, it calmed down when I understood that we could give each other little pleasure and even big pleasure as long as the food comes into  our total calories.  it allowed me to really eat everything and free myself from food, really I know it's easy to say but once it's printed in your brain you live again.  Good luck for the future :-)\n\nPs: sry for translate",
      "created_utc": 1582568430.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fip0ujy",
      "author": "aqua_rex",
      "body": "Yup... it’s relentless. Some days are worse than others for me, but it really sucks feeling consumed and pushed around by it. \n\nLike, you finish a long day of work and instead of doing errands or whatever you need to get done, you just HAVE to binge, and that has to happen before anything else. Or you planned on doing something all day, but then had an hour long B/P sesh and don’t have time to do what you intended. Or you just sit around, wasting time, contemplating/fantasizing on what your next binge sesh will be..... ugh ugh ugh. I feel your pain love </3",
      "created_utc": 1582595492.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fiouhph",
      "author": "None",
      "body": "It doesn’t go away because you achieve a goal weight, unfortunately:/ I’m also tired 😔",
      "created_utc": 1582591274.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiqrj0p",
      "author": "Kariatide",
      "body": "It is like you are describing my life :( this is really a major addiction for me. I’ve been in therapy for 8 months and I still don’t see any light at the end of the tunnel. It is so frustrating... I just wish I could have a normal relation with food and with my body :/",
      "created_utc": 1582650432.0,
      "score": 2,
      "context": [
        {
          "id": "fip0ujy",
          "author": "aqua_rex",
          "body": "Yup... it’s relentless. Some days are worse than others for me, but it really sucks feeling consumed and pushed around by it. \n\nLike, you finish a long day of work and instead of doing errands or whatever you need to get done, you just HAVE to binge, and that has to happen before anything else. Or you planned on doing something all day, but then had an hour long B/P sesh and don’t have time to do what you intended. Or you just sit around, wasting time, contemplating/fantasizing on what your next binge sesh will be..... ugh ugh ugh. I feel your pain love </3",
          "created_utc": 1582595492.0
        }
      ]
    }
  ]
}