{
  "id": "ff7sm5",
  "subreddit": "bulimia",
  "author": "ksaskkkkk4",
  "created_utc": 1583643512.0,
  "title": "i keep lying about getting better",
  "selftext": "i’ve had bulimia for a while now. My parents have caught me throwing up multiple times and they said if i do it again i’m getting kicked out, so i lied about stopping because it’s straining our family. But really it’s worse than it’s ever been. My teeth hurt so bad and i can’t get out of this cycle no matter what i do but i feel like i missed my opportunity for help because i lied when i should’ve just been completely honest the first time. They don’t think it’s that serious they think it’s just a bad relationship with my body and food, meanwhile i’ve just been getting better at covering my tracks. I feel like i’m losing my mind because i have no control over my binges and throwing up. If you’re bulimic you know the rest of it i don’t even have to explain: the guilt, being in the mirror for hours, isolating yourself, constantly thinking about food, it goes on. Do i just be honest to them even if they hate me for lying? do i just check myself into the ED clinic and leave? someone give me any type of advice please idc what it is",
  "url": "https://www.reddit.com/r/bulimia/comments/ff7sm5/i_keep_lying_about_getting_better/",
  "score": 107,
  "num_comments": 14,
  "comments": [
    {
      "id": "fjx0g4t",
      "author": "Hel_l_en",
      "body": "Heyah! Well to begin with. Its NEVER too late to get help. Unfortunately throwing up can cause rotten teeth (thats why ur teeth hurt). I dont know your relationship with your family but they should be supportive. Bulimia is an eating disorder....a sickness. They shouldn't make you feel worst than you already feel!\nNow in my opinion you have to think about yourself. Do you think it will help u if u tell them? Yes they love u to the moon and back but will they express their love in a toxic way? \nIf you dont want to tell them, choose a friend. Its good to talk about it with someone.\nI am not aware of your age but you should also go to a therapist. (It doesnt have to be one you can try many until you find the most suitable) \nNow dont get me wrong. A therapist doesn't have a magic want that will make bulimia go away. You will have to work HARD. Its a difficult journey but its worth it.\nThe first thing you have to do is think WHY and HOW it started. Most, started cause they wanted to loose weight but its not they only reason! Some also think that the addicting thing is the \"control\" you think you have over what you eat.\nHowever the truth is u r not free. You cant enjoy food and slowly but surely you will isolate yourself.\nBulimia doesnt fix ANY problems (like seriously it doesn't even make u loose weight) so ye.\nDetermination my friend. Many of us are going through it. Sending you all the support. (Also you can start watching youtubers who got over bulimia. Make sure they are healthy tho because if they are \"in the process\" of self-treatmen then their channel can work as a bulimia group where u compare what u eat to them. Watch the people who got better to see the happiness in their eyes. NOT to compare but to feel motivated.)",
      "created_utc": 1583651297.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fjx6lxl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1583659163.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fjyfgrb",
      "author": "ShoGarzaa",
      "body": "Like someone else says it does depend if your parents are shit. Only you can know that, I dont wanna be like omgod tell them get help blabla cause for some people it doesnt work that way and could make things irreversibly worse, like would they genuinely kick you out or.......but i would say speak to someone a doctor or a counsellor ...definately dont keep suffering alone if you can help it.\n\nBest of luck hunnie im with you\nXo",
      "created_utc": 1583695596.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkg99b7",
      "author": "None",
      "body": "Hi. I’ve experienced a very similar situation as you while still in high school, including actually being kicked out. I recognize your fear but it’s likely that your family does not hate you. They are fearful because they do not want you to suffer. When people do not understand a scary situation (such as their child being bulimic), they resort to anger. I do not know your exact situation, but if you clearly explain to them what exactly you’re struggling with, your parents will probably help you. It’s about simplifying the situation, making it less of a scary unknown. If you think about food constantly, putting physical barriers may be a way to prevent binges. If you calmly explain to your parents the steps that could help you, such as putting locks on certain cabinets, or helping you by asking how your relationship with food has been every few days (kind of keeping you in check), they will most likely help you. However, you should definitely also consult a medical professional. For me, these steps never happened, which lead to 5 years of struggle and ruined relationships. I don’t think you should sacrifice communication. There is no reason to continue lying.",
      "created_utc": 1584153212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fkwrjtc",
      "author": "roseacui",
      "body": "I have bulimia as well. I have had it for a while now too. I think this is your chance to self improve and focus on yourself. I think the way your family is handling it is not right but I think you should seek help. Find a good clinic. Start your road to recovery. I believe in you and that you will get there. Any improvement is good even if it’s small. Good luck you got this!",
      "created_utc": 1584602770.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl6echm",
      "author": "None",
      "body": "The first steps are the most difficult. It takes months or years to get better, but we all have to start somewhere. You missed one opportunity for help, but you can reach out for more or different help. You deserve it, do it for yourself! No one will hate you for lying.",
      "created_utc": 1584864985.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flwr1z4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1585561731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo2b890",
      "author": "goodgirltilly1",
      "body": "We have all lied it's part and parcel of the issue and the self destruction, never ever think your the only one, the fight is lonely enough without turning to others, we all have been though that guilt, confusion and self loathing. You have started articulating your thoughts in words on here which from a personnel point of view is a good thing and a great start. The ones who love you will never understand, (they can't, so don't expect them too) but will love you anyway. xx",
      "created_utc": 1587455861.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fuy93r9",
      "author": "Ok-Opportunity-5269",
      "body": "My parents were the same way and I felt helpless anyways I live with my husband now and I’ve had bulimia since I was 15 (22 now) and he’s supportive and all but doesn’t REALLY get it. I told him when I was 19 and he’s been trying to get me help, therapy, doctors, meds but nothing works because I am scared of change. I don’t know if any of this makes sense but just know you aren’t the only one and get help on your own time and when you’re ready. Stay safe 💕",
      "created_utc": 1592260546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw137z4",
      "author": "viral_snyde",
      "body": "Your parents handled it wrong. I would have done the same",
      "created_utc": 1593145335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjz6i6v",
      "author": "ksaskkkkk4",
      "body": "I’m currently in therapy and yes it helps but yeah as u said it’s not a cure. My family loves me but they don’t really understand mental illness much less eat disorders so that is mostly the issue, but I think they would come around because i mean who would choose to have bulimia. Thank you so much for your advice it really does help to hear from people who understand I will probably end up telling them the truth and following all of this advice to help everything. I seriously appreciate your help and i wish you the best in life !! 🤍",
      "created_utc": 1583712513.0,
      "score": 4,
      "context": [
        {
          "id": "fjx0g4t",
          "author": "Hel_l_en",
          "body": "Heyah! Well to begin with. Its NEVER too late to get help. Unfortunately throwing up can cause rotten teeth (thats why ur teeth hurt). I dont know your relationship with your family but they should be supportive. Bulimia is an eating disorder....a sickness. They shouldn't make you feel worst than you already feel!\nNow in my opinion you have to think about yourself. Do you think it will help u if u tell them? Yes they love u to the moon and back but will they express their love in a toxic way? \nIf you dont want to tell them, choose a friend. Its good to talk about it with someone.\nI am not aware of your age but you should also go to a therapist. (It doesnt have to be one you can try many until you find the most suitable) \nNow dont get me wrong. A therapist doesn't have a magic want that will make bulimia go away. You will have to work HARD. Its a difficult journey but its worth it.\nThe first thing you have to do is think WHY and HOW it started. Most, started cause they wanted to loose weight but its not they only reason! Some also think that the addicting thing is the \"control\" you think you have over what you eat.\nHowever the truth is u r not free. You cant enjoy food and slowly but surely you will isolate yourself.\nBulimia doesnt fix ANY problems (like seriously it doesn't even make u loose weight) so ye.\nDetermination my friend. Many of us are going through it. Sending you all the support. (Also you can start watching youtubers who got over bulimia. Make sure they are healthy tho because if they are \"in the process\" of self-treatmen then their channel can work as a bulimia group where u compare what u eat to them. Watch the people who got better to see the happiness in their eyes. NOT to compare but to feel motivated.)",
          "created_utc": 1583651297.0
        }
      ]
    },
    {
      "id": "fjypu9a",
      "author": "babygirlmaybefrog",
      "body": "Ahh can I just add anti depressants can often cause weight gain, 40lbs for me and that might make ED behaviours worse, depends on the individuals I suppose, might make you worry less but didn't work for me so it can be quite detrimental to certain individuals. But I agree will all else. Tbh I think if you can get into an ED treatment centre PLEASE DO OH PLEASE DO at that level where you lose control which I think you have, constant supervision may be what you need!",
      "created_utc": 1583702001.0,
      "score": 2,
      "context": [
        {
          "id": "fjx6lxl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1583659163.0
        }
      ]
    },
    {
      "id": "fjz5zfm",
      "author": "ksaskkkkk4",
      "body": "Yes i’m in therapy so i will definitely take ur advice and thank god for supportive friends i know i rely on mine, i’m sorry you’re also having to deal with this and thank you for the advice , best of luck to u as well 🤍🤍",
      "created_utc": 1583712168.0,
      "score": 1,
      "context": [
        {
          "id": "fjx6lxl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1583659163.0
        }
      ]
    },
    {
      "id": "fjz6muo",
      "author": "ksaskkkkk4",
      "body": "Thank you so much i think i will end up telling them and see how it goes, best of luck to u! 🤍🤍🤍",
      "created_utc": 1583712597.0,
      "score": 2,
      "context": [
        {
          "id": "fjyfgrb",
          "author": "ShoGarzaa",
          "body": "Like someone else says it does depend if your parents are shit. Only you can know that, I dont wanna be like omgod tell them get help blabla cause for some people it doesnt work that way and could make things irreversibly worse, like would they genuinely kick you out or.......but i would say speak to someone a doctor or a counsellor ...definately dont keep suffering alone if you can help it.\n\nBest of luck hunnie im with you\nXo",
          "created_utc": 1583695596.0
        }
      ]
    },
    {
      "id": "frxrv8n",
      "author": "JetPatriot",
      "body": "Where did you get L-Dopa?",
      "created_utc": 1590546089.0,
      "score": 1,
      "context": [
        {
          "id": "flwr1z4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1585561731.0
        }
      ]
    },
    {
      "id": "fjzltl0",
      "author": "Hel_l_en",
      "body": "Oof I am glad to hear all that! I hope things will get easier for you. Family sometimes is unable to understand such situations cause they dont want to accept that there is something wrong with the person they love or they are even scared of this illness they are not aquainted with that can cause such pain to you. Having people that love you is a beautiful thing and I am sure you can get bettet. We all deserve happiness :) \nWish you the best!",
      "created_utc": 1583722810.0,
      "score": 1,
      "context": [
        {
          "id": "fjx0g4t",
          "author": "Hel_l_en",
          "body": "Heyah! Well to begin with. Its NEVER too late to get help. Unfortunately throwing up can cause rotten teeth (thats why ur teeth hurt). I dont know your relationship with your family but they should be supportive. Bulimia is an eating disorder....a sickness. They shouldn't make you feel worst than you already feel!\nNow in my opinion you have to think about yourself. Do you think it will help u if u tell them? Yes they love u to the moon and back but will they express their love in a toxic way? \nIf you dont want to tell them, choose a friend. Its good to talk about it with someone.\nI am not aware of your age but you should also go to a therapist. (It doesnt have to be one you can try many until you find the most suitable) \nNow dont get me wrong. A therapist doesn't have a magic want that will make bulimia go away. You will have to work HARD. Its a difficult journey but its worth it.\nThe first thing you have to do is think WHY and HOW it started. Most, started cause they wanted to loose weight but its not they only reason! Some also think that the addicting thing is the \"control\" you think you have over what you eat.\nHowever the truth is u r not free. You cant enjoy food and slowly but surely you will isolate yourself.\nBulimia doesnt fix ANY problems (like seriously it doesn't even make u loose weight) so ye.\nDetermination my friend. Many of us are going through it. Sending you all the support. (Also you can start watching youtubers who got over bulimia. Make sure they are healthy tho because if they are \"in the process\" of self-treatmen then their channel can work as a bulimia group where u compare what u eat to them. Watch the people who got better to see the happiness in their eyes. NOT to compare but to feel motivated.)",
          "created_utc": 1583651297.0
        },
        {
          "id": "fjz6i6v",
          "author": "ksaskkkkk4",
          "body": "I’m currently in therapy and yes it helps but yeah as u said it’s not a cure. My family loves me but they don’t really understand mental illness much less eat disorders so that is mostly the issue, but I think they would come around because i mean who would choose to have bulimia. Thank you so much for your advice it really does help to hear from people who understand I will probably end up telling them the truth and following all of this advice to help everything. I seriously appreciate your help and i wish you the best in life !! 🤍",
          "created_utc": 1583712513.0
        }
      ]
    }
  ]
}