{
  "id": "hp80fu",
  "subreddit": "bulimia",
  "author": "jellobowl12345",
  "created_utc": 1594464295.0,
  "title": "Things I had wish I listened to/heard when I used to purge",
  "selftext": "**sorry this is so long but I think it’s worth reading though I doubt anybody will 🥺🥺\n\nIf you do decide to read this though, please read the whole thing!\n\nHi all, I’m on this thread because I still struggle with some side effects and things like that but I haven’t been purging for a long time. I have the occasional slip up, but this is what I remind myself of if I feel myself being tempted to fall back into those habits. I just wanna post the things that motivated me to stop.\n\n\nThis might not help a number of people because I wasn’t fully bulimic, I would go through phases where I would purge for a few weeks and then stop so it wasn’t all the time. That went on for about 5 years. I think it was more of EDNOS then full blown bulimia but still. This is for people who purge because they want to lose weight, if you purge solely because of other reasons, like just for the sensation, then this might not be helpful. \n\nLet me start off by saying that I know your eating disorder may feel like a part of you, or who you are and will always be, but it doesn’t have to be. People have overcome amazing things. If I can overcome it, if heroin addicts can recover, if alcoholics can recover, if my coke and nicotine addicted anorexic mother can recover, I believe you can too. \n\nThings changed for me when I started to look at the timeline of my eating disorder. I was thinking of it as a mission, like eventually I would stick with it and lose weight and all my dreams would come true. The first step is to look at that timeline and realize that it is irrational and false. For 5 years I was stuck in the same place, my weight was constantly fluctuating. I never ended up where I wanted to be; happy with my body, feeling like I deserved to love myself. Now, I know you’re not going to believe it and you might just not until you realize it for yourself, but if you’re on the same mission I was, I can assure you that it will not result in you loving yourself or being happy with your body, and it is likely never ending. \n\nWhen I used to see advice from healthy people, saying things like losing weight is a lifestyle change, that you need to think long term and that that is the only sustainable way to lose weight, I didn’t wanna hear any of it. I just wanted to keep purging and restricting because it felt good and it felt like I was in control and my plan was always to lose weight and get the body I always wanted as soon as possible and once I got there i would start being healthy and maintain my weight. I didn’t care if I had to starve myself completely and throw up everything I ate, if it meant I could be skinny in 3 months then so be it. But that never actually happened. Even when I was successful, it wasn’t anything special. I could tell I was a little slimmer and it made me happy to feel confident in more revealing clothes but I didn’t truly feel any different. I still saw myself the same way and looking back I didn’t nearly realize how much slimmer I was. I was still incredibly unhappy and I gained all the weight back and then some during Christmas. Of course now my plan was to get back into it and keep losing. Just a never ending cycle. \n\nSomething clicked in my head one day when I was watching some video about self love, though I can’t remember what it said. But it made me realize that I would always buy nice things, like clothes or candles or cosmetics but I would never use them because I was waiting until I was skinny and my life was perfect to indulge myself in anything other than food. Of course I did a little but I was holding back and not taking full care of myself, which isn’t surprising. But that’s when I realize that that was exactly the problem. When I was thinking of what foods to eat, i would only focus on calories and macros. If something had a lot of vitamins or whatever I wouldn’t care because I figured I would start eating that stuff after I lost the weight. If I started doing all those things to myself now, what would happen? \n\nLoving yourself is not something that it easy. I am still on this journey that I started a few months ago and let me tell you, I still have thoughts every day like I’m disgusting, fat, ugly, worthless, annoying, etc. And yes, I do truly believe deep down that some of those things are true. But they aren’t and I can guarantee they aren’t true for you either. Even if they were, what is the point in thinking that? It’s only going to make things worse. Im not trying to act like it’s as simple as saying that those thoughts are dumb and you will suddenly realize and be cured, but my point is the reason you should try and shut those thoughts down is because they aren’t helping anybody. You May feel like you need to have them, I know i used to and still do, but you dont. It’s quite the opposite.\n\nYour brain doesn’t like to go out of its comfort zone. Those negative thoughts are thoughts you are used to having. They are habitual. Your brain has programmed itself to feel and think those things. And losing weight will not reprogram those thoughts. That is something you need to do. And it’s hard, but it’s possible. \n\nTry telling yourself nice things. Even if you don’t believe them. I know self love feels like a foreign concept. I once watched a video where a woman was saying that in society we don’t really promote or even accept self love and I realized that it’s so true. I don’t really feel like I’m allowed to love myself. Yes, there are lOvE yOuRsElf messages and all that but it’s not expected or common for a girl to feel confident and comfortable in her own skin. We are all so insecure. Ask yourself how many women or even men you know are truly happy with themselves. Popular, pretty girls, at least in my experience, come across as confident and they seem so happy with their appearance, like how could they not be? But ego and self confidence are two different things. They have huge egos and low self esteem, which is why they’re often rude and bitchy. And the difference between the two things is so important to understand, because being skinny or getting a lot of attention will not make you love yourself. Self love comes from within.\n\nReally think about where you could be in a few years from now if you started taking care of yourself, tried to stop beating yourself up, and if you stopped purging and started exercising (in moderation) and began your journey to self love. I know you’re probably thinking that’s impossible, but that’s just your brain telling you that. That mentality will make everything worse. It’s only possible if you truly want to recover, and saying that might feel like a slap in the face because obviously you don’t really want to be bulimic, but there still is a part in your brain that does want to hold on to those behaviors. You have to actively pay attention to those thoughts when they happen and separate them from yourself. Identify them as your bulimic thoughts and analyze them. Is that really true? Are you really the most disgusting person alive? Do you really deserve to die? Do you really deserve this? No. No you do not. You are a human being who just wants to be happy and your brain took you down the wrong path to get there. It’s not your fault. It’s not your fault that society makes us so focused on appearances and weight that our self worth can be completely drained because we don’t look or act a certain way. It’s not your fault that you’re so hard on yourself, that you pressure yourself so hard to be perfect.  It’s your brains fault. And you are so much more than your habitual thought patterns. \n\nAt the end of the day, who’s there? You. You’re stuck with yourself for the rest of your life. And I know, I know, that’s a scary thought. That was the thought that used to trigger my panic attacks. But now it is the thought that motivates me to do better. Because at the end of the day you are the only person who can help yourself. And you are going to live with yourself for the rest of your life, so you should start making improvements if you want to be happy somewhere down the line. \n\nYou can’t love someone else and be the person other people need you to be if you hate yourself. You will never be happy if you continue hating yourself. Since I have become more self-loving I have become soo much less critical of others. Feelings of hatred and jealousy used to overtake me when I saw videos and pictures of pretty girls and they still do sometimes. I start picking apart their flaws, like yeah she’s gorgeous but she has a weird nose so she’s not that special. Thats just such an unpleasant way to live, it feels so much better to look at beautiful people and appreciate their beauty and not feel angry or jealous or sad or worthless. \n\nEven if this post isn’t going to change anything you do, I hope it at the very least let’s you cut yourself some slack. Please, cut yourself some slack. You are sick and you don’t deserve to be. Don’t be so hard on yourself. If you can’t find a voice in yourself that says you these things, then listen to this post. You don’t deserve to feel this way. You deserve to be loved, to be happy, to recover. You have to fight your brain. \n\nI hope at least someone will read this and get the tiniest bit of hope. If anybody wanted I could share methods that can help you to love yourself. And please remember this is coming from someone who felt the same way as you did. Finding motivation when you’re sick and depressed is so difficult, and you shouldn’t be expected to be able to find it with ease, or on the first, second, third, etc. try. It might take a very long time but don’t. Beat. yourself. Up. Because then you will feel worse, and you will feel less motivated. Forgive yourself for your mistakes. Try to recognize where things went wrong and keep that in mind for next time. You got this!",
  "url": "https://www.reddit.com/r/bulimia/comments/hp80fu/things_i_had_wish_i_listened_toheard_when_i_used/",
  "score": 67,
  "num_comments": 9,
  "comments": [
    {
      "id": "fxodsfk",
      "author": "None",
      "body": "Thank you for this, as someone going trough the abrupt process of recovery after an awful relapse, this hits hard. \nBulimia has been a huge part of my life, and now I have to face the consequences of 15 years of its damage. \n\nHad to get braces again, because even tho I’m lucky I didn’t lose enamel or teeth they got messed up after purging with a toothbrush. Plus a lifetime of digestive issues which I’m trying to manage with a healthier diet and probiotics. \n\nPlease if you’re just starting with this issues try to stop, I remember the case of a 23 year old girl whose stomach got so full on a binge it burst and she died in her bathroom while trying to purge. I always thought that was the way I’d be gone.",
      "created_utc": 1594477876.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxpq0nh",
      "author": "aryalaya",
      "body": "Thank you so much for taking the time to write this, your wording is honestly so beautiful. I'm definitely going to save this and will try to come back as often as possible, to remind myself that I'm not the only one struggling and to keep sticking to recovery. Take care and please spread more of your thoughtfulness, you really lifted my spirits right now! <3",
      "created_utc": 1594490246.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxr2opl",
      "author": "weesbee18",
      "body": "I’m at the beginning stages of recovery (so still making f ups every other day) and have found that reading something affirming about my goals in the morning is very helpful for how well I do during the day. \nJust wanted to let you know that I’ve saved your post and will add it to my list as it says perfectly why I’m doing what I’m doing. Thank you so much for taking the time to share it.",
      "created_utc": 1594501917.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxors70",
      "author": "None",
      "body": "I'm legit about to start crying. I really needed to hear this, and thank you for taking the time to post it. <3",
      "created_utc": 1594481654.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxqsq2w",
      "author": "toxicpsych0",
      "body": "Thank you so so so much, I’m so grateful to know I’m not alone and there may not be a perfect recovery but at least better life than what I’m living. I’m honestly just so tired of feeling so guilty and unhappy with myself. Once again thank you❤️",
      "created_utc": 1594499473.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fz2d4ap",
      "author": "platonic_romantic",
      "body": "The effort and care you’ve put into this post is admirable. I know, this is a late comment, but I really hope you know how meaningful your post was. I don’t know if I can tear myself away from this addiction just yet but the knowledge that self-love can do so much good helps a great deal.",
      "created_utc": 1595571453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxpu3g9",
      "author": "jellobowl12345",
      "body": "💗",
      "created_utc": 1594491197.0,
      "score": 1,
      "context": [
        {
          "id": "fxpq0nh",
          "author": "aryalaya",
          "body": "Thank you so much for taking the time to write this, your wording is honestly so beautiful. I'm definitely going to save this and will try to come back as often as possible, to remind myself that I'm not the only one struggling and to keep sticking to recovery. Take care and please spread more of your thoughtfulness, you really lifted my spirits right now! <3",
          "created_utc": 1594490246.0
        }
      ]
    },
    {
      "id": "fxowvdg",
      "author": "jellobowl12345",
      "body": "❤️",
      "created_utc": 1594482894.0,
      "score": 2,
      "context": [
        {
          "id": "fxors70",
          "author": "None",
          "body": "I'm legit about to start crying. I really needed to hear this, and thank you for taking the time to post it. <3",
          "created_utc": 1594481654.0
        }
      ]
    },
    {
      "id": "fz4joni",
      "author": "jellobowl12345",
      "body": "❤️",
      "created_utc": 1595621106.0,
      "score": 1,
      "context": [
        {
          "id": "fz2d4ap",
          "author": "platonic_romantic",
          "body": "The effort and care you’ve put into this post is admirable. I know, this is a late comment, but I really hope you know how meaningful your post was. I don’t know if I can tear myself away from this addiction just yet but the knowledge that self-love can do so much good helps a great deal.",
          "created_utc": 1595571453.0
        }
      ]
    }
  ]
}