{
  "id": "hs0hea",
  "subreddit": "bulimia",
  "author": "sommerbelle",
  "created_utc": 1594862603.0,
  "title": "Been in recovery for about 7 months now",
  "selftext": "And I’m finally at the point where I’m able to just eat the amount I need, what I crave etc without over doing it! It’s been a long process. I initially gained a fair few kg but now I’ve lost some of that without even trying which has been nice as I will admit it is hard seeing the initial weight gain. Just want to say if you’re thinking about attempting recovery, if you’re in recovery, if you relapsed yesterday- just keep going! It’s so worth it! The ability to focus on my day, hold conversations with people without my mind being preoccupied with guilt and thoughts of food, is such a huge relief. I feel free 😃❤️ I love you all, I believe in you.",
  "url": "https://www.reddit.com/r/bulimia/comments/hs0hea/been_in_recovery_for_about_7_months_now/",
  "score": 72,
  "num_comments": 9,
  "comments": [
    {
      "id": "fy7wh5j",
      "author": "twisted-glass",
      "body": "You are a badass. I came here from r/EDanonymous and am diagnosed AN, but when I saw this title I knew I’d be so proud of whoever wrote this and it’s true! I AM proud you. You have the mindset that recovery WILL continue to happen and that is so so inspirational. Just be you. Be okay with what you may consider screw-ups. It’s a journey not a quick fix. Go rock it ❤️",
      "created_utc": 1594871594.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fy7s8n1",
      "author": "None",
      "body": "i’m so happy for you!!!!! i’m glad you’re recovering and i’m honestly so proud :)",
      "created_utc": 1594868922.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy7x6b8",
      "author": "imsodonewithmyself",
      "body": "Yayy! This is amazing! I’m really proud of you !❤️❤️❤️",
      "created_utc": 1594872060.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy8j0sr",
      "author": "trylongerthanyoufail",
      "body": "This remembers me when I spent my first holiday without searching everywhere where I can find food, without focusing only on the restaurants or bakeries, without thinking all the time about where I can throw up, without the panic of being on a beach and searching a place to hide, without forgetting all the conversations, all the moments, all the good things because I was focused only on food.\n\nI'll remember those holiday like none other, like my first real holiday since 15 years probably.\n\nWhat we all went, or are going through, is really worth it. I'm really really proud of you, and it made me really happy that you shared this here.",
      "created_utc": 1594891118.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy7u4t6",
      "author": "FunkyBlueMohawkBird",
      "body": "Oh that’s wonderful news!!  Happy for you, OP!! 😭🥰",
      "created_utc": 1594870090.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy7vrrz",
      "author": "caponsigrayina",
      "body": "Amazing job! This is very inspiring to me. I am having trouble going less than a day right now on the right track. You show me it is possible! Thank you!",
      "created_utc": 1594871137.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy95r63",
      "author": "Odd-Yogurtcloset9870",
      "body": "This gives me so much hope! Thank you so much for sharing ❤️",
      "created_utc": 1594908701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fya9mgc",
      "author": "clumsycouture",
      "body": "Congratulations! I’m so happy for you! I too thought I would never be able to eat normally but I’m going on almost 8 years now of recovery. The first year was hard but it gets sooooo much easier there is light at the end even if it feels like you’ll never be “normal”. I actually like seeing myself in the mirror and love my big thighs and curves.",
      "created_utc": 1594928326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fy7t58n",
      "author": "sommerbelle",
      "body": "Thank you, I really appreciate it! Hope you’re also well and thriving 💛",
      "created_utc": 1594869477.0,
      "score": 3,
      "context": [
        {
          "id": "fy7s8n1",
          "author": "None",
          "body": "i’m so happy for you!!!!! i’m glad you’re recovering and i’m honestly so proud :)",
          "created_utc": 1594868922.0
        }
      ]
    }
  ]
}