{
  "id": "hv016q",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1595302121.0,
  "title": "Harm reduction",
  "selftext": "I’m not sure if this has already been posted or if there’s a rule against this but this is something that’s really helped me survive through some of my darkest times. I’ve been to a lot of treatment centers and they never really teach you about harm reduction. It’s always focused on quitting, the thought of relapse is hardly entertained and what I’ve learned through many years of addiction is you can’t make somebody stop until they’re ready. So here are my tips to potentially keep you safe or even save your life; some of these things have literally saved my own. \n\n-BODY ARMOR. If you’re throwing up a lot and feel dizzy, light headed etc make sure you are replacing what you’re losing. There’s a drink called Body Armor and it’s like Gatorade but it actually has electrolytes. It has 80% of your daily potassium in 4 servings (an entire large sized bottle). If you can’t find this, pedialyte is a better option than Gatorade. I really encourage getting the regular ones and not the lite but if you absolutely can’t do the calories, they make low cal options too. *apple juice is another good option. \n\n-ORAL CARE. I’m sure we all know not to brush our teeth immediately after purging. Use mouthwash if you need to. I had a dentist recommended swishing with baking soda after purging, however, do not brush with baking soda. It’s abrasive. If your teeth are damaged avoid whitening tooth pastes and use something for sensitive teeth. I wish I took better care of my teeth while I was Bulimic. I have super jagged, small teeth as a result. \n\n-PURGE FREQUENCY. This is something I did a lot. I’d purge, drink water, purge, drink water. It was my way of making sure everything got out. If you can, purge ONE time per session if possible. Purging is obviously dangerous but purging over and over again can be deadly and increases the risk of hospitalization.\n\n-KNOW WHEN TO SEEK HELP. If you have tried replacing fluids/electrolytes yourself and don’t feel better by the next day (dizzy, light headed, fatigued, palpitations, seeing stars etc) go to the hospital. Ideally you want to tell them the truth but if you can’t, tell them you’ve been sick and have not been able to hold down fluids. They’ll give you fluids and check your blood. I went in for stomach pain and found out my potassium was critically low, near heart attack levels. It’s also a good idea to get regular blood work done. I know some people don’t have health insurance, but if you REALLY don’t feel well and it’s not getting better you need to get help. This is life or death. \n\nIf anyone else has any tips please add to this!!! These are just the major ones that really helped me.",
  "url": "https://www.reddit.com/r/bulimia/comments/hv016q/harm_reduction/",
  "score": 90,
  "num_comments": 26,
  "comments": [
    {
      "id": "fyrjdl1",
      "author": "coldlick",
      "body": "Also wanted to include some tips but realized it will do more harm than good! Here's some tips for teeth health and recovery you might want to read :') \n\nReducing teeth damage with lots of helpful information - https://www.rdhmag.com/patient-care/rinses-pastes/article/16408835/bulimia-decreasing-the-damage-to-enamel\n\nTips for stopping b/p cycle- https://www.google.com/amp/s/reallifewithed.wordpress.com/2017/08/27/my-15-best-tips-to-stop-binging-and-purging/amp/\n\n101 tips for bulimia recovery-  http://www.bulimiahelp.org/posts/bulimia-tips-for-recovery/\n\nEDIT-  pickle juice also contains a lot of electrolytes! Also drink lots of water, your body will be dehydrated after purging and it will prevent you from randomly fainting or feeling light headed. Also if you don't have baking soda to swish around your mouth, milk also works and neutralize the acid in your mouth",
      "created_utc": 1595339099.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fyr8qss",
      "author": "languageghost",
      "body": "These are all great points and so important if you're at a point where you're not able to stop purging yet.\nTo add to the point about purge frequency, here is an article that talks about this and how dangerous it is to repeatedly purge, drink water and purge again: http://www.your-bulimia-recovery.com/prevent-death-from-bulimia.html\nIt's really bad for your electrolyte balance and can be deadly",
      "created_utc": 1595331649.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fyqh35k",
      "author": "poisonenvy",
      "body": "Thank you ❤️",
      "created_utc": 1595305962.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fyql4r7",
      "author": "TheBitterRabbit",
      "body": "That covers most of the main stuff. Good breakdown. *thumbs up",
      "created_utc": 1595309007.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fyqog9x",
      "author": "None",
      "body": "Saving post so I can reference what you and others say.. ty",
      "created_utc": 1595311750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyr4yw0",
      "author": "wingednova",
      "body": "This is a great help, thank you💖",
      "created_utc": 1595328115.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyrpmf4",
      "author": "talktoaliens",
      "body": "Just to add on oral care:\n- Look for mouthwash with fluoride (0.05% is recommended) which has a lot of benefits for enamel (which is what stomach acid is breaking down). Also, generally using toothpaste with fluoride\n- If you know you are going to purge, consider taking an antacid ~30 mins before purging, which effectively neutralises the acid in your stomach (probably don’t want to be doing this constantly or often though bc stomach acid serves to help digest your food - so you could get constipation, etc. Just keep dosage to whatever the label says is appropriate)\n\nSeparately, if you’re prone to getting bulimia cheeks like I am, immediately after gently massage your cheeks (in an upwards direction) and under your jaw (watch some YT videos on lymph node massages)",
      "created_utc": 1595342588.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyrxfeh",
      "author": "None",
      "body": "When I know I’m about to relapse, I try to reduce acid damage to my throat by taking an antacid (like tums) before purging.\n\nI’m not a doctor, though- Just someone on their own journey to recovery.",
      "created_utc": 1595346595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyrjaso",
      "author": "qw3rti3",
      "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
      "created_utc": 1595339054.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyucp5a",
      "author": "justonium",
      "body": "#1. Purge the house (or cupboard, or backpack, handbag, or closet, whatever) of any type of very unhealthy food. This way, no matter what happens, the maximum possible damage to the body, is capped, at how toxic is an entire stomach-load (or two, or three) of your most- in-the-entire-house unhealthy food.\n\nWe may not all get cured tomorrow, so if we're all going to get through a longer, more gradual recovery, alive, then this one simple thing, is to me, the single outer-most, catch-all, in maximal-harm reduction.\n\n(So for starters, one can make sure, that all of one's possessed, or otherwise available-to-eat, food products, are free of the brain-degenerative toxin, aluminum. (And also lead, murcury, and any other toxic heavy (or light) metals (or otherwise minerals).))\n\nMust not die... before recovery is complete.",
      "created_utc": 1595393569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyumucs",
      "author": "justonium",
      "body": "Woah I never knew that potassium deficiency could cause heart attack--I was worried I had pre-mature atherosclerosis. (After experiencing what I suspect was a heart attack.) Hopefully that's all it was, 'cause that's something I can be easily cured of forever and prevent in the future. (Unlike intra-arterial deposits of fat.)\n\nEdit: Strangely enough, my inability to remain standing and to get enough air and to even be able to think clearly and lay down memories properly so that I would be able to better recall and re-tell that experience, started to hit, right as I was browsing the salts aisle, in a grocery store. They may have had just what I needed right there. (Or maybe not, if this heart,-lung,-and-mind life-threatening problem was in fact a result of some different cause.)",
      "created_utc": 1595402287.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0i3jme",
      "author": "whatevenislife38",
      "body": "is it safe to throw up more than once per session?",
      "created_utc": 1596670772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "juvwtef",
      "author": "Nervous-Earth-6680",
      "body": "What do you do if the blood vessels break under the skin from the extreme force? Do they go away? I think I went too hard once and now have red freckles all over my face all of a sudden.",
      "created_utc": 1691235857.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltfnfad",
      "author": "TheSholson",
      "body": "Link is corrupted",
      "created_utc": 1729729677.0,
      "score": 1,
      "context": [
        {
          "id": "fyr8qss",
          "author": "languageghost",
          "body": "These are all great points and so important if you're at a point where you're not able to stop purging yet.\nTo add to the point about purge frequency, here is an article that talks about this and how dangerous it is to repeatedly purge, drink water and purge again: http://www.your-bulimia-recovery.com/prevent-death-from-bulimia.html\nIt's really bad for your electrolyte balance and can be deadly",
          "created_utc": 1595331649.0
        }
      ]
    },
    {
      "id": "fyrpkso",
      "author": "lola-at-teatime",
      "body": "Cause you're rubbing the acid into your teeth. By not brushing and just swishing with water the saliva neutralizes it. Wait at least 20 mins before brushin, and do it gently. Baking soda is very good too at neutralizing the acid. Dissolve some into waterand swish gently. Do not rub.",
      "created_utc": 1595342564.0,
      "score": 5,
      "context": [
        {
          "id": "fyrjaso",
          "author": "qw3rti3",
          "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
          "created_utc": 1595339054.0
        }
      ]
    },
    {
      "id": "fyrptif",
      "author": "talktoaliens",
      "body": "Stomach acid has just weakened your teeth enamel and so scrubbing at it immediately essentially erodes your enamel :)",
      "created_utc": 1595342693.0,
      "score": 3,
      "context": [
        {
          "id": "fyrjaso",
          "author": "qw3rti3",
          "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
          "created_utc": 1595339054.0
        }
      ]
    },
    {
      "id": "fyvpe8u",
      "author": "None",
      "body": "I disagree with this. This is still a form of restriction and can lead to an even bigger binge. On top of that, I don’t think a lot of people can really afford to binge/purge solely healthy foods, (or they live with family who aren’t health conscious or refuse to buy food like that) so if you stock your house with all organic/natural/health foods even with the intent on not purging and end up having a horrible day and go through most of it in a day or two..you’re kinda fucked. Keeping trigger foods away is one thing but this just sounds like orthorexia to me.",
      "created_utc": 1595431707.0,
      "score": 2,
      "context": [
        {
          "id": "fyucp5a",
          "author": "justonium",
          "body": "#1. Purge the house (or cupboard, or backpack, handbag, or closet, whatever) of any type of very unhealthy food. This way, no matter what happens, the maximum possible damage to the body, is capped, at how toxic is an entire stomach-load (or two, or three) of your most- in-the-entire-house unhealthy food.\n\nWe may not all get cured tomorrow, so if we're all going to get through a longer, more gradual recovery, alive, then this one simple thing, is to me, the single outer-most, catch-all, in maximal-harm reduction.\n\n(So for starters, one can make sure, that all of one's possessed, or otherwise available-to-eat, food products, are free of the brain-degenerative toxin, aluminum. (And also lead, murcury, and any other toxic heavy (or light) metals (or otherwise minerals).))\n\nMust not die... before recovery is complete.",
          "created_utc": 1595393569.0
        }
      ]
    },
    {
      "id": "fyvowjx",
      "author": "None",
      "body": "Try not to worry too much, I still get that dizzy, foggy, out of breath/heart pounding thing to this day and I just went to the cardiologist last week and everything was fine, he suggested drinking some electrolyte drinks because that sensation is often dehydration related. Could also be blood pressure related. I’m not sure if you have insurance but if you can afford it you should definitely make an appointment with your doctor to get a referral to a cardiologist just to make sure everything is fine and tell them about your history with bulimia.",
      "created_utc": 1595431459.0,
      "score": 1,
      "context": [
        {
          "id": "fyumucs",
          "author": "justonium",
          "body": "Woah I never knew that potassium deficiency could cause heart attack--I was worried I had pre-mature atherosclerosis. (After experiencing what I suspect was a heart attack.) Hopefully that's all it was, 'cause that's something I can be easily cured of forever and prevent in the future. (Unlike intra-arterial deposits of fat.)\n\nEdit: Strangely enough, my inability to remain standing and to get enough air and to even be able to think clearly and lay down memories properly so that I would be able to better recall and re-tell that experience, started to hit, right as I was browsing the salts aisle, in a grocery store. They may have had just what I needed right there. (Or maybe not, if this heart,-lung,-and-mind life-threatening problem was in fact a result of some different cause.)",
          "created_utc": 1595402287.0
        }
      ]
    },
    {
      "id": "g0kqrw3",
      "author": "None",
      "body": "No. The more you throw up the more you are depleting yourself of electrolytes, it’s really hard on your heart. And once you start throwing up more concentrated stomach acids it erodes your teeth and throat lining. I will send you a PM",
      "created_utc": 1596730372.0,
      "score": 1,
      "context": [
        {
          "id": "g0i3jme",
          "author": "whatevenislife38",
          "body": "is it safe to throw up more than once per session?",
          "created_utc": 1596670772.0
        }
      ]
    },
    {
      "id": "k6l7x98",
      "author": "neilbreenfan404",
      "body": "I used to get this a lot during the height of my purging cycles in college, even had blood vessels burst in my eyes to where people were concerned that I had blood in my eye💀 it always went away though, these are usually minor, but it just shows how hard it can be on your cardiovascular system.",
      "created_utc": 1698352443.0,
      "score": 1,
      "context": [
        {
          "id": "juvwtef",
          "author": "Nervous-Earth-6680",
          "body": "What do you do if the blood vessels break under the skin from the extreme force? Do they go away? I think I went too hard once and now have red freckles all over my face all of a sudden.",
          "created_utc": 1691235857.0
        }
      ]
    },
    {
      "id": "fyrq46w",
      "author": "qw3rti3",
      "body": "Ah, I didn't know. THANK YOU, I really had no clue and kept brushing immediately for years 🤦😰 I'm not sure I have baking soda at home but at least I will wait and rinse my mouth with water. Thank you ❤️",
      "created_utc": 1595342851.0,
      "score": 5,
      "context": [
        {
          "id": "fyrjaso",
          "author": "qw3rti3",
          "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
          "created_utc": 1595339054.0
        },
        {
          "id": "fyrpkso",
          "author": "lola-at-teatime",
          "body": "Cause you're rubbing the acid into your teeth. By not brushing and just swishing with water the saliva neutralizes it. Wait at least 20 mins before brushin, and do it gently. Baking soda is very good too at neutralizing the acid. Dissolve some into waterand swish gently. Do not rub.",
          "created_utc": 1595342564.0
        }
      ]
    },
    {
      "id": "fyrq9q4",
      "author": "qw3rti3",
      "body": "Thank you, I had no idea that was harmful 😅 I thought It was ok to do so 😅",
      "created_utc": 1595342932.0,
      "score": 3,
      "context": [
        {
          "id": "fyrjaso",
          "author": "qw3rti3",
          "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
          "created_utc": 1595339054.0
        },
        {
          "id": "fyrptif",
          "author": "talktoaliens",
          "body": "Stomach acid has just weakened your teeth enamel and so scrubbing at it immediately essentially erodes your enamel :)",
          "created_utc": 1595342693.0
        }
      ]
    },
    {
      "id": "fywqnax",
      "author": "justonium",
      "body": "Well better than binging on something that will kill me. (For one instance, some really unhealthy fried snacks, when eaten in huge quantity, can literally do some serious long-term damage.)\n\nAlso, I know there is a compromise, between affordability, and nutritional quality, but there are still some fairly safe (as well as cheap) binge foods--for one instance, >!crackers made from unbromated wheat (and also not poisoned with aluminum)!<.\n\nP.S. WtF even is orthorexia?",
      "created_utc": 1595449281.0,
      "score": 1,
      "context": [
        {
          "id": "fyucp5a",
          "author": "justonium",
          "body": "#1. Purge the house (or cupboard, or backpack, handbag, or closet, whatever) of any type of very unhealthy food. This way, no matter what happens, the maximum possible damage to the body, is capped, at how toxic is an entire stomach-load (or two, or three) of your most- in-the-entire-house unhealthy food.\n\nWe may not all get cured tomorrow, so if we're all going to get through a longer, more gradual recovery, alive, then this one simple thing, is to me, the single outer-most, catch-all, in maximal-harm reduction.\n\n(So for starters, one can make sure, that all of one's possessed, or otherwise available-to-eat, food products, are free of the brain-degenerative toxin, aluminum. (And also lead, murcury, and any other toxic heavy (or light) metals (or otherwise minerals).))\n\nMust not die... before recovery is complete.",
          "created_utc": 1595393569.0
        },
        {
          "id": "fyvpe8u",
          "author": "None",
          "body": "I disagree with this. This is still a form of restriction and can lead to an even bigger binge. On top of that, I don’t think a lot of people can really afford to binge/purge solely healthy foods, (or they live with family who aren’t health conscious or refuse to buy food like that) so if you stock your house with all organic/natural/health foods even with the intent on not purging and end up having a horrible day and go through most of it in a day or two..you’re kinda fucked. Keeping trigger foods away is one thing but this just sounds like orthorexia to me.",
          "created_utc": 1595431707.0
        }
      ]
    },
    {
      "id": "fywta3s",
      "author": "justonium",
      "body": "If that happened to me everyday, I would no longer be here, today.\n\n(Oh, and I think I forgot to mention, the chest pain. And then the ensuing massive nausea, and then extra-massive panic-attack.)\n\nBut after the symptoms have passed, there is usually nothing much of use a Western doctor can do. (Aside from take some of my money.)",
      "created_utc": 1595450483.0,
      "score": 1,
      "context": [
        {
          "id": "fyumucs",
          "author": "justonium",
          "body": "Woah I never knew that potassium deficiency could cause heart attack--I was worried I had pre-mature atherosclerosis. (After experiencing what I suspect was a heart attack.) Hopefully that's all it was, 'cause that's something I can be easily cured of forever and prevent in the future. (Unlike intra-arterial deposits of fat.)\n\nEdit: Strangely enough, my inability to remain standing and to get enough air and to even be able to think clearly and lay down memories properly so that I would be able to better recall and re-tell that experience, started to hit, right as I was browsing the salts aisle, in a grocery store. They may have had just what I needed right there. (Or maybe not, if this heart,-lung,-and-mind life-threatening problem was in fact a result of some different cause.)",
          "created_utc": 1595402287.0
        },
        {
          "id": "fyvowjx",
          "author": "None",
          "body": "Try not to worry too much, I still get that dizzy, foggy, out of breath/heart pounding thing to this day and I just went to the cardiologist last week and everything was fine, he suggested drinking some electrolyte drinks because that sensation is often dehydration related. Could also be blood pressure related. I’m not sure if you have insurance but if you can afford it you should definitely make an appointment with your doctor to get a referral to a cardiologist just to make sure everything is fine and tell them about your history with bulimia.",
          "created_utc": 1595431459.0
        }
      ]
    },
    {
      "id": "fytpxia",
      "author": "lola-at-teatime",
      "body": "Most welcome ❤ let's make harm reduction cool again \n\nSeriously, quitting cold turkey altogether seems like a faraway dream. But harm reduction makes it all more bearable.\n\nOh and also milk! Milk neutralizes acid too, have some milk in your mouth for 2 minutes after purging, if you cant do the baking soda thibg. Or better yet, do them both, 1st the milk, then the soda at an interval of 5 min or more.",
      "created_utc": 1595379208.0,
      "score": 3,
      "context": [
        {
          "id": "fyrjaso",
          "author": "qw3rti3",
          "body": "Thanks you for sharing this. \n\nWhy is that harmful to brush teeth right after? I've been bulimic for over a decade and I did not know! Sorry for the stupid question but.... didn't know 😅🤦",
          "created_utc": 1595339054.0
        },
        {
          "id": "fyrpkso",
          "author": "lola-at-teatime",
          "body": "Cause you're rubbing the acid into your teeth. By not brushing and just swishing with water the saliva neutralizes it. Wait at least 20 mins before brushin, and do it gently. Baking soda is very good too at neutralizing the acid. Dissolve some into waterand swish gently. Do not rub.",
          "created_utc": 1595342564.0
        },
        {
          "id": "fyrq46w",
          "author": "qw3rti3",
          "body": "Ah, I didn't know. THANK YOU, I really had no clue and kept brushing immediately for years 🤦😰 I'm not sure I have baking soda at home but at least I will wait and rinse my mouth with water. Thank you ❤️",
          "created_utc": 1595342851.0
        }
      ]
    },
    {
      "id": "fyx5jzi",
      "author": "TranZeitgeist",
      "body": "orthorexia means an obsession with proper or ‘healthful’ eating. Although being  aware of and concerned with the nutritional quality of the food you eat  isn’t a problem in and of itself, people with orthorexia become so  fixated on so-called ‘healthy eating’ that they actually damage their  own well-being. [NEDA](https://www.nationaleatingdisorders.org/learn/by-eating-disorder/other/orthorexia)\n\ndietary restrictions intended to promote health may paradoxically lead to unhealthy consequences, such as social isolation, anxiety, loss of ability to eat in a natural, intuitive manner, reduced interest in the full range of other healthy human activities. [wiki](https://en.wikipedia.org/wiki/Orthorexia_nervosa)\n\nIt seems similar to OC and anxiety disorders. There's probably a connection in that a sense of self control, and rules based thinking often factors into maintaining EDs.",
      "created_utc": 1595456769.0,
      "score": 3,
      "context": [
        {
          "id": "fyucp5a",
          "author": "justonium",
          "body": "#1. Purge the house (or cupboard, or backpack, handbag, or closet, whatever) of any type of very unhealthy food. This way, no matter what happens, the maximum possible damage to the body, is capped, at how toxic is an entire stomach-load (or two, or three) of your most- in-the-entire-house unhealthy food.\n\nWe may not all get cured tomorrow, so if we're all going to get through a longer, more gradual recovery, alive, then this one simple thing, is to me, the single outer-most, catch-all, in maximal-harm reduction.\n\n(So for starters, one can make sure, that all of one's possessed, or otherwise available-to-eat, food products, are free of the brain-degenerative toxin, aluminum. (And also lead, murcury, and any other toxic heavy (or light) metals (or otherwise minerals).))\n\nMust not die... before recovery is complete.",
          "created_utc": 1595393569.0
        },
        {
          "id": "fyvpe8u",
          "author": "None",
          "body": "I disagree with this. This is still a form of restriction and can lead to an even bigger binge. On top of that, I don’t think a lot of people can really afford to binge/purge solely healthy foods, (or they live with family who aren’t health conscious or refuse to buy food like that) so if you stock your house with all organic/natural/health foods even with the intent on not purging and end up having a horrible day and go through most of it in a day or two..you’re kinda fucked. Keeping trigger foods away is one thing but this just sounds like orthorexia to me.",
          "created_utc": 1595431707.0
        },
        {
          "id": "fywqnax",
          "author": "justonium",
          "body": "Well better than binging on something that will kill me. (For one instance, some really unhealthy fried snacks, when eaten in huge quantity, can literally do some serious long-term damage.)\n\nAlso, I know there is a compromise, between affordability, and nutritional quality, but there are still some fairly safe (as well as cheap) binge foods--for one instance, >!crackers made from unbromated wheat (and also not poisoned with aluminum)!<.\n\nP.S. WtF even is orthorexia?",
          "created_utc": 1595449281.0
        }
      ]
    }
  ]
}