{
  "id": "i4edcx",
  "subreddit": "bulimia",
  "author": "Aaronsuckss",
  "created_utc": 1596663191.0,
  "title": "I hope you all can experience this one day",
  "selftext": "Ive been clean for 8 months now and it's the best decision I've ever made , I still fight the urge to B/P almost everyday. But I appreciate everything so much more now, I can eat out at a restaurant and not have to leave the table right after eating, I'm not dealing with a constant sore throat and my weight has been more consistent than ever, I just feel like a 100 pound weight was taken off my back and my mind is clear. \n\n I hope you all can experience this one day and change for the better, you deserve it",
  "url": "https://www.reddit.com/r/bulimia/comments/i4edcx/i_hope_you_all_can_experience_this_one_day/",
  "score": 134,
  "num_comments": 9,
  "comments": [
    {
      "id": "g0i312p",
      "author": "None",
      "body": "That’s a huge accomplishment. Very proud of you internet stranger!",
      "created_utc": 1596670497.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g0ijlx7",
      "author": "good_for_me",
      "body": "Excellent work :)",
      "created_utc": 1596679418.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0ik32w",
      "author": "Briannna0",
      "body": "so proud of you💜what a positive influence you are. thank you for sharing this; it is so helpful to hear about recovery and it gives me hope. 👏🏻",
      "created_utc": 1596679677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0ja8xe",
      "author": "positivitygiver",
      "body": "This is amazing. I'm so proud of you. You are a role model and an inspiration. Healing and working your way into new healthy habits instead of old unhealthy ones is extremely difficult, and it gives me hope that I can fight it too, and that I can win. Thank you so much for sharing. Please keep sharing the victories you win, share the small victories of every day so we can all be inspired to fight. You made my day, I appreciate you a lot. Thank you♥️",
      "created_utc": 1596697762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0jcf8s",
      "author": "hhllbbssoommpp",
      "body": "That’s amazing! So proud :)",
      "created_utc": 1596699838.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0jno1s",
      "author": "jadeeeeep",
      "body": "How did you do it. That is amazing",
      "created_utc": 1596711057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0jntzs",
      "author": "nina_coban",
      "body": "This is amazing, and just so inspiring, thank you for sharing this!! \n\nI hope you will, one day, not have to \"fight\" it anymore either, and be completely free of this. <3",
      "created_utc": 1596711210.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0kazjp",
      "author": "chlocodile",
      "body": "So proud of you!!! I've been clean for years now and I often forget I ever even was bulimic! I remember just how difficult those first few months were so congrats for making it through. I promise you that you won't need to keep fighting that urge forever <3",
      "created_utc": 1596723648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0kq9bv",
      "author": "Aaronsuckss",
      "body": "I'm sorry I don't have a better answer, but one day I just woke up and said I'm done, I couldn't take it anymore and quit cold turkey",
      "created_utc": 1596730155.0,
      "score": 2,
      "context": [
        {
          "id": "g0jno1s",
          "author": "jadeeeeep",
          "body": "How did you do it. That is amazing",
          "created_utc": 1596711057.0
        }
      ]
    }
  ]
}