{
  "id": "i85ru9",
  "subreddit": "bulimia",
  "author": "pixiefancy",
  "created_utc": 1597200332.0,
  "title": "Didn’t purge dinner",
  "selftext": "I didn’t purge my dinner. After a full day of bingeing and purging multiple times, I decided to keep my dinner down. I’m struggling with the guilt hardcore right now and I’m balancing between purging and just sitting through it. I definitely ate more than I planned but I’m not uncomfortably full. I am uncomfortable with having food inside me and the numbers on the scale before going to bed, but I am sticking through it. \nFolks, this is hard. I’m writing this to distract myself from a purge. I’m reminding myself I did a lot of damage today, and it’s ok to give my body a break. My jaw is killing me, I don’t want to be in more pain. \n\nIt’s hard. This is HARD, but I’m going to be stronger than that voice in my head.",
  "url": "https://www.reddit.com/r/bulimia/comments/i85ru9/didnt_purge_dinner/",
  "score": 78,
  "num_comments": 8,
  "comments": [
    {
      "id": "g16bowc",
      "author": "beyondhopeful",
      "body": "YESSSS!!! YAY! Take it one step at a time! What I feel helps with feelings of fullness and guilt is to lay on my bed, either on my back or stomach, out on some movies or listen to music, and just zone out for an hour. When you come back to reality your stomach doesn’t feel full (or as full), and you’ve had a decent amount of time to accept that you just ate a real, full meal",
      "created_utc": 1597200782.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g16vk4v",
      "author": "positivitygiver",
      "body": "I'm so happy for you that you had a HUGE success tonight and kept your dinner. It's really hard to let go of the purging habit, especially with all the difficult emotions regarding food. One small step at a time, you can do it. You can kick that moyherfuckinh bulimias ass💪💪💪one step at a time, one day at a time. You keep my positive about myself by just surviving, let alone overcoming this urge to binge ♥️♥️♥️",
      "created_utc": 1597214762.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g17xjtk",
      "author": "JetPatriot",
      "body": "Good for you",
      "created_utc": 1597244683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g16bqrp",
      "author": "2young2B4gotten",
      "body": "You are strong, yes! Take care of yourself and keep it down. You need the fuel to function, to live, to breathe. Fxxk the numbers on a scale, you are more important than an arbitrary number and a stupid Ana brain being mean. Hugs",
      "created_utc": 1597200811.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g187zg1",
      "author": "pixiefancy",
      "body": "Thank you so much everyone for all the support ❤️it really helped and meant a lot. I felt less alone. I was a little distressed this morning with the scale, but I am working on accepting it and moving the eff on!",
      "created_utc": 1597249642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g174whu",
      "author": "LischenVonEngels",
      "body": "I'm so, so proud of you. You are strong and brave and deserve all the best things that life has to offer.",
      "created_utc": 1597224068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g16c648",
      "author": "pixiefancy",
      "body": "💕 thanks for the encouragement and the advice! I am laying down now and just trying to keep my brain busy. I am determined to get past this.",
      "created_utc": 1597201052.0,
      "score": 5,
      "context": [
        {
          "id": "g16bowc",
          "author": "beyondhopeful",
          "body": "YESSSS!!! YAY! Take it one step at a time! What I feel helps with feelings of fullness and guilt is to lay on my bed, either on my back or stomach, out on some movies or listen to music, and just zone out for an hour. When you come back to reality your stomach doesn’t feel full (or as full), and you’ve had a decent amount of time to accept that you just ate a real, full meal",
          "created_utc": 1597200782.0
        }
      ]
    },
    {
      "id": "g16cctl",
      "author": "pixiefancy",
      "body": "❤️ thank you so much, I’m trying my best. I’m telling myself that this will be good fuel to crush a workout tomorrow morning and maybe set me up for a better day. The numbers are bugging me, but I’m in bed now, and I’m just going to push past it.",
      "created_utc": 1597201157.0,
      "score": 3,
      "context": [
        {
          "id": "g16bqrp",
          "author": "2young2B4gotten",
          "body": "You are strong, yes! Take care of yourself and keep it down. You need the fuel to function, to live, to breathe. Fxxk the numbers on a scale, you are more important than an arbitrary number and a stupid Ana brain being mean. Hugs",
          "created_utc": 1597200811.0
        }
      ]
    }
  ]
}