{
  "id": "i86gzi",
  "subreddit": "bulimia",
  "author": "lb1986",
  "created_utc": 1597203174.0,
  "title": "Just how damaging bulimia can be (Story)",
  "selftext": "Hey folks.\n\nJust wanted to post and give use an insite into how damaging this illness can be.\n\nI don't want to sound like I'm scaring i just want to let people have a think about the damage been done in the background without you even knowing or believing your actually 'Fine'\n\nI have had bulimia for a few years now. It all started from a simple diet. Just to lose some weight and become 'healthy'... Very straight forward and a good choice not think? Wrong. I dropped a large amount of weight over a period of 4-5 month. Everyone was commenting on how i was looking so 'healthy'. I eventually reached a weight i says.. Ok i am happy with how i look i best stop. So i switched off the diet mentality and started to eat just foods i had cut out during my diet period. I noticed the scale was slowly climbing and got the anxiety and worry of going backwards but my body was just very malnourished from dieting to hard and i just kept getting hunger urges all day long. Some days i would crack and binge out. It feels like a complete black out and when you come back to reality this guilt feeling hits very hard. This carried on and i binged one day till my stomach was very VERY uncomfortable and i says i wish this would just come back up to give relief. I went to the toilet with a very innocent mindset and i leaned over and a huge amount just purged up and i got such a sense of relief and i felt a huge euphoria feeling. So i thought hey atleast all that food won't be added to my body. So anytime that binge would hit i done the same and over time it became so easy to do this 'magic trick' that i noticed my weight slightly dropped. I was amazed with this.\n\nAt first it's a euphoric feeling. Sense of achievement' Hey i can eat anything and stay slim!\n\nFast forward to now....\n\nI can't go a single day without having to eat and purge or i feel a very dark depression. Doctors visits led to a host of pills and potions which just messed my brain up. I went to eating disorder treatments which never could stop me.\n\nMy stomach is destroyed.. Soon as i eat i feel the food just wanting to eject automatically. I battle and battle to hold this down. I digest food so slow now that i can feel food in my stomach 12 hours after eating it. I have even eaten a meal and i purged the day after and that meal that was 24 hours ago.... Came up! Just a destroyed stomach. The purging also brings up stomach acids and due to low stomach acid this is a perfect environment for bacteria to grow (Heard of sibo?)... Sibo causes serious anxiety and depression. This is just a small part of how this illness has messed up my life.\n\nThe biggest issue that happened was.. Last year i was just working away and i stood up and next thing i went to speak and my speech was a complete slur (I thought what was that?) next part was the most horrible feeling i had ever experienced i completely lost my left side of my body completely and collapsed in front of my partner and was rushed to hospital. After scans and blood tests i had took a TIA. This was a mini stroke which luckily is a stroke but your body recovers so quickly that you don't paralyse your left hand side of your body. The doctor came in and asked my partner to sit outside if that was ok and he sat next to me and says.. Your bloodwork isn't what a 32 year old males should look like. He says we done a basic blood panel at the start and when i seen this he asked the lab to do a full blood panel. He says i know this isn't a condition but are you ok to be truthful with me? I am very concerned. I asked why and he says your potassium is so poor your heart could stop during this chat we're having. He says all your organs are struggling badly. Your body is screaming out for help can you just let me know what's been going on? I was 100% honest and says i have battled bulimia for years and i can't recover. I have tried everything and still struggle daily. He says bulimia is a mental illness and is as powerful as the top addictions. So don't believe your a failure for not stopping. This needs to be treated by a professional. He says we need to load your body with electrolytes to begin with and bring you back into a healthy territory. He then says i assume your partner doesn't know? I says no i have hidden this secret for years and he says that's fine i won't disclose anything at all that part must come from you. He says this TIA i am certain is from your body just struggling so much. Next time might not be as lucky. \n\nSo i went back for a 7 further appointments to do with the TIA and had to wear a heart monitor for a week. Had to do ECG scans. The treadmill stress test. They says your heart is weak but it can be recovered.\n\nI was signed off work sick for over 2 months.\n\nI still struggle everyday.. My stomach is still destroyed. I still battle anxiety/depression\n\nMoral of this story i am sharing is.....\n\nDon't think your doing no harm. Trust me you are :-( Take all this advice and do EVERYTHING in your power to get away grim this life destroying illness.\n\nYou can do it. It takes time but if you believe you want to live a long healthy life then you need to be strong and beat this.\n\nThank you",
  "url": "https://www.reddit.com/r/bulimia/comments/i86gzi/just_how_damaging_bulimia_can_be_story/",
  "score": 71,
  "num_comments": 11,
  "comments": [
    {
      "id": "g17bf1j",
      "author": "wingednova",
      "body": "Fuck, this is hard to hear. I’m mid purge and a little scared. I wish you strength to make it out",
      "created_utc": 1597230483.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g17cz3p",
      "author": "justonium",
      "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
      "created_utc": 1597231852.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g17xsl0",
      "author": "lunaelliott4",
      "body": "I have battled eating disorders my whole life but anorexia and bulimia since I was 19 (so 8 years) and most of these things have happened to me I cry every day because I feel like ill never be able to escape the vicious cycle.. I've tried treatment centers therapists etc. And the anxiety of gaining weight (i graduated high school at almost 300 lbs.) Always sucks me back in and I have a boyfriend who loves me and supports me that I don't want to let down and am scared everyday that hell get sick of putting up with my bullshit and just leave i keep trying though every once in awhile j get brave enough to try recovery again i just want one of those times to be finally the one that sticks....",
      "created_utc": 1597244805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hw3gu8s",
      "author": "No-Sympathy-3362",
      "body": "Were you underweight when you had the mini-stroke?",
      "created_utc": 1644336307.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1ahqtx",
      "author": "lb1986",
      "body": "I supplemented pottasium pills. I even held meals down. I drank tons of water.\n\nMy electrolytes we're dreadful still. What causes the purge to become as dangerous as it became with me was... The acid in our stomach (Hydrochloric Acid) when we purge we lose a huge amount of stomach acid and if most people flush ie water then purge again. We almost have zero stomach acid left in the stomach so your body goes into a frenzy to restore the stomach acid and the main component used is potassium. So say you supplement 1g of potassium in a day. Which is alot for a supplement anyway. A purge may cause your body to use 2g of potassium to restore the acid lost in that one purge. Say you purge twice a day (Some people are even doing 6+ times a day) so it doesn't matter how much you supplement you will NEVER meet your body's demands.\n\nAlso a blood potassium serum level is inaccurate as it's a snapshot of that exact moment. It needs to be a tissue potassium level\n\nJust wanted to be honest as i use to think i could just supplement or eat a bunch of bananas and be good but i was sitting being told i could die at any moment 👎",
      "created_utc": 1597289396.0,
      "score": 3,
      "context": [
        {
          "id": "g17cz3p",
          "author": "justonium",
          "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
          "created_utc": 1597231852.0
        }
      ]
    },
    {
      "id": "g1ai8e7",
      "author": "lb1986",
      "body": "I feel very similar. I have a partner i love so much and i know it is vice versa (13 years together)\n\nIf your boyfriend has a rough idea of what's going on and it sounds like he loves you so much that he will have read into these awful illness's and he will understand that it's a mental health issue and not just a choice to just stay slim.\n\nIt's an addiction. A VERY powerful one so don't let it make you feel like your doing wrong. Your battling a disease. Just like any addiction their are reoccurring relapses and bad periods.\n\nBest of luck and chin up. I know you will beat this 😊",
      "created_utc": 1597289693.0,
      "score": 3,
      "context": [
        {
          "id": "g17xsl0",
          "author": "lunaelliott4",
          "body": "I have battled eating disorders my whole life but anorexia and bulimia since I was 19 (so 8 years) and most of these things have happened to me I cry every day because I feel like ill never be able to escape the vicious cycle.. I've tried treatment centers therapists etc. And the anxiety of gaining weight (i graduated high school at almost 300 lbs.) Always sucks me back in and I have a boyfriend who loves me and supports me that I don't want to let down and am scared everyday that hell get sick of putting up with my bullshit and just leave i keep trying though every once in awhile j get brave enough to try recovery again i just want one of those times to be finally the one that sticks....",
          "created_utc": 1597244805.0
        }
      ]
    },
    {
      "id": "g1alaw2",
      "author": "justonium",
      "body": "One thing that helps me I think is just making sure all my foods that I might purge are loaded with potassium to begin with so the stomach doesn't have to add as much of its own supply that it normally extracts out of the serum of the blood. Then I also make sure to drink plenty of chloride-salts afterwards to make sure that gets replaced as well. (And assuming the processes of pumping in hydrochloric acid, and potassium, are factorable separable, then I think this method of potassium-loss prevention should be sound. At least I think the mechanisms are separate, but I should probably make extra sure.)\n\nI never even thought about that tidbit about blood serum not representing potassium abundance directly because most potassium is stored locked within the interiors of our cells. Thanks for pointing out!!\n\nI've been told such doomsday warnings too, but in theory, (and presumably, if the theory has no major deviation from physical reality, in *practice*, as well,) it doesn't matter *how* much of an electrolyte is lost per purge, so long as it is also replenished in likewise copiously large re-plentiful amount.\n\n(Not saying there aren't also other reasons to worry about being bulimic tho, OF COURSE.)\n\nThank you for this very informative reply--if us proles are gonna survive these illnesses that our corporations are seemingly content to inflict upon us by-many-means as they continue to siphon away our health and money, I think we probably needed to continue to work together.",
      "created_utc": 1597291642.0,
      "score": 1,
      "context": [
        {
          "id": "g17cz3p",
          "author": "justonium",
          "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
          "created_utc": 1597231852.0
        },
        {
          "id": "g1ahqtx",
          "author": "lb1986",
          "body": "I supplemented pottasium pills. I even held meals down. I drank tons of water.\n\nMy electrolytes we're dreadful still. What causes the purge to become as dangerous as it became with me was... The acid in our stomach (Hydrochloric Acid) when we purge we lose a huge amount of stomach acid and if most people flush ie water then purge again. We almost have zero stomach acid left in the stomach so your body goes into a frenzy to restore the stomach acid and the main component used is potassium. So say you supplement 1g of potassium in a day. Which is alot for a supplement anyway. A purge may cause your body to use 2g of potassium to restore the acid lost in that one purge. Say you purge twice a day (Some people are even doing 6+ times a day) so it doesn't matter how much you supplement you will NEVER meet your body's demands.\n\nAlso a blood potassium serum level is inaccurate as it's a snapshot of that exact moment. It needs to be a tissue potassium level\n\nJust wanted to be honest as i use to think i could just supplement or eat a bunch of bananas and be good but i was sitting being told i could die at any moment 👎",
          "created_utc": 1597289396.0
        }
      ]
    },
    {
      "id": "g1cqgyd",
      "author": "lunaelliott4",
      "body": "Thank you so much :) I remind myself that this is just a very rough patch in my life and one day ill be free of this :)",
      "created_utc": 1597342437.0,
      "score": 1,
      "context": [
        {
          "id": "g17xsl0",
          "author": "lunaelliott4",
          "body": "I have battled eating disorders my whole life but anorexia and bulimia since I was 19 (so 8 years) and most of these things have happened to me I cry every day because I feel like ill never be able to escape the vicious cycle.. I've tried treatment centers therapists etc. And the anxiety of gaining weight (i graduated high school at almost 300 lbs.) Always sucks me back in and I have a boyfriend who loves me and supports me that I don't want to let down and am scared everyday that hell get sick of putting up with my bullshit and just leave i keep trying though every once in awhile j get brave enough to try recovery again i just want one of those times to be finally the one that sticks....",
          "created_utc": 1597244805.0
        },
        {
          "id": "g1ai8e7",
          "author": "lb1986",
          "body": "I feel very similar. I have a partner i love so much and i know it is vice versa (13 years together)\n\nIf your boyfriend has a rough idea of what's going on and it sounds like he loves you so much that he will have read into these awful illness's and he will understand that it's a mental health issue and not just a choice to just stay slim.\n\nIt's an addiction. A VERY powerful one so don't let it make you feel like your doing wrong. Your battling a disease. Just like any addiction their are reoccurring relapses and bad periods.\n\nBest of luck and chin up. I know you will beat this 😊",
          "created_utc": 1597289693.0
        }
      ]
    },
    {
      "id": "g1f723x",
      "author": "lb1986",
      "body": "Hey\n\nI use to also have this mindset with electrolytes etc. Apart from my scare with the TIA i never even knew just how damaging this illness is. It's scarily bad. Weird part is you can feel absolutely fine?\n\nI tried all the potassium loading strategies like yourself also. Seemed i was just not keeping up with the demand? This was also doing a 5g scoop of potassium bicarbonate and also using potassium based salt with a meal that i am guaranteed to keep down!\n\nNot trying to scare btw. Just wanted to let people know just how our body needs a constant supply of nutrition to keep thriving.\n\nAnother part i found out also is we need a high stomach acid content to actually extract potassium also or the molecule can't be broken down enough to be absorbed by the small intestine. So we can eat the highest potassium based foods but if our stomach acid is low then the food isn't broken down enough to even extract it and it passes directly through us.\n\nAre you getting any help at the moment? Or have you thought about reaching out?\n\nI live in the UK and our eating disorder service is very poor sadly. We are only offered a 1 to 1 chat with a dietician. Their isn't a medication directly offered here that's for Bulimia. You know how Prozac is approved for Bulimia? Well here it's only issued as an anti depressant. You can ask though and get it prescribed off label mind. Just be good to have some good services to access.\n\nBest of luck",
      "created_utc": 1597393117.0,
      "score": 1,
      "context": [
        {
          "id": "g17cz3p",
          "author": "justonium",
          "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
          "created_utc": 1597231852.0
        },
        {
          "id": "g1ahqtx",
          "author": "lb1986",
          "body": "I supplemented pottasium pills. I even held meals down. I drank tons of water.\n\nMy electrolytes we're dreadful still. What causes the purge to become as dangerous as it became with me was... The acid in our stomach (Hydrochloric Acid) when we purge we lose a huge amount of stomach acid and if most people flush ie water then purge again. We almost have zero stomach acid left in the stomach so your body goes into a frenzy to restore the stomach acid and the main component used is potassium. So say you supplement 1g of potassium in a day. Which is alot for a supplement anyway. A purge may cause your body to use 2g of potassium to restore the acid lost in that one purge. Say you purge twice a day (Some people are even doing 6+ times a day) so it doesn't matter how much you supplement you will NEVER meet your body's demands.\n\nAlso a blood potassium serum level is inaccurate as it's a snapshot of that exact moment. It needs to be a tissue potassium level\n\nJust wanted to be honest as i use to think i could just supplement or eat a bunch of bananas and be good but i was sitting being told i could die at any moment 👎",
          "created_utc": 1597289396.0
        },
        {
          "id": "g1alaw2",
          "author": "justonium",
          "body": "One thing that helps me I think is just making sure all my foods that I might purge are loaded with potassium to begin with so the stomach doesn't have to add as much of its own supply that it normally extracts out of the serum of the blood. Then I also make sure to drink plenty of chloride-salts afterwards to make sure that gets replaced as well. (And assuming the processes of pumping in hydrochloric acid, and potassium, are factorable separable, then I think this method of potassium-loss prevention should be sound. At least I think the mechanisms are separate, but I should probably make extra sure.)\n\nI never even thought about that tidbit about blood serum not representing potassium abundance directly because most potassium is stored locked within the interiors of our cells. Thanks for pointing out!!\n\nI've been told such doomsday warnings too, but in theory, (and presumably, if the theory has no major deviation from physical reality, in *practice*, as well,) it doesn't matter *how* much of an electrolyte is lost per purge, so long as it is also replenished in likewise copiously large re-plentiful amount.\n\n(Not saying there aren't also other reasons to worry about being bulimic tho, OF COURSE.)\n\nThank you for this very informative reply--if us proles are gonna survive these illnesses that our corporations are seemingly content to inflict upon us by-many-means as they continue to siphon away our health and money, I think we probably needed to continue to work together.",
          "created_utc": 1597291642.0
        }
      ]
    },
    {
      "id": "g1iod39",
      "author": "justonium",
      "body": "One correction:\n\n> we need a high stomach acid content to actually extract potassium also or the molecule can't be broken down enough to be absorbed by the small intestine. So we can eat the highest potassium based foods but if our stomach acid is low then the food isn't broken down enough to even extract it and it passes directly through us.\n\nThis statement presumably applies to potassium locked within the cells of living or previously-living foods.\n\nPotassium that is taken free as a salt such as you took yourself as bicarbonate and chloride *is* already broken down, and free in its most minimal form, free to be absorbed. (And if it still maybe cannot be efficiently absorbed without sufficient stomach acidity, then that would imply that there is an additional function of stomach acidity than just breaking down the cell membranes and cell walls of the tissue that makes up life-based digestive material, and that the acidity is additionally required as part of the transport-mechanism of potassium through the stomach lining. I actually don't believe that this is the case, but if it is it would be good to know, and might explain how even someone who is supplementing with 5g scoops of potassium bicarbonate and potassium-chloride-enriched meals could still maybe remain deficient.",
      "created_utc": 1597462312.0,
      "score": 1,
      "context": [
        {
          "id": "g17cz3p",
          "author": "justonium",
          "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
          "created_utc": 1597231852.0
        },
        {
          "id": "g1ahqtx",
          "author": "lb1986",
          "body": "I supplemented pottasium pills. I even held meals down. I drank tons of water.\n\nMy electrolytes we're dreadful still. What causes the purge to become as dangerous as it became with me was... The acid in our stomach (Hydrochloric Acid) when we purge we lose a huge amount of stomach acid and if most people flush ie water then purge again. We almost have zero stomach acid left in the stomach so your body goes into a frenzy to restore the stomach acid and the main component used is potassium. So say you supplement 1g of potassium in a day. Which is alot for a supplement anyway. A purge may cause your body to use 2g of potassium to restore the acid lost in that one purge. Say you purge twice a day (Some people are even doing 6+ times a day) so it doesn't matter how much you supplement you will NEVER meet your body's demands.\n\nAlso a blood potassium serum level is inaccurate as it's a snapshot of that exact moment. It needs to be a tissue potassium level\n\nJust wanted to be honest as i use to think i could just supplement or eat a bunch of bananas and be good but i was sitting being told i could die at any moment 👎",
          "created_utc": 1597289396.0
        },
        {
          "id": "g1alaw2",
          "author": "justonium",
          "body": "One thing that helps me I think is just making sure all my foods that I might purge are loaded with potassium to begin with so the stomach doesn't have to add as much of its own supply that it normally extracts out of the serum of the blood. Then I also make sure to drink plenty of chloride-salts afterwards to make sure that gets replaced as well. (And assuming the processes of pumping in hydrochloric acid, and potassium, are factorable separable, then I think this method of potassium-loss prevention should be sound. At least I think the mechanisms are separate, but I should probably make extra sure.)\n\nI never even thought about that tidbit about blood serum not representing potassium abundance directly because most potassium is stored locked within the interiors of our cells. Thanks for pointing out!!\n\nI've been told such doomsday warnings too, but in theory, (and presumably, if the theory has no major deviation from physical reality, in *practice*, as well,) it doesn't matter *how* much of an electrolyte is lost per purge, so long as it is also replenished in likewise copiously large re-plentiful amount.\n\n(Not saying there aren't also other reasons to worry about being bulimic tho, OF COURSE.)\n\nThank you for this very informative reply--if us proles are gonna survive these illnesses that our corporations are seemingly content to inflict upon us by-many-means as they continue to siphon away our health and money, I think we probably needed to continue to work together.",
          "created_utc": 1597291642.0
        },
        {
          "id": "g1f723x",
          "author": "lb1986",
          "body": "Hey\n\nI use to also have this mindset with electrolytes etc. Apart from my scare with the TIA i never even knew just how damaging this illness is. It's scarily bad. Weird part is you can feel absolutely fine?\n\nI tried all the potassium loading strategies like yourself also. Seemed i was just not keeping up with the demand? This was also doing a 5g scoop of potassium bicarbonate and also using potassium based salt with a meal that i am guaranteed to keep down!\n\nNot trying to scare btw. Just wanted to let people know just how our body needs a constant supply of nutrition to keep thriving.\n\nAnother part i found out also is we need a high stomach acid content to actually extract potassium also or the molecule can't be broken down enough to be absorbed by the small intestine. So we can eat the highest potassium based foods but if our stomach acid is low then the food isn't broken down enough to even extract it and it passes directly through us.\n\nAre you getting any help at the moment? Or have you thought about reaching out?\n\nI live in the UK and our eating disorder service is very poor sadly. We are only offered a 1 to 1 chat with a dietician. Their isn't a medication directly offered here that's for Bulimia. You know how Prozac is approved for Bulimia? Well here it's only issued as an anti depressant. You can ask though and get it prescribed off label mind. Just be good to have some good services to access.\n\nBest of luck",
          "created_utc": 1597393117.0
        }
      ]
    },
    {
      "id": "g1ip7m3",
      "author": "justonium",
      "body": "Replying to your question to me, yes, I actually have been seeking help, but unfortunately due to some certain world situations, direct help hasn't yet been offered. (Nor would it maybe even be safe or wise, at the present pandemical time.)\n\nIt has been suggested to me to go to an Emergency room, but that sort of just doesn't feel right if I'm not having an acute emergency, and also last time I *did* go, due to almost dying of some [dietary-misinformation-induced](https://www.reddit.com/r/Mneumonese/comments/hgc2dz/some_reallife_backstory_correlary_related_to_my/) near-fatal hyponatremia, they didn't really even listen to my concerns about my specific situation and basically just seemed too busy to do anything more than the routine stuff of doing copious amounts of blood work and then basically just informing me to eat a healthy, balanced diet of all of the typical unhealthy American foods that trigger me and make me continue to be sick, and then move me on out of the hospital as soon as possible so that there is room for the next wave of patients.\n\nIt's hard when you don't have spare money. In older times when I was employed I would have just gone to a Chinese doctor and let them take their measurements and make their assessments and then try to follow all of the advice that they would say. But without money I just honestly don't know what else to do but continue to spend most of my energy towards continued medical self-education using resources like books and reddit.",
      "created_utc": 1597462695.0,
      "score": 1,
      "context": [
        {
          "id": "g17cz3p",
          "author": "justonium",
          "body": "At the least, I'm glad I've learned a thing or two about self-medicating my sodium and potassium levels so I will be at less risk than otherwise. No doctor would ever tell me some of the things I had to figure out myself, they just say u need to stop. But in the mean time I AM STILL SICK so I need to know how to take care of my blood salt concentrations so I don't have a stroke or heart attack and die.\n\nThank you for sharing this. Sometimes after a vomit I feel like this is slowly killing me too, especially if the binge food was fairly toxic too and I am still being harmed by some remaining residue.",
          "created_utc": 1597231852.0
        },
        {
          "id": "g1ahqtx",
          "author": "lb1986",
          "body": "I supplemented pottasium pills. I even held meals down. I drank tons of water.\n\nMy electrolytes we're dreadful still. What causes the purge to become as dangerous as it became with me was... The acid in our stomach (Hydrochloric Acid) when we purge we lose a huge amount of stomach acid and if most people flush ie water then purge again. We almost have zero stomach acid left in the stomach so your body goes into a frenzy to restore the stomach acid and the main component used is potassium. So say you supplement 1g of potassium in a day. Which is alot for a supplement anyway. A purge may cause your body to use 2g of potassium to restore the acid lost in that one purge. Say you purge twice a day (Some people are even doing 6+ times a day) so it doesn't matter how much you supplement you will NEVER meet your body's demands.\n\nAlso a blood potassium serum level is inaccurate as it's a snapshot of that exact moment. It needs to be a tissue potassium level\n\nJust wanted to be honest as i use to think i could just supplement or eat a bunch of bananas and be good but i was sitting being told i could die at any moment 👎",
          "created_utc": 1597289396.0
        },
        {
          "id": "g1alaw2",
          "author": "justonium",
          "body": "One thing that helps me I think is just making sure all my foods that I might purge are loaded with potassium to begin with so the stomach doesn't have to add as much of its own supply that it normally extracts out of the serum of the blood. Then I also make sure to drink plenty of chloride-salts afterwards to make sure that gets replaced as well. (And assuming the processes of pumping in hydrochloric acid, and potassium, are factorable separable, then I think this method of potassium-loss prevention should be sound. At least I think the mechanisms are separate, but I should probably make extra sure.)\n\nI never even thought about that tidbit about blood serum not representing potassium abundance directly because most potassium is stored locked within the interiors of our cells. Thanks for pointing out!!\n\nI've been told such doomsday warnings too, but in theory, (and presumably, if the theory has no major deviation from physical reality, in *practice*, as well,) it doesn't matter *how* much of an electrolyte is lost per purge, so long as it is also replenished in likewise copiously large re-plentiful amount.\n\n(Not saying there aren't also other reasons to worry about being bulimic tho, OF COURSE.)\n\nThank you for this very informative reply--if us proles are gonna survive these illnesses that our corporations are seemingly content to inflict upon us by-many-means as they continue to siphon away our health and money, I think we probably needed to continue to work together.",
          "created_utc": 1597291642.0
        },
        {
          "id": "g1f723x",
          "author": "lb1986",
          "body": "Hey\n\nI use to also have this mindset with electrolytes etc. Apart from my scare with the TIA i never even knew just how damaging this illness is. It's scarily bad. Weird part is you can feel absolutely fine?\n\nI tried all the potassium loading strategies like yourself also. Seemed i was just not keeping up with the demand? This was also doing a 5g scoop of potassium bicarbonate and also using potassium based salt with a meal that i am guaranteed to keep down!\n\nNot trying to scare btw. Just wanted to let people know just how our body needs a constant supply of nutrition to keep thriving.\n\nAnother part i found out also is we need a high stomach acid content to actually extract potassium also or the molecule can't be broken down enough to be absorbed by the small intestine. So we can eat the highest potassium based foods but if our stomach acid is low then the food isn't broken down enough to even extract it and it passes directly through us.\n\nAre you getting any help at the moment? Or have you thought about reaching out?\n\nI live in the UK and our eating disorder service is very poor sadly. We are only offered a 1 to 1 chat with a dietician. Their isn't a medication directly offered here that's for Bulimia. You know how Prozac is approved for Bulimia? Well here it's only issued as an anti depressant. You can ask though and get it prescribed off label mind. Just be good to have some good services to access.\n\nBest of luck",
          "created_utc": 1597393117.0
        }
      ]
    }
  ]
}