{
  "id": "i9yy0k",
  "subreddit": "bulimia",
  "author": "Iloveargyll",
  "created_utc": 1597455964.0,
  "title": "Lived 20+ years with bulimia, please don't follow my example.",
  "selftext": "I am now almost 40. From my early teens I was trying to diet despite not being overweight. This was mainly due to being told over and over by my mother that I was fat. In truth I just was taller and had a larger frame than my mother or my sister. My mother has terrible body image herself and I think projected this onto me. \nAs the diet didn't work because I didn't understand nutrition or have any support and didn't really need to loose weight a spiral of eating and vomiting began. This was from about she 13/14. \nI would look in the mirror and be horrified by my reflection. Now when I look at photos from that time I'm taken aback by how beautiful I really looked but all I saw at the time was fat and ugly.\nI have had a completely unhealthy relationship with food for my whole adult life and pre adult life. \nI kept it a secret not even my best friend or husband really knew about. Sometimes I would starve myself sometimes I would binge and purge. Every night I would think tomorrow will be better but it was always the same.\nIn the last two years I have sought proper help. This was only after I saw my toddler daughter pretend to vomit into the toilet after seeing me do it. I realised how wrong and abnormal it was and just how very long it had gone on. It's time to lay this heavy burden down. \nPlease, please do not follow my example, if you are reading this seek help now. Do not let this illness overshadowed your life like it did me. I am so glad I got treatment and can live largely free from these behaviours. I don't think they will go away on their own, you need to accept it's a problem and to accept help. \nLay this burden down, it does not bring value to anything in your life.",
  "url": "https://www.reddit.com/r/bulimia/comments/i9yy0k/lived_20_years_with_bulimia_please_dont_follow_my/",
  "score": 150,
  "num_comments": 10,
  "comments": [
    {
      "id": "g1iqzrs",
      "author": "fairybee5642",
      "body": "You are worth recovery and so much stronger than you realize. Dont give up! I was bulimic with restriction for 20 yrs and am only 4 years into recovery. Its amazing after so many years of torture how the body wants to heal and really isn't your enemy. ❤",
      "created_utc": 1597463443.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g1jespz",
      "author": "qwertikat",
      "body": "I'm glad you found your wake up call, even if it's after all these years. Sometimes we don't realise how terrible we treat ourselves until we see it happen to people we love doing it to themselves. Things will get better ♥️",
      "created_utc": 1597473630.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g1jh0rf",
      "author": "ssilverliningss",
      "body": "What specifically helped in treatment?  I've binged and purged at least 3 times a day for the last 3 years,and I have been in therapy throughout that time. Even though what my therapists have said makes sense, i can't stop myself from bp'ing. It's such a strong addiction. The only time I've been free of bulimic symptoms was when I was inpatient, and despite my best efforts, I relapsed almost immediately. I don't know what to do, I want to be free of this horrible illness.",
      "created_utc": 1597474645.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1kphta",
      "author": "novabitch",
      "body": "I'm 47 and started around 13 as well. I received treatment in my mid 20s and relapsed by 30. If had therapy on and off but nothing has really worked longer than 1-2 months. The loneliness and isolation of covid has really made me spiral. It's a struggle every damn day.  I can't believe I'm this old and still doing this... Sigh",
      "created_utc": 1597492855.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1mqpns",
      "author": "None",
      "body": "My best wishes and energies to you my friend! You are a fighter! And it’s never ever too late. I’m super proud ❤️",
      "created_utc": 1597516069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1nofac",
      "author": "girlnamedgypsy",
      "body": "I'm 29 and have been struggling with bulimia for 14 years. It's exhausting. The comment you mad about your child pretending to vomit in the toilet after seeing you really got to me. I have a 15 month old. I'm worried how my illness will affect him.",
      "created_utc": 1597526817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1mewx0",
      "author": "Draw_me_a_sheep_",
      "body": "Is it hard to be a mom and teach your daughter healthy « normal » food habits to her? I’m terrified of transferring my food anxiety to my kids once I have them",
      "created_utc": 1597512668.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1sumrt",
      "author": "None",
      "body": "I’m so sorry your daughter saw you purging. I can’t imagine the horror you went through. I am however rlly glad to see you seek help. It’s given me a lot of strength as I always accepted the fact that I will be a 40 year old bulimic. It’s nice to know that it’s never too late to have a turning point. Good luck with recovery!!!",
      "created_utc": 1597633979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1jui86",
      "author": "Iloveargyll",
      "body": "I think the length of time I had the illness was wearing me down and I just felt unwell all the time. I was telling lies to my husband all the time and felt so deceitful. \nI truth I found talking and acknowledging it really helped but accepting my body as imperfect just like everyone's body is made the biggest change. You need to accept yourself for who you are. If I slip up I don't make it into a catastrophe I just say to myself I will start again. Sometimes I have to force myself to sit and not make myself sick. You need to realise the feeling of feeling disgust passes. Distract yourself when that horrible feeling starts and try to do something else. I also find not bingeing help you stop purging and I just don't buy my binge foods anymore. That helps alot because I don't have that horrible overfull disgusting feeling so feel less need to vomit. I also never buy laxatives any more it's just too dangerous to have them in the house.",
      "created_utc": 1597479896.0,
      "score": 4,
      "context": [
        {
          "id": "g1jh0rf",
          "author": "ssilverliningss",
          "body": "What specifically helped in treatment?  I've binged and purged at least 3 times a day for the last 3 years,and I have been in therapy throughout that time. Even though what my therapists have said makes sense, i can't stop myself from bp'ing. It's such a strong addiction. The only time I've been free of bulimic symptoms was when I was inpatient, and despite my best efforts, I relapsed almost immediately. I don't know what to do, I want to be free of this horrible illness.",
          "created_utc": 1597474645.0
        }
      ]
    },
    {
      "id": "g1mjube",
      "author": "Iloveargyll",
      "body": "To be honest I was and am so adept at hiding my behaviour they haven't seen alot if the damage I have done myself. I try to give them good food and very deliberate positive messages about food. When they are older I will talk to them about good body image.",
      "created_utc": 1597514042.0,
      "score": 4,
      "context": [
        {
          "id": "g1mewx0",
          "author": "Draw_me_a_sheep_",
          "body": "Is it hard to be a mom and teach your daughter healthy « normal » food habits to her? I’m terrified of transferring my food anxiety to my kids once I have them",
          "created_utc": 1597512668.0
        }
      ]
    }
  ]
}