{
  "id": "idpaca",
  "subreddit": "bulimia",
  "author": "throwaway926474i2",
  "created_utc": 1597980805.0,
  "title": "Anyone else have a bad grocery shopping habit?",
  "selftext": "**Probably trigger warning here**\n\nI love grocery shopping. Everything about it. This means my kitchen is full of like everything I could ever want. It's so stupid! I wouldn't have all this shit to eat then purge if I didn't have it all right there in my face.\n\nBut like the whole thing of having the list, checking sale flyers, checking things off the list as I go, finding really cool items that my inner self wants to eat (I'm vegan and it's a blessing and a curse that there are soooo many amazing products out there these days) and like come home and find room for it all in the already-full fridge and freezer..\n\n..Then just spend every day staring at the packaging and wanting to eat so many things, talking myself out of it, eventually giving in to some things and having to get rid of it, then of course still feeling bad about eating it in the first place. The whole cycle is so annoying and I can't even binge as much as I would like to cause that too-full feeling happens crazy fast now.\n\nSorry I'm just sitting here trying to understand why I do this. Maybe like, buying the items fulfills part of the craving in the first place? But then it's actually in my house and I have to live with it all.\n\nI'm gonna try really hard to make a conscious effort to buy less stuff.\n\nIs anyone else like this with the grocery shopping?",
  "url": "https://www.reddit.com/r/bulimia/comments/idpaca/anyone_else_have_a_bad_grocery_shopping_habit/",
  "score": 73,
  "num_comments": 14,
  "comments": [
    {
      "id": "g2ap188",
      "author": "tespu123",
      "body": "Same!! I keep checking the sales And stuff thinking of all the food i \"need\". Then buying it knowing i Will feel bad eating it lol ... So far im just trying to not buy anything as long as i have something in the fridge",
      "created_utc": 1597986024.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g2bayja",
      "author": "None",
      "body": "I do this. Sometimes, and this is weird, I make two lists. One of shit I actually want to buy and one fake list. Shit I \"want\" but don't actually want to have in my house. Cherry tomatoes and avocado? Real list. S'mores Poptarts and tortilla chips? Fake list. Sushi rice and cucumber? Real list. Ben & Jerry's and sour patch kids? Fake list. I find the food, look at it, touch it, cross it off the list, and don't put it in my cart. It's the public version of c/s. It's not as satisfying as buying all the junk just like c/s isn't as satisfying as b/p but it feels less like denial than just pretending I don't want it. That vegan Ben and Jerrys hits perfect tho, and it's made the jump from fake list to real list more than once.",
      "created_utc": 1598007318.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g2apfyl",
      "author": "deadcomefebruary",
      "body": "I am HORRIBLE with grocery shopping...I spend way too much money buying clearance crap and binge food AND healthy safe foods and WHY??? I have access to thousands of calories both healthy+fresh and bullshit food at work and there literally no point to eat food at home anymore lol",
      "created_utc": 1597986330.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2cugu3",
      "author": "mushroom_headed",
      "body": "I totally get this, I work at starbucks and they almost always order too many sandwiches and they let the employees take the ones that we cant sell. They last months in the freezer.\n\nRight now I have a freezer full of sandwiches but I refuse to eat solid food most days. I just keep hoarding food I'll never eat, because part of my brain screams to hold on to it in case I ever ran out of money, but when I'm hungry I feel like I don't deserve it, so sometimes I just find myself crying in front of a mountain of breakfast sandwiches.",
      "created_utc": 1598037376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2axctw",
      "author": "wohtevar",
      "body": "I do this too! I feel terrible because I buy so much food only to either throw it up or end up throwing it away because it expired.",
      "created_utc": 1597993118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2boqcw",
      "author": "dolefulAlchemist",
      "body": "Yeah. I only buy things I know I'm eating that day, and long-lived food like porridge. I only go into the kitchen at 4am because of severe anxiety (and most of the times I'm asleep) so I put stuff like pasta and things that have to be cooked in there. It's a bit annoying never being able to grocery shop for the week, and most of the time I'm just eating porridge all day because I don't wanna go out, but I'm trying to recover and this is what works for me.",
      "created_utc": 1598017491.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2br8y9",
      "author": "annaeatk",
      "body": "I used to do this all the time, now I try to stick to my list because for one I’m semi trying to recover (not actively, but I also don’t want to do this shit anymore) and I spend waaaay to much on food because I also end up eating out once or twice a week cause of my busy schedule and then it just all feels like a waste of food and money. I was spending upwards of $250 a week on food (for my bf as well) and I just can’t afford that. Trying to cut that in half now...not entirely successful, but hopefully I’ll get there eventually. I like the other redditors comment where they had a real vs. fake list, I wonder if that would be satisfying at all.",
      "created_utc": 1598018903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2e4sp5",
      "author": "throwaway926474i2",
      "body": "OP here- I did better on today's shopping trip!\n\nI stared at those vegan brownies so hard, saved myself the trouble and didn't get any! Also these vegan mini blueberry muffins were on a BOGO sale, a friggin BOGO sale, I picked up a box and was like \"am I really gonna make myself eat all these damn muffins in the next two days\" and put it back. Phew. I only got one \"bad\" thing which was refrigerated cookie dough, but it's refrigerated so it can stay there for a while.\n\nI tried to focus more on food for my kid, that actually helped cause I get the joy of buying but also the joy of it being stuff I'm not tempted to eat myself so a win-win. (Cause I feed her healthy, while I like to eat mostly garbage lol. Well not garbage but a lot of stuff I wouldn't let her eat anytime soon)",
      "created_utc": 1598062129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4542py",
      "author": "StrongEntrepreneur99",
      "body": "the worst are expensive healthy versions of junk food 🤣",
      "created_utc": 1715772859.0,
      "score": 1,
      "context": [
        {
          "id": "g2apfyl",
          "author": "deadcomefebruary",
          "body": "I am HORRIBLE with grocery shopping...I spend way too much money buying clearance crap and binge food AND healthy safe foods and WHY??? I have access to thousands of calories both healthy+fresh and bullshit food at work and there literally no point to eat food at home anymore lol",
          "created_utc": 1597986330.0
        }
      ]
    },
    {
      "id": "g2b0la9",
      "author": "None",
      "body": "Same here... I am so bad with making lists and sticking to them too. So I go to the store, get what’s on my list and way more, find out I basically already have a whole bin of chocolate and sweets and snacks and didn’t need to buy new stuff so I feel bad and feel pressured to eat way more than I need to because it will expire otherwise... Food still expires. I have a weird thing where if I know I’ve had an item long enough it’s “gone bad” in my mind and I won’t eat it. Go to the store because even with a full pantry “there’s nothing to eat”. Repeat",
      "created_utc": 1597996369.0,
      "score": 3,
      "context": [
        {
          "id": "g2axctw",
          "author": "wohtevar",
          "body": "I do this too! I feel terrible because I buy so much food only to either throw it up or end up throwing it away because it expired.",
          "created_utc": 1597993118.0
        }
      ]
    },
    {
      "id": "g2bct3z",
      "author": "peanutbutterandjoe",
      "body": "This used to be the absolute worst habit for me, I felt so powerless but I recently gave up going to the grocery store and have started doing a weekly online grocery shop. I completely miss the grocery store, but it’s made it so I can allow myself a treat a week and know that at least the food in my house is safe",
      "created_utc": 1598009062.0,
      "score": 1,
      "context": [
        {
          "id": "g2axctw",
          "author": "wohtevar",
          "body": "I do this too! I feel terrible because I buy so much food only to either throw it up or end up throwing it away because it expired.",
          "created_utc": 1597993118.0
        }
      ]
    },
    {
      "id": "l45i5k2",
      "author": "deadcomefebruary",
      "body": "3 years down the road, I can tell you...I am in a WAY different spot now. Still do a lot of clearance shopping (actually, I have some cool clearance stores in my area where I buy almost all of my groceries!) And even though it's still a struggle,  I'm on Concerta now which helps MAJORLY. Was on Vyvanse,  until it got too hard to find. And I don't work food service anymore, another huge help, and I finally cut out all except a bit of sugar, which is just too big a trigger for me",
      "created_utc": 1715779177.0,
      "score": 1,
      "context": [
        {
          "id": "g2apfyl",
          "author": "deadcomefebruary",
          "body": "I am HORRIBLE with grocery shopping...I spend way too much money buying clearance crap and binge food AND healthy safe foods and WHY??? I have access to thousands of calories both healthy+fresh and bullshit food at work and there literally no point to eat food at home anymore lol",
          "created_utc": 1597986330.0
        },
        {
          "id": "l4542py",
          "author": "StrongEntrepreneur99",
          "body": "the worst are expensive healthy versions of junk food 🤣",
          "created_utc": 1715772859.0
        }
      ]
    },
    {
      "id": "l4cmlyb",
      "author": "StrongEntrepreneur99",
      "body": "i wish i could be on adhd meds too but can't for long story reasons :<",
      "created_utc": 1715887580.0,
      "score": 1,
      "context": [
        {
          "id": "g2apfyl",
          "author": "deadcomefebruary",
          "body": "I am HORRIBLE with grocery shopping...I spend way too much money buying clearance crap and binge food AND healthy safe foods and WHY??? I have access to thousands of calories both healthy+fresh and bullshit food at work and there literally no point to eat food at home anymore lol",
          "created_utc": 1597986330.0
        },
        {
          "id": "l4542py",
          "author": "StrongEntrepreneur99",
          "body": "the worst are expensive healthy versions of junk food 🤣",
          "created_utc": 1715772859.0
        },
        {
          "id": "l45i5k2",
          "author": "deadcomefebruary",
          "body": "3 years down the road, I can tell you...I am in a WAY different spot now. Still do a lot of clearance shopping (actually, I have some cool clearance stores in my area where I buy almost all of my groceries!) And even though it's still a struggle,  I'm on Concerta now which helps MAJORLY. Was on Vyvanse,  until it got too hard to find. And I don't work food service anymore, another huge help, and I finally cut out all except a bit of sugar, which is just too big a trigger for me",
          "created_utc": 1715779177.0
        }
      ]
    },
    {
      "id": "l4dgly0",
      "author": "deadcomefebruary",
      "body": "Sorry to hear that :/",
      "created_utc": 1715898627.0,
      "score": 1,
      "context": [
        {
          "id": "g2apfyl",
          "author": "deadcomefebruary",
          "body": "I am HORRIBLE with grocery shopping...I spend way too much money buying clearance crap and binge food AND healthy safe foods and WHY??? I have access to thousands of calories both healthy+fresh and bullshit food at work and there literally no point to eat food at home anymore lol",
          "created_utc": 1597986330.0
        },
        {
          "id": "l4542py",
          "author": "StrongEntrepreneur99",
          "body": "the worst are expensive healthy versions of junk food 🤣",
          "created_utc": 1715772859.0
        },
        {
          "id": "l45i5k2",
          "author": "deadcomefebruary",
          "body": "3 years down the road, I can tell you...I am in a WAY different spot now. Still do a lot of clearance shopping (actually, I have some cool clearance stores in my area where I buy almost all of my groceries!) And even though it's still a struggle,  I'm on Concerta now which helps MAJORLY. Was on Vyvanse,  until it got too hard to find. And I don't work food service anymore, another huge help, and I finally cut out all except a bit of sugar, which is just too big a trigger for me",
          "created_utc": 1715779177.0
        },
        {
          "id": "l4cmlyb",
          "author": "StrongEntrepreneur99",
          "body": "i wish i could be on adhd meds too but can't for long story reasons :<",
          "created_utc": 1715887580.0
        }
      ]
    }
  ]
}