{
  "id": "idrzmw",
  "subreddit": "bulimia",
  "author": "SupremeWaifu69",
  "created_utc": 1597993225.0,
  "title": "I’m tired of cycling between EDs. Currently in my ‘bulimia’ phase for the past 1 year and it feels like there’s no way out",
  "selftext": "I try to be healthy. Oops, orthorexia. So I’ll let go. Oops, BED. So I’ll stop eating. Oops, anorexia. So I’ll try to eat again but I’ll be so scared of gaining. Oops, bulimia. \n\nIs anyone else stuck in this cycle? It’s been like this since I was 13. Constantly cycling through different eating disorders through out my life and never being ‘close to recovery’, instead I fall from one unhealthy pattern or habit to another no matter what I do even when I go to therapy or take meds :/ \n\nI just turned 20 a few months ago and I’m so fucking angry I’m entering my 20s still carrying with me my teenage problems. Idk. I’m upset and tired and I’m getting sick both physically and mentally the longer I’m in this cycle. I’m fatigued and malnourished and I don’t have energy for anything + I’m isolating myself from everyone and idk what to do anymore. Just venting bc I have nowhere else to write this at.",
  "url": "https://www.reddit.com/r/bulimia/comments/idrzmw/im_tired_of_cycling_between_eds_currently_in_my/",
  "score": 83,
  "num_comments": 9,
  "comments": [
    {
      "id": "g2az858",
      "author": "DUCKWORSHIP",
      "body": "Are. You. Me?\n\nI really wish there was a 'miracle cure' to all this bs. I  have been engaging in these behaviours for so long that I've come to a point where I don't think I'll ever recover and 'go back to normal' (like whatever that is). I'm sorry you're suffering so much, I really wish I could help you out (ᗒᗣᗕ)՞  I'm always here if you need to talk ♡",
      "created_utc": 1597994978.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g2bscny",
      "author": "ilikekneesandbees",
      "body": "Yes m'am, similar to you, this started when I was 11 and I'm now 20 so :/",
      "created_utc": 1598019496.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g2bvcd9",
      "author": "None",
      "body": "Yeah I’ve been like that since I was 6, first started the binge eating, then I became vegetarian so I started restricting, turned into orthorexia then full blown anorexia, couple of years later binge eating and then bulimia. \n\nNow I’m stuck in between anorexia with purging episodes but not full blown bulimia. It’s been 19 years of my life wasted with an awful relationship with myself and food.\n\nIt’s been hellish with the pandemic my mental health has been torn into pieces and now I’m just waiting for death to kick me.\n\nSend you a hug OP, it’s rough dealing with all this crap.",
      "created_utc": 1598021073.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2cnugq",
      "author": "None",
      "body": "Hi. \n\nThis has been my life for the last 40 years. I’m 53 now. My biggest problem was with bulimia I suppose. Never had a stable weight. I used to SH as well. \n\nIn the last 18 months I eat pretty healthily though and I really feel that I will never be troubled by bulimia again. I’m not happy with my weight (overweight) but don’t want to reduce intake as this is a slippery slope. The major factor in my eating better/more regularly etc is that I no longer life alone. \n\nI’ve had a lot of therapy,taken a lot of meds. I currently take an AD only. \n\nI honestly don’t know if therapy helped me see things any more clearly. It kept me alive though, having someone who was there to listen. Still have so mush self doubt and hatred. \n\nPlease try and ‘tackle’ this NOW. The longer you have these behaviours, the harder it is to stop. Have you tried therapy?\n\nYou’re not alone OP. It really is a horrible way to live. I don’t know what else to say but if you want to pm me please feel free.",
      "created_utc": 1598034168.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2ojcdp",
      "author": "None",
      "body": "Oh god, it's so true! And the thing is, I get SO EXCITED when I switch! Like, I'm bored of restricting, I'm going to go to the shop and get WHATEVER I WANT, ALL THE SUGAR!!!! Doesn't matter cos I'm gonna puke, bulimia for the win! Life hack! \nThen it switches to don't puke! Hold the food! Binge eat the healthy food! Feed your body! Workout goddess!\nThen ffs I'm so fat! over 50kg is disgusting! fasting lifestyle! watch all the cole videos and feel all Russian ballerina. Miss smoking. God I'm such a twat. Repeat.",
      "created_utc": 1598268395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2bvi4d",
      "author": "brookleiaway",
      "body": "For me It feels like I’ll never escape because it’s so hard for me to loose weight, all the personalized programs and diets cost money but not anorexia",
      "created_utc": 1598021155.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2c3u7v",
      "author": "casadecarol",
      "body": "There is a better way.",
      "created_utc": 1598025215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2ccozs",
      "author": "peafowlontheprowl",
      "body": "I swear I could have written this\nI’m sorry dude",
      "created_utc": 1598028992.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2detwt",
      "author": "marqguz",
      "body": "I’m 25 now and have been dealing with this exact problem since I was way too young to be thinking about my weight :/ I don’t mean for this to discourage you. I recently finally “came out” and it’s helped a lot, I’m still nowhere near close being healthy and recovered but it helps to sort of joke about it with my boyfriend and family. Makes me feel like it’s not the end of the world",
      "created_utc": 1598047531.0,
      "score": 1,
      "context": []
    }
  ]
}