{
  "id": "ilzmco",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1599159193.0,
  "title": "Anyone here who doesn't hate their body but still has an ED?",
  "selftext": "I'm what the title says. I don't think my body is fat or ugly, I think it's pretty beautiful (although sometimes my tummy gets bloated and it triggers me). But I still suffer from bulimia, I suppose my bulimia stems from a fear of \"getting fat\". Anyone else like this???",
  "url": "https://www.reddit.com/r/bulimia/comments/ilzmco/anyone_here_who_doesnt_hate_their_body_but_still/",
  "score": 78,
  "num_comments": 19,
  "comments": [
    {
      "id": "g3w8s25",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1599163517.0,
      "score": 38,
      "context": []
    },
    {
      "id": "g3w4hhp",
      "author": "Nicolo_Ultra",
      "body": "TW, #s:\n\nTotally. I have a very nice body that is toned and well proportioned; I mean this in a total non-brag way but just to echo your point and provide context. I work hard for my body at the gym and am maintaining a BMI of 19. I also have a fear of getting fat, although I never have been higher than a BMI around 22.\n\nYes, I would like to be underweight like i was for years as an anoretic. But for right now, I'm ok maintaining and the disordered thoughts aren't so bad. I'm in a good place in my life so I'm not sure why my ED is still around. Sometimes I think I'm just bulimic because I'm bad at dieting and hate being hungry. When I'm alone I find great entertainment and joy in eating whatever the fuck I want, enjoying the taste, and I really enjoy the sensation of purging and the feeling afterwards. I dunno, it's truly fucked my man.",
      "created_utc": 1599162091.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g3xfzlz",
      "author": "Brave_Appointment",
      "body": "That was totally me! I had a great fit physic as a runner, sadly bulimia actually changed that and now I am actually on the overweight side. It's crazy that the ED I developed to keep from gaining weight did EXACTLY the opposite 😂 Dang, I wish I never started, but all I can do now is recover and move on 💙",
      "created_utc": 1599179071.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g3wndq0",
      "author": "None",
      "body": "There was a time when I didn’t hate my body but still very much had an ED! It was more about the addiction to purging and control for me. I just hated the way food and liquids felt in my stomach",
      "created_utc": 1599168566.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g3x2cz4",
      "author": "BurbieNL",
      "body": "Yes I'm actually very happy with my body at the moment, but only because I'm at my 'goal weight' (which is just above underweight) and I go to the gym regularly so I also have some muscle.\nThe fear of gaining weight is very strong, and there have been times in my life when I was a bit heavier, although never overweight, and in those moments I wasn't really happy with how my body looked.\nI also get a lot of compliments on my thin body and it makes the fear of gaining weight even stronger, especially if those compliments come from a partner. I've told my boyfriend those compliments are actually triggering so he stopped doing it, but I still feel like he wouldn't like me as much if I gained weight.",
      "created_utc": 1599174135.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3xffiw",
      "author": "goudabeluga",
      "body": "In the early, and more restrictive, years of my ED I hated my body. Couldn’t look at myself, felt like everyone was constantly making fun of me, didn’t even feel like I looked human. Over the years it’s changed, so that now I generally feel pretty neutral about my body- never beautiful, but never like I’m a monster. I want to be thinner, but I think my fear of getting fat is what’s driving my ED at this point. Like if I stayed at my cw forever I’d be fine, but the thought of gaining even a couple pounds is terrifying. I’m always terrified I’ll start eating and never be able to stop, and that’s how I started purging, not to lose weight so much as just to not gain. \n\nFor me, it seems like the amount I hate my body has very little to do with my weight, and more about how much I hate myself and my life. I’m at a point now where I’m doing well in college, finally made some friends, feel like an overall decent person. But when my ED started, I’d just dropped out of high school, had no friends, no plans for my future, felt like a total failure... it was a lot easier to put all that hatred and disappointment I felt about myself on my body and focus on what felt like the easiest part of me to fix at the time, as if being thin enough could at least give me something to like/be proud of.\n\nBut it’s still really weird that I’m a lot of ways, my ED has been so much worse (much more frequent b/p) for the past year even though I’ve started to be ok with my body most of the time. Makes me question sometimes if I actually have an ED, or just addicted to food and the rush I get from b/p at this point",
      "created_utc": 1599178758.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3x7ixu",
      "author": "allofthecheeseplease",
      "body": "100%. I know I’m not fat; I haven’t been overweight since I was a kid. I was bulimic for eight years, not as a way to lose weight (well, sometimes, but not in a major way) but as a way to prevent gaining. \n\nI have been in shape, objectively slender / athletic, but it didn’t stop me from puking six times a day and eating laxatives like they were candy.",
      "created_utc": 1599175818.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3xi1ry",
      "author": "None",
      "body": "Mine is bc I love to eat and I don't want to get fat. I don't think I need to lose weight (well maybe a couple lbs) and I don't think I'm ugly.",
      "created_utc": 1599180181.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3xr1o8",
      "author": "kayleighsucks",
      "body": "I do. I grew up malnourished and being shamed for my body. I love my body now but I still get the urge to “empty” and “cleanse” myself after I’ve eaten sometimes. It’s very weird.",
      "created_utc": 1599185121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3y06og",
      "author": "withonlygrace",
      "body": "Yep, I feel this. I like my body, which bulimia gave me, and I’m anxious about losing it.",
      "created_utc": 1599190481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3y18jd",
      "author": "bonusbobcat",
      "body": "Yep. When I was really restrictive when I was younger and HATED my body. But when I relapsed in my late 20's into proper massive binge/purge bulimia it was in response to not being able to cope with a severe bipolar episode. I lost a lot of weight but I just didn't care. I wouldn't say I'm totally body confident but I'm ok with it, like it's fine...",
      "created_utc": 1599191133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3y3wbd",
      "author": "queenseauni",
      "body": "Yes. I’m the “smallest” sized in my family and when they started picking on me for finally gaining weight after struggling to forever, when I was teen, that’s when bulimia started.",
      "created_utc": 1599192840.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3y4rx3",
      "author": "elpintor91",
      "body": "Yes. I could stand to lose about 15 pounds but I don’t hate looking at myself or feel disgusting in clothes. It’s really just more like a sad reality I feel like. Like paying a bill or putting gas in my car. I don’t want to do it but I have to or else then I’ll really hate my SELF for letting myself eat so Much. if I just let the food digest I get so much anxiety but if I press paused and stayed how I look I wouldnt be mad.",
      "created_utc": 1599193408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3yflax",
      "author": "Redhawkgirl",
      "body": "For me it wasn’t about my body it was about emotional numbing",
      "created_utc": 1599201889.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3wnje4",
      "author": "Bear2Pants",
      "body": "It is true for me as well except I do hate my body. People at my new job and last comment on how small I am a lot which is embarrassing but feels food in the moment but later I start to panic thinking \"Oh s***, if I recover and gain weight they will think I've let myself go! I guess I have to keep this charade up so they don't judge me!\". It also makes me realize how much people DO pay attention to how I look, my size etc",
      "created_utc": 1599168630.0,
      "score": 6,
      "context": [
        {
          "id": "g3w8s25",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1599163517.0
        }
      ]
    },
    {
      "id": "g3wk0ba",
      "author": "None",
      "body": "i really relate to this, you worded it perfectly",
      "created_utc": 1599167330.0,
      "score": 6,
      "context": [
        {
          "id": "g3w8s25",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1599163517.0
        }
      ]
    },
    {
      "id": "g3y02rx",
      "author": "withonlygrace",
      "body": "I relate to this so hard! I love being called pretty but it also triggers me because I think, “well, you’re pretty because you’re skinny. If you were fat no one would think you were pretty. You better try to stay thin so you don’t lose your beauty and social privilege.” I do think I’m pretty, but I know my beauty is conditional on my size. I also think being pretty is one of the only things I have going for me.",
      "created_utc": 1599190413.0,
      "score": 2,
      "context": [
        {
          "id": "g3w8s25",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1599163517.0
        }
      ]
    },
    {
      "id": "g40gq69",
      "author": "itrippeduplife",
      "body": "I really wish I didn’t enjoy purging but it’s such a rush almost feels powerful",
      "created_utc": 1599240636.0,
      "score": 3,
      "context": [
        {
          "id": "g3w4hhp",
          "author": "Nicolo_Ultra",
          "body": "TW, #s:\n\nTotally. I have a very nice body that is toned and well proportioned; I mean this in a total non-brag way but just to echo your point and provide context. I work hard for my body at the gym and am maintaining a BMI of 19. I also have a fear of getting fat, although I never have been higher than a BMI around 22.\n\nYes, I would like to be underweight like i was for years as an anoretic. But for right now, I'm ok maintaining and the disordered thoughts aren't so bad. I'm in a good place in my life so I'm not sure why my ED is still around. Sometimes I think I'm just bulimic because I'm bad at dieting and hate being hungry. When I'm alone I find great entertainment and joy in eating whatever the fuck I want, enjoying the taste, and I really enjoy the sensation of purging and the feeling afterwards. I dunno, it's truly fucked my man.",
          "created_utc": 1599162091.0
        }
      ]
    },
    {
      "id": "g3wc6ik",
      "author": "graamatvede",
      "body": "same here",
      "created_utc": 1599164661.0,
      "score": 3,
      "context": [
        {
          "id": "g3w4hhp",
          "author": "Nicolo_Ultra",
          "body": "TW, #s:\n\nTotally. I have a very nice body that is toned and well proportioned; I mean this in a total non-brag way but just to echo your point and provide context. I work hard for my body at the gym and am maintaining a BMI of 19. I also have a fear of getting fat, although I never have been higher than a BMI around 22.\n\nYes, I would like to be underweight like i was for years as an anoretic. But for right now, I'm ok maintaining and the disordered thoughts aren't so bad. I'm in a good place in my life so I'm not sure why my ED is still around. Sometimes I think I'm just bulimic because I'm bad at dieting and hate being hungry. When I'm alone I find great entertainment and joy in eating whatever the fuck I want, enjoying the taste, and I really enjoy the sensation of purging and the feeling afterwards. I dunno, it's truly fucked my man.",
          "created_utc": 1599162091.0
        }
      ]
    },
    {
      "id": "g3xde96",
      "author": "annaeatk",
      "body": "I totally relate to that. I have stress in my life, but not an unusual amount and I’m pretty secure in most aspects so I don’t understand why I can’t just stop purging everyday. I don’t even really like to binge anymore or rarely do, I just like enjoying high calorie foods until I’m full and then purging them. I wish I could just stop and diet normally to get rid of the last ten lbs I wanted to lose (even though I look perfectly healthy and good at this weight too) and have a healthy relationship with food but I don’t know if that’s in the cards for me after 10 years of this shit.",
      "created_utc": 1599177826.0,
      "score": 3,
      "context": [
        {
          "id": "g3w4hhp",
          "author": "Nicolo_Ultra",
          "body": "TW, #s:\n\nTotally. I have a very nice body that is toned and well proportioned; I mean this in a total non-brag way but just to echo your point and provide context. I work hard for my body at the gym and am maintaining a BMI of 19. I also have a fear of getting fat, although I never have been higher than a BMI around 22.\n\nYes, I would like to be underweight like i was for years as an anoretic. But for right now, I'm ok maintaining and the disordered thoughts aren't so bad. I'm in a good place in my life so I'm not sure why my ED is still around. Sometimes I think I'm just bulimic because I'm bad at dieting and hate being hungry. When I'm alone I find great entertainment and joy in eating whatever the fuck I want, enjoying the taste, and I really enjoy the sensation of purging and the feeling afterwards. I dunno, it's truly fucked my man.",
          "created_utc": 1599162091.0
        }
      ]
    }
  ]
}