{
  "id": "inwx5q",
  "subreddit": "bulimia",
  "author": "Luluvirginia2000",
  "created_utc": 1599436658.0,
  "title": "I finally told my friends about my ED but not at all how I wanted",
  "selftext": "I stayed over at a friends apartment this weekend with my roommates. We all had a lot of fun but I didn’t watch myself and had way too much to drink and ended up giving myself alcohol poisoning. My friends were taking care of me and in my blackout I told them that “I’m good at throwing up because I’m bulimic” i later came too after much more throwing up and they told me what I had said to them. I was so embarrassed. My friend told me we would talk about it in the morning but when the next day came I asked her to confirm again if what she told me I said was true. Once she did we didn’t talk about it anymore. I feel conflicted about this, I don’t want them to treat me differently because of my ED but I was glad they were worried enough about it to have a conversation. Should I bring it up to them again now that I’m sober or should I just leave it alone for fear of looking like I’m seeking out attention and their pity.",
  "url": "https://www.reddit.com/r/bulimia/comments/inwx5q/i_finally_told_my_friends_about_my_ed_but_not_at/",
  "score": 86,
  "num_comments": 10,
  "comments": [
    {
      "id": "g4aayt9",
      "author": "Briannna0",
      "body": "It sounds like your friend cares and is giving you the space to open up without prying you for information. She sounds like a good friend to confide in.",
      "created_utc": 1599439765.0,
      "score": 57,
      "context": []
    },
    {
      "id": "g4aaf2l",
      "author": "None",
      "body": "They can clearly handle it, I say you should tell them more. Not to mention that they can offer support.",
      "created_utc": 1599439423.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g4aikt3",
      "author": "None",
      "body": "Do you have anyone in your life who knows about your ED? It’s important to have at least a few people to support you. If they feel burdened by your problems they aren’t real friends.",
      "created_utc": 1599444441.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g4bfyby",
      "author": "OctopuBanana",
      "body": "I would talk to them. If you're insecure about sounding like you're seeking attention - tell them exactly that. Say you really don't want to come across as someone who just wants pity but you want to share your issues with someone because you trust them and they offered support. They will understand.",
      "created_utc": 1599472498.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4bikoi",
      "author": "krykry10",
      "body": "I don't think you'd be coming off as asking for attention or pity, although I totally get that fear.\n\nIf one of your friends did the same thing- casually mentioning a mental health issue- would you want to comfort them? If so, then I'd say talk to them about your bulimia again. It's always hard to talk about in the beginning but gets easier for both individuals over time.",
      "created_utc": 1599475514.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4bvuqz",
      "author": "workingonselfkind",
      "body": "Also, EDs thrive on secrecy so if you are anxious and awkward- maybe it’s just the disorder being threatened.",
      "created_utc": 1599486329.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4bvru0",
      "author": "workingonselfkind",
      "body": "Maybe it’s a good thing? You don’t have to be alone with it. Now that they know I would probably take time to meet with them and start with- I feel really uncomfortable with what I told you and would have preferred that I told you differently. If they are good friends they may ask how they can be supportive and it’s ok if you don’t know know. Let them know that you are the same person as you were before you told them and want to be treated the same. Best of luck!",
      "created_utc": 1599486290.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4cbo4w",
      "author": "None",
      "body": "I would venture to guess they just don’t know what to say. Here are some potential reasons (not necessarily true!): \n\nThey feel weird for not knowing\nThey don’t know what to say (big one)\nThey want to help but don’t know how\n\nMy MIL told our family she’s had bulimia for 50 years. We had NO idea. None of her kids knew she’d been numeric their entire childhood. What a shock. She went into 2 residential programs. They didn’t know what to say or do. It’s hard to know if we should ask about it. But we LOVE her and care for her wellbeing. We don’t know when she’s relapsing. But we care a lot. \n\nJust some thoughts. Sending love!",
      "created_utc": 1599493307.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4bg76f",
      "author": "antiquetears",
      "body": "This. \n\nI personally would want to tell them that I was, “sorry for saying something like that out of the blue,” and that I appreciate them looking after me, “but I don’t feel ready to discuss the topic,” or whatever. \n\nBut if you are ready or want to give it a try then you can change up the lines. That’s just what I would say personally. It really depends on what you want to say.",
      "created_utc": 1599472782.0,
      "score": 8,
      "context": [
        {
          "id": "g4aayt9",
          "author": "Briannna0",
          "body": "It sounds like your friend cares and is giving you the space to open up without prying you for information. She sounds like a good friend to confide in.",
          "created_utc": 1599439765.0
        }
      ]
    },
    {
      "id": "g4ce9pd",
      "author": "Luluvirginia2000",
      "body": "After this whole thing it went from 0 to 7 people",
      "created_utc": 1599494348.0,
      "score": 3,
      "context": [
        {
          "id": "g4aikt3",
          "author": "None",
          "body": "Do you have anyone in your life who knows about your ED? It’s important to have at least a few people to support you. If they feel burdened by your problems they aren’t real friends.",
          "created_utc": 1599444441.0
        }
      ]
    }
  ]
}