{
  "id": "ip5x7p",
  "subreddit": "bulimia",
  "author": "Lythrines",
  "created_utc": 1599612322.0,
  "title": "How I overcame my bulimia",
  "selftext": "Hello guys✨, \nI thought I wanted to share some tips with you, on how I overcame my eating disorder.\n\n[Disclaimer] the following suggestions are based on my own experience.Keep in mind that everybody is different and only because it worked for me, doesn't mean it works for you too.\n\nMy first suggestion may be one of the hardest if you haven't already done this: try to speak with a trusted person about your eating disorder. I promised the moment you talk about it it will get easier.\n\nIt is important to understand that this sets the focus on stopping the circle of binging and purging. \nI want to share with you some ideas on how you can prevent binging in the first place: \n\nI know you can lose your sense of hunger and satiation during an eating disorder, but before you start to eat try to ask yourself the following questions: \"do I want to eat because i'm hungry and because my body needs the energy? Do I want to eat because my body needs die nutrition? Or do I want to eat because I'm bored, unhappy or stressed?🤔\nIs really important that you start to eat balanced, healthy and regular meals. This will help you prevent binging.\nI know it can be really hard to know what kind of meal or what amount of food is appropriate, because you kind of loose reality during an eating disorder.\n\nEspecially if you are still living and eating with your parents or eating a lot out, it can be helpful to start cooking by your own more often. It helped me back then to orientate at certain guidelines for how to build a meal, you can look this up online or consult an nutritionist (hard to afford I know). But please (especially online) don't get lost in dieting tips or obsess over calories, just make sure that you get all the nutrients and enough protein, because your health is more important than the \"perfect body\".\n\nThe mistake I made very often was that I tried too hard to eat \"clean\" which was basically just another obsession. Don't try to save up most calories possible. If you want to add extra olive oil to your noodles or cheese on your vegetable lasagna, then do it😄 if you try so hard to make your meals healthy that it starts to impact the taste of your food, than you're overthinking. You have to learn enjoying cooking and eating again, so you'll loose the fear of calories. Don't be afraid of healthy fats like avocado or coconut oil, they're good for you.\nLearn to worship your food by eating slower and without getting distracted from your phone etc. Do the things you can't do while binging, start to taste and celebrate your food again, smell how nice it is. 🥑🌮🍒\nVery important: don't restrict certain kinds of food. \n\nIf you enjoy cooking you can try to make foods like pizza in a healthier version, maybe try dough out of chickpeas?\n\nDuring my bulimia I would've never eaten pizza without binging after it. Every meeting with friends was uncomfortable for me because I didn't want to eat. But keep a healthy balance between healthy and unhealthy foods. If you want that chocolate? Eat it!!!!✨ Maybe the 80/20 rule could help you, where you basically eat 80% healthy and 20 percent not clean or unhealthy foods.\n\nKeep in mind that you'll feel better and get healthy if you eat properly. Stay satiated so you don't binge as often, but if you feel the urge to eat something special that just do it. But try to keep the control I know controlling yourself is the hardest part. Maybe distract yourself, start cooking or go out for a walk. At my worst times I always used to cook more the day before so I always had healthy meal in teh fridge because I mostly binged after school when I was to tired to cook properly so I started eating everything around the house.\n\nSo keep track of your eating attacks and try to find out trigger foods or situations when it happens the most, try to see pattern and correct them.\n\nThese tips might help you to binge less but they can't prevent every relapse, so it's  important to never give up and at least don't purge after binging. Purging is way more worse than binging and most times you first stop purging and then control your binging. I experience even today some binging but it's how you cope with it.\nHere are ways to stop purging, even if you ate a lot:\n\nFirst of all stay calm, and don't be ashamed of yourself. You may feel disgust or you feel way to fulfilled. Remind yourself how unhealthy purging is. EVEN IF YOU PURGED ALREADY 4 TIMES THIS DAY, THE 5TH TIME STILL MATTERS. EVERY TIME YOU DIDN'T PURGE COUNTS AND IS A SUCCESS. DON'T TELL YOURSELF THAT YOU'LL STOP PURGING TOMORROW, IT WONT WORK. YOUR CHANGE BEGINS HERE AND NOW. sorry that I yelled at you hun💜🥺👉🏻👈🏻\n\nWhen I binged I always made me a nice cup of my favourite tea with honey and lemons, I always felt less full and more comfortable after.\n\nStop your overthinking on how many calories you ate etc. It's to late, you can only make it better next time, but please don't purge. I know how hard it is. God I had times where I wanted to cut the food out of my stomach with a knife (meterphorically)😶 but I stayed strong. If you can't keep your mind off, try to watch your favourite movie or sleep. If you sleep, than you can't purge right? I at some point just developed a \"fuck this shit even if I'm getting fat, I won't purge again\" attitude, where I just consequently kept the food in and cried myself to sleep. Sounds hard but I got it after the 30th time. Always keep in mind that stopping this cruel spiral of binging and purging is way more important for your body, wellbeing, and social life than being skinny. You might not see it now but you will thank yourself later.\n\nIt probably helps you to know that if you're really unhappy with your body, if you eat properly and get healthier your body will change for the better. Personally my hair got after 1 year of being ED free, way thicker and shinier, my body started to store the fat in the right places, I basically got my boobs and my ass back lol 🙊👀and I generally feel so happy right now. It sounds weird but what helped me back then to start loving and accepting my body was dancing in lingerie in front of my mirror to my favourite songs but maybe you'll find your own way haha. Try buying only clothes you feel nice in, or going out for a walk more often😄\n\nI wish you all only the best! If I think back at this dark time of my life I get so sad, it really breaks my heart imagining how many people ,especially young women struggling with the same problems and basically wasting so much time and energy. If you have any questions feel free to dm me.✨🌈\n\nAnd sorry for the spelling, English is not my first language 😬",
  "url": "https://www.reddit.com/r/bulimia/comments/ip5x7p/how_i_overcame_my_bulimia/",
  "score": 70,
  "num_comments": 3,
  "comments": [
    {
      "id": "g4j0zev",
      "author": "allychaan",
      "body": "Not bulimia specific advice but consistent meal times are also important! I have BED (with some occasional purging if its REALLY bad) but setting meal times for myself and being consistent with them has helped me loads. Obviously there are some bad days but compared to what it was before its much better :)",
      "created_utc": 1599638752.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4ill9f",
      "author": "riversandroads8888",
      "body": "Thank you for the encouragement!! Great advice!",
      "created_utc": 1599624885.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4t158b",
      "author": "justonium",
      "body": "Totally resonate with the bits about putting more care and appreciation into cooking and eating.\n\nMaybe not quite so much about holding down even a really bad binge; like especially bad for me if I ate too much *is* to sleep, as during sleep, many of the body's digestively defensive processes wind down, and if one ate too much before bed, one can wake up feeling *awful*. So for me, if I ate too much bad thing and would be inclined to purge, the best thing to do has been to *stay awake* for a few hours more at least before sleeping, and also to drink plenty of water, maybe even some salted water (to help reduce the load the food has put on the kidneys), and maybe also take an antacid (to slow and buffer the rate of digestion so that it is delayed and spread over a more comfortably handleable time-span).\n\n^(**WARNING about taking salt and antacids:**)\n\n^(Many commercial salts and especially antacids contain added toxins like aluminum compounds, and also in the case of many salts, even a somewhat toxic cyanide precursor commonly known as yellow prussiate of soda. Using that kind of salt before has even made me want to purge *more*.)\n\n^(Also another note about using salted water, is that for maximum kidney-easing effect, one can also maybe even consider adding some form of potassium, and/or bicarbonate (which is also dually functional as antacid too\\).)\n\n^(Maybe not all of this would be supported by many doctors, but this is what I've learned anyway from all of my trials in surviving and recovering from this life-sucking disorder.)\n\n&#x200b;\n\nAlso I really love your dancing method of a purging-substitute.\n\nAnother one I really have found helpful for replacing the mentally-rejuvenating addictive aspects of purging-by-vomit, is to take a bath/shower, like especially with colder water if one can handle it.\n\n&#x200b;\n\n**TL;DR:** Thanks for all the tips, don't agree with all of them personally like trying to hold even a really heavy/hard-hitting binge, but it's good to take away the ones with which I do, like culinary art and dancing and otherwise integrating food, eating, and related behaviors into normal, healthy life activities.",
      "created_utc": 1599813084.0,
      "score": 1,
      "context": []
    }
  ]
}