{
  "id": "ipj8hb",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1599668770.0,
  "title": "Addiction ?",
  "selftext": "Is there a link between bulimia and addiction? I’ve always been an “all or nothing” person. I have to eat no food but if I do then I have to eat all the foods. I have to have no wine or a bottle of wine. I have to have no adderall or triple my prescription. :( im sure it could be connected to a lot of things and underlying mental issues or genetics...",
  "url": "https://www.reddit.com/r/bulimia/comments/ipj8hb/addiction/",
  "score": 107,
  "num_comments": 22,
  "comments": [
    {
      "id": "g4k9fcj",
      "author": "opinionatedOptimist",
      "body": "God this is literally exactly me. I think there is a prevalent link to bulimia and addiction. Also sorry I’m super high rn. But I’ve always been criticized as a child for black and white thinking and now I’m 20 and still can’t find grey area in anything. I’m so erratic and extreme. Also terribly impulsive",
      "created_utc": 1599670561.0,
      "score": 45,
      "context": []
    },
    {
      "id": "g4ksr5p",
      "author": "vuaex",
      "body": "I remember reading that purging can release dopamine and of course we all know how addictive sugar is. Ive tried plenty of drugs, particularly uppers in an attempt to reduce my appetite and never really strugged with drug addiction because my addiction to my bulimia is SO strong,, no matter what I would take, I always preferred food. I would have drug binges for a couple weeks kinda rarely and never felt an urge to buy more like I did with binge food. I guess I'm lucky in that way but both can be killers, especially when combined. \n\nTheres lots of interesting info on the link between addiction and bulimia. I like to watch Ted talks and other YouTube videos on them.",
      "created_utc": 1599680181.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g4knfwx",
      "author": "Comprehensive-Pop-47",
      "body": "I can’t buy food without eating in all in one sitting, forcing me to buy smaller and smaller amounts of food so I don’t binge it all in one go. I have no sense of moderation. I need help.",
      "created_utc": 1599677595.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g4lyzyg",
      "author": "deadcomefebruary",
      "body": "Its been proven there absolutely is a huge link between addiction and sufferers from bulimia. Many bulimics suffer from drug/alcohol abuse disorders as well, at least 30% of bulimia sufferers also have alcohol abuse disorder. Im one of them.\n\nNot to mention bingeing and purging itself is addictive.",
      "created_utc": 1599701528.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g4kii2l",
      "author": "itrippeduplife",
      "body": "I 100% agree with that if I consume anything especially bread I have to have the entire loaf and it’s such a detrimental thing I’m being treated for anorexia binge purge subtype yet I don’t think I have that I think I have full blown bulimia so I’m really struggling to get better because I eat breakfast but I have to have like four or five bowls and then purge and it was ok in hospital because I couldn’t get access to more or less food it was awful though",
      "created_utc": 1599675193.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g4lnps9",
      "author": "HazelMoon9",
      "body": "I am 15 months sober from alcohol and drugs on the 7th. I can say unequivocally yes, bulimia is an addiction. \nThis is how I know, from my experience. Alcohol, like bulimia, was a solution to problems that I knew of no other solution for. It was an obsession. I craved it. The more I ingested it, the more I wanted. After drinking, I’d be full of remorse and guilt. I wanted desperately to stop but I couldn’t. I tried multiple things.. drinking less, drinking only wine, drinking only with friends, etc. nothing worked, I always found myself going to the point of blackout. I was hurting my body. My self esteem was in the gutter. I would muster up a resolve that by will alone, I’d never do it again! And the next day after drinking I would think, what happened? Where was my resolve? Why can’t I just stop it? Alcoholism is a liar. It tells me that it’s not that bad, that I can have just one drink or that I deserve a drink. It lies and deceives. I am no match for it. \n\nI got sober through AA. The next thing I want to try is Overeaters Anonymous. The difference between alcoholism and an eating disorder is that I must never touch a drink again, but I must continue to eat. So I’m hoping OA has figured out a way of doing things to help me be free.\nMost alcoholics have cross addictions, like many with bulimia. Binge shopping, sex, gambling, video games. These things all release the dopamine that our addicted brains crave in intense and unnatural ways. It truly is a disease of the brain.",
      "created_utc": 1599695547.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g4lpzcw",
      "author": "None",
      "body": "It me! And yes, very correlated. Unfortunately. All or nothing is a wonderful trait when it’s good and a horrendous trait when it’s bad. You’re not alone!\n\nEdit: I had to get sober to really tackle my ED through cognitive behavioral therapy. It was absolutely worth it. Moderation is still hard for me, but I at least gave myself the opportunity to learn the tools. You deserve that, too.",
      "created_utc": 1599696772.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g4lmyms",
      "author": "zabata11",
      "body": "i recommend looking at dr Gabor maté's work .",
      "created_utc": 1599695140.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4mmm4j",
      "author": "ssilverliningss",
      "body": "For a long time I've felt like I relate more to the experiences of people in addiction communities than eating disorder communities. In the beginning I did struggle with some body image issues and other things typical in EDs, but now the bingeing and purging is purely an addiction/habit/coping mechanism. I don't care about my weight. I just crave eating food until I can't breathe.",
      "created_utc": 1599716673.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4nav22",
      "author": "MidnightRaven30",
      "body": "For me my bulimia is definitely an addiction just like drugs or alcohol, having an addictive personality can really ruin you...",
      "created_utc": 1599730611.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4nlhk3",
      "author": "graamatvede",
      "body": "Hi, I haven't read all the other comments, but yes - bulimia consists of 3 addiction types - addiction from certain foods (sugar, wheat), addiction from the process (emptying) and obsession with body image (never thin/perfect enough). Even if we eat the \"right foods\", we can still suffer from the two other. The addiction from the purging process is the worst, because it has no \"end result\" (in opposing to getting drunk), it is the same type as working out - you get the high while the process takes place, therefore the purging can go on forever. And even if we force ourselves to eat the right foods and stop purging, the obsession with the body image can still be triggering enough.",
      "created_utc": 1599735354.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4m7avn",
      "author": "caponsigrayina",
      "body": "I bet so. I feel it is all one entity aspect thing of me that I call different names. But when I am focusing on one addictive behavior, the other one comes out, etc. Like the addiction part of me never can be not focused on or dealt with.",
      "created_utc": 1599706030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4mah7n",
      "author": "None",
      "body": "For me it’s, if I eat any food - might as well it it all and then throw it up. I’ve been sober from drugs for over a year, but with that it was, if I’m going to do a line, might as well go all out. I definitely know how you feel:",
      "created_utc": 1599707939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4map1z",
      "author": "None",
      "body": "Most definitely. I have an addictive personality and also struggle with substance abuse, although ED started many years before that.",
      "created_utc": 1599708071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4midey",
      "author": "None",
      "body": "Most likely yes. And I’ve always thought of eating disorders as addictions themselves. They are really.",
      "created_utc": 1599713272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4pn6na",
      "author": "Badkittykat1983",
      "body": "I absolutely think so! Of course, there are different types of bulimics: the ones who are truly anorexic and so afraid of food they feel they have to throw up after every meal (and usually only eat in social situations or with family to hide their problem); and then there are those who are technically binge.eaters who are.juat throwing up after to try to offset the binge. It's not exactly a weight loss strategy. It is absolutely food addiction! And if you're someone with control issues around food (and everything else) then dieting might just make it worse. The only thing that has helped me is getting into intermittent fasting (anywhere from 18-60 hours without eating) and allowing myself to \"eat all the things\" in my eating window. I don't throw up after (generally, but I have my moments) because I know I need to eat and also your stomachs shrinks when you fast so you can only get so much food in. I go back on my fast afterwards so there's no real damage. Our human race hasived through plenty of \"feast and famine\" throughout history and it's only recently that food is so abundant that people are eating 3-5 square meals a day in small portions. It is natural to want to eat all the foods when they're there- like we haven't quite caught up with our current reality on a genetic basis. So don't be so hard on yourself! Also it might be best to avoid alcohol and other drugs if you have an issue controlling those urges too, as that can do a lot of damage. I personally quit weed a little over 3 months ago and this has helped a lot with my binges, but I started drinking.more alcohol to compensate (lol) so now I'm working on letting that go too. So, uh..yeah...",
      "created_utc": 1599758781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4lobnv",
      "author": "stelas",
      "body": "ah black and white thinking, very relatable. Utter perfection or complete destruction",
      "created_utc": 1599695864.0,
      "score": 19,
      "context": [
        {
          "id": "g4k9fcj",
          "author": "opinionatedOptimist",
          "body": "God this is literally exactly me. I think there is a prevalent link to bulimia and addiction. Also sorry I’m super high rn. But I’ve always been criticized as a child for black and white thinking and now I’m 20 and still can’t find grey area in anything. I’m so erratic and extreme. Also terribly impulsive",
          "created_utc": 1599670561.0
        }
      ]
    },
    {
      "id": "g4png06",
      "author": "Badkittykat1983",
      "body": "So true!! Food is the hardest drug to quit because it is everywhere! Like it's not legal to interrupt your TV show with ads for crack cocaine every 5 minutes but food advertisers can just shove.hamburgers and fries in our faces all night even though we're not hungry and actually obesity kills?? It's totally.messed up!",
      "created_utc": 1599758885.0,
      "score": 3,
      "context": [
        {
          "id": "g4ksr5p",
          "author": "vuaex",
          "body": "I remember reading that purging can release dopamine and of course we all know how addictive sugar is. Ive tried plenty of drugs, particularly uppers in an attempt to reduce my appetite and never really strugged with drug addiction because my addiction to my bulimia is SO strong,, no matter what I would take, I always preferred food. I would have drug binges for a couple weeks kinda rarely and never felt an urge to buy more like I did with binge food. I guess I'm lucky in that way but both can be killers, especially when combined. \n\nTheres lots of interesting info on the link between addiction and bulimia. I like to watch Ted talks and other YouTube videos on them.",
          "created_utc": 1599680181.0
        }
      ]
    },
    {
      "id": "g4m08xs",
      "author": "opinionatedOptimist",
      "body": "I’m also a bulimic who struggles with substance abuse. Bulimia is so chaotic I stg. It makes it so hard to recover too because the mindset of bulimics tends to be more impulsive and black and white. Purging is so addictive. I developed bulimia when I recovered from anorexia and I’ve never been able to stop binging and purging since",
      "created_utc": 1599702169.0,
      "score": 9,
      "context": [
        {
          "id": "g4lyzyg",
          "author": "deadcomefebruary",
          "body": "Its been proven there absolutely is a huge link between addiction and sufferers from bulimia. Many bulimics suffer from drug/alcohol abuse disorders as well, at least 30% of bulimia sufferers also have alcohol abuse disorder. Im one of them.\n\nNot to mention bingeing and purging itself is addictive.",
          "created_utc": 1599701528.0
        }
      ]
    },
    {
      "id": "g4pnshp",
      "author": "Badkittykat1983",
      "body": "Carbs are incredibly addictive. They are.designed that way. And there are no essential carbohydrates! What about just having eggs and veggies.for a bit and see how you feel? It might be best to avoid the bread and try to get your blood sugar to a normal level. Trust me I love bread and I have the same problem, but I don't eat everyday so I can offset that. But I feel so much better physically when I'm not eating all the carbs.",
      "created_utc": 1599759025.0,
      "score": 2,
      "context": [
        {
          "id": "g4kii2l",
          "author": "itrippeduplife",
          "body": "I 100% agree with that if I consume anything especially bread I have to have the entire loaf and it’s such a detrimental thing I’m being treated for anorexia binge purge subtype yet I don’t think I have that I think I have full blown bulimia so I’m really struggling to get better because I eat breakfast but I have to have like four or five bowls and then purge and it was ok in hospital because I couldn’t get access to more or less food it was awful though",
          "created_utc": 1599675193.0
        }
      ]
    },
    {
      "id": "g4poo6a",
      "author": "Badkittykat1983",
      "body": "Sure it can, but it can also be used for good. If you can transfer your addiction to something useful instead and use that crazy focus for good and not evil, imagine what you could accomplish? You can get addicted.to work and start your own company, exercise and become and athlete, writing and put out a bunch of books, achievement and get a few degrees, become a doctor or who knows what...? We're all just misdirecting our potential here.",
      "created_utc": 1599759268.0,
      "score": 1,
      "context": [
        {
          "id": "g4nav22",
          "author": "MidnightRaven30",
          "body": "For me my bulimia is definitely an addiction just like drugs or alcohol, having an addictive personality can really ruin you...",
          "created_utc": 1599730611.0
        }
      ]
    }
  ]
}