{
  "id": "is4xvl",
  "subreddit": "bulimia",
  "author": "Cath1212",
  "created_utc": 1600025501.0,
  "title": "Found out about bulimia watching a movie and I wish I never did",
  "selftext": "When I (20f) was 15-16, I was in a bad place mentally and emotionally and I remember watching this movie. I can’t remember the name of it and I can’t even remember any of the storyline, all I remember was this young girl purging. I do have a feeling though that the movie was addressing the problem of eating disorders. Anyways, I had no clue what an eating disorder was at the time, let alone bulimia, and decided to look it up. At this point, I started to \"learn\" about bulimia and basically chose to try it out because at the time I felt like I needed to lose weight to gain confidence. Eventually, with years, I used this more as a tool of self harm.\n\nBut when I think about it now, I doubt I would have known about bulimia until recently had I not seen this movie. At that age, I was so desperate and gullible, I didn’t care about my health, I just chose to try anything that would help me lose weight.\n\nIt’s weird because obviously I feel it’s important that we teach young people about issues such as eating disorders but at the same time, are we introducing these eating disorders to them?\n\nEdit: thank you for the award! I really appreciate it! And wow, I’m so shocked to read how many of you guys have also found out about bulimia via documentaries, movies, shorts films... Thank you though for sharing your experiences! I’ve been following this sub for a while but never posted as I feel a bit embarrassed about even being subscribed to it (I’ve never told anyone about my ED) but to see how kind and open you guys are about your own experience inspires me massively!",
  "url": "https://www.reddit.com/r/bulimia/comments/is4xvl/found_out_about_bulimia_watching_a_movie_and_i/",
  "score": 101,
  "num_comments": 39,
  "comments": [
    {
      "id": "g55jlts",
      "author": "None",
      "body": "I learned about pr°@n@ from a YouTube video condemning it as one of the worst parts of the internet, looked more into it, next thing you know, I’m bulimic!",
      "created_utc": 1600026443.0,
      "score": 51,
      "context": []
    },
    {
      "id": "g55r0ny",
      "author": "deadcomefebruary",
      "body": "I think when i was like 8 i heard about ana and mia, and i was like, \"why would you starve yourself???? Why would you eat food and puke???\"\n\nTurns out theres a lot of reasons.",
      "created_utc": 1600029344.0,
      "score": 48,
      "context": []
    },
    {
      "id": "g55m3q0",
      "author": "3asybake0ven",
      "body": "Learned about bulimia from scary movie 5 when I was about the age of 11 or 12. It was the scene where she brings a single cheerio in a styrofoam box eats it and then goes to throw it up. A year or so later I was exposed to anorexia on tumblr. Didn’t really think nothing of it but it began to sit in the back of my mind. A year later I watched to the bone on Netflix... still didn’t think much of eating disorders but it was still in the back of my mind. Then when i was at an age where I decided I wanted to loose weight, I turned to the things I had learned off of movies and tumblr. I thought it would be great and I would be skinny. All I gotta say now is LMAO. But anyway it is really sad how there really isn’t a way to warn people about EDs without exposing them to it. I personally feel as if I never would’ve joined tumblr or watched those movies, I would never be where I am now... with an ED that is.",
      "created_utc": 1600027403.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g55qkj3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600029133.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g566qc2",
      "author": "lunaelliott4",
      "body": "I was tooling around and stumbled upon a pro-a**/m** site when I was 19 or 18 and decided stupidly to \"try it\" and cut to 8 years later im painfully still struggling and my health and teeth are literally and figuratively in the toilet I used it for years as a defense /comfort tactic when I was in a severely abusive marriage for 5 years i kept it as the little thing that was \"mine\" and \"no one could take away from me \" he may hit me but at least im skinny kind of shit... he passed away 2 years ago and now im stuck trying to get rid of something thats so ingrained into my brain that it seems impossible to get rid of😪😪😪😪😪",
      "created_utc": 1600035963.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g56u5wm",
      "author": "Stranger-Little",
      "body": "I learned about bulimia in middle school during home and careers while watching a educational movie about the dangers of eating disorders. I was absolutely astonished at the idea of how people could make themselves throw up.... until I tried it",
      "created_utc": 1600047950.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g564w4s",
      "author": "lola-at-teatime",
      "body": "I learnt about bulimia at 8, from reading a magazine article about Joan Osbourne and her troubles with it. It didnt go in much detail so I asked my aunt what bulimia is, she explained, I was shoked, then 8 yrs later I did it myself and it seemed natural (?) ever since.",
      "created_utc": 1600035345.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g55x0wh",
      "author": "riversandroads8888",
      "body": "I learned about bulimia after being obsessed with horse racing as a child and young adult and wanted to be a jockey...\n\nI think some people are predisposed and unfortunately begin these behaviors after some type of exposure (although some start before they know that what they are doing has a name). I think it's important to teach individuals about eating disorders, but while we are teaching young people, we should also be providing resources for help at the same time, and resources for individuals struggling with their mental health.",
      "created_utc": 1600032081.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g56ex4c",
      "author": "fiberglassdildo",
      "body": "I first learnt that I could lose weight by purging in 2006 while watching P!nks “Stupid Girls” video on MTV. \nShe uses a toothbrush and screams “I wanna be skinny” while vomiting in the sink. I was like “oh yeah mad me too....” even tho the songs about not doing it lol",
      "created_utc": 1600039362.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g55zs1m",
      "author": "weirdo2050",
      "body": "I watched all sorts of documentaries and movies about eating disorders (in addition to pro/ana, ana/mia etc content) when I was still sick with the disease. I even got tips from documentaries that were supposed to like condemn the issue and just spread awarness. Personally I remember a tv show where young models ate cotton pillow filling and being extremely inspired by such creativity... But I didn't know for 7 years that I myself had bulimia. I had self diagnosed myself with BED instead and thought that inspiration would keep me from the binges.",
      "created_utc": 1600033372.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g56zdm3",
      "author": "asyh90",
      "body": "Same here, I learnt about it from a show which I now can’t recall what its title was back when I was in high school. My initial thought was “eew that’s dumb” until I started it myself. \n\nI started to purge out after every meal. They’re easier to come out immediately after a meal imo so I didn’t have any trouble or issues with those side effects i Googled - gum disease/cavities/intestinal problems etc. This somewhat kind of consoled me mentally to think that I’m okay and not an extreme bulimic. \n\nMy mum noticed a pattern and she started to confront me. She kept a close watch on me and I started to recover from it. Slowly but surely.\n\nA year ago, people around me started to comment about my weight and chubby-ness again. So I relapsed till today. I’ve since lost 16kg (from 68kg to 52kg) and I’m 1.65m... I no longer live with my mum so no one noticed my eating habits or patterns. Not even my husband. Everyone around me noticed my weight loss and gave me compliments even. \n\nI know it’s a problem but I can’t seem to stop myself. I’m starting to see some side effects - hair loss / sleeping problem and I’m very certain that I have a fertility problem too. \n\nI wished I never knew the existence of eating disorder. Till date, it seems like my go to solution to lose weight as compared to exercising and eating right.",
      "created_utc": 1600051092.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g57kf97",
      "author": "KaffeeKaethe",
      "body": "Wow, I never actually thought about how I learned about bulimia... It was just... there at some point",
      "created_utc": 1600067257.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g56gxr6",
      "author": "None",
      "body": "UGH, I feel this. I went to an all-girl high school, where everyone had to watch this documentary called “Thin” in like freshman or sophomore year, so like, same vulnerable age. And ohhh my. I know for a fact I am not the only girl who got horrible ideas from that “helpful/preventative” movie! I watched it almost a decade later to see how I’d feel about it, and it was just as triggering. We gotta find a way to make this topic not as taboo to talk about and not as prevalent for our daughters and sons!",
      "created_utc": 1600040314.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g56z9yv",
      "author": "erinnihilator",
      "body": "i knew about bulimia but honestly mimicked the show “binge” on youtube when i started purging myself. the show is about her finally seeking help for herself. in it others expressed concern for her health, and after a death in my family and my depression, i really wanted that. i kind of glamorized it",
      "created_utc": 1600051031.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g575xxq",
      "author": "xio-suicidal-hoe",
      "body": "i learned about bulimia and anorexia from a movie looked it up, tried it, now here we are",
      "created_utc": 1600055283.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g579i5u",
      "author": "None",
      "body": "My uncle is a doctor and told me gross stories about his ED patients in the ward without naming names. I became endlessly fascinated by the concept of starving and how intense people were about it.",
      "created_utc": 1600057827.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g57la1l",
      "author": "confused_and_lonely_",
      "body": "It's a fine line to walk between awareness and promotion. I believe that the rise in eating disorders is partially due to more people knowing about them. My eating disorder would not have started if I didn't know such things existed, but instead, I heard about something that would make people care about me and 11-year-old me thought, \"let's give it a shot!\"\n\nIt makes me angry as the media presents you with different coping mechanisms. I think it also makes people fall deeper into their disorders. 'Oh, you wanna lose weight even though you're healthy? You must be anorexic.' Then what could have been something insignificant is made that person's identity and they'll likely see it as an opportunity to explore a new world, try something new and/or be a part of a community.\n\nI don't really have an answer... what would I tell my younger self? \"Hey mate, people are actually gonna like you less, you'll become an irritating, selfish prick with no friends. Maybe just break your arm or get a new skill for attention.\"",
      "created_utc": 1600068152.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g57rveh",
      "author": "wingednova",
      "body": "I was maybe 10 when i read a story in chicken soup for the teenage soul. Bam and four years later, i think of it again as I’m over the toilet. It was honestly such a numb realisation. I honestly don’t know what would’ve happened if I hadn’t read that. Life’s odd.",
      "created_utc": 1600075847.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g59q3u8",
      "author": "Monumental-Mistake",
      "body": "I had a “friend” suggest it to be me after my dad died. Told me it would help me feel better. And here we are 12 years later. I should send her my bill from treatment. 🧐",
      "created_utc": 1600110931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g56vphg",
      "author": "Various-List",
      "body": "I learned how to purge in 5th grade from a young adult novel intended to warn about the dangers of bulimia. It was so detailed in what the characters did. The main character was portrayed as chubby and learned how to lose weight from a beautiful popular cheerleader who purged. Even though the cheerleader ended up in the hospital, it still drive home the connection between being beautiful and being thin and that getting really thin is possible using the methods described in the book.",
      "created_utc": 1600048858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g961n2u",
      "author": "Secondaccforposts",
      "body": "I learned about it from watching those b/p videos on YouTube where they eat all the food. I didn’t even know what b/p stood for till I gave it thought. I just assumed they binged and dealt with the consequences.",
      "created_utc": 1602985627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g573pka",
      "author": "Pickleweede",
      "body": "I learned about it ravenrockcandy and then joined a cultish dutch forum called to the bones, where they shamed people and bullied you into thin. I loved it at the time. A decade later, I became a great fat bulimic failure with stomach ulcers instead.",
      "created_utc": 1600053798.0,
      "score": 4,
      "context": [
        {
          "id": "g55jlts",
          "author": "None",
          "body": "I learned about pr°@n@ from a YouTube video condemning it as one of the worst parts of the internet, looked more into it, next thing you know, I’m bulimic!",
          "created_utc": 1600026443.0
        }
      ]
    },
    {
      "id": "g57n8uo",
      "author": "None",
      "body": "My dumb 11 year old ass was on tumblr for some sh pics but ended up on a proana tag didn’t think much of it but thought back at it when I was 15 (last year) and downloaded tumbler again and that’s when it all started.",
      "created_utc": 1600070317.0,
      "score": 1,
      "context": [
        {
          "id": "g55jlts",
          "author": "None",
          "body": "I learned about pr°@n@ from a YouTube video condemning it as one of the worst parts of the internet, looked more into it, next thing you know, I’m bulimic!",
          "created_utc": 1600026443.0
        }
      ]
    },
    {
      "id": "g57r94o",
      "author": "sonic2cool",
      "body": "same here, i never understood how people could do that & how weird it is like “just eat omg” but now look at me.... bruh",
      "created_utc": 1600075095.0,
      "score": 2,
      "context": [
        {
          "id": "g55r0ny",
          "author": "deadcomefebruary",
          "body": "I think when i was like 8 i heard about ana and mia, and i was like, \"why would you starve yourself???? Why would you eat food and puke???\"\n\nTurns out theres a lot of reasons.",
          "created_utc": 1600029344.0
        }
      ]
    },
    {
      "id": "g5c8rvx",
      "author": "pantieraiderz",
      "body": "Oh god same. I used to pride myself in loving food and never understood how ppl could just throw up. Now look at me",
      "created_utc": 1600161640.0,
      "score": 1,
      "context": [
        {
          "id": "g55r0ny",
          "author": "deadcomefebruary",
          "body": "I think when i was like 8 i heard about ana and mia, and i was like, \"why would you starve yourself???? Why would you eat food and puke???\"\n\nTurns out theres a lot of reasons.",
          "created_utc": 1600029344.0
        }
      ]
    },
    {
      "id": "g55qthf",
      "author": "deadcomefebruary",
      "body": "I swear to god, tumblr has done more to promote self harm, eating disorders, and unhealthy coping mechanisms than any platform on the internet.",
      "created_utc": 1600029250.0,
      "score": 15,
      "context": [
        {
          "id": "g55m3q0",
          "author": "3asybake0ven",
          "body": "Learned about bulimia from scary movie 5 when I was about the age of 11 or 12. It was the scene where she brings a single cheerio in a styrofoam box eats it and then goes to throw it up. A year or so later I was exposed to anorexia on tumblr. Didn’t really think nothing of it but it began to sit in the back of my mind. A year later I watched to the bone on Netflix... still didn’t think much of eating disorders but it was still in the back of my mind. Then when i was at an age where I decided I wanted to loose weight, I turned to the things I had learned off of movies and tumblr. I thought it would be great and I would be skinny. All I gotta say now is LMAO. But anyway it is really sad how there really isn’t a way to warn people about EDs without exposing them to it. I personally feel as if I never would’ve joined tumblr or watched those movies, I would never be where I am now... with an ED that is.",
          "created_utc": 1600027403.0
        }
      ]
    },
    {
      "id": "g55s7s5",
      "author": "ImpossibleSandwich33",
      "body": "How was the name of the book? I think my bulimia thought started from it as well",
      "created_utc": 1600029867.0,
      "score": 6,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        }
      ]
    },
    {
      "id": "g56fidx",
      "author": "smooshedegg",
      "body": "I think I had this same book omg. Was is American Girl?!",
      "created_utc": 1600039670.0,
      "score": 5,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        }
      ]
    },
    {
      "id": "g56sujn",
      "author": "goudabeluga",
      "body": "I learned about bulimia from a book too, when I was around the same age. I think the book was called ‘the care and keeping of you’ or something like that.",
      "created_utc": 1600047182.0,
      "score": 4,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        }
      ]
    },
    {
      "id": "g575c0o",
      "author": "Alexandria_Eiley",
      "body": "Omg was it the black stallion books/movies? Can’t remember if this was in there..",
      "created_utc": 1600054864.0,
      "score": 1,
      "context": [
        {
          "id": "g55x0wh",
          "author": "riversandroads8888",
          "body": "I learned about bulimia after being obsessed with horse racing as a child and young adult and wanted to be a jockey...\n\nI think some people are predisposed and unfortunately begin these behaviors after some type of exposure (although some start before they know that what they are doing has a name). I think it's important to teach individuals about eating disorders, but while we are teaching young people, we should also be providing resources for help at the same time, and resources for individuals struggling with their mental health.",
          "created_utc": 1600032081.0
        }
      ]
    },
    {
      "id": "g5a70bu",
      "author": "Cath1212",
      "body": "Oh wow! Great friend... I’m so sorry you went through all of that!",
      "created_utc": 1600116287.0,
      "score": 2,
      "context": [
        {
          "id": "g59q3u8",
          "author": "Monumental-Mistake",
          "body": "I had a “friend” suggest it to be me after my dad died. Told me it would help me feel better. And here we are 12 years later. I should send her my bill from treatment. 🧐",
          "created_utc": 1600110931.0
        }
      ]
    },
    {
      "id": "g58tk4m",
      "author": "deadcomefebruary",
      "body": "Bruh is right lol",
      "created_utc": 1600099464.0,
      "score": 1,
      "context": [
        {
          "id": "g55r0ny",
          "author": "deadcomefebruary",
          "body": "I think when i was like 8 i heard about ana and mia, and i was like, \"why would you starve yourself???? Why would you eat food and puke???\"\n\nTurns out theres a lot of reasons.",
          "created_utc": 1600029344.0
        },
        {
          "id": "g57r94o",
          "author": "sonic2cool",
          "body": "same here, i never understood how people could do that & how weird it is like “just eat omg” but now look at me.... bruh",
          "created_utc": 1600075095.0
        }
      ]
    },
    {
      "id": "g56gz3k",
      "author": "None",
      "body": "THIS!!!",
      "created_utc": 1600040332.0,
      "score": 2,
      "context": [
        {
          "id": "g55m3q0",
          "author": "3asybake0ven",
          "body": "Learned about bulimia from scary movie 5 when I was about the age of 11 or 12. It was the scene where she brings a single cheerio in a styrofoam box eats it and then goes to throw it up. A year or so later I was exposed to anorexia on tumblr. Didn’t really think nothing of it but it began to sit in the back of my mind. A year later I watched to the bone on Netflix... still didn’t think much of eating disorders but it was still in the back of my mind. Then when i was at an age where I decided I wanted to loose weight, I turned to the things I had learned off of movies and tumblr. I thought it would be great and I would be skinny. All I gotta say now is LMAO. But anyway it is really sad how there really isn’t a way to warn people about EDs without exposing them to it. I personally feel as if I never would’ve joined tumblr or watched those movies, I would never be where I am now... with an ED that is.",
          "created_utc": 1600027403.0
        },
        {
          "id": "g55qthf",
          "author": "deadcomefebruary",
          "body": "I swear to god, tumblr has done more to promote self harm, eating disorders, and unhealthy coping mechanisms than any platform on the internet.",
          "created_utc": 1600029250.0
        }
      ]
    },
    {
      "id": "g5d08xw",
      "author": "None",
      "body": "Is it sad that whenever I sink into my ED or depression Tumblr is the FIRST place I go",
      "created_utc": 1600181648.0,
      "score": 1,
      "context": [
        {
          "id": "g55m3q0",
          "author": "3asybake0ven",
          "body": "Learned about bulimia from scary movie 5 when I was about the age of 11 or 12. It was the scene where she brings a single cheerio in a styrofoam box eats it and then goes to throw it up. A year or so later I was exposed to anorexia on tumblr. Didn’t really think nothing of it but it began to sit in the back of my mind. A year later I watched to the bone on Netflix... still didn’t think much of eating disorders but it was still in the back of my mind. Then when i was at an age where I decided I wanted to loose weight, I turned to the things I had learned off of movies and tumblr. I thought it would be great and I would be skinny. All I gotta say now is LMAO. But anyway it is really sad how there really isn’t a way to warn people about EDs without exposing them to it. I personally feel as if I never would’ve joined tumblr or watched those movies, I would never be where I am now... with an ED that is.",
          "created_utc": 1600027403.0
        },
        {
          "id": "g55qthf",
          "author": "deadcomefebruary",
          "body": "I swear to god, tumblr has done more to promote self harm, eating disorders, and unhealthy coping mechanisms than any platform on the internet.",
          "created_utc": 1600029250.0
        }
      ]
    },
    {
      "id": "g55ucbp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600030824.0,
      "score": 4,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        },
        {
          "id": "g55s7s5",
          "author": "ImpossibleSandwich33",
          "body": "How was the name of the book? I think my bulimia thought started from it as well",
          "created_utc": 1600029867.0
        }
      ]
    },
    {
      "id": "g58itaj",
      "author": "ducklover83",
      "body": "I remember first reading about it in American girl and wondering why anyone would throw up food....here we are now",
      "created_utc": 1600095429.0,
      "score": 2,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        },
        {
          "id": "g56fidx",
          "author": "smooshedegg",
          "body": "I think I had this same book omg. Was is American Girl?!",
          "created_utc": 1600039670.0
        }
      ]
    },
    {
      "id": "g574nk5",
      "author": "None",
      "body": "Fuck that book. It scarred me because there were “different bodies.” But, like always at the time, a girl was never tall and fat. Tall girls were thin. Shirt girls could be fat, but not tall girls. It really fucked up my already bad body image.",
      "created_utc": 1600054406.0,
      "score": 3,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        },
        {
          "id": "g56sujn",
          "author": "goudabeluga",
          "body": "I learned about bulimia from a book too, when I was around the same age. I think the book was called ‘the care and keeping of you’ or something like that.",
          "created_utc": 1600047182.0
        }
      ]
    },
    {
      "id": "g57c0r6",
      "author": "riversandroads8888",
      "body": "I think maybe in the black stallion, but Seabiscuit for sure (book and movie). Ugh, I love the black stallion! That movie is gorgeous!! Now I have the urge to go re-watch it.",
      "created_utc": 1600059766.0,
      "score": 1,
      "context": [
        {
          "id": "g55x0wh",
          "author": "riversandroads8888",
          "body": "I learned about bulimia after being obsessed with horse racing as a child and young adult and wanted to be a jockey...\n\nI think some people are predisposed and unfortunately begin these behaviors after some type of exposure (although some start before they know that what they are doing has a name). I think it's important to teach individuals about eating disorders, but while we are teaching young people, we should also be providing resources for help at the same time, and resources for individuals struggling with their mental health.",
          "created_utc": 1600032081.0
        },
        {
          "id": "g575c0o",
          "author": "Alexandria_Eiley",
          "body": "Omg was it the black stallion books/movies? Can’t remember if this was in there..",
          "created_utc": 1600054864.0
        }
      ]
    },
    {
      "id": "g55vypv",
      "author": "stoneybaloneychicka",
      "body": "Don’t know if this is the same book as you guys but I remember reading about it in the girls puberty book Ready, Set, Grow by Lynda Madaras.",
      "created_utc": 1600031576.0,
      "score": 5,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        },
        {
          "id": "g55s7s5",
          "author": "ImpossibleSandwich33",
          "body": "How was the name of the book? I think my bulimia thought started from it as well",
          "created_utc": 1600029867.0
        },
        {
          "id": "g55ucbp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600030824.0
        }
      ]
    },
    {
      "id": "g584kbl",
      "author": "ImpossibleSandwich33",
      "body": "Found it! It’s called ‘Girls under pressure’ by Jaqueline Wilson. \n\nhttps://en.m.wikipedia.org/wiki/Girls_Under_Pressure",
      "created_utc": 1600087936.0,
      "score": 1,
      "context": [
        {
          "id": "g55qkj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600029133.0
        },
        {
          "id": "g55s7s5",
          "author": "ImpossibleSandwich33",
          "body": "How was the name of the book? I think my bulimia thought started from it as well",
          "created_utc": 1600029867.0
        },
        {
          "id": "g55ucbp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600030824.0
        }
      ]
    },
    {
      "id": "g5ht5kj",
      "author": "Alexandria_Eiley",
      "body": "Same 😂 but one scene haunts me... I watched them when I was REALLY little and it’s that scene where he steps on like a horse scale or some shit and he starts inflating like he’s wearing a suit that’s being filled with water (it was supposed to fat) and I don’t even remember it well but it plays in my mind randomly 😭",
      "created_utc": 1600279667.0,
      "score": 1,
      "context": [
        {
          "id": "g55x0wh",
          "author": "riversandroads8888",
          "body": "I learned about bulimia after being obsessed with horse racing as a child and young adult and wanted to be a jockey...\n\nI think some people are predisposed and unfortunately begin these behaviors after some type of exposure (although some start before they know that what they are doing has a name). I think it's important to teach individuals about eating disorders, but while we are teaching young people, we should also be providing resources for help at the same time, and resources for individuals struggling with their mental health.",
          "created_utc": 1600032081.0
        },
        {
          "id": "g575c0o",
          "author": "Alexandria_Eiley",
          "body": "Omg was it the black stallion books/movies? Can’t remember if this was in there..",
          "created_utc": 1600054864.0
        },
        {
          "id": "g57c0r6",
          "author": "riversandroads8888",
          "body": "I think maybe in the black stallion, but Seabiscuit for sure (book and movie). Ugh, I love the black stallion! That movie is gorgeous!! Now I have the urge to go re-watch it.",
          "created_utc": 1600059766.0
        }
      ]
    }
  ]
}