{
  "id": "iv62kj",
  "subreddit": "bulimia",
  "author": "gemmag74",
  "created_utc": 1600435697.0,
  "title": "6 weeks without purging",
  "selftext": "I am doing an 'all in' bulimia recovery method and have not purged for 6 weeks. This method dictates that ANY sort of restriction is the enemy and purging is not an option. The goal is to be able to eat intuitively and finally be free from food and body obsessionfor ever. \n\nIt's extremely scary because I have to eat what ever my body or mind feels like until I am satiated without purging! At this stage, with the extreme hunger I have, this usually means until I am totally stuffed and very uncomfortable all day every day. I am expecting to put on a considerable amount of weight for a period of time until my hunger subsides and intuitive eating starts to kick in. Then my weight will settle at its natural set point and I have to work on loving my body at what ever that weight is. I'm expecting that process to take about a year.\n\nI am petrified and mortified about 'getting fat' but, after suffering with bulimia for over 20 years, I am starting to realise that I deserve more than that bitch ED telling me I'm not good enough. So until she's gone, I'm just going to ignore her, get fat and keep plodding along. It's time! ❤️",
  "url": "https://www.reddit.com/r/bulimia/comments/iv62kj/6_weeks_without_purging/",
  "score": 117,
  "num_comments": 11,
  "comments": [
    {
      "id": "g5phpvo",
      "author": "None",
      "body": "Congratulations!!!",
      "created_utc": 1600441353.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g5pju1t",
      "author": "notyourmotherskid",
      "body": "Sending hugs❤️❤️",
      "created_utc": 1600442411.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g5pnmo7",
      "author": "SativaSunChild",
      "body": "You’re KILLING IT ❤️❤️❤️",
      "created_utc": 1600444270.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5qezii",
      "author": "RosieNP",
      "body": "That's awesome! Good for you for commiting to your recovery!",
      "created_utc": 1600457336.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5quovu",
      "author": "LischenVonEngels",
      "body": "Here Queen, you dropped your crown ✨",
      "created_utc": 1600464532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5qw3s9",
      "author": "ImpossibleSandwich33",
      "body": "Please, be strong!! I’ve passed the same phase but I went back to some purging after my boyfriend (unaware of my problems) told me that I needed to lose wait. I’ve dumped him. I’m still in recovery but it takes a great effort not to purge when I overeat. I’m proud of you anyways.",
      "created_utc": 1600465167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnvfwd2",
      "author": "Aggravating-Poem-943",
      "body": "I realized were human our body's will always change and thats okay!! We have one shot at life and ONE BODY your body, lets take care of it, give it all the love it deserves & make it happy! I hope you are doing well! Recovery is worth it. Stay safe! SENDING LOVE from NYC!",
      "created_utc": 1613644952.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5r3qa6",
      "author": "MarmaladePanda",
      "body": "🦁❤️ Keep on keepin on! Rock that recovery - It’s scary as all get out AND it’s in your power to do it. Congrats!",
      "created_utc": 1600468686.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5rb8qx",
      "author": "None",
      "body": "6 weeks is amazing and pushing through the discomfort is so admirable! Keep going!",
      "created_utc": 1600472979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5rf8qz",
      "author": "RosaceousPueblo",
      "body": "This is awesome! Don’t give up, even if you mess up. You got this!!!💜",
      "created_utc": 1600475127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5rjcj4",
      "author": "gemmag74",
      "body": "Thanks!",
      "created_utc": 1600477412.0,
      "score": 1,
      "context": [
        {
          "id": "g5rf8qz",
          "author": "RosaceousPueblo",
          "body": "This is awesome! Don’t give up, even if you mess up. You got this!!!💜",
          "created_utc": 1600475127.0
        }
      ]
    }
  ]
}