{
  "id": "ivg4v2",
  "subreddit": "bulimia",
  "author": "niceartichoke",
  "created_utc": 1600468201.0,
  "title": "it’s so easy to forget that... bulimia isn’t normal",
  "selftext": "like, sometimes i forget that constantly having the thought of puking ur meal up whenever u decide ur too full/it’s too many calories in the bg isn’t normal. i’ll have streaks of 2 or 3 weeks where i’m purge-free and then i’ll get drunk and i’m immediately like “yeah but i can just purge this meal”\n\nthat isn’t normal!! this is your eating disorder talking!! recovery feels easy until you realise it’s wormed its way into every part of your life, until you realise that shoving ur fingers down ur throat isn’t normal. that purging isn’t an undo button for everyone else and that there’s a REASON for that.\n\n idk. i’m just venting because relapsing is so easy and i want this to be Over but also bulimia is lowkey forever part of my life now and i don’t even know how that happened. hey there!",
  "url": "https://www.reddit.com/r/bulimia/comments/ivg4v2/its_so_easy_to_forget_that_bulimia_isnt_normal/",
  "score": 468,
  "num_comments": 17,
  "comments": [
    {
      "id": "g5rbpcr",
      "author": "riversandroads8888",
      "body": "Yep, I can relate. It's crazy how becomes a new normal so to speak.",
      "created_utc": 1600473226.0,
      "score": 38,
      "context": []
    },
    {
      "id": "g5sgdcu",
      "author": "novanugs",
      "body": "It’s irritating how complacent I am with it now. Like I had a solid 45 day streak recently and then the other day I had two donuts. TWO DONUTS. A normal person wouldn’t even think about that. I used to not even think about that. But that was enough for me to feel guilty and purge and it’s been every fucking night since then. Like... it’s way too easy to be like “I don’t need to stop. I can just puke.”",
      "created_utc": 1600495961.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g5rn76n",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600479277.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g5sg81s",
      "author": "MaeveTheLion",
      "body": "Johns Hopkins' eating disorder treatment center in the US talks about \"normalising\" eating again, because we forget *how* to eat. They also say that new behaviours take something like 18 - 254 days to become automatic habits, but it is possible.\n\nCould you write down the reasons you don't want to use that \"undo button\" and keep them close at hand? How about anticipate some of the transitional moments that lead down to a binge and thinking through the actions you'll take when you get there?",
      "created_utc": 1600495874.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g5szbp2",
      "author": "None",
      "body": "You ever just watch someone eat stuff in \"the wrong order\" like first the bread and then the salad and you think to yourself the bread is never gonna come up, should've ate the salad first. And then you remember that not everyone is bulimic and you're just a total freak",
      "created_utc": 1600515536.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g5s1np2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600486205.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g5t0cky",
      "author": "stelas",
      "body": "i'm 5 days b/p free at the moment, but i also keep thinking about how EASY a relapse would be.. it's hard to stop when you know you can do it, that the 'undo button' is possible.",
      "created_utc": 1600516573.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g5tn4b7",
      "author": "dexterdrag",
      "body": "Yeah, it feels normal to me. Like it is already a part of my lifestyle. Shower, wake up, sleep, eat, exercise, hang out with friends, run errands, binge and purge, talk to my family, shop. It has become a seamless part of my lifestyle but there are times when I ask myself can I talk about this openly? Only then I realised people won't think it is normal and I fear the consequences then I realised bulimia is definitely not normal but then I'll forget it all too soon.",
      "created_utc": 1600528102.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g5t2qzy",
      "author": "None",
      "body": "I just watched Miss Congeniality and there’s a scene where they’re talking about pizza and Gracie says “don’t worry, she’ll puke it up anyways” and this is an acceptable answer for the group of girls. That hit me like a slap in the face— I watched this movie hundreds of times as a young teenager and always just accepted that that’s just what you do when you are beautiful and this was normal adult behavior.\n\nPSA: It’s not normal and it’s not glamorous and it won’t make any of us beautiful.",
      "created_utc": 1600518800.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g5t2pzd",
      "author": "hope-world-bb",
      "body": "every time i eat too much i throw up to make myself feel better. i literally am only just realizing that this is not a thing ‘normal’ ppl do. whoops lol",
      "created_utc": 1600518775.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g5rghx5",
      "author": "primadonna_girI",
      "body": "this is so true. at my summer job i would always spend half of my break throwing up what i had just eaten, and at one point my manager walked in while i was doing so and i had to leave and get my shift for the next day covered because i was working in food service and that was the rule. i missed two days of work for something that i just do without thinking sometimes because i forget that the people i’m surrounded by think i’m gross for doing it. it’s crazy how much purging gets to feel like just a regular part of my day",
      "created_utc": 1600475820.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5sxa5d",
      "author": "None",
      "body": "ALL OF THIS. And no matter how much damage it has caused me you’d think it’d be the red light to not do it ever again. But then I find myself doing it without even a trigger or reason.\nI find myself caught in behaviors for no reason other than it use to be about control and such.. not completely about body image.\n\nIt’s always in the back of my mind 😢.\nEven foods I am no longer “afraid of”, still give me anxiety.\n\nThere’s also that mindset of “well I’ve struggled for 13 years and I’ve lived... what’s a few more?” \nI’ve been in treatment 20+ times and that shit is exhausting!\n\nAt what point does it just “go away” because I am DONE with all of this",
      "created_utc": 1600513366.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5tsdqz",
      "author": "genomskinligt",
      "body": "i feel this. it’s my go to thought when i feel full, like bro this isn’t normal",
      "created_utc": 1600530482.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5stw18",
      "author": "niceartichoke",
      "body": "yeah that’s exactly my experience!! a combination of stress, a Bad Day, and eating a lil too much = purge i guess?",
      "created_utc": 1600509548.0,
      "score": 11,
      "context": [
        {
          "id": "g5sgdcu",
          "author": "novanugs",
          "body": "It’s irritating how complacent I am with it now. Like I had a solid 45 day streak recently and then the other day I had two donuts. TWO DONUTS. A normal person wouldn’t even think about that. I used to not even think about that. But that was enough for me to feel guilty and purge and it’s been every fucking night since then. Like... it’s way too easy to be like “I don’t need to stop. I can just puke.”",
          "created_utc": 1600495961.0
        }
      ]
    },
    {
      "id": "g5t9gnu",
      "author": "withonlygrace",
      "body": "Wow ME AF. I’ll be texting my friends completely normal stuff while purging, it’s wild.",
      "created_utc": 1600522272.0,
      "score": 9,
      "context": [
        {
          "id": "g5rn76n",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600479277.0
        }
      ]
    },
    {
      "id": "g5sthax",
      "author": "niceartichoke",
      "body": "the thing is i’ll never really “binge” as such? i think what i interpret as a binge/too-much-food/worthy-of-a-purge is a large meal for most other people, and i just don’t know how to listen to my hunger cues and stop when i’m just full. but i guess that’s kind of what you’re talking about anyways - for me, it’s relearning How To Eat and listening to my body. i was a kid who was always told to finish my food regardless of how full i was, so i suppose that’s contributed to it.",
      "created_utc": 1600509080.0,
      "score": 7,
      "context": [
        {
          "id": "g5sg81s",
          "author": "MaeveTheLion",
          "body": "Johns Hopkins' eating disorder treatment center in the US talks about \"normalising\" eating again, because we forget *how* to eat. They also say that new behaviours take something like 18 - 254 days to become automatic habits, but it is possible.\n\nCould you write down the reasons you don't want to use that \"undo button\" and keep them close at hand? How about anticipate some of the transitional moments that lead down to a binge and thinking through the actions you'll take when you get there?",
          "created_utc": 1600495874.0
        }
      ]
    },
    {
      "id": "g5ss7fj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600507662.0,
      "score": 7,
      "context": [
        {
          "id": "g5s1np2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600486205.0
        }
      ]
    },
    {
      "id": "g5t2umy",
      "author": "None",
      "body": "I’m at least glad to see I’m not the only one who thinks of it as an “undo button”",
      "created_utc": 1600518888.0,
      "score": 6,
      "context": [
        {
          "id": "g5t0cky",
          "author": "stelas",
          "body": "i'm 5 days b/p free at the moment, but i also keep thinking about how EASY a relapse would be.. it's hard to stop when you know you can do it, that the 'undo button' is possible.",
          "created_utc": 1600516573.0
        }
      ]
    },
    {
      "id": "g5stojg",
      "author": "niceartichoke",
      "body": "oof yeah, sometimes i’ll be super hungover and make myself puke just to get rid of the nausea. weirdly enough, i think that’s what normalised puking for me?? fuck college drinking lol",
      "created_utc": 1600509308.0,
      "score": 6,
      "context": [
        {
          "id": "g5s1np2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600486205.0
        },
        {
          "id": "g5ss7fj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600507662.0
        }
      ]
    },
    {
      "id": "g5t2sz2",
      "author": "None",
      "body": "“Boot and rally”",
      "created_utc": 1600518848.0,
      "score": 3,
      "context": [
        {
          "id": "g5s1np2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600486205.0
        },
        {
          "id": "g5ss7fj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600507662.0
        },
        {
          "id": "g5stojg",
          "author": "niceartichoke",
          "body": "oof yeah, sometimes i’ll be super hungover and make myself puke just to get rid of the nausea. weirdly enough, i think that’s what normalised puking for me?? fuck college drinking lol",
          "created_utc": 1600509308.0
        }
      ]
    }
  ]
}