{
  "id": "ivxlul",
  "subreddit": "bulimia",
  "author": "litterboxdweller",
  "created_utc": 1600538975.0,
  "title": "Loss",
  "selftext": "This awful disease makes me feel like I've lost myself and that I'll never get her back.\n\nAfter some purges, I write poems. Here's one about losing myself...\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/2lra0joea5o51.png?width=595&format=png&auto=webp&s=9d561f65f1bee96837c09f401832897fd9229679",
  "url": "https://www.reddit.com/r/bulimia/comments/ivxlul/loss/",
  "score": 81,
  "num_comments": 6,
  "comments": [
    {
      "id": "g5vznpq",
      "author": "Brave_Appointment",
      "body": "This is beautifully written & so completely relatable.. Thank you so much for sharing 💙 Hang in there, it can get better I promise 💙💙",
      "created_utc": 1600560150.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5uqdij",
      "author": "imsodonewithmyself",
      "body": "I’m here if you need anyone to talk to or if you want someone you can relate too. I’ve felt like that for 11 months now ahh it sucks but this isn’t over. You got this, you have to believe that you can and you will.",
      "created_utc": 1600544804.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g5wc0y9",
      "author": "LischenVonEngels",
      "body": "God, I love your use of rhyming. Thank you so much for sharing this, please know you're never alone.",
      "created_utc": 1600563827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5xjc3d",
      "author": "KDRyan97",
      "body": "Such good lyrics! Those lines “my emotions hidden in the horse of Troy” or “I’m broken, you cannot put in another token.” Such beautiful imagery. \n\nAnd I know exactly how that feels. You lose yourself in this illness. You feel like you have to hide because that’s what society expects of you, but you’re done hiding. You are broken and don’t think you can be fixed. But it doesn’t have to stay that way. \n\nI love poetry, especially songwriting, and I wrote my story through song as well. But I won’t share that here - I just wanted to say that I’ve been there and I’m glad that you can find an outlet through your art. \n\nNow - back to the hope. I’m a recovered bulimic and binge eater. I’m living in a freedom that I can write about without worrying if I’ll lose it again. You can recover. \n\nFor me, it took coming to the end of myself. I had to accept I was powerless over my compulsive behaviors around food and I needed something outside myself - stronger than therapy or psychiatry, and lasting, not a diet or meal plan. \n\nNot everyone is powerless. Some can find recovery through the meal plan or group therapy or whatever it may be. If it works, go for it!\n\nFor me though, I was this chronic type of compulsive eater who could not leave food alone. Couldn’t stop thinking about it, eating it, purging it. My behavior was addictive. And whereas others could binge eat for a season and then return to normalcy, I couldn’t do the same. \n\nI am not normal. And I’ve accepted that. It’s ok if you’re not, and ok if you are. What matters is that you get the help you need.\n\nI am here - if you want to talk about recovery, if you want someone to share your poems with who can truly appreciate them, if you are seeking something stronger that can help you overcome this illness, if you feel you’ve hit your rock bottom with something that has become an addiction — wherever you are. I’m here. Feel free to PM me any time. 💕",
      "created_utc": 1600577997.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5xsaf4",
      "author": "barristerbuttkiss",
      "body": "Ooof the feels. Ty for posting this ❤️",
      "created_utc": 1600581534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g69d41t",
      "author": "wallace1313525",
      "body": "I really like this poem!",
      "created_utc": 1600812884.0,
      "score": 2,
      "context": []
    }
  ]
}