{
  "id": "iyzec7",
  "subreddit": "bulimia",
  "author": "Current-Lime",
  "created_utc": 1600961503.0,
  "title": "I binge ate 10,271 calories in 21 hours",
  "selftext": "Hey everyone. I'm Richie, 25M from the UK, and I've struggled with binge eating since I was 19.\n\nI've done a lot of compensatory behaviour (extreme exercise & fasting, never purging) in the past as a failed strategy to combat my binge eating, so guessed there's loads more of us out here.\n\nI didn't fully realise about my binge eating until a day in October two years ago when I ate 10,271 calories in 21 hours.\n\nI decided to film myself talking about this because we have a lot of fucking work to do to tackle the stigma men feel around Binge Eating:[https://youtu.be/LQN2rI8i1CM](https://youtu.be/LQN2rI8i1CM)\n\nI've typed out some more context below as well.\n\nIf you're a guy needing support with Binge Eating, please do drop me a message: I'm here for you and we have a men's support group going with 40 of us sharing our stories 💪\n\nSending love to you all.\n\n\\--------------------\n\n*I felt I was living a double life.From the outside it looked good: I'd graduated from Cambridge, I'd started a company the year before, I was sociable at parties.On the inside, I felt like a failure and felt like my life wasn't going anywhere.*\n\n*As men, we don't learn about eating disorders.*\n\n* *From society, we hear that \"guys don't have eating disorders, only women do\".*\n* *From our own brains, we tell ourselves \"it's not manly, it's shameful\".*\n* *From our well-meaning friends, we hear \"you're fine mate, everyone eats a lot, don't make a big deal of it\".*\n\n*Luckily, I've had CBT therapy in the last 18 months and am doing well now.*\n\n*But I know how difficult it is for us men who binge eat.We firstly need to be aware that this exists as a condition and we then need to be able to admit to ourselves that we are struggling.Only then can we get the help we need.*\n\n*So the stigma and the shame needs to change.*\n\n*My mission is to make it easier for guys like me — and maybe if you're reading this, guys like you — to get the help we need to tackle binge eating.*\n\n&#x200B;\n\n\\--- edit ---\n\nI’ve had lots of people reach out to join the community for men who struggle with binge eating. Either DM me or fill in this form and I’ll add you [https://forms.gle/hiEUFPiPYKaTcQiR8](https://forms.gle/hiEUFPiPYKaTcQiR8) — stay strong fellas\n\nAlso created a subreddit for us: [https://www.reddit.com/r/BingeEatingMen](https://www.reddit.com/r/BingeEatingMen)",
  "url": "https://www.reddit.com/r/bulimia/comments/iyzec7/i_binge_ate_10271_calories_in_21_hours/",
  "score": 152,
  "num_comments": 10,
  "comments": [
    {
      "id": "g6g5keq",
      "author": "taroidi",
      "body": "hate how theres so much taboo and stigma around eating disorders like the idea that only girls get it, or that you have to be anorexic to actually get help. really appreciate you for posting this!!! hope the pain eases :))",
      "created_utc": 1600970718.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g6g2iz0",
      "author": "MidnightRaven30",
      "body": "Thank you for this!",
      "created_utc": 1600969247.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g6h07du",
      "author": "Lyss938",
      "body": "Thanks for being brave enough to share your struggles with eating disorders. People like you help other men realize they aren’t alone. This is not a one gender disorder and we need more people like you to break the stigma. Keep it up and good luck with your recovery",
      "created_utc": 1600983465.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g6guc53",
      "author": "MarmaladePanda",
      "body": "Fight that good fight Richie - You are brave and the telling of your story can bring so many out of the darkness of EDs shadow. 🦁💛",
      "created_utc": 1600980906.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g6h5mwp",
      "author": "LischenVonEngels",
      "body": "You're an amazing man Richie, don't ever forget that.",
      "created_utc": 1600986415.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g6hv3ox",
      "author": "qwertikat",
      "body": "Wow. Very empowering, thank you for sharing!! Hope you're in a better place now, or get there soon",
      "created_utc": 1601001260.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6iev5i",
      "author": "AlinaAirline",
      "body": "BED and bulumia arr impossibly hard to get help for and deal with as it is, can't imagine the extra difficulty being male. Stay strong x",
      "created_utc": 1601014536.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6ijyw0",
      "author": "esberanza",
      "body": "I'm so glad to see more men are speaking up about their struggles with eating disorders and disordered eating. Keep fighting the food fight, Richie!",
      "created_utc": 1601018991.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6iu4np",
      "author": "Emyrbl",
      "body": "It's touching how brave and humble you are. Thanks for sharing man and keep up the good work!",
      "created_utc": 1601030596.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6kento",
      "author": "19nov97",
      "body": "MAD respect for you, brother. 💙💙💙",
      "created_utc": 1601063226.0,
      "score": 2,
      "context": []
    }
  ]
}