{
  "id": "izokwt",
  "subreddit": "bulimia",
  "author": "SendMoreCatVids",
  "created_utc": 1601057260.0,
  "title": "Hi",
  "selftext": "I am honestly petrified to post this, I am afraid it will get back to my family and friends.  But, here goes.  I am a 43yo Male, a 15 year Combat Veteran and I have struggled with binging and purging since I was 17yo.  I have become an expert at hiding it, I have lied to people I love, I have purged at friends houses, family's houses, pretty much anywhere I have put food in my mouth I have done it.  The only person that knows is my wife and she has no idea how to help me.  I am so tired of living with the guilt and shame that I feel every time, I am tired of blowing through hundreds of dollars in groceries and I have kids that need me around and I don't want them to lose me early.  I am ashamed of what I see in the mirror, I don't know how to stop and worst of all, I am scared to go get help and they don't believe me.  I have learned different ways of keeping just enough weight on me that people don't get suspicious.  But, I am obsessed with shoving as much food in me as possible and I need help.  Please.\n\nEDIT: Thank you all for the amazing support and for sharing your personal experiences with me. It really helps to know I’m not alone. And thanks to all your encouragement, I called my doctor and made an appointment for Monday! I hope to be in this group helping others just as you’ve all helped me! You’re all in my heart!",
  "url": "https://www.reddit.com/r/bulimia/comments/izokwt/hi/",
  "score": 181,
  "num_comments": 60,
  "comments": [
    {
      "id": "g6kd0ai",
      "author": "Zo50",
      "body": "53, soon to be 54 ex services male. You ain't alone mate. Chin up.\n\nEdit. \n\nThanks for the gold kind stranger. \n\nHope you chucked one Catsvid way tho. That geezer's hurting and I'm just a sad old git who's long came to terms with this sickness and where it'll end.",
      "created_utc": 1601062347.0,
      "score": 60,
      "context": []
    },
    {
      "id": "g6k7juk",
      "author": "rachihc",
      "body": "I know it must feel harder because you are a man, a grown man, and silly society pictures eating disorders as a teenage girl thing. Well is not. BED is a serious illness, and it deserves all the attention. I know is hard but try to find a therapist, better one specialised on eating disorders. They will not dismiss you.\nFor now, try to be kind and patient to yourself. Recovery is a long process. With ups and downs, you might feel you failed, but that is part of the journey. I have struggled since I am 10 and I am 30 now and I know how a long journey can feel. \nYour wife might not need to do much besides listening, that is super helpful. But if you feel you rather not be so open about some thoughts, could you try journaling. Remind you also that this part of you is an illness that you can beat. The \"ed brain\" makes us dirty, really beats us down to the ground, but we are more than that and we can make it go away with time and work.",
      "created_utc": 1601059492.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g6k7aoq",
      "author": "Elliebee1234",
      "body": "Just know ur age and gender don't difine mental health. U have put ur life for ur country and that is extremely brave, u are worthy of love, and an amazing man ❤️",
      "created_utc": 1601059361.0,
      "score": 42,
      "context": []
    },
    {
      "id": "g6k7gqy",
      "author": "sharongrace_",
      "body": "I'm so sorry you've been struggling so long without help. Don't be ashamed of yourself for having an eating disorder. No one deserves this, and it's never your fault for developing an ED.\n\nIts good that your wife knows about your situation, but I feel like professional help would benefit you both. A therapist and treatment team would be able to support you in recovery, and they could also direct your wife in helping you get better as well. As far as I know, you can get referred to a therapist through your general practitioner (in the USA) who can then diagnose you and maybe also refer you to a dietician. If you can't get to your GP, I believe you can also make a direct appointment with a therapist.\nAgain, I'm so sorry you've been struggling for so long, and you deserve a life better than what your ED has been giving you. I wish you the best",
      "created_utc": 1601059448.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g6ka5y9",
      "author": "None",
      "body": "Do you need help finding a therapist or dietitian?  I know a lot of great resources!",
      "created_utc": 1601060856.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g6kca2z",
      "author": "19nov97",
      "body": "Wow, it’s amazing that you have opened up to the idea of change. I have been battling BED for the past 3 years, and introduced purging a year ago. I absolutely hate this aspect of my life. Having an ED truly is the most frustrating and isolating experience. The most challenging part is that food is at the centre of many social interactions, and we need it to survive. I haven’t been honest with my loved ones either bc I know it will worry them. Your wife is scared because she loves you and hates to imagine your suffering. \n\nGet in touch with some professionals that can help you out. I believe in you!!!!!!!!!",
      "created_utc": 1601061967.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g6kif2d",
      "author": "Briannna0",
      "body": "Thank you for your service❤️💙So many people relate to you, I struggled last year and this year with bp now I'm back to anorexic. There is so much guilt and shame associated with eating disorders it's unbearable a lot of the time. I hope knowing you aren't alone helps. If you can try to see a therapist I think it would help. I saw one thisbpast year until quarantine and I was too embarassed to continue because I live with parents and there is never a time where I have ghe privacy to do therapy from home and my family history is riddled with abuse and causes of my mental health issues, but I would continue if I felt I could comfortably. Posting here helps me a lot, and so does watching videos by ED therapist Kati Morton on youtube. Your wife along with you could understand and help by watching her videos, she has some on helping loved ones along with every other mental health and ED issue under the sun. I also use a workbook called The Body Awareness Workbook for Trauma written by an MD and when I regularly use it it feels like therapy. I am also a parent and as much as I feel depressed and deep in a hole, I too want to be here for my child. Remember that baby steps in the right direction are worth celebrating. You matter and you aren't alone.❤️",
      "created_utc": 1601065249.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g6kw8vp",
      "author": "jentr0py",
      "body": "You are valid and worthy of help. The good news is that more and more professionals are recognizing that eating disorders can affect anyone, irrespective of gender, age, race, or socio-economic status. Get online and seek out support groups for men suffering from eating disorders, as well as resources for finding one on one help. There is hope and help out there for you, no matter how deeply or how long you have been entrenched in this disorder. You are a combat veteran so you are clearly very brave; you can absolutely overcome this. I wish you the best.",
      "created_utc": 1601073109.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6kdcps",
      "author": "cutielexii",
      "body": "Omg were like twins but i’m.... anyway i’d suggest working on ur mental health as ur top priority, as that’s where most binging comes from! open up and try to do activities u love to get ur mind off of eating when you’re not hungry or overeating",
      "created_utc": 1601062531.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g6ktqzw",
      "author": "mysocksareitchy",
      "body": "You are worthy of love and help, sending positive vibes. 🙏🏻\nAlso, thank you for serving.",
      "created_utc": 1601071628.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6l878y",
      "author": "zetaexe",
      "body": "Hey, remember that if you're male or older than a teenager it doesn't mean you're ridicolous or anything if you struggle with things like that.  \n\n\nAnyway, I think you absolutely need to seek the help of a professionist, there's nothing wrong with needing help.. I just hope you won't get an asshole that will tell you to \"man up\" and bullshits like that. You are worthy of help, love and you're amazing.",
      "created_utc": 1601079316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6l9ugr",
      "author": "MarmaladePanda",
      "body": "You are so brave. And worthy of recovery. ED is insidious, secretive, brutally shameful by an unaccepting world and I validate everything you’ve said. Your first step to “better” is done - you know you need help. Step two, find it. I went to outpatient rehab at 38 after fighting it for 25 years - every day I step closer to an ED free life. It’s not perfect and that is recovery. Rehab might not be right for you, but I would recommend seeking help from a ED specialist and checking out nationaleatingdisorders.org. You’re not alone in the fight. 🦁💛",
      "created_utc": 1601080367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6mqmqc",
      "author": "DreamOnRitalin",
      "body": "The guilt and shame can be a lot but just remember. Bulimia isn’t who you are, it’s something that You’re experiencing. People don’t choose to get sick and neither did you. You are brave and we are all here for you!",
      "created_utc": 1601101992.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6ktss0",
      "author": "victoriousbbyg",
      "body": "Eating disorders are up there with schizophrenia in terms of people not being able to understand. They’re complex and can take many forms. I know mine now is more habit and compulsion than it was at the start. At the start it was a way to control my life when I had basically no control over anything. Perhaps if it’s not too painful or uncomfortable, you could talk with your wife about when this all first started and try and reflect on your feelings and emotional state then. And maybe you could reflect (potentially in your head or in a journal) about what you feel just before a binge and what kind of triggers it. This may not be easy bc for some of us it’s like a drawn out process of looking at catalogues and planning a binge. Tbh most of the professional help I’ve gotten was a) keep a food journal (makes u feel shit bc u see all the food ur wasting) b) just follow this shit meal plan for a while c) CBT. No one was ever really interested in the cause, just masking or changing symptoms. Perhaps you could also speak with a doctor about medication. Good luck friend, I really feel for you being not the typical sufferer. It must be really hard and I could imagine the shame much higher. Best of luck!",
      "created_utc": 1601071657.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6lrlat",
      "author": "KDRyan97",
      "body": "Thank you for your service. And for opening up and sharing your story. Know that your ED does not define you. Binging and purging are symptoms sometimes of a deeper illness - some have already mentioned therapeutic help. I want to provide you with another resource that helped me recover. \n\nWhen I tried dieting, I would binge harder. When I tried a pill prescribed by my psychiatrist, i thought I had carte Blanche to binge and purge - because surely the medicine just wasn’t working yet. \n\nI was terrified of the kitchen and what I’d do in there. I’d sometimes spend all day in bed, afraid if I left I’d eat everything I had, go to the store, pack in more, and purge it all again. Fear ruled my interactions with people, with what they might find out about me, with what I saw in the mirror, what I ate and didn’t eat. I binged, purged, restricted, compulsively exercised - anything to fill the void. \n\nMy eating disorder was in control. And I’d learned I couldn’t be. I had zero willpower to handle this illness. This past spring, I met some people who were recovered from what they called compulsive eating. And when they described their stories to me, I felt like someone could finally understand me. They described an illness that affects the mind and the body - with a mental obsession around food and a bodily craving that is set off whenever I start to compulsively eat. It all made sense. That’s why no diet could work for me. I was obsessed. I needed help outside my own willpower. \n\nToday, I’m recovered from my compulsive behaviors around food. I don’t have to white knuckle it anymore. I don’t count calories, weigh myself obsessively, or cut out certain foods. I found this recovery through a 12-step program that emphasizes freedom over restriction and fellowship and spirituality over going it alone. If that sounds like something that would interest you, please don’t hesitate to reach out via PM. I’d love to be helpful in any way I can ❤️",
      "created_utc": 1601088107.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6mdo8l",
      "author": "BigChiliDawg",
      "body": "You know, I’ve been told by my therapist that eating disorders are really akin to an addiction. And I know that one of the steps in recovery for addiction as well as eating disorders is admitting you have an issue. And you’ve done just that, admitting it to other people, even just random strangers on the internet, can make it so much more real. Please get the help you need! I can’t imagine having to go through an eating disorder for so long, and I’m so sorry you’ve had to deal with that.\nIt’s very good that you have your wife’s support as that’ll make recovery so much easier. Please consider reaching out to a therapist or someone like that who specializes in Eating Disorders! Godspeed, I wish you the best in life :)",
      "created_utc": 1601096579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6ml07y",
      "author": "outtie-5000",
      "body": "I wish the best for you in finding help and treatment. I hope your wife continues to be a pillar of support for you and that you find comfort and community with us here. It can be so hard to be vulnerable with the people you care about, but I hope from now on you know that you can always come here in the darkest moments.",
      "created_utc": 1601099943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6mxkrr",
      "author": "hanamaukka",
      "body": "Even though I'm Finnish, I want to thank you for your service. No matter where you are, fighting for your country is not exactly easy. And thank you for being brave and opening up to us.\nI'm sorry to hear about your situation. I definitely recommend speaking to a dietitian, a psychologist, a doctor or any healthcare professional. The more you talk about it, the easier it will be. If you get an appointment, I also recommend writing down everything you want to say (symptoms, how this affects your life, what you need, any questions), so that no detail goes unsaid and your issue is treated seriously.\nIf you're concerned about binging and purging a lot of money, I'd advise you to drink more water. When you eat, take a sip of water after every 2-3 bites. It will at least slow down your binge, and it may trick your body into thinking you're more full. However, if you begin drinking a lot of water, remember to take electrolytes (natrium, calcium, kalium, magnesium etc.)! And this is really not a solution to the issue as a whole, seeing a professional is the #1 priority.\nI hope things get better soon. We believe in you!",
      "created_utc": 1601104726.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6n08rp",
      "author": "_bizong",
      "body": "I understand you look at ED differently as they are portrayed as a girl/woman thing. However you are not alone. I know it's hard to say and admit it to smbd  who you don't know and get medical help. You may perceive it that you have failed that you cannot get through this on your own. But it's not like that. It's a mental disease. If your leg was broken, you'd go and get help. Your mind is broken, where is the help you need? \n\nI hope you'll get through this (I also belong to B/P)",
      "created_utc": 1601106371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6o56x3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1601122521.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6ktvw2",
      "author": "LischenVonEngels",
      "body": "Thank you for your service; my family has a military background and I will always admire the tireless work that you've done and still continue to do. Please don't blame yourself, EDs are not our faults, they're products of a system that has failed us and wants us to take the blame. You are an amazing man, husband, and father, your ED does not get in the way of that.",
      "created_utc": 1601071709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6n4i13",
      "author": "MidnightRaven30",
      "body": "So many guys will be so great full that you’ve posted this! We’re all here for you! More awareness needs to be spread on mental health, particularly in men, I hope you can find peace, I know how debilitating this illness can be.",
      "created_utc": 1601107939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6ojwli",
      "author": "Mental_Chip9096",
      "body": "I want to share with you that I have been struggling with the same thing for two and a half decades and I totally get it-- the double life, the lies, the thousands of dollars and immense amount of time and life wasted. The shame and the hatred of what you see when you look in the mirror. I also want you to know that it can get better. I'm a work in progress, but I am six months free of b/p. It is possible! \n\nWhat I've been doing: taking several medications, most importantly Topamax and Naltrexone-- of course everyone is different, but for me it's been a game changer. I see specialized therapists, for EMDR (a type of trauma therapy) and IFS (a type of therapy developed for eating disorders) after years of regular talk therapy didn't help me much. Ive read a lot of books also, but I highly recommend The Body Keeps the Score if you've experienced trauma. I also subscribe to the One Day At A Time mindset. It helps me immensely. I try to stay as positive as possible. \n\nYou need a specialized, expert team of care- a physician to follow you. You may have long term damage. You need a good dentist. A very good therapist with experience in EDs. Probably an ED informed dietician as well. You CAN do this, one day and one step at a time. I believe in you. I'm happy to PM with you and support you and send resources also. I swear to you I've been where you are and I know how dark and desperate it feels, but there is hope. You're in my thoughts.",
      "created_utc": 1601128328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbw0a4o",
      "author": "lorem6300118",
      "body": "I hope things are at least a little better since first posting this, and hopefully a lot better. Thanks for sharing.",
      "created_utc": 1605056534.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6kcrqw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1601062222.0,
      "score": -10,
      "context": []
    },
    {
      "id": "g6kqacg",
      "author": "SendMoreCatVids",
      "body": "Thank you for serving and thank you for your post. It helps that I’m not alone.",
      "created_utc": 1601069604.0,
      "score": 14,
      "context": [
        {
          "id": "g6kd0ai",
          "author": "Zo50",
          "body": "53, soon to be 54 ex services male. You ain't alone mate. Chin up.\n\nEdit. \n\nThanks for the gold kind stranger. \n\nHope you chucked one Catsvid way tho. That geezer's hurting and I'm just a sad old git who's long came to terms with this sickness and where it'll end.",
          "created_utc": 1601062347.0
        }
      ]
    },
    {
      "id": "g6kasr8",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! That means more than I can express.",
      "created_utc": 1601061193.0,
      "score": 12,
      "context": [
        {
          "id": "g6k7juk",
          "author": "rachihc",
          "body": "I know it must feel harder because you are a man, a grown man, and silly society pictures eating disorders as a teenage girl thing. Well is not. BED is a serious illness, and it deserves all the attention. I know is hard but try to find a therapist, better one specialised on eating disorders. They will not dismiss you.\nFor now, try to be kind and patient to yourself. Recovery is a long process. With ups and downs, you might feel you failed, but that is part of the journey. I have struggled since I am 10 and I am 30 now and I know how a long journey can feel. \nYour wife might not need to do much besides listening, that is super helpful. But if you feel you rather not be so open about some thoughts, could you try journaling. Remind you also that this part of you is an illness that you can beat. The \"ed brain\" makes us dirty, really beats us down to the ground, but we are more than that and we can make it go away with time and work.",
          "created_utc": 1601059492.0
        }
      ]
    },
    {
      "id": "g6kaxws",
      "author": "SendMoreCatVids",
      "body": "Thank you very much! I need to read these when I get home so I’m not tearing up in the office. Thank you!",
      "created_utc": 1601061268.0,
      "score": 17,
      "context": [
        {
          "id": "g6k7aoq",
          "author": "Elliebee1234",
          "body": "Just know ur age and gender don't difine mental health. U have put ur life for ur country and that is extremely brave, u are worthy of love, and an amazing man ❤️",
          "created_utc": 1601059361.0
        }
      ]
    },
    {
      "id": "g6kavkx",
      "author": "SendMoreCatVids",
      "body": "Thank you it means so much!",
      "created_utc": 1601061235.0,
      "score": 4,
      "context": [
        {
          "id": "g6k7gqy",
          "author": "sharongrace_",
          "body": "I'm so sorry you've been struggling so long without help. Don't be ashamed of yourself for having an eating disorder. No one deserves this, and it's never your fault for developing an ED.\n\nIts good that your wife knows about your situation, but I feel like professional help would benefit you both. A therapist and treatment team would be able to support you in recovery, and they could also direct your wife in helping you get better as well. As far as I know, you can get referred to a therapist through your general practitioner (in the USA) who can then diagnose you and maybe also refer you to a dietician. If you can't get to your GP, I believe you can also make a direct appointment with a therapist.\nAgain, I'm so sorry you've been struggling for so long, and you deserve a life better than what your ED has been giving you. I wish you the best",
          "created_utc": 1601059448.0
        }
      ]
    },
    {
      "id": "g6kantz",
      "author": "SendMoreCatVids",
      "body": "If that’s where you recommend I start, yes please. Thank you so much!",
      "created_utc": 1601061121.0,
      "score": 6,
      "context": [
        {
          "id": "g6ka5y9",
          "author": "None",
          "body": "Do you need help finding a therapist or dietitian?  I know a lot of great resources!",
          "created_utc": 1601060856.0
        }
      ]
    },
    {
      "id": "g6kqh1h",
      "author": "SendMoreCatVids",
      "body": "Thank you so much, I will do that. Just posting on here has been a weight off my shoulders!",
      "created_utc": 1601069711.0,
      "score": 3,
      "context": [
        {
          "id": "g6kca2z",
          "author": "19nov97",
          "body": "Wow, it’s amazing that you have opened up to the idea of change. I have been battling BED for the past 3 years, and introduced purging a year ago. I absolutely hate this aspect of my life. Having an ED truly is the most frustrating and isolating experience. The most challenging part is that food is at the centre of many social interactions, and we need it to survive. I haven’t been honest with my loved ones either bc I know it will worry them. Your wife is scared because she loves you and hates to imagine your suffering. \n\nGet in touch with some professionals that can help you out. I believe in you!!!!!!!!!",
          "created_utc": 1601061967.0
        }
      ]
    },
    {
      "id": "g6kq7cu",
      "author": "SendMoreCatVids",
      "body": "Thank you so much that means a lot. It really helps to know I’m not alone, and I will definitely look at the videos and the workbook. I’m sorry you had to have that abuse in your life. We are cut from the same cloth, and I feel like there is a definite connection between the abuse and eating disorders.",
      "created_utc": 1601069556.0,
      "score": 5,
      "context": [
        {
          "id": "g6kif2d",
          "author": "Briannna0",
          "body": "Thank you for your service❤️💙So many people relate to you, I struggled last year and this year with bp now I'm back to anorexic. There is so much guilt and shame associated with eating disorders it's unbearable a lot of the time. I hope knowing you aren't alone helps. If you can try to see a therapist I think it would help. I saw one thisbpast year until quarantine and I was too embarassed to continue because I live with parents and there is never a time where I have ghe privacy to do therapy from home and my family history is riddled with abuse and causes of my mental health issues, but I would continue if I felt I could comfortably. Posting here helps me a lot, and so does watching videos by ED therapist Kati Morton on youtube. Your wife along with you could understand and help by watching her videos, she has some on helping loved ones along with every other mental health and ED issue under the sun. I also use a workbook called The Body Awareness Workbook for Trauma written by an MD and when I regularly use it it feels like therapy. I am also a parent and as much as I feel depressed and deep in a hole, I too want to be here for my child. Remember that baby steps in the right direction are worth celebrating. You matter and you aren't alone.❤️",
          "created_utc": 1601065249.0
        }
      ]
    },
    {
      "id": "g6kyqc6",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! I will do that!",
      "created_utc": 1601074256.0,
      "score": 1,
      "context": [
        {
          "id": "g6kw8vp",
          "author": "jentr0py",
          "body": "You are valid and worthy of help. The good news is that more and more professionals are recognizing that eating disorders can affect anyone, irrespective of gender, age, race, or socio-economic status. Get online and seek out support groups for men suffering from eating disorders, as well as resources for finding one on one help. There is hope and help out there for you, no matter how deeply or how long you have been entrenched in this disorder. You are a combat veteran so you are clearly very brave; you can absolutely overcome this. I wish you the best.",
          "created_utc": 1601073109.0
        }
      ]
    },
    {
      "id": "g6kefsy",
      "author": "SendMoreCatVids",
      "body": "Thank you! I will try that. I’m so glad I posted I almost deleted it.",
      "created_utc": 1601063107.0,
      "score": 7,
      "context": [
        {
          "id": "g6kdcps",
          "author": "cutielexii",
          "body": "Omg were like twins but i’m.... anyway i’d suggest working on ur mental health as ur top priority, as that’s where most binging comes from! open up and try to do activities u love to get ur mind off of eating when you’re not hungry or overeating",
          "created_utc": 1601062531.0
        }
      ]
    },
    {
      "id": "g6lc1w9",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! I really appreciate the support.",
      "created_utc": 1601081773.0,
      "score": 1,
      "context": [
        {
          "id": "g6ktqzw",
          "author": "mysocksareitchy",
          "body": "You are worthy of love and help, sending positive vibes. 🙏🏻\nAlso, thank you for serving.",
          "created_utc": 1601071628.0
        }
      ]
    },
    {
      "id": "g7fltfv",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! I have definitely been raised in a culture that says we have to “man up” all the time!",
      "created_utc": 1601666574.0,
      "score": 2,
      "context": [
        {
          "id": "g6l878y",
          "author": "zetaexe",
          "body": "Hey, remember that if you're male or older than a teenager it doesn't mean you're ridicolous or anything if you struggle with things like that.  \n\n\nAnyway, I think you absolutely need to seek the help of a professionist, there's nothing wrong with needing help.. I just hope you won't get an asshole that will tell you to \"man up\" and bullshits like that. You are worthy of help, love and you're amazing.",
          "created_utc": 1601079316.0
        }
      ]
    },
    {
      "id": "g7flocf",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! I have been looking at the website, thank you for sharing! Thank",
      "created_utc": 1601666523.0,
      "score": 2,
      "context": [
        {
          "id": "g6l9ugr",
          "author": "MarmaladePanda",
          "body": "You are so brave. And worthy of recovery. ED is insidious, secretive, brutally shameful by an unaccepting world and I validate everything you’ve said. Your first step to “better” is done - you know you need help. Step two, find it. I went to outpatient rehab at 38 after fighting it for 25 years - every day I step closer to an ED free life. It’s not perfect and that is recovery. Rehab might not be right for you, but I would recommend seeking help from a ED specialist and checking out nationaleatingdisorders.org. You’re not alone in the fight. 🦁💛",
          "created_utc": 1601080367.0
        }
      ]
    },
    {
      "id": "g6ok47s",
      "author": "SendMoreCatVids",
      "body": "Thank you so much!",
      "created_utc": 1601128407.0,
      "score": 1,
      "context": [
        {
          "id": "g6mqmqc",
          "author": "DreamOnRitalin",
          "body": "The guilt and shame can be a lot but just remember. Bulimia isn’t who you are, it’s something that You’re experiencing. People don’t choose to get sick and neither did you. You are brave and we are all here for you!",
          "created_utc": 1601101992.0
        }
      ]
    },
    {
      "id": "g6lc0a0",
      "author": "SendMoreCatVids",
      "body": "I’m definitely going to try the journal. Thank you for the help and encouragement.",
      "created_utc": 1601081746.0,
      "score": 1,
      "context": [
        {
          "id": "g6ktss0",
          "author": "victoriousbbyg",
          "body": "Eating disorders are up there with schizophrenia in terms of people not being able to understand. They’re complex and can take many forms. I know mine now is more habit and compulsion than it was at the start. At the start it was a way to control my life when I had basically no control over anything. Perhaps if it’s not too painful or uncomfortable, you could talk with your wife about when this all first started and try and reflect on your feelings and emotional state then. And maybe you could reflect (potentially in your head or in a journal) about what you feel just before a binge and what kind of triggers it. This may not be easy bc for some of us it’s like a drawn out process of looking at catalogues and planning a binge. Tbh most of the professional help I’ve gotten was a) keep a food journal (makes u feel shit bc u see all the food ur wasting) b) just follow this shit meal plan for a while c) CBT. No one was ever really interested in the cause, just masking or changing symptoms. Perhaps you could also speak with a doctor about medication. Good luck friend, I really feel for you being not the typical sufferer. It must be really hard and I could imagine the shame much higher. Best of luck!",
          "created_utc": 1601071657.0
        }
      ]
    },
    {
      "id": "g7fll19",
      "author": "SendMoreCatVids",
      "body": "Thank you so much! And I am so glad you did! I am feeling very hopeful!",
      "created_utc": 1601666488.0,
      "score": 2,
      "context": [
        {
          "id": "g6lrlat",
          "author": "KDRyan97",
          "body": "Thank you for your service. And for opening up and sharing your story. Know that your ED does not define you. Binging and purging are symptoms sometimes of a deeper illness - some have already mentioned therapeutic help. I want to provide you with another resource that helped me recover. \n\nWhen I tried dieting, I would binge harder. When I tried a pill prescribed by my psychiatrist, i thought I had carte Blanche to binge and purge - because surely the medicine just wasn’t working yet. \n\nI was terrified of the kitchen and what I’d do in there. I’d sometimes spend all day in bed, afraid if I left I’d eat everything I had, go to the store, pack in more, and purge it all again. Fear ruled my interactions with people, with what they might find out about me, with what I saw in the mirror, what I ate and didn’t eat. I binged, purged, restricted, compulsively exercised - anything to fill the void. \n\nMy eating disorder was in control. And I’d learned I couldn’t be. I had zero willpower to handle this illness. This past spring, I met some people who were recovered from what they called compulsive eating. And when they described their stories to me, I felt like someone could finally understand me. They described an illness that affects the mind and the body - with a mental obsession around food and a bodily craving that is set off whenever I start to compulsively eat. It all made sense. That’s why no diet could work for me. I was obsessed. I needed help outside my own willpower. \n\nToday, I’m recovered from my compulsive behaviors around food. I don’t have to white knuckle it anymore. I don’t count calories, weigh myself obsessively, or cut out certain foods. I found this recovery through a 12-step program that emphasizes freedom over restriction and fellowship and spirituality over going it alone. If that sounds like something that would interest you, please don’t hesitate to reach out via PM. I’d love to be helpful in any way I can ❤️",
          "created_utc": 1601088107.0
        }
      ]
    },
    {
      "id": "g6okddz",
      "author": "SendMoreCatVids",
      "body": "This might be linked to my addictive personality. I kicked alcohol about 10 years ago and when I got out of the Army I was addicted to pain killers. That’s all they would give me when I got hurt and it didn’t take much for me to develop a severe addiction. Thank you for your response and support.",
      "created_utc": 1601128501.0,
      "score": 1,
      "context": [
        {
          "id": "g6mdo8l",
          "author": "BigChiliDawg",
          "body": "You know, I’ve been told by my therapist that eating disorders are really akin to an addiction. And I know that one of the steps in recovery for addiction as well as eating disorders is admitting you have an issue. And you’ve done just that, admitting it to other people, even just random strangers on the internet, can make it so much more real. Please get the help you need! I can’t imagine having to go through an eating disorder for so long, and I’m so sorry you’ve had to deal with that.\nIt’s very good that you have your wife’s support as that’ll make recovery so much easier. Please consider reaching out to a therapist or someone like that who specializes in Eating Disorders! Godspeed, I wish you the best in life :)",
          "created_utc": 1601096579.0
        }
      ]
    },
    {
      "id": "g6okgff",
      "author": "SendMoreCatVids",
      "body": "Thank you she has been amazing.",
      "created_utc": 1601128533.0,
      "score": 2,
      "context": [
        {
          "id": "g6ml07y",
          "author": "outtie-5000",
          "body": "I wish the best for you in finding help and treatment. I hope your wife continues to be a pillar of support for you and that you find comfort and community with us here. It can be so hard to be vulnerable with the people you care about, but I hope from now on you know that you can always come here in the darkest moments.",
          "created_utc": 1601099943.0
        }
      ]
    },
    {
      "id": "g6oknrh",
      "author": "SendMoreCatVids",
      "body": "Thank you I will be seeing my doctor Monday. Thank you!",
      "created_utc": 1601128611.0,
      "score": 2,
      "context": [
        {
          "id": "g6mxkrr",
          "author": "hanamaukka",
          "body": "Even though I'm Finnish, I want to thank you for your service. No matter where you are, fighting for your country is not exactly easy. And thank you for being brave and opening up to us.\nI'm sorry to hear about your situation. I definitely recommend speaking to a dietitian, a psychologist, a doctor or any healthcare professional. The more you talk about it, the easier it will be. If you get an appointment, I also recommend writing down everything you want to say (symptoms, how this affects your life, what you need, any questions), so that no detail goes unsaid and your issue is treated seriously.\nIf you're concerned about binging and purging a lot of money, I'd advise you to drink more water. When you eat, take a sip of water after every 2-3 bites. It will at least slow down your binge, and it may trick your body into thinking you're more full. However, if you begin drinking a lot of water, remember to take electrolytes (natrium, calcium, kalium, magnesium etc.)! And this is really not a solution to the issue as a whole, seeing a professional is the #1 priority.\nI hope things get better soon. We believe in you!",
          "created_utc": 1601104726.0
        }
      ]
    },
    {
      "id": "g6okrd4",
      "author": "SendMoreCatVids",
      "body": "Thank you! I really appreciate the advice and encouragement.",
      "created_utc": 1601128651.0,
      "score": 2,
      "context": [
        {
          "id": "g6n08rp",
          "author": "_bizong",
          "body": "I understand you look at ED differently as they are portrayed as a girl/woman thing. However you are not alone. I know it's hard to say and admit it to smbd  who you don't know and get medical help. You may perceive it that you have failed that you cannot get through this on your own. But it's not like that. It's a mental disease. If your leg was broken, you'd go and get help. Your mind is broken, where is the help you need? \n\nI hope you'll get through this (I also belong to B/P)",
          "created_utc": 1601106371.0
        }
      ]
    },
    {
      "id": "g6ol1ua",
      "author": "SendMoreCatVids",
      "body": "Oh my gosh I’m sorry they called you hopeless! I really appreciate your response and openness with me. I will be getting help.",
      "created_utc": 1601128767.0,
      "score": 1,
      "context": [
        {
          "id": "g6o56x3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601122521.0
        }
      ]
    },
    {
      "id": "g6lbxj6",
      "author": "SendMoreCatVids",
      "body": "Thank you so much for the encouragement and thank you family for their service. I appreciate it.",
      "created_utc": 1601081699.0,
      "score": 2,
      "context": [
        {
          "id": "g6ktvw2",
          "author": "LischenVonEngels",
          "body": "Thank you for your service; my family has a military background and I will always admire the tireless work that you've done and still continue to do. Please don't blame yourself, EDs are not our faults, they're products of a system that has failed us and wants us to take the blame. You are an amazing man, husband, and father, your ED does not get in the way of that.",
          "created_utc": 1601071709.0
        }
      ]
    },
    {
      "id": "g6om3du",
      "author": "SendMoreCatVids",
      "body": "Thank you I know you’re right. I hope for your peace as well.",
      "created_utc": 1601129120.0,
      "score": 1,
      "context": [
        {
          "id": "g6n4i13",
          "author": "MidnightRaven30",
          "body": "So many guys will be so great full that you’ve posted this! We’re all here for you! More awareness needs to be spread on mental health, particularly in men, I hope you can find peace, I know how debilitating this illness can be.",
          "created_utc": 1601107939.0
        }
      ]
    },
    {
      "id": "g6kt6u5",
      "author": "victoriousbbyg",
      "body": "This is a really inappropriate comment. We are here to be supportive. Everyone knows what people in the military do. Everyone knows the trauma and PTSD that it can result in.",
      "created_utc": 1601071296.0,
      "score": 3,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        }
      ]
    },
    {
      "id": "g6kqdia",
      "author": "SendMoreCatVids",
      "body": "Thank you, I will see what I can find. Should I just tell my primary care physician?",
      "created_utc": 1601069653.0,
      "score": 1,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        }
      ]
    },
    {
      "id": "g6mk3ox",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1601099573.0,
      "score": 1,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        }
      ]
    },
    {
      "id": "g6kap2m",
      "author": "None",
      "body": "I'll send you a PM!",
      "created_utc": 1601061139.0,
      "score": 2,
      "context": [
        {
          "id": "g6ka5y9",
          "author": "None",
          "body": "Do you need help finding a therapist or dietitian?  I know a lot of great resources!",
          "created_utc": 1601060856.0
        },
        {
          "id": "g6kantz",
          "author": "SendMoreCatVids",
          "body": "If that’s where you recommend I start, yes please. Thank you so much!",
          "created_utc": 1601061121.0
        }
      ]
    },
    {
      "id": "g6ocrtt",
      "author": "CrystalizedCage",
      "body": "Finding a therapist and dietician is a great first step!\n\nAlso seeing a medical doctor is very important. Bulimia rots us from the inside out. \n\nYour medical doctor or therapist might recommend a higher level of care. I know that the intensive out patient programs I’ve been in accept males. It’s usually 3 nights a week for a few hours and it really helps to be in a group therapy and have to eat with other patients.",
      "created_utc": 1601125763.0,
      "score": 1,
      "context": [
        {
          "id": "g6ka5y9",
          "author": "None",
          "body": "Do you need help finding a therapist or dietitian?  I know a lot of great resources!",
          "created_utc": 1601060856.0
        },
        {
          "id": "g6kantz",
          "author": "SendMoreCatVids",
          "body": "If that’s where you recommend I start, yes please. Thank you so much!",
          "created_utc": 1601061121.0
        }
      ]
    },
    {
      "id": "g6kvmmu",
      "author": "Briannna0",
      "body": "Absolutely. Don't hesitate to reach out okay?",
      "created_utc": 1601072759.0,
      "score": 1,
      "context": [
        {
          "id": "g6kif2d",
          "author": "Briannna0",
          "body": "Thank you for your service❤️💙So many people relate to you, I struggled last year and this year with bp now I'm back to anorexic. There is so much guilt and shame associated with eating disorders it's unbearable a lot of the time. I hope knowing you aren't alone helps. If you can try to see a therapist I think it would help. I saw one thisbpast year until quarantine and I was too embarassed to continue because I live with parents and there is never a time where I have ghe privacy to do therapy from home and my family history is riddled with abuse and causes of my mental health issues, but I would continue if I felt I could comfortably. Posting here helps me a lot, and so does watching videos by ED therapist Kati Morton on youtube. Your wife along with you could understand and help by watching her videos, she has some on helping loved ones along with every other mental health and ED issue under the sun. I also use a workbook called The Body Awareness Workbook for Trauma written by an MD and when I regularly use it it feels like therapy. I am also a parent and as much as I feel depressed and deep in a hole, I too want to be here for my child. Remember that baby steps in the right direction are worth celebrating. You matter and you aren't alone.❤️",
          "created_utc": 1601065249.0
        },
        {
          "id": "g6kq7cu",
          "author": "SendMoreCatVids",
          "body": "Thank you so much that means a lot. It really helps to know I’m not alone, and I will definitely look at the videos and the workbook. I’m sorry you had to have that abuse in your life. We are cut from the same cloth, and I feel like there is a definite connection between the abuse and eating disorders.",
          "created_utc": 1601069556.0
        }
      ]
    },
    {
      "id": "g7foc5c",
      "author": "zetaexe",
      "body": "I know, that's why I said it. That way of thought is just stupid and dehumanising to me... I just hope you can show your weaknesses while searching for help, cause you need it sir!",
      "created_utc": 1601667497.0,
      "score": 3,
      "context": [
        {
          "id": "g6l878y",
          "author": "zetaexe",
          "body": "Hey, remember that if you're male or older than a teenager it doesn't mean you're ridicolous or anything if you struggle with things like that.  \n\n\nAnyway, I think you absolutely need to seek the help of a professionist, there's nothing wrong with needing help.. I just hope you won't get an asshole that will tell you to \"man up\" and bullshits like that. You are worthy of help, love and you're amazing.",
          "created_utc": 1601079316.0
        },
        {
          "id": "g7fltfv",
          "author": "SendMoreCatVids",
          "body": "Thank you so much! I have definitely been raised in a culture that says we have to “man up” all the time!",
          "created_utc": 1601666574.0
        }
      ]
    },
    {
      "id": "g6ld9me",
      "author": "LischenVonEngels",
      "body": "No problem, you deserve kind words. You're a great person.",
      "created_utc": 1601082533.0,
      "score": 1,
      "context": [
        {
          "id": "g6ktvw2",
          "author": "LischenVonEngels",
          "body": "Thank you for your service; my family has a military background and I will always admire the tireless work that you've done and still continue to do. Please don't blame yourself, EDs are not our faults, they're products of a system that has failed us and wants us to take the blame. You are an amazing man, husband, and father, your ED does not get in the way of that.",
          "created_utc": 1601071709.0
        },
        {
          "id": "g6lbxj6",
          "author": "SendMoreCatVids",
          "body": "Thank you so much for the encouragement and thank you family for their service. I appreciate it.",
          "created_utc": 1601081699.0
        }
      ]
    },
    {
      "id": "g6ku63e",
      "author": "sikkerhet",
      "body": "Ignoring the situation isn't going to improve it. Any act of violence can cause trauma to the victim and to the aggressor, and for someone with a desire to do violence, it's important to acknowledge it so they can work through this.",
      "created_utc": 1601071878.0,
      "score": -5,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        },
        {
          "id": "g6kt6u5",
          "author": "victoriousbbyg",
          "body": "This is a really inappropriate comment. We are here to be supportive. Everyone knows what people in the military do. Everyone knows the trauma and PTSD that it can result in.",
          "created_utc": 1601071296.0
        }
      ]
    },
    {
      "id": "g6ksuqr",
      "author": "sikkerhet",
      "body": "Probably yeah.",
      "created_utc": 1601071099.0,
      "score": 0,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        },
        {
          "id": "g6kqdia",
          "author": "SendMoreCatVids",
          "body": "Thank you, I will see what I can find. Should I just tell my primary care physician?",
          "created_utc": 1601069653.0
        }
      ]
    },
    {
      "id": "g6ok26b",
      "author": "SendMoreCatVids",
      "body": "Thank you!",
      "created_utc": 1601128385.0,
      "score": 1,
      "context": [
        {
          "id": "g6ka5y9",
          "author": "None",
          "body": "Do you need help finding a therapist or dietitian?  I know a lot of great resources!",
          "created_utc": 1601060856.0
        },
        {
          "id": "g6kantz",
          "author": "SendMoreCatVids",
          "body": "If that’s where you recommend I start, yes please. Thank you so much!",
          "created_utc": 1601061121.0
        },
        {
          "id": "g6ocrtt",
          "author": "CrystalizedCage",
          "body": "Finding a therapist and dietician is a great first step!\n\nAlso seeing a medical doctor is very important. Bulimia rots us from the inside out. \n\nYour medical doctor or therapist might recommend a higher level of care. I know that the intensive out patient programs I’ve been in accept males. It’s usually 3 nights a week for a few hours and it really helps to be in a group therapy and have to eat with other patients.",
          "created_utc": 1601125763.0
        }
      ]
    },
    {
      "id": "g6oldgj",
      "author": "SendMoreCatVids",
      "body": "I think I understand what you’re saying and you’re right. I have those demons to fight as well. And looking back where I am now, compared to who I was in the military I have changed so much. I appreciate your response.",
      "created_utc": 1601128856.0,
      "score": 3,
      "context": [
        {
          "id": "g6kcrqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1601062222.0
        },
        {
          "id": "g6kt6u5",
          "author": "victoriousbbyg",
          "body": "This is a really inappropriate comment. We are here to be supportive. Everyone knows what people in the military do. Everyone knows the trauma and PTSD that it can result in.",
          "created_utc": 1601071296.0
        },
        {
          "id": "g6ku63e",
          "author": "sikkerhet",
          "body": "Ignoring the situation isn't going to improve it. Any act of violence can cause trauma to the victim and to the aggressor, and for someone with a desire to do violence, it's important to acknowledge it so they can work through this.",
          "created_utc": 1601071878.0
        }
      ]
    }
  ]
}