{
  "id": "j052c9",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1601122773.0,
  "title": "I'm finally referred to an eating disorder treatment center!",
  "selftext": "Has anyone been through video visits or otherwise with an ed clinic? What do they usually talk about? What kind of questions do they ask?",
  "url": "https://www.reddit.com/r/bulimia/comments/j052c9/im_finally_referred_to_an_eating_disorder/",
  "score": 80,
  "num_comments": 6,
  "comments": [
    {
      "id": "g6oc8bb",
      "author": "CrystalizedCage",
      "body": "They’re going to ask you a lot of questions. Make sure you’re honest about everything. There’s no reason to lie to these providers - they want to help you get stable. \n\nMedical questions, ED history, what symptoms you have, the severity of those symptoms, etc",
      "created_utc": 1601125562.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g6p8ydp",
      "author": "arcmat1",
      "body": "they will also ask you about what you think about as you binge/ purge. i know sometimes it gets blurry but if you can, try to recall it and take note of your triggers",
      "created_utc": 1601140838.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g6pb8n6",
      "author": "mangosparklingwater",
      "body": "we usually talk about therapy and eat our meals together and talk about it after. It’s rough but worth it \n\nSending love,\nXoxo",
      "created_utc": 1601142111.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g6pd9a4",
      "author": "JetPatriot",
      "body": "It is a lot about both food and emotional triggers and how to manage them.  Some is group therapy but I found that interesting only at the beginning.  Then it got repetitive and boring.",
      "created_utc": 1601143366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6q5ai2",
      "author": "yungchias33d",
      "body": "Feel free to PM me, I am in recovery after about 10 months of regular outpatient care and now remote since March :)",
      "created_utc": 1601154027.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6pe3vq",
      "author": "MarmaladePanda",
      "body": "I second this ⬆️ Be honest and up front with everything. They’ve heard it all - and when they have your full story, they can best match you with a therapist and which programs work best for you (additional substance abuse support, SI, family therapy options etc.). \nI wish you all the best on this part of your recovery journey - some days will be better than others and you are worth the effort! 🦁💛",
      "created_utc": 1601143883.0,
      "score": 8,
      "context": [
        {
          "id": "g6oc8bb",
          "author": "CrystalizedCage",
          "body": "They’re going to ask you a lot of questions. Make sure you’re honest about everything. There’s no reason to lie to these providers - they want to help you get stable. \n\nMedical questions, ED history, what symptoms you have, the severity of those symptoms, etc",
          "created_utc": 1601125562.0
        }
      ]
    }
  ]
}