{
  "id": "j09h11",
  "subreddit": "bulimia",
  "author": "thenextaisle",
  "created_utc": 1601139070.0,
  "title": "After suffering from bulimia for 15 years I am on day 3 ( of forever, hopefully ) of being b/p free",
  "selftext": "It is the weirdest feeling in the world, I literally woke up 3 days ago and had no urge to b/p. After 15 years of purging daily, sometimes multiple times a day, I woke up that day and just decided I don’t want to put my body through it anymore.\n\nIt isn’t that easy, trust me.  In between those 15 years I’ve been hospitalized, been to therapy, had my weight fluctuate by 30 pounds on either end of the scale, and plenty more rock bottoms. I’ve tried countless times to recover and quit but I was so deep into my bulimia it became a daily routine. It wasn’t about the food anymore but about the control I had to make myself throw up. \n\nI’ve always had issues with self imagine and self worth and the bulimia was just a hurricane to it. I was with the most toxic guy I have ever come across and it made my self worth that much worse. \n\nThese past months I did a lot of self reflecting and confiding in my close friends and it has helped me tremendously ( not about my ED). I now know my worth, set boundaries, see that I am worth recovery, that this eating disorder doesn’t define me or have to control me. I have a new outlook on life and a new drive. \n\nWhen I woke up that morning and decided to not b/p something else awoke within me. There was nothing traumatic or significant that happened the day before or even weeks before but I woke up with a desire to live again, to take control of my life back and not just scoot along until I die. \n\nThis is just a little rant and I hope everyone is doing well in their recovery!\n\n💞\n\nEdit: Thank you all for the kind words and upvotes. I never imagined my little rant would get so much attention. I wish everyone recovering or suffering from this all the best!  No one understand what we go through unless they’ve been there and I find this community to be nothing but amazing!",
  "url": "https://www.reddit.com/r/bulimia/comments/j09h11/after_suffering_from_bulimia_for_15_years_i_am_on/",
  "score": 132,
  "num_comments": 14,
  "comments": [
    {
      "id": "g6q1cpe",
      "author": "AlwaysNostalgia",
      "body": "Sometimes that really what it is, just a shift in our thinking.\n\nMajor props to you, like you said its not easy, but you're DOING it.\n\nKeep being awesome",
      "created_utc": 1601152745.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g6r2e0x",
      "author": "LischenVonEngels",
      "body": "You deserve every good thing in your life OP, I'm so proud of you.",
      "created_utc": 1601166246.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6rr515",
      "author": "None",
      "body": "Congratulations!! These posts are so inspiring, thank you for being you.",
      "created_utc": 1601175109.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6tn5uu",
      "author": "wingednova",
      "body": "Woah. This is inspiring. I wish you the best of luck op. I hope this is it, but please don’t beat yourself up if it isnt",
      "created_utc": 1601200372.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6uc6qf",
      "author": "Mental_Chip9096",
      "body": "You are incredible and what you're doing in nothing short of a miracle! Our stories are incredibly similar, and after 20+ years, I am now 6 months free of b/p. It was like that for me too.. just one day I didn't, and it turned into a string of days and those days became a month and then months! For me, it was about taking it day by day, sometimes meal by meal. I promise the urges become few and far between and much less intense. The way we built our life around b/p.. you just have to restructure it in a way. Like, for me, I would leave work and go right to stores to buy binge food (frankly, I would start to plan the binge a couple hours before in my head). It took a few weeks to make a conscious choice to go straight home. Eventually I'd just go home. Little things like that! You are doing it! If I can be of any support, or you want some resources, DM me. So so proud of you!",
      "created_utc": 1601210573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gnvfa44",
      "author": "Aggravating-Poem-943",
      "body": "woah this made me cry it gave me chills..so inspiring. I wish you nothing but the best of luck! i am new to this so ahhh kinda nervous. So i am recovering from an ED & BULIMIA. I was always obese growing up, family bashing me telling me to lose weight and that i would look more pretty and if i didn't lose weight no one would marry me.. btw im Arabian. i swear if ur not skinny ur ugly.. so toxic. so basically senior year HS i was 18 i started losing weight healthy i kept it from everyone yk doing my own thing and i started seeing results ahhh i was so happy so basically i lost 80 pounds in 9-10 months i was 120 i was so happy but still thought i was big..  people around me kept saying \"omg go eat you look dead\" \"go eat a burger\" \"you looked better before\" \"you lost beauty\" \"ur face is so skinny\" omg when they said this i just felt SO ANGRY i felt like the Hulk SMASH, these motherfuckers like WTH first yall wanna attack me for being obese now this. I WAS IN RAGEEEE, and these piss of shits kept saying in party's \"omg she looks like an old lady\" BOIII I THOUGHT I WAS GONNA LOSE IT THERE. After all the bashing, hearing those comments made about me i felt anger, rage it made me want to even go further. Thats when i met the devil bulimia it lasted 2 year. Everytime i woud eat it would go to the toliet even if it was healthy.. it was getting really bad it lasted for 2 years i was 18. Now im 20 & recovering!!! woohoo!!!! I haven't purged for months, proud of myself. What made me stop is teeth. I saw so many pics of peoples teeth after bulimia AND BOY I WAS SCARED. I WAS HAVING NIGHTMARES OF MY TEETH FALLING !! & then i realized purging is not worth it!! i rather have a beautiful smile. AND MY HAIR WAS FALLING, i was literally balding AND so that made me depressed so i had to get my life together I HIT ROCK BOTTOM. i just wanted to be happy and happy in my own body. F\\*CK everyone else i aint pleasing anyone THIS IS MY BODY NOT URS I CAN DO ANYTHING I WANT! My mindset has changed about food and everything. As soon as i stopped listening to those motherf\\*ckers were saying about me I CHANGED. I FEEL POWERFUL I TOOK CONTROL OVER MY LIFE. Now i have a good relationship with food. I eat high volume YUMMY foods & it keeps me FULL to the point were i don't even want to binge eat anymore. I learned to eat the foods i LOVEEE in moderation. I can finally say i am happy.. hehe lowkey crying typing this.. i just cant believe this is me ahhhhh i am shook i have come so far and i am so proud of myself. My hair has stopped falling its getting healthy, my skin ITS GLOWING FINALLYYY YAY!!!  I realized were human our body's will always change and thats okay!!  We have one shot at life and ONE BODY your body, lets take care of it, give it all the love it deserves & make it happy! I hope you are doing well! Recovery is worth it.  Stay safe! Love from NYC!",
      "created_utc": 1613644385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6q1uzv",
      "author": "thenextaisle",
      "body": "Thank you!\n\nI know there will be ups and downs in this road but it will all be worth it in the end. \n\nThere are still days where I tear myself apart but that’s when I call my friends and they somehow make it all better. \n\n💓",
      "created_utc": 1601152905.0,
      "score": 6,
      "context": [
        {
          "id": "g6q1cpe",
          "author": "AlwaysNostalgia",
          "body": "Sometimes that really what it is, just a shift in our thinking.\n\nMajor props to you, like you said its not easy, but you're DOING it.\n\nKeep being awesome",
          "created_utc": 1601152745.0
        }
      ]
    },
    {
      "id": "g6vaqrm",
      "author": "thenextaisle",
      "body": "Thank you!\n\nI have found that reading all the stories in this community and the support it offers has contributed to my recovery as well. I give nothing but positive vibes to anyone and everyone struggling with this nightmare!\n\n💖",
      "created_utc": 1601229280.0,
      "score": 2,
      "context": [
        {
          "id": "g6r2e0x",
          "author": "LischenVonEngels",
          "body": "You deserve every good thing in your life OP, I'm so proud of you.",
          "created_utc": 1601166246.0
        }
      ]
    },
    {
      "id": "g6vaxfj",
      "author": "thenextaisle",
      "body": "Thank you!",
      "created_utc": 1601229370.0,
      "score": 1,
      "context": [
        {
          "id": "g6rr515",
          "author": "None",
          "body": "Congratulations!! These posts are so inspiring, thank you for being you.",
          "created_utc": 1601175109.0
        }
      ]
    },
    {
      "id": "g6vb2hq",
      "author": "thenextaisle",
      "body": "Thank you!\n\nI know there will always be set backs and I now know what my triggers are and am working hard on facing them head on.",
      "created_utc": 1601229438.0,
      "score": 2,
      "context": [
        {
          "id": "g6tn5uu",
          "author": "wingednova",
          "body": "Woah. This is inspiring. I wish you the best of luck op. I hope this is it, but please don’t beat yourself up if it isnt",
          "created_utc": 1601200372.0
        }
      ]
    },
    {
      "id": "g6vbrud",
      "author": "thenextaisle",
      "body": "Thank you!\n\nWe are very similar!  I would plan my next days binge the night before when I would lay in bed. I got myself into LOTS of debt from everything that came from bulimia. Not to mention all the damage I’ve done to my body that I will probably have to pay for later on down the road but I will face those when the time comes. \n\nIt is absolutely true that it is taken one day at a time. Some days will be better than others but I have to keep reminding myself why I started. What have you found that works well for you during the early stages?  How do you deal with the bloating, chubby cheeks, dehydrating lips and exhaustion?",
      "created_utc": 1601229777.0,
      "score": 2,
      "context": [
        {
          "id": "g6uc6qf",
          "author": "Mental_Chip9096",
          "body": "You are incredible and what you're doing in nothing short of a miracle! Our stories are incredibly similar, and after 20+ years, I am now 6 months free of b/p. It was like that for me too.. just one day I didn't, and it turned into a string of days and those days became a month and then months! For me, it was about taking it day by day, sometimes meal by meal. I promise the urges become few and far between and much less intense. The way we built our life around b/p.. you just have to restructure it in a way. Like, for me, I would leave work and go right to stores to buy binge food (frankly, I would start to plan the binge a couple hours before in my head). It took a few weeks to make a conscious choice to go straight home. Eventually I'd just go home. Little things like that! You are doing it! If I can be of any support, or you want some resources, DM me. So so proud of you!",
          "created_utc": 1601210573.0
        }
      ]
    },
    {
      "id": "g6wnml4",
      "author": "Mental_Chip9096",
      "body": "Some things that worked for me, and still work: like you said, reminding myself of why I am breaking this destructive cycle! I'd \"play the tape\" in my head. Honestly after so long, we've kind of eaten everything, you know what I mean? Imagine doing it, imagine how sick I'd feel after, the violence and trauma of putting myself through all of it, the cleanup and the shame. Often that was enough to put me off of it.\n\nI'd buy little gifts for myself, just like fun little non food treats. Put aside money I'd have spent on binges and after a few days, then a week, buy myself something nice. \n\nI've also made a big effort to be kind and gentle to myself, and try to be more positive. Being in my eating disorder makes me so negative and self centered and my world is so small. And when I actually can look up and notice the beautiful, small things, and opportunities to help others in small ways, and the simple pleasures around me, I find I am a much happier and humbler person. \n\nI've also finally found the right combination of meds (Topamax, naltrexone, and effexor)  and specialized therapy (EMDR and IFS). \n\nI am sending you love, light, and hope. It will get easier, and what you are doing now is building a strong foundation for a beautiful recovery!",
      "created_utc": 1601253988.0,
      "score": 1,
      "context": [
        {
          "id": "g6uc6qf",
          "author": "Mental_Chip9096",
          "body": "You are incredible and what you're doing in nothing short of a miracle! Our stories are incredibly similar, and after 20+ years, I am now 6 months free of b/p. It was like that for me too.. just one day I didn't, and it turned into a string of days and those days became a month and then months! For me, it was about taking it day by day, sometimes meal by meal. I promise the urges become few and far between and much less intense. The way we built our life around b/p.. you just have to restructure it in a way. Like, for me, I would leave work and go right to stores to buy binge food (frankly, I would start to plan the binge a couple hours before in my head). It took a few weeks to make a conscious choice to go straight home. Eventually I'd just go home. Little things like that! You are doing it! If I can be of any support, or you want some resources, DM me. So so proud of you!",
          "created_utc": 1601210573.0
        },
        {
          "id": "g6vbrud",
          "author": "thenextaisle",
          "body": "Thank you!\n\nWe are very similar!  I would plan my next days binge the night before when I would lay in bed. I got myself into LOTS of debt from everything that came from bulimia. Not to mention all the damage I’ve done to my body that I will probably have to pay for later on down the road but I will face those when the time comes. \n\nIt is absolutely true that it is taken one day at a time. Some days will be better than others but I have to keep reminding myself why I started. What have you found that works well for you during the early stages?  How do you deal with the bloating, chubby cheeks, dehydrating lips and exhaustion?",
          "created_utc": 1601229777.0
        }
      ]
    },
    {
      "id": "g6x4uxx",
      "author": "thenextaisle",
      "body": "It’s almost as if we are he same person!  I’m 33 and lost all my critical years where you build life long friendships ( college ) isolating myself to hide my ED. I have a few very close friends but at this age they are all either married and have kids or have a partner and I’m single. \n\nI tried “getting out there” and online dating but it never really worked out. Now have to find a way to make friends in my 30s who have the same interest as me and available to hang out, after SIP of course. \n\nI am learning to appreciate the little things in life and find the beauty in everything. I have recently been diagnosed with mild depression and ADHD so it just adds to the tornado. I am looking forward to my recovery and become the person I was again before my ED. I remember her being empathetic, kind and gentle, and this ED has made me become the exact opposite. \n\nThank you for your replies, it’s truly appreciated!",
      "created_utc": 1601264010.0,
      "score": 2,
      "context": [
        {
          "id": "g6uc6qf",
          "author": "Mental_Chip9096",
          "body": "You are incredible and what you're doing in nothing short of a miracle! Our stories are incredibly similar, and after 20+ years, I am now 6 months free of b/p. It was like that for me too.. just one day I didn't, and it turned into a string of days and those days became a month and then months! For me, it was about taking it day by day, sometimes meal by meal. I promise the urges become few and far between and much less intense. The way we built our life around b/p.. you just have to restructure it in a way. Like, for me, I would leave work and go right to stores to buy binge food (frankly, I would start to plan the binge a couple hours before in my head). It took a few weeks to make a conscious choice to go straight home. Eventually I'd just go home. Little things like that! You are doing it! If I can be of any support, or you want some resources, DM me. So so proud of you!",
          "created_utc": 1601210573.0
        },
        {
          "id": "g6vbrud",
          "author": "thenextaisle",
          "body": "Thank you!\n\nWe are very similar!  I would plan my next days binge the night before when I would lay in bed. I got myself into LOTS of debt from everything that came from bulimia. Not to mention all the damage I’ve done to my body that I will probably have to pay for later on down the road but I will face those when the time comes. \n\nIt is absolutely true that it is taken one day at a time. Some days will be better than others but I have to keep reminding myself why I started. What have you found that works well for you during the early stages?  How do you deal with the bloating, chubby cheeks, dehydrating lips and exhaustion?",
          "created_utc": 1601229777.0
        },
        {
          "id": "g6wnml4",
          "author": "Mental_Chip9096",
          "body": "Some things that worked for me, and still work: like you said, reminding myself of why I am breaking this destructive cycle! I'd \"play the tape\" in my head. Honestly after so long, we've kind of eaten everything, you know what I mean? Imagine doing it, imagine how sick I'd feel after, the violence and trauma of putting myself through all of it, the cleanup and the shame. Often that was enough to put me off of it.\n\nI'd buy little gifts for myself, just like fun little non food treats. Put aside money I'd have spent on binges and after a few days, then a week, buy myself something nice. \n\nI've also made a big effort to be kind and gentle to myself, and try to be more positive. Being in my eating disorder makes me so negative and self centered and my world is so small. And when I actually can look up and notice the beautiful, small things, and opportunities to help others in small ways, and the simple pleasures around me, I find I am a much happier and humbler person. \n\nI've also finally found the right combination of meds (Topamax, naltrexone, and effexor)  and specialized therapy (EMDR and IFS). \n\nI am sending you love, light, and hope. It will get easier, and what you are doing now is building a strong foundation for a beautiful recovery!",
          "created_utc": 1601253988.0
        }
      ]
    },
    {
      "id": "g6yevgu",
      "author": "Mental_Chip9096",
      "body": "I believe you are still empathetic, kind and gentle. ED tries to smother your true self, but I can tell that you are now shining through once again. These qualities, your true self, will only attract similar people to you. Now that your world is becoming larger than just you and ED you have the space and time for friends and other people.\n\nThe mood disorder/depression stuff is so chicken and egg, at least for me. Or rather, probably it came first, but using behaviors substantially worsened preexisting mood issues. I hope that you'll find, like me, once you're not b/p all day every day that your mood begins to stabilize quite a bit. It's not sunshine and rainbows all the time, but it's not constant misery and torture. Truly my bulimia was a trauma in itself. \n\nI hope you have a day full of self care, love and kindness. 💜",
      "created_utc": 1601304263.0,
      "score": 1,
      "context": [
        {
          "id": "g6uc6qf",
          "author": "Mental_Chip9096",
          "body": "You are incredible and what you're doing in nothing short of a miracle! Our stories are incredibly similar, and after 20+ years, I am now 6 months free of b/p. It was like that for me too.. just one day I didn't, and it turned into a string of days and those days became a month and then months! For me, it was about taking it day by day, sometimes meal by meal. I promise the urges become few and far between and much less intense. The way we built our life around b/p.. you just have to restructure it in a way. Like, for me, I would leave work and go right to stores to buy binge food (frankly, I would start to plan the binge a couple hours before in my head). It took a few weeks to make a conscious choice to go straight home. Eventually I'd just go home. Little things like that! You are doing it! If I can be of any support, or you want some resources, DM me. So so proud of you!",
          "created_utc": 1601210573.0
        },
        {
          "id": "g6vbrud",
          "author": "thenextaisle",
          "body": "Thank you!\n\nWe are very similar!  I would plan my next days binge the night before when I would lay in bed. I got myself into LOTS of debt from everything that came from bulimia. Not to mention all the damage I’ve done to my body that I will probably have to pay for later on down the road but I will face those when the time comes. \n\nIt is absolutely true that it is taken one day at a time. Some days will be better than others but I have to keep reminding myself why I started. What have you found that works well for you during the early stages?  How do you deal with the bloating, chubby cheeks, dehydrating lips and exhaustion?",
          "created_utc": 1601229777.0
        },
        {
          "id": "g6wnml4",
          "author": "Mental_Chip9096",
          "body": "Some things that worked for me, and still work: like you said, reminding myself of why I am breaking this destructive cycle! I'd \"play the tape\" in my head. Honestly after so long, we've kind of eaten everything, you know what I mean? Imagine doing it, imagine how sick I'd feel after, the violence and trauma of putting myself through all of it, the cleanup and the shame. Often that was enough to put me off of it.\n\nI'd buy little gifts for myself, just like fun little non food treats. Put aside money I'd have spent on binges and after a few days, then a week, buy myself something nice. \n\nI've also made a big effort to be kind and gentle to myself, and try to be more positive. Being in my eating disorder makes me so negative and self centered and my world is so small. And when I actually can look up and notice the beautiful, small things, and opportunities to help others in small ways, and the simple pleasures around me, I find I am a much happier and humbler person. \n\nI've also finally found the right combination of meds (Topamax, naltrexone, and effexor)  and specialized therapy (EMDR and IFS). \n\nI am sending you love, light, and hope. It will get easier, and what you are doing now is building a strong foundation for a beautiful recovery!",
          "created_utc": 1601253988.0
        },
        {
          "id": "g6x4uxx",
          "author": "thenextaisle",
          "body": "It’s almost as if we are he same person!  I’m 33 and lost all my critical years where you build life long friendships ( college ) isolating myself to hide my ED. I have a few very close friends but at this age they are all either married and have kids or have a partner and I’m single. \n\nI tried “getting out there” and online dating but it never really worked out. Now have to find a way to make friends in my 30s who have the same interest as me and available to hang out, after SIP of course. \n\nI am learning to appreciate the little things in life and find the beauty in everything. I have recently been diagnosed with mild depression and ADHD so it just adds to the tornado. I am looking forward to my recovery and become the person I was again before my ED. I remember her being empathetic, kind and gentle, and this ED has made me become the exact opposite. \n\nThank you for your replies, it’s truly appreciated!",
          "created_utc": 1601264010.0
        }
      ]
    }
  ]
}