{
  "id": "j1wd2w",
  "subreddit": "bulimia",
  "author": "_bizong",
  "created_utc": 1601373674.0,
  "title": "Successful man with bulimia",
  "selftext": "Freddie Flintoff admitted he has bulimia (BBC, you can look). I think it's a big deal as he is a man, in addition a successful man. I hope this helps to wipe away the stigma about EDs being just women's thing.",
  "url": "https://www.reddit.com/r/bulimia/comments/j1wd2w/successful_man_with_bulimia/",
  "score": 139,
  "num_comments": 8,
  "comments": [
    {
      "id": "g728728",
      "author": "None",
      "body": "I’m shocked at how jarring it was to read this. I just realized I’ve never seen a middle aged man speak openly about their battle with bulimia. \n\nI hope this sparks a wave and the men in the shadows finally feel safe enough to get some help.",
      "created_utc": 1601388947.0,
      "score": 44,
      "context": []
    },
    {
      "id": "g729fhi",
      "author": "Sallycinn",
      "body": "When the advert came on for this I was super shocked, it just shows that you can't ever tell. My dad and brother play cricket and are big fans of him so it gives me a bit of hope that they'll be able to see how easy it is to be affected. I'm both sad and pleased that he's coming forward about it though, he's been a bit of a familiar face on TV the last few years so it's cool that he's using it for something important.",
      "created_utc": 1601389486.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g739vql",
      "author": "MarmaladePanda",
      "body": "[link to a story about it](https://www.google.com/amp/s/www.bbc.com/sport/amp/cricket/54281217)",
      "created_utc": 1601404705.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g73a0on",
      "author": "wingednova",
      "body": "My god, my heart is breaking. Put yourself through this everyday and you never, ever want to see somebody else do it. I feel wrong, somehow",
      "created_utc": 1601404772.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g73x1gm",
      "author": "toninsronin",
      "body": "I cried so much after watching the documentary. Even though he’s a middle aged man and I’m a female in my 20s it felt like he was such a similar person to me. I felt so understood. Especially the part about him being super reluctant to admit he had an ed and get treatment and recover. I am constantly in 2 minds about these things. I hope the documentary inspires people to seek help and talk to someone about their eating disorders.",
      "created_utc": 1601415145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g73bc16",
      "author": "SymptomOfTheStorm",
      "body": "Wow this is monumental",
      "created_utc": 1601405413.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g74eqxb",
      "author": "JetPatriot",
      "body": "There are many in sports.  It is just that no one talks about it.",
      "created_utc": 1601425004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g75757u",
      "author": "skymningwolf",
      "body": "I feel like because society expects men not to show as much emotion/sensitivity, male ED patients are often overlooked. My best friend has been struggling with bulimia for nearly a decade of his life now.  :(",
      "created_utc": 1601441456.0,
      "score": 1,
      "context": []
    }
  ]
}