{
  "id": "j6nlfb",
  "subreddit": "bulimia",
  "author": "Stimte061",
  "created_utc": 1602061547.0,
  "title": "Guys I'm crying and it's your fault",
  "selftext": "I'm 30 and honest to fuck, I'm finally, for the first time in my life, eating consistently and really genuinely happy with my body and my confidence.\n\nI don't have a magic formula or anything and I know some days I'm going to feel like I'm going backwards again but I read a lot of the posts on here and just knowing that I wasn't alone helped more then you guys will ever know. \nSo thank you, from the bottom of my heart, thank you for your honesty and if any of you are ever struggling, you go right the fuck ahead and message me and I'll be there.\n\nWe have fucking got this xx",
  "url": "https://www.reddit.com/r/bulimia/comments/j6nlfb/guys_im_crying_and_its_your_fault/",
  "score": 165,
  "num_comments": 12,
  "comments": [
    {
      "id": "g7zoys7",
      "author": "staystrongyerim",
      "body": "Omg, I saw the title and I was scared, so I'm glad to hear you're doing okay. You have got this, and I'm so proud of you. Stay strong 💙",
      "created_utc": 1602068623.0,
      "score": 33,
      "context": []
    },
    {
      "id": "g80alao",
      "author": "lunar-academy",
      "body": "Ahh yay I’m so happy for you dude!!! I believe in this community y’all are so sweet✨✨✨✨💕💕",
      "created_utc": 1602082648.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g7zr40m",
      "author": "CaterpillarTears",
      "body": "I'm glad you're doing much better!Stay strong 💜",
      "created_utc": 1602070666.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g80ndtj",
      "author": "thinkaarushi",
      "body": "you got this okayyy you're doing so well I'm so proud of you!!",
      "created_utc": 1602089011.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g80t7gm",
      "author": "Coalford",
      "body": "I'm so proud of you!\n\nAnd everyone reading this wondering why they can't do it.\n\nYou can. It just might take some time, but eventually you will get here too.",
      "created_utc": 1602091855.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g80o32p",
      "author": "None",
      "body": "Awww that is so awesome I’m so proud of you!!",
      "created_utc": 1602089349.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g80vocs",
      "author": "None",
      "body": "I'm so so happy for you and proud of you!!! We \\*all\\* deserve to feel better, and it warms my heart so much when someone from this sub posts like this. <3",
      "created_utc": 1602093050.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g80xl21",
      "author": "Lumplebee",
      "body": "Congrats!! All of the recent recovery posts on here are so damn motivating, I love all of you guys so much, we’ve got such a great community here💜✨💐",
      "created_utc": 1602093968.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g816fsz",
      "author": "SativaSunChild",
      "body": "I’m so so so happy for you ❤️ I’m finally finding happiness after years of ED as well. Isn’t this new feeling just so fucking amazing? I feel like we have been given a second chance. We gave ourselves this second chance! Yay for you! You are so strong! You put in so much work to get where you are! We got this! Message me if you need anything ❤️",
      "created_utc": 1602098223.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g81izyl",
      "author": "lyar22",
      "body": "I'm really happy for you. This community is full of kind people, I'm glad we found it. :)",
      "created_utc": 1602104410.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81l6mb",
      "author": "LischenVonEngels",
      "body": "That's incredible, I'm so proud of you! You will never be alone OP, we're right here for you.",
      "created_utc": 1602105524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81z8ui",
      "author": "schnooter",
      "body": "I love this! And I feel the same way, this subreddit is (most of the time) such a source of positivity and support I love it. \n\nAlso, like OP said, feel free to message me as well, i’m here \n\n💙",
      "created_utc": 1602112956.0,
      "score": 3,
      "context": []
    }
  ]
}