{
  "id": "j800b8",
  "subreddit": "bulimia",
  "author": "bitchwhorehannah",
  "created_utc": 1602253913.0,
  "title": "does anyone else plan their b/p",
  "selftext": "like i’ve had my binge logged and planned in myfitnesspal since monday, my parents are leaving the house for a few hours and i’ve been thinking about it and planning out all week. like i’m getting so excited for something that makes me absolutely miserable? \n\n\ni’ve got 2 donuts, a box of frosted flakes, a pint of ice cream, and a cupcake i’ve been saving just for this. you’d think i’d want to enjoy it at once and sleep happy with my treats in my tummy but i’m getting so excited at the prospect of eating it all and throwing up. idk if i’m making sense, it’s all i can think about, it’s all i’ve been thinking about. every time my parents say they’re going out for the night i get so excited to do this and for what. i’m not happy after. i feel like shit after. why am i like this",
  "url": "https://www.reddit.com/r/bulimia/comments/j800b8/does_anyone_else_plan_their_bp/",
  "score": 111,
  "num_comments": 17,
  "comments": [
    {
      "id": "g882mpa",
      "author": "Ambystomatigrinum",
      "body": "I obviously can't speak for me, but for me I know its about control. I've relapsed recently due to stress and feeling like I don't have control in other areas of my life, and that's always a trigger. Does that ring true for you at all?",
      "created_utc": 1602256954.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g88599v",
      "author": "Japanese_blossom",
      "body": "Yeah... I definitely plan my b/p... not necessarily what to eat (I kinda decide that at the moment), but what is the window of time that will allow me to get everything out of my system. If you did included you all these food on you fitnesspal... I’m assuming you somewhere within your daily caloric range (or close) Bc... I don’t know why you would log all the calories you eating... \ni totally agree... I have gotten excited over b/ps I have planned but also miserable afterwards. I’m really trying to recover rn, so I no longer plan... but it was definetly my thing in the beginning.",
      "created_utc": 1602258279.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g88kqly",
      "author": "cecedreaming",
      "body": "Definitely if I know my parents will be away i start planning the binge. Bingeing in an empty house is just a dream. I write down all the foods I want on my phone. And Google recipes.\n\nSometimes I plan a night away to myself in a hotel just so I can binge. I've never done it before because it's always been a 'when I reach xx lbs' reward which I never reach.\n\nI literally dream about bingeing. I tell myself I don't have to purge if it's a planned binge. But I always purge it anyway because I can't deal with digesting all that food. I feel like shit after too. I hate purging but it's better than the guilt. It's a cycle for sure",
      "created_utc": 1602266144.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g889bno",
      "author": "bunni_bear_boom",
      "body": "I dont always but I have definitely done this before",
      "created_utc": 1602260309.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g885g7j",
      "author": "None",
      "body": "I plan all my purges. Like \"I'm given this, I will eat this because it's safe. If I'm given that, I will purge\"",
      "created_utc": 1602258375.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g88fot9",
      "author": "CaterpillarTears",
      "body": "Well kinda. I almost always b/p when I go grocery shopping. And sometimes at work I plan my session. Not specifically what food unless I crave something",
      "created_utc": 1602263497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g89frt8",
      "author": "itsdani3lla",
      "body": "I do occasionally. When I’m home from university I purge sometimes and a lot of those times are when my parents unexpectedly buy fast food or when my mom makes a big meal and I don’t wanna ‘reveal’ my relapse or make her feel bad, especially since she makes the vegetarian version for me.",
      "created_utc": 1602283357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g89mo87",
      "author": "itsokayryujin",
      "body": "I honestly can’t relate more. I get so excited and then I feel so fucking awful after and I feel so much shame and distress. I wish I wasn’t like this",
      "created_utc": 1602287531.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g89n6bd",
      "author": "None",
      "body": "yes, i do. I already planned to b/p chinese take out tomorrow. It's more of an addiction for me tbh.",
      "created_utc": 1602287846.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g89ydp3",
      "author": "draoikat",
      "body": "Oh yes, almost always. My original diagnosis about 20 years ago was anorexia (b/p) and I'm currently bulimic, and about 95% of my binges in all those years have been planned. Might tie in with OCD for me (which I've had all my life) since it's extremely ritualistic.",
      "created_utc": 1602294774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8aw26o",
      "author": "Kdukkdukkduk",
      "body": "The Romans planned their group binges to extraordinary detail...\n“The Roman banquet evokes voluptuary images of men in togas reclining on couches and glutting themselves on wild sow's udders and stuffed snails, while servants stream in bearing platters heaped with heavily sauced and delicately spiced foods from all over the world: ostrich from Africa, pepper and sugar cane from India, cumin from Ethiopia, sumac from Syria, olives from Greece, and that perennial Roman favorite, the fleshy homegrown fig. Wine is drunk in copious amounts from double-handled silver cups, while a lyre plays in the background. There are performing troupes, poets, even the occasional leopard, and sometimes rose petals flutter down from on high. One sadistic host, the Emperor Elagabalus, built a banquet hall with a false ceiling that tilted open, allowing a torrent of flowers to rain down upon his unsuspecting guests, smothering to death those unable to crawl out from under the floral deluge.” \n\nhttps://www.npr.org/sections/thesalt/2019/05/20/712772285/the-lavish-roman-banquet-a-calculated-display-of-debauchery-and-power?t=1602323165573",
      "created_utc": 1602323311.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g89l9x6",
      "author": "morbid_laughter",
      "body": "Yes. It was routine for me at one point in my life to \"schedule\" it. It makes me sad to think about how I used to hoard food for the big sha-bang and how out-of-the-way it was giving up so much time and effort in to something that was so terrible. It was so hard to get out of a constant thing like that. I use to feel the same feelings you're describing. I'm so sorry for the misery this brings. Hope things get easier for you OP.",
      "created_utc": 1602286676.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g89ozsr",
      "author": "None",
      "body": "I used to when I lived with other people. What and when I ate would depend on how long the other person was supposed to be gone.",
      "created_utc": 1602288980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8adw4n",
      "author": "wingednova",
      "body": "You log binges?! Omg. Even though you purge?",
      "created_utc": 1602305088.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g88hnv3",
      "author": "bitchwhorehannah",
      "body": "well i know i can’t purge out ALL the calories so i make sure to keep it under 1200 cals so i don’t gain from it",
      "created_utc": 1602264540.0,
      "score": 4,
      "context": [
        {
          "id": "g88599v",
          "author": "Japanese_blossom",
          "body": "Yeah... I definitely plan my b/p... not necessarily what to eat (I kinda decide that at the moment), but what is the window of time that will allow me to get everything out of my system. If you did included you all these food on you fitnesspal... I’m assuming you somewhere within your daily caloric range (or close) Bc... I don’t know why you would log all the calories you eating... \ni totally agree... I have gotten excited over b/ps I have planned but also miserable afterwards. I’m really trying to recover rn, so I no longer plan... but it was definetly my thing in the beginning.",
          "created_utc": 1602258279.0
        }
      ]
    },
    {
      "id": "g8l9925",
      "author": "bitchwhorehannah",
      "body": "i take off half the calories usually, depends on my mood. sometimes if i go out of control and eat stuff i didn’t plan then i leave it all logged as “punishment” 😫🙄",
      "created_utc": 1602510372.0,
      "score": 2,
      "context": [
        {
          "id": "g8adw4n",
          "author": "wingednova",
          "body": "You log binges?! Omg. Even though you purge?",
          "created_utc": 1602305088.0
        }
      ]
    }
  ]
}