{
  "id": "jee8or",
  "subreddit": "bulimia",
  "author": "OctopuBanana",
  "created_utc": 1603152352.0,
  "title": "This would have been day 60. Tomorrow is day 1.",
  "selftext": "This story might be triggering. \nSo I binged today. It started off as trying to treat myself. In order to get better I need to stop fearing food and be able to enjoy things without feeling guilty. It started with fries and mayo. My roommates ordered takeout so I thought this would be a good time to jump in and challenge myself. Then I went for a pudding. I was already feeling full but then I had a pancake with chocolate spread. Then ice cream. Then I went into my room with a grilled cheese and it spiraled out of control from there. Having all of those things in itself sounds like a lot but for a healthy person that's fine. I don't eat like this every day after all. I tried to calm myself and kept telling myself 'this is fine. I can eat whatever I want. This food deserves to stay in my body - I deserve to have this food'. But even before I went upstairs, I started to feel this imense guilt. When I was alone and I knew my roommates would be staying downstairs for a few more hours, watching TV, I ran to the toilet without thinking. Just because I knew no one would hear me. There was no rationality there. It just happened. In these moments, I don't think. Straight after purging, I had more food. Multiple bags of chips, chocolate bars, cake, anything I could find either in my room or downstairs. I wasn't even looking at what I was picking up from our kitchen. I ate whatever. When I purged again, I felt so horrible afterwards. I have this awful headache that always comes with purging. Halfway through, I started having really bad stomach cramps. When I was done, my nose started bleeding. I don't know if the pressure made me pop a vessle or why that happened but it sure scared me. This scares me. Being out of control again scares me. But I have to be gentle to myself and stop blaming. Guilt tripping myself has never gotten me anywhere. I have to remember that. \nSo after nearly 60 days of being binge free, I binged again. I did well. This is a new record. \n\nTomorrow is day 1. \nTime to set a new record.",
  "url": "https://www.reddit.com/r/bulimia/comments/jee8or/this_would_have_been_day_60_tomorrow_is_day_1/",
  "score": 107,
  "num_comments": 17,
  "comments": [
    {
      "id": "g9dusws",
      "author": "lonellyrabbit",
      "body": "You can do this, i believe in you. Remember that out of 61 days you stayed 60 days b/p free, which is a great job. ❤️",
      "created_utc": 1603153061.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g9e4exq",
      "author": "ineedhelpplz101",
      "body": "Today just an hour ago I was at two weeks and now I'm back at nothing. \nWe can do this. Starting together.",
      "created_utc": 1603158535.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g9etosp",
      "author": "None",
      "body": "This is where I am today too. Trying really hard to not purge after the binge. I'll repeat as you said, \"This food deserves to stay in my body.\" But it's getting really hard to resist the urge to get rid of all of it. I hope we grow stronger enough soon and gain back the control.",
      "created_utc": 1603177192.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g9f2f7a",
      "author": "None",
      "body": "Damn long time. In those 59 days your brain has been busy creating new neural pathways based on  your. healthy, productive behaviors. Even though you binged and purged you used positive self talk, you tried to rationalize with yourself, you tried to do everything in your power before purging. Thats an achievement in and of itself. And to hell with all this back to square 1 bullshit. Recovery is moment by moment. Please show yourself compassion and patience. This was not a step backwards this was part of the process. You've got this and you've proved that",
      "created_utc": 1603186948.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g9jkalp",
      "author": "LilBabyBekka",
      "body": "Don’t be ashamed!!! Shane is the whole reason we are in this cycle! Recovery is a process ... and it’s not a cold turkey situation! To expect yourself to be able to cut something completely and fully forever is the exact kind of perfectionism and harsh expectations that perpetuates bulemic tendencies! But what you can say is that you are proud of yourself - once in two months is much better off then you were before and that’s improvement! You should be proud of yourself because a lot of other bulemic a (myself) can’t even go a month - but for me once a month is a victory because everyday is a battle! Practice compassion to break the cycle ! Don’t freak out or put pressure on yourself . Bulemia recover may involve you gaining a few pounds after a binge - but that is life we move on and recover :) I’m 2 year’s into my recovery and have been bulemic for 12 years. Trust me you’re doing great !",
      "created_utc": 1603290238.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9f9gbx",
      "author": "None",
      "body": "I feel for you.",
      "created_utc": 1603194100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9f9wo3",
      "author": "ZiggyelectroidXO",
      "body": "Starting together today... We can do this. We have to do this. We need this. I need this baby. I want this baby.",
      "created_utc": 1603194479.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9fjlpt",
      "author": "tarynjo2",
      "body": "Even being close to 60 days is an amazing accomplishment that many won’t understand. It’s going to be hard to forgive yourself for this bump in the road, but recovery is not and never has been a linear road anyway. It’s going to happen, it’s going to be alright, and I’m right here with you in this. \nAnd don’t punish yourself for this please. Keep respecting your mind and body, you deserve it!💕",
      "created_utc": 1603201146.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9g3m4q",
      "author": "cici3917",
      "body": "59 days is AMAZING and one bad day does not erase that. I know for me it helps to challenge the “all or nothing” mindset as it really is a huge part of bulimia. I think you just overwhelmed yourself. Don’t beat yourself up! You were literally in the perfect situation for a slip up.  Keep moving forward. Write down how you felt afterwards so you can reflect when the urges hit. Stay safe and well! 💕",
      "created_utc": 1603211441.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9g5ru0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1603212472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9vx8pm",
      "author": "gemmag74",
      "body": "One really helpful thing a nutritionist said to me once is that the destructive behaviour is not the binge, but the purge. I'm in recovery too and there are still days where I feel my eating is out of control and I feel so discusting and sick after eating a huge amount of food, but if I don't purge, I still get the stamp for the day. 1 slip up in 60 days is not going to do anything to your body and if you keep it down, your brain learns that being this full is not a nice feeling. Learn from this in a gentle way and understand that it's all part of recovery.",
      "created_utc": 1603533498.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9gi64g",
      "author": "cheshlz",
      "body": "Two weeks is so good that's a lot more than nothing",
      "created_utc": 1603218492.0,
      "score": 2,
      "context": [
        {
          "id": "g9e4exq",
          "author": "ineedhelpplz101",
          "body": "Today just an hour ago I was at two weeks and now I'm back at nothing. \nWe can do this. Starting together.",
          "created_utc": 1603158535.0
        }
      ]
    },
    {
      "id": "g9olg86",
      "author": "OctopuBanana",
      "body": "I honestly think that this sentence is so important. It has helped me many times. I think that of course we deserve respect. We, our bodies, minds, all of it. And we deserve to respect ourselfes. But the food also deserves respect. It was made to be eaten, it deserves to be eaten and digested completely; properly. We deserve the nutrition and the food deserves to fullfill its persose. You can do it and if you don't, don't beat yourself up. Better is a direction, not a place. That's also a sentence I love.",
      "created_utc": 1603396768.0,
      "score": 1,
      "context": [
        {
          "id": "g9etosp",
          "author": "None",
          "body": "This is where I am today too. Trying really hard to not purge after the binge. I'll repeat as you said, \"This food deserves to stay in my body.\" But it's getting really hard to resist the urge to get rid of all of it. I hope we grow stronger enough soon and gain back the control.",
          "created_utc": 1603177192.0
        }
      ]
    },
    {
      "id": "g9om57o",
      "author": "OctopuBanana",
      "body": "Thank you so much for your kind words. Yes, I totally agree, you are not back to aquare 1 just because you purged once. It's the effort and development that counts. Better is not a place, it's a direction.",
      "created_utc": 1603397050.0,
      "score": 1,
      "context": [
        {
          "id": "g9f2f7a",
          "author": "None",
          "body": "Damn long time. In those 59 days your brain has been busy creating new neural pathways based on  your. healthy, productive behaviors. Even though you binged and purged you used positive self talk, you tried to rationalize with yourself, you tried to do everything in your power before purging. Thats an achievement in and of itself. And to hell with all this back to square 1 bullshit. Recovery is moment by moment. Please show yourself compassion and patience. This was not a step backwards this was part of the process. You've got this and you've proved that",
          "created_utc": 1603186948.0
        }
      ]
    },
    {
      "id": "g9onekn",
      "author": "OctopuBanana",
      "body": "Exactly! Every day is a battle, that's exactly why we should always be proud of ourseves after even a day of success! Thank you so much for your kind words.",
      "created_utc": 1603397577.0,
      "score": 1,
      "context": [
        {
          "id": "g9jkalp",
          "author": "LilBabyBekka",
          "body": "Don’t be ashamed!!! Shane is the whole reason we are in this cycle! Recovery is a process ... and it’s not a cold turkey situation! To expect yourself to be able to cut something completely and fully forever is the exact kind of perfectionism and harsh expectations that perpetuates bulemic tendencies! But what you can say is that you are proud of yourself - once in two months is much better off then you were before and that’s improvement! You should be proud of yourself because a lot of other bulemic a (myself) can’t even go a month - but for me once a month is a victory because everyday is a battle! Practice compassion to break the cycle ! Don’t freak out or put pressure on yourself . Bulemia recover may involve you gaining a few pounds after a binge - but that is life we move on and recover :) I’m 2 year’s into my recovery and have been bulemic for 12 years. Trust me you’re doing great !",
          "created_utc": 1603290238.0
        }
      ]
    },
    {
      "id": "g9omlvi",
      "author": "OctopuBanana",
      "body": "Yes! This is about respecting your body! We can do this together, let's stay strong.",
      "created_utc": 1603397242.0,
      "score": 2,
      "context": [
        {
          "id": "g9fjlpt",
          "author": "tarynjo2",
          "body": "Even being close to 60 days is an amazing accomplishment that many won’t understand. It’s going to be hard to forgive yourself for this bump in the road, but recovery is not and never has been a linear road anyway. It’s going to happen, it’s going to be alright, and I’m right here with you in this. \nAnd don’t punish yourself for this please. Keep respecting your mind and body, you deserve it!💕",
          "created_utc": 1603201146.0
        }
      ]
    },
    {
      "id": "g9omt1g",
      "author": "OctopuBanana",
      "body": "Writing it down is a really good idea, I'll do that next time. This is my documentation for not.",
      "created_utc": 1603397322.0,
      "score": 2,
      "context": [
        {
          "id": "g9g3m4q",
          "author": "cici3917",
          "body": "59 days is AMAZING and one bad day does not erase that. I know for me it helps to challenge the “all or nothing” mindset as it really is a huge part of bulimia. I think you just overwhelmed yourself. Don’t beat yourself up! You were literally in the perfect situation for a slip up.  Keep moving forward. Write down how you felt afterwards so you can reflect when the urges hit. Stay safe and well! 💕",
          "created_utc": 1603211441.0
        }
      ]
    },
    {
      "id": "g9on0j3",
      "author": "OctopuBanana",
      "body": "Thank you so much! I'll look out for that.",
      "created_utc": 1603397407.0,
      "score": 2,
      "context": [
        {
          "id": "g9g5ru0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603212472.0
        }
      ]
    }
  ]
}