{
  "id": "jikpy2",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1603738748.0,
  "title": "I should be happy that I haven't puked for 15 days, but..",
  "selftext": "I feel terrible. I feel so sad, ugly, fat and worthless.\nMaybe my bulimia is getting better, but my depression and anxiety are getting worse, because I overeat and without puking, I am gaining weight, and now I look ever uglier. I already sucked, now I am just awful and I cant snap out of this mood. Since I stopped puking, I don't go out, i don't take care of my self, I don't even shower. I spend my time in bed waiting for the day to end. And eating, obviously. It's my only source of joy considering I am lonely as hell. I want to die.",
  "url": "https://www.reddit.com/r/bulimia/comments/jikpy2/i_should_be_happy_that_i_havent_puked_for_15_days/",
  "score": 69,
  "num_comments": 7,
  "comments": [
    {
      "id": "ga7hrlu",
      "author": "Drichthy",
      "body": "Eating disorders and other things sometimes work out a dynamic, and it may be difficult to pinpoint exactly what came first, but if something gets better, often something else will get worse. It’s like some shitty live action wack-a-mole. There are things that I become acutely aware of when I’m binging but not purging, like how puffy my face feels and how distended my stomach is. It’s hard to rationalize that it’s just part of standard bloating procedure with binges or overeating, and not a lot of weight gain, and that makes everything feel more shitty. I don’t know if my anecdotes can be of any help, but, since you do not feel happy for going 15 days without purging, just for now I will feel proud and happy on your behalf.",
      "created_utc": 1603747308.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ga8daw1",
      "author": "None",
      "body": "Sometimes, forcing ourselves to get up and make the right choices is the only way to get ourselves out of the rut. Decide a day when you determine that this is the end of it, it won’t be the absolute end because it doesn’t work like that, but you’ll make progress. Go for a walk, or talk to a friend. Actively make good choices and distract yourself, imo the best distraction is working for that feeling of accomplishment, be it through whatever- making a craft, cooking something good, or holding out till the end of the workout.  You’re strong and I believe in you!",
      "created_utc": 1603764306.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ga877f8",
      "author": "mmg1996",
      "body": "You already overcame the hard part which is stopping, stop giving bulimia the power to make you feel bad, she's nothing without you. \nYou are beautiful, capable and strong. \nI believe in you, you are almost there \nRecovery is hard but worth it \nI'm always here if you want to talk.\nSending you all good vibes and keeping you in my thoughts.",
      "created_utc": 1603761091.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ga8v9dq",
      "author": "graamatvede",
      "body": "Taking showers was a huge one for me. But you gotta force yourself to do it - if not out of love, then out of respect and responsibility towards your body. A tip may be try to find out if you prefer showering in the mornings, during the day or in the evenings before bed, that can make a big difference. Your body deserves respect, regardless how you feel about it.",
      "created_utc": 1603775842.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga9047r",
      "author": "itsokayryujin",
      "body": "I am sorry. I completely relate to this. But the truth is that once you build a healthy relationship to food, you’ll stop emotionally eating and overeating and lose that excess weight. Right now you’ve only stopped half of the bulimia, the puking, but the other half is the binging and compulsive eating. It’s a process but you need to accept that eventually it will succeed and you’ll be able to be ate a healthy weight and maintain it. Just remember that the way you’re feeling right now is TEMPORARY! Feel free to reach out to me ❤️",
      "created_utc": 1603780377.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga8crv0",
      "author": "edricstormborn929",
      "body": "Im so sorry and Im sure this wont help but you truly are beautiful... Truly Beautiful... I hope you someday see in the mirror how I see you. ❤",
      "created_utc": 1603764025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gc3ozrd",
      "author": "None",
      "body": "so a friend of mine has had  an eating disorder since like 15... fast-forward to 30yoa and she cant even work because her muscles are actively dying off her bones.... she is a wreck. she cant work. she cant go out. she's just nothing because of her eating disorder. she cant even lift 5lbs. it's pretty sad but the long-term damage is real!",
      "created_utc": 1605225838.0,
      "score": 1,
      "context": []
    }
  ]
}