{
  "id": "jjv70e",
  "subreddit": "bulimia",
  "author": "raspberryel",
  "created_utc": 1603915346.0,
  "title": "does anyone else purge without bingeing?",
  "selftext": "i’m not sure if this post is allowed since this is a bulimia page, but do any of you purge without bingeing? in my mind i consider it bingeing but in all reality i’m eating a normal amount of food. just haven’t seen any posts related to only purging :’(",
  "url": "https://www.reddit.com/r/bulimia/comments/jjv70e/does_anyone_else_purge_without_bingeing/",
  "score": 94,
  "num_comments": 31,
  "comments": [
    {
      "id": "gaf4ai7",
      "author": "Chuglasagna",
      "body": "Yes, I do the same thing. I’ll even purge after drinking Coke Zero, or anything that isn’t water. It sucks. Message me if you ever need anyone to talk to.",
      "created_utc": 1603917527.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gaf5idz",
      "author": "None",
      "body": "When I was 15 and 16 that's what I did. I think I can recall one single time that I purged from a binge. I have gone in and out of recovery since then, and 20 year old me does not have the time or energy to purge like 15 year old me did. She sure as heck does have the energy to binge, though, so now it is all b/p.\n\nIf I could go back, I would address 15/16 year old me, that way 20 year old me wasn't left dealing with all her bullcrap.",
      "created_utc": 1603918107.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gafb20e",
      "author": "None",
      "body": "Yeah, sometimes I purge without binging or binge without purging but I'm diagnosed with bulimia and not binge eating disorder or purging disorder. I think people with EDs switch their behaviours around a lot.",
      "created_utc": 1603920748.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gaf3x1x",
      "author": "smashedpancake",
      "body": "Yes, most of the time I purge things that most people would consider a normal amount but it makes me feel gross",
      "created_utc": 1603917350.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gaf62nx",
      "author": "BigChiliDawg",
      "body": "Yeah I purge pretty much anything and everything, even if it’s not unhealthy or a lot of food. It’s only selective for some people I think- like any Eating Disorder, it varies on a person to person basis",
      "created_utc": 1603918368.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gafpigr",
      "author": "o_elaine_g",
      "body": "i’ve never binged, i’ve only ever purged and idk what it means and if it still qualifies as bulimia",
      "created_utc": 1603927137.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gaf3h7r",
      "author": "Sally7328",
      "body": "Yep, same",
      "created_utc": 1603917144.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gaf7p8z",
      "author": "wrinkle-crease",
      "body": "Yeah! I started trying to keep a no binge streak and a separate no purge streak. Haven’t binged in weeks but I still purge almost daily. The “streak” thing clearly doesn’t work for me lol",
      "created_utc": 1603919153.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gaf9sj1",
      "author": "Ophi1lia",
      "body": "Yeah, it is it’s own disorder. Purging disorder I believe.",
      "created_utc": 1603920134.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gafbaga",
      "author": "julian_pt",
      "body": "all the time, dude. you're not alone. even if it's under 1000, ill still purge it up out of guilt",
      "created_utc": 1603920860.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gaff8eq",
      "author": "Thicc_like_Milkshake",
      "body": "I do lots of extended fasts(24-72 hours), so my stomach tends to shrink over time. To other people, my binges are just a meal with some snacks riddled in, but I still feel uncomfortably full afterwards. That painful fullness is what causes me to purge",
      "created_utc": 1603922754.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gafc1ss",
      "author": "prettybattalion",
      "body": "I used to do that a lot until I almost passed out at school, 0/10 highly recommend you try to cut back on doing that too often",
      "created_utc": 1603921220.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gafonky",
      "author": "Vilainity",
      "body": "Pretty much after I eat anything other than rice cakes and even then sometimes I still do",
      "created_utc": 1603926649.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gafrnt6",
      "author": "JetPatriot",
      "body": "Yesss!",
      "created_utc": 1603928339.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gaftydz",
      "author": "Who_locked_the_gate",
      "body": "Yep. Depending on my mood, I will purge a regular meal or if I feel too full.",
      "created_utc": 1603929597.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gafv1g4",
      "author": "None",
      "body": "I'm not sure if I'd be physically able to. I can only make myself sick if I feel full enough.",
      "created_utc": 1603930192.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gaf4r5o",
      "author": "None",
      "body": "I purge single pieces of toast, half granola bars, etc. I actually have a fear of binges and cant do it",
      "created_utc": 1603917750.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gag1axf",
      "author": "aint_this_wrong5210",
      "body": "Yes i do too and have been thinking the same thing. I’m unsure of why I purge but I just know it feels good? I don’t have body issues or a string need to lose weight, food is also yum too so why the heck do I always have a need to get it it of my body. \n\nTbh begging home is a trigger for me as I purge. I find when I’m out and about I won’t purge, unless at the gym",
      "created_utc": 1603933613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gag6e7o",
      "author": "makeupyourworld",
      "body": "yes its scary",
      "created_utc": 1603936462.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gag9lpf",
      "author": "ajamaskell",
      "body": "yes 100%. I was searching this exact thing and couldn’t find any posts like this! ur not alone",
      "created_utc": 1603938251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gagbqnz",
      "author": "pissjug1001",
      "body": "i was just thinking of this earlier. i often purge if i easy outside of my IF feeding time, or even when i’m “allowed” to eat n i choose any unhealthy meal.",
      "created_utc": 1603939511.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gagc2za",
      "author": "KnownCherry8",
      "body": "yes. i’m the same way. i’ll purge after i drink a gatorade or a small donut hole. this is labeled under EDNOS. i hope all is well and if you haven’t gotten help, you can get some soon. much love❤️",
      "created_utc": 1603939714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gaggw0c",
      "author": "FrogginBullfish_",
      "body": "YES!!! I have been wondering this too. Like idk what to even call it since I literally just get upset about eating a healthy sized meal. After years of unintentionally starving myself from anxiety a normal amount feels like too much.",
      "created_utc": 1603942758.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gagpkeg",
      "author": "mmg1996",
      "body": "If I ate more than 900 Cals a day I purged..",
      "created_utc": 1603949371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gagxend",
      "author": "None",
      "body": "Yes this is how it actually started for me. Eventually it changed into binging. Someone told me it was called purging disorder but whatever it’s called, I think a lot of us do it. 😕",
      "created_utc": 1603957400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gah2q68",
      "author": "whizzers_going_down",
      "body": "yeah i used to just right after any meal like just a normal dinner or lunch",
      "created_utc": 1603963529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gahnm60",
      "author": "Evangeline-",
      "body": "Yeah. Just sometimes the feeling of having eaten is enough to trigger it. Even salads   ...",
      "created_utc": 1603979794.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gahxvm4",
      "author": "itsdani3lla",
      "body": "*Trigger Warning* Yes! I don’t binge really. But I do purge especially if I feel like I’ve eaten too much that day (even though it’s what a lot of people would consider a regular amount of food for the day). Same if my parents randomly get fast food out of the blue or order pizza for dinner and I’ve already eaten stuff for breakfast and/or dinner. Idk when they do that it ruins my plan/routine for the day if that makes sense.",
      "created_utc": 1603984939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gahy1u5",
      "author": "sadgirlbuckeye",
      "body": "Most of the time when i purge it isn’t a binge so they didn’t want to diagnose me with bulimia",
      "created_utc": 1603985021.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gai235a",
      "author": "litlittlecandle",
      "body": "I do, i dont binge but i purge what i eat",
      "created_utc": 1603986923.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gafval1",
      "author": "None",
      "body": "It doesn't. Bulimia diagnosis needs the binge before the purge. You'd probably fall under the EDNOS category. I suggest seeing a professional as always. Wish you the best and hope you get better xxx",
      "created_utc": 1603930330.0,
      "score": 3,
      "context": [
        {
          "id": "gafpigr",
          "author": "o_elaine_g",
          "body": "i’ve never binged, i’ve only ever purged and idk what it means and if it still qualifies as bulimia",
          "created_utc": 1603927137.0
        }
      ]
    }
  ]
}