{
  "id": "jlkuya",
  "subreddit": "bulimia",
  "author": "imsorrybunny",
  "created_utc": 1604160131.0,
  "title": "bulimia making me abandon my ethics",
  "selftext": "been vegan for almost two years and i broke it with dairy pastries last weekend. currently binging on bagels with cream cheese. it’s mostly because my family keeps non vegan foods around but the only one i can truly blame is myself. this disorder is making me abandon my identity. i’m so tired.",
  "url": "https://www.reddit.com/r/bulimia/comments/jlkuya/bulimia_making_me_abandon_my_ethics/",
  "score": 98,
  "num_comments": 11,
  "comments": [
    {
      "id": "gapwf06",
      "author": "None",
      "body": "Don't be too hard on yourself, I feel so much shame for craving dairy chocolate it's so difficult",
      "created_utc": 1604168161.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gaq4j7k",
      "author": "None",
      "body": "Another long time vegan here. I’ve been “sober” from the b/p cycle for 6 months now (crazy to type it out loud!) Remember and reinforce your core values that build your identity. They are strong reminders for why recovery is worth it. This has been supremely helpful for me. If you want to chat, feel free to dm me. <3",
      "created_utc": 1604172593.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gaqahmh",
      "author": "blank__way",
      "body": "i feel you. i’m a vegetarian and the other day i binged on s’mores poptarts (which have gelatin in them if you didn’t know) and i felt like such a fraud :(",
      "created_utc": 1604176065.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gaqfgkj",
      "author": "None",
      "body": "I'm so sorry, that sounds so hard. EDs really do take us far away from ourselves and what we truly value.\n\nI hope that you can get the help and healing you deserve <3",
      "created_utc": 1604179041.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gaqjclk",
      "author": "NutelllaBellla",
      "body": "So I wanted to go pesketarean and eventually vegan for sustainability ethics, but because of my bulimia, I also abandoned my ethics and have wasted so much food and b/pd on so many animal products. You're not alone. It doesn't make you a bad person. You have a big heart and good intentions, but the eating disorder has a way of dominating even our core values sometimes. We can overcome this. Take care ❤",
      "created_utc": 1604181403.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gaquqs0",
      "author": "Lumplebee",
      "body": "Happened to me as well and I just decided to not be vegan in recovery :/ I still follow all the vegan subreddits though and I feel like shit reading them. I was vegan for 3 years and during quarantine I entered a nasty bp cycle and threw it all away",
      "created_utc": 1604188575.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gaxquqp",
      "author": "lynnlove5917",
      "body": "I’m vegan too! I’ve never broken my veganism but transitioning from vegetarian to vegan helped my bulimia and at one point saved me from it. I’m struggling though b/p with shitty vegan food and I’m feeling lost. I hope you make it through this and I’m so sorry it’s like this for you!!! Ed’s are so overwhelming that I don’t really think it’s your fault for eating something non-vegan. You can get through this!!!!",
      "created_utc": 1604351595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gaqpars",
      "author": "Phaedrug",
      "body": "Being vegan isn’t your identity, it’s a dietary choice. Breaking your diet or having a setback with your medical condition (bul) is *not a personal failing.*\n\nIt might seem like a small distinction but it’s one worth remembering. Your illness is not who you are: it’s happening to you and you can fight it and you can beat it.",
      "created_utc": 1604185103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gasyv22",
      "author": "Fire_Pink",
      "body": "I had a similar phase when my bulimia was at it's most severe.\nI would find myself shoplifting binge food. I was so ashamed of myself. It was how I knew I hit my absolute lowest of lows. I'm lucky I didn't get in trouble before I started regaining control.\n\nYou have to atleast TRY to be stronger than this. I know it's so much easier said than done. Please keep yourself safe.",
      "created_utc": 1604248133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gaq55dd",
      "author": "imsorrybunny",
      "body": "thank u for being understanding. it’s definitely a struggle and i appreciate you acknowledging that. u r a rockstar for aiming for recovery! can i please ask how u got to that point?",
      "created_utc": 1604172943.0,
      "score": 3,
      "context": [
        {
          "id": "gaq4j7k",
          "author": "None",
          "body": "Another long time vegan here. I’ve been “sober” from the b/p cycle for 6 months now (crazy to type it out loud!) Remember and reinforce your core values that build your identity. They are strong reminders for why recovery is worth it. This has been supremely helpful for me. If you want to chat, feel free to dm me. <3",
          "created_utc": 1604172593.0
        }
      ]
    },
    {
      "id": "gaqsuqr",
      "author": "None",
      "body": "I’m honestly just so fucking tired of wasting days to the cycle. There’s this freedom that comes with ignoring all life responsibilities and just binging and purging for days, weeks, months on end with little regard for anything else. But the aftermath is so damn shitty. I’ve read a lot of books on recovery (Brain Over Binge being the best one) and just kind of internalized it and am finding my own process. I still don’t feel “safe” and I know the possibility of relapse is very real, but I just take it day by day, am way nicer to myself, and stay humble about where I’m at with it all. I still have days when I really want to purge, but I know what that will lead to so I just don’t do it. Then it passes. There IS light on the other side of the tunnel. I’ve been struggling with this shit for so long (off and on for over 15 years) so if I can do it, you can too.",
      "created_utc": 1604187373.0,
      "score": 7,
      "context": [
        {
          "id": "gaq4j7k",
          "author": "None",
          "body": "Another long time vegan here. I’ve been “sober” from the b/p cycle for 6 months now (crazy to type it out loud!) Remember and reinforce your core values that build your identity. They are strong reminders for why recovery is worth it. This has been supremely helpful for me. If you want to chat, feel free to dm me. <3",
          "created_utc": 1604172593.0
        },
        {
          "id": "gaq55dd",
          "author": "imsorrybunny",
          "body": "thank u for being understanding. it’s definitely a struggle and i appreciate you acknowledging that. u r a rockstar for aiming for recovery! can i please ask how u got to that point?",
          "created_utc": 1604172943.0
        }
      ]
    }
  ]
}