{
  "id": "jnyurz",
  "subreddit": "bulimia",
  "author": "asdfghpurplejkl",
  "created_utc": 1604504396.0,
  "title": "stress",
  "selftext": "guys i havent purged in MONTHS. but with all the stress about online school, working multiple jobs, the election in the us and just overall stress around recovery, i b/p last night. today i have the worst headache. \n\ni kinda feel like a failure. but i have to remind myself recovery isn’t linear and slip ups happen. so i just want to remind anyone else who is dealing with a lot of stress that may have slipped up, it’s okay and youre not a failure!!",
  "url": "https://www.reddit.com/r/bulimia/comments/jnyurz/stress/",
  "score": 80,
  "num_comments": 4,
  "comments": [
    {
      "id": "gb4ylgn",
      "author": "EastofEatin",
      "body": "Hey, it happens! We've all been there at one time or another, as you said: recovery is not linear. 2020 in general has been a tumultuous year, it's COMPLETELY OK to be stressed.\n\nYou are not a failure. You will be alright. ❤",
      "created_utc": 1604512071.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gb6o55h",
      "author": "bubblebathory",
      "body": "I relapsed with this election stress too. I’m sorry you’re struggling.",
      "created_utc": 1604542267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gb6qlf2",
      "author": "None",
      "body": "Absolutely! Think of all the stressful times you HAVE gotten through without b/p. Sometimes it just feels like there's a pressure valve that has to be released during really stressful times. It's hard not to feel defeated by this, but as they say, it's part of the journey. *hugs*",
      "created_utc": 1604543561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gb6r3et",
      "author": "10milespankmachine",
      "body": "It’s been years since a major relapse, but I caved last week too. It happens, and the best thing that you can do is just care for yourself and be gentle. It’s hard to slip up after all that progress, but you did it once, and you’ll do it again.",
      "created_utc": 1604543832.0,
      "score": 1,
      "context": []
    }
  ]
}