{
  "id": "jpjnx4",
  "subreddit": "bulimia",
  "author": "OhToBeSkinny",
  "created_utc": 1604719753.0,
  "title": "Does anyone ever binge just so they can purge?",
  "selftext": "I don’t know there’s something about the catharsis purging gives me, the control, the release. I’m an emotional eater but sometimes I’m too upset to even eat, today was one of those days. In those times I don’t even feel the need to binge but I do want the numbness it provides.  The food doesn’t make me feel happy or safe anymore just distant from everything and I need that but more than anything I want to be able to purge and feel all the things I mentioned before. I also want to feel good at something and in a way hurt. Today it stopped me from badly s/h, it stopped me from drinking half a bottle of vodka, it stopped me from taking something to blur it all, it stopped me from ending things. I don’t know, the process is so exhausting and takes about an hour to both b/p and then clean up so by the time it’s over I’m too gone to act impulsively and ruin things, it’s like a buffer.",
  "url": "https://www.reddit.com/r/bulimia/comments/jpjnx4/does_anyone_ever_binge_just_so_they_can_purge/",
  "score": 121,
  "num_comments": 23,
  "comments": [
    {
      "id": "gbfbn7i",
      "author": "punipunijelly",
      "body": "I feel this, I have definitely made conscious decisions to binge, even though I didn’t have any strong binge urges, just to go through that process. It’s a coping mechanism.\n\nAnd, this may be an unpopular opinion, but I don’t think we should be demonizing bulimia if it’s an effective coping mechanism. Obviously it’s not ideal, and I’m recovering and doing much better now, but there were times in my life when b/p definitely saved me from doing more harmful things (s/h, forming suicidal ideation, going back to substance abuse). As long as you’re alive you can recover but if you end things it’s all over. So you’re actually doing well. I’m proud of you for fighting",
      "created_utc": 1604724796.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gbffzfa",
      "author": "MyHusbandsFarts",
      "body": "Absolutely yes. Yes. Of course yes. I don't think you need to feel alone about this. I used to plan going to different grocery stores because of how embarrassed I was that I was buying a complete other jar of peanut butter a day later, again. I'd have the binge foods from grocery store a, then the next day would be a store b type of binge food set, then the next day a store c set of binge foods, and I would rotate around like that.\n\nAre there worse things? Absolutely. I am so glad you didn't s/h. I'm so glad you were here and typed this reddit post instead of doing anything worse. I want to reach out and hold your hand - because you are not alone. \n\nWriting is wonderful. Asking questions is wonderful. Being tired of it all and musing that you just might have the desire to want to be in a better place is wonderful. And then b/ping again and being in the same space? It's ok. \n\nThank you for sharing your thoughts and what your going through!",
      "created_utc": 1604728014.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbf9di8",
      "author": "None",
      "body": "Yes, I do that too :(",
      "created_utc": 1604723243.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gbfkijw",
      "author": "stelas",
      "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
      "created_utc": 1604731902.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gbfuaka",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1604741980.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbg83qn",
      "author": "gargoyle-of-olay",
      "body": "this was so beautifully written. sending hugs",
      "created_utc": 1604755080.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gbfbq8s",
      "author": "justonium",
      "body": "I can understand this temptation, but also remember that a b/p, just like a pint of vodka, can also do a lot of harm to both body, mind, and.. energy-body? Like I'm pretty sure that all three get a pretty strong zoing.\n\nPurging when you've overeaten something toxic is one thing but going from that to 'feeding' an expected purge can be a slippery slope and I would beware.",
      "created_utc": 1604724853.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbgvcpl",
      "author": "None",
      "body": "My earliest memory of purging is my parents having a huge dramatic I’m leaving the family forever fight and trying to purge because I was so upset even though I hadn’t had any kind of binge before. Food wasn’t even on my mind just emotional release.",
      "created_utc": 1604768570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbjd25d",
      "author": "None",
      "body": "I just did the same thing, friend. I love the action and being proud of myself right after for getting it all out and still being able to smell the vomit on my hands. It’s hard, I understand. But I’m also proud of you for sticking around, I’m proud of you for deciding to continue existing <3",
      "created_utc": 1604802207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbff0by",
      "author": "OhToBeSkinny",
      "body": "I completely agree with you on this I’m not saying these types coping mechanisms are in any way good but at least you are able to cope when you use them otherwise you have nothing to defend yourself with, no way to fight. If we had a choice we’d be happy people, we’d feel our emotions, we’d hurt and we’d move on but not everyone can do that. No one should be shamed by others for trying to cope, for trying to survive. It sounds like you’ve dealt with a lot of struggles yourself and it’s inspirational that you are still here, you seem like an incredibly strong person, I’m sorry if anyone’s ever made you feel guilty for trying to cope you don’t deserve it. I really hope you are in an alright place now or that you at least gradually are able to get there, any progress is amazing and you should be commended for it. Thank you for saying you are proud of me for fighting everyone says I’m giving in when I turn to these types of things, it’s so nice to be understood, it means more to me than you will ever know ♥️",
      "created_utc": 1604727259.0,
      "score": 6,
      "context": [
        {
          "id": "gbfbn7i",
          "author": "punipunijelly",
          "body": "I feel this, I have definitely made conscious decisions to binge, even though I didn’t have any strong binge urges, just to go through that process. It’s a coping mechanism.\n\nAnd, this may be an unpopular opinion, but I don’t think we should be demonizing bulimia if it’s an effective coping mechanism. Obviously it’s not ideal, and I’m recovering and doing much better now, but there were times in my life when b/p definitely saved me from doing more harmful things (s/h, forming suicidal ideation, going back to substance abuse). As long as you’re alive you can recover but if you end things it’s all over. So you’re actually doing well. I’m proud of you for fighting",
          "created_utc": 1604724796.0
        }
      ]
    },
    {
      "id": "gbhzngt",
      "author": "OhToBeSkinny",
      "body": "Thank you for your kind word and your understanding, it means so much to me that you’d take the time to share your experiences and thoughts with me. I do the same thing with roaring grocery stores, the whole time I feel on edge because I have this overwhelming feeling that someone knows exactly what I’m doing. It’s difficult, bulimia is difficult, but we can get through this together ♥️♥️♥️",
      "created_utc": 1604785276.0,
      "score": 2,
      "context": [
        {
          "id": "gbffzfa",
          "author": "MyHusbandsFarts",
          "body": "Absolutely yes. Yes. Of course yes. I don't think you need to feel alone about this. I used to plan going to different grocery stores because of how embarrassed I was that I was buying a complete other jar of peanut butter a day later, again. I'd have the binge foods from grocery store a, then the next day would be a store b type of binge food set, then the next day a store c set of binge foods, and I would rotate around like that.\n\nAre there worse things? Absolutely. I am so glad you didn't s/h. I'm so glad you were here and typed this reddit post instead of doing anything worse. I want to reach out and hold your hand - because you are not alone. \n\nWriting is wonderful. Asking questions is wonderful. Being tired of it all and musing that you just might have the desire to want to be in a better place is wonderful. And then b/ping again and being in the same space? It's ok. \n\nThank you for sharing your thoughts and what your going through!",
          "created_utc": 1604728014.0
        }
      ]
    },
    {
      "id": "gbff4yi",
      "author": "OhToBeSkinny",
      "body": "It’s ok my bulimia buddy, don’t ever feel guilty for it. We will get through this ♥️",
      "created_utc": 1604727355.0,
      "score": 6,
      "context": [
        {
          "id": "gbf9di8",
          "author": "None",
          "body": "Yes, I do that too :(",
          "created_utc": 1604723243.0
        }
      ]
    },
    {
      "id": "gbgpfuf",
      "author": "oyyl98",
      "body": "Wow... that was literally me for the past week. \nI always end up at the grocery store and I don’t want anything, nothing seems appealing but I still buy random stuff just to binge. :(\nI was even starting to wonder if I wasn’t really sick but just “forcing” myself to be sick...",
      "created_utc": 1604765872.0,
      "score": 5,
      "context": [
        {
          "id": "gbfkijw",
          "author": "stelas",
          "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
          "created_utc": 1604731902.0
        }
      ]
    },
    {
      "id": "gbi01q0",
      "author": "OhToBeSkinny",
      "body": "I did this last night, I always end up over buying because I don’t know what I want and then this leads to even more binges, yesterday I was very upset and grabbed things mindlessly and spent around $37, I didn’t care about the price anymore I just bought thing I thought would help me feel better. I hope you are ok and that you have a lovely day today, stay strong ♥️♥️♥️",
      "created_utc": 1604785404.0,
      "score": 1,
      "context": [
        {
          "id": "gbfkijw",
          "author": "stelas",
          "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
          "created_utc": 1604731902.0
        }
      ]
    },
    {
      "id": "gbi13uj",
      "author": "OhToBeSkinny",
      "body": "I’ve found myself doing the same thing lately, the only other option I find is restricting but I no longer have the energy to count calories so this is more so my break. It’s gonna be ok we can get through this together ♥️♥️♥️",
      "created_utc": 1604785754.0,
      "score": 2,
      "context": [
        {
          "id": "gbfuaka",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1604741980.0
        }
      ]
    },
    {
      "id": "gbi19jy",
      "author": "OhToBeSkinny",
      "body": "Thank you for saying that, it means the world to me ♥️♥️♥️ *sending hugs back  *",
      "created_utc": 1604785802.0,
      "score": 2,
      "context": [
        {
          "id": "gbg83qn",
          "author": "gargoyle-of-olay",
          "body": "this was so beautifully written. sending hugs",
          "created_utc": 1604755080.0
        }
      ]
    },
    {
      "id": "gbi1owo",
      "author": "OhToBeSkinny",
      "body": "I will try to get a hold on it, it’s just been a bad few days and I needed the release. I know that it’s not a very good thing to do, none of the things I mentioned are good, I guess I’m just picking my poison for now. Thank you for the concern though, I will keep your words in mind ♥️♥️♥️",
      "created_utc": 1604785937.0,
      "score": 2,
      "context": [
        {
          "id": "gbfbq8s",
          "author": "justonium",
          "body": "I can understand this temptation, but also remember that a b/p, just like a pint of vodka, can also do a lot of harm to both body, mind, and.. energy-body? Like I'm pretty sure that all three get a pretty strong zoing.\n\nPurging when you've overeaten something toxic is one thing but going from that to 'feeding' an expected purge can be a slippery slope and I would beware.",
          "created_utc": 1604724853.0
        }
      ]
    },
    {
      "id": "gbi279l",
      "author": "OhToBeSkinny",
      "body": "I haven’t heard many stories like this, I’m guessing in a way that would feel kinda lonely. I hope your family life is a bit less tumultuous now and that eventually things will be ok enough for you to no longer need that emotional release although I completely understand and respect you seeking it out when things are tough. Stay safe, stay strong ♥️♥️♥️",
      "created_utc": 1604786099.0,
      "score": 1,
      "context": [
        {
          "id": "gbgvcpl",
          "author": "None",
          "body": "My earliest memory of purging is my parents having a huge dramatic I’m leaving the family forever fight and trying to purge because I was so upset even though I hadn’t had any kind of binge before. Food wasn’t even on my mind just emotional release.",
          "created_utc": 1604768570.0
        }
      ]
    },
    {
      "id": "gbi0rgr",
      "author": "OhToBeSkinny",
      "body": "The “forcing” yourself to be sick thing really resonates with me, a lot of my friends get frustrated with me because they give me advice (which has good intentions but doesn’t actually really work or help sadly) and get frustrated when I don’t apply it because I know it won’t work or I don’t miraculously get better. You aren’t making yourself sick, you are trying to cope with a bigger issue and that issue is likely out of your control. Don’t ever feel guilty or like you are responsible for the cycle you find yourself trapped in because if you could get out of it you would, if you could go back before any of this happened and stopped yourself from starting you would. I hope this helps with anything you are going through, remember that your feelings are important and valid no matter what ♥️♥️♥️",
      "created_utc": 1604785648.0,
      "score": 2,
      "context": [
        {
          "id": "gbfkijw",
          "author": "stelas",
          "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
          "created_utc": 1604731902.0
        },
        {
          "id": "gbgpfuf",
          "author": "oyyl98",
          "body": "Wow... that was literally me for the past week. \nI always end up at the grocery store and I don’t want anything, nothing seems appealing but I still buy random stuff just to binge. :(\nI was even starting to wonder if I wasn’t really sick but just “forcing” myself to be sick...",
          "created_utc": 1604765872.0
        }
      ]
    },
    {
      "id": "gbkz93w",
      "author": "justonium",
      "body": "I know right like sometimes I'm kind of even grateful that I accidentally ate something so toxic that I had to purge.\n\nBut yeah I still do try to stay away from further feeding an expected purge, as that seems to me like the last tier away from full-on feeding a *planned* purge, which could maybe form into an addiction I really really really do not want to get stuck with.\n\nEdit:\n\nOne thing that has helped me cope with stressful things instead of b/p that seems less harmful has been to just drink a fairly large quantity of high fructose corn syrup. (Or something else high in fructose like I've also used maple syrup.)\n\nI mean, at least it's not as bad, unhealthy, as binging and then vomiting, or, heaven forbid, drinking *vodka*.",
      "created_utc": 1604824611.0,
      "score": 1,
      "context": [
        {
          "id": "gbfbq8s",
          "author": "justonium",
          "body": "I can understand this temptation, but also remember that a b/p, just like a pint of vodka, can also do a lot of harm to both body, mind, and.. energy-body? Like I'm pretty sure that all three get a pretty strong zoing.\n\nPurging when you've overeaten something toxic is one thing but going from that to 'feeding' an expected purge can be a slippery slope and I would beware.",
          "created_utc": 1604724853.0
        },
        {
          "id": "gbi1owo",
          "author": "OhToBeSkinny",
          "body": "I will try to get a hold on it, it’s just been a bad few days and I needed the release. I know that it’s not a very good thing to do, none of the things I mentioned are good, I guess I’m just picking my poison for now. Thank you for the concern though, I will keep your words in mind ♥️♥️♥️",
          "created_utc": 1604785937.0
        }
      ]
    },
    {
      "id": "gbmwle2",
      "author": "oyyl98",
      "body": "You have no idea how much I needed to hear this! Thank you so much ... :( It’s so hard to fight both the demons inside your head AND the people around you who have no idea what it’s like to be this way. I wish you the best ❤️",
      "created_utc": 1604859492.0,
      "score": 1,
      "context": [
        {
          "id": "gbfkijw",
          "author": "stelas",
          "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
          "created_utc": 1604731902.0
        },
        {
          "id": "gbgpfuf",
          "author": "oyyl98",
          "body": "Wow... that was literally me for the past week. \nI always end up at the grocery store and I don’t want anything, nothing seems appealing but I still buy random stuff just to binge. :(\nI was even starting to wonder if I wasn’t really sick but just “forcing” myself to be sick...",
          "created_utc": 1604765872.0
        },
        {
          "id": "gbi0rgr",
          "author": "OhToBeSkinny",
          "body": "The “forcing” yourself to be sick thing really resonates with me, a lot of my friends get frustrated with me because they give me advice (which has good intentions but doesn’t actually really work or help sadly) and get frustrated when I don’t apply it because I know it won’t work or I don’t miraculously get better. You aren’t making yourself sick, you are trying to cope with a bigger issue and that issue is likely out of your control. Don’t ever feel guilty or like you are responsible for the cycle you find yourself trapped in because if you could get out of it you would, if you could go back before any of this happened and stopped yourself from starting you would. I hope this helps with anything you are going through, remember that your feelings are important and valid no matter what ♥️♥️♥️",
          "created_utc": 1604785648.0
        }
      ]
    },
    {
      "id": "gboo3j7",
      "author": "OhToBeSkinny",
      "body": "I completely understand being grateful for eating something toxic, it allows you to purge without having feeling I guess the shame that can accompany it. As much as I rely on it it still feels kind of degrading. Some days I just pray I get food poisoning \n\nIt’s good that you are trying to prevent it from becoming a full blown addiction, it would be so much harder to recover if it became that. \n\nI will try out the maple syrup/corn syrup too, it makes a lot of sense, that much sugar all at once and you wouldn’t want to binge anymore I imagine and you’re completely right it’s much much healthier than some of the alternatives. Thank you for the help 💜",
      "created_utc": 1604892545.0,
      "score": 2,
      "context": [
        {
          "id": "gbfbq8s",
          "author": "justonium",
          "body": "I can understand this temptation, but also remember that a b/p, just like a pint of vodka, can also do a lot of harm to both body, mind, and.. energy-body? Like I'm pretty sure that all three get a pretty strong zoing.\n\nPurging when you've overeaten something toxic is one thing but going from that to 'feeding' an expected purge can be a slippery slope and I would beware.",
          "created_utc": 1604724853.0
        },
        {
          "id": "gbi1owo",
          "author": "OhToBeSkinny",
          "body": "I will try to get a hold on it, it’s just been a bad few days and I needed the release. I know that it’s not a very good thing to do, none of the things I mentioned are good, I guess I’m just picking my poison for now. Thank you for the concern though, I will keep your words in mind ♥️♥️♥️",
          "created_utc": 1604785937.0
        },
        {
          "id": "gbkz93w",
          "author": "justonium",
          "body": "I know right like sometimes I'm kind of even grateful that I accidentally ate something so toxic that I had to purge.\n\nBut yeah I still do try to stay away from further feeding an expected purge, as that seems to me like the last tier away from full-on feeding a *planned* purge, which could maybe form into an addiction I really really really do not want to get stuck with.\n\nEdit:\n\nOne thing that has helped me cope with stressful things instead of b/p that seems less harmful has been to just drink a fairly large quantity of high fructose corn syrup. (Or something else high in fructose like I've also used maple syrup.)\n\nI mean, at least it's not as bad, unhealthy, as binging and then vomiting, or, heaven forbid, drinking *vodka*.",
          "created_utc": 1604824611.0
        }
      ]
    },
    {
      "id": "gbnyths",
      "author": "OhToBeSkinny",
      "body": "Especially when the demons and the people around you are typically telling you completely different things. I wish I could just put my brain inside other peoples heads for a second so that they could understand. I’m really glad that I could help in any way ♥️ I wish you the best as well ♥️",
      "created_utc": 1604878324.0,
      "score": 1,
      "context": [
        {
          "id": "gbfkijw",
          "author": "stelas",
          "body": "Yes I find myself shopping for the binge haul in the grocery store, looking at junk food like 'I don't want any of this. None of this appeals to me anymore.' and yet I still buy it and binge on it.",
          "created_utc": 1604731902.0
        },
        {
          "id": "gbgpfuf",
          "author": "oyyl98",
          "body": "Wow... that was literally me for the past week. \nI always end up at the grocery store and I don’t want anything, nothing seems appealing but I still buy random stuff just to binge. :(\nI was even starting to wonder if I wasn’t really sick but just “forcing” myself to be sick...",
          "created_utc": 1604765872.0
        },
        {
          "id": "gbi0rgr",
          "author": "OhToBeSkinny",
          "body": "The “forcing” yourself to be sick thing really resonates with me, a lot of my friends get frustrated with me because they give me advice (which has good intentions but doesn’t actually really work or help sadly) and get frustrated when I don’t apply it because I know it won’t work or I don’t miraculously get better. You aren’t making yourself sick, you are trying to cope with a bigger issue and that issue is likely out of your control. Don’t ever feel guilty or like you are responsible for the cycle you find yourself trapped in because if you could get out of it you would, if you could go back before any of this happened and stopped yourself from starting you would. I hope this helps with anything you are going through, remember that your feelings are important and valid no matter what ♥️♥️♥️",
          "created_utc": 1604785648.0
        },
        {
          "id": "gbmwle2",
          "author": "oyyl98",
          "body": "You have no idea how much I needed to hear this! Thank you so much ... :( It’s so hard to fight both the demons inside your head AND the people around you who have no idea what it’s like to be this way. I wish you the best ❤️",
          "created_utc": 1604859492.0
        }
      ]
    },
    {
      "id": "gbp56mq",
      "author": "justonium",
      "body": "<3\n\nAnd also once the body has processed all of the fructose there is nothing solid left to purge only maybe just a little bit of diarrhea if the syrup was maybe complicated like some maple syrups if consumed in excess this way contain way more than the daily value of manganese, etc.\n\nAlso yeah sometimes it is a relief for me to actually have eaten something poisoning enough that vomiting happens naturally or mostly naturally, 'cause that's way less horrible than having to force a purge.\n\nPart of why I sometimes use emetics. :/ :\\",
      "created_utc": 1604905272.0,
      "score": 2,
      "context": [
        {
          "id": "gbfbq8s",
          "author": "justonium",
          "body": "I can understand this temptation, but also remember that a b/p, just like a pint of vodka, can also do a lot of harm to both body, mind, and.. energy-body? Like I'm pretty sure that all three get a pretty strong zoing.\n\nPurging when you've overeaten something toxic is one thing but going from that to 'feeding' an expected purge can be a slippery slope and I would beware.",
          "created_utc": 1604724853.0
        },
        {
          "id": "gbi1owo",
          "author": "OhToBeSkinny",
          "body": "I will try to get a hold on it, it’s just been a bad few days and I needed the release. I know that it’s not a very good thing to do, none of the things I mentioned are good, I guess I’m just picking my poison for now. Thank you for the concern though, I will keep your words in mind ♥️♥️♥️",
          "created_utc": 1604785937.0
        },
        {
          "id": "gbkz93w",
          "author": "justonium",
          "body": "I know right like sometimes I'm kind of even grateful that I accidentally ate something so toxic that I had to purge.\n\nBut yeah I still do try to stay away from further feeding an expected purge, as that seems to me like the last tier away from full-on feeding a *planned* purge, which could maybe form into an addiction I really really really do not want to get stuck with.\n\nEdit:\n\nOne thing that has helped me cope with stressful things instead of b/p that seems less harmful has been to just drink a fairly large quantity of high fructose corn syrup. (Or something else high in fructose like I've also used maple syrup.)\n\nI mean, at least it's not as bad, unhealthy, as binging and then vomiting, or, heaven forbid, drinking *vodka*.",
          "created_utc": 1604824611.0
        },
        {
          "id": "gboo3j7",
          "author": "OhToBeSkinny",
          "body": "I completely understand being grateful for eating something toxic, it allows you to purge without having feeling I guess the shame that can accompany it. As much as I rely on it it still feels kind of degrading. Some days I just pray I get food poisoning \n\nIt’s good that you are trying to prevent it from becoming a full blown addiction, it would be so much harder to recover if it became that. \n\nI will try out the maple syrup/corn syrup too, it makes a lot of sense, that much sugar all at once and you wouldn’t want to binge anymore I imagine and you’re completely right it’s much much healthier than some of the alternatives. Thank you for the help 💜",
          "created_utc": 1604892545.0
        }
      ]
    }
  ]
}