{
  "id": "jpuvr1",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1604771979.0,
  "title": "REQUEST: Covid or bulimia side effects? I can never tell",
  "selftext": "Do y’all ever get confused about whether you’re actually sick sick or you’re just having shitty side effects of bulimia? \n\nWoke up this morning with chest pains (feels more like heart than lungs), a sore throat that I’ve had for a while but is progressively getting worse, a lil bit of a cough, and dizziness (again always dizzy). During this devastating pandemic with a bunch of idiots who don’t wear masks, I’m always worried I’ve contracted COVID- even though my job until I got laid off was working as a case manager with the homeless population. I was surrounded by people constantly and never got COVID, so it makes me weary now in that I probably don’t have it... but you never know.\n\nThis sucks. Actually miserable, but I have a love/hate relationship with this disorder.",
  "url": "https://www.reddit.com/r/bulimia/comments/jpuvr1/request_covid_or_bulimia_side_effects_i_can_never/",
  "score": 79,
  "num_comments": 9,
  "comments": [
    {
      "id": "gbhdxv9",
      "author": "Throw_Away_Soap",
      "body": "YES and I hate it. My sore throat has gotten me paranoid enough to start wearing a mask around my mom, but then again, since I don't display any other symptoms it's most likely just the bulimia.",
      "created_utc": 1604778107.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gbhjb55",
      "author": "PersephoneHazard",
      "body": "Hahahaha TELL me about it. I sometimes lie in bed panicking about whether my sore throat is covid19 or cancer from smoking, and then suddenly remember I'm bulimic and have to laugh at myself...",
      "created_utc": 1604779909.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbhcgki",
      "author": "sore_cabbage",
      "body": "try posting this on [r/AskDocs](https://www.reddit.com/r/AskDocs/).",
      "created_utc": 1604777573.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbk46tl",
      "author": "ekkkooo",
      "body": "literally YES all the time lmao",
      "created_utc": 1604811577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbkb2kf",
      "author": "None",
      "body": "You should get tested anyway to put your mind at ease and if you do have it at least you know and can be extra cautious",
      "created_utc": 1604814226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gc6g4ye",
      "author": "None",
      "body": "Keep getting chest pains. Its scary. Then im wondering what other underlying conditions i have. I feel so alone.\nXox",
      "created_utc": 1605294001.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbhfat1",
      "author": "None",
      "body": "Omg same, makes me super paranoid as well. I don’t see a ton of people other than my parents so that’s a bit encouraging besides going to the gym which is usually when it’s slow. I dunno, probably going to get tested just to be sure :-/",
      "created_utc": 1604778564.0,
      "score": 2,
      "context": [
        {
          "id": "gbhdxv9",
          "author": "Throw_Away_Soap",
          "body": "YES and I hate it. My sore throat has gotten me paranoid enough to start wearing a mask around my mom, but then again, since I don't display any other symptoms it's most likely just the bulimia.",
          "created_utc": 1604778107.0
        }
      ]
    },
    {
      "id": "gbhf35j",
      "author": "None",
      "body": "Great idea, totally will!",
      "created_utc": 1604778490.0,
      "score": 2,
      "context": [
        {
          "id": "gbhcgki",
          "author": "sore_cabbage",
          "body": "try posting this on [r/AskDocs](https://www.reddit.com/r/AskDocs/).",
          "created_utc": 1604777573.0
        }
      ]
    },
    {
      "id": "gbkkaqp",
      "author": "cherrycrocs",
      "body": "i second this.  my dads gf came home from work one day feeling congested like she has a cold.  we are pretty certain it’s not covid but she needs to get a test before returning to work so she does.  a day or two later my dad wakes up with a fever, has a bad cough, short of breath, etc.  he gets the rapid test the next day so before we even know the gfs results he tests positive.  didn’t think it could happen to us till it did.  sorry for the long rant like story i just think you should be safe even if you think it’s unlikely considering the other factors.",
      "created_utc": 1604818075.0,
      "score": 3,
      "context": [
        {
          "id": "gbkb2kf",
          "author": "None",
          "body": "You should get tested anyway to put your mind at ease and if you do have it at least you know and can be extra cautious",
          "created_utc": 1604814226.0
        }
      ]
    }
  ]
}