{
  "id": "jq56d1",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1604808328.0,
  "title": "My struggles are less important than an anorexic's.",
  "selftext": "(tw, idk what for it's just fucked up lol)\n\nReally stupid thought I know, but I can't help but feel like this after I b/p. I feel like a fat hog because I don't have any self control and I'm fat. I'm flabby. If I did have self control I wouldn't have eaten an entire loaf of bread in one sitting, I would be starving instead. It feels like if I were anorexic, my struggles would be more valid because I would be sick enough to deny my body fuel. But I'm stuffing my face like a fatty.",
  "url": "https://www.reddit.com/r/bulimia/comments/jq56d1/my_struggles_are_less_important_than_an_anorexics/",
  "score": 139,
  "num_comments": 13,
  "comments": [
    {
      "id": "gbkq548",
      "author": "BrowncoatIona",
      "body": "So, I'm \"anorexic\". I've been diagnosed with AN-B/P and then AN-R. \nThere hasn't been a moment that I didn't feel I could've written your post, OP. \n\nAlso, I've been in treatment with a LOT of people with bulimia who were definitely worse of physically and mentally than me. \n\nUnfortunately public perception and medical perspective how narrow views of what an ED is supposed to look like. \n\nMany people care about you and would talk your situation seriously ♡",
      "created_utc": 1604820563.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gbkh92w",
      "author": "marcusc1233",
      "body": "Struggling is struggling. However there are degrees to adversity/ struggle. Its hard to put a measure on struggle because its unique and complex to the individual. Bulimia is rough shit ain't no breeze, more like a cough and a gag lol. But I know what your getting at it's like ooooo I get to enjoy all this food and just puke it out. Its what comes with bulimia, it's never just bulimia. Depression, anxiety, insecurities its definitely a whole package. I wish I could just stick to exercise and a healthy diet. But I'm so damn depressed my rooms gone to shit and I just sleep all day. I ain't got the energy to do shit. It's like to the point I'd rather be asleep because my dreams are better than my actual life. I got one thing in my life that keeps my head up and is keeping me motivated to breath, that's my significant other. My soul mate, and guess what she has fucking multiple sclerosis. I worry about her DAILY, high volume of stress life let's go!!! Man im gonna age like a crackhead with all the stress and cigarettes in my future lol🙂Your feelings are valid, as are mine.",
      "created_utc": 1604816811.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gblcrcs",
      "author": "JaneDoe1996669",
      "body": "I go back and fourth from being anorexic and being bulimic trust me they’re the same. Your struggle is valid and as far as I’m concerned we’re all on the same fucked up miserable team. 🧡💚💛🖤💜💙♥️",
      "created_utc": 1604831054.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gbkyaai",
      "author": "dumbhippodump",
      "body": "Omg yesss sometimes I wonder if I’m just binging because I’m fat & I want to eat or if it’s really an ED or anything serious",
      "created_utc": 1604824174.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gbkh366",
      "author": "throwrow21",
      "body": "Omg yes! I ate so much bread today and my mindset is “there’s nothing wrong with me, I’m just a fat slob who has no self control”\n\nI wish I was skinny enough so people knew I was sick but instead people are just like “woah, she needs to lay off the carbs”",
      "created_utc": 1604816745.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gbl2g5x",
      "author": "dolefulAlchemist",
      "body": "Yeaah it is kind of that way. I b/p but managed to get underweight and now I'm getting people worried for me,  but when I was normal weight and did that nobody cared, but even though I'm like this people still cant do anything and wont since I'm an adult anyway.",
      "created_utc": 1604826088.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gbltty9",
      "author": "None",
      "body": "Your struggle is not less important. I have been on both side of the spectrum, bulimia and anorexia and I can tell you I struggled a lot more with being  bulimic. Your struggles are valid, no matter what ED you have.",
      "created_utc": 1604839185.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gblu5oh",
      "author": "ToothWeird",
      "body": "Same, people describe a high after they purge but it just makes me want to blow my brains out. I hate purging and how it makes me feel.",
      "created_utc": 1604839336.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gblxqds",
      "author": "yktop1396",
      "body": "I feel the same. Although I logically know all struggling is real struggling, it feels like anorexia is romanticized in a certain way in real world and treatment world.",
      "created_utc": 1604841217.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gbn0roq",
      "author": "wutssarcasm",
      "body": "I feel the same way and have for 16 years with EDNOS/OSFED",
      "created_utc": 1604861459.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gbl0kzy",
      "author": "justonium",
      "body": "I often have the similar thought that anorexia is simply the version of this illness that you get if you have a little bit more tact and self-control.",
      "created_utc": 1604825212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbldv47",
      "author": "cecedreaming",
      "body": "I've had my ED for 10 years now and honestly the main reason I'm still struggling is because its not ever quite bad enough. Doctors don't care, family don't support, therapy is too expensive for something long term, and I can't get medical attention because I'm not skinny and I'm physically OK.\n\nNo one is winning here, but I struggled with anorexia for about a year and it's a different struggle. Ana was more intense, a daily suffering, but there had to be an end for it because it was so unsustainable. Bulimia has literally screwed up my mental health slowly over time and I would say its ruining my life, there's no end in sight, it won't kill me or hospitalise me, its just a never ending cycle.",
      "created_utc": 1604831560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbssrp5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1604984367.0,
      "score": 3,
      "context": [
        {
          "id": "gbkh366",
          "author": "throwrow21",
          "body": "Omg yes! I ate so much bread today and my mindset is “there’s nothing wrong with me, I’m just a fat slob who has no self control”\n\nI wish I was skinny enough so people knew I was sick but instead people are just like “woah, she needs to lay off the carbs”",
          "created_utc": 1604816745.0
        }
      ]
    },
    {
      "id": "gbt8jo8",
      "author": "throwrow21",
      "body": "I agree. The times I do get underweight I get a lot of attention “omg you look incredible” “I can feel your shoulder bones when I hug you”.\n\nI’ve had a friend say “I used to like being friends with you because we were the same size and now your skinner I hate you.. hahah” like it’s a joke.\n\nYeh Bitch, it was hilarious when my head was in the toilet bowl after I forced myself to eat too much on purpose...",
      "created_utc": 1604998519.0,
      "score": 2,
      "context": [
        {
          "id": "gbkh366",
          "author": "throwrow21",
          "body": "Omg yes! I ate so much bread today and my mindset is “there’s nothing wrong with me, I’m just a fat slob who has no self control”\n\nI wish I was skinny enough so people knew I was sick but instead people are just like “woah, she needs to lay off the carbs”",
          "created_utc": 1604816745.0
        },
        {
          "id": "gbssrp5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1604984367.0
        }
      ]
    }
  ]
}