{
  "id": "jv74jd",
  "subreddit": "bulimia",
  "author": "honeycakies",
  "created_utc": 1605534976.0,
  "title": "DAE hate when others assume their ED is solely restrictive / act like you can't really be binging",
  "selftext": "I'm not underweight but am still considered to be slim by most people, so I feel like that's why people act like my binging issues aren't real/serious??  (I was severely anorexic for years, but that led to a dx of bulimia because I binge and then purge in every way besides actual vomiting -- I don't gain weight easily nowadays though even when consuming copious amounts of calories.)\n\nIdk, I'm ashamed of binging and know that being restrictive is seen as being more \"desirable,\" but by now I feel pretty \\~valid in my ED no matter what my current symptoms are, and I actually feel MORE invalidated when people assume my ED must be fully restrictive or think I'm overexaggerating how bad my binging can be... meanwhile self harming through food I don't even enjoy at all is what's ruining my life. Like no, I don't mean unintentionally finishing a bag of chips while relaxing or eating a lot on vacations, I mean eating so much I physically incapacitate myself b/c I'm so lonely that nothing else fills the void! thank u :)))",
  "url": "https://www.reddit.com/r/bulimia/comments/jv74jd/dae_hate_when_others_assume_their_ed_is_solely/",
  "score": 96,
  "num_comments": 11,
  "comments": [
    {
      "id": "gcigwlc",
      "author": "gaudinockerl",
      "body": "I can relate to you on so many levels. Even professionals tried to undermine my bulimia issues and were like \"but you're still skinny so why does it matter if you eat too much sometimes\". It's exhausting trying to explain it every time.",
      "created_utc": 1605547111.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gcimsy4",
      "author": "ccallista",
      "body": "I feel that. I finally told this friend in school about my ED after being so anxious I thought I needed encouraging words/support and wanted to be honest because she started to point out I was being distant. Instead of the reaction I expected, she said something like I’m exaggerating, describe how much of my daily intake, how to purge, etc she wouldn’t let it go as if I was proud of having ED until finally I said ‘yeah I’m overreacting.’ But she always bring it up after that in a indirect way even when someone’s around like showing me underweight pics, guessing my weight if today goes high or low, asking how many calories is this if I would eat it if I was her, putting her food on my plate, recommended diet, making fun when I order a salad ‘again’, etc it’s driving me nuts. Like her intention isn’t even for me to get better but just her pure curiosity. Now it’s not as often but i literally can’t breathe when it comes up. I never talk to anyone again. I’m glad there’s Reddit.",
      "created_utc": 1605549880.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gcivkah",
      "author": "NutelllaBellla",
      "body": "Personally I feel the opposite. I'm currently underweight and I binge and purge almost every day. I purge through vomiting. And when I'm not binging and purging I'll be water fasting so I won't eat at all. I feel like people notice the binging and purging more, especially my family. It's easier for me to get away with restricting even if I'm underweight, than the bulimia. I think it's because the bulimia makes more of a mess and is more noticeable because copious amounts of food go missing all of a sudden. I definitely agree with you that restricting is seen in a better light, and is more acceptable in our society than bulimia. I try my best to hide my binging and purging but people always notice when I've been doing it.",
      "created_utc": 1605553919.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gcj8w4z",
      "author": "BulletproofTyke",
      "body": "I absolutely detest it when someone tells me that I’m not doing something that I am. Hello, I was fucking THERE! I feel a little strange commenting here as my experience is the reverse of yours, but what I’d like to comment about is being validated in your ED. I try to avoid the “is it ED or is it just attention-seeking” judgement game in general, but personally I think if your eating habits have a negative effect on your life, you have an ED. Your experience is yours and is VALID.\n\nI’ve decided to disregard those who want to invalidate my condition whether it’s that they don’t want me to be sick or they don’t think I’m really committed because I “should be skinnier” if I really had an ED. Fuck those who choose not to accept the reality of your existence. In my limited experience, people who want to help you will listen when you talk and only give advice when you ask. It took me a long time of searching and a painful confrontation as an adult with my mom, but I’ve now got a few contacts in my phone who fit this description.",
      "created_utc": 1605559536.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gcjud5n",
      "author": "None",
      "body": "Yes ... I am suffering from bulimia and binge for almost two years now, I have always been very skinny, genetic. I am so sorry to my body, I am destroying this machine that worked really well. In the past, when I had no problems with food, everyone would always tell me how I was too skinny, anorexic, not healthy etc. etc. How can I hope to be understand now? I just don't speak. it's so hard... Most people don't really want to hear and understand but only to say their non requested opinion",
      "created_utc": 1605568087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcn4pl0",
      "author": "eye_muh_kunt",
      "body": "I can relate to this. I’m very overweight now, but I haven’t always been. I’ve been struggling with cycles of binging/purging and restricting for over 12 years and when I got to my lowest weight I was praised by everyone around me, not knowing that my eating habits were anything but healthy. \n\nI’ve realized now that I have a food addiction. That’s why it’s hard to maintain a healthy diet, because I don’t necessarily eat for fuel, I eat for an intense dopamine hit. While most of the time I binge and often purge (I don’t always purge depending on who is in the house), when I am being “good” I barely eat anything. Even now i am overweight and people still don’t take my eating disorder seriously, they think I’m just lazy or gluttonous, but I really feel like a drug addict waiting for the food to come, eating it in secret and purging in secret",
      "created_utc": 1605641997.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcns4sh",
      "author": "Jealous-Cat-2017",
      "body": "I feel you.. My grandmother knows I binge(but not about the purging) but she still buys me all the foods i binge on and it fucking sucks because it always causes me to binge and that eventually leads to me either purging or punishing myself by cutting... And she always says I could just \"use better portions\" but I don't think she understands what binge eating disorder is... And i can't really get outside help because no one understands... No one can tell i have an eating disorder because I look fucking normal.... And I don't wanna be like this anymore...... It's always hell at home because i can never show any sign of my eating disorder without getting the words \"hog\" or \"just eat something\" and it makes me wanna blast my brains out of my skull because it pisses me off so much....",
      "created_utc": 1605653042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gciiz27",
      "author": "honeycakies",
      "body": "Ikr? Almost every minute of my day is just me exerting a ton of mental energy trying not to binge so I'm too tired to do much else, and if I DO give in, then I still can't function bc it makes me feel as physically and mentally horrible as possible... plus even if I'm \"slim,\" the bloating gets wild and that doesn't help lmfao",
      "created_utc": 1605548086.0,
      "score": 11,
      "context": [
        {
          "id": "gcigwlc",
          "author": "gaudinockerl",
          "body": "I can relate to you on so many levels. Even professionals tried to undermine my bulimia issues and were like \"but you're still skinny so why does it matter if you eat too much sometimes\". It's exhausting trying to explain it every time.",
          "created_utc": 1605547111.0
        }
      ]
    },
    {
      "id": "gcje6ux",
      "author": "honeycakies",
      "body": "Ahh for me, my purging is through exercise, laxatives, and restriction (whenever I manage not to binge), and I don't live with my family so no one really sees how much I eat either way b/c usually I get binge food on my own. Sometimes I binge in front of others, but usually that's at parties or something where people are too drunk to really remember how much others are eating anyway loool",
      "created_utc": 1605561668.0,
      "score": 4,
      "context": [
        {
          "id": "gcivkah",
          "author": "NutelllaBellla",
          "body": "Personally I feel the opposite. I'm currently underweight and I binge and purge almost every day. I purge through vomiting. And when I'm not binging and purging I'll be water fasting so I won't eat at all. I feel like people notice the binging and purging more, especially my family. It's easier for me to get away with restricting even if I'm underweight, than the bulimia. I think it's because the bulimia makes more of a mess and is more noticeable because copious amounts of food go missing all of a sudden. I definitely agree with you that restricting is seen in a better light, and is more acceptable in our society than bulimia. I try my best to hide my binging and purging but people always notice when I've been doing it.",
          "created_utc": 1605553919.0
        }
      ]
    },
    {
      "id": "gcimnnk",
      "author": "gaudinockerl",
      "body": "Sameee. Sometimes I am bloated for days. All the wasted pregnancy tests omg 😂",
      "created_utc": 1605549811.0,
      "score": 5,
      "context": [
        {
          "id": "gcigwlc",
          "author": "gaudinockerl",
          "body": "I can relate to you on so many levels. Even professionals tried to undermine my bulimia issues and were like \"but you're still skinny so why does it matter if you eat too much sometimes\". It's exhausting trying to explain it every time.",
          "created_utc": 1605547111.0
        },
        {
          "id": "gciiz27",
          "author": "honeycakies",
          "body": "Ikr? Almost every minute of my day is just me exerting a ton of mental energy trying not to binge so I'm too tired to do much else, and if I DO give in, then I still can't function bc it makes me feel as physically and mentally horrible as possible... plus even if I'm \"slim,\" the bloating gets wild and that doesn't help lmfao",
          "created_utc": 1605548086.0
        }
      ]
    },
    {
      "id": "gcip08i",
      "author": "honeycakies",
      "body": "LMAO omg 😭😭 one of my biggest motivators to stop binging is that I buy clothes in the wrong size sometimes just because my waist size happens to be  several inches bigger those days...",
      "created_utc": 1605550903.0,
      "score": 4,
      "context": [
        {
          "id": "gcigwlc",
          "author": "gaudinockerl",
          "body": "I can relate to you on so many levels. Even professionals tried to undermine my bulimia issues and were like \"but you're still skinny so why does it matter if you eat too much sometimes\". It's exhausting trying to explain it every time.",
          "created_utc": 1605547111.0
        },
        {
          "id": "gciiz27",
          "author": "honeycakies",
          "body": "Ikr? Almost every minute of my day is just me exerting a ton of mental energy trying not to binge so I'm too tired to do much else, and if I DO give in, then I still can't function bc it makes me feel as physically and mentally horrible as possible... plus even if I'm \"slim,\" the bloating gets wild and that doesn't help lmfao",
          "created_utc": 1605548086.0
        },
        {
          "id": "gcimnnk",
          "author": "gaudinockerl",
          "body": "Sameee. Sometimes I am bloated for days. All the wasted pregnancy tests omg 😂",
          "created_utc": 1605549811.0
        }
      ]
    }
  ]
}