{
  "id": "jveg5f",
  "subreddit": "bulimia",
  "author": "Lrig-Hettik",
  "created_utc": 1605558548.0,
  "title": "i want to be done with this",
  "selftext": "my purge hurt. my entire mouth hurts. i know, even though my health is deteriorating, i know i keep coming back to purging. no matter what. i tell myself this will be the last time, it never is. it sucks. fuck, this sucks.",
  "url": "https://www.reddit.com/r/bulimia/comments/jveg5f/i_want_to_be_done_with_this/",
  "score": 78,
  "num_comments": 8,
  "comments": [
    {
      "id": "gcjfrrq",
      "author": "as_abovee",
      "body": "You’ll get through this, you’re going to be okay. It’ll all work out, it’s going to be painful and take time but you can do this :) good luck for the future, you can do this",
      "created_utc": 1605562279.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gck8voo",
      "author": "thronerbonerz",
      "body": "You can stop. I used to b/p. I hated my life and wanted to stop and I did. I started outpatient treatment and met people who had been in the b/p cycle for 10+ years and all I could think to myself was “10 years....I don’t want to do this for 10 more minutes”. There’s help and support for you. There are good people in the medic field who devote their lives to making you better.",
      "created_utc": 1605574933.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gck2qmm",
      "author": "thomsforke",
      "body": "I feel the same way. We will take this one day at a time x",
      "created_utc": 1605571623.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gck9mxr",
      "author": "Ok_Piano2778",
      "body": "I know exactly how you're feeling I tell myself every time I'm purging that this is the last time I'm not gonna do this again but I always fail and end up binging and purging the next day but I'm trying not to give up cuz I don't have any other choice but trying everyday pls don't give up and give your self a reason to try again tomorrow stay strong \n\nSending u a lot of love and support ♥️",
      "created_utc": 1605575352.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gckflln",
      "author": "ZtoA_Limited",
      "body": "Yes, SO MUCH same. I hate this so much. My current cycle has lasted most of this year. \n\nSometimes I wonder if I can reverse psychology myself because I am so damn stubborn. Like, every time I tell myself “no more!” It triggers more so.....hmmm.",
      "created_utc": 1605578542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gckjkb1",
      "author": "None",
      "body": "You can stop. Trust me, you can. Believe in yourself and know this CAN be the turning point where you start living differently! Live like you're already cured. It's not going to be smooth sailing but in the end you'll be so much better off for it. You can do it! I believe in you!",
      "created_utc": 1605580662.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gckzhwl",
      "author": "ZorBa812",
      "body": "Yo I could’ve written this you’re not alone in recovering!",
      "created_utc": 1605590127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gcjkwv3",
      "author": "Lrig-Hettik",
      "body": "thank you, i needed this honestly",
      "created_utc": 1605564299.0,
      "score": 9,
      "context": [
        {
          "id": "gcjfrrq",
          "author": "as_abovee",
          "body": "You’ll get through this, you’re going to be okay. It’ll all work out, it’s going to be painful and take time but you can do this :) good luck for the future, you can do this",
          "created_utc": 1605562279.0
        }
      ]
    }
  ]
}