{
  "id": "jymg2w",
  "subreddit": "bulimia",
  "author": "ajamaskell",
  "created_utc": 1606006703.0,
  "title": "does anyone know how to make calories less triggering? I cant get past the fact that my whole mood changes if i accidentally see the calories of something. I could want to eat it and then see the cals and immediately not want to and feel sick",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/jymg2w/does_anyone_know_how_to_make_calories_less/",
  "score": 86,
  "num_comments": 8,
  "comments": [
    {
      "id": "gd5dxlp",
      "author": "booklover527",
      "body": "I wish I knew and I wish I could help, but all I can do is be here if you need to talk. This is a hard road but we’re not alone ❤️",
      "created_utc": 1606012369.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gd5udxu",
      "author": "justonium",
      "body": "Idk, for me it's literally just an almost-meaningless number, and I really could hardly care less if my body maybe absorbs some pure caloric weight in pure clean fat and sugar to maybe even get some leeway for going without as much of some of the other more toxic things.\n\nMuch more important for me is how bad and heavy and out of control the food makes me feel",
      "created_utc": 1606020080.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gd5w0gs",
      "author": "freetobethegreatest_",
      "body": "Just to preface this, everyone is different. For me I started facing them more. Letting myself see them and then talking myself through accepting the amount and tuning in to the fear around it. I still somewhat get activated by calories but now I know how to take myself through the feelings.",
      "created_utc": 1606020695.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gd64uc3",
      "author": "Muckl3t",
      "body": "For me it was just understanding them better. I used to think eating 500 cal would make me super fat and I’d have to get on a treadmill and burn 500 to even it out. That felt impossible most of the time so I’d throw up instead. My mind was blown when I learned how many calories a sedentary body burns during the day. You need to consume a fair amount just to keep up with your body’s natural processes so there’s simply nothing to fear until you exceed your tdee.  And even then, you’d need to exceed it a significant amount on a regular basis to have a negative impact on your body. Going over one day doesn’t matter at all.",
      "created_utc": 1606024082.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gd6ld2c",
      "author": "bobakittens",
      "body": "I'm just going to say that even after 4 years of recovery, calories still get to me. I try to focus more on the nutrients and tell myself that it is okay because I'm not going to be able to eat again for another 4 or more hours anyway and I need the calories to make it to the end of my shift.\n\nI tend to forget to eat on my days off (I only eat 1 meal) so I also let myself eat more on my work days because I have a consistent schedule to remind me when to eat.",
      "created_utc": 1606030908.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gd7705k",
      "author": "None",
      "body": "I'm sorry but I don't have a solution to this either. I have been trying different things throughout recovery, and the only thing that seems to work for me is to alternate between undereating and bulking+exercise. That gave me the longest periods without purging, but it's still highly related to calories, as I have to undereat or overeat. \n\nIf you can, eat out or ask someone to make food for you, so you don't know the amount of calories, and use other indicators to make you feel better. Feeling less light-headed is definitely a motivation to eat for me, as well as being able to lift heavier weights.",
      "created_utc": 1606041049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gd64ccx",
      "author": "BMI_Computron",
      "body": "This was part of what helped me. There was a point where I realized that I was still allowing those numbers to have power. That I would have to work through it until I didn't have an immediate loss of appetite from seeing them. I think exposure to calories has helped them become part of the background instead of being something I had to actively avoid.\n\nI also had to work on the mindset that an over/under on a certain amount of calories is what made a food \"bad\" or \"good\". That eased up so much once I started cooking/baking almost all of my foods from scratch. The process of creating the things that I'm eating gives me a lot of peace. :)",
      "created_utc": 1606023892.0,
      "score": 3,
      "context": [
        {
          "id": "gd5w0gs",
          "author": "freetobethegreatest_",
          "body": "Just to preface this, everyone is different. For me I started facing them more. Letting myself see them and then talking myself through accepting the amount and tuning in to the fear around it. I still somewhat get activated by calories but now I know how to take myself through the feelings.",
          "created_utc": 1606020695.0
        }
      ]
    },
    {
      "id": "gd8bibm",
      "author": "ajamaskell",
      "body": "yes i totally agree. When i cook and bake my own food it is SO much easier to eat",
      "created_utc": 1606062074.0,
      "score": 2,
      "context": [
        {
          "id": "gd5w0gs",
          "author": "freetobethegreatest_",
          "body": "Just to preface this, everyone is different. For me I started facing them more. Letting myself see them and then talking myself through accepting the amount and tuning in to the fear around it. I still somewhat get activated by calories but now I know how to take myself through the feelings.",
          "created_utc": 1606020695.0
        },
        {
          "id": "gd64ccx",
          "author": "BMI_Computron",
          "body": "This was part of what helped me. There was a point where I realized that I was still allowing those numbers to have power. That I would have to work through it until I didn't have an immediate loss of appetite from seeing them. I think exposure to calories has helped them become part of the background instead of being something I had to actively avoid.\n\nI also had to work on the mindset that an over/under on a certain amount of calories is what made a food \"bad\" or \"good\". That eased up so much once I started cooking/baking almost all of my foods from scratch. The process of creating the things that I'm eating gives me a lot of peace. :)",
          "created_utc": 1606023892.0
        }
      ]
    }
  ]
}