{
  "id": "k1gv7w",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1606403664.0,
  "title": "i'm a bulimic with emetophobia...... sorry but what the fuck?",
  "selftext": "me throwing up my guts after a binge? i rinse out my mouth, jump in the shower and get on with my day. seeing someone nearby me vomiting or watching it happen in tv shows and movies? my worst nightmare.\n\nLOOOOOOL how is that even possible !!!! i don't get it",
  "url": "https://www.reddit.com/r/bulimia/comments/k1gv7w/im_a_bulimic_with_emetophobia_sorry_but_what_the/",
  "score": 114,
  "num_comments": 11,
  "comments": [
    {
      "id": "gdo9ogw",
      "author": "JetPatriot",
      "body": "No one likes anyone else throwing up.  It is awful.  But you get something from your own behaviour.",
      "created_utc": 1606407027.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gdok5r3",
      "author": "cherrycrocs",
      "body": "i don’t actually have bulimia, i have BED/EDNOS and i usually just lurk here, but i do have emetophobia that has literally ruined so much of my life.  i literally will have nausea from a virus or some other reason and fight it off for hours, yet the amount of times i’ve been extremely close to purging after a binge is ridiculous.  i haven’t thrown up in YEARS as of right now, but i’ve been willing to risk it all over some food countless times.",
      "created_utc": 1606412578.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gdoizy5",
      "author": "rrrachel_rocks",
      "body": "As a kid, before bulimia, I was totally this way. Wouldn’t ride roller coasters if it looked like someone was going to puke, etc. It eventually wore off but agree with PP, anyone else’s barf is disgusting for the most part.",
      "created_utc": 1606411957.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdp1v26",
      "author": "allthatjuicy",
      "body": "Same here can’t be near anyone else doing it without having a panic attack but I purge every single day lol",
      "created_utc": 1606420408.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdq32aj",
      "author": "Razzboe",
      "body": "Life is a mirror. What we cannot accept in others is exactly the same thing we cannot see and accept in ourselves.",
      "created_utc": 1606441763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdse0dc",
      "author": "withonlygrace",
      "body": "I actually developed emeto from my bulimia. I used to purge several times a day, no problem, but then I had an insane anxiety attack one night while purging that conditioned me to have intense fear and anxiety every time I purged afterwards. I do think anyone else vomiting is disgusting, which it is, but it’s also triggering for my ED because I’m like, how come they can do it and I can’t.",
      "created_utc": 1606501457.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdpvl8e",
      "author": "danimarie82",
      "body": "I am the same way. I also hate being nauseous/involuntarily throwing up. You would think that would be easier, but nope. I think it's a control thing and while self induced vomiting isn't fun either, at least I don't have that nauseous feeling beforehand. I don't know, EDs are super weird!",
      "created_utc": 1606436904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdq8tc6",
      "author": "elacatz",
      "body": "i’m the same!!! emetophobia ruled my life for years but now i purge. i don’t know how i’d deal with getting an illness now since that’s out of my control but i know i handle purging just fine. but if i were to see someone else throw up (it hasn’t happened since i started purging) i feel like i’d still freak out. i just wanna know how i went from being petrified of throwing up for years (even at one point to the point where i couldn’t eat or sleep not even ED related) to making myself do it.",
      "created_utc": 1606445578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gg1u83l",
      "author": "constipated_cats",
      "body": "Def is possible. I’ve had eating disorder problems but no matter what I refuse to binge no matter how terrible I feel and want to. I’m okay with me throwing up, I do cry and get all panicky. I prefer not to and will try not to. but when someone else throws up my flight (there is no fight because I ain’t sticking around) response kicks in and my heart races and my hands get all shaky. It makes no sense to me either. For me, I absolutely do not like other people’s germs. So that could be a possibility, esp if you also don’t like blood, spit, urine, etc.",
      "created_utc": 1608140585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdogn1e",
      "author": "None",
      "body": "yeah you're right! it's just strange to me personally because i've had this fear since i was kid and couldn't ever throw up but then my ED developed and i was suddenly ok with me doing it lol",
      "created_utc": 1606410688.0,
      "score": 5,
      "context": [
        {
          "id": "gdo9ogw",
          "author": "JetPatriot",
          "body": "No one likes anyone else throwing up.  It is awful.  But you get something from your own behaviour.",
          "created_utc": 1606407027.0
        }
      ]
    },
    {
      "id": "l4367la",
      "author": "scorpiomars17",
      "body": "How did you get the courage to start purging? I know this is late but im being consumed by my emetophobia. I feel like if I did it once and taught myself I'd be ok . It could change my life for the better.",
      "created_utc": 1715733964.0,
      "score": 1,
      "context": [
        {
          "id": "gdq8tc6",
          "author": "elacatz",
          "body": "i’m the same!!! emetophobia ruled my life for years but now i purge. i don’t know how i’d deal with getting an illness now since that’s out of my control but i know i handle purging just fine. but if i were to see someone else throw up (it hasn’t happened since i started purging) i feel like i’d still freak out. i just wanna know how i went from being petrified of throwing up for years (even at one point to the point where i couldn’t eat or sleep not even ED related) to making myself do it.",
          "created_utc": 1606445578.0
        }
      ]
    }
  ]
}