{
  "id": "k31hxs",
  "subreddit": "bulimia",
  "author": "Throwaway2045947",
  "created_utc": 1606618050.0,
  "title": "Im feeling like purging any time my stomach is full",
  "selftext": "I cant stand the feeling any time im full. Even just drinking a good amount of water makes me feel like purging it all out. It would be nice if i could just drink and not feel this way.",
  "url": "https://www.reddit.com/r/bulimia/comments/k31hxs/im_feeling_like_purging_any_time_my_stomach_is/",
  "score": 73,
  "num_comments": 6,
  "comments": [
    {
      "id": "gdyvtle",
      "author": "depressedskeleton02",
      "body": "Yeah sameeee. It’s very hard for me to drink large (or sometimes even any) amounts of liquid because if I start to feel even slightly bloated or full I wanna purge. Same with food. 😕",
      "created_utc": 1606618569.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gdz8833",
      "author": "cetaceansituation",
      "body": "It's sad and comforting to know that I'm not alone in this. Unless I have access to a bathroom or am home, I won't even really drink water. It was weird explaining to my team when I was in recovery that \"literally being able to feel anything in my stomach at all sends me into a [dissociative state of anxiety]\" and even weirder having to explain that to a blessedly supportive friend when I came home. I wish I could offer some advice, but hopefully knowing you're not alone can offer some solace. People have gotten past this before, so there is hope for us yet.",
      "created_utc": 1606625379.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ge0ajpe",
      "author": "None",
      "body": "I feel very uncomfortable with that feeling as well. Feeling full is such a bad feeling for me i feel almost unsafe? Does that make sense...almost like a i absolutely have to purge or else! i’m sorry you feel like this...its horrible :(",
      "created_utc": 1606643466.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ge2r08o",
      "author": "etisfather",
      "body": "literally me right now. i’m so bloated and my first instinct is to purge, but there’s nothing even in me yet. i’ve convinced myself that any bloating of any kind is actual weight gain and i want it out of me",
      "created_utc": 1606681230.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ge0tmcs",
      "author": "None",
      "body": "I feel exactly the same way.",
      "created_utc": 1606652671.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge3zga0",
      "author": "saraarcher",
      "body": "yes i completely understand especially about the part of not feeling safe. i get loads of anxiety when i feel full/bloated after a meal.",
      "created_utc": 1606704343.0,
      "score": 1,
      "context": [
        {
          "id": "ge0ajpe",
          "author": "None",
          "body": "I feel very uncomfortable with that feeling as well. Feeling full is such a bad feeling for me i feel almost unsafe? Does that make sense...almost like a i absolutely have to purge or else! i’m sorry you feel like this...its horrible :(",
          "created_utc": 1606643466.0
        }
      ]
    }
  ]
}