{
  "id": "k3beff",
  "subreddit": "bulimia",
  "author": "maduhlinn",
  "created_utc": 1606664514.0,
  "title": "“Wow you look so good!” but for the wrong reasons....",
  "selftext": "...people complimenting you on your weight loss when you KNOW it only happened because you are destroying your gut. I had a surge in my purging 2 years ago where I must have lost 50-60 pounds in a matter of a months from binge purge cycles alone while away for college. I had no idea, I still saw myself as “big.” Returning home for a family wedding was a wake up call. People who I had not seen in months showered me with compliments and searched for answers to how I got so thin. It was confusing... I felt shame for treating my body so poorly but a slight feel of accomplishment knowing I did what I wanted without anyone noticing; to be smaller in other’s eyes. This was the kick that made me really get into self awareness and recovery. Also I gained an awareness of just how much (women in particular) people comment on other people’s bodies. I make an effort to compliment people now on their personalities and actions. I think those compliments last longer. \n\nThought opinions personal stories?",
  "url": "https://www.reddit.com/r/bulimia/comments/k3beff/wow_you_look_so_good_but_for_the_wrong_reasons/",
  "score": 150,
  "num_comments": 10,
  "comments": [
    {
      "id": "ge1qshc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606665943.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ge1sjed",
      "author": "bombusblue",
      "body": "I totally relate to this; the fact is the people commenting on the weight loss don't even realise that their comments are just reinforcing the behaviours and it creates this toxic loop that nobody can break out of.\n\nThis is slightly unrelated but there is new advice on how we should compliment young girls. For example, you're less likely to compliment a young boy's outfit/hair as soon as you see them, so why say it to a girl? You should compliment what they have achieved and what they like and only compliment their clothes if they bring it up or later on because it stresses that what they look like isn't the most important thing about them; their actions and achievements are. I know it's only a little step and I dont know how many people are utelising this concept but it is a step in the right direcetion :)",
      "created_utc": 1606666560.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ge1rmqp",
      "author": "666-fps",
      "body": "I am bombarded almost constantly with comments like this. My coworkers, friends, people who work at stores that I go to every month or so. Congratulations and praise about how much weight I've lost and how good I look, how healthy I look. Of course, I don't blame a single one of them in any way, they have no idea what's happening. But it's always odd for me, that's the only word I can think of to describe how I feel. I know what I'm doing - and what I'm not doing - is bad and is hurting me. But with so much praise and love and attention, how can we resist the temptation? Finally, someone is acknowledging my body in a positive light. I'm so pretty! I'm so thin! And I know exactly how I got here; all my hard work is paying off. It's making it feel worth it, to torture myself and hurt myself. The damage my ED is doing isn't even part of the equation anymore; I just don't care. \n\nI think going out of your way to focus on the actions of people and compliment those is absolutely the right thing to do, try to shift the focus from physical things to just the way people are. Hopefully if we put that energy out, it will come back our way. Sorry for rambling, but the incessant comments about my body are both an enormous blessing and an awful curse. You are not by yourself in this. None of us are.",
      "created_utc": 1606666239.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ge2zvda",
      "author": "lunaelliott4",
      "body": "What i would hate worse than that was then being asked, so what's your secret ?? How did u get so skinny? And im like uuuuh.....",
      "created_utc": 1606685230.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ge2joa6",
      "author": "fairybee5642",
      "body": "I recovered 4 years ago and did gain (I needed to). I was so malnourished with bulimia looked so sick. My hair was thin, my skin was so gray, my bones hurt, and I looked so old. I'm a legit healthy weight now (like 19 bmi) and was able to undo some of the damage. But damn...I still get comments from those who knew me then on why I gained weight, especially older men. I've learned to make it uncomfortable for them and directly say bulimia. Shuts that down real quick. I hate how society doesn't know what healthy looks like.",
      "created_utc": 1606678911.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ge32kob",
      "author": "o_elaine_g",
      "body": "i get angry in a sense because of what i did to get to a point where i finally am small enough to have more worth to other people. i feel validated but then they’ll tell me you look so good and then tell me i need to eat more or something like that and it makes me so angry because when i was comfortable eating, i’d be told i had a big gut to eat all that food and now you want me to eat? i hate the sight of food now",
      "created_utc": 1606686559.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge3aubh",
      "author": "against_underscores",
      "body": "All of this! \n\nAnd can I add, relatives and friends asking you how you lost so much weight and not leaving it alone even though you're clearly trying to dodge the question and not become visibly upset??",
      "created_utc": 1606690796.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggm5jnb",
      "author": "manicpanicbp",
      "body": "i felt this. when i started recovering but i was still underweight my friend told me “at least your skinny” we were at a party, drunk off our asses, and i was complaining why no one likes me. she was telling me that it did not matter because of how beautiful i was (only because i was skinny) and i’ll never forget it. i knew my underweight body would not last and soon enough i would go back to my “healthy” weight and be seen as ugly. now i’m back to my starting weight and i feel awful idk how to feel beautiful again without loosing weight",
      "created_utc": 1608579073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge53lfe",
      "author": "LittleMissCosmic1992",
      "body": "This is why I never comment on anyone's body and wish people would stop too. It's so ingrained in us though.",
      "created_utc": 1606738048.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge5ulsm",
      "author": "sammylynbutred",
      "body": "Same... My parents and other people around me tell me I’m fat right now and not healthy (even though all my exams show that my body is healthy) and compare me back to the days when bulimia was almost killing me. It hurts so much, because I was not healthy at all back then, and I am healthy and happier now but it’s just not enough for them.",
      "created_utc": 1606754777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge29qg0",
      "author": "ZtoA_Limited",
      "body": "Dude saaaaame. I am destroying myself and almost visibly underweight even through clothing (14ish BMI), yet get so many compliments from strangers :( wtf.",
      "created_utc": 1606674379.0,
      "score": 15,
      "context": [
        {
          "id": "ge1qshc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606665943.0
        }
      ]
    }
  ]
}