{
  "id": "k4dsy1",
  "subreddit": "bulimia",
  "author": "CuteConclusion6837",
  "created_utc": 1606797606.0,
  "title": "Small goals",
  "selftext": "I have officially not purged for 2 weeks!!! For anyone feeling defeated by your ED, which I went through at the beginning of this month, set small goals for yourself and when you reach them, you’ll feel happy and proud of yourself. YOU GOT THIS!!",
  "url": "https://www.reddit.com/r/bulimia/comments/k4dsy1/small_goals/",
  "score": 77,
  "num_comments": 7,
  "comments": [
    {
      "id": "ge8wtk2",
      "author": "None",
      "body": "Small goals so simple but didn’t think about that, I’ve always been like this time is the good one. Two weeks will do it ((: \nProud of you, you’ve got this far and I know you do great! 💜",
      "created_utc": 1606818349.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ge930ct",
      "author": "KoffeeWater",
      "body": "i’m so proud of you! good job that’s so incredible :> that’s such an amazing accomplishment. i’m on day 1 of my streak and it honestly feels great since i’ve been doing it everyday for 3 months now but now i’m taking control. keep going you got this!❤️",
      "created_utc": 1606824734.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge98zhz",
      "author": "None",
      "body": "I am SO proud of you and vicariously happy. Well done you! You are amazing and loving proof that ED does not have to control any of us. \n\nYesterday I binged and had to sit with the feeling of wanting to undo it but made it through. Success in this recovery doesn’t mean feeling good, it means accomplishing that goal in that moment.",
      "created_utc": 1606829488.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge9qqfg",
      "author": "TrooperJordan",
      "body": "I'm on day 2 and honestly this is the longest time in like 5+ years. I hope I'm on week 2 in a couple weeks like you. Small goals for the win",
      "created_utc": 1606839305.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge9jqj5",
      "author": "None",
      "body": "I am almost at two weeks!  Its super hard for me to go more than a week but I am so excited and happy to see you doing well!",
      "created_utc": 1606835831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gechukl",
      "author": "against_underscores",
      "body": "That's wonderful! And thank you for encouraging others! :)",
      "created_utc": 1606892724.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geaqdh5",
      "author": "CuteConclusion6837",
      "body": "Y’all are amazing and so nice. I was thinking of having a binge rn but I read all of your comments and it made me feel so much better and I refuse to do it now. Thank you!! I hope all of you reach your small and big goals💕",
      "created_utc": 1606856053.0,
      "score": 1,
      "context": []
    }
  ]
}