{
  "id": "k4mpcy",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1606835651.0,
  "title": "Purging into a paper bag ****GROSS****",
  "selftext": "So Ive been throwing up into bags for years now and never once was I stupid enough to purge into a paper bag, well last night I guess I forgot what wet+paper does...\n\nI woke up at 4 am purged in the closest bag next to me (a PAPER TAKEOUT BAG) and this morning while picking it up to throw away- the entire bottom fell out and leaving my floor covered in vomit.\n\nNever again\n\nNow I have to decide if I should tell my therapist or not",
  "url": "https://www.reddit.com/r/bulimia/comments/k4mpcy/purging_into_a_paper_bag_gross/",
  "score": 99,
  "num_comments": 8,
  "comments": [
    {
      "id": "geaaz0b",
      "author": "None",
      "body": "Always tell your therapist. That’s what they’re paid for ;)",
      "created_utc": 1606848924.0,
      "score": 31,
      "context": []
    },
    {
      "id": "geatr3e",
      "author": "None",
      "body": "Not everyone’s lucky enough to have a therapist, make the most of them if you have one.",
      "created_utc": 1606857663.0,
      "score": 14,
      "context": []
    },
    {
      "id": "geaxaaz",
      "author": "a-dog-named-crab",
      "body": "Tell your therapist! Otherwise it’ll just go back into the shame cycle. \n\nAlso, solidarity. Once years ago I purged into a bag and put it in my closet to throw away later. But my dog found it and dragged it around, tore it up, total mess. Then my parents found the mess. Lesson learned.",
      "created_utc": 1606859324.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gear52d",
      "author": "elacatz",
      "body": "i definitely think you should open up to your therapist about this. they’re here to listen to us!!💖",
      "created_utc": 1606856408.0,
      "score": 7,
      "context": []
    },
    {
      "id": "geb2cdn",
      "author": "flashmajora",
      "body": "Me when I get fast food and eat it in my car and there’s nothing else around",
      "created_utc": 1606861763.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gebtog9",
      "author": "None",
      "body": "if you don’t talk to your therapist you’ll need to talk to your mom about getting that stain out.",
      "created_utc": 1606876604.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gebcxqd",
      "author": "gracexsteele",
      "body": "i would 100% say something. they can help, i know it's scary but the best decision i ever made was telling my therapist",
      "created_utc": 1606867300.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geb6rl7",
      "author": "NoelleDash",
      "body": "I always lined a shoebox with a plastic bag. \n\nIf you have not done the paper bag thing in a while I think you should at *least* try to figure out with your therapist what is making you feel the way you used to feel when you used to do the paper bag thing. \n\nThere's a reason why we resort to old behaviors out of no where.",
      "created_utc": 1606863996.0,
      "score": 2,
      "context": []
    }
  ]
}