{
  "id": "k4uaqc",
  "subreddit": "bulimia",
  "author": "cetaceansituation",
  "created_utc": 1606857302.0,
  "title": "I'm a little irritated. Here's why:",
  "selftext": "A few days ago someone posted on here about the struggle with their father with bulimia.\n\nThey received supportive, comforting, sympathetic replies. Much to be expected from a community that is understanding of the struggles on both sides of families that are or have been impacted by eating disorders.\n\nI offered up some potential insights, under the disclaimer that I didn't know their dad and could be wrong, but basing my two-cents on what I have observed to be the case for the overwhelming majority. I've been on both sides of an eating disorder. I've said things I wish I could take back. I've ruined friendships, scarred family relationships, and my eating disorder continues to gouge chunks out of my life. We struggle, we endure, we STRUGGLE to endure, and we do what we can to help people find the light in dark spaces. That's one of the reasons I love forums such as this, though I've been largely silent in the past.\n\nThey responded that I was wrong and that I just didn't get their dad. Okay, that's totally fine. I knew I could be wrong!\n\nExcept for this:\n\n\"If I'm being honest my posting here isnt out of love, it's to find a way for him to stop wasting food and wasting the time of doctors cause it's really annoying hearing him yell at my mom to make him something to eat only to vomit it out and complain about wondering what's wrong with him.\"\n\nI'm sorry, what now? Do you mean to say you came to a forum full of bulimics, many of whom suffer INCREDIBLE guilt for our behaviors, but you don't actually want help -possibly- understanding why your \"loved\" one is dismissive, combative, and defiant? I definitely didn't do a good job addressing why they may be combative, but I could have....if you hadn't essentially just said you weren't posting because you actually cared. Please, let us give you support and advice so you can just throw our behaviors back at us....\n\nWhat I'm getting at, and not doing as well at putting into words as I'd like to, is that all that did was validate something that I (and others on here) struggle with: I am a burden on my friends/family/loved ones. \n\nBRO, YOU'RE WORKING IN A CIRCLE HERE! You want your dad to stop, but you don't want to offer love or support which, frankly, is your best chance at getting it to stop. You've already decided that you definitely know the motives and thoughts of your father except if we know anything about eating disorders it's that the sufferer is going to (consciously or not) make sure you actually don't. These disorders need a facade in order to thrive. We build walls. You see what we want you to see. Until there's enough trust for us to start taking those walls down, you have no real idea what's behind them. But you won't do that because you think you already know....and the cycle continues.\n\nOne of my biggest issues when I was in res was about leaving. When you're in a controlled environment with people who GET it, steps towards recovery are much easier. I was shit scared about leaving because I know the world is full of people like this poster who truly *think* they get it, but have no.freaking.idea. My dad's first mealtime remark when I got home was \"You're going to eat ALL THAT!?\" about my planned-by-a-goddamn-dietician dinner, but I digress. Point being, once again, that people presume to understand eating disorders, as an umbrella (which is a misconception on its own).\n\nI said on a different subreddit that trying to explain an eating disorder to someone who has never had one is like trying to explain colors to someone who was born blind. I also pointed out that their feelings are not more important than ours, but that they are AS important. Both sides are going to have to swallow their pride at some point, if neither is going to pack up and run (which, I should note, is also a fear of ours). The thing is, they aren't in a situation where they need support to overcome something....so the pride swallowing sometimes has to start with them.\n\nAnyway, I've rambled longer than I intended to, but I needed to get that out.",
  "url": "https://www.reddit.com/r/bulimia/comments/k4uaqc/im_a_little_irritated_heres_why/",
  "score": 123,
  "num_comments": 16,
  "comments": [
    {
      "id": "gebe87b",
      "author": "shortcakefordinner",
      "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
      "created_utc": 1606868019.0,
      "score": 38,
      "context": []
    },
    {
      "id": "gebt5a0",
      "author": "fakeplasticturnips",
      "body": "It’s incredibly frustrating and disappointing that people simply do not understand eating disorders and worse still they’re the butt of the joke in mainstream media which doesn’t help one little bit - Family Guy is shocking for it just to name one. \n\nI hear your frustration and I get it. It makes me think of when I replied to a comment from a guy who’s Flatmate was eating his food and he suspected she had an ED. I asked him to have some compassion for her obvious binge eating disorder, used the alcoholic analogy and suggested he talk to her because it could potentially help her or at least set some boundaries. I got 1 award from someone who obviously got it and another person telling me it’s a load of shit the girl would be feeling shame because otherwise she wouldn’t be eating his food in the first place. \n\nOh. My. God. \n\nPeople REALLY don’t get it. And they probably won’t unless they’ve been in our skin.",
      "created_utc": 1606876318.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gebbfum",
      "author": "FattierBrisket",
      "body": "Thank you. I'm struggling with how best to help my sister out of a relapse right now, and I definitely needed to hear some of the things you said. Will save this post and refer back to it.",
      "created_utc": 1606866478.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gecxgi3",
      "author": "SnoozingAndLosing",
      "body": "I feel this. The number of times I've been met with anger and disgust just made me spiral more. Once my dad just said \"just give her a vomit bucket so she doesn't fuck up the toilet anymore\" and that still hurts to this day even though it was years ago. I never talk about my eating disorder to friends and loved ones because it's impossible to explain and I am ashamed. I dont need outside shaming on top of that. Recovery is a lengthy process that I'm still in the beginning despite years of trying. Someone posting shaming - of someone they love - on a forum designed for support is really triggering and ignorant. I'm glad I didn't see that post first hand.",
      "created_utc": 1606908571.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gebkg6n",
      "author": "victoriousbbyg",
      "body": "I remember this post and the person sounded like they were not really caring that much or being mindful of the actual people in this sub. It was (to me) the post of someone so young their brain is not fully formed so they are unable to see the world as not just revolving around them. \n\nThis is why I dislike the various “destigmatising” mental health days. They focus on depression and anxiety. Eating disorders and things like OCD are still joked about. And don’t even start on any kind of psychotic illness. BPD? Forget it. People only want to understand the diagnoses they can relate to. It’s shit and I’ve copped so much flack over the years for posting openly (on Facebook back in the day) about my struggles. I had some bitch tell me I wasn’t sick I was just eating healthy the night before I went into an inpatient program. Friends making jokes about “just throwing up” after they ate a large meal. One time even my siblings and I made a three course meal for our mother’s birthday and each did a course. One of my siblings did a shit job of washing their hands and the basin after breading some chicken. My father promptly came out and asked if I had “chucked up in the sink” in front of our dinner guests. Without experiencing it, people will never understand and they don’t want to. Their privilege allows them to ignore us and use our illness as a joke when it suits them. Every one of them can get fucked.",
      "created_utc": 1606871475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geda6tn",
      "author": "xiggypop",
      "body": "Damn my guy, keep preaching 👏👏",
      "created_utc": 1606917884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geca0pf",
      "author": "cetaceansituation",
      "body": "It's very sad, but true. I like to think that I can come out of those situations being more aware and better able to handle a predicament where I'm on the other side.",
      "created_utc": 1606886534.0,
      "score": 6,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        }
      ]
    },
    {
      "id": "gebozhs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606874001.0,
      "score": 7,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        }
      ]
    },
    {
      "id": "geh6hl8",
      "author": "rikkitikkitavi888",
      "body": "A lot of people around you when you have an eating disorder gaslight you to the hilt... they make themselves the victim yet hello you are the parent?!? narcissistic personality disorder",
      "created_utc": 1606994805.0,
      "score": 1,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        }
      ]
    },
    {
      "id": "gecb4k4",
      "author": "cetaceansituation",
      "body": "Yeah, that's a pretty classic example of not being able to teach someone who thinks they already know it all.... dagnabbit, that really does piss me off.\n\nDefinitely back in the 90's, early 00's the eating disorder remarks in pop culture were pretty insensitive by today's standards. I think at that time there was still a lot of learning to be done. Until Karen Carpenter died in the 80's, from what I understand, eating disorders weren't really on many people's radar and a lot of what they thought they knew about them has since been disproved or required extreme expanding upon.\n\nThankfully, I haven't seen many offensive pop culture depictions in quite some time. I'd venture to say the offensive ones I can think of only come from shows like Family Guy and South Park and, don't get me wrong because I love those shows, but they ARE kind of offensive by nature haha. They definitely don't help teach people anything useful, though.",
      "created_utc": 1606887328.0,
      "score": 2,
      "context": [
        {
          "id": "gebt5a0",
          "author": "fakeplasticturnips",
          "body": "It’s incredibly frustrating and disappointing that people simply do not understand eating disorders and worse still they’re the butt of the joke in mainstream media which doesn’t help one little bit - Family Guy is shocking for it just to name one. \n\nI hear your frustration and I get it. It makes me think of when I replied to a comment from a guy who’s Flatmate was eating his food and he suspected she had an ED. I asked him to have some compassion for her obvious binge eating disorder, used the alcoholic analogy and suggested he talk to her because it could potentially help her or at least set some boundaries. I got 1 award from someone who obviously got it and another person telling me it’s a load of shit the girl would be feeling shame because otherwise she wouldn’t be eating his food in the first place. \n\nOh. My. God. \n\nPeople REALLY don’t get it. And they probably won’t unless they’ve been in our skin.",
          "created_utc": 1606876318.0
        }
      ]
    },
    {
      "id": "gecacuh",
      "author": "cetaceansituation",
      "body": "Thank you SO MUCH for doing your research on how best to handle supporting her. I hope my post didn't come across as lacking compassion for people watching their loved ones struggle and I really do praise anyone who is willing to put in the time and effort to be that support system; I know it's one ugly hell of a ride for you, too. \n\nI hope your sister finds her footholds. Just remember that recovery isn't linear and just because she slips up (or even seems like or is fully relapsing) it doesn't mean she isn't still on the road to recovery. Your support of her really will make a big difference ❤",
      "created_utc": 1606886774.0,
      "score": 2,
      "context": [
        {
          "id": "gebbfum",
          "author": "FattierBrisket",
          "body": "Thank you. I'm struggling with how best to help my sister out of a relapse right now, and I definitely needed to hear some of the things you said. Will save this post and refer back to it.",
          "created_utc": 1606866478.0
        }
      ]
    },
    {
      "id": "geczksx",
      "author": "shortcakefordinner",
      "body": "i wasn’t talking about him, i was talking about how people around us like to victimize themselves when they find out we have an eating disorder.",
      "created_utc": 1606910663.0,
      "score": 4,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        },
        {
          "id": "gebozhs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606874001.0
        }
      ]
    },
    {
      "id": "gehb3oo",
      "author": "shortcakefordinner",
      "body": "i don’t know if you’re agreeing with me or not but i was saying that people who don’t actually have the eating disorder tend to victimize themselves and guilt trip you",
      "created_utc": 1606999116.0,
      "score": 2,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        },
        {
          "id": "geh6hl8",
          "author": "rikkitikkitavi888",
          "body": "A lot of people around you when you have an eating disorder gaslight you to the hilt... they make themselves the victim yet hello you are the parent?!? narcissistic personality disorder",
          "created_utc": 1606994805.0
        }
      ]
    },
    {
      "id": "geewdth",
      "author": "fakeplasticturnips",
      "body": "You’re right. The tv shows I’m thinking of ARE offensive by nature but shows like South Park (which I too enjoy) still managed to discuss depression in a way that offer some insight. I just don’t see the same for ED’s at all. \n\nI find it really disappointing this generation is so open and educated about mental health / gender and sexuality and yet ED’s are still buried deep under the metaphorical rug. Maybe they’re not as ‘sexy’ as their counterparts...? Does that make sense? Something about that idea makes sense to me but I’m not entirely tied to it. I’m thinking about a bunch of movies I’ve watched recently - rockstars with drug addictions, salacious news stories of a trans women who was a former football coach, stories of comedians with bipolar / depression, reality tv about addictions. \n\nPerhaps it come from having worked in a rehab and being exposed to lots of people with addictions/ED’s. I’m obviously looking with a biased opinion and this is a huge generalisation but there was almost a hierarchy of interesting with drug addicted patients being at the top followed by sex/alcohol and all the way at the bottom gambling and EDs.",
      "created_utc": 1606942281.0,
      "score": 2,
      "context": [
        {
          "id": "gebt5a0",
          "author": "fakeplasticturnips",
          "body": "It’s incredibly frustrating and disappointing that people simply do not understand eating disorders and worse still they’re the butt of the joke in mainstream media which doesn’t help one little bit - Family Guy is shocking for it just to name one. \n\nI hear your frustration and I get it. It makes me think of when I replied to a comment from a guy who’s Flatmate was eating his food and he suspected she had an ED. I asked him to have some compassion for her obvious binge eating disorder, used the alcoholic analogy and suggested he talk to her because it could potentially help her or at least set some boundaries. I got 1 award from someone who obviously got it and another person telling me it’s a load of shit the girl would be feeling shame because otherwise she wouldn’t be eating his food in the first place. \n\nOh. My. God. \n\nPeople REALLY don’t get it. And they probably won’t unless they’ve been in our skin.",
          "created_utc": 1606876318.0
        },
        {
          "id": "gecb4k4",
          "author": "cetaceansituation",
          "body": "Yeah, that's a pretty classic example of not being able to teach someone who thinks they already know it all.... dagnabbit, that really does piss me off.\n\nDefinitely back in the 90's, early 00's the eating disorder remarks in pop culture were pretty insensitive by today's standards. I think at that time there was still a lot of learning to be done. Until Karen Carpenter died in the 80's, from what I understand, eating disorders weren't really on many people's radar and a lot of what they thought they knew about them has since been disproved or required extreme expanding upon.\n\nThankfully, I haven't seen many offensive pop culture depictions in quite some time. I'd venture to say the offensive ones I can think of only come from shows like Family Guy and South Park and, don't get me wrong because I love those shows, but they ARE kind of offensive by nature haha. They definitely don't help teach people anything useful, though.",
          "created_utc": 1606887328.0
        }
      ]
    },
    {
      "id": "gehiu8x",
      "author": "rikkitikkitavi888",
      "body": "Hey hey hey No hostility",
      "created_utc": 1607004534.0,
      "score": 1,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        },
        {
          "id": "geh6hl8",
          "author": "rikkitikkitavi888",
          "body": "A lot of people around you when you have an eating disorder gaslight you to the hilt... they make themselves the victim yet hello you are the parent?!? narcissistic personality disorder",
          "created_utc": 1606994805.0
        },
        {
          "id": "gehb3oo",
          "author": "shortcakefordinner",
          "body": "i don’t know if you’re agreeing with me or not but i was saying that people who don’t actually have the eating disorder tend to victimize themselves and guilt trip you",
          "created_utc": 1606999116.0
        }
      ]
    },
    {
      "id": "gegu9kq",
      "author": "cetaceansituation",
      "body": "These are all excellent points. \n\nI'd never even thought about a hierarchy of mental illness in a generalized facility and you're so right about how other mental illnesses have made leaps and bounds in terms of educating the public, while eating disorders remain largely hush hush. Sometimes I feel like the body positivity campaigns stemmed from a genuine desire to fix the problem, followed by an unwillingness to address the actual issue. Which wouldn't even have happened if people were taught more about eating disorders and knew how little weight and body image actually plays into them, in the grand scheme of things. \n\nAck, it makes my head hurt.",
      "created_utc": 1606981867.0,
      "score": 1,
      "context": [
        {
          "id": "gebt5a0",
          "author": "fakeplasticturnips",
          "body": "It’s incredibly frustrating and disappointing that people simply do not understand eating disorders and worse still they’re the butt of the joke in mainstream media which doesn’t help one little bit - Family Guy is shocking for it just to name one. \n\nI hear your frustration and I get it. It makes me think of when I replied to a comment from a guy who’s Flatmate was eating his food and he suspected she had an ED. I asked him to have some compassion for her obvious binge eating disorder, used the alcoholic analogy and suggested he talk to her because it could potentially help her or at least set some boundaries. I got 1 award from someone who obviously got it and another person telling me it’s a load of shit the girl would be feeling shame because otherwise she wouldn’t be eating his food in the first place. \n\nOh. My. God. \n\nPeople REALLY don’t get it. And they probably won’t unless they’ve been in our skin.",
          "created_utc": 1606876318.0
        },
        {
          "id": "gecb4k4",
          "author": "cetaceansituation",
          "body": "Yeah, that's a pretty classic example of not being able to teach someone who thinks they already know it all.... dagnabbit, that really does piss me off.\n\nDefinitely back in the 90's, early 00's the eating disorder remarks in pop culture were pretty insensitive by today's standards. I think at that time there was still a lot of learning to be done. Until Karen Carpenter died in the 80's, from what I understand, eating disorders weren't really on many people's radar and a lot of what they thought they knew about them has since been disproved or required extreme expanding upon.\n\nThankfully, I haven't seen many offensive pop culture depictions in quite some time. I'd venture to say the offensive ones I can think of only come from shows like Family Guy and South Park and, don't get me wrong because I love those shows, but they ARE kind of offensive by nature haha. They definitely don't help teach people anything useful, though.",
          "created_utc": 1606887328.0
        },
        {
          "id": "geewdth",
          "author": "fakeplasticturnips",
          "body": "You’re right. The tv shows I’m thinking of ARE offensive by nature but shows like South Park (which I too enjoy) still managed to discuss depression in a way that offer some insight. I just don’t see the same for ED’s at all. \n\nI find it really disappointing this generation is so open and educated about mental health / gender and sexuality and yet ED’s are still buried deep under the metaphorical rug. Maybe they’re not as ‘sexy’ as their counterparts...? Does that make sense? Something about that idea makes sense to me but I’m not entirely tied to it. I’m thinking about a bunch of movies I’ve watched recently - rockstars with drug addictions, salacious news stories of a trans women who was a former football coach, stories of comedians with bipolar / depression, reality tv about addictions. \n\nPerhaps it come from having worked in a rehab and being exposed to lots of people with addictions/ED’s. I’m obviously looking with a biased opinion and this is a huge generalisation but there was almost a hierarchy of interesting with drug addicted patients being at the top followed by sex/alcohol and all the way at the bottom gambling and EDs.",
          "created_utc": 1606942281.0
        }
      ]
    },
    {
      "id": "gehj0ix",
      "author": "shortcakefordinner",
      "body": "how is that hostile?",
      "created_utc": 1607004639.0,
      "score": 2,
      "context": [
        {
          "id": "gebe87b",
          "author": "shortcakefordinner",
          "body": "a lot of people we surround ourselves with victimise themselves when we show the expected signs of bulimia. i’m not saying people we are around don’t suffer but it’s really annoying when they make it all about themselves.",
          "created_utc": 1606868019.0
        },
        {
          "id": "geh6hl8",
          "author": "rikkitikkitavi888",
          "body": "A lot of people around you when you have an eating disorder gaslight you to the hilt... they make themselves the victim yet hello you are the parent?!? narcissistic personality disorder",
          "created_utc": 1606994805.0
        },
        {
          "id": "gehb3oo",
          "author": "shortcakefordinner",
          "body": "i don’t know if you’re agreeing with me or not but i was saying that people who don’t actually have the eating disorder tend to victimize themselves and guilt trip you",
          "created_utc": 1606999116.0
        },
        {
          "id": "gehiu8x",
          "author": "rikkitikkitavi888",
          "body": "Hey hey hey No hostility",
          "created_utc": 1607004534.0
        }
      ]
    }
  ]
}