{
  "id": "k5ytzv",
  "subreddit": "bulimia",
  "author": "amylynn1212",
  "created_utc": 1607007885.0,
  "title": "I think I broke the cycle",
  "selftext": "Guys.. it’s been a week now since I last b/p. After thanksgiving, I think I made a subconscious decision to break the restrict cycle. I’ve been eating *enough* and no longer starving. My urges to binge completely disappeared. Although it’s scary eating normally and sometimes feels like too much, it is so, so worth it.\n\nI’ve never been more proud of myself! Recovery is possible guys!! You got this!",
  "url": "https://www.reddit.com/r/bulimia/comments/k5ytzv/i_think_i_broke_the_cycle/",
  "score": 117,
  "num_comments": 7,
  "comments": [
    {
      "id": "geibmlk",
      "author": "rrrachel_rocks",
      "body": "🖤🖤 good job!!! Keep up the amazing work!\n\n\nMy old therapist (who I was forced to see at 16 when my bulimia was out of control) wrote “break the cycle” on an index card. I still have it, 17 years later. It can be broken! There may be hurdles, or fuck ups. That is okay. Just always go back to that phrase.",
      "created_utc": 1607018889.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gei2z8b",
      "author": "None",
      "body": "thats amazing!! keep up the good work, lovely ✨❤️ you should be so proud of yourself!!",
      "created_utc": 1607014836.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gejhhz5",
      "author": "justonium",
      "body": "I'm in a similar bost since after U. S. Thanksgiving i quit eating \"normal\" complicated foods and have only been eating my 'safe' ones.\n\nSo much of bulimia at least for me has simply just maybe been like, extra sensitivity to so many toxic food additives, and overheated oil and ditto for anything else cooked in too-hot oil or otherwise just cooked too hot like even toasted or whatever.\n\nEver since Thanksgiving dinner I literally have not eaten anything that was toxic enough to me to have >!that immediate need to vomit.!< I only wish there was more widely available info on how to prepare benign and safe yet actually-still-nutritionally-complete, foods. Probably goes against somebody's way of making money or something.",
      "created_utc": 1607037639.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gek7nvg",
      "author": "BrionyVictoria",
      "body": "You’re amazing.  I’m on day 7 right now of no b/ping, it’s been YEARS since I went this long. I too broke the cycle, and something really does switch in your brain when you’re genuinely ready to recover, I think.  I have no urge whatsoever to overeat... fingers crossed to you and to the rest of us, we can do this xxx",
      "created_utc": 1607054081.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gej54s4",
      "author": "ihavehope22",
      "body": "Yep u didn’t believe I under ate and that was contributing to my BP cycle. Eating more and getting better control over it. I never believed when ppl said I was so skinny and looked ill. Didn’t think I was under eating, community Ed service has been amazing to help me see more clearly and realise that my cognition was impaired until being under my bodies natural weight. Still working on my body image and trying to be neutral to my WT gain....it’s all a process and currently have to constantly remind myself of the bigger picture.",
      "created_utc": 1607031354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gejnemk",
      "author": "emotionalpricklypear",
      "body": "I am so proud of you!!!",
      "created_utc": 1607040898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gek0kh8",
      "author": "elpintor91",
      "body": "Yay proud of you! I really feel like I have no go between. either I eat hardly anything or I go all out enough to purge. Almost like I don’t care to eat if it’s not gonna be a binge it’s just over all stressful",
      "created_utc": 1607049506.0,
      "score": 1,
      "context": []
    }
  ]
}