{
  "id": "k6eyhv",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1607060853.0,
  "title": "I just hate when you eat that one thing that pushes you over",
  "selftext": "And you feel so horrible about yourself and everything, and your natural response is just “oh wait, it’s no big deal, I’ll just get rid of the chocolate-covered pretzels I just put in my body even though I wasn’t hungry bc i was convinced I would be able to chill and not feel disgusted with myself this time!”\nI only started purging fairly recently and I’m trying hard to stop it before it gets out of control, but it’s just so tempting and euphoric. It sucks. Sometimes I’m so good about eating enough at the right times of the day to where I don’t overeat but also don’t feel hungry all the time, but there’s always some time where it comes back awfully.\nI haven’t vomited yet tonight, I told my cousin I wouldn’t anymore and I want to keep to that, but it sucks so much, I wish I hadn’t gone overboard",
  "url": "https://www.reddit.com/r/bulimia/comments/k6eyhv/i_just_hate_when_you_eat_that_one_thing_that/",
  "score": 93,
  "num_comments": 8,
  "comments": [
    {
      "id": "gekjl7n",
      "author": "Pretend_Part2651",
      "body": "Yes I know exactly how this feels. It will be easier to stop now rather than wait. I know it’s hard, seeing a nutritionist helps",
      "created_utc": 1607063262.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gelhd7y",
      "author": "None",
      "body": "I just started seeing a therapist. I think the hardest part of it for me is telling people/talking about it. It’s just the shame of it, but I’ve been trying to tell my husband and my therapist because I can’t get better if I don’t talk about it. I am in the same boat you are, fairly recently started purging. But I was anorexic in early high school, so I just have always had an unhealthy relationship with food and my body. It’s SO good that you’re trying to fix this now, and that’s what my therapist told me, it starts “small” and gets worse the longer it goes on, so it’s so good that you realize an issue NOW. The way you talk about the need to purge, it’s exactly how I feel when I’m going through that. It’s so nice to find people who GET it and know exactly what I’m going through. Definitely, if you can, go talk to someone and you don’t always click with the first therapist you talk to, so don’t be afraid to keep trying until you find someone you truly can talk to.",
      "created_utc": 1607091068.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gelkpdy",
      "author": "19nov97",
      "body": "I know exactly what you’re going through. It’s like every time I eat ONE thing outside of my “safe foods” or meal prep and I just go overboard bc I know I have to throw up now. One pierogi and I’m throwing up my salad LOL. It sounds so silly, but it’s the way my mind works. I end up bingeing each time I eat a “bad” food bc I say to myself “I already fucked up, let’s eat everything i want bc I’m throwing up anyways.”  \n\nBest of luck to you, and I’m so proud of you for making the effort to get better. 💜",
      "created_utc": 1607092983.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gem5fm5",
      "author": "ruriku",
      "body": "i feel this sm. i got hungry so i made myself a pb&j to just c/s but then i accidentally swallowed some so i binged because “welp i have to purge anyway” it’s so annoying :/",
      "created_utc": 1607103252.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gel8e6c",
      "author": "justonium",
      "body": "On the one hand, it sucks to have passed that limit where we feel we have to purge in order to feel better.\n\n...But on the other, purge-addicted side of me even looks for excuses to like eat some new weird $hit that will maybe push me over.\n\nI used to only suffer the former, and i never even knew that vomiting, and then heaven forbid, eating *more* and then vomiting, could actually become like in any way, shape, or form a desirable thing.\n\nLike another commenter already said on this thread and like most bulimics will warn u, probably best to do what u can now to not open up that Pandora's Box. My tentative advice would be to hold it down if u can, and use this memory of how much distress u got and how much u had to do to hold it down without like ur world ending, as like a reminder to be more careful next time and like not so nonchalantly eat that last niggling craved thing. Anyway that's the advice that i would maybe tell my own past self.",
      "created_utc": 1607085294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gekka2t",
      "author": "None",
      "body": "Yeah, I just texted a friend about it to help sort of externalize the feeling and I’m calming down a bit and feeling less like I want to purge, so that’s good. And yeah, that’s what my cousin said, she’s struggled a bit with EDs before and she says I should try to stop now. My parents don’t know but they do suspect bc my mom had an ED as a teenager and they want me to see a doctor about it. So hopefully it won’t be so bad. It’s sucked so far lol",
      "created_utc": 1607063829.0,
      "score": 2,
      "context": [
        {
          "id": "gekjl7n",
          "author": "Pretend_Part2651",
          "body": "Yes I know exactly how this feels. It will be easier to stop now rather than wait. I know it’s hard, seeing a nutritionist helps",
          "created_utc": 1607063262.0
        }
      ]
    },
    {
      "id": "gelot5v",
      "author": "None",
      "body": "Yeah, I’ve been wanting to talk to a therapist for other mental health-related reasons for awhile so hopefully I’ll be able to bring this up too when I finally find one :)",
      "created_utc": 1607095171.0,
      "score": 1,
      "context": [
        {
          "id": "gelhd7y",
          "author": "None",
          "body": "I just started seeing a therapist. I think the hardest part of it for me is telling people/talking about it. It’s just the shame of it, but I’ve been trying to tell my husband and my therapist because I can’t get better if I don’t talk about it. I am in the same boat you are, fairly recently started purging. But I was anorexic in early high school, so I just have always had an unhealthy relationship with food and my body. It’s SO good that you’re trying to fix this now, and that’s what my therapist told me, it starts “small” and gets worse the longer it goes on, so it’s so good that you realize an issue NOW. The way you talk about the need to purge, it’s exactly how I feel when I’m going through that. It’s so nice to find people who GET it and know exactly what I’m going through. Definitely, if you can, go talk to someone and you don’t always click with the first therapist you talk to, so don’t be afraid to keep trying until you find someone you truly can talk to.",
          "created_utc": 1607091068.0
        }
      ]
    },
    {
      "id": "gelpbh7",
      "author": "None",
      "body": "Yes, I know what you mean. Even before I started purging, it was just like “well, I already fucked everything up irreversibly by eating this little bowl of yogurt, guess I’ll just cut my losses and become a vacuum.” Which were the habits that, paired with my unhealthy attitudes about thinness, led to the purging starting ofc.\n\nAnd thank you, I managed to get through last night without purging so that’s good :)",
      "created_utc": 1607095434.0,
      "score": 2,
      "context": [
        {
          "id": "gelkpdy",
          "author": "19nov97",
          "body": "I know exactly what you’re going through. It’s like every time I eat ONE thing outside of my “safe foods” or meal prep and I just go overboard bc I know I have to throw up now. One pierogi and I’m throwing up my salad LOL. It sounds so silly, but it’s the way my mind works. I end up bingeing each time I eat a “bad” food bc I say to myself “I already fucked up, let’s eat everything i want bc I’m throwing up anyways.”  \n\nBest of luck to you, and I’m so proud of you for making the effort to get better. 💜",
          "created_utc": 1607092983.0
        }
      ]
    }
  ]
}