{
  "id": "k6ohbp",
  "subreddit": "bulimia",
  "author": "OhToBeSkinny",
  "created_utc": 1607100348.0,
  "title": "Idolisation of other eating disorders",
  "selftext": "When I was anorexic I idolised bulimia. I was jealous that I couldn’t purge, I wanted to be able to eat and get rid of it. I wanted the safety of a security net like that. \n\nNow that I’m bulimic I idolise anorexia more than anything. I hate myself for not being able to be that way again because that was true control, not this. I miss feeling good at something, I miss feelings small. \n\nIt’s like nothing is ever good enough. Its like I’m constantly searching for some kind of a pattern or plan that makes me feel secure and safe and in control but nothing is ever good enough. Nothing ever makes me like myself more, if anything I like myself less. I tear myself apart because I idolise what I don’t have. I’m trying to find balance but can’t. At the end of the day I just want to be anything but myself. \nThis all started because I wanted one thing that I could like about myself but I never found it and that breaks my heart.",
  "url": "https://www.reddit.com/r/bulimia/comments/k6ohbp/idolisation_of_other_eating_disorders/",
  "score": 162,
  "num_comments": 11,
  "comments": [
    {
      "id": "gemd785",
      "author": "assassin-mythic",
      "body": "I get this so much. Anorexia feels so tidy and cute when you don't have it, and bulimia feels so chaotic and fun when you don't have it. But I try to remember what it felt like when i was in the midst of both, and it's not fun and it is most certainly not control. I tell myself that accepting myself and recovering from this is a real indicator of control, but it is still so f\\*cking hard.",
      "created_utc": 1607106913.0,
      "score": 61,
      "context": []
    },
    {
      "id": "gem6kve",
      "author": "Sally7328",
      "body": "Ah I feel this, I also use this as a way to play it down...now I tend to be anorexic (diagnosed with anorexia but still kinda weight restored atm) so I tell myself „it’s not that bad, at least I’m not throwing up, it’s way more healthy“. In my bulimic episode I told myself the exact opposite „at least I’m eating, that’s healthy, I can’t even get rid of everything I ate so at least I’m not losing weight“. Guess it’s just impossible to get everything right with this crippling disorder as it will always make us believe that the grass is greener somewhere else while at the same time we are never sick enough...either way, over or underrating",
      "created_utc": 1607103792.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gemdbuj",
      "author": "kintyre",
      "body": "I miss having control. I miss being able to just not eat. I feel this.",
      "created_utc": 1607106974.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gemlpwr",
      "author": "cheshlz",
      "body": "Forr surrre dude atm i desperately wish to be back in my low restricting phase with portion control and clean eating but i remind myself how i spent ALL of my time watching recipe videos or walking around different grocery stores like i would take long walks to different stores of the same chain and get so excited to look at food. It was obnoxious and really sad and the weight loss rly never was enough. I rly thought i was huge and always uncomfortable. \n\nHowever back then i thought i was weak for not being able to purge lmao how the turntables",
      "created_utc": 1607110976.0,
      "score": 9,
      "context": []
    },
    {
      "id": "genc2xj",
      "author": "elpintor91",
      "body": "Same. I envy girls who can eat an apple and have a “sense” of control. I can’t just stop at an apple. At the same time I love eating food and hate starving myself. I desperately need a balance",
      "created_utc": 1607124666.0,
      "score": 7,
      "context": []
    },
    {
      "id": "genx2e8",
      "author": "send-help-im-dying",
      "body": "I used to be so sickly jealous of my anorexic friend, and I hate myself for that. But anorexia is just so much more..... publicly acceptable than bulimia. Like the reality of both are awful and deadly, but people are so much more prepared to talk about anorexia. No one in my life is prepared to talk about all the nastiness that is bulimia. Hiding bags of vomit, fishing chunks of partially digested food from drains, permanent puke breath, plus all the shit I got for wasting money on food that literally gets flushed down the toilet. it's disgusting, and no one wants to talk or hear about it.",
      "created_utc": 1607137132.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gen5aqm",
      "author": "None",
      "body": "if this isn’t the post~ When I binge I DREAM of being able to eat under a certain amount. When I am restricting I wish I could just purge the day away. ED’s suck regardless of which one you have. We all deserve better :(",
      "created_utc": 1607120933.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gemrc5s",
      "author": "justonium",
      "body": "> [...] Anorexia feels so tidy and cute when you don't have it, and bulimia feels so chaotic and fun when you don't have it.\n\nSo beautifully put <3 XD",
      "created_utc": 1607113757.0,
      "score": 21,
      "context": [
        {
          "id": "gemd785",
          "author": "assassin-mythic",
          "body": "I get this so much. Anorexia feels so tidy and cute when you don't have it, and bulimia feels so chaotic and fun when you don't have it. But I try to remember what it felt like when i was in the midst of both, and it's not fun and it is most certainly not control. I tell myself that accepting myself and recovering from this is a real indicator of control, but it is still so f\\*cking hard.",
          "created_utc": 1607106913.0
        }
      ]
    },
    {
      "id": "gemrm9x",
      "author": "justonium",
      "body": "> [...] tend to be anorexic [...] so I tell myself „it’s not that bad, at least I’m not throwing up, it’s way more healthy“. In my bulimic episode I told myself the exact opposite „at least I’m eating, that’s healthy, I can’t even get rid of everything I ate so at least I’m not losing weight“.\n\nikr? but also both behaviors are harmful\n\nEdit:\n\nThough, in the case of anorexia, maybe not so much the behavior as much as just the whole situation--that is, unless you begin to deal with the inability to psychologically and/or physically handle eating and holding real, complete foods by eating maybe even way way way too much of some only partially-complete-and-nutritively-sustaining \"safe 'foods'\" that maybe won't make u 'frow, but may also contribute to making you some certain type of Fat. (And especially so if maybe they are still missing something critical and essential that is in some perhaps more 'real', if less 'safe', foods and so they do not properly sate a hunger and one maybe has even more tendency to just continue to eat and eat and eat. (And then maybe even *still* not 'frow, because the 'food' is \"safe\".)\n\n(And then maybe even get sunk into almost an anorexic-style, still-even-partially-starving, form of even almost pica-esc BED\\*. And maybe this does not have a risk of happening to all types of attempting-to-recover hungry anorexics, but it certainly has at least happened to me.)\n\nEdit 2:\n\n\\* (And that's not to say, that perhaps some more typical sufferers of true, 'real food' BED, maybe aren't also starving of one/some dietarily scarce, essential micronutrients, and are simply lacking in any actually decent options for truly satisfying it.)",
      "created_utc": 1607113899.0,
      "score": 6,
      "context": [
        {
          "id": "gem6kve",
          "author": "Sally7328",
          "body": "Ah I feel this, I also use this as a way to play it down...now I tend to be anorexic (diagnosed with anorexia but still kinda weight restored atm) so I tell myself „it’s not that bad, at least I’m not throwing up, it’s way more healthy“. In my bulimic episode I told myself the exact opposite „at least I’m eating, that’s healthy, I can’t even get rid of everything I ate so at least I’m not losing weight“. Guess it’s just impossible to get everything right with this crippling disorder as it will always make us believe that the grass is greener somewhere else while at the same time we are never sick enough...either way, over or underrating",
          "created_utc": 1607103792.0
        }
      ]
    },
    {
      "id": "gexh2i9",
      "author": "sonic2cool",
      "body": "me too man",
      "created_utc": 1607335701.0,
      "score": 2,
      "context": [
        {
          "id": "genc2xj",
          "author": "elpintor91",
          "body": "Same. I envy girls who can eat an apple and have a “sense” of control. I can’t just stop at an apple. At the same time I love eating food and hate starving myself. I desperately need a balance",
          "created_utc": 1607124666.0
        }
      ]
    },
    {
      "id": "genjee7",
      "author": "OhToBeSkinny",
      "body": "I agree, we all deserve much better than the disorders we have 💜",
      "created_utc": 1607128915.0,
      "score": 1,
      "context": [
        {
          "id": "gen5aqm",
          "author": "None",
          "body": "if this isn’t the post~ When I binge I DREAM of being able to eat under a certain amount. When I am restricting I wish I could just purge the day away. ED’s suck regardless of which one you have. We all deserve better :(",
          "created_utc": 1607120933.0
        }
      ]
    }
  ]
}