{
  "id": "k9jfon",
  "subreddit": "bulimia",
  "author": "_Wearethetigers_",
  "created_utc": 1607482661.0,
  "title": "In fifth grade..",
  "selftext": "In fifth grade I learnt about eating disorders and I said to myself “jeez that’s horrible I’m glad I’ve never had one, I promise I’ll never develop one” but now I’m sitting on the floor crying after puking my guts out remembering my promise to fifth grade me...this can’t be my life.",
  "url": "https://www.reddit.com/r/bulimia/comments/k9jfon/in_fifth_grade/",
  "score": 148,
  "num_comments": 12,
  "comments": [
    {
      "id": "gf4shhc",
      "author": "_d_u_m_b_a_s_s_",
      "body": "I'm so sorry man, I get that\nBack in like 2013 there was an article on the news Andy grandma says \"don't you grow up to be like one of those girls\" and pointed to the anorexic chick on screen\nHaha grandma I'm not anorexic I'm bullemic",
      "created_utc": 1607485490.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gf51rlk",
      "author": "discopink66",
      "body": "You’re not alone, it’s not impossible to get better.",
      "created_utc": 1607491262.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gf5wdlj",
      "author": "FluffyMuffins42",
      "body": "I distinctly remember thinking “why would anyone make themselves puke? That’s one of my biggest fears” \n\nThen I was bulimic for years. I was still afraid of puking accidentally though. Then I became an alcoholic. Now I’m a puking expert. But my stomach is constantly upset. Not worth the trade off IMO. \n\nSending you hugs OP. I hope it gets better for you soon. I want you to know that this disorder is manageable. Ive been recovered most of the last 2 years. When it flares up, it feels like an old bad habit. Even if things are never perfect, they get better.",
      "created_utc": 1607519164.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gf61mcc",
      "author": "None",
      "body": "Dude, in fifth grade I was the only one of my friends wearing clothes for the juniors section (latina, early bloomer, big hip, some boobs). I felt bigger (fatter) than other girls around me.\n\nWhen I learned about eating disorders, I was like \"that's the solution!\" And it was always in the back of my head. \n\nIn 6th grade, I was eating a spoonful of peanut butter (popular snack for me back then) and my aunt said \"that will go straight there\" and poked my thighs. \n\nIt's all downhill from there. \n\nWhat I've found useful is meditation to in a way \"travel back\" to those moments where the adults in my life failed me. I picture adult me comforting child me, telling her what I needed to hear.",
      "created_utc": 1607522638.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gf6dptf",
      "author": "Numisuro12",
      "body": "It all seems so surrealistic to one unless it happens to yourself. I've never thought about having an eating disorder and now I suffer from being underweight and daily puking at the age of 20. That's not a life. The worst thing about it is being fully conscious about your actions, yet you still can't really do anything about it. Just keep in mind that you're certainly not alone and that things can change.",
      "created_utc": 1607529059.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gf5w8nu",
      "author": "classic_moth",
      "body": "Right there with ya. I always thought I had a healthy relationship with food. Healthier than most, even. My body image was pretty good all through puberty too.\n\nWhy my late-20s doing me in like this? What the hell.",
      "created_utc": 1607519061.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gf5463s",
      "author": "DeniseBenise2007",
      "body": "O",
      "created_utc": 1607492994.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gf67gun",
      "author": "Careless-name69",
      "body": "Lol i started bulimia when i was taught about it, when i was 10 or 11 years old",
      "created_utc": 1607525942.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf7bz1c",
      "author": "ruriku",
      "body": "yeah me too. 8th grade, my health teacher showed the cheerleader “my eating disorder story” video on youtube and i thought to myself “wow she must be really vain to practically kill herself just to be skinny. i could never do that” and “doesn’t she know how boney and unhealthy she looks?” i had no idea....",
      "created_utc": 1607544829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gfd0naf",
      "author": "JellyfishinaSkirt",
      "body": "I think this all the time.  But you’re going to be ok.  Everyone on this sub is rooting for you",
      "created_utc": 1607661833.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf6yxi0",
      "author": "_Wearethetigers_",
      "body": "Thanks so much💕",
      "created_utc": 1607538817.0,
      "score": 6,
      "context": [
        {
          "id": "gf5wdlj",
          "author": "FluffyMuffins42",
          "body": "I distinctly remember thinking “why would anyone make themselves puke? That’s one of my biggest fears” \n\nThen I was bulimic for years. I was still afraid of puking accidentally though. Then I became an alcoholic. Now I’m a puking expert. But my stomach is constantly upset. Not worth the trade off IMO. \n\nSending you hugs OP. I hope it gets better for you soon. I want you to know that this disorder is manageable. Ive been recovered most of the last 2 years. When it flares up, it feels like an old bad habit. Even if things are never perfect, they get better.",
          "created_utc": 1607519164.0
        }
      ]
    },
    {
      "id": "gf6eigv",
      "author": "Numisuro12",
      "body": "My doctor told me the same. It's not uncommon for people with bulimia to bite the dust. You don't even have to be underweight for that. Your organs can just snap out in an instant and then you're done for. It's honestly scary but the thought of dying somehow isn't really that chilling to me anymore. Maybe bulimia is a slow way of committing suicide in a cowardly manner. I don't really want to die, but on the other hand I'm apathetic towards that thought. I'm 20 years old and I can't comprehend that this is what life is all about. I hate it, I hate it so much. I really hope you pull through this. No one deserves to be inferior to such a stupid, yet so powerful disease. I wish you the best, I really do, as I do for the rest of our kind. I hate this, I honestly do.",
      "created_utc": 1607529440.0,
      "score": 3,
      "context": [
        {
          "id": "gf5463s",
          "author": "DeniseBenise2007",
          "body": "O",
          "created_utc": 1607492994.0
        }
      ]
    }
  ]
}