{
  "id": "kcbhow",
  "subreddit": "bulimia",
  "author": "recoveringfrogx",
  "created_utc": 1607869709.0,
  "title": "I showed my mom my sick",
  "selftext": "I’ve moved to uni for the first time and hardcore relapsed.Everyday this week I have been buying sooo much binge food and purging from the moment I wake up until I pass out. It’s been a lot and I’m so drained and last night my mom FaceTimed me and I attempted to ask for help but then she told me I am at a healthy weight so I can’t have a eating disorder and then I got angry and regrettably showed her a bag of vomit just to prove a point. I want to disappear I can’t believe i did that I don’t think I can face my mom again.",
  "url": "https://www.reddit.com/r/bulimia/comments/kcbhow/i_showed_my_mom_my_sick/",
  "score": 105,
  "num_comments": 10,
  "comments": [
    {
      "id": "gfpaitr",
      "author": "delusionaltea",
      "body": "That's really sad.to read you had to actually show her the bag 😢 \n\nI'm sorry for what you are going through. EDS are the worst the strip every piece of happiness off you and I'm so sorry you're struggling so badly right now.",
      "created_utc": 1607871581.0,
      "score": 43,
      "context": []
    },
    {
      "id": "gfpanxl",
      "author": "Cath1212",
      "body": "Please don’t be embarrassed. \n\nI understand how it’s like to be in a new environment where you have to take full responsibility of yourself, your health and own wellbeing - I left home and went to boarding school in another country at age 15 and that’s when I started to binge and purge - so let me tell you, I know how hard it is. But it’s amazing that you’ve managed to reach out to your mother, I’m sorry she reacted that way though, it was totally unfair. But it just shows how she doesn’t understand what you’re going through whatsoever.\n\nSHE should feel embarrassed after telling you you have no ED and then seeing that bag of sick, not you.",
      "created_utc": 1607871648.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gfqdw2x",
      "author": "Wtfisthis66",
      "body": "The day I got out treatment (for the first time with ED) I was doing the wash up after dinner and had utilized my “purge pitcher.” I put it underneath the kitchen sink until I could empty it out with no one noticing. My mother who didn’t really believe in EDs decided to help with the dishes and opened the cupboard to get a pair of washing up gloves and saw the pitcher. Besides being very embarrassing and a bit humiliating for me, it was an eye opening thing for my mom.",
      "created_utc": 1607888279.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gfp8ckf",
      "author": "blufcbb",
      "body": "This is something I would do",
      "created_utc": 1607870583.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gfpy4fc",
      "author": "anything78910",
      "body": "Well your mom was being hurtful and invalidating.",
      "created_utc": 1607882457.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gfqusbc",
      "author": "edie43",
      "body": "I am devastated for you that you tried to get help but was rejected to the point where you felt you had to do that. Please don’t feel embarrassed or ashamed, your mother is the one who should feel like shit after this. I’ve been a normal weight bulimic my whole life and no one has ever believed me because of that. Until I got help from a professional. Are there any resources available at your uni? Please try and see if there are and if you can seek help somewhere. You deserve to get help.",
      "created_utc": 1607895896.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gfrddo7",
      "author": "kloimo",
      "body": "I developed bulimia when I was overweight and I'm stuck in a spiral after losing 24kg and hitting a healthy weight. My mom still doesn't believe it is a problem. The stigma that eating disorders only affect underweight people is so debilitating.. hang in there.",
      "created_utc": 1607905200.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfrgntg",
      "author": "Psychosparkles",
      "body": "I actually think this is a good thing, it shows that ED hasn’t taken over your entire brain yet, there’s still a part of yourself still there, and that part of you obviously wants you to be healthy, it knows Ed is toxic and NOT your friend, your true self over powered and disobeyed what Ed wants, Ed wants you to keep everything a secret, it wants you to feel shame and guilty. So telling on your eating disorder really pisses it off and tries to make you feel stupid and embarrassed in order to get you sucked in even further. Don’t let it have that power over you. You are stronger than that, and there’s a part of your real rational brain that still knows that.. try not to let the eating disorder to take over that part of you, because once it takes over completely, it is extremely hard to let it go. \n\nBest of luck! Try to recognize your own thoughts, and separate them from the EDs manipulative and abusive brainwashing.💕",
      "created_utc": 1607906936.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfrke11",
      "author": "None",
      "body": "You have absolutely nothing to be ashamed of - Your mother, like all who love their precious children only wants to believe you are as healthy as can be.\n\nYou can do this - You deserve all the help in the world and the endgame is beautiful and real. You will beat this and you will think of these times as a past so distant it’s barely relevant.",
      "created_utc": 1607909024.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfrskgs",
      "author": "thisismylife38",
      "body": "Your mom might not know how to help you. But the good news is you can still get help. Your uni might have some really good resources.",
      "created_utc": 1607913495.0,
      "score": 3,
      "context": []
    }
  ]
}