{
  "id": "kec6pe",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1608135612.0,
  "title": "delusional?",
  "selftext": "This year alone I’ve lost 60lbs. Only recently I’ve opened up about my ED (which is severe restrictive bulimia). My parents know, therapist, and two friends. I still don’t recognize that my body has changed. When I look at pictures or videos of myself that I’ve taken, I can see that I look different, but when I’m looking in the mirror I don’t recognize the physical changes. Is this just how it is? In my mind, I tell myself that once I’m down to xxx pounds I’ll “stop” the purging at least. I think I’ll have restrictive tendencies for a while bc my stomach can’t handle all the calories I should be consuming daily. \n\nWill I have this dysmorphia forever? When I’m down to xxx pounds will it keep going? I guess that’s what scares me, withering away to nothing because even at a healthy weight I’ll still feel fat. \n\nThis is scary, ED’s are scary.",
  "url": "https://www.reddit.com/r/bulimia/comments/kec6pe/delusional/",
  "score": 66,
  "num_comments": 6,
  "comments": [
    {
      "id": "gg26e9e",
      "author": "queenofthebans",
      "body": "i am the same as you - even though i have lost a lot of weight, I still feel the same. clothes don't fit, but I look the same. that's the nature of this disorder. nothing will ever be good enough for us. the goal weight just goes lower and lower, because we think another x lbs lost will make us happier... it never ends.",
      "created_utc": 1608146265.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gg2agbk",
      "author": "Ordinary_Koala_9839",
      "body": "i have a question, i am so sorry if this is insensitive. what is the difference between server restrictive bulimia and purging anorexia?",
      "created_utc": 1608148161.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gg3lk0x",
      "author": "AncillaryHeroine",
      "body": "Yes. When I was +100 lbs. I thought “I’ll just get down to double-digits, THEN I’ll be beautiful.” \n\nWhen I was <100 lbs: “I’ll just get down to 90 lbs., THEN I’ll feel good about my weight.” \n\nWhen I was 89 lbs: “if I just get to 85 lbs., THEN I’ll stop.” \n\nMy father said I looked like a ghost, but if you had asked me, I was still the ugly “fat” girl I had always been. The body dysmorphia is crippling and the chemicals in your brain change and literally play tricks on us. It’s awful. You’re right to have these concerns.",
      "created_utc": 1608172110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gg499ic",
      "author": "_dankelle",
      "body": "I’m at the lowest weight I’ve been at in like 4 years after losing 40lbs and I still feel like I’m the biggest person on earth :(",
      "created_utc": 1608186742.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gg2aw00",
      "author": "None",
      "body": "I honestly have no idea, I don’t label myself as a a simply bc I’m still a “healthy” weight for my height, if not a couple pounds above. W my bulimia, I purge the small amount of calories I eat a day besides my morning coffee & vegan chocolate. Dunno what diagnosis I’d qualify for.",
      "created_utc": 1608148366.0,
      "score": 6,
      "context": [
        {
          "id": "gg2agbk",
          "author": "Ordinary_Koala_9839",
          "body": "i have a question, i am so sorry if this is insensitive. what is the difference between server restrictive bulimia and purging anorexia?",
          "created_utc": 1608148161.0
        }
      ]
    },
    {
      "id": "gg2d6wp",
      "author": "DedicatedtoDistance",
      "body": "“Healthy” weight means nothing. I had a BMI basically dead center in the “normal/healthy” range most of the time I was restricting/purging. I’ve never be “underweight.” \n\nHowever, I lost my period for almost two years. My hair became brittle and started break and thin. I was incredibly fatigued and highly nutrient deficient. My heart rate dropped to 43 bpm and I had heart palpitations. I got stress fractures in both my hips from low bone density.\n\nIt wasn’t until I increased my body weight by ~10-15% and my BMI was/is at the border of healthy and overweight, that my body started to heal. \n\nEveryone’s body is different and starving for you doesn’t necessarily look like starving for someone else.",
      "created_utc": 1608149456.0,
      "score": 11,
      "context": [
        {
          "id": "gg2agbk",
          "author": "Ordinary_Koala_9839",
          "body": "i have a question, i am so sorry if this is insensitive. what is the difference between server restrictive bulimia and purging anorexia?",
          "created_utc": 1608148161.0
        },
        {
          "id": "gg2aw00",
          "author": "None",
          "body": "I honestly have no idea, I don’t label myself as a a simply bc I’m still a “healthy” weight for my height, if not a couple pounds above. W my bulimia, I purge the small amount of calories I eat a day besides my morning coffee & vegan chocolate. Dunno what diagnosis I’d qualify for.",
          "created_utc": 1608148366.0
        }
      ]
    }
  ]
}