{
  "id": "kehk4k",
  "subreddit": "bulimia",
  "author": "Ordinary_Koala_9839",
  "created_utc": 1608151561.0,
  "title": "Well...it happened...",
  "selftext": "the inevitable...just back home from university and got the “YOU LOOK SO GOOD” from everyone in my family. i knew this would happen. it’s so triggering in the sense that is such encouragement, they’re basically saying...continue to starve yourself and continue to purge anything you eat muahaha. so fun so quirky🥴🥴🥴",
  "url": "https://www.reddit.com/r/bulimia/comments/kehk4k/wellit_happened/",
  "score": 106,
  "num_comments": 5,
  "comments": [
    {
      "id": "gg302mx",
      "author": "None",
      "body": "i fucking hate this shit i was at the worst of my eating disorder and my dentists assistant said “wow you’ve lost a few kilograms” weird phrasing ik she didn’t speak very good english but comments like that are so painfully helpful in ur ed",
      "created_utc": 1608160579.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gg3p499",
      "author": "Low-Euphoric",
      "body": "They are born in the same diet culture as we are.  Remember they do this out of pure ignorance, but it is incredibly triggering. However, obstacles like this are the be expected when you recover, but you can get through it little by little, as long as you try. What helps me when I feel very triggered is being extra compassionate with myself, like you would treat a child. Sending you love to counter those triggers ❤️",
      "created_utc": 1608173976.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gg3z2km",
      "author": "birdseedforall",
      "body": "my mom @ me: “keep up the good work!” ahahahhahaha i mean if you say so",
      "created_utc": 1608179579.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gg43mvv",
      "author": "Drewbarb",
      "body": "I'm really sorry. I never really had to experience this too badly as my mia started during mid puberty, so now i don't have tits and i look like a pre-pubescent teenage boy haha",
      "created_utc": 1608182559.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gg3zl01",
      "author": "Ordinary_Koala_9839",
      "body": "like jeez don’t push us now 😎✌🏻",
      "created_utc": 1608179899.0,
      "score": 3,
      "context": [
        {
          "id": "gg3z2km",
          "author": "birdseedforall",
          "body": "my mom @ me: “keep up the good work!” ahahahhahaha i mean if you say so",
          "created_utc": 1608179579.0
        }
      ]
    }
  ]
}