{
  "id": "kjd3nh",
  "subreddit": "bulimia",
  "author": "mw_1999",
  "created_utc": 1608805194.0,
  "title": "Christmas and Bullimia",
  "selftext": "It’s one hour until Christmas in my country and I feel a bit sad since right now all I can think about is all the food there will be tomorrow that I can binge on. It’s just so crazy to me because I feel like a little kid excited for Christmas I’m so excited for all the binge food that I won’t have to eat in secret and can have for free all day long. It’s kind of making me sad just because as a child I used to feel like this, but I was excited about waking up to presents and now I’m excited to binge eat :/ \n\nI’ve pre planned a few ways to purge at different times of the day, but I am having some weird thoughts related to it. I’ve been on a really good streak with b/p lately and my binges have become less frequent and more manageable along with purging of course. We had a few treats tonight for Christmas Eve which I binged and then went off and purged but now since I have broken the habit a bit, it didn’t feel so good to do it. Even the binging was something that I kind of forced myself to do and I didn’t even want a lot of what I was eating. Then when I purged I found it super unsatisfactory. I guess that’s a really good sign in terms of recovery so I feel good about it. But at the same time why am I so excited to binge eat tomorrow? I just don’t understand how I can be in such a good place yet food is still controlling me and my feelings around such a special time of the year.",
  "url": "https://www.reddit.com/r/bulimia/comments/kjd3nh/christmas_and_bullimia/",
  "score": 74,
  "num_comments": 4,
  "comments": [
    {
      "id": "ggw5u1n",
      "author": "Cath1212",
      "body": "I guess you associate Christmas as a holiday to just let yourself go, treat yourself and because of that, it’s like you can justify binging and purging. “Everyone else around me is gonna eat more than usual so why can’t I?” kinda thing.\n\nI’m so sorry you’re feeling like this. I think, try and plan your day tomorrow by also thinking of what other things you might do? Maybe go for a walk with your dog/ family/ friends, plan a get together game time in the evening... Things that will get you away from the kitchen and the food essentially. \n\nIt’s hard, it really is, so please don’t make yourself miserable. Baby steps. If you can manage to get your mind off of it tomorrow for a bit, see that as an accomplishment. Also, feel free to dm me if you need to reach out to someone. x",
      "created_utc": 1608812388.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ggwfo81",
      "author": "cbsewing",
      "body": "I know the holidays come with plentiful food and the yummiest leftovers. Try to understand that even if you eat a little more that you don’t necessarily need to purge. \n\nI agree with u/cath1212 with the holiday association, you just need to find things to get your mind off of purging. That can be hard sometimes. Movies help me, but sometimes I feel I really need to vent about all the feelings that wanting to purge bring me, for that you can contact either of us! \n\nYou’re not alone in your recovery ! I hope you have the best holidays !",
      "created_utc": 1608820469.0,
      "score": 3,
      "context": []
    },
    {
      "id": "inbrhoo",
      "author": "Fun_Maintenance_329",
      "body": "hope ur doing okay pal. i relate to this alot",
      "created_utc": 1662479153.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggxycur",
      "author": "gargoyle-of-olay",
      "body": "this was a really thoughtfully written post — thank you. you are so self aware and i hope today goes ok but also whatever happens, i just have so much respect for how reflective you are able to be about your present and past feelings about this holiday. ♥️",
      "created_utc": 1608852972.0,
      "score": 1,
      "context": []
    }
  ]
}