{
  "id": "kjzdq0",
  "subreddit": "bulimia",
  "author": "orangecolouredcandy",
  "created_utc": 1608904579.0,
  "title": "my christmas was a complete ✨disaster✨ I hope yours was better than mine!",
  "selftext": "Convinced myself that I can do both Christmas Eve & Christmas without purging but who am I fooling? 🤡 \n\nWith the gatherings and big family meals, there was a lot of family drama going on, and I noticed that no one was really paying attention to me. So being the clown that I am, I decided to purge throughout the day whenever I wanted, just to test out my theory.\n\nI told everyone that I have an upset stomach/need to go to the bathroom, multiple times throughout the day & no one cared. Hell, at one point I just walked out in the middle of the meal and when I came back no one noticed.\n\nI was practically doing it just for the adrenaline rush & to entertain myself. And I wasn’t even binging, so it got to the point where it wasn’t even worth it to do it anymore. There was an incident involving me purging in the nastiest bathroom at a dim sum restaurant that made me shiver to just even think about.\n\nAnd now I’m just so disappointed in myself for being so... childish, I guess? I’m a grown ass adult ffs, and I spent weeks prior to this convincing myself that I won’t purge because I’ve been doing so well. But family gatherings like this always make me feel like a child cos everyone is treating me like one. And it’s safe to say this is definitely one of the rock bottoms of this year for me. So... merry Christmas, I guess? 🙃",
  "url": "https://www.reddit.com/r/bulimia/comments/kjzdq0/my_christmas_was_a_complete_disaster_i_hope_yours/",
  "score": 137,
  "num_comments": 8,
  "comments": [
    {
      "id": "gh03k0n",
      "author": "None",
      "body": "quite a bit the same for me, but hey, we can try again in new years eve 🥴",
      "created_utc": 1608918665.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gh0xkyp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1608937534.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gh07oou",
      "author": "peafowlontheprowl",
      "body": "I’m sorry :( holidays are overrated and you did your best and you’re not a failure for having a bad day, especially on a day so centered around food. Hope you’re doing okay lovey xx",
      "created_utc": 1608921407.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gh089ga",
      "author": "19nov97",
      "body": "It’s all good. I find myself stressing too much around the holidays and I want to purge too. I pushed through the urge last night thanks to my family and therapist. I will try to remind myself that this is a time to celebrate, not beat myself up. I will get back on track soon!!! Wishing you nothing but the best 💗",
      "created_utc": 1608921790.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gh0lzgi",
      "author": "None",
      "body": "Oh man i fucking hate this time of the year, I tried not to b/p but just before the night ended boom! And I did it again this morning, I feel like fucking shit, it never ends. I’m sorry you are in this situation",
      "created_utc": 1608930204.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh0zdyz",
      "author": "laurens_t",
      "body": "I hear you and you are not alone. I also didn't expect to purge the Christmas but yeah. Next year is another Christmas though :-)",
      "created_utc": 1608938717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh056jw",
      "author": "shiba_hazel",
      "body": "oh man me too. game over 💀",
      "created_utc": 1608919748.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh12apl",
      "author": "gargoyle-of-olay",
      "body": "damn",
      "created_utc": 1608940627.0,
      "score": 4,
      "context": [
        {
          "id": "gh0xkyp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1608937534.0
        }
      ]
    },
    {
      "id": "gh1tbad",
      "author": "victoriousbbyg",
      "body": "You get used to it I guess. Bulimia and OCD are the butt of most “acceptable” jokes involving mental illness these days.",
      "created_utc": 1608959998.0,
      "score": 2,
      "context": [
        {
          "id": "gh0xkyp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1608937534.0
        },
        {
          "id": "gh12apl",
          "author": "gargoyle-of-olay",
          "body": "damn",
          "created_utc": 1608940627.0
        }
      ]
    }
  ]
}