{
  "id": "kk4g57",
  "subreddit": "bulimia",
  "author": "frrruitbat",
  "created_utc": 1608924201.0,
  "title": "Today is Hard",
  "selftext": "Sending love to all my bp’ers on holidays\n\nFuck food-centric days and fuck holidays. Hope y’all are hanging tough 🎄",
  "url": "https://www.reddit.com/r/bulimia/comments/kk4g57/today_is_hard/",
  "score": 123,
  "num_comments": 6,
  "comments": [
    {
      "id": "gh1udey",
      "author": "None",
      "body": "I couldn't hang at all and just binged. I couldn't purge so I am sure I won't be eating for today and tomorrow. All that food just made me sick",
      "created_utc": 1608960891.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gh1yi8p",
      "author": "mochimochi16",
      "body": "B/purged twice today\n\nI’m exhausted and very thirsty",
      "created_utc": 1608964670.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gh29eu8",
      "author": "None",
      "body": "I fucked up big time but at least I kept Christmas Dinner down.",
      "created_utc": 1608977620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh30g3z",
      "author": "19nov97",
      "body": "I felt this 10000000000%. Christmas Day came with a panic attack after bingeing on cookies and not being able to purge. Im in recovery right now and this is the hardest thing I’ve ever tried to do. I have my family on board and I’m doing all of this for them. We can do it everyone. Sending love to all of my warriors 💜💜💜",
      "created_utc": 1609001580.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh2qcev",
      "author": "frrruitbat",
      "body": "Binged at dinner, purged immediately after. Took too long in the bathroom, fiancée was questioning why I was in there so long.\n\nToilet flusher wasn’t working so it took me 20 minutes to take the back of the toilet off and fix the flusher thing. So embarrassing, tried to pass it off as a stomach ache but I’m past the point of my family buying into my bullshit.\n\nI am so tired, and just want this all to end.",
      "created_utc": 1608995142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh1gdg0",
      "author": "brookleiaway",
      "body": "bru i dont mind eating yummy food on holidays but the pie they got was really gross and it really makes me want to erase it cause it wasnt worth it and its not worth the gross feeling",
      "created_utc": 1608950277.0,
      "score": 1,
      "context": []
    }
  ]
}