{
  "id": "kkmzot",
  "subreddit": "bulimia",
  "author": "Waluisi",
  "created_utc": 1609006507.0,
  "title": "Stop commenting on my weight",
  "selftext": "I hate it whenever my family sees me that they talk about how much weight I’ve gained or lost or how I’m still fat. I hate how they always have to comment on what I’m eating, on how it’s too much, not enough,  healthy or unhealthy. I just hate how they have to voice their opinions about me. I don’t want to hear how fat I am because it just makes me want to purge. I don’t want to hear how skinny I’ve gotten because it just makes me want to continue what ive been doing. I’m just so tired of everything.",
  "url": "https://www.reddit.com/r/bulimia/comments/kkmzot/stop_commenting_on_my_weight/",
  "score": 140,
  "num_comments": 18,
  "comments": [
    {
      "id": "gh3chuk",
      "author": "lalabearie",
      "body": "I absolutely loathe it when my fam or family comment on how much I ate or how little I ate. When i eat “too much” in their eyes, they will say “you will get fat/regain your weight if you continue eating like this”; when i eat “too little”, they will say “you’re already so slim, why are you eating so little? Eat more, you need the nutrients. Dont starve”\n\nWhen i go to a store i frequent, the staffs noticed my weight loss, they will say “you never eat right? Your neck is gonna break if you lose anymore weight”. If i gained weight, they go “why did you gain weight? All the weight you lost is for nothing now”\n\nAlso, i noticed my fam/friends always try to force feed or guilt trip me into eating and if i absolutely lose it, i started saying nasty comments BACK to them, because you know, when balloon expands too much, it explodes. And thats, me.",
      "created_utc": 1609008549.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gh3af6b",
      "author": "Repulsivesoul",
      "body": "Oh god that’s the worst I eat less than my cousin but he’s skinny as hell and I’m... not which it really stressful for me",
      "created_utc": 1609007396.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gh3euo7",
      "author": "kekelakes",
      "body": "I had to deal with my sisters self internalized fatphobia . She actually made a comment about how I should get potato salad or rice and not both when I actually look forward to special occasions when I can have both because I literally love the texture of them together. Seriously ruined it for me. \n\nShe’s the one jumping from diet to diet, I’m recovered and just trying to enjoy stuff in moderation but comments like that are super triggering",
      "created_utc": 1609009864.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gh3gjnw",
      "author": "Ordinary_Koala_9839",
      "body": "me fucking too...the other day i felt my dads eyes burning into me and he goes you’re so skinny do you even eat...in front of my whole family...almost bursted into tears",
      "created_utc": 1609010748.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gh3lxqc",
      "author": "None",
      "body": "My cousins eat twice as much as I do and they love to comment on how I eat so little and so healthy but am still fat. Wtf.",
      "created_utc": 1609013859.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh3x1g5",
      "author": "ruriku",
      "body": "i feel this. i keep telling my dad “please stop joking or commenting on what i eat or how much i eat or my weight or anything” and his response is always “making fun of you is how i show love” but i’m not laughing at his jokes, only he is. he has no idea how i feel after he says those things and it’s infuriating! i’m not asking a whole lot, but he refuses to stop because i need “thicker skin.” he has no idea that after he says those things i go and puke my dinner. it couldn’t hurt him to at least TRY to understand how i feel, but he’s so stubborn and he thinks i’m trying to censor him or something by asking him to stop?? it’s like he forgets i have emotions, probably because i never share them with him. because this is how i’m treated when i share my feelings, being told i need thicker skin.",
      "created_utc": 1609020445.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh3obtc",
      "author": "oyyl98",
      "body": "THIS!!! I think it's part of why I got sick in the first place. I've always had a bad relationship with food, but my family always commenting on my weight/body made everything so much worse. I always feel ashamed to eat in front of them. They always talk about how \"weird\" I am because of my eating habits, I can't even imagine what would happen if they found out about what I do. And they also seem to be so proud when I restrict and \"eat clean\" so I feel like sh\\*t when I'm in a b/p cycle ... Nowadays they come at me with the \"how come you eat SO MUCH but never gain weight\" and it makes me want to cry because it just makes recovery almost impossible in my mind. I know I'm not mentally ready to hear what they'd have to say if I gain weight, especially when they see me eat so much and not restrict.",
      "created_utc": 1609015269.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh3pwqj",
      "author": "GumdropAddicted",
      "body": "Relate. The main reason I develop bulimia is because my mum consistently point it out any part of my body that is thick and joking called me \"fatty\" for months. Whenever I eat some sweets, she goes \"I see that you want to fatten yourself.\" And when I lashed out or tell her how hurt I am about it, she be like \"it's just a joke.\" and suddenly gets annoyed about how sensitive I am or completely shrugged my feelings off.\n\nWhat makes me feel worse is that when someone point out how my brother is getting bigger, she will tell them to not comment about my brother's body. She let my brother sulk about it and consistently asking me whether is he fine or not? has he eaten or not?\n\nGuess who is the least favourite child? \")",
      "created_utc": 1609016209.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh3zqyw",
      "author": "against_underscores",
      "body": "I feel that. I've also had people constantly ask me how I lost weight. Most of the time I'll joke and say \"meth\" but it's really uncomfortable and upsetting when you have an ED and constantly have to hear comments about your weight or food intake. I'm sorry you are going through that :(",
      "created_utc": 1609022048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh3t5j3",
      "author": "None",
      "body": "i totally relate to this. my ethnic background & culture involves a lot of “talk” and emphasis on weight— that being, where i come from, skinniness is glorified. so as u can imagine, every time i go to any family gathering they’re all talking about my weight. the thing is though, since it’s america and it’s “unethical” to talk about someone’s weight gain to their face, they won’t say anything if i got bigger. however if i lost weight, as i am rn, they will keep congratulating me or asking me “how i did it” and frankly it makes me very uncomfortable considering i KNOW how i did it (throwing up excessively) and them askin me and congratulating me feels like a constant reminder of what i find the most shameful about me and my routine. it’s also uncomfortable bc i know when they don’t say anything about me looking “good”, i know they’re secretly thinking that i got fatter, which starts giving me more anxiety about my body ...which leads to more purging once i get home. it really sucks. \n\ni’d say my advice to you is to just ignore it. i know that sucks, but family members especially older family members are impossible to change. their beliefs and behavior are rooted in both culture and how they were raised. i know it’s annoying and impolite how they speak to you, but trust me in their eyes, they don’t know they’re doing anything wrong—and they’re not “trying” to be that way. you explaining to them that xyz makes you uncomfortable won’t do much other than make you look dramatic or ungrateful. \n\nrmbr you’re in charge of your own body and mind. it’s not your fault that these people give you shit, but it’s your responsibility to block out things that make you upset. it’s similar to this commonly used situation; you are studying in a room overlooking the highway, and the noise of the traffic (e.g. honking horns) is unbearably distracting. you can’t go out there and tell the cars to shut up, but you CAN choose to ignore it and work around the noise. sitting there and complaining about the noise isnt going to help anything. u have every right to complain and be upset., but in the end that will just harm you more. it’s the same with your family and their comments. you have every right to feel the way you feel, and i’m glad you came to reddit to vent. but your mental health is your responsibility and you should choose to actively block out the noise from your family members. don’t let their shit get in the way of your happiness. you got this bbygirl💞",
      "created_utc": 1609018139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh3cuuo",
      "author": "Waluisi",
      "body": "Wow that’s awful and hella rude about the employees. And it sucks about your parents too. That’s why I try to avoid eating with my mom in the same room because she always has to say something and I’d rather save my energy. Hopefully your family backs off and realizes how hurtful they’re being.",
      "created_utc": 1609008748.0,
      "score": 9,
      "context": [
        {
          "id": "gh3chuk",
          "author": "lalabearie",
          "body": "I absolutely loathe it when my fam or family comment on how much I ate or how little I ate. When i eat “too much” in their eyes, they will say “you will get fat/regain your weight if you continue eating like this”; when i eat “too little”, they will say “you’re already so slim, why are you eating so little? Eat more, you need the nutrients. Dont starve”\n\nWhen i go to a store i frequent, the staffs noticed my weight loss, they will say “you never eat right? Your neck is gonna break if you lose anymore weight”. If i gained weight, they go “why did you gain weight? All the weight you lost is for nothing now”\n\nAlso, i noticed my fam/friends always try to force feed or guilt trip me into eating and if i absolutely lose it, i started saying nasty comments BACK to them, because you know, when balloon expands too much, it explodes. And thats, me.",
          "created_utc": 1609008549.0
        }
      ]
    },
    {
      "id": "gh3aoqh",
      "author": "Waluisi",
      "body": "I know my family also compares me a lot to my skinny guy cousin but I’m like he’s 6’0” and I’m 5’2” obviously he has more room to spread out his weight 🙄🙄...",
      "created_utc": 1609007544.0,
      "score": 3,
      "context": [
        {
          "id": "gh3af6b",
          "author": "Repulsivesoul",
          "body": "Oh god that’s the worst I eat less than my cousin but he’s skinny as hell and I’m... not which it really stressful for me",
          "created_utc": 1609007396.0
        }
      ]
    },
    {
      "id": "gh3hr3a",
      "author": "Waluisi",
      "body": "I’m really sorry you had to deal with that :(\nFamily can be so insensitive",
      "created_utc": 1609011431.0,
      "score": 2,
      "context": [
        {
          "id": "gh3euo7",
          "author": "kekelakes",
          "body": "I had to deal with my sisters self internalized fatphobia . She actually made a comment about how I should get potato salad or rice and not both when I actually look forward to special occasions when I can have both because I literally love the texture of them together. Seriously ruined it for me. \n\nShe’s the one jumping from diet to diet, I’m recovered and just trying to enjoy stuff in moderation but comments like that are super triggering",
          "created_utc": 1609009864.0
        }
      ]
    },
    {
      "id": "gh3hw9p",
      "author": "Waluisi",
      "body": "That’s awful of him to do that. Why can’t dads just... shut their mouths forever. Sorry you had to go through that :(",
      "created_utc": 1609011512.0,
      "score": 3,
      "context": [
        {
          "id": "gh3gjnw",
          "author": "Ordinary_Koala_9839",
          "body": "me fucking too...the other day i felt my dads eyes burning into me and he goes you’re so skinny do you even eat...in front of my whole family...almost bursted into tears",
          "created_utc": 1609010748.0
        }
      ]
    },
    {
      "id": "gh3d2hv",
      "author": "lalabearie",
      "body": "I know, right. *hugs*",
      "created_utc": 1609008867.0,
      "score": 3,
      "context": [
        {
          "id": "gh3chuk",
          "author": "lalabearie",
          "body": "I absolutely loathe it when my fam or family comment on how much I ate or how little I ate. When i eat “too much” in their eyes, they will say “you will get fat/regain your weight if you continue eating like this”; when i eat “too little”, they will say “you’re already so slim, why are you eating so little? Eat more, you need the nutrients. Dont starve”\n\nWhen i go to a store i frequent, the staffs noticed my weight loss, they will say “you never eat right? Your neck is gonna break if you lose anymore weight”. If i gained weight, they go “why did you gain weight? All the weight you lost is for nothing now”\n\nAlso, i noticed my fam/friends always try to force feed or guilt trip me into eating and if i absolutely lose it, i started saying nasty comments BACK to them, because you know, when balloon expands too much, it explodes. And thats, me.",
          "created_utc": 1609008549.0
        },
        {
          "id": "gh3cuuo",
          "author": "Waluisi",
          "body": "Wow that’s awful and hella rude about the employees. And it sucks about your parents too. That’s why I try to avoid eating with my mom in the same room because she always has to say something and I’d rather save my energy. Hopefully your family backs off and realizes how hurtful they’re being.",
          "created_utc": 1609008748.0
        }
      ]
    },
    {
      "id": "gh3b9h6",
      "author": "Repulsivesoul",
      "body": "Yeah hes 6’3-4 and I’m 5’6 but I’m way overweight and trying to loose weight but I tried dieting and more exercise for a few months but nothing changed it’s awful plus my best friend (m) is 6ft and super skinny aswell",
      "created_utc": 1609007872.0,
      "score": 2,
      "context": [
        {
          "id": "gh3af6b",
          "author": "Repulsivesoul",
          "body": "Oh god that’s the worst I eat less than my cousin but he’s skinny as hell and I’m... not which it really stressful for me",
          "created_utc": 1609007396.0
        },
        {
          "id": "gh3aoqh",
          "author": "Waluisi",
          "body": "I know my family also compares me a lot to my skinny guy cousin but I’m like he’s 6’0” and I’m 5’2” obviously he has more room to spread out his weight 🙄🙄...",
          "created_utc": 1609007544.0
        }
      ]
    },
    {
      "id": "gh3sufv",
      "author": "kekelakes",
      "body": "Oh I still got both and said “it’s okay, I’m fine” and she really didn’t really say anything after that. It’s Christmas and there’s crabmeat in the potato salad, let me live !!",
      "created_utc": 1609017955.0,
      "score": 1,
      "context": [
        {
          "id": "gh3euo7",
          "author": "kekelakes",
          "body": "I had to deal with my sisters self internalized fatphobia . She actually made a comment about how I should get potato salad or rice and not both when I actually look forward to special occasions when I can have both because I literally love the texture of them together. Seriously ruined it for me. \n\nShe’s the one jumping from diet to diet, I’m recovered and just trying to enjoy stuff in moderation but comments like that are super triggering",
          "created_utc": 1609009864.0
        },
        {
          "id": "gh3hr3a",
          "author": "Waluisi",
          "body": "I’m really sorry you had to deal with that :(\nFamily can be so insensitive",
          "created_utc": 1609011431.0
        }
      ]
    },
    {
      "id": "gh3hz5d",
      "author": "Ordinary_Koala_9839",
      "body": "thank you love🥺🤍really means a lot",
      "created_utc": 1609011558.0,
      "score": 2,
      "context": [
        {
          "id": "gh3gjnw",
          "author": "Ordinary_Koala_9839",
          "body": "me fucking too...the other day i felt my dads eyes burning into me and he goes you’re so skinny do you even eat...in front of my whole family...almost bursted into tears",
          "created_utc": 1609010748.0
        },
        {
          "id": "gh3hw9p",
          "author": "Waluisi",
          "body": "That’s awful of him to do that. Why can’t dads just... shut their mouths forever. Sorry you had to go through that :(",
          "created_utc": 1609011512.0
        }
      ]
    }
  ]
}