{
  "id": "kmxgto",
  "subreddit": "bulimia",
  "author": "sadgab_",
  "created_utc": 1609312334.0,
  "title": "i’m admitting myself in a few hours",
  "selftext": "Hi I have been struggling with anorexia and bulimia for probably 7 years (Im 21F) I’ve been in recovery since early 2019. I always used purging as a coping mechanism to regulate my emotions (really it just completely numbed me out) and i’ve been purge free for almost a month now, which doesn’t sound like much but it’s a big deal for me and i’ve been going through a really tough time right now and i’ve decided i’m going to admit myself to the local hospital and really choose to take care of myself instead of going back into the throes of an ED. But really i’m terrified, i’m giving up control and I don’t even know how long i’ll be in there or if i’ll be able to have my phone, and my parents don’t even know yet, I know I have to if I want to get better but i’m scared but i’m still trying. Ugh okay it’s like 1am as I write this after a long day of like sobbing and emergency phone calls, and I just wanted to write this to try to hold myself accountable to still go tomorrow. anyways if anyone reads this far send support pls:)",
  "url": "https://www.reddit.com/r/bulimia/comments/kmxgto/im_admitting_myself_in_a_few_hours/",
  "score": 71,
  "num_comments": 9,
  "comments": [
    {
      "id": "ghhkc10",
      "author": "punipunijelly",
      "body": "I hope you come out stronger and better than ever!!!",
      "created_utc": 1609323502.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ghh9yry",
      "author": "teenagemole",
      "body": "You got this! Good on you for breaking the cycle and good luck ❤️",
      "created_utc": 1609313084.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ghi8b7j",
      "author": "AnnieGraced2020",
      "body": "That is awesome babe! We are supporting you on your road to recovery! We wish you well! ♥️",
      "created_utc": 1609342444.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghid7jy",
      "author": "Glitt3ring-G0ld",
      "body": "I really hope you get all the good out of getting some help. I am so proud of you. I wish you nothing but blessings of good health and healing mentally, spiritually and emotionally.",
      "created_utc": 1609345036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghif8gp",
      "author": "Low-Euphoric",
      "body": "I’m sorry to hear you’ve been struggling, but I’m incredibly happy that you chose the way to recovery! Be patient and kind to yourself, sending lots of love",
      "created_utc": 1609346073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghihkoa",
      "author": "19nov97",
      "body": "I’m so proud of your spirit!! You deserve to feel better. I’m also on the road to recovery right now.  Some days are better than others, but I know that we need to push through the tough times if we want to get better. If it’s not hard or uncomfortable, it means we’re not growing and changing. We can do this 💜💜💜",
      "created_utc": 1609347251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghiq365",
      "author": "None",
      "body": "I’m proud of you! You can do this ❤️",
      "created_utc": 1609351442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghhwip0",
      "author": "notthezodiackiller71",
      "body": "This is a massive step forward and I wish you all the best on your recovery journey, from the bottom of my heart ♡",
      "created_utc": 1609334947.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghje0v4",
      "author": "Repulsivesoul",
      "body": "I’m so proud of you it takes a lot of courage to admit you have a problem in the first place but to admit yourself to get the help you really need is astounding. I’m so happy for you and I hope that you come out stronger than ever",
      "created_utc": 1609363275.0,
      "score": 1,
      "context": []
    }
  ]
}