{
  "id": "kogne9",
  "subreddit": "bulimia",
  "author": "villkatt98",
  "created_utc": 1609527255.0,
  "title": "7 years clean and it still affects me.",
  "selftext": "Currently I'm in my 20s, suffered from bulimia as a teenager, but I have been clean since early 2014! I honestly didn't think I'd be alive in 2021, but here we are!\nNow to the story.\nI always used to wash my hands before puking, otherwise it would feel gross (make it make sense xD). My body sorta started connecting the smell of soap with the act of vomiting. I don't know if that's the glycerine, or particular aromas, but this typical smell of soap would make me feel sick ever since my eating disorder has become a thing. When I moved out and I was responsible for buying my own soap, I learnt which ones do, and which ones do not have THAT odor, so I could wash myself without the discomfort.\nI've been spending New Year's Eve at my parents' place. I've had quite a bit of alcohol and felt low-key nauseous purely because of that. At one point I went to the bathroom, had a piss, forgot myself and inhaled the scent of my just washed hands and... Well, you can imagine what happened next.\nHappy New Year to me I guess...",
  "url": "https://www.reddit.com/r/bulimia/comments/kogne9/7_years_clean_and_it_still_affects_me/",
  "score": 100,
  "num_comments": 3,
  "comments": [
    {
      "id": "ghr2dn6",
      "author": "handollxo",
      "body": "Me me me me!! Before I moved out, there was a particular brand of soap my family used (pretty much the whole family has eczema so it was supposed to be an eczema-friendly one). This was the only soap ever bought. I swear, you could blindfold me and have me sniff hundreds of soaps and I’d recognise this one no problem. Anyway, this was also the soap I used before and after throwing up. \nAround March last year I went to visit my parents overseas... first thing I did when I arrived was use the bathroom because I’d just got off a five hour flight lol, went to wash my hands and within 5 seconds was hurling my guts up #classy\n\nIt’s strange isn’t it!",
      "created_utc": 1609530007.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ghrkz9a",
      "author": "graamatvede",
      "body": "Thank you for sharing that. I hope you are feeling a lot better now and back on track. Your share reminds me that I will always be a food addict and this illness cannot be cured but can be treated. \n\nI don't struggle with the smell of sope, but with going to the bathroom with full stomach in general. So I try to avoid overeating at all costs, because the temptation is still there once I feel too full, and if having to go to the bathroom, I must remind myself to get through the next minute without thinking.\n\nSending warmest wishes and lots of kindness.",
      "created_utc": 1609539266.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ght4m02",
      "author": "boderlineboderline",
      "body": "i relate to this so much!! i also get really triggered by being full. i’m not very far into the recovery process (literally purged a couple hours ago) but i am trying really really hard to stop, but eating *just enough* to give me that full heavy stomach feeling just sends me into a spiral and i haven’t been able to stop myself yet. nice to know i’m not alone though <3",
      "created_utc": 1609572854.0,
      "score": 2,
      "context": [
        {
          "id": "ghrkz9a",
          "author": "graamatvede",
          "body": "Thank you for sharing that. I hope you are feeling a lot better now and back on track. Your share reminds me that I will always be a food addict and this illness cannot be cured but can be treated. \n\nI don't struggle with the smell of sope, but with going to the bathroom with full stomach in general. So I try to avoid overeating at all costs, because the temptation is still there once I feel too full, and if having to go to the bathroom, I must remind myself to get through the next minute without thinking.\n\nSending warmest wishes and lots of kindness.",
          "created_utc": 1609539266.0
        }
      ]
    }
  ]
}