{
  "id": "kre3e9",
  "subreddit": "bulimia",
  "author": "emopillbug",
  "created_utc": 1609899832.0,
  "title": "My dad heard me purging",
  "selftext": "We moved the tv into another room which is where my bathroom is, my dad was watching TV and we had finished eating, I couldn't go to his bathroom so I didn't have a choice plus it was early so I couldn't wait for him to leave. I put the sink on and played loud music, I'm pretty quiet when I purge but I made the mistake of being a little too noisy towards the end. Eventually I finished and came out like I was just using the bathroom as normal. \n\nI sat down and he said without skipping a beat he said \"are you throwing up your food?\" \n\"No. Why?\" \n\"Because, I want to make sure. You know I've worked with kids like that for years\" (my father worked with juvenile corrections for more than 10 years) \n\"Yeah I know.\" \n\"You know the stuff that does to your body?\" \n\"Oh yeah I know, it's terrible\" \n\"Okay. I'm. Just making sure.\" \nHopefully my lying came off sincere, he's commented about how I've been losing weight before, the sooner I recover the better, I'm tired of lying to everyone.",
  "url": "https://www.reddit.com/r/bulimia/comments/kre3e9/my_dad_heard_me_purging/",
  "score": 84,
  "num_comments": 4,
  "comments": [
    {
      "id": "gia3ppw",
      "author": "outtie-5000",
      "body": "that’s really nice that he asked you about it. It’s a pretty rare thing that a parent actually has any experience about EDs other than the fake trendy image it has. From the sounds of it, he might’ve felt awkward about bringing up something so personal and hard for you. it might be helpful to consider telling him—even if you don’t tell him everything, just saying “I tried it once and it was really awful. I know all the bad things it does to your body and I know how much better my life would be if I didn’t at all, but it’s just.. hard” might make you feel better. imagine he really just listened and supported you and told you he was there for you and he cared! Already you know he cares enough to pay attention and ask, even if it means being a little awkward\n\nno pressure to of course, good luck with your recovery journey =)",
      "created_utc": 1609916264.0,
      "score": 37,
      "context": []
    },
    {
      "id": "gi9kguo",
      "author": "ZorBa812",
      "body": "Omg I feel you I hate lying to my family!! Hopefully you recover soon<3xoxo",
      "created_utc": 1609904725.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gibagnq",
      "author": "fishsoap69",
      "body": "He’s so sweet. You can tell that if you told him, he’d care and try to help. Maybe if you’re ready to tell him! You got this! Good luck recovering",
      "created_utc": 1609948440.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h2pntb6",
      "author": "anonymouspony2",
      "body": "I'm wishing you luck on your recovery! :) You are stronger than this ed.",
      "created_utc": 1624407210.0,
      "score": 1,
      "context": []
    }
  ]
}