{
  "id": "kyfxry",
  "subreddit": "bulimia",
  "author": "InformalMocha6423",
  "created_utc": 1610789268.0,
  "title": "I didn't believe it was possible! 21 days binge purge free!!",
  "selftext": "I had bulimia for around 4 years, binging and purging daily sometimes up to 4 times. I so badly wanted to get better and tried therapy, medication, meditation, self care, treatment, so many things and nothing worked. Mum always said 'one day love I think you'll be in a better place mentally and just not want to do it anymore' and she was right. \n\nI had my last BP Christmas day and honestly don't know why it stuck but boxing day I just stopped doing it! Everyday I would tell myself 'this is the day you quit' and it never happened until now. I think its been the build up of trying all the mentioned strategies but mainly putting myself first by removing toxic people from my life, stopping dating if I feel judged and self conscious, working on myself and generally just accepting that I dont have to be perfect. \n\nI still have moments where I want to BP and I worry that if something upsetting happens I might, but right now I am just enjoying saving money and time plus not damaging my health!!\n\nI don't know if I'll be of any help but feel free to drop me a message if you want an understanding ear or some advice on things to try that I felt helped me recover. Good luck to you all, you have the power 💕",
  "url": "https://www.reddit.com/r/bulimia/comments/kyfxry/i_didnt_believe_it_was_possible_21_days_binge/",
  "score": 90,
  "num_comments": 7,
  "comments": [
    {
      "id": "gjfwv3f",
      "author": "chognogg",
      "body": "CONGRATULATIONS !!! <3",
      "created_utc": 1610793240.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjg10lv",
      "author": "Particular_Carrot_",
      "body": "That's amazing! Congratulations!",
      "created_utc": 1610795939.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gjhrtia",
      "author": "kkaatt98",
      "body": "Omg i just hit 21 days today too!! 💜💜💜 that means we both decided we’re done with this cycle on the same day 💕💕🙌🏼 stay motivated! I’ll keep you in mind next time the urge hits. Super good job. I know how big of a deal this is",
      "created_utc": 1610824491.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjgwmqu",
      "author": "notthezodiackiller71",
      "body": "I'M SO PROUD OF YOU!! Keep going, this is a huge success ♡",
      "created_utc": 1610811826.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjhpdag",
      "author": "millennialpink_03",
      "body": "This is absolutely amazing! I have been 2 months binge and purge free! We can do this. Like you, certain situations have still triggered me but I always wait for them to pass.",
      "created_utc": 1610823471.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjibmvs",
      "author": "InformalMocha6423",
      "body": "Ee congratulations!! Recovery buddies 😊 I'll keep you in mind too, nice to know someone else is out there probably feeling similar to yourself with this! So proud of both of us, let's keep it going 💪🏽💕💕",
      "created_utc": 1610833437.0,
      "score": 2,
      "context": [
        {
          "id": "gjhrtia",
          "author": "kkaatt98",
          "body": "Omg i just hit 21 days today too!! 💜💜💜 that means we both decided we’re done with this cycle on the same day 💕💕🙌🏼 stay motivated! I’ll keep you in mind next time the urge hits. Super good job. I know how big of a deal this is",
          "created_utc": 1610824491.0
        }
      ]
    },
    {
      "id": "gjibdje",
      "author": "InformalMocha6423",
      "body": "That's amazing, well done!! Fingers crossed I make that too 🤗 Crazy looking back at how difficult it felt to stop for ages. Wishing you continued good luck and strength with beating it!",
      "created_utc": 1610833298.0,
      "score": 2,
      "context": [
        {
          "id": "gjhpdag",
          "author": "millennialpink_03",
          "body": "This is absolutely amazing! I have been 2 months binge and purge free! We can do this. Like you, certain situations have still triggered me but I always wait for them to pass.",
          "created_utc": 1610823471.0
        }
      ]
    }
  ]
}