{
  "id": "l0audc",
  "subreddit": "bulimia",
  "author": "anonforlong",
  "created_utc": 1611025959.0,
  "title": "The idea of food is almost stronger than actually eating it",
  "selftext": "So I engage in restrict binge / purge type of behavior. I literally think about what I’m going to binge on for dinner all day, and then the second I start eating it I’m like “wow this isn’t nearly as satisfying as I thought it would be”. But regardless I continue binging because I’m convinced that I can find something that will “satisfy” the craving. After every b/p episode I am fully convinced that I will not crave these foods I’m restricting anymore because of that feeling of being “unsatisfied” in the midst of / after a binge. But then the next morning I wake up and it feels like all of those feelings fly out the window and I’m back to craving foods that the night before I didn’t even understand why I was hyping them up. Idk if this makes sense but the moral of the story is that I’m addicted to the idea and ritual around food more than I am addicted to the *actual* taste of the food. Yes, of course the food tastes great when I’m eating it, but it’s never as great as I think it’s gonna be. The food is never as good as the glorified image that I make of it in my head. My brain feels so fucked . UGH. Anyways , yeah.\n\nEdit: I never expect my posts to blow up aha. It makes me feel less alone to hear that so many people can relate, but at the same time Im sorry that many of you are enduring this awful struggle as well. Shit sucks:/ regardless, I am happy I could articulate what many of you feel as well. Much love to all, hang in there <3",
  "url": "https://www.reddit.com/r/bulimia/comments/l0audc/the_idea_of_food_is_almost_stronger_than_actually/",
  "score": 145,
  "num_comments": 9,
  "comments": [
    {
      "id": "gjtdnf9",
      "author": "neon__knights",
      "body": "Oh my god you put my feelings into words perfectly. And it's such a shitty feeling like why tf i literally crave that thing again when i know exactly that it's not that good at all?? It's sucks being this hyper aware of the issues with our thoughts yet still unable to stop it.",
      "created_utc": 1611049840.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gju83v2",
      "author": "Fit-Olive-874",
      "body": "I feel this so hardddd. What worked for me was eating them and not purging it’s so scary but I’m b/p free for three weeks now!!!!",
      "created_utc": 1611070917.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gjtmn3u",
      "author": "catnipples19",
      "body": "perfecyly said :(",
      "created_utc": 1611058209.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gjurfag",
      "author": "eaklv",
      "body": "For me I am actually starting to not enjoy binges anymore. I have low blood sugar in the morning sometimes and it's probably the only time I enjoy bingeing now. If I do not binge in the morning and get through most of the day without doing it I just kind of feel better and would rather not eat at all. I feel like lately from b/p so long after having previously been anorexic for years it's kind of coming back. I don't want to b/p anymore because it kind of feels pointless and unsatisfactory but eating a normal amount isn't either so I'm just kind of not wanting to bother with food anymore. I used to chew and spit and at a certain point that didn't do it for me so I began to binge and purge and now that's starting to feel the same way. I wanted food so bad for years and now it's kind of whatever, not worth the guilt of ingesting it half the time honestly.",
      "created_utc": 1611079728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gju5p7y",
      "author": "None",
      "body": "That is exactly how I feel, omg. Sometimes it helps me to take a little bite and try to realize “wow, this ain’t even that good” but not always workin",
      "created_utc": 1611069757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjun8ij",
      "author": "avadamaris",
      "body": "100% 100% 100%. holy crap, i coulda written this. guess it's somewhat of a comfort to know im not alone!",
      "created_utc": 1611077854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjtub3n",
      "author": "JuliaGulia818",
      "body": "This is exactly how I feel after a while on antidepressants. I want to binge, but the thought of all the effort involved and how ultimately unsatisfying it would be turns me off.",
      "created_utc": 1611063645.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjudx0w",
      "author": "threeoclockblue",
      "body": "i was just about the write the same thing. i’ve been trying to associate the urge to binge and purge with that feeling of discomfort rather than satisfaction. still working on it :/",
      "created_utc": 1611073661.0,
      "score": 3,
      "context": [
        {
          "id": "gjtdnf9",
          "author": "neon__knights",
          "body": "Oh my god you put my feelings into words perfectly. And it's such a shitty feeling like why tf i literally crave that thing again when i know exactly that it's not that good at all?? It's sucks being this hyper aware of the issues with our thoughts yet still unable to stop it.",
          "created_utc": 1611049840.0
        }
      ]
    },
    {
      "id": "gjvki53",
      "author": "neon__knights",
      "body": "that is so amazing, congrats!!",
      "created_utc": 1611092875.0,
      "score": 1,
      "context": [
        {
          "id": "gju83v2",
          "author": "Fit-Olive-874",
          "body": "I feel this so hardddd. What worked for me was eating them and not purging it’s so scary but I’m b/p free for three weeks now!!!!",
          "created_utc": 1611070917.0
        }
      ]
    }
  ]
}