{
  "id": "l2qgut",
  "subreddit": "bulimia",
  "author": "KnownCherry8",
  "created_utc": 1611330834.0,
  "title": "the competitive side of eating disorders",
  "selftext": "nobody really talks about this too much. the competitive side of having an eating disorder sucks so bad. it makes me feel like such a shitty person. my friend posted some pictures yesterday and she looked so skinny. i haven't seen her in a while and i've honestly suspected that she might have an eating disorder just from some posts she's made previously. but instead of being worried, like a human should, i was jealous and depressed. \n\n\nwhy does seeing other people lose weight hit me in such a wrong place? my friend might be sick and all i can think about is myself. i hate it, but i can't stop it. i can't. i'm 11 weeks purge free and in recovery/therapy, but i want to lose more weight and purging/restricting was the only thing that worked for me.\n\n\ni guess i feel like if i don't lose as much weight as she does, my eating disorder isn't valid. i know it's dumb. but i probably haven't lost nearly as much weight as her. and it makes me feel like shit. \n\n\ni feel awful for posting this. i feel like the shittiest person alive. but i just have to know if someone else has felt like this.",
  "url": "https://www.reddit.com/r/bulimia/comments/l2qgut/the_competitive_side_of_eating_disorders/",
  "score": 151,
  "num_comments": 13,
  "comments": [
    {
      "id": "gk74i8h",
      "author": "JuliePBJ",
      "body": "This 1000% is true. Eating disorders are sooooo competitive. \n\nI’d like to say that you do sound concerned about your friend though. You are aware of your ‘eating disorder thoughts’ and how they different from being concerned about the amount of weight she’s lost. \n\nEating disorders suck because they take up so much of our thoughts. It sounds like your eating disorder thoughts are getting in the way of you being able to display concern for you friend. Doesn’t make you a terrible person. Just shows how much of your thoughts your ED occupies. \n\nCongrats on your 11 weeks streak! That’s not an easy feat. Keep kicking your ED to the curb and I’m sure eventually these intrusive thoughts and feelings won’t be as strong. :)",
      "created_utc": 1611332783.0,
      "score": 35,
      "context": []
    },
    {
      "id": "gk78hro",
      "author": "None",
      "body": "I feel like this too.",
      "created_utc": 1611333959.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gk7ykjd",
      "author": "maverick2598",
      "body": "If it’s any consolation, I share similar experiences with competitiveness, the most ongoing being with my younger brother who, while being the most genetically similar to me, is somehow the type of person who have to work extra hard to put on weight and has remained at a lower weight than me(attractively and effortlessly lol) with the same height. Very frustrating lmao. He’s both and inspiration and a source of futile comparison that just makes me want to drive deeper into behaviors. The most recent competition has been his new girlfriend who is a model🙄 Lmao and is in denial about her ED with a mf thigh gap for daysss gah damn. Shit is mad frustrating. Sorry for the rant lol",
      "created_utc": 1611341588.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gk7v5wq",
      "author": "None",
      "body": "I relate to this sooooo much. Good job for being 11 weeks purge-free!! ❤️",
      "created_utc": 1611340500.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gk7tuf1",
      "author": "Domino11787",
      "body": "I know exactly how you feel. You are not alone and you are not wrong/bad for feeling that way. Much luck on your recovery journey. You can do it!",
      "created_utc": 1611340113.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gk8783w",
      "author": "Low-Euphoric",
      "body": "There’s no need to feel bad about what you feel, I’m glad that you’re getting them out somewhere instead of bottling them in shame. There is nothing wrong with you for experiencing those feelings, you are experiencing them for a reason and you don’t have much of a choice either, so you’re not a bas person for something that is out of your control. Lots of people feel this way, they just don’t voice it. \n\nI hope you remind yourself why you chose recovery. I believe in you ❤️",
      "created_utc": 1611344208.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkabwwf",
      "author": "throwaway1930488888",
      "body": "Yes. For sure. It really sucks because I’ve been actively trying to change my immediate thoughts from, “What? Is this girl anorexic or what? Man... I wish I was skinny like her. She would never understand what it’s like to deal with this sort of stuff. Guess I’m relapsing now.” \n\n\nTo, “Nope. She’s gorgeous and you know it. She has good muscle, good amount of fat, vibrant. She most likely doesn’t have an ED. It’s okay that’s more thin. You don’t have to be like her.” \n\nIt sucks and I feel like a shitty person because although I don’t genuinely mean the first response, it’s still my immediate response. It’s been getting better, but it’s hard.",
      "created_utc": 1611371581.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkaca9y",
      "author": "manicpanicbp",
      "body": "don’t beat yourself up \n\nyou are reflecting now which means so so so much\n\ninitial reactions are so normal. this exact thing happened to me and instead of asking my friend how she was doing- i was jealous and stayed silent. i later talked to her and it make our connection stronger :) \n\ni’m upset with myself but we have to notice that we are trying our best and learning ❤️❤️\n\n\nALSO CONGRATULATIONS BABYYYY 11 WEEKS IS SOME BIG THJNGS!!!",
      "created_utc": 1611371789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkatee8",
      "author": "itstriplextina",
      "body": "I’m in residential treatment right now and I’m at the point where even the STAFF trigger me if they’re skinny! I always assume that they have hidden eating disorders and it sends me into a spiral in which I feel they’re judging us for eating food and gaining weight and my competitive side comes out. Not to mention the unspoken competition between patients. I don’t know how to turn it off.",
      "created_utc": 1611378676.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkawpj3",
      "author": "bettie-rage",
      "body": "Yeah... it’s definitely terrible. I am very competitive with my friend but she lives 3 hours away so we only see each other on WhatsApp. I haven’t been telling her I lost weight and keep showing her pics of my fatty foods to make her think I’m not doing good on my diet. If she thought I was losing weight she would restrict harder, work out harder, forget to eat, etc. We both weight lift and when I finally told her my numbers she shot up to catch up to me. She doesn’t claim to have an ED but the competition is bad all the same. It’s so frustrating.",
      "created_utc": 1611379906.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkcdzgz",
      "author": "maduhlinn",
      "body": "My ed puts on this vision for myself that people are simply there to compare yourself to, oh and they have the most critical judgments too. My ed tells me life is one big competition for who can be the ‘best.’ whatever the fuck that means... I recognize these thoughts as stemming from feelings of anxiety about my own perceptions of society/body appearance and I categorize them as such; thoughts. We are not our thoughts but our actions. I have to recognize when my thoughts are inherently negative/self loathing/ just plain unnecessary. Awareness is key.",
      "created_utc": 1611399360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkixbnv",
      "author": "None",
      "body": "Yes! I want to lose weight while still getting bigger muscles than other people at the gym. I lost 3kg in two weeks, felt weak as fuck, and yet couldn't help but feel personally offended by the guys' muscles while they were working out (I'm a girl and probably half of their weight, but I DONT CARE, I SHOULD BE ABLE TO LIFT MORE) 🤦🏻‍♀️",
      "created_utc": 1611481850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gk7eonc",
      "author": "Organic-Mountain-623",
      "body": "This is a perfect explanation.",
      "created_utc": 1611335788.0,
      "score": 7,
      "context": [
        {
          "id": "gk74i8h",
          "author": "JuliePBJ",
          "body": "This 1000% is true. Eating disorders are sooooo competitive. \n\nI’d like to say that you do sound concerned about your friend though. You are aware of your ‘eating disorder thoughts’ and how they different from being concerned about the amount of weight she’s lost. \n\nEating disorders suck because they take up so much of our thoughts. It sounds like your eating disorder thoughts are getting in the way of you being able to display concern for you friend. Doesn’t make you a terrible person. Just shows how much of your thoughts your ED occupies. \n\nCongrats on your 11 weeks streak! That’s not an easy feat. Keep kicking your ED to the curb and I’m sure eventually these intrusive thoughts and feelings won’t be as strong. :)",
          "created_utc": 1611332783.0
        }
      ]
    }
  ]
}