{
  "id": "l35w7d",
  "subreddit": "bulimia",
  "author": "Illustrious-Ad5059",
  "created_utc": 1611379012.0,
  "title": "There’s gotta be more than this",
  "selftext": "It’s so weird how seamlessly an eating disorder can coexist into your life. At one point it becomes so imbedded that you think nothing of it. Binge. Purge. Restrict. It’s almost like second nature. Here I am, living a completely normal life. Working a normal job and doing normal people shit. I don’t even think about it anymore. It’s just how my life works. Occasionally I’ll have moments of clarity with my head in the toilet bowl but it’s nothing more than a fleeting thought. I stopped looking at this page because every time I visit I’m reminded that my perfectly normal world is entirely fucked up.",
  "url": "https://www.reddit.com/r/bulimia/comments/l35w7d/theres_gotta_be_more_than_this/",
  "score": 104,
  "num_comments": 8,
  "comments": [
    {
      "id": "gkb03ks",
      "author": "punipunijelly",
      "body": "Very well put",
      "created_utc": 1611381237.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gkb8tc6",
      "author": "None",
      "body": "Even it’s consequences feel normal now too. I just as easily accept that I won’t be president or go to Mars  as I accept that I can’t go to xxx outing because I won’t be home to purge soon enough or that Id break up with an SO before living together",
      "created_utc": 1611385145.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gkdjwwx",
      "author": "tinykate25",
      "body": "I’ve been doing it for so long I sometimes forget it’s even a eating disorder , I can’t remember when was the last time I ever kept my food down",
      "created_utc": 1611411804.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gkcazoy",
      "author": "None",
      "body": "I said something like this in therapy last week. People think I’m so nice and normal , that I just lost weight and that’s it. People have no idea about the binge/purge/restrict monster that lives inside me. I’ve said “this is just my life now, this is how we eat and view food” to myself so many times. This is my life now. You are not alone!!",
      "created_utc": 1611398311.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gkg5a3c",
      "author": "sweetpotatoqkween",
      "body": "I’ve gotten to a point with this eating disorder that my mental health and physical health is seriously suffering. Like palpitations, weird muscles sensations and tingling, blood sugar issues, dizziness, insomnia, and overall I feel SO NOT OK and not normal but at the same time I’m so used to it. Living like this has become my default. I had to take time off from college due to my mental health and eating disorder interfering and my relationships have suffered but I still work full time and am kinda living a normal life. I forget  it’s not normal to live in this state of constant suffering. I can’t even imagine how good it feels to live without bulimia, without daily binging and purging, without panicking after every meal. It makes me kinda hopeful but also scared and sad because right now it feels so out of reach.",
      "created_utc": 1611437224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkfrhyn",
      "author": "workingonselfkind",
      "body": "Omg.  You put words to what my experience is right now. And while I’m being honest, my life for the last 14 years.",
      "created_utc": 1611432780.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkg5uar",
      "author": "sweetpotatoqkween",
      "body": "Also the last time I went a week without b/p was 4 years ago, the last time I went a day was 3 month ago? I forget how not healthy that is.... like what the fuck. My body and mind cannot possibly be functioning okay. I don’t remember what it feels like to be healthy.",
      "created_utc": 1611437384.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkc0p91",
      "author": "Illustrious-Ad5059",
      "body": "So true. Consequences lose their effectiveness if you just get use to them.",
      "created_utc": 1611395370.0,
      "score": 3,
      "context": [
        {
          "id": "gkb8tc6",
          "author": "None",
          "body": "Even it’s consequences feel normal now too. I just as easily accept that I won’t be president or go to Mars  as I accept that I can’t go to xxx outing because I won’t be home to purge soon enough or that Id break up with an SO before living together",
          "created_utc": 1611385145.0
        }
      ]
    }
  ]
}