{
  "id": "l434sf",
  "subreddit": "bulimia",
  "author": "IllustriousWin1821",
  "created_utc": 1611507495.0,
  "title": "Day 4 of actually keeping nutrients in my body.",
  "selftext": "Hey everyone! I've been a lurker on here for awhile but I've been a severe bulimic for around 5 years now, unfortunately last week I started to see the effects my body was enduring because of it. It honestly woke me up in a way I've never felt before and I decided I needed to try to change for the better. Trying to curb the constant feeling of wanting to binge than completely eliminating everything I had put in my body in a 7 minute period, its been so difficult not only that but telling my close friends and family about what I have been suffering with for some time now in desperation because I could feel my body dwindling away. To keep it short last week I had completely lost hope but I still needed to keep trying, as of today I have been able to fully eat 4 meals with water included and keep it down and I haven't felt this good in awhile. Normally I'd be way to nervous to write this let alone on a forum for others to see but if you feel like hope is nowhere in sight; you're wrong recovery is possible! Man it feels good to be alive today.",
  "url": "https://www.reddit.com/r/bulimia/comments/l434sf/day_4_of_actually_keeping_nutrients_in_my_body/",
  "score": 103,
  "num_comments": 9,
  "comments": [
    {
      "id": "gklq8zm",
      "author": "guide_me_stars",
      "body": "This is such an incredible achievement! You are an inspiration to me, I wish I could one day reach this point. Sending you so much love and support!",
      "created_utc": 1611507754.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gkmy0ai",
      "author": "Cmonta14",
      "body": "So proud!! Keep it up, and if something emotionally difficult/stressful comes your way try to reflect carefully, take a deep breath, and don’t let it ruin all the hard work you’ve done so far. Remember this amazing feeling you have right now and try to recall it when things get hard and trigger you to want to numb yourself in food.",
      "created_utc": 1611524413.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gkmm9g4",
      "author": "kookie_doe",
      "body": "Proud of you!! You can do it",
      "created_utc": 1611518813.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gknn5ui",
      "author": "E_lu_diesel",
      "body": "🎉🙌🏼",
      "created_utc": 1611536142.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gknsxls",
      "author": "off_brand_kirby",
      "body": "if you feel comfortable sharing, what negative effects did your ed start to have in your body?",
      "created_utc": 1611539077.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkopx9o",
      "author": "sockmaster420",
      "body": "I’m so proud of you! If you’re ever searching fir reasons to keep going, think of your teeth. They will thank you for your effort ❤️",
      "created_utc": 1611560321.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gknzhuh",
      "author": "threeoclockblue",
      "body": "so happy for you!! this truly gave me some hope :)",
      "created_utc": 1611542414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkoqhst",
      "author": "IllustriousWin1821",
      "body": "yeah absolutely I'll just give you a list. Bad acne, thinning hair, teeth deterioration, constant dehydration, terrible blood flow, inconsistent menstrual cycle, and as of recently an inflamed appendix. Don't even get me started on the mental strain. Just in 5 days of actually receiving nutrients my body needs i can see a difference I'm glowing honestly.",
      "created_utc": 1611560847.0,
      "score": 3,
      "context": [
        {
          "id": "gknsxls",
          "author": "off_brand_kirby",
          "body": "if you feel comfortable sharing, what negative effects did your ed start to have in your body?",
          "created_utc": 1611539077.0
        }
      ]
    },
    {
      "id": "gkoqlpp",
      "author": "IllustriousWin1821",
      "body": "Absolutely! I've been on and off with my teeth for awhile now i started whitening them over quarantine and they've appreciated the break this past week.",
      "created_utc": 1611560948.0,
      "score": 2,
      "context": [
        {
          "id": "gkopx9o",
          "author": "sockmaster420",
          "body": "I’m so proud of you! If you’re ever searching fir reasons to keep going, think of your teeth. They will thank you for your effort ❤️",
          "created_utc": 1611560321.0
        }
      ]
    }
  ]
}