{
  "id": "l4n6y9",
  "subreddit": "bulimia",
  "author": "sarahodri",
  "created_utc": 1611578837.0,
  "title": "At this point, it feels more like an addiction than anything else.",
  "selftext": "I think bulimia definitely BEGAN with me as a result of over-restricting, but over time it's become an addiction. It doesn't matter if I restrict or eat 2000 kcal a day, it's like I can't get through the day without it. Even if I'm not hungry - hell, even if I'm not even in the mood for eating, I have to b/p or else I'll feel restless and irritable and depressed. Honestly I don't even know how to recover at this point. I've gained loads of weight (I'm now on the higher end of the healthy BMI spectrum) and that doesn't even bother me anymore. It's not about my appearance, it's about the act of b/p-ing itself. I just don't even remember how I used to function before this all began 3 years ago. My problem with all the advice people give me is that it doesn't really apply to me; people assume that I'm restricting, or that i have bad body image, or that i feel guilty after eating. But really, while maybe that used to be the case, at this point none of those things apply. I don't feel food guilt, I really am just addicted to the act itself. :( If I just have a 'normal' sized meal and feel physically full, mentally I feel completely dissatisfied and restless. \n\n&#x200B;\n\nSorry for this post; I just don't have anyone to talk about this to IRL and needed to offload.  :(",
  "url": "https://www.reddit.com/r/bulimia/comments/l4n6y9/at_this_point_it_feels_more_like_an_addiction/",
  "score": 137,
  "num_comments": 20,
  "comments": [
    {
      "id": "gkpxfh2",
      "author": "threeoclockblue",
      "body": "i am absolutely with you here :( i’m just so addicted to the process even though i don’t really get any enjoyment out of it. so sorry that you’re also stuck in this hole and i hope you can get through this soon 💕",
      "created_utc": 1611591130.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gkpyiyt",
      "author": "dexterdrag",
      "body": "It has always been about weight for me. I actually gained weight last year when my bulimic activities were at an all time high. I freaked out and started to live a healthy life and weight has started to decrease, slowly.\n\nI should be happy and healthy, no?\n\nAlthough my current state of being may be due to other host of issues, I can't help but want to binge and purge so I can feel like everything will be OK.\n\nThe act of purging to me is calming. I usually sleep so well after purging. The anxiety is building up and I'm quite sure something will happen and I'll snap back.\n\nAs is, I'm looking for excuses to purge. Not losing weight in itself is an excuse. Looking ugly as someone who has no idea I exist is beautiful, is an excuse. My family commented I lost weight is an excuse. It is frustrating that I feel inadequate without purging as if I'm slightly but constantly unhinged.",
      "created_utc": 1611591567.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gkqc5ul",
      "author": "actoored",
      "body": "Part of it is still the weight and body image for me, but I totally get the addiction  part too. It's sick and twisted but the release I feel from throwing up food, especially when it's violent and lots of it comes up, gives me so much relief. It's physically taxing but also... kinda freeing? which is super messed up, I know, but well, it's called a disorder for a reason amirite",
      "created_utc": 1611597400.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gkr9vfi",
      "author": "MaeveTheLion",
      "body": "100% 🙌\n\nThe peeps at the John Hopkins institute for eating disorders have a few videos that talk about their approach to treatment. One woman makes the point that eating disorders are a bit like a stone rolling down a hill. Something happens that gets the stone rolling, but it's a different force that keeps it going downhill. You have to learn to stop the momentum, and then also address what got it started.\n\nIt takes time to rewire habits.",
      "created_utc": 1611612478.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gkpunku",
      "author": "bitchwhorehannah",
      "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
      "created_utc": 1611589979.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gkqy8x0",
      "author": "paradoxrevel",
      "body": "I resonate so much with this feeling. My experience was that I had to do some trauma work bc the bulimic behaviors were helping me cope with some painful stuff. It's great you're no longer restricting, but if there's trauma (even low-key stuff - simply having an ED can be a source of trauma) beneath the surface, until you have some other ways of coping, the ED can serve as a survival skill. <3",
      "created_utc": 1611607121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkrqxo2",
      "author": "taco_smasher69",
      "body": "Something that doesn't get mentioned that much and definitely needs to be mentioned more is that constant bulimia can actually deform your face. Your parotid glands will get enlarged from the over stimulation caused by bulimia and you will end up with chipmunk cheeks. Next time you purge, look in the mirror and see how much wider your face has become. In most cases, it will shrink in a few days/weeks if you are lucky and don't purge.\n\nSome unlucky people will have to undergo surgery to get rid of the chipmunk cheeks. This will run you about 60k as its doubtful insurance will pay for it. Please keep this in mind each time you purge. Many people think it's harmless and will keep your weight down, however you may end up having a skinny body but a fat face.\n\nThis is an awful awful condition and I hope this shocks people enough to think twice about purging. Good luck to you.\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1288/00005537-198505000-00015](https://onlinelibrary.wiley.com/doi/pdf/10.1288/00005537-198505000-00015)\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5878158/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5878158/)\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2397568/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2397568/)",
      "created_utc": 1611621078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkqyh9w",
      "author": "Nuitella",
      "body": "You might want to try chewing mint gums, or as said before, vaping (nicotine-free eliquids, if you're not a smoker or past smoker)\n\nIts replacing an addiction with another yes, but maybe a less draining one for your body in the long run. Also maybe easier to eventually quit than food addiction since you cant 'quit' food. Good luck",
      "created_utc": 1611607225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkr6hwv",
      "author": "bamaveganslut",
      "body": "You’re brain is addicted to it bc it’s habit forming the good news is your brain can gradually be rewired. Prozac helps and just gradually tapering off. Like try to go 1/2 day, one day a week, two days a week, two days in a row over, three days in a row over course of a month. Eventually I was able to go a week and that’s when I realized it became about weight control",
      "created_utc": 1611610864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrdnzb",
      "author": "ctrlaltdeleetme",
      "body": "wellbutrin is really good for kicking addictions bc it works on your dopamine, it’s actually even indicated for smoking cessation. it helped my b/p cycle a lot but you have to be careful not to fall into restricting because it makes food muchhh less rewarding.",
      "created_utc": 1611614306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrdxft",
      "author": "cburnard",
      "body": "yeah this happened to me but the self hatred was definitely a part. idk, it just felt out of my control at some point and it would tae the whisper of a thought for me to be triggered into doing it. i can't really recommend what i did b/c it was equally destructive (addiction swapping), so i am just here to say you should seek professional help if you can.\n\nalso, you're not alone.",
      "created_utc": 1611614436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrkw4u",
      "author": "madisonv09",
      "body": "This is me.",
      "created_utc": 1611617901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrpngq",
      "author": "Important-Map8628",
      "body": "I feel exactly like this.. but also I'm super scared of gaining weight. So I know that it doesn't help for me to eat normally, because I will still b/p anyway, so I do restrict. I've tried and sometimes I even succeed on being b/p free for a little while on this 8 years journey. It's just so bad addiction really. Today I've been eating pretty good, but still I feel like I can't cope without doing it. Like my brain doesn't function. I feel anxious and restless. I really need help and I'm so fuckin done with this. But when I've been b/p free for a while, there comes this voice in my head 'this one time doesn't matter' like I justify for myself doing it. I feel like I'm being extra stupid for giving it in, because I know that it will get out of hand every fuckin time. I'm so scared that I will never get rid of this mentality. I feel so complex. My brain just fucks me over.",
      "created_utc": 1611620396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrwsi2",
      "author": "anonforlong",
      "body": "I feel this. I used to smoke weed everyday and blamed the weed for my b/p. I thought the weed was the dominant addiction, and that the b/p was just the bi product. I had it completely twisted - it was the other way around. once I stopped smoking weed, I thought I could stop b/p. I quickly realized I was wrong. The weed helped me neglect just how bad my ED had gotten. It’s the ritual around food that is addicting. It’s the sense of “indulgence” mixed with some skewed sense of “control” that is the most addicting thing for me.",
      "created_utc": 1611624187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkulg43",
      "author": "psychicglade",
      "body": "I super super relate to this (though weight was always still a part of it) but the release I got from b/p was such a relief each time. When I started recovery, I also became a lot more emotionally unstable and am still working on figuring out how to regulate myself properly, because b/p was like my fix for so long.\n\nThis is just my experience and I'm sure others have had better ones, but all of the ED therapists I tried were extremely resistant to looking at b/p as an addiction and would always correct me by saying \"you can't be addicted to food.\" I understood why they said that but it made me feel really invalidated. This was actually one of the big reasons I found more success with conventional therapy--I think my relationship to bulimia might have been so influenced by other stuff I needed to work out that I got more help there. \n\nAlso, on the addiction note, Topamax was a key part in helping me recover. At higher doses it can have unpleasant side effects, but I don't even notice it at a low dose and still take it even now.",
      "created_utc": 1611684860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkwxn7k",
      "author": "bootyshakaa",
      "body": "I hear this in my soul. You want to fight it so much but you fucking can’t stop thinking about it. It’s like food is screaming at me to eat it so I finally do, and then I’m just completely ashamed and need to remove the whole situation. It’s like purging allows me to go back in time and pretend like it never happened.",
      "created_utc": 1611723623.0,
      "score": 1,
      "context": [
        {
          "id": "gkqc5ul",
          "author": "actoored",
          "body": "Part of it is still the weight and body image for me, but I totally get the addiction  part too. It's sick and twisted but the release I feel from throwing up food, especially when it's violent and lots of it comes up, gives me so much relief. It's physically taxing but also... kinda freeing? which is super messed up, I know, but well, it's called a disorder for a reason amirite",
          "created_utc": 1611597400.0
        }
      ]
    },
    {
      "id": "gkqxd9l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611606728.0,
      "score": 3,
      "context": [
        {
          "id": "gkpunku",
          "author": "bitchwhorehannah",
          "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
          "created_utc": 1611589979.0
        }
      ]
    },
    {
      "id": "gkpva8l",
      "author": "The-Vomiter",
      "body": "I think it’s better to find a hobby instead of give yourself a nicotine addiction.",
      "created_utc": 1611590242.0,
      "score": -2,
      "context": [
        {
          "id": "gkpunku",
          "author": "bitchwhorehannah",
          "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
          "created_utc": 1611589979.0
        }
      ]
    },
    {
      "id": "gkqxtlk",
      "author": "Nuitella",
      "body": "This",
      "created_utc": 1611606930.0,
      "score": 3,
      "context": [
        {
          "id": "gkpunku",
          "author": "bitchwhorehannah",
          "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
          "created_utc": 1611589979.0
        },
        {
          "id": "gkqxd9l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611606728.0
        }
      ]
    },
    {
      "id": "gkrj0ub",
      "author": "bitchwhorehannah",
      "body": "well, vaping + caffeine is what did it for me. the combination is what does the trick",
      "created_utc": 1611616947.0,
      "score": 1,
      "context": [
        {
          "id": "gkpunku",
          "author": "bitchwhorehannah",
          "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
          "created_utc": 1611589979.0
        },
        {
          "id": "gkqxd9l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611606728.0
        }
      ]
    },
    {
      "id": "gkpvlih",
      "author": "bitchwhorehannah",
      "body": "yeah i know, i tried picking up knitting, painting, beading, makeup, photoshop, video games,, nothing makes me happy and i want to k word myself everytime i try and do something i enjoy. like i love knitting, but every time i do it now i feel so shitty and bad",
      "created_utc": 1611590372.0,
      "score": 10,
      "context": [
        {
          "id": "gkpunku",
          "author": "bitchwhorehannah",
          "body": "i was in this same boat, then i picked up vaping. i know it’s not good to replace one bad habit with another bad habit but. i b/p way less frequently",
          "created_utc": 1611589979.0
        },
        {
          "id": "gkpva8l",
          "author": "The-Vomiter",
          "body": "I think it’s better to find a hobby instead of give yourself a nicotine addiction.",
          "created_utc": 1611590242.0
        }
      ]
    }
  ]
}