{
  "id": "l6zr09",
  "subreddit": "bulimia",
  "author": "lavastoviglie",
  "created_utc": 1611847827.0,
  "title": "How are you supposed to recover if you're overweight?",
  "selftext": "I don't understand how to go about recovery when, medically, I should be losing weight (my BMI is in the overweight range).  I've been gradually losing weight the past few months and I'm assuming I would gain weight in recovery.  How do you grapple with this?  Does anyone else have this issue?",
  "url": "https://www.reddit.com/r/bulimia/comments/l6zr09/how_are_you_supposed_to_recover_if_youre/",
  "score": 142,
  "num_comments": 19,
  "comments": [
    {
      "id": "gl45a3u",
      "author": "counting_the_ways",
      "body": "Upvoting this because I hope people see this and comment. I’m usually just a lurker but, hi, I have the same problem. Every time I stop purging -even when I don’t think I’m binging/overeating -my weight goes up... and it needs to go down. Medically.",
      "created_utc": 1611852744.0,
      "score": 60,
      "context": []
    },
    {
      "id": "gl4kpkv",
      "author": "so_long_lamp",
      "body": "It's a struggle, I'm not going to lie. It probably took me 3 years to finally convince myself that I deserve to have a healthy relationship with food. For me at least, it comes down to being able to forgive yourself. The biggest thing was telling myself: it's ok that you're overweight, you are still valid. Your problems are valid. If I want to be a healthy weight, do it like everybody else; eat healthy and work out. Just not too much, lol. I'm not perfect, and I'm not recovered (kind of the opposite thanks to some recent events). But I'm working on it.",
      "created_utc": 1611858618.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gl4vnrt",
      "author": "None",
      "body": "I wish I freaking knew. I started an intensive outpatient ed treatment program and the first day the therapist told us people on recovery usually gain at first. I'm already overweight, and I already felt out of place (whose idea was it to have underweight and overweight people in the same ED group??? Triggering beyond belief) I never went back. I guess in my head I thought treatment meant they'd rewire my brain to restrict instead of b/p.",
      "created_utc": 1611862840.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gl538vk",
      "author": "psychicglade",
      "body": "Hey, I'm been overweight at a lot of points in my illness and really feel you on this. If you want you can check my post history on this sub. A few days ago I wrote a bit about changes in my body since starting recovery, and am starting to understand that bulimia has only ever been an enemy to my weight loss. \n\nLiterally everyone will gain a little in the initial recovery period, but it's very unlikely to be fat, just fluid. After the first few months, I experienced a big whoosh.",
      "created_utc": 1611865554.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gl5pgu0",
      "author": "Sad-Vehicle5453",
      "body": "BMI doesn’t mean anything. \n\nRecovery is about replacing the unhealthy behaviours with healthier ones that can lead you to regulation and a calmer relationship with food. \n\nMedically, what’s important is stopping the behaviour that causes you physical trauma. However you experience bulimia, the symptoms are detrimental to your health. Purging can lead to ulcers and even cancer in your throat, stomach and mouth, as well as gum disease and it weakens your immune system. You’re at risk for many infections. \n\nSo, recovery is about rerouting your discomfort around food while also addressing the main issues that caused your ED. EDs are symptoms of a bigger mental health inconsistency that needs to be addressed. \n\nRecovery ain’t about those numbers. My BMI says I’m overweight but I know I’m not. BMI is um... I mean, I suppose a good guideline. But as a woman who regularly gets called “tiny” (I hate it) I’m still heavy, because of my muscle distribution and fat as well. BMI honestly is a junk science that will ruin your brain if you yas r that as a gauge to success. \n\nNumbers ain’t recovery babe. Self love is, caring for yourself enough to entrust with professionals your care (inpatient or out) so you can live the life you deserve to live. \n\nYou’ve got this, okay? Health isnt about being the fittest mofo out there, it’s about taking care of yourself. \n\nYou can recover, you can enjoy the world, you can enjoy your life. I promise. \n\nAnd yeah moral of the story fuckkkkk BMI lol",
      "created_utc": 1611873745.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gl5recy",
      "author": "edie43",
      "body": "Ok so I hope you’re able to ignore some of the leas helpful comments here. I’m currently seeing a licensed nutritionist through my ED treatment program. I’ve been dealing with your exact issue. I was telling my nutritionist how hard it is to be overweight and stop the urges to restrict or purge and used the typical reasons: I worry that my weight will affect my health. My nutritionist explained that being overweight (especially while recovering) isn’t necessarily dangerous as long as you try to eat balanced and healthy and maintain your weight. That is: eating enought to keep your body going and making sure your diet is full of different foods. That is easier said than done, I know, but that’s also why it need to be your main priority over weight loss. The life style diseases that come with being overweight often have to do with the one sided diet in itself and fluctuating blood sugar levels amongst a few other side effects of binging, purging or restricting. (Of course if you’re morbidly obese that’s different) It really helped me on my way to accepting and allowing myself to be at the weight I am. Once I’ve figured this ED shit out my body will also adjust and I might even get back to my normal weight, but it takes time and I need to trust the process. Please pick recovery over your ED. Allow your body to be where it’s at while you work on your mind.",
      "created_utc": 1611874554.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gl6lo3f",
      "author": "None",
      "body": "Consistency. I have the same issue and it’s a big problem.",
      "created_utc": 1611887968.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gl8sfx0",
      "author": "AnaDion94",
      "body": "Something that I have learned and have to remind myself: b&p over the course of a year was worst for my body than being obese since I was a child. Medical confirmation and I could *feel* that I was not doing well. \n\nFor me, what works best (and i got about 6 weeks in with no issues before relapsing due to the holidays) is eating a lot of super healthy food and doing some amount of exercise. I think i initially gained a few pounds, because my body wasn't used to digesting, but then starting losing much more effectively than i was pre-recovery. \n\nMost of my dinners were a giant salads, lean protein, and some cooked vegetable, only limiting refined sugars and saturated fat, but not particularly strictly. I started integrating carbs (sweet potatoes, whole grains) once my workouts got more intense, and I could feel that I needed more energy. But generally, I find that working out (and by working out i mean i jog in front of the TV and sometimes do squats) and eating healthy foods helped eliminate the guilt trigger and \"purge\" response and also kept me from gaining while recovering.",
      "created_utc": 1611932985.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gl5r8hc",
      "author": "dogangels",
      "body": "fitness level is a better indicator of health than bmi, so if youre recovered, and you exercise and are still overweight you’ll still be much better off than if you’re bulimic",
      "created_utc": 1611874485.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gl5r64w",
      "author": "shockheadedfranzy",
      "body": "You will gain weight in recovery because your body is also in a bad state and needs to learn consistency. I was overweight gained a lot more while being inpatient and it was super hard to accept but you will learn to cope with stress etc. without the ed. When you are mentally stable, you are allowed to lose weight in a healthy!!!! way. I’m now in this journey. I’m still overweight and it’s so hard not to fall back. Sometimes I have some battles with old behaviors but I’m more stable and most of the time it’s ok. I also have some rules from my therapist and he keeps me accountable. \n\nDon’t be too scared - it’s worth it!",
      "created_utc": 1611874457.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl4n0s7",
      "author": "None",
      "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
      "created_utc": 1611859638.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gl6dhyq",
      "author": "dolefulAlchemist",
      "body": "Gaining weight is often water weight or just straight up binging - think abt how many calories you keep in when b/p anyways - you dont get them all up so maybe try and rationalise it that way. Like, hey I woulda absorbed X cals anyway to maintain my weight so I may as well eat them normally.  \n\nI'm slowly working on reduction; having a set amount of days, and no more than one purge session on those days even if I have food left. It makes me buy less. And my weights kinda been stable throughout this?? Its anecdotal but it hasn't changed at all from bp heavily to just bp less frequently. \n\nMaybe go for the less frequently thing and see how it goes?? Just go in a little bit in rather than full on like and see how your weight reacts.",
      "created_utc": 1611884246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl6tzrq",
      "author": "None",
      "body": "BMI is extemllllllyyy inaccurate you should be eating healthy, no restricting, no throwing up, etc if you have ever obsessively exercised to lose weight i would not recommend that either as it could cause you to relapses. Drink lots of water, lots of fruits stay away from diet channels instead look you specific videos like “healthy smoothies” “healthy pasta” etc to avoid relapse but still try to lose weight.\nAlso if you’re not obese and have struggled with bulimia i would suggest waiting a couple months before doing anything",
      "created_utc": 1611891710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl8r6u1",
      "author": "19nov97",
      "body": "It is possible todo both!!!!!!!  Please listen to « binge breakers » podcast on Spotify. Jacqueline is a recovered bulimic who made progress with her ED while slowly and sustainably losing weight. Work on your ED first. It requires immediate attention. You can worry about your physical appearance later. \n\nKeep you head up, kiddo. You’re a fighter.  💗💗💗",
      "created_utc": 1611932555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl4n3n2",
      "author": "rissispissed",
      "body": "In my experience, a consistent two week non-purging episode is enough to fight off that urge to binge eat. I've heard that purging so much causes an imbalance in hormones that make you hungrier.",
      "created_utc": 1611859670.0,
      "score": 16,
      "context": [
        {
          "id": "gl45a3u",
          "author": "counting_the_ways",
          "body": "Upvoting this because I hope people see this and comment. I’m usually just a lurker but, hi, I have the same problem. Every time I stop purging -even when I don’t think I’m binging/overeating -my weight goes up... and it needs to go down. Medically.",
          "created_utc": 1611852744.0
        }
      ]
    },
    {
      "id": "gl5srp1",
      "author": "shockheadedfranzy",
      "body": "It’s worth it - please give it a second try! I learned a lot in my mixed group. The conversations between us patients were so helpful! Sure sometimes I was triggered but it got better - I also learned about all the side effects of starving and no one with a perfect body (in my eyes) was happy. Also to see people so underweight, that they weren’t able to walk properly because of muscle loss, etc. but still believed that they’re obese helped me a lot. \nIt’s just like a group like this sub just in RL. \nYou deserve recovery and deserve a happy life as everyone else who is suffering!",
      "created_utc": 1611875131.0,
      "score": 3,
      "context": [
        {
          "id": "gl4vnrt",
          "author": "None",
          "body": "I wish I freaking knew. I started an intensive outpatient ed treatment program and the first day the therapist told us people on recovery usually gain at first. I'm already overweight, and I already felt out of place (whose idea was it to have underweight and overweight people in the same ED group??? Triggering beyond belief) I never went back. I guess in my head I thought treatment meant they'd rewire my brain to restrict instead of b/p.",
          "created_utc": 1611862840.0
        }
      ]
    },
    {
      "id": "gl4vm5z",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611862823.0,
      "score": 5,
      "context": [
        {
          "id": "gl4n0s7",
          "author": "None",
          "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
          "created_utc": 1611859638.0
        }
      ]
    },
    {
      "id": "glivy84",
      "author": "psychicglade",
      "body": "The underlying assumptions about weight = health here are wrong and I'll ignore those. I have never been sicker than when I was in the throes of bulimia and a \"normal\" weight. As an \"obese\" teen I was healthy by all other measures per my doctor. \n\nBut it's also just false that eating a normal amount of calories won't make you gain, at least for a while. If you've spent months or years regularly emptying your stomach every time something enters it, a regular amount of food is gonna piss it off. Insanely confused electrolytes, crazy fluid retention, slowed digestion and gastric emptying, constipation....Yeah. It can be really hard to start keeping food down again because there's almost no way to avoid some form of weight-jump at first (and it's quite likely not FAT gain if you're not underweight). \n\nThis is such a harmful narrative to push and I'm sad to see it in an ED community. We all deserve to recover and decentering weight is kind of the whole damn point.",
      "created_utc": 1612129719.0,
      "score": 1,
      "context": [
        {
          "id": "gl4n0s7",
          "author": "None",
          "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
          "created_utc": 1611859638.0
        }
      ]
    },
    {
      "id": "gl53oti",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611865710.0,
      "score": 10,
      "context": [
        {
          "id": "gl4n0s7",
          "author": "None",
          "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
          "created_utc": 1611859638.0
        },
        {
          "id": "gl4vm5z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611862823.0
        }
      ]
    },
    {
      "id": "gl5j592",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611871206.0,
      "score": -1,
      "context": [
        {
          "id": "gl4n0s7",
          "author": "None",
          "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
          "created_utc": 1611859638.0
        },
        {
          "id": "gl4vm5z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611862823.0
        },
        {
          "id": "gl53oti",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611865710.0
        }
      ]
    },
    {
      "id": "gl67t1k",
      "author": "psychicglade",
      "body": "Totally agree, and the good thing is that a \"healthy weight\" totally depends on your own body composition and BMI is a completely arbitrary scale that was never meant to assess individual health! Seriously, look up the history of BMI--hint, it's really racist!\n\nI get it, we all have ED brain and it's incredibly hard to shake BMI categories as a measure of worth and health. I also believe you can recover from an ED and eventually lose weight safely, with a lottt of boundaries probably. That's a fine goal. It just can't be a goal that's centered in your recovery. It is by definition antagonistic to it.",
      "created_utc": 1611881679.0,
      "score": 4,
      "context": [
        {
          "id": "gl4n0s7",
          "author": "None",
          "body": "Being overweight and gaining more is not recovery in my opinion.\n\nIf you're overweight and attempt to recover, a healthy amount of calories will not make you gain. I believe bulimia recovery is not only about stopping purging because overeating, purging, restricting and all these types of disordered eating go very much hand in hand.\n\nI keep rewriting this trying not to sound offensive, but get what I mean?",
          "created_utc": 1611859638.0
        },
        {
          "id": "gl4vm5z",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611862823.0
        },
        {
          "id": "gl53oti",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611865710.0
        },
        {
          "id": "gl5j592",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611871206.0
        }
      ]
    }
  ]
}