{
  "id": "l7sfxs",
  "subreddit": "bulimia",
  "author": "ready2rope",
  "created_utc": 1611926699.0,
  "title": "Tomorrow is another day",
  "selftext": "Tomorrow is another day.  \n\n\nThis is going to be difficult - I have important plans this weekend, plans that involve interacting with strangers and acquaintances, concentrating, listening. I feel utterly awful and I know that tomorrow morning will be yet another where I wake up with my face so puffy that I can feel the swell in my eyelids.   \nI've officially enrolled in a class that is going to be one step of many toward a potentially bright future. I'm so sick of dwelling in hopelessness. I want to give up, but I can't . My entire life i've dug my nails in, scrabbling, fervently, holding onto hope, gritting my teeth and trying to hold my head up. I slip, and fall, sometimes - like the last few days - but I just need to keep trying. Keep trying.   \n\n\nSomeone I cared about used to say to me, \"remember that no matter what happens, you still haven't truly hit rock bottom. There isn't reason to give up, yet, because you still have things to fight for.\"  \n\n\nI will shower tomorrow. For the first time in a while. I will dress in something other than pyjamas. I will eat breakfast, lunch, and dinner. I will not purge. I *will* not purge. \n\nI cannot allow this sickness to keep debilitating me. There are things I need to keep fighting for. \n\nI hope I can get to my purge-free streak, and beyond it! Remember that I love all of you. We are *all* capable.",
  "url": "https://www.reddit.com/r/bulimia/comments/l7sfxs/tomorrow_is_another_day/",
  "score": 72,
  "num_comments": 5,
  "comments": [
    {
      "id": "gl8q9oy",
      "author": "19nov97",
      "body": "Hey there, \n\nThanks so much for sharing these uplifting words. I am very sorry to hear of your ongoing struggle. I am currently in the process of recovering with a therapist and medication. Every time I mess up, I always want to give up. BUT, I don’t. I tell myself that I’m worth fighting for. I’m worth nutritious food. I’m worth kindness and self-love. I am trying to remind myself that purging in reaction to stressful situations doesn’t do anything but make me feel worse about myself. Nothing about the B/P cycle changes anything about the stress that brought it on.  \n\nI’ve been listening to a podcast on Spotify called « binge breakers » and Jacqueline is a recovered bulimic who encourages others to recover. It’s a great podcast, and it’s helped me sit with urges when I feel like B/P and has prevented me from giving in. She compares our struggle with bulimia as a toxic relationship that we know is bad for us, but we just keep running back to because it’s all we know. We can break up with them, and we WILL. \n\nBest of luck with your journey. Update me tomorrow with your success!!!! 💗💗💗",
      "created_utc": 1611932241.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glam9hj",
      "author": "MaeveTheLion",
      "body": "❤️❤️❤️",
      "created_utc": 1611956225.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glat61i",
      "author": "avadamaris",
      "body": "you can do this. thank you for sharing.",
      "created_utc": 1611959150.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glayecd",
      "author": "Emyrbl",
      "body": "I like how you wrote this. Really resonated. Little by little, you will get through tomorrow! You go!",
      "created_utc": 1611961468.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glbh2av",
      "author": "ready2rope",
      "body": "Thank you for sharing! I love the optimism and hopefulness in your words. I can feel you cheering me on. I will definitely check out that podcast!",
      "created_utc": 1611970345.0,
      "score": 2,
      "context": [
        {
          "id": "gl8q9oy",
          "author": "19nov97",
          "body": "Hey there, \n\nThanks so much for sharing these uplifting words. I am very sorry to hear of your ongoing struggle. I am currently in the process of recovering with a therapist and medication. Every time I mess up, I always want to give up. BUT, I don’t. I tell myself that I’m worth fighting for. I’m worth nutritious food. I’m worth kindness and self-love. I am trying to remind myself that purging in reaction to stressful situations doesn’t do anything but make me feel worse about myself. Nothing about the B/P cycle changes anything about the stress that brought it on.  \n\nI’ve been listening to a podcast on Spotify called « binge breakers » and Jacqueline is a recovered bulimic who encourages others to recover. It’s a great podcast, and it’s helped me sit with urges when I feel like B/P and has prevented me from giving in. She compares our struggle with bulimia as a toxic relationship that we know is bad for us, but we just keep running back to because it’s all we know. We can break up with them, and we WILL. \n\nBest of luck with your journey. Update me tomorrow with your success!!!! 💗💗💗",
          "created_utc": 1611932241.0
        }
      ]
    }
  ]
}