{
  "id": "l8hhpt",
  "subreddit": "bulimia",
  "author": "221Bamf",
  "created_utc": 1611995964.0,
  "title": "Does anybody else ever get surprised at your own disordered ingenuity/resourcefulness in order to continue your behaviours easier or keeping them secret?",
  "selftext": "I’m not going to share what I’ve done, as I don’t want to give anyone ideas. But I’ve done a lot of things to make it more comfortable and easier to hide. I know it isn’t healthy, and I’m not proud of myself for the reason I’ve done it, but sometimes I just have to sit back and look at all the ridiculous bullshit I’ve done.",
  "url": "https://www.reddit.com/r/bulimia/comments/l8hhpt/does_anybody_else_ever_get_surprised_at_your_own/",
  "score": 65,
  "num_comments": 7,
  "comments": [
    {
      "id": "gld6z0t",
      "author": "BrMaria",
      "body": "I have done some real bullshits and disgusting things in order to keep it a secret....",
      "created_utc": 1612014050.0,
      "score": 12,
      "context": []
    },
    {
      "id": "glcoy7c",
      "author": "bonesandbiscuits",
      "body": "Yeah definitely! I’ve been hospitalised this last week and even though I do want help I still try to not eat. Or tell the treatment team that I’m fine but honestly I’m not. I don’t know why though. Cause I’m so ready for recovery, but I guess it’s just the disease talking.",
      "created_utc": 1611998033.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gldeh6y",
      "author": "Glittering-Cod5256",
      "body": "I have done things I’m not proud of if that’s what you mean but yeah ..",
      "created_utc": 1612018679.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gldlmfo",
      "author": "None",
      "body": "I'm not even surprised anymore about the things I do to hide my disorder. To me, it is such a notmal thing as going to sleep, breathing or brushing my theeth. I'm perfect in getting along with this shit. I did so many heavy  disgusting things; a normsl person would be so fucking ashamed. But for me it's okay. I think that this is the worst as I don't even care anymore.",
      "created_utc": 1612022532.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gldkym9",
      "author": "JetPatriot",
      "body": "I was married for 18 years and my spouse never knew.",
      "created_utc": 1612022221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gle7na0",
      "author": "iknowimherenow",
      "body": "I think the gross stuff we do to hide bulimia is the worst. Like the little balls of food I chew and spit out-pretzels, pbnj sandwiches, omg. But seriously if anyone needs a reminder of why to try to stop-I paid 10 thousand dollars to fix just 6 of my teeth. If I want to keep the last ten I have it’ll be thousands more. No fun.",
      "created_utc": 1612032643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gld6rqv",
      "author": "assassin-mythic",
      "body": "I once watched this youtube video from this youtuber called herbsandaltars and she described eating disorders, especially restrictive ones, as a call for help. You try as hard as you can to get to a certain weight so that people can see you are sick without you even needing to say anything. This is why we sometimes feel like we aren't \"sick enough\" even though anyone with disordered eating is in need of help. I am not sure if this applies to you or your situation but I thought it was interesting. Best of luck to you in treatment!!!",
      "created_utc": 1612013909.0,
      "score": 9,
      "context": [
        {
          "id": "glcoy7c",
          "author": "bonesandbiscuits",
          "body": "Yeah definitely! I’ve been hospitalised this last week and even though I do want help I still try to not eat. Or tell the treatment team that I’m fine but honestly I’m not. I don’t know why though. Cause I’m so ready for recovery, but I guess it’s just the disease talking.",
          "created_utc": 1611998033.0
        }
      ]
    }
  ]
}