{
  "id": "lap393",
  "subreddit": "bulimia",
  "author": "guide_me_stars",
  "created_utc": 1612246160.0,
  "title": "how do you go from being a happy kid to throwing up into a garbage bag in your car",
  "selftext": "I feel like I've officially hit rock bottom. I thought I hit rock bottom a few times before but this is really it.\n\nFor starters, I've never had more than two intentional binge/purge sessions in a single day. Usually I'll have one around 11am and another around 4pm so that I can dispose of everything and clean before my parents and siblings get home (I live at home). Sometimes I also binge/purge at night if I don't have that second session but this is rare because I live at home and purging is, well, loud and messy.\n\nWell, today I had three binge/purge sessions. This has never happened before. I had to go to the grocery store after dinner to pick up some things for my mom and I impulsively bought a box of Cinnamon Toast Crunch and some Clif bars that were on sale. I got home and ate the entire box of cereal, the Clif bars, and three scones that my mom made. I wanted to purge so bad but the entire house was quiet and people would definitely hear. \n\nSo I brought water and garbage bags into the garage so I could purge into the bags, hide them in the garage, and throw them out later. The garage is obviously not the main part of the house so I figured I could purge in there and not wake anyone up. But then I became paranoid because my older sister has the room right next to the garage door and her room and the garage share a wall so maybe she'd be able to hear me purge. So I took my stuff into my parked car in the garage and purged in the backseat so that there'd be another layer of quiet.\n\nI'm literally thinking of this whole situation and I'm so disgusted with myself for purging three times in one day and also just by thinking of what I'm actually doing: I'm throwing up on purpose into garbage bags in the back seat of my car in my garage because I stuffed myself to the point of feeling ill because I don't know how to eat and I hate my body. Like what the actual fuck. How did I go from being a happy, chill kid who didn't give a second thought to what she ate to sitting in the back seat of my car throwing up into garbage bags. I don't even know where to go from here.",
  "url": "https://www.reddit.com/r/bulimia/comments/lap393/how_do_you_go_from_being_a_happy_kid_to_throwing/",
  "score": 164,
  "num_comments": 10,
  "comments": [
    {
      "id": "glpluip",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612256241.0,
      "score": 16,
      "context": []
    },
    {
      "id": "glpymhd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612267268.0,
      "score": 16,
      "context": []
    },
    {
      "id": "glqjq4o",
      "author": "KnownCherry8",
      "body": "i completely understand, just know you aren’t alone. i’ve been through almost this exact scenario and it really makes you wonder how the fuck you got here. but i promise you aren’t disgusting, you aren’t abnormal. you are loved and strong and you’ve got this.",
      "created_utc": 1612278204.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gltr393",
      "author": "RockParks",
      "body": "Once I left my house because the whole family was there. I had just binge ate so much food because we were having dinner. I literally took a shopping bag, water, and wipes and went to my car and drive down the street (cause I was paranoid) and parked at some random apartments and made myself throw up. \nSmh that’s fucking crazy. All because I hate myself. \nSo I definitely understand. I felt so disgusted.",
      "created_utc": 1612327069.0,
      "score": 5,
      "context": []
    },
    {
      "id": "glrdt8o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612289279.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glrql27",
      "author": "hannahmjarmbruster",
      "body": "I’ve been here many times. I have gone to extreme measures to hide purging from people. You are doing you’re best. You are enough. You will get through this. Always feel free to reach out to me if you need to. Have you looked for a therapist in your area?",
      "created_utc": 1612294290.0,
      "score": 4,
      "context": []
    },
    {
      "id": "glsm43y",
      "author": "Puzzleheaded-Back-99",
      "body": "Obsessed with purging water lately, exhausted and really hard to work. I kind of want to stop but it's also the only thing I have. So thirsty but can't drink cause its not time yet!!!!!!\n\nI never ask but any help?\n\nIt's like whenever I'm bored I just move onto the next extreme thing💊💉🚬🔪:-{",
      "created_utc": 1612306953.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glqrtkm",
      "author": "guide_me_stars",
      "body": "thank you so much! it's the next morning and I'm just trying to be gentle with myself and I'm feeling hopeful about a new day!",
      "created_utc": 1612281132.0,
      "score": 8,
      "context": [
        {
          "id": "glpluip",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612256241.0
        }
      ]
    },
    {
      "id": "glqsivs",
      "author": "guide_me_stars",
      "body": ">The lengths we'll go to in order to binge and purge... It's unbelievable at times.\n\nyes! sometimes I surprise myself by just how far I'm willing to go to purge...I've said I'm \"going on a walk\" to go throw up in a park at night, I've thrown up in garbage bags, thrown up in water bottles and then flushed it down the toilet later...it's humbling to type it all out and realize just how messed up this disease is.\n\nthank you for your support 💕this is difficult but I know that talking about the problem and clearly labeling it as a problem is the first step towards recovery",
      "created_utc": 1612281373.0,
      "score": 8,
      "context": [
        {
          "id": "glpymhd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612267268.0
        }
      ]
    },
    {
      "id": "gls7die",
      "author": "guide_me_stars",
      "body": "thank you so much 💕",
      "created_utc": 1612300888.0,
      "score": 2,
      "context": [
        {
          "id": "glqjq4o",
          "author": "KnownCherry8",
          "body": "i completely understand, just know you aren’t alone. i’ve been through almost this exact scenario and it really makes you wonder how the fuck you got here. but i promise you aren’t disgusting, you aren’t abnormal. you are loved and strong and you’ve got this.",
          "created_utc": 1612278204.0
        }
      ]
    },
    {
      "id": "glveotr",
      "author": "guide_me_stars",
      "body": "I've done this too :(",
      "created_utc": 1612367159.0,
      "score": 2,
      "context": [
        {
          "id": "gltr393",
          "author": "RockParks",
          "body": "Once I left my house because the whole family was there. I had just binge ate so much food because we were having dinner. I literally took a shopping bag, water, and wipes and went to my car and drive down the street (cause I was paranoid) and parked at some random apartments and made myself throw up. \nSmh that’s fucking crazy. All because I hate myself. \nSo I definitely understand. I felt so disgusted.",
          "created_utc": 1612327069.0
        }
      ]
    },
    {
      "id": "gls7la6",
      "author": "guide_me_stars",
      "body": "thank you so much! the kindness and understanding I receive here is honestly one of the reasons why I want to recover – I want others to know that it gets better and that recovery is possible",
      "created_utc": 1612300961.0,
      "score": 5,
      "context": [
        {
          "id": "glrdt8o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612289279.0
        }
      ]
    }
  ]
}