{
  "id": "ldketf",
  "subreddit": "bulimia",
  "author": "fluffy_unicorn2307",
  "created_utc": 1612567862.0,
  "title": "I used to curse my body, now I believe it saved me",
  "selftext": "I started off by cutting calories, but extremely fast it turned into an abnormally small number. Workouts became harder and harder. I was confidently heading towards anorexic status. But my body would not let me. Just when I was at the very edge, it reacted. I got a severe hormonal imbalance with one strong symptom - extreme hunger that was impossible to resist. My body wanted to get what it needed.\n\nI believed I was smarter and started throwing up “excess” food. For a moment I thought that this is it, I’m going back to my “normal” (a.k.a. aspiring to being underweight). But my body had another trick up it’s sleeve. Soon enough I’ve lost my gag reflex. I could spend a whole hour trying to shove three fingers in my throat as deep as possible. Water, baking soda - nothing worked.\n\nI cursed my body for all of that. Why wouldn’t it understand that I want to be skinny? Why would it resist me with such stubbornness? \n\nNow I am in recovery and my attitude has changed. I like to think of my body as of a separate character, a friends who slaps your face when you are heading to a rock bottom. In its ways it has protected me from ruining myself. My body was ruthless, merciless, but it won.\n\nFrom your uncaring, unloving, foolish owner,\nThank you, my body!",
  "url": "https://www.reddit.com/r/bulimia/comments/ldketf/i_used_to_curse_my_body_now_i_believe_it_saved_me/",
  "score": 91,
  "num_comments": 3,
  "comments": [
    {
      "id": "gm6tl0c",
      "author": "justtryingSadGal",
      "body": "a very nice read :) made me smile tonight, thank you for sharing and being very brave. your recovery is great!",
      "created_utc": 1612577597.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gm6tmru",
      "author": "louistheshrimp",
      "body": "this is truly beautiful. our minds are so powerful and capable of change, and our bodies just do everything to protect us. i’m so so proud of you and your growth and i hope one day i can unlearn diet culture and get rid of my eating disorders but wow this gives me hope!",
      "created_utc": 1612577622.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gm8mldc",
      "author": "_Britt_marie_",
      "body": "Hmm, I've never thought of my gag reflex disappearing like that. Sad enough tho I've found a way to make myself throw up without a gag reflex.",
      "created_utc": 1612626297.0,
      "score": 2,
      "context": []
    }
  ]
}