{
  "id": "lf2ogr",
  "subreddit": "bulimia",
  "author": "beyahall",
  "created_utc": 1612754212.0,
  "title": "i hate feeling full.",
  "selftext": "tw(?) i hate feeling full. i hate it so much. nothing makes me feel worse and i hate that. the way it can completely alter my state of mind and happiness when i’m around people is insane. feeling hungry is a much better feeling than being full for me personally. i just ate a huge dinner and snacked a bunch and i’m really in the worst mood right now. relatable?",
  "url": "https://www.reddit.com/r/bulimia/comments/lf2ogr/i_hate_feeling_full/",
  "score": 122,
  "num_comments": 14,
  "comments": [
    {
      "id": "gmk34ad",
      "author": "JetPatriot",
      "body": "If I feel full and cannot vomit?  Utter misery.",
      "created_utc": 1612766511.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gmjkqfc",
      "author": "seasofGalia",
      "body": "Are you me?",
      "created_utc": 1612754261.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gmjqp9w",
      "author": "viscouslsd",
      "body": "If I eat dinner & someone asks me to hang out I say I can’t come. Had they asked me before I ate? For sure I’m available",
      "created_utc": 1612757700.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gmjyb29",
      "author": "cupcake_sex",
      "body": "honestly this is the reason I'm a stoner... any anti-anxiety medication or substance can make your mind less focused on your body, so for now, maybe consider talking to a psychiatrist to see if there's a medicinal way to help this for you. \n\na therapist would say that loving hunger is a symptom of many ED's. your dopamine functions are rewired to enjoy feeling hunger, because it feels like an accomplishment, like you're doing something \"right.\" psychology (reasonably) compares eating disorders to drug addictions (like an addiction to being hungry/starving/eating specific foods) because your mind is hyper-focused on anything related to food/weight/body. you feel irritated when you don't indulge in the addiction (being hungry). i don't know if this helps at all, but it's a kind of scientific explanation for your feelings that's helped me be more forgiving to myself when i hated feeling full.",
      "created_utc": 1612762752.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gmjob41",
      "author": "Aggravating_Bonus205",
      "body": "You are not alone. It blows my mind that people enjoy feeling full. I can’t stand it.",
      "created_utc": 1612756284.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gmk66lm",
      "author": "manicpanicbp",
      "body": "hmm what i usually do is stretch, walk/ jog or another workout (light or moderate) if i feel super full \n\nur feelings are valid though! i totally feel you and i’m here for you",
      "created_utc": 1612769174.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmk97ia",
      "author": "ladyneckbeard",
      "body": "Yup, feeling full makes me so incredibly anxious and defeated. I can't stand it, even when I'm full from safe foods but it's way worse when I'm full from cheat foods. I don't understand how people can feel full and okay about it, or even feel good when they're full. It's always induced panic in me.",
      "created_utc": 1612771972.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gmk16k3",
      "author": "Zakiakw0829",
      "body": "Completely agree I hate it. It makes me feel horrible about myself.",
      "created_utc": 1612764935.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmkv48l",
      "author": "None",
      "body": "Exactly. It makes me feel like shit. When I go out with friends, (pre-covid mostly) they always want to go out to eat FIRST and then go do whatever fun thing we have planned. But it’s basically a death sentence for me, because once I eat my stomach just feels so bloated and full that I’m too sick to actually enjoy bowling, skating, or whatever other activity we had planned. \n\nWhen I go on dates with my boyfriend I always make sure we eat LAST so at least I can just go home afterwards, and not have to walk around or try to have fun while I feel so full I could throw up.",
      "created_utc": 1612791217.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmk7rgn",
      "author": "None",
      "body": "Hate hate hate feeling full. It’s legitimately paralysing to me. It actually scares me. Probably because I associate it with bingeing and now any moderate to high level of fullness is terrifying and riddled with guilt and regret and my dumb ass body keeps demanding I feed it. Smh",
      "created_utc": 1612770619.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmkuowa",
      "author": "activelylistening",
      "body": "I remember loving the feeling when I was young and as a young adult. My parents taught me to associate that feeling with joy and happiness. Nowadays as I’m closer to 30 than not, I realize I *also* hate it. And like the comments above, if I can, I walk. But several times in the past 6 months, when I don’t even feel like I’m thinking about purging, but after I have *overeaten* and feel full, I’ll get this deep seeded nausea in the pit of my stomach that makes me purge, and feel like there’s no other option. And Idk wtf that is.  Never saw that one coming. I just thought I’d always associate fullness with joy. And this sequence of events ALWAYS puts me in a bad mood, because I was trained to think feeling full means good things. Because it feels wasteful to purge. Because now my teeth have that gritty feeling. Because now my eyes hurt. Because now I’m just... empty.",
      "created_utc": 1612790941.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmjvefp",
      "author": "almonddnomla",
      "body": "Of course I know him, he’s me",
      "created_utc": 1612760702.0,
      "score": 10,
      "context": [
        {
          "id": "gmjkqfc",
          "author": "seasofGalia",
          "body": "Are you me?",
          "created_utc": 1612754261.0
        }
      ]
    },
    {
      "id": "gmkg0pe",
      "author": "None",
      "body": "OH GOD YES. If I haven't fasted for an appropriate length of time prior to any social engagements... either I cancel or I just feel like absolute crap for the whole thing. It's ruined so many important events for me.",
      "created_utc": 1612778674.0,
      "score": 8,
      "context": [
        {
          "id": "gmjqp9w",
          "author": "viscouslsd",
          "body": "If I eat dinner & someone asks me to hang out I say I can’t come. Had they asked me before I ate? For sure I’m available",
          "created_utc": 1612757700.0
        }
      ]
    },
    {
      "id": "gmljjtg",
      "author": "Aggravating_Bonus205",
      "body": "People would think I’m crazy if I dumped salt on the amount of food I don’t want on my plate. And if I order a small salad at a restaurant I swear everyone is quietly taking note of it.",
      "created_utc": 1612803460.0,
      "score": 2,
      "context": [
        {
          "id": "gmjqp9w",
          "author": "viscouslsd",
          "body": "If I eat dinner & someone asks me to hang out I say I can’t come. Had they asked me before I ate? For sure I’m available",
          "created_utc": 1612757700.0
        },
        {
          "id": "gmkg0pe",
          "author": "None",
          "body": "OH GOD YES. If I haven't fasted for an appropriate length of time prior to any social engagements... either I cancel or I just feel like absolute crap for the whole thing. It's ruined so many important events for me.",
          "created_utc": 1612778674.0
        }
      ]
    }
  ]
}