{
  "id": "lf9lo2",
  "subreddit": "bulimia",
  "author": "iShouldHaveBeenAbort",
  "created_utc": 1612782448.0,
  "title": "fantasizing about your dream life and realizing it just consists of binging and purging to death",
  "selftext": "I remember blowing out the candles to my 4th birthday cake wishing for weight loss and smaller arms. Being 6 in the shower wondering if rubbing conditioner on my stomach would get rid of my fat cells the way it got rid of tangles in my hair. Finding the MPA community at 8, tumblr at 10 and I’d never even thought my restriction and weird eating behaviors would evolve into spending hours of my day wasted on b/p sessions back to back til my mouth starts to peel and erode and bleed and going to bed at 4 am praying to gods i never believed in that this would finally be the night i fail to wake up in the morning. \n\nI’m turning 20 this year and I feel like I have no purpose. I’m not even in college because I took a few years off to go into several treatment stints but ultimately would end up being told they couldn’t help me anymore? I feel like everyone and everything else is continuing to move and grow with the world and I’m just floating through time and space existing. My whole youth has been wasted on mental illness and I’m so fucking exhausted. \nBut simultaneously I just can’t imagine a life without binging and purging. I feel so averse to relationships, friendships, intimacy, sex, connections, just because I fear being ripped away from my ability to binge and purge. If you ask me about my dream life, without a doubt the first thing I’d end up fantasizing about would be relocating far, far away from everyone I know and having the finances to spend the rest of my life binging and purging until I die. I can’t find the mental space for anything else and i feel so close to not even wanting to try anymore. \n\nBut I don’t want to be like this. For the first time in like ever, I’ve recently just found reasons to live, motivation to succeed, people to make proud and a willingness to fulfill my purpose to heal and listen and speak. \nBut I can’t. For the fucking life of me. Break out of this toxic ass relationship with bulimia and I don’t even know if I care. I want to fulfill the higher purpose and potential I KNOW I am capable of achieving but at the same time: binging and purging. That’s all I need or want and I do not give a fuck. About all else.\n\nI don’t know. It’s been almost two decades and I’m so. Exhausted",
  "url": "https://www.reddit.com/r/bulimia/comments/lf9lo2/fantasizing_about_your_dream_life_and_realizing/",
  "score": 156,
  "num_comments": 14,
  "comments": [
    {
      "id": "gmkw06p",
      "author": "punipunijelly",
      "body": "God. I wanna give you a hug. I really really really hope you’ll be able to get better. Bulimia is so life consuming and you’re still very young, you didn’t waste your youth you’re just getting started, don’t let this take over your whole life🥺",
      "created_utc": 1612791770.0,
      "score": 32,
      "context": []
    },
    {
      "id": "gmlfeak",
      "author": "Unicorndog_0625",
      "body": "Please hang in there. I can understand you’re going through a dark time, but I can hear the hope in your post. It’s a little flame, but kindle that small flame with all of the beauty that’s in even the smallest thing you love or appreciate that’s not b/p. Love those simple things and try to let that give you more strength and hope. You made ME proud by your beautiful post. The world’s a better place with YOU in it.",
      "created_utc": 1612801584.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gmmnx1u",
      "author": "None",
      "body": "Keep hanging in. I had bulimia for nearly thirty years and am recovered. Sending you so much love. Find a good therapist. Have faith.",
      "created_utc": 1612821537.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmlsnvx",
      "author": "BobbySlobbins",
      "body": "Well done for hanging in there. And I'm happy you've found reasons to not want to disappoint people.",
      "created_utc": 1612807499.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gmmv8f4",
      "author": "marinabaff",
      "body": "Keep hanging in there. You can do it! And don’t worry about being 20 and not being in college, you have your own timing and own plan. I started college at 21 - almost 22.",
      "created_utc": 1612824994.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmn1wzw",
      "author": "Glittering-Cod5256",
      "body": "My God you are just a baby! I want to give you a massive hug! Look I can’t promise anything more that at least I completely understand bulimia robs you of your identity and your life but if you dig a little deeper it’s there that’s why you are writing this we all have that healthy self trying to get out that’s why we are here little by little it does get better I believe in you find something you want to achieve and fight for it like hell fight for yourself 💪🏻🧠🔥",
      "created_utc": 1612828355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmn2low",
      "author": "lalaloui22",
      "body": "I don’t know how it will be for you, but for me, finally building a life outside of b/p was everything. Hold on to the other things you have now. It’s not going to fix things or make you suddenly not interested in b/p, but for me at least I began to see a life that could maybe exist for me outside of b/p multiple times every day. \n\nAnd at any rate, having good things in your life is good, regardless of any effect they might have on your ED.",
      "created_utc": 1612828705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmndvab",
      "author": "thatcoolwineaunt",
      "body": "We'll all float on, okay\n\n- modest mouse\n\nI think about these lyrics all the time and feel it summarizes up my existence and others with an ED. It's hard to explain, but it fits in my mind. Wishing you the best 🖤",
      "created_utc": 1612834551.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmnj1dj",
      "author": "immunityberry",
      "body": "ugh this hits close. love you. there is meaning out there for you. I can tell you that I'm living a full busy life, that I designed to minimize opportunities to BP alone, and some days just wish that I could leave everything, fill myself up and empty myself out over and over",
      "created_utc": 1612837236.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmnpv6i",
      "author": "barristerbuttkiss",
      "body": "Love you! You will make it through!",
      "created_utc": 1612840813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmnqy6n",
      "author": "PollyCotton_Blend",
      "body": "Hey so I went through something very similar except I got that relationship and went to uni. This time last year I was about to turn twenty, flunked out of uni so moved home and the relationship ending because we were both consumed in our eating disorders.\n\nI'm about to turn twenty one now and my life has never been better and I have so much more control in my life. I'm working nights in a fish factory with my sister and dad, making pretty good money too actually. But that's beside the point, I'm just wanting to say that you're finally at the stage where you can recognise it and help yourself! Find something that gives you control somewhere else",
      "created_utc": 1612841407.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmntq1a",
      "author": "None",
      "body": "I keep thinking about this post.  I have zero answers but I thought I should tell you that I’m right there with you. I have now gotten comments about my weight from everyone I ever see (I’ve been at this long enough that I have very few people I see regularly.). I have no idea what I’m going to do about that. I feel like the obvious answer is stop, but I can’t. If I told someone (or admitted to these people who probably know already) what I’m doing, then I would need to get help.  If I got help it would just be forcing me to stop doing this, but my mind will never be ok with me unless I look like I’m dying apparently..  so that means that I will obsess over other ways to be rail thin. And if I lose that I’m sure I will go back to either alcohol to forget/not care or drugs to get it back.  I am in so deep. I can’t think about anything else.  I lose hours every day between shopping for, preparing, cleaning up, hiding, and executing all this bullshit.  I am so tired. My life isn’t moving forward. I don’t even want it to anymore.  I’ve been committed, institutionalized, and hospitalized 4 times for suicide/addiction issues in the last 2 years.  I feel like all of these things are going to come to a head and if I don’t die because of one of these addictions I will just spontaneously combust.",
      "created_utc": 1612842932.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmnvdnk",
      "author": "Queenofwands1212",
      "body": "Sometimes it unfortunately takes someone to get to this kind of breaking point to really get the mental illness to crack, and once it’s cracked, you open up the psyche to a new life. You’re on your way there. Your mind is expanding and you have purpose. Sometimes our mental illness becomes our life mission and soul purpose. You deserve treatment that works but it starts with you and your mindset and it sounds like you’re on the path to reclaiming yourself and your life. Sending love to you xo",
      "created_utc": 1612843856.0,
      "score": 1,
      "context": []
    }
  ]
}