{
  "id": "lh7rxf",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1613001656.0,
  "title": "Can we talk about how expensive this is.",
  "selftext": "I am spending SO MUCH money ordering gigantic meals to purge from uber eats, I need to stop, I literally cannot afford to keep spending so much like this but I feel like I cannot stop, I just need to binge and purge so I can feel better, I feel so tired and depressed all the time but ordering a giant meal from mcdonalds or something to purge makes me so happy, and then so sad that I wasted so much money. I feel so irresponsible and horrible, wasting so much money is making me feel even worse about myself which is making me just want to do it more.",
  "url": "https://www.reddit.com/r/bulimia/comments/lh7rxf/can_we_talk_about_how_expensive_this_is/",
  "score": 142,
  "num_comments": 29,
  "comments": [
    {
      "id": "gmw11cp",
      "author": "milk-delivery666",
      "body": "I delete the app very night and re download it every afternoon :') \n\nYou're not alone! Sometimes I delete my credit card information so it's an extra step when checking out ... it deters me from ordering occasionally....",
      "created_utc": 1613007983.0,
      "score": 38,
      "context": []
    },
    {
      "id": "gmw1u2q",
      "author": "AnaDion94",
      "body": "The sobriety app I’m using to track my recovery shows me how much money I’ve saved over the past *checks app* 12 days, 6 hours, 21 minutes, and 33 seconds. The amount I’m saving is a reeeeally good incentive to keep myself b/p free.",
      "created_utc": 1613008382.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gmwgil9",
      "author": "None",
      "body": "I feel this is so not talked about enough.\n\nI am literally 8000 on debt from an episode I went through where aaaaall I did was go from restaurant to restaurant binging and purging, just all day every day. I don't know why at the time, but I was terrified of like facing the day or having time to myself and for some reason just eating and purging was safe for me. I maxed out my credit card and took out a loan and went over my limit on my credit card. Now it's so hard to get back to where I was.",
      "created_utc": 1613015944.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gmwkbr4",
      "author": "Illustrious-Ad5059",
      "body": "I got mint to track my spending and found out I spent 700 dollars on Uber Eats in January 🥲",
      "created_utc": 1613018147.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gmwxata",
      "author": "kittenlost",
      "body": "I think about how much I'm wasting my husband's hard earned money every time I purge. It feels so disrespectful.",
      "created_utc": 1613027284.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gmx1mnb",
      "author": "Particular_Carrot_",
      "body": "I am absolutely in deep debt because of this disease. I feel like it's getting worse the older I get, because I have so much more disposable money and every bank gives me every credit I need to fuel my disorder. I shamefully admit I have binge-purged a few thousand € worth of bank credit in just this year alone.",
      "created_utc": 1613031069.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmxgf0j",
      "author": "None",
      "body": "Something that really helped me was physically turning off my debit card if I am not using it to buy essentials. I often times go \"blind\" when I am about to engage in a binge, and when my card gets declined for being turned off, it snaps me back into reality and stops me from what I am doing. Hope this helps.",
      "created_utc": 1613044629.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmx9u5k",
      "author": "Quiet_girl47",
      "body": "I have Instacart which I try to use to buy groceries to make healthy lunches for work (emphasis on try) but I ended up spending over 200 on ordering food the last two weeks on takeout instead of doing that this week. It’s hard don’t be ashamed.",
      "created_utc": 1613038747.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmx6ffx",
      "author": "k8notkait",
      "body": "Sometimes I chug a rather large glass of water and rethink my options, it’s usually just my empty stomach talking and I’m able to think a bit more rationally once I’m not on empty anymore.",
      "created_utc": 1613035543.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmx5ceu",
      "author": "dolefulAlchemist",
      "body": "Can u try to grocery shop instead??? I bp but I save money by : a cheap buffer food (yous know what that is lol), cheap fillers like homebrand cereal, and I have cheap sweets nd crisps to end one off on. \n\nI keep all the food in the kitchen so if I do buy smth expensive it adds onto the food @ home so it's less expensive if that makes sense :/// nd I buy a lot of off or nearly off food nd store it",
      "created_utc": 1613034549.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmy9jla",
      "author": "ItsElectraBitch",
      "body": "I ordered Uber Eats ~100 times in 2020 for B/Ping which put me ~2500 in credit card debt during the pandemic so yeah, it’s expensive. \n\nWhen I finally decided to face the facts and count the orders and total the debt and get my shit together, the truth was terrifying but it helped me move forward and I have improved a lot. I am now almost two months purge free and my take out purchases are almost down to 1-2 a month or only when going out with friends. \n\nThis shit is real bro (:",
      "created_utc": 1613060022.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmxgbvo",
      "author": "trylongerthanyoufail",
      "body": "I calculated that over the past 10 years I spent in average 30 euros per day on food I would throw up. That's on average, meaning some days I would spend much more, if I would go to restaurant for example, or if I would be in a bad state. 30 euros per day over 10 years is a total of 109500 euros. That's the price of a fucking flat.",
      "created_utc": 1613044558.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmy15dt",
      "author": "Muckl3t",
      "body": "The massive amount of credit card debt I accumulated from buying food (and flushing it down the toilet) was the number motivation for my recovery. It was literally destroying my life. I was in my twenties and couldn’t pay my rent and had to move home with my parents so I could afford to keep up with my addiction. It’s a serious issue and definitely not talked about enough.",
      "created_utc": 1613056374.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmy37rk",
      "author": "Aggravating_Bonus205",
      "body": "I can’t really suggest any solutions or anything like that but I can tell you that you aren’t the first or the last to feel this kind of frustration. I’ve been there. I wish I could tell you how I overcame it but I did. If I can get through it then you can too. Hugs.",
      "created_utc": 1613057283.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmy8dgp",
      "author": "Mamasan-",
      "body": "Just thinking this today.... as I keep making different orders from Taco Bell or Sonic then I delete the app and 10 minutes later do it agin! \n\nAnd it doesn’t even really taste good anymore.",
      "created_utc": 1613059532.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmz3npa",
      "author": "mmolleur",
      "body": "The dental bills too.",
      "created_utc": 1613072524.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmynzb0",
      "author": "Lumplebee",
      "body": "It sucks cause currently it’s not even my money I’m wasting :/ I’m purging my boyfriends groceries. And he KNOWS. Like the shame alone should stop me but the fear of weight gain is too much for some fucking reason.",
      "created_utc": 1613065972.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmxpq4f",
      "author": "manicpanicbp",
      "body": "yes i feel you so much girl! \n\ndo you have someone to hold you accountable? like with your credit/debit card or something?\n\nwishing u good vibes and this shit is hard so do not beat urself up too too much because that doesn’t help in the learning process.\n\ni find talking to people is very distracting and good for me when i feel an urge coming. so if you feel the same way you could text or call someone when u feel a cue that u are going to want to bingw",
      "created_utc": 1613050839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmxrxxk",
      "author": "wingednova",
      "body": "THIS. I’m in uni and ALWAYS broke. I could’ve fucking done so much with all the money... and the time. B/p absolutely absolutely sucks.",
      "created_utc": 1613052023.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmxtxq2",
      "author": "None",
      "body": "Does anyone know if your bank will put holds on your spending? I think that's the only way I can stop. I need to destroy my credit card as well. Only use cash.",
      "created_utc": 1613053036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmxxayq",
      "author": "None",
      "body": "I definitely feel you...",
      "created_utc": 1613054640.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grrzwfi",
      "author": "bellabae81",
      "body": "I have a rule for myself that I refuse to pay for delivery and I HAVE to go and get it myself if I want it that bad. End of story. We bingin’ on a budget out here. Grocery store is where it’s at tho",
      "created_utc": 1616385900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmxtjsu",
      "author": "None",
      "body": "Same.  I tried using a web blocking service on my laptop but now I just use my phone.",
      "created_utc": 1613052843.0,
      "score": 3,
      "context": [
        {
          "id": "gmw11cp",
          "author": "milk-delivery666",
          "body": "I delete the app very night and re download it every afternoon :') \n\nYou're not alone! Sometimes I delete my credit card information so it's an extra step when checking out ... it deters me from ordering occasionally....",
          "created_utc": 1613007983.0
        }
      ]
    },
    {
      "id": "gmwhddm",
      "author": "threeoclockblue",
      "body": "what app is that?? i definitely could benefit from it",
      "created_utc": 1613016416.0,
      "score": 10,
      "context": [
        {
          "id": "gmw1u2q",
          "author": "AnaDion94",
          "body": "The sobriety app I’m using to track my recovery shows me how much money I’ve saved over the past *checks app* 12 days, 6 hours, 21 minutes, and 33 seconds. The amount I’m saving is a reeeeally good incentive to keep myself b/p free.",
          "created_utc": 1613008382.0
        }
      ]
    },
    {
      "id": "gmxtmzw",
      "author": "None",
      "body": "Youre not alone",
      "created_utc": 1613052889.0,
      "score": 4,
      "context": [
        {
          "id": "gmwkbr4",
          "author": "Illustrious-Ad5059",
          "body": "I got mint to track my spending and found out I spent 700 dollars on Uber Eats in January 🥲",
          "created_utc": 1613018147.0
        }
      ]
    },
    {
      "id": "gmy9rru",
      "author": "ItsElectraBitch",
      "body": "P.S. the debt is still there though, that one is not going away that easily 🤡",
      "created_utc": 1613060118.0,
      "score": 1,
      "context": [
        {
          "id": "gmy9jla",
          "author": "ItsElectraBitch",
          "body": "I ordered Uber Eats ~100 times in 2020 for B/Ping which put me ~2500 in credit card debt during the pandemic so yeah, it’s expensive. \n\nWhen I finally decided to face the facts and count the orders and total the debt and get my shit together, the truth was terrifying but it helped me move forward and I have improved a lot. I am now almost two months purge free and my take out purchases are almost down to 1-2 a month or only when going out with friends. \n\nThis shit is real bro (:",
          "created_utc": 1613060022.0
        }
      ]
    },
    {
      "id": "gmx272b",
      "author": "cocooarb",
      "body": "Sounds like the app I Am Sober! I use it too it’s good",
      "created_utc": 1613031586.0,
      "score": 8,
      "context": [
        {
          "id": "gmw1u2q",
          "author": "AnaDion94",
          "body": "The sobriety app I’m using to track my recovery shows me how much money I’ve saved over the past *checks app* 12 days, 6 hours, 21 minutes, and 33 seconds. The amount I’m saving is a reeeeally good incentive to keep myself b/p free.",
          "created_utc": 1613008382.0
        },
        {
          "id": "gmwhddm",
          "author": "threeoclockblue",
          "body": "what app is that?? i definitely could benefit from it",
          "created_utc": 1613016416.0
        }
      ]
    },
    {
      "id": "gmwjl2o",
      "author": "AnaDion94",
      "body": "I Am Sober. I think someone in this sub recommended it when they hit 76 days actually? I pledge every morning, review at night, get little inspirational quotes (mostly stupid but I screenshot the good ones), and there’s a forum if you want to share struggles or victories. \n\nAnd sometimes when I’m having a bad day I’ll just sit and look at the counter go up instead of ordering a pizza.",
      "created_utc": 1613017702.0,
      "score": 4,
      "context": [
        {
          "id": "gmw1u2q",
          "author": "AnaDion94",
          "body": "The sobriety app I’m using to track my recovery shows me how much money I’ve saved over the past *checks app* 12 days, 6 hours, 21 minutes, and 33 seconds. The amount I’m saving is a reeeeally good incentive to keep myself b/p free.",
          "created_utc": 1613008382.0
        },
        {
          "id": "gmwhddm",
          "author": "threeoclockblue",
          "body": "what app is that?? i definitely could benefit from it",
          "created_utc": 1613016416.0
        }
      ]
    }
  ]
}