{
  "id": "ll4ibp",
  "subreddit": "bulimia",
  "author": "oyyl98",
  "created_utc": 1613484453.0,
  "title": "I'm jealous of my friend",
  "selftext": "I have this friend (she doesn't have an ED) and I'm so jealous of her for the stupidest reason. It's so wrong and I hate myself for it. Every time I mention eating, she always says \"she didn't eat for x time\" because she just can't be bothered to eat, or she just didn't think about eating. And I envy that. I wish I had no motivation to eat. I wish I didn't cope with things by eating. I wish I wasn't thinking about food 24/7. She knows I have bulimia, and I'm sure she doesn't do it on purpose, but every time she says it I wish I could just ... not eat for days. Of course, I can't do that because all I think about is food but I just wish. I wish even for one day I could just not eat.",
  "url": "https://www.reddit.com/r/bulimia/comments/ll4ibp/im_jealous_of_my_friend/",
  "score": 91,
  "num_comments": 8,
  "comments": [
    {
      "id": "gnnkxqe",
      "author": "Comprehensive-Pop-47",
      "body": "I don’t want to say she does to it on purpose; you know your friend better than I do, obviously. However, you do not know what goes on in her head. She very well could have a problem with eating, too. None of my friends knew I had an ED (unless I told them), because I hid it so well. Maybe she feels the need to mention her lack of eating for validation. I could be wrong, but my point is, don’t beat yourself up. You are working through your issues; don’t let what she says get you down. Perhaps avoid talking about eating with her? You should find friends who make you feel loved and safe, not that trigger harmful thoughts. I love you and hope the best for you. You’re doing great. You’re not alone.",
      "created_utc": 1613489448.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gnnexje",
      "author": "waterandicethrowaway",
      "body": "My friends do the same thing so I totally feel you there.",
      "created_utc": 1613486514.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gnogsk0",
      "author": "m4ngo_o",
      "body": "I understand how you feel and i’ve gone through little episodes of jealousy towards because of their eating habits, and Im not completely sure but she could be an intuitive eater, which means she understands when she is hungry and not hungry from letting herself eat the foods she wants and not restricting, this is why recovery is so important, it’ll stop the insatiable hunger, i hope you’re able to get better, im with you.",
      "created_utc": 1613503576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnpzobl",
      "author": "JetPatriot",
      "body": "OP- you never know if someone has an eating disorder.  My own husband would tell people \"Oh Juliet can eat whatever she wants and not gain weight!\"  He never realized that I threw it up in the toilet.",
      "created_utc": 1613529961.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnopyu3",
      "author": "None",
      "body": "It’s very common for people with EDs to give the appearance that they eat whatever they want and are ‘naturally’ skinny. Ik when I was at my lowest weight, I’d talk to people about “out-eating” them (because I could, not because I would...)",
      "created_utc": 1613507689.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnnyelq",
      "author": "PoppyGloria-69",
      "body": "i swear its like they do it on purpose:(",
      "created_utc": 1613495484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnnsohk",
      "author": "oyyl98",
      "body": "True, that’s something I tell myself as well, maybe she has an ED and she’s not as open (?) with it as I am. Especially since I always respond to her by saying “oh I wish I could do that”, so I don’t know if she takes it as a joke or maybe I unknowingly give her the validation she needs. Thank you for your comment though, it helped a lot. Thank you.",
      "created_utc": 1613492970.0,
      "score": 6,
      "context": [
        {
          "id": "gnnkxqe",
          "author": "Comprehensive-Pop-47",
          "body": "I don’t want to say she does to it on purpose; you know your friend better than I do, obviously. However, you do not know what goes on in her head. She very well could have a problem with eating, too. None of my friends knew I had an ED (unless I told them), because I hid it so well. Maybe she feels the need to mention her lack of eating for validation. I could be wrong, but my point is, don’t beat yourself up. You are working through your issues; don’t let what she says get you down. Perhaps avoid talking about eating with her? You should find friends who make you feel loved and safe, not that trigger harmful thoughts. I love you and hope the best for you. You’re doing great. You’re not alone.",
          "created_utc": 1613489448.0
        }
      ]
    },
    {
      "id": "gnrm829",
      "author": "oyyl98",
      "body": "I totally agree. It’s wrong for me to assume she doesn’t have an ED. I assumed that since we’ve been pretty open with each other, and we often talked about EDs in general. I shouldn’t have, that’s my mistake. However, I did explain to her that EDs were very competitive so I just like to think knowing that she wouldn’t purposely trigger me...",
      "created_utc": 1613572046.0,
      "score": 1,
      "context": [
        {
          "id": "gnpzobl",
          "author": "JetPatriot",
          "body": "OP- you never know if someone has an eating disorder.  My own husband would tell people \"Oh Juliet can eat whatever she wants and not gain weight!\"  He never realized that I threw it up in the toilet.",
          "created_utc": 1613529961.0
        }
      ]
    }
  ]
}