{
  "id": "llctcf",
  "subreddit": "bulimia",
  "author": "frrruitbat",
  "created_utc": 1613507292.0,
  "title": "your teeth WILL absolutely decay. No way around it",
  "selftext": "12 year bulimic here. Cant stop crying. \n\nI recently managed to force my way into a small bought of not purging (yay very proud woohoo) and found the courage to go to the dentist. I had one root canal (of 6 total needed)   completed !!! But last week, when eating an apple, I had another tooth break. I told my dentist when I went to get my crown put on today. My dentist x-rayed this broken tooth and discovered a severe infection pressed right up against my sinus cavity - which he told me, is very very dangerous.\n\nFine, just yank it - I’ll get an implant whenever I decide I can afford that. Except no, I can’t just have him yank it because I just had a fucking rhinoplasty (another symptom of my self loathing) and any sort of pressure on my sinus cavity, especially a tooth that is so close, could cause damage or worse collapse that sinus cavity \n\nI am 25 and missing 4 teeth, this will be 5. Thankfully they are all towards the back, but god, I really just lost a lot of wind out of my sails. I am defeated today and just want to cry into the toilet. \n\nDo you ever just sit here and think how easy it would be to skip over the purging thing and just be a “good” anorexic? I am so hopeless. I hate this disease. I love it but hate it at the same time. I love keeping her in my back pocket as my escape plan, I hate the guilt, shame and consequences that she brings into my life. \n\nI truly wish I had the nerve to kill myself, but I don’t want to die. I just want to be thin, I want to be pretty. I want to be free and yet here I am clipping my own fucking wings.\n\n\nThanks for reading, and if you’re struggling, or newly experiencing bulimic behavior, please ask for help. It doesn’t just go away when you reach your “goal weight” . it gets harder and harder every waking moment the more you go on.",
  "url": "https://www.reddit.com/r/bulimia/comments/llctcf/your_teeth_will_absolutely_decay_no_way_around_it/",
  "score": 366,
  "num_comments": 32,
  "comments": [
    {
      "id": "gnoqj87",
      "author": "Good-Composer3859",
      "body": "Sweetheart, I feel you 100%.  I am a bulimic as well for nearly 13 years. The last 9 of those I haven't went to the dentist in fear of them knowing I was bulimic.  But now it can't be avoided any longer,  one of my top teeth hurts like heck at the gum line, I feel like I can see the tooth right through the gum. I finally got the courage to make an appointment, due to covid the earliest I can get in is in 3 months.  I am beyond scared of the news I will receive from the dentist,  the cost,  the pain, and the recovery. I knew for all these years what I was doing was awful,  but I managed to block it out until now. The full realization of the damage of this disease is finally starting to sink in when it is too late. I'm sad and I'm scared.  I am so happy to know I am not alone in this.  Keep on staying strong you beautiful soul.  You are not alone in this ❤❤❤❤ I am very proud of you for your short break from purging,  I know how hard it is.  I completely agree with loving and hating bulimia as well.  You never know how strong you are until being strong is all you can do.  Keep your chin up love,  you are beautiful.",
      "created_utc": 1613507936.0,
      "score": 45,
      "context": []
    },
    {
      "id": "gnopirh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1613507495.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gnoyj39",
      "author": "No-Explanation-3324",
      "body": "You are an amazing superperson for going to the dentist. The first time I went I had 8 cavities, a root canal, and a fuck ton of gingivitis. Take it easy on yourself, a lot of us have been there, and I don’t think you’d be mean to any of us for that 💕 treat yourself like a friend today (and everyday). You deserve it.",
      "created_utc": 1613511449.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gnp64ty",
      "author": "parishiltonsghost",
      "body": "had my first tooth break the other day, taking it as a sign that i need to get my purging under control :/",
      "created_utc": 1613514921.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gnpdt2z",
      "author": "elpintor91",
      "body": "I feel this. I avoid the dentist because not only is it expensive without insurance but because I am really fucking ashamed. And dentist are not Nice or gentle about bad news either so I get a lot of anxiety. \nAnyways after months of pain I finally went in and he told me it was too late for a root canal and my only option was implant or crown which both ranged from 14-15,000. I opted for a 200 dollar extraction. I cried so much from embarrassment and just fucking shame of being so neglectful to myself. And for what? I really can’t answer that because I’m still purging.\n\nI’m so sorry you have to go through this. A lot of people don’t understand how much of a fucked up mental disorder this is",
      "created_utc": 1613518669.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gnpawrx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1613517228.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gnpk6kn",
      "author": "rrrachel_rocks",
      "body": "💜💜\nEditing to add: I’ve been there too, babe. Get one thing fixed, something else starts hurting or breaks. My parents paid for BRACES. I still feel like my dad resents me for that. My teeth looked really good and I blew it. Because “just one more b/p” wasn’t something I took seriously until within the last year. I’ve wasted thousands upon thousands of dollars, on food & dental work alone, over the last 18 years of my freaking life.",
      "created_utc": 1613521898.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gnq15z3",
      "author": "Sundowning_55",
      "body": "Totally get it! However I will say... being honest with my dentist early on has been so helpful. Struggled with ED for the past 10 years and about 4 years ago my teeth hurt so bad. My dentist recommended a cleaning every 4 months and I got special prescription toothpaste with extra fluoride and it’s been amazing. I know it can feel like a lot of money but it’s soooo worth it to fix/protect your teeth now. Also some dentists provide their own insurance that can be pretty cheap!",
      "created_utc": 1613530740.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gnpdjzj",
      "author": "cdreh0",
      "body": "22 years here. 7 crowns, three root canals, a ton of chips and breaks. I've resigned myself to having to have them all crowned eventually. I cried the first two times I found tooth fragments while chewing and now I'm just used to it. It is awful. Try to rinse with baking soda and warm water after every purge. Even better, try to get the help we all need. I am so sorry you are going through this, I know the terror and shame that goes along with it.",
      "created_utc": 1613518539.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gnqyyq3",
      "author": "luca-nicoletti",
      "body": "This post scared the hell out of me!  \nI'm suffering from BED and started purging about a year ago, reading this makes me realise I should stop this behaviour, not only for the economic side, which you mentioned (\"I decide I can afford that\" - that's **so** strong!) but also for the healthy one, even if dentist nowadays can \"fix\" almost everything, that's not a valid point.\n\nI can't say I feel you as I'm not into your situation but just imagining myself there, in your situation, makes me want to punch myself in the face for what I started doing with my eating habits.\n\nYou can get over it! We're here to support you.",
      "created_utc": 1613553851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gnp84iz",
      "author": "None",
      "body": "I’m also 25 and been struggling with ED’s since I was 6 and 10 years of strictly purging. My teeth are fucked. Last year I got braces (again),  my bottom teeth got pulled back because of the toothbrush pushing them while I purged. \nI’ve lost a big chunk of my enamel already and my gums are always bleeding. \n\nBut somehow the fear of gaining weight is bigger than losing my teeth and my whole quality of life. Fuck this disease.",
      "created_utc": 1613515868.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gnpuhs3",
      "author": "babychurro98",
      "body": "I’ve been a bulimic for 14 years now too... my teeth are very cracked, thin and translucent and it’s been really scary. My doc said replacing them would cost around 25-30,000 which is so scary but hey, if you think about it u can replace ur teeth and ur body is so strong for keeping you alive and you will figure out ur teeth situation. You are so strong and u are still here for a reason, sending lots of love ur way, we really got this, bulimia is not our identity, it is an illness and you should cut urself some slack it’s a really hard diseases to recover from",
      "created_utc": 1613527240.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gnq1yf5",
      "author": "spatulajean",
      "body": "I’m so sorry you have to experience this. I just got the courage to go to the dentist after struggling with purging on and off for 17 years and the damage is bad. Worst of all my insurance won’t cover everything that needs to be done, so I’ll probably just have to get a bunch of teeth pulled. I feel terrible and stupid now.",
      "created_utc": 1613531155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnq8ruk",
      "author": "victoriousbbyg",
      "body": "11 years here. I hope everyone gets the help they need. While you get help you can try a PPI for reducing stomach acid and damage. Through luck and PPIs I’ve only got one kinda sensitive spot and maybe a cracked wisdom tooth. I wish you luck friend and anyone else struggling.",
      "created_utc": 1613534937.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnqh1pm",
      "author": "None",
      "body": "I'm 36, bulimic for 12 years, and have ZERO teeth.... so you get THAT to look forward to.... salvage what you can right now!",
      "created_utc": 1613539684.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnq5eok",
      "author": "FluidStudent942",
      "body": "I’m so fucking sorry that you’re going thru this. I don’t know the right words to say but you’re have every right to be here & I hope you fight to stay. You’re a beautiful soul & I rlly rlly wish the best for you. Keep on keeping on :)\n\nEdit: kinda stalked you & you’re so pretty omfg. please please believe it when I say this",
      "created_utc": 1613533041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnqym59",
      "author": "None",
      "body": "I'm lucky to not have any problems (yet) and this is a big motivation to stop purging. Im down to doing it around once a week or less now :)",
      "created_utc": 1613553506.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnrbsbu",
      "author": "sarako7",
      "body": "i’m 18 and also had terrible dental problems. i’m pretty sure i’ve had what i think is something like medical ptsd ever since i got a tooth pulled so i’ve been avoiding the dentist for years and have even more problems now, pretty sure i need at least one more tooth pulled and i just can’t bring myself to go through it again. the guilt of letting myself get there in the first place is overwhelming. it’s horrible because the longer i leave it, the worse it’ll get and the longer i’ll have to get treated which will make it more traumatic when i inevitably have to go but i can barely cope with flashbacks of being at the dentist so it’s damn near impossible to make myself go back there. i can’t go to therapy for any of those things for a bunch of reasons but i’m still trying my hardest to book a dental appointment and just go. thanks for the post, i feel a lot less alone <3",
      "created_utc": 1613565680.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnrz98y",
      "author": "ouid69",
      "body": "It’s legit insanity, bc I know that I’m detrimentally hurting my body and it’s features, but I can’t stop, and I truly feel so sorry for myself.  Feels really nice to know I’m not alone, but still wishing both of us/all of us a healthy forever lasting recovery💕.",
      "created_utc": 1613578231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gns9m3t",
      "author": "None",
      "body": "Fuck I am so sorry, I truly wish you'll get better soon. This disease is honestly so life sucking, it has taken 10 years of my life already. One moment I think I'm cured because I haven't puked in a few months, and the next I'm purging over a stupid ice cream. What you said about keeping it in your back pocket just in case is so relatable, like, I don't want to stop, I just wish I had never become bulimic in the first place.",
      "created_utc": 1613582645.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5385pm",
      "author": "Insomnialover101",
      "body": "If I COULD TURN BACK TIME\n\nI am 45 yrs old. I have been bulimic since I was 12. The physical damage I have done to myself is irreversible. I used to have perfect teeth, and now I have both a full set of top and bottom dentures. I started menopause at 40. I am a qualified scientist specialising in cancer research and forensic science. Because of bulimia I can't hold down a job for more than three months. I was married once, and it lasted for 3 years, and it was a direct result of my eating disorder that it ended in divorce. Now, I am living with my elderly parents, and to be brutally honest, I feel like a total failure/loser and a waste of space. If this post reaches just 1 person, then I am happy I found the courage to write it. \nGet help. Live your life. Don't end up like me xx",
      "created_utc": 1716331339.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnrzlna",
      "author": "None",
      "body": "Damn this hit me hard. So sorry your going through this. I haven’t been to the dentist in like 4 years... to scared to go",
      "created_utc": 1613578380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbij1na",
      "author": "Ly_172",
      "body": "Does anyone know how long it takes for it to start? I'm scared. I'm really really scared. I have permanent damage to my jaw already and have recently developed acid reflux and digestive issues and I have really nice teeth and I'm so so scared. I'm a teenager and my parents will hate me if they find out. I need to know if it's already starting to happen or if there's a chance that if I fully recover my teeth will be okay.",
      "created_utc": 1701410206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gnqhe81",
      "author": "Aphor1st",
      "body": "If it makes you feel better yes they do know you are bulimic but all they really care about is protecting your teeth. My dentist prescribed me special tooth paste for daily use and a mouthwash I can use after purging.",
      "created_utc": 1613539894.0,
      "score": 10,
      "context": [
        {
          "id": "gnoqj87",
          "author": "Good-Composer3859",
          "body": "Sweetheart, I feel you 100%.  I am a bulimic as well for nearly 13 years. The last 9 of those I haven't went to the dentist in fear of them knowing I was bulimic.  But now it can't be avoided any longer,  one of my top teeth hurts like heck at the gum line, I feel like I can see the tooth right through the gum. I finally got the courage to make an appointment, due to covid the earliest I can get in is in 3 months.  I am beyond scared of the news I will receive from the dentist,  the cost,  the pain, and the recovery. I knew for all these years what I was doing was awful,  but I managed to block it out until now. The full realization of the damage of this disease is finally starting to sink in when it is too late. I'm sad and I'm scared.  I am so happy to know I am not alone in this.  Keep on staying strong you beautiful soul.  You are not alone in this ❤❤❤❤ I am very proud of you for your short break from purging,  I know how hard it is.  I completely agree with loving and hating bulimia as well.  You never know how strong you are until being strong is all you can do.  Keep your chin up love,  you are beautiful.",
          "created_utc": 1613507936.0
        }
      ]
    },
    {
      "id": "gnoqhhy",
      "author": "frrruitbat",
      "body": "Thank you  for the love, thank you for hearing me. 😔it is truly the worst feeling.\n\nUltimately, I feel like I’m losing control all over again. Sending love & healing your way, friend. One day we will make it through",
      "created_utc": 1613507915.0,
      "score": 12,
      "context": [
        {
          "id": "gnopirh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613507495.0
        }
      ]
    },
    {
      "id": "gnp9zqq",
      "author": "frrruitbat",
      "body": "You’re absolutely right. Thank you for relating. I appreciate you 💓",
      "created_utc": 1613516775.0,
      "score": 8,
      "context": [
        {
          "id": "gnoyj39",
          "author": "No-Explanation-3324",
          "body": "You are an amazing superperson for going to the dentist. The first time I went I had 8 cavities, a root canal, and a fuck ton of gingivitis. Take it easy on yourself, a lot of us have been there, and I don’t think you’d be mean to any of us for that 💕 treat yourself like a friend today (and everyday). You deserve it.",
          "created_utc": 1613511449.0
        }
      ]
    },
    {
      "id": "gnp9y21",
      "author": "frrruitbat",
      "body": "PLEASE (and I say this with no judgment) seek help. I would trade just about anything in order to go back in time and get a handle on this before the damage starting happening. You’re stronger than this",
      "created_utc": 1613516752.0,
      "score": 22,
      "context": [
        {
          "id": "gnp64ty",
          "author": "parishiltonsghost",
          "body": "had my first tooth break the other day, taking it as a sign that i need to get my purging under control :/",
          "created_utc": 1613514921.0
        }
      ]
    },
    {
      "id": "gnplihd",
      "author": "frrruitbat",
      "body": "Sending love your way too ✨ congrats on your decision today and I support you, and am joining you in my decision today.\n\nI’ve calmed down a little, somewhat am taking a step back and trying to be grateful.\n\nTeeth are replaceable! And we will keep pushing for the day where this gets easier ✨",
      "created_utc": 1613522586.0,
      "score": 5,
      "context": [
        {
          "id": "gnpawrx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613517228.0
        }
      ]
    },
    {
      "id": "kz6jhsn",
      "author": "jrm210",
      "body": "Hey, could you give any updates or help to anyone possibly in this situation now?",
      "created_utc": 1712891700.0,
      "score": 1,
      "context": [
        {
          "id": "gnpdjzj",
          "author": "cdreh0",
          "body": "22 years here. 7 crowns, three root canals, a ton of chips and breaks. I've resigned myself to having to have them all crowned eventually. I cried the first two times I found tooth fragments while chewing and now I'm just used to it. It is awful. Try to rinse with baking soda and warm water after every purge. Even better, try to get the help we all need. I am so sorry you are going through this, I know the terror and shame that goes along with it.",
          "created_utc": 1613518539.0
        }
      ]
    },
    {
      "id": "l99ne0w",
      "author": "Bake-Some",
      "body": "i’m so sorry. you’re not a loser tho. you’re a whole scientist. at least you did that. i have too much bulimic/restrictive brain fog to be academically successful",
      "created_utc": 1718774195.0,
      "score": 3,
      "context": [
        {
          "id": "l5385pm",
          "author": "Insomnialover101",
          "body": "If I COULD TURN BACK TIME\n\nI am 45 yrs old. I have been bulimic since I was 12. The physical damage I have done to myself is irreversible. I used to have perfect teeth, and now I have both a full set of top and bottom dentures. I started menopause at 40. I am a qualified scientist specialising in cancer research and forensic science. Because of bulimia I can't hold down a job for more than three months. I was married once, and it lasted for 3 years, and it was a direct result of my eating disorder that it ended in divorce. Now, I am living with my elderly parents, and to be brutally honest, I feel like a total failure/loser and a waste of space. If this post reaches just 1 person, then I am happy I found the courage to write it. \nGet help. Live your life. Don't end up like me xx",
          "created_utc": 1716331339.0
        }
      ]
    },
    {
      "id": "kblazti",
      "author": "frrruitbat",
      "body": "Your parents won’t hate you if they find out… they’ll likely be scared and concerned but it’s not like you are bad or wrong for having this struggle.\n\nFor me, this showed up about 3 years after I started binging/purging. If you are already experiencing jaw damage, I’d recommend talking to your dentist about specialty toothpaste they can offer as well as rinsing with peroxide/ baking soda. It may neutralize the acidity in your mouth and prevent catastrophic damage going further.  Depending on your age / laws in your state, your dentist cannot disclose your medical issues with your parents. So you can be honest with your dentist without risking your family finding out.\n\nYou’re going to be ok. It’s ok to reach out for help. If I tackled the problems I have with my teeth at your age I would have been able to save the 6 molars and canine im now missing and need implants for.",
      "created_utc": 1701461084.0,
      "score": 1,
      "context": [
        {
          "id": "kbij1na",
          "author": "Ly_172",
          "body": "Does anyone know how long it takes for it to start? I'm scared. I'm really really scared. I have permanent damage to my jaw already and have recently developed acid reflux and digestive issues and I have really nice teeth and I'm so so scared. I'm a teenager and my parents will hate me if they find out. I need to know if it's already starting to happen or if there's a chance that if I fully recover my teeth will be okay.",
          "created_utc": 1701410206.0
        }
      ]
    },
    {
      "id": "kzb9qpr",
      "author": "cdreh0",
      "body": "Oh it only gets worse. Has to have a back molar pulled. Need an upper molar pulled and replaced with an implant. Lost a big piece of tooth two days ago, in the process of having them all crowned to help keep them.",
      "created_utc": 1712966165.0,
      "score": 1,
      "context": [
        {
          "id": "gnpdjzj",
          "author": "cdreh0",
          "body": "22 years here. 7 crowns, three root canals, a ton of chips and breaks. I've resigned myself to having to have them all crowned eventually. I cried the first two times I found tooth fragments while chewing and now I'm just used to it. It is awful. Try to rinse with baking soda and warm water after every purge. Even better, try to get the help we all need. I am so sorry you are going through this, I know the terror and shame that goes along with it.",
          "created_utc": 1613518539.0
        },
        {
          "id": "kz6jhsn",
          "author": "jrm210",
          "body": "Hey, could you give any updates or help to anyone possibly in this situation now?",
          "created_utc": 1712891700.0
        }
      ]
    },
    {
      "id": "kblq7vf",
      "author": "Ly_172",
      "body": "Unfortunately, as I've seen with some of my other issues, my parents are not very supportive and tend to just yell and ground me. The appointment I have in a few weeks is mainly for my jaw. I know I need to stop before I do more damage to my body, and I am trying really hard. Thank you for your reply, it was helpful :)",
      "created_utc": 1701466914.0,
      "score": 1,
      "context": [
        {
          "id": "kbij1na",
          "author": "Ly_172",
          "body": "Does anyone know how long it takes for it to start? I'm scared. I'm really really scared. I have permanent damage to my jaw already and have recently developed acid reflux and digestive issues and I have really nice teeth and I'm so so scared. I'm a teenager and my parents will hate me if they find out. I need to know if it's already starting to happen or if there's a chance that if I fully recover my teeth will be okay.",
          "created_utc": 1701410206.0
        },
        {
          "id": "kblazti",
          "author": "frrruitbat",
          "body": "Your parents won’t hate you if they find out… they’ll likely be scared and concerned but it’s not like you are bad or wrong for having this struggle.\n\nFor me, this showed up about 3 years after I started binging/purging. If you are already experiencing jaw damage, I’d recommend talking to your dentist about specialty toothpaste they can offer as well as rinsing with peroxide/ baking soda. It may neutralize the acidity in your mouth and prevent catastrophic damage going further.  Depending on your age / laws in your state, your dentist cannot disclose your medical issues with your parents. So you can be honest with your dentist without risking your family finding out.\n\nYou’re going to be ok. It’s ok to reach out for help. If I tackled the problems I have with my teeth at your age I would have been able to save the 6 molars and canine im now missing and need implants for.",
          "created_utc": 1701461084.0
        }
      ]
    },
    {
      "id": "kblru3w",
      "author": "frrruitbat",
      "body": "I feel you, completely. No matter what just remember you’re doing your best and that’s enough. Wishing you all the healing in the world ❤️✨",
      "created_utc": 1701467536.0,
      "score": 1,
      "context": [
        {
          "id": "kbij1na",
          "author": "Ly_172",
          "body": "Does anyone know how long it takes for it to start? I'm scared. I'm really really scared. I have permanent damage to my jaw already and have recently developed acid reflux and digestive issues and I have really nice teeth and I'm so so scared. I'm a teenager and my parents will hate me if they find out. I need to know if it's already starting to happen or if there's a chance that if I fully recover my teeth will be okay.",
          "created_utc": 1701410206.0
        },
        {
          "id": "kblazti",
          "author": "frrruitbat",
          "body": "Your parents won’t hate you if they find out… they’ll likely be scared and concerned but it’s not like you are bad or wrong for having this struggle.\n\nFor me, this showed up about 3 years after I started binging/purging. If you are already experiencing jaw damage, I’d recommend talking to your dentist about specialty toothpaste they can offer as well as rinsing with peroxide/ baking soda. It may neutralize the acidity in your mouth and prevent catastrophic damage going further.  Depending on your age / laws in your state, your dentist cannot disclose your medical issues with your parents. So you can be honest with your dentist without risking your family finding out.\n\nYou’re going to be ok. It’s ok to reach out for help. If I tackled the problems I have with my teeth at your age I would have been able to save the 6 molars and canine im now missing and need implants for.",
          "created_utc": 1701461084.0
        },
        {
          "id": "kblq7vf",
          "author": "Ly_172",
          "body": "Unfortunately, as I've seen with some of my other issues, my parents are not very supportive and tend to just yell and ground me. The appointment I have in a few weeks is mainly for my jaw. I know I need to stop before I do more damage to my body, and I am trying really hard. Thank you for your reply, it was helpful :)",
          "created_utc": 1701466914.0
        }
      ]
    }
  ]
}