{
  "id": "lmz9gt",
  "subreddit": "bulimia",
  "author": "chognogg",
  "created_utc": 1613687484.0,
  "title": "A bulimic's worst nightmare.",
  "selftext": "Not only do I live with family, but I live in Texas, where the power & water keeps shutting off.\n\nThe toilets, sinks, showers, don't work. \n\nNow, I've been trying so hard to restrict my food intake so I don't binge and be stranded and helpless because I can't purge. However, recently, I've been binging and it makes me feel so disgusting that I can't purge.\n\nSorry, I just thought I'd let y'all know what's going on down here in Texas. I wish all y'all fellow Texan bulimics good luck...",
  "url": "https://www.reddit.com/r/bulimia/comments/lmz9gt/a_bulimics_worst_nightmare/",
  "score": 159,
  "num_comments": 13,
  "comments": [
    {
      "id": "gny71xp",
      "author": "MyHusbandsFarts",
      "body": "I'm so sorry that situation sounds really crappy. Try to be as kind to yourself as possible. The situation won't last forever and however bad you feel, bulimia always makes you feel worse when you can't bend to it's will. In a way you're testing the strength needed to begin quitting but it's never easy to be forced into it instead of going through guided treatment. \n\nBig hug, I'm sorry it's not nice right now especially",
      "created_utc": 1613693286.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gnya8aj",
      "author": "Mamasan-",
      "body": "Fellow Texan here. I threw up in the trash can today because there’s no water. \n\nUgggggggh",
      "created_utc": 1613694865.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gny9zyf",
      "author": "None",
      "body": "Same boat plus my apartment flooded when my neighbor's pipes burst",
      "created_utc": 1613694749.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gnyadee",
      "author": "fantasticka789",
      "body": "Hang in there hon, I can't imagine! I'm up in Kansas, we've been lucky. I've been thinking about you all though, I hope they figure shit out soon!!!!",
      "created_utc": 1613694936.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gnymxm7",
      "author": "elpintor91",
      "body": "I’m so sorry. I’ve been in a situation where our entire bathroom was being redone for a mold issue. I ended up vomiting in the bush outside and blamed it on being drunk. Fucking sucks. Hopefully you have a breakthrough of some sort that is beneficial to you.",
      "created_utc": 1613701477.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gnz8mlp",
      "author": "Queenofwands1212",
      "body": "Omg I FEEL FOR YOU. I will share a little story that will make you feel better. Summer 2019 I moved into a house in Philly. After a week my personal bathroom toilet got clogged and I couldn’t use it for a week or so. I was binging and purging on the regular. I ended up purging in a bag, walking it down the street searching for a trash bin but couldn’t find one. I ended up chucking it under the bridge where a lot of garbage was and when I walked back, a woman on her porch literally called me out and asked me if I just threw out trash over there. It was so embarrassing and I had to make up some insane excuse.",
      "created_utc": 1613714165.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gnz3l68",
      "author": "DeathmetalFiretruck",
      "body": "BRUH.\n\nIt’s hell. I’ve had to get creative on how to neatly “purge” in the dark with no water while wearing 3 jackets bc no heat..\n\n\nFUCK THIS DISORDER",
      "created_utc": 1613710796.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gnzawug",
      "author": "throwaway1930488888",
      "body": "Damn I didn’t know there was a power outage out there. \n\nI’m sorry. :( That really sucks.",
      "created_utc": 1613715852.0,
      "score": 3,
      "context": []
    },
    {
      "id": "go1uj74",
      "author": "LeeesaBean",
      "body": "Same here... I have been so agitated and mean with my family the past week, just because I can't binge and purge to comfort myself. Took a walk in the cold the other night to barf in the creek, but I just couldn't do it.",
      "created_utc": 1613770323.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnz54td",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1613711778.0,
      "score": 5,
      "context": []
    },
    {
      "id": "go9oyxc",
      "author": "Comfortable_Ad6977",
      "body": "I live in India  and yesterday I binged but I didn't know our water got cut off I had no choice but to sneakily fill a bucket of water from the drinking water filters🤣",
      "created_utc": 1613942769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gnyd5u0",
      "author": "baronessblockage",
      "body": "Yup just recently did the trash can vomiting... and my father found it!  He did not really realize what it was!",
      "created_utc": 1613696390.0,
      "score": 15,
      "context": [
        {
          "id": "gnya8aj",
          "author": "Mamasan-",
          "body": "Fellow Texan here. I threw up in the trash can today because there’s no water. \n\nUgggggggh",
          "created_utc": 1613694865.0
        }
      ]
    },
    {
      "id": "gnyafzg",
      "author": "fantasticka789",
      "body": "Oh God I'm sorry!",
      "created_utc": 1613694972.0,
      "score": 9,
      "context": [
        {
          "id": "gny9zyf",
          "author": "None",
          "body": "Same boat plus my apartment flooded when my neighbor's pipes burst",
          "created_utc": 1613694749.0
        }
      ]
    }
  ]
}