{
  "id": "lnfwih",
  "subreddit": "bulimia",
  "author": "iShouldHaveBeenAbort",
  "created_utc": 1613741481.0,
  "title": "I binged on like a weeks worth of food in a single sitting. Again.",
  "selftext": "Two gallons of non dairy milk, two boxes of cereal, two family sized bags of chips, multiple giant chocolate bars, multiple pastries, cookies, sweets I can’t even keep count or track all of it. I don’t have the fucking money to keep impulsively buying all this just to binge and purge but I feel like I completely separate from myself and snap out of it only after it is all over. I want this to all end.",
  "url": "https://www.reddit.com/r/bulimia/comments/lnfwih/i_binged_on_like_a_weeks_worth_of_food_in_a/",
  "score": 107,
  "num_comments": 4,
  "comments": [
    {
      "id": "go12qu3",
      "author": "ouid69",
      "body": "You’re def not alone. Soooo much money wasted on shit that I know is about to come up later. It’s honestly mentally, emotionally, physically, and financially exhausting. We just gotta take this sickness one day at a time. Of course you’re going to fuck up sometimes. You’re only human. Not only that your a human suffering from something mentally and physically MAJOR. Don’t be so hard on yourself. Lets try again to stay on track tomorrow, and if you fuck up that day to, who freakin cares. We’ll try again and again and again til we get it right. Sending you good vibes, babe💕💕💕💕.",
      "created_utc": 1613757234.0,
      "score": 14,
      "context": []
    },
    {
      "id": "go19vu5",
      "author": "dolefulAlchemist",
      "body": "is it possible to cheapen your grocery shops?? ive had bulimia when i was literally in poverty before i got an income again and what i managed to do was get some shit i knew i wouldnt eat and only do my big grocery shop once a week at a certain $$$ lim. i dont binge on tinned very boring tasting veg, margarine and vegan mayo, other nonsweet sauces, and soup items: onions, spices, stock cubes, cabbage. and i have protein shake mix  \n\n\nso if i fuck up and waste all the shop on monday, w/e, i have soup and protein powder at home. leave ur PURSE AT HOME ND ONLY BRING THE AMOUNT OF MONEY U KNOW ULL NEED .  but this helped me",
      "created_utc": 1613760435.0,
      "score": 6,
      "context": []
    },
    {
      "id": "go1dm8o",
      "author": "ErosCantThink",
      "body": "I used to do that too. I'm hoping that you're doing well now and taking it easy, I know huge binges can be overwhelming :) 🦋✨",
      "created_utc": 1613762079.0,
      "score": 3,
      "context": []
    },
    {
      "id": "go2wkyo",
      "author": "JetPatriot",
      "body": "Hell me too- I bought it for the weekend and ate it all tonight :/",
      "created_utc": 1613790083.0,
      "score": 1,
      "context": []
    }
  ]
}