{
  "id": "lnx5c3",
  "subreddit": "bulimia",
  "author": "blufcbb",
  "created_utc": 1613788575.0,
  "title": "Acid reflux will be the death of me",
  "selftext": "I've been b//p for a free weeks straight now, (small steps yay!!) but the other day I chugged a glass of milk after eating cookies and I wasn't even freaking about the calories or how I was going to get rid of it I just enjoyed the food and that was it. \n\nAfter that I was helping my mom load the dishwasher so I bent down and -- ended up with my stomach contents on the kitchen floor. (It was not induced or anything, purely automatic- so much so I don't count it as a purge since I had no intention do doing so. )\n\nIt was very embarrassing to do that in front of my mom who just looked on, in stunned silence as I joked it off. \n\n*facepalm* \n\nLiterally how embarrassing.",
  "url": "https://www.reddit.com/r/bulimia/comments/lnx5c3/acid_reflux_will_be_the_death_of_me/",
  "score": 70,
  "num_comments": 6,
  "comments": [
    {
      "id": "go3lmm4",
      "author": "JetPatriot",
      "body": "It happens, sadly :/",
      "created_utc": 1613806492.0,
      "score": 9,
      "context": []
    },
    {
      "id": "go4led3",
      "author": "19nov97",
      "body": "The same thing almost happened to me at work. I leaned over my desk after lunch, burped, and my mouth filled up with salad again..... you are amazing though!! Keep on kicking ass!!!! 💛💛",
      "created_utc": 1613835478.0,
      "score": 3,
      "context": []
    },
    {
      "id": "go4nh1j",
      "author": "heheheh79103",
      "body": "Acid reflex is the worst! Same thing happens to me. I have to keep an empty water bottle with me that I spit the bile into. It normally gets full through out the day. Keep being incredible tho! Weeks? Thats absolutley incredible! \\*Applause\\*",
      "created_utc": 1613836587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "go73odn",
      "author": "runefroggy",
      "body": "If it helps I’m literally fighting every morning and night not to vomit from\nBrushing my teeth :/",
      "created_utc": 1613883613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "go4gxl9",
      "author": "kochemi",
      "body": "It sucks so much :( hugs",
      "created_utc": 1613833004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "go9qdzk",
      "author": "Comfortable_Ad6977",
      "body": "Omg I thought I was the only one. Now even if I eat small amount of food I always throw up, not even induced",
      "created_utc": 1613943438.0,
      "score": 1,
      "context": []
    }
  ]
}