{
  "id": "log34z",
  "subreddit": "bulimia",
  "author": "Illustrious-Ad5059",
  "created_utc": 1613853374.0,
  "title": "I fucking hate ultimatums",
  "selftext": "So I finally built up the courage to reach out for help in November. They do residential, day program and outpatient treatment. After intake they recommended I do residential treatment 6 hours away in Seattle. I’m a functioning bulimic, work full-time, go to college full-time AND volunteer every weekend for a homeownership program I’m in. So as you can imagine, my reaction was along the lines of upset, irritated, sad, angry and defeated. At most I was looking for an outpatient therapist/dietitian specialized in ED who could help me through this. When I asked if they would allow me into outpatient, they told me they wouldn’t help me at all if I didn’t go into residential. Is it just me, or is this SO fucked up? I have so many good things happening in my life. If I were to leave for 3 months they would vanish. Not to mention that residential treatment is just not an option for me financially. I support myself, and my insurance is shit. I can afford a few hundred dollars in therapy a month, but absolutely not thousands for residential care I don’t need. So here I am, months later, still suffering from this fucking disease. Am I just in denial? I feel like this has already taken so much away from me. I can’t give up these dreams I’ve been working so hard to achieve.",
  "url": "https://www.reddit.com/r/bulimia/comments/log34z/i_fucking_hate_ultimatums/",
  "score": 69,
  "num_comments": 14,
  "comments": [
    {
      "id": "go5u9ny",
      "author": "eio1",
      "body": "that’s awful, they should definitely be offering other alternatives, is there anywhere else you could try get treatment? even cbt might help",
      "created_utc": 1613858206.0,
      "score": 13,
      "context": []
    },
    {
      "id": "go5yoxt",
      "author": "Zoogymama",
      "body": "First off, I understand how you are feeling. Seeking help, especially when options are limited, can feel very disruptive. I have done outpatient for drug rehab and I remember feeling similarly. I had managed 48 hours of benzo withdrawal cold turkey, and they said that that meant I wouldn’t even be considered for inpatient, which was my ultimate goal. I was completely suicidal at that point and I felt like the treatment center was actively causing me distress.\n\nSecond, I think you may be catastrophizing. Surely, not everything in your life will fall apart if you make some compromises to seek treatment. Ultimately, you are keeping your avenues for personal growth limited until you begin working through your ED. There will be a ceiling and you will continue the cycle. I think seeking explicit help and trying something new is what you will need to start to close this chapter on your life. Just my two cents. I don’t know your situation, but I think you could make it work. I have been a private/volunteer tutor for over five years and I had to put that on hold while I sought treatment.",
      "created_utc": 1613860544.0,
      "score": 11,
      "context": []
    },
    {
      "id": "go6e4fk",
      "author": "Lumplebee",
      "body": "Yep, I’m in the same boat. No place will let me do outpatient,  only residential. How the fuck am I supposed to pay for residential if I can’t work?? It’s so backwards. It’s like it’s setup for us to be sick until we are no longer functioning and can’t work, so we HAVE to do residential.",
      "created_utc": 1613868920.0,
      "score": 4,
      "context": []
    },
    {
      "id": "go67kzm",
      "author": "lacroixlite",
      "body": "You're not in denial. The healthcare field is an industry that profits off your distress. Not to get on a soapbox or anything but the real reason they won't treat you w/o residential is probably monetary.\n\nI'm sorry you have to go through this, king/queen. I really hope you find a solution. You're doing a great thing for yourself.",
      "created_utc": 1613865320.0,
      "score": 9,
      "context": []
    },
    {
      "id": "go6m12k",
      "author": "Alexandria_Eiley",
      "body": "To be honest, this sounds like CFD, and I never had a good experience with them. Some People I know did though! If it’s not, sorry 😅 I will always recommend UCSD ♥️",
      "created_utc": 1613873259.0,
      "score": 4,
      "context": []
    },
    {
      "id": "go6xr03",
      "author": "Aggravating_Bonus205",
      "body": "The whole system is so messed up.  After a whole and very long, emotional day of answering tedious questions (and yes— they knew I was at 105 at 5’5”, purged 6 days everyday for 17 years), my insurance told me I wasn’t a good candidate. I left feeling like I wasn’t worthy of help. Then 2 days later, I was notified I could indeed go. I had already told close family, friends and work it wasn’t happening. I had to turn around and tell them they changed their mind. I was there for 2 weeks and then my insurance decided that since I hadn’t gained weight yet and hadn’t been able to finish a few meals I had to go. My history isn’t like yours but I did feel jerked around and not worthy of help. The whole system sucks. It is so fucking hard to open up and accept a serious problem and seek help. And then getting kicked out. There HAS to be a better system put in place.",
      "created_utc": 1613879993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "go7d91b",
      "author": "Unicorndog_0625",
      "body": "Are they after your insurance money, even though it is shit? Residential is obviously more costly than outpatient. Keep checking around at other places if you can, if they just plain don’t want to help you AT ALL unless you’re fully residential, it doesn’t sound so great, and to me, sounds kinda fishy. There’s gotta be other places you can find.",
      "created_utc": 1613890366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "go5ysob",
      "author": "victoriousbbyg",
      "body": "This is absolutely shit practice on their behalf. It’s not client centred and tbh part of recovery oriented practice is giving people choice. These people sound like they just want your money and don’t give a shit about your health and recovery. Garbage. \nIt really depends where you are at in terms of your ED and your personality as to what therapy might be the most useful. I personally hated CBT but that was to do with my headspace and personality. And I guess it also depends on how or why you developed the ED. This seems to get overlooked a heap - working on change strategies is important but if you ignore the causes of an ED then you’re just applying a bandaid and people end up like me, bulimic and an alcoholic. \n\nIf you look up the centre for clinical interventions in Australia, they have a series of workbooks you can download for free to work through disordered eating, if something like this might help you! Good luck friend, I’m sorry you’re in this shitty situation.",
      "created_utc": 1613860601.0,
      "score": 4,
      "context": []
    },
    {
      "id": "go6br5t",
      "author": "LeeesaBean",
      "body": "\"Outpatient\" for most ed clinics is still at least 8 hours usually. Why I haven't really reached out, I can't justify leaving my family and work and responsibilities basically all day 5 days a week.",
      "created_utc": 1613867611.0,
      "score": 2,
      "context": []
    },
    {
      "id": "go6rvyr",
      "author": "charlielovplum",
      "body": "The system is fucked. Similar experience here. I'm so sorry this has happened to you. My advice...if ur high fuctioning, don't blow $$$ and all ur time on residental care.",
      "created_utc": 1613876589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "go7548l",
      "author": "cetaceansituation",
      "body": "First a disclaimer:\n\nI didn't read the other comments because I'm too enthused to comment myself. I'm sure they covered a lot of the bases I'm about to, but I went through this and I'm chomping at the bit share some thoughts. These are based on my experience and they likely won't be the same for you, but fodder for thought is always helpful, I hope.\n\nI also got told by an IOP team that they wouldn't treat me if I didn't go to res. I also couldn't afford res. In my case, I was no longer functioning well (or, like, at all) at that stage, so they were justified in doing so for a couple of reasons. The most relevant being that they weren't equipped to treat my symptoms, because they really did require 24hr monitoring. Could it be that a full-time setting would be the only real way to help you recover? For me, I was super certain that just IOP would be enough when, in retrospect, it really wouldnt have been.\n\nTurns out, my insurance covered A LOT of my six week stay in res. This would have been totally doable for me, since I live with my parents and had minimal other bills, but I realize this isn't the case for everyone and if I didn't live with my parentd it likely would have been outside my capabilities. \n\nNow, while I was in res I got fired from my job and lost my insurance. This sounds super illegal, but really it came down to my early doctors not filing things appropriately, so my work thought I didn't actually need to be on leave, then when I went silent because I was in a damn residential facility they basically said \"fuck this\" and gave me the boot. I didn't find out all this happened until the day after I got out of res and showed up to IOP only to be told \"oh...your insurance has been declined.\" Fun stuff. \n\nThis brings me to my next point of making sure you have an advocate to navigate your LOA and insurance shenanigans. Most likely, this will be the doctor on your team who will be familiar with the ins and outs of what your treatment requires. I made the mistake of letting the GP who made my referrals to the specialists write my LOA papers. HUGE MISTAKE. I cannot stress this enough: YOUR ED TREATMENT TEAM SHOULD HANDLE THIS. I ended up losing my job, my insurance, and my treatments and have been swimming in the woes of all of that, having fully succumbed to the relapse monster. I now have a non-functioning relationship with my anorexia and spend my days using my eating disorder to ignore the fact that I'm in crippling debt and have no choice but to eventually file for bankruptcy. All of this because I essentially wasn't on top of the damn paperwork. BE SMARTER THAN I WAS. I'm sure you are smarter than me, I just have such strong feelings about how I went into the whole ordeal truly wanting to recover and am now totally f****d beyond repair.\n\nThere is still the cynic in me who wants to say they're just trying to suck money out of patient's eyeballs by telling them they won't treat them if they don't go to IP/res, but mostly I think it's coming from a place of honestly believing it is the best/only proper path for successful treatment.\n\nIf you're working, you likely will have more of res covered than you think under your insurance. As long as you're super on top of things, you won't run into the same train wreck I did. Be completely honest with your team.\n\nEveryone says reaching out for help is the hardest part, but they're wrong. You're at the hardest part now. Don't be discouraged, because you can do this!\n\nEw, sorry about the gross self-serving rant there, but thank you for letting me get that off my chest in a capacity that will hopefully prevent someone else from ending up like me 😅",
      "created_utc": 1613884559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "goiww0h",
      "author": "Illustrious-Ad5059",
      "body": "So I actually just reached out to a CBT therapist last week and we talked today. It went really well. She was so understanding and said she would be willing to help me and I just broke down and cried because I’ve felt so abandoned these past few months. I feel so much better after just one session. I have a really good feeling about it.",
      "created_utc": 1614125042.0,
      "score": 2,
      "context": [
        {
          "id": "go5u9ny",
          "author": "eio1",
          "body": "that’s awful, they should definitely be offering other alternatives, is there anywhere else you could try get treatment? even cbt might help",
          "created_utc": 1613858206.0
        }
      ]
    },
    {
      "id": "go76gz9",
      "author": "cetaceansituation",
      "body": "For west-coasters, I largely agree with this.\n\nI have heard bad things about CFD, but my personal experience with them was primarily positive. Things didn't turn out well for me, but I've never blamed CFD for it. I think a lot of it has to do with who is working there at any given time, combined with the fact that treatment facilities in general have some pretty rapid staff turnover. They let my parents bring my dog to visit me while I was there, which they weren't technically supposed to do, so I have a soft spot for the ladies who worked there during my stay.\n\nUCSD has an amazing reputation. I've reached out to them for various things, but have never heard back (😔).",
      "created_utc": 1613885438.0,
      "score": 1,
      "context": [
        {
          "id": "go6m12k",
          "author": "Alexandria_Eiley",
          "body": "To be honest, this sounds like CFD, and I never had a good experience with them. Some People I know did though! If it’s not, sorry 😅 I will always recommend UCSD ♥️",
          "created_utc": 1613873259.0
        }
      ]
    },
    {
      "id": "gomsxeg",
      "author": "eio1",
      "body": "i’m so glad! cbt can do wonders, i hope things go well <3",
      "created_utc": 1614204215.0,
      "score": 2,
      "context": [
        {
          "id": "go5u9ny",
          "author": "eio1",
          "body": "that’s awful, they should definitely be offering other alternatives, is there anywhere else you could try get treatment? even cbt might help",
          "created_utc": 1613858206.0
        },
        {
          "id": "goiww0h",
          "author": "Illustrious-Ad5059",
          "body": "So I actually just reached out to a CBT therapist last week and we talked today. It went really well. She was so understanding and said she would be willing to help me and I just broke down and cried because I’ve felt so abandoned these past few months. I feel so much better after just one session. I have a really good feeling about it.",
          "created_utc": 1614125042.0
        }
      ]
    }
  ]
}