{
  "id": "lsd1gw",
  "subreddit": "bulimia",
  "author": "conservativepink",
  "created_utc": 1614277112.0,
  "title": "Bulimia, Porn, Instagram... Oh My!",
  "selftext": "I'm so fucking tired, you know?\n\nThe fact I was born female feels like a curse. Lots of really sweet guys are interested in me but I cut them all off and stay lonely and frustrated because the porn, the Instagram. Dear god. And then I go throw up and feel slightly better until I open my phone and the fucking cycle starts again.\n\nWomanhood is just a curse. I hate having boobs, a butt, a body, just everything. Naked women are fucking everywhere and men just can't keep their eyes away. No amount of losing weight, baking them cakes or excusing their shitty behaviour fixes it.\n\nI want plastic surgery desperately bad... But then who knows? Maybe the council of masculinity will decide my body's \"out!\" and I'll need to spend millions of dollars more.\n\nI've been in love and so loyal to the fucking ugliest men but they still CAN'T keep their eyes off of other girls.\n\nPurging is a temporary fix to the never ending pain of a girl's existence.",
  "url": "https://www.reddit.com/r/bulimia/comments/lsd1gw/bulimia_porn_instagram_oh_my/",
  "score": 222,
  "num_comments": 46,
  "comments": [
    {
      "id": "goqor5d",
      "author": "Mamasan-",
      "body": "I feel this",
      "created_utc": 1614280759.0,
      "score": 40,
      "context": []
    },
    {
      "id": "goqprz4",
      "author": "BrMaria",
      "body": "Just know you are not alone <3",
      "created_utc": 1614281155.0,
      "score": 33,
      "context": []
    },
    {
      "id": "goqv8eh",
      "author": "onekoolduck232",
      "body": "I hear you girl",
      "created_utc": 1614283359.0,
      "score": 20,
      "context": []
    },
    {
      "id": "goqv00e",
      "author": "None",
      "body": "I can empathize. It’s a part of why I am terrified of gaining. Right now my body is acceptable. If and when I gain it’ll be a whole different story.",
      "created_utc": 1614283262.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gora5jq",
      "author": "jl9d2",
      "body": "I feel this. My ex always looked at porn and Instagram models despite knowing it made me uncomfortable. He preferred that over sex. And he would lie about it. I still remember when he told me my boobs looked like alien boobs bc they are saggy. I never bared my chest to him again. Before meeting him I still had some of my confidence. Now, 4 years later, I feel so ugly, I avoid cameras and can barely look at my body in the mirror.\n\n I know a lot of IG models use photoshop to edit their bodies too, but I still can’t help but feel I can never meet that standard. I’ve spent thousands on my face doing contour and injections, and I still feel ugly. It’s like I will never be enough. I’m even afraid to date now.   I am afraid if any man looks at my body they will feel disgust. I have the strongest feeling I will die ugly and alone.",
      "created_utc": 1614289470.0,
      "score": 21,
      "context": []
    },
    {
      "id": "goral71",
      "author": "Lumplebee",
      "body": "I feel this so damn hard. I really hate being a woman sometimes. I hate how everything we do is sexualized from when we are literal infants onwards. I hate how every man my age and many women have had their brains rotted by degrading sexist, racist, and homophobic porn. And if you ever bring it up people look at you like you’re insane. It’s so fucking painful. I hate how when I tell people my bf doesn’t watch porn they all chime in “yes he does you just don’t know it” smugly, as if they know my own relationship better than me, and because they can’t imagine a life without porn. It’s depressing.",
      "created_utc": 1614289656.0,
      "score": 16,
      "context": []
    },
    {
      "id": "goru2yi",
      "author": "sad-eggrice",
      "body": "The last four lines hit me like a truck and I think I'm on the verge of a breakdown but I understand you. Lowering standards of dating thinking atleast THEY would not play you around but they do and it's just so frustrating. My current SO is like that. I've caught him so many times watching porn and following those pornstars on social medias I'm not even aware of. Typing it out is making me cry haha I'll stop now.",
      "created_utc": 1614298766.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gorp23l",
      "author": "lacroixlite",
      "body": "EDIT: oh my god this is so long. Please don't take this the wrong way, I honestly just have a lot of feelings about the way porn relates to EDs. Feel free to delete or ignore this if it's unhelpful! Though I do hope it helps!\n\nFirst I want to say that I 100% relate. I just made another comment about my ex's porn obsession and it was agony. So you're so not alone, queenie. I feel you. We all feel you, for real.\n\nThe thing is (and I hope this is helpful for you because you do NOT deserve to suffer or have your self-worth debased),  porn isn't actually the issue. It's the replacement of real intimacy with quick, physical pleasure. Anyone, male or female, who would rather look at porn or who wishes YOU were more like a pornstar, cannot have a healthy relationship with you because they don't want one. \n\nI repeat: The problem is NOT YOU.\n\nThe problem is fear of intimacy and an insecure attachment style. People look to porn because they don't want to risk investing in what is real. They don't want to get hurt, and denying their partner for something that is predictable and cannot hurt them (like porn) gives them the boost that they need to feel better about themselves. Porn will never abandon them, reject them, or find someone new. They can control porn. What they can't control is you.\n\nI don't mean to invalidate your feelings, because they're totally valid. But I get the feeling that you blame yourself for not being attractive to your partners - even the ugly ones, lol. When the truth is, queen, that you could be a model and your partners would still look elsewhere because they have an insecure attachment to real people.\n\nI was at a seminar yesterday about this, and the speaker reiterated the fact that those without healthy attachment are bound to treat us like shit. And it sounds to me like you were treated like shit. I could be totally wrong and if I am, please correct me. But the men who were in your life were not looking for a real relationship. They don't know how to have one.\n\nAgain, your experiences are valid and I know how you feel. This might not help at all, but I at least want to reassure you that *not all men are like this*. I've seen friends find healthy relationships after experiences like this and it *is* possible. But you have to stop hating yourself for not being perfect. Anyone who's asking for perfection is asking for the impossible, and trust me when I say that you don't want that.\n\nI'm sorry if this is too long or if I've overstepped boundaries. I just remember SO vividly how I felt about porn in my relationships AND outside of them, and it hurt really deeply. \n\nI don't want you to hurt, queen. ❤️ You deserve better.",
      "created_utc": 1614296281.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gor8kd4",
      "author": "None",
      "body": "you spoke what most women think on a daily. I feel this to my core, I hate existing as a woman it truly sucks and it’s very hard to have your own identity acknowledged outside of your body. I hope the afterlife we all get to heaven and imagine god is a woman... cause then guys would actually think twice about how they dehumanize and opressed us(still in some places). Disclaimer I don’t hate men before I get attacked so don’t think I’m coming across like that. I appreciate the men who talk to us like PEOPLE and not less than. Yeah, women are people too, wack. I am so hard on myself about my weight too because that’s how society operates unfortunately. Oh to eat what I desire and not feel intense shame for needing to survive afterwords...",
      "created_utc": 1614288800.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gotj9kw",
      "author": "G0TH4NG3LSINN3R-",
      "body": "never related to anything more",
      "created_utc": 1614340558.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gorvcir",
      "author": "None",
      "body": "Firstly I want u to remember you’re never alone I struggle a lot with this, I recommend removing social media and cleansing yourself. As cheesy as it sounds no matter what the standard is if u don’t love yourself no amount of validation will ever make you feel better. You said yourself lots of sweet guys are interested in yourself but u cut them off. Once you begin to work on yourself and what’s going on in ur head u will soon realize that social media and the porn industry only function because ppl like us give them power. Without us they don’t matter. You’re beautiful never forget that",
      "created_utc": 1614299387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gosw0na",
      "author": "None",
      "body": "this. this is exactly how i feel. thank you.",
      "created_utc": 1614319876.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gosxy0h",
      "author": "MagdaXLena85",
      "body": "I feel you. I think my bulimia comes from my rebellion against the standards for women in our society. A very stupid one, because it backfired. \nDating has always been a huge stress factor to me. I was bullied in my early teenage years, called ugly etc. Then all of the sudden guys were interested in me. So I developed an eating disorder, went from bulimia to anorexia and then to bulimia for good. I've never been truly happy in a romantic relationship. I've been always asking myself whether I fit the requirements of the other person. Whether I pretty, skiny, funny enough. It was exhausting (plus I've always had better sex on my own lol), so eventually I came back to my safe spot, where I can eat carbs in a very unladylike manner while watching YouTube. I've never felt so free in any relationship",
      "created_utc": 1614321360.0,
      "score": 2,
      "context": []
    },
    {
      "id": "goyamce",
      "author": "psychicglade",
      "body": "I feel everything about this post but also wanna say lol to \"council of masculinity,\" thank you very much for this amazing phrase that I will most def use.",
      "created_utc": 1614405149.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gyv6291",
      "author": "Unfair-Long1508",
      "body": "Oh gosh I relate to this so much... honestly I just kinda have grown to accept it though. It used to make me feel so inadequate but overall even if the guy I’m seeing looks at other women I try and remember that we are all human and looking does not mean they want to be with them. Additionally- I try and remember my own great traits which are unrelated to how I look. Some people can be pretty but genuinely are not good people. Additionally- other guys also look at me even though I’m in a relationship. It’s all about trust though.",
      "created_utc": 1621542329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gor0drz",
      "author": "cburnard",
      "body": "wait are you saying you're addicted to porn or that dudes have this weird idea of what women are like because they get all their feedback from porn?",
      "created_utc": 1614285469.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gors53t",
      "author": "clementxne",
      "body": "i relate to this so hard it hurts. im so sorry you feel like this, its such a terrible thing to feel",
      "created_utc": 1614297805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "goqmt8o",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1614280016.0,
      "score": -2,
      "context": []
    },
    {
      "id": "gosrv2c",
      "author": "ModandMitton",
      "body": "I guess I feel a little bit different, but I can understand to some extent. Porn doesn't really bother me because they're not people we know. But years ago my first real boyfriend (18M) was talking to someone he referred to as a friend about her sex toys and what she was doing with them. He was very open with the fact he was doing this and being 15 and very naive I had no idea if this was normal or what to do about it. It really triggered my anxiety and upped the anti with my ed because I got it in my head if I was skinnier and prettier and perfect then I'd be good enough and he'd stop. Then when he found out I'd asked my friend for advice about this he dumped me via text message right before my History exam, charming I know. It took years to get over those feelings and I thought I'd almost beaten my ed until I found out my new partner was asking his female friend for \"lewds\". The personal nature of it just made it feel so much worse and I've been stuck going around in the same cycle for years. I don't know if I'll ever be able to have a normal relationship and not feel like there is something wrong with my body the way it is.",
      "created_utc": 1614316919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gp8nwut",
      "author": "goingforward26",
      "body": "I’m so sorry you are going through this :( Porn is everywhere these days, like so much more than those MTV music videos that everyone used to complain about when us ✨90s kids✨ grew up. Instagram, yes, but even more so OnlyFans, Girlfund, private snapchats, patreons...it’s wild. I truly respect sex workers, but it can be intense, especially if you’re struggling with body image and sex or relationships.\n\nFor example (and kind of a rant, but maybe others can relate): OnlyFans especially makes me feel like I should be doing that so I can make extra money and try to get more confidence - not doing it kinda makes me feel like I’m missing the opportunity? - but I know it’s just not for me. Sex work has pros but also cons for sure. The advertising makes it seem so easy which I know isn’t true.\n\nSending love ❤️",
      "created_utc": 1614553703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "goqq0c3",
      "author": "conservativepink",
      "body": "Thank you, beautiful. It feels like my entire life revolves around binging/purging/trying to avoid bulimia-triggering content (not easy!). I feel like a failure in school and to my friends for wanting to give up and just kill myself.",
      "created_utc": 1614281248.0,
      "score": 14,
      "context": [
        {
          "id": "goqprz4",
          "author": "BrMaria",
          "body": "Just know you are not alone <3",
          "created_utc": 1614281155.0
        }
      ]
    },
    {
      "id": "gor16i0",
      "author": "conservativepink",
      "body": "Me too but I almost miss being fat and undesirable because there was no pressure",
      "created_utc": 1614285783.0,
      "score": 10,
      "context": [
        {
          "id": "goqv00e",
          "author": "None",
          "body": "I can empathize. It’s a part of why I am terrified of gaining. Right now my body is acceptable. If and when I gain it’ll be a whole different story.",
          "created_utc": 1614283262.0
        }
      ]
    },
    {
      "id": "gos98qn",
      "author": "None",
      "body": "This is exactly where I am at now.. I have started getting panic attacks when there is junk food anywhere around me, because I know what will happen..",
      "created_utc": 1614306386.0,
      "score": 1,
      "context": [
        {
          "id": "goqv00e",
          "author": "None",
          "body": "I can empathize. It’s a part of why I am terrified of gaining. Right now my body is acceptable. If and when I gain it’ll be a whole different story.",
          "created_utc": 1614283262.0
        }
      ]
    },
    {
      "id": "gou5a73",
      "author": "5foot3",
      "body": "I'm recovered from my eating disorders and I did gain some weight. To the right people, I'm still perfectly acceptable.",
      "created_utc": 1614352944.0,
      "score": 1,
      "context": [
        {
          "id": "goqv00e",
          "author": "None",
          "body": "I can empathize. It’s a part of why I am terrified of gaining. Right now my body is acceptable. If and when I gain it’ll be a whole different story.",
          "created_utc": 1614283262.0
        }
      ]
    },
    {
      "id": "gorbkff",
      "author": "conservativepink",
      "body": "I feel that too but I'm an 18 year old student, I can't afford surgery. Fingers crossed I don't kill myself before I can. And it won't help, but I think you are beautiful.\n\nI want to get a boyfriend and lots of guys tell me I'm beautiful and they're crazy about me but how can I believe it with what they follow on Insta?",
      "created_utc": 1614290070.0,
      "score": 5,
      "context": [
        {
          "id": "gora5jq",
          "author": "jl9d2",
          "body": "I feel this. My ex always looked at porn and Instagram models despite knowing it made me uncomfortable. He preferred that over sex. And he would lie about it. I still remember when he told me my boobs looked like alien boobs bc they are saggy. I never bared my chest to him again. Before meeting him I still had some of my confidence. Now, 4 years later, I feel so ugly, I avoid cameras and can barely look at my body in the mirror.\n\n I know a lot of IG models use photoshop to edit their bodies too, but I still can’t help but feel I can never meet that standard. I’ve spent thousands on my face doing contour and injections, and I still feel ugly. It’s like I will never be enough. I’m even afraid to date now.   I am afraid if any man looks at my body they will feel disgust. I have the strongest feeling I will die ugly and alone.",
          "created_utc": 1614289470.0
        }
      ]
    },
    {
      "id": "gorozv8",
      "author": "lacroixlite",
      "body": "I'm so sorry you had to go through this. I'm sure you are absolutely beautiful and you deserve to be treated well.\n\nThe struggle is painfully real, and it was the primary factor in me developing my ED. My first boyfriend ever was suuuuper into porn. We'd watch it together and he'd ask me if my butt had ever looked like the actors, if my hair had always been the way it was, etc. Comparing me to all these impossibly beautiful, submissive women. \n\nWe'd be in the same room, sitting not 4ft apart and he'd be watching cam girls while half-heartedly talking to me. When I caught him, he started hiding and lying about it, and eventually even intended to cheat on my with some other guy (he was bisexual). \n\nThe sad part wasn't even his addiction to it. It was the fact that he was hiding it from me. Like, you can't trust or have a healthy relationship with someone who lies to you.\n\nHis indiscretions definitely led to me restricting and b/ping full stop. I was so tired of him comparing me, so tired of him watching other girls on the street and expecting our sex to be constantly evolving to be closer to porn... that I finally just went online to find a diet and dove completely into the proana community. It was so hurtful and I felt so trapped.\n\nEventually I realized he was never going to change without therapy (to which he would not go) so I dumped his ass. But it's taken me like 8 years to finally understand that people's interest in porn over reality isn't about me.\n\nSORRY I JUST DUMPED ALL THIS HERE I have a lot of feelings about EDs and porn. 😔",
      "created_utc": 1614296251.0,
      "score": 9,
      "context": [
        {
          "id": "gora5jq",
          "author": "jl9d2",
          "body": "I feel this. My ex always looked at porn and Instagram models despite knowing it made me uncomfortable. He preferred that over sex. And he would lie about it. I still remember when he told me my boobs looked like alien boobs bc they are saggy. I never bared my chest to him again. Before meeting him I still had some of my confidence. Now, 4 years later, I feel so ugly, I avoid cameras and can barely look at my body in the mirror.\n\n I know a lot of IG models use photoshop to edit their bodies too, but I still can’t help but feel I can never meet that standard. I’ve spent thousands on my face doing contour and injections, and I still feel ugly. It’s like I will never be enough. I’m even afraid to date now.   I am afraid if any man looks at my body they will feel disgust. I have the strongest feeling I will die ugly and alone.",
          "created_utc": 1614289470.0
        }
      ]
    },
    {
      "id": "gorb707",
      "author": "conservativepink",
      "body": "As sorry I am that you're in pain your comment really resonated with me and helped. Thank you, and your boyfriend proves there are good men out there",
      "created_utc": 1614289914.0,
      "score": 6,
      "context": [
        {
          "id": "goral71",
          "author": "Lumplebee",
          "body": "I feel this so damn hard. I really hate being a woman sometimes. I hate how everything we do is sexualized from when we are literal infants onwards. I hate how every man my age and many women have had their brains rotted by degrading sexist, racist, and homophobic porn. And if you ever bring it up people look at you like you’re insane. It’s so fucking painful. I hate how when I tell people my bf doesn’t watch porn they all chime in “yes he does you just don’t know it” smugly, as if they know my own relationship better than me, and because they can’t imagine a life without porn. It’s depressing.",
          "created_utc": 1614289656.0
        }
      ]
    },
    {
      "id": "goryg1k",
      "author": "conservativepink",
      "body": "I don't know you so I apologize if I'm overstepping a boundary but you don't deserve to feel like that. And I don't know you but I'm certain that you're beautiful, that your smile lights up a room, that your friends see a spark in you that nobody else can quite match. I know it's hard and I know sometimes when you've thrown up everything you've eaten and the room is spinning and you're just *so* cold, to go back into that boyfriend's arms. Because he makes you hate yourself but at least you can say that he's your boyfriend.\n\nBut is it worth it? Eventually, blankets will be enough to keep you warm. You don't have to sacrifice yourself to save his body heat from leaving. And you'll realise what all your friends that love you see in you. \n\nEvery single person is beautiful and unique. It sounds like at the very least he doesn't appreciate what is unique and beautiful about you. He doesn't sound like the type of man you want a future with.\n\nDms are always open. Stay safe, you're loved more than you'll ever know. :)",
      "created_utc": 1614300912.0,
      "score": 3,
      "context": [
        {
          "id": "goru2yi",
          "author": "sad-eggrice",
          "body": "The last four lines hit me like a truck and I think I'm on the verge of a breakdown but I understand you. Lowering standards of dating thinking atleast THEY would not play you around but they do and it's just so frustrating. My current SO is like that. I've caught him so many times watching porn and following those pornstars on social medias I'm not even aware of. Typing it out is making me cry haha I'll stop now.",
          "created_utc": 1614298766.0
        }
      ]
    },
    {
      "id": "gorxt37",
      "author": "conservativepink",
      "body": "This may or may not have made me cry... Lol. You've made my night ridiculously better. You deserve everything good in the world 💖",
      "created_utc": 1614300604.0,
      "score": 3,
      "context": [
        {
          "id": "gorp23l",
          "author": "lacroixlite",
          "body": "EDIT: oh my god this is so long. Please don't take this the wrong way, I honestly just have a lot of feelings about the way porn relates to EDs. Feel free to delete or ignore this if it's unhelpful! Though I do hope it helps!\n\nFirst I want to say that I 100% relate. I just made another comment about my ex's porn obsession and it was agony. So you're so not alone, queenie. I feel you. We all feel you, for real.\n\nThe thing is (and I hope this is helpful for you because you do NOT deserve to suffer or have your self-worth debased),  porn isn't actually the issue. It's the replacement of real intimacy with quick, physical pleasure. Anyone, male or female, who would rather look at porn or who wishes YOU were more like a pornstar, cannot have a healthy relationship with you because they don't want one. \n\nI repeat: The problem is NOT YOU.\n\nThe problem is fear of intimacy and an insecure attachment style. People look to porn because they don't want to risk investing in what is real. They don't want to get hurt, and denying their partner for something that is predictable and cannot hurt them (like porn) gives them the boost that they need to feel better about themselves. Porn will never abandon them, reject them, or find someone new. They can control porn. What they can't control is you.\n\nI don't mean to invalidate your feelings, because they're totally valid. But I get the feeling that you blame yourself for not being attractive to your partners - even the ugly ones, lol. When the truth is, queen, that you could be a model and your partners would still look elsewhere because they have an insecure attachment to real people.\n\nI was at a seminar yesterday about this, and the speaker reiterated the fact that those without healthy attachment are bound to treat us like shit. And it sounds to me like you were treated like shit. I could be totally wrong and if I am, please correct me. But the men who were in your life were not looking for a real relationship. They don't know how to have one.\n\nAgain, your experiences are valid and I know how you feel. This might not help at all, but I at least want to reassure you that *not all men are like this*. I've seen friends find healthy relationships after experiences like this and it *is* possible. But you have to stop hating yourself for not being perfect. Anyone who's asking for perfection is asking for the impossible, and trust me when I say that you don't want that.\n\nI'm sorry if this is too long or if I've overstepped boundaries. I just remember SO vividly how I felt about porn in my relationships AND outside of them, and it hurt really deeply. \n\nI don't want you to hurt, queen. ❤️ You deserve better.",
          "created_utc": 1614296281.0
        }
      ]
    },
    {
      "id": "gorpjoz",
      "author": "jl9d2",
      "body": "Thank you 🥺",
      "created_utc": 1614296520.0,
      "score": 3,
      "context": [
        {
          "id": "gorp23l",
          "author": "lacroixlite",
          "body": "EDIT: oh my god this is so long. Please don't take this the wrong way, I honestly just have a lot of feelings about the way porn relates to EDs. Feel free to delete or ignore this if it's unhelpful! Though I do hope it helps!\n\nFirst I want to say that I 100% relate. I just made another comment about my ex's porn obsession and it was agony. So you're so not alone, queenie. I feel you. We all feel you, for real.\n\nThe thing is (and I hope this is helpful for you because you do NOT deserve to suffer or have your self-worth debased),  porn isn't actually the issue. It's the replacement of real intimacy with quick, physical pleasure. Anyone, male or female, who would rather look at porn or who wishes YOU were more like a pornstar, cannot have a healthy relationship with you because they don't want one. \n\nI repeat: The problem is NOT YOU.\n\nThe problem is fear of intimacy and an insecure attachment style. People look to porn because they don't want to risk investing in what is real. They don't want to get hurt, and denying their partner for something that is predictable and cannot hurt them (like porn) gives them the boost that they need to feel better about themselves. Porn will never abandon them, reject them, or find someone new. They can control porn. What they can't control is you.\n\nI don't mean to invalidate your feelings, because they're totally valid. But I get the feeling that you blame yourself for not being attractive to your partners - even the ugly ones, lol. When the truth is, queen, that you could be a model and your partners would still look elsewhere because they have an insecure attachment to real people.\n\nI was at a seminar yesterday about this, and the speaker reiterated the fact that those without healthy attachment are bound to treat us like shit. And it sounds to me like you were treated like shit. I could be totally wrong and if I am, please correct me. But the men who were in your life were not looking for a real relationship. They don't know how to have one.\n\nAgain, your experiences are valid and I know how you feel. This might not help at all, but I at least want to reassure you that *not all men are like this*. I've seen friends find healthy relationships after experiences like this and it *is* possible. But you have to stop hating yourself for not being perfect. Anyone who's asking for perfection is asking for the impossible, and trust me when I say that you don't want that.\n\nI'm sorry if this is too long or if I've overstepped boundaries. I just remember SO vividly how I felt about porn in my relationships AND outside of them, and it hurt really deeply. \n\nI don't want you to hurt, queen. ❤️ You deserve better.",
          "created_utc": 1614296281.0
        }
      ]
    },
    {
      "id": "gyvvgya",
      "author": "conservativepink",
      "body": "See I understand your point (I hope you're okay!) but I honestly don't look at other guys and stuff... I get too lovesick lol",
      "created_utc": 1621554349.0,
      "score": 1,
      "context": [
        {
          "id": "gyv6291",
          "author": "Unfair-Long1508",
          "body": "Oh gosh I relate to this so much... honestly I just kinda have grown to accept it though. It used to make me feel so inadequate but overall even if the guy I’m seeing looks at other women I try and remember that we are all human and looking does not mean they want to be with them. Additionally- I try and remember my own great traits which are unrelated to how I look. Some people can be pretty but genuinely are not good people. Additionally- other guys also look at me even though I’m in a relationship. It’s all about trust though.",
          "created_utc": 1621542329.0
        }
      ]
    },
    {
      "id": "gor1zz8",
      "author": "conservativepink",
      "body": "I only ever watch or look at porn to encourage me to purge so... yeah it sucks that that's what I'm supposed to look like",
      "created_utc": 1614286111.0,
      "score": 7,
      "context": [
        {
          "id": "gor0drz",
          "author": "cburnard",
          "body": "wait are you saying you're addicted to porn or that dudes have this weird idea of what women are like because they get all their feedback from porn?",
          "created_utc": 1614285469.0
        }
      ]
    },
    {
      "id": "goqmyzy",
      "author": "conservativepink",
      "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
      "created_utc": 1614280072.0,
      "score": 11,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        }
      ]
    },
    {
      "id": "gor9xmg",
      "author": "BrMaria",
      "body": "Exactly...I feel like food occupies me 24/7...It messes with my academic and social life and it just drives me crazy...I am not a person anymore but thia freaking illness",
      "created_utc": 1614289378.0,
      "score": 5,
      "context": [
        {
          "id": "goqprz4",
          "author": "BrMaria",
          "body": "Just know you are not alone <3",
          "created_utc": 1614281155.0
        },
        {
          "id": "goqq0c3",
          "author": "conservativepink",
          "body": "Thank you, beautiful. It feels like my entire life revolves around binging/purging/trying to avoid bulimia-triggering content (not easy!). I feel like a failure in school and to my friends for wanting to give up and just kill myself.",
          "created_utc": 1614281248.0
        }
      ]
    },
    {
      "id": "gorxim7",
      "author": "conservativepink",
      "body": "God, please don't apologize. My DMs are always open, you beautiful lady. I can't make the pain go away but I can be a friend",
      "created_utc": 1614300461.0,
      "score": 4,
      "context": [
        {
          "id": "gora5jq",
          "author": "jl9d2",
          "body": "I feel this. My ex always looked at porn and Instagram models despite knowing it made me uncomfortable. He preferred that over sex. And he would lie about it. I still remember when he told me my boobs looked like alien boobs bc they are saggy. I never bared my chest to him again. Before meeting him I still had some of my confidence. Now, 4 years later, I feel so ugly, I avoid cameras and can barely look at my body in the mirror.\n\n I know a lot of IG models use photoshop to edit their bodies too, but I still can’t help but feel I can never meet that standard. I’ve spent thousands on my face doing contour and injections, and I still feel ugly. It’s like I will never be enough. I’m even afraid to date now.   I am afraid if any man looks at my body they will feel disgust. I have the strongest feeling I will die ugly and alone.",
          "created_utc": 1614289470.0
        },
        {
          "id": "gorozv8",
          "author": "lacroixlite",
          "body": "I'm so sorry you had to go through this. I'm sure you are absolutely beautiful and you deserve to be treated well.\n\nThe struggle is painfully real, and it was the primary factor in me developing my ED. My first boyfriend ever was suuuuper into porn. We'd watch it together and he'd ask me if my butt had ever looked like the actors, if my hair had always been the way it was, etc. Comparing me to all these impossibly beautiful, submissive women. \n\nWe'd be in the same room, sitting not 4ft apart and he'd be watching cam girls while half-heartedly talking to me. When I caught him, he started hiding and lying about it, and eventually even intended to cheat on my with some other guy (he was bisexual). \n\nThe sad part wasn't even his addiction to it. It was the fact that he was hiding it from me. Like, you can't trust or have a healthy relationship with someone who lies to you.\n\nHis indiscretions definitely led to me restricting and b/ping full stop. I was so tired of him comparing me, so tired of him watching other girls on the street and expecting our sex to be constantly evolving to be closer to porn... that I finally just went online to find a diet and dove completely into the proana community. It was so hurtful and I felt so trapped.\n\nEventually I realized he was never going to change without therapy (to which he would not go) so I dumped his ass. But it's taken me like 8 years to finally understand that people's interest in porn over reality isn't about me.\n\nSORRY I JUST DUMPED ALL THIS HERE I have a lot of feelings about EDs and porn. 😔",
          "created_utc": 1614296251.0
        }
      ]
    },
    {
      "id": "gordy20",
      "author": "cburnard",
      "body": "aw, dude you don't \"have\" to look like anyone but yourself. i know these are just words on a screen coming from a stranger who also has their own inflexible body hang ups, but you shouldn't be so hard on yourself. girls in porn esp aren't what women look like.",
      "created_utc": 1614291114.0,
      "score": 2,
      "context": [
        {
          "id": "gor0drz",
          "author": "cburnard",
          "body": "wait are you saying you're addicted to porn or that dudes have this weird idea of what women are like because they get all their feedback from porn?",
          "created_utc": 1614285469.0
        },
        {
          "id": "gor1zz8",
          "author": "conservativepink",
          "body": "I only ever watch or look at porn to encourage me to purge so... yeah it sucks that that's what I'm supposed to look like",
          "created_utc": 1614286111.0
        }
      ]
    },
    {
      "id": "goqn32y",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1614280112.0,
      "score": -7,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        }
      ]
    },
    {
      "id": "gos1o6d",
      "author": "lacroixlite",
      "body": "Omg thank you sm 🥺 You're already being a friend.",
      "created_utc": 1614302526.0,
      "score": 3,
      "context": [
        {
          "id": "gora5jq",
          "author": "jl9d2",
          "body": "I feel this. My ex always looked at porn and Instagram models despite knowing it made me uncomfortable. He preferred that over sex. And he would lie about it. I still remember when he told me my boobs looked like alien boobs bc they are saggy. I never bared my chest to him again. Before meeting him I still had some of my confidence. Now, 4 years later, I feel so ugly, I avoid cameras and can barely look at my body in the mirror.\n\n I know a lot of IG models use photoshop to edit their bodies too, but I still can’t help but feel I can never meet that standard. I’ve spent thousands on my face doing contour and injections, and I still feel ugly. It’s like I will never be enough. I’m even afraid to date now.   I am afraid if any man looks at my body they will feel disgust. I have the strongest feeling I will die ugly and alone.",
          "created_utc": 1614289470.0
        },
        {
          "id": "gorozv8",
          "author": "lacroixlite",
          "body": "I'm so sorry you had to go through this. I'm sure you are absolutely beautiful and you deserve to be treated well.\n\nThe struggle is painfully real, and it was the primary factor in me developing my ED. My first boyfriend ever was suuuuper into porn. We'd watch it together and he'd ask me if my butt had ever looked like the actors, if my hair had always been the way it was, etc. Comparing me to all these impossibly beautiful, submissive women. \n\nWe'd be in the same room, sitting not 4ft apart and he'd be watching cam girls while half-heartedly talking to me. When I caught him, he started hiding and lying about it, and eventually even intended to cheat on my with some other guy (he was bisexual). \n\nThe sad part wasn't even his addiction to it. It was the fact that he was hiding it from me. Like, you can't trust or have a healthy relationship with someone who lies to you.\n\nHis indiscretions definitely led to me restricting and b/ping full stop. I was so tired of him comparing me, so tired of him watching other girls on the street and expecting our sex to be constantly evolving to be closer to porn... that I finally just went online to find a diet and dove completely into the proana community. It was so hurtful and I felt so trapped.\n\nEventually I realized he was never going to change without therapy (to which he would not go) so I dumped his ass. But it's taken me like 8 years to finally understand that people's interest in porn over reality isn't about me.\n\nSORRY I JUST DUMPED ALL THIS HERE I have a lot of feelings about EDs and porn. 😔",
          "created_utc": 1614296251.0
        },
        {
          "id": "gorxim7",
          "author": "conservativepink",
          "body": "God, please don't apologize. My DMs are always open, you beautiful lady. I can't make the pain go away but I can be a friend",
          "created_utc": 1614300461.0
        }
      ]
    },
    {
      "id": "goqohrw",
      "author": "StarLothario",
      "body": "Wow you did it. You singlehandedly cured mental illness for everyone. It was just that easy\n\nDumb fuck",
      "created_utc": 1614280655.0,
      "score": 16,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        }
      ]
    },
    {
      "id": "goqpc58",
      "author": "creeepykitten",
      "body": "Look at the the pot calling the kettle black. Maybe you should spend your time doing something more productive than harassing people who want support with their mental illnesses.",
      "created_utc": 1614280981.0,
      "score": 8,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        }
      ]
    },
    {
      "id": "goqnl8m",
      "author": "conservativepink",
      "body": "Ohhhh, I see. You think bulimia is \"fatphobic\" or some bullshit or something. I can tell what type of person you are. How about you become a normal functioning person and stop complaining about \"fatphobia\"",
      "created_utc": 1614280295.0,
      "score": 6,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        }
      ]
    },
    {
      "id": "goqshrs",
      "author": "CarlWheezerisbae96",
      "body": "I pmed him and he deleted his accout lmao.",
      "created_utc": 1614282253.0,
      "score": 6,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        },
        {
          "id": "goqpc58",
          "author": "creeepykitten",
          "body": "Look at the the pot calling the kettle black. Maybe you should spend your time doing something more productive than harassing people who want support with their mental illnesses.",
          "created_utc": 1614280981.0
        }
      ]
    },
    {
      "id": "goqo0cn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1614280465.0,
      "score": -3,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        },
        {
          "id": "goqnl8m",
          "author": "conservativepink",
          "body": "Ohhhh, I see. You think bulimia is \"fatphobic\" or some bullshit or something. I can tell what type of person you are. How about you become a normal functioning person and stop complaining about \"fatphobia\"",
          "created_utc": 1614280295.0
        }
      ]
    },
    {
      "id": "goqo7y7",
      "author": "conservativepink",
      "body": "Tell that to my doctor! And I do go outside, to my classes and my job! Get off the fucking sub, it should be fairly obvious on here from your downvotes that none of these nice people fucking like you",
      "created_utc": 1614280549.0,
      "score": 12,
      "context": [
        {
          "id": "goqmt8o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280016.0
        },
        {
          "id": "goqmyzy",
          "author": "conservativepink",
          "body": "Why the fuck are you in r/bulimia then? You're gonna see posts about bulimia",
          "created_utc": 1614280072.0
        },
        {
          "id": "goqn32y",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280112.0
        },
        {
          "id": "goqnl8m",
          "author": "conservativepink",
          "body": "Ohhhh, I see. You think bulimia is \"fatphobic\" or some bullshit or something. I can tell what type of person you are. How about you become a normal functioning person and stop complaining about \"fatphobia\"",
          "created_utc": 1614280295.0
        },
        {
          "id": "goqo0cn",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1614280465.0
        }
      ]
    }
  ]
}