{
  "id": "ltpb17",
  "subreddit": "bulimia",
  "author": "221Bamf",
  "created_utc": 1614436338.0,
  "title": "I’m going to try to not B/P for 7 days",
  "selftext": "I just want to try and get out of this rut I’ve got into in the past few months, where I keep doing it even though I know it makes me feel worse and doing it just makes the cravings worse. \n\n\nRealistically I know I’m not in a place where I’m ready for full recovery, and I know I’ll still be restricting... but I don’t want to do this anymore, I’m so tired. I’m sick of being bloated and tired and broken out and having heartburn and burps that taste like a corpse in a dumpster...",
  "url": "https://www.reddit.com/r/bulimia/comments/ltpb17/im_going_to_try_to_not_bp_for_7_days/",
  "score": 82,
  "num_comments": 14,
  "comments": [
    {
      "id": "gp0lhig",
      "author": "AnaDion94",
      "body": "Good luck! I know it’s hard, but it does get easier as you go on (I’m on day 29!). Thinking of you and sending you all the support I can!",
      "created_utc": 1614438335.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gp0srnh",
      "author": "_Britt_marie_",
      "body": "I'm trying to do the same :D Best of luck to you, stay strong and I hope you have a great weekend! <3",
      "created_utc": 1614440454.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gp0zx8h",
      "author": "notthezodiackiller71",
      "body": "I truly wish you all the best and I believe in you!! \n\nAnd if you do mess up, don't beat yourself up and keep going. I know for me if I slip up one single day, it's always a reason to just give up cause I already messed up my streak (from whatever many days) but than I read on here, that it isn't about a clean streak but rather about for example 6 good days out of 7. So keep that in mind and update us, we're rooting for you!!",
      "created_utc": 1614441919.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gp1jyej",
      "author": "None",
      "body": "Best of luck! Every day purge free is an achievement (:",
      "created_utc": 1614447422.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gp1mmr4",
      "author": "MagdaXLena85",
      "body": "My 11th day b/p free. You can do it!",
      "created_utc": 1614448388.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gp35enk",
      "author": "eaklv",
      "body": "It does make the cravings soo much worse. I keep getting 5 days in and then end up giving in and I get horrible urges for the following 48 hours. I managed a month and a half a few months ago and the bloating went down so much, I wish I could get back to that place again.",
      "created_utc": 1614463554.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gp2q22s",
      "author": "None",
      "body": "Me too, I have been b/p for the past few months, I am so bloated and I feel so gross, I always feel sick, gassy, etc. I’m going to try to eat normally for a week and see how that will go. Good luck, I hope it goes well for you. 💖",
      "created_utc": 1614458473.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gp3rfvf",
      "author": "haleighhuman",
      "body": "The hardest part of kicking an addiction like this is acknowledging it and wanting to move forward! You’re so strong for doing so, and I believe in you!! This sub has your back; we believe in you, and I believe in you! Lmk if you ever need to vent or anything. I’m sending you the best vibes. I really hope you’re able to be B/P free soon. ❤️❤️",
      "created_utc": 1614473753.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gp5tmi6",
      "author": "Blueberry_mooo",
      "body": "You can do this!!! I wish all the best :) don’t give I believe in you! You amazing! Beautiful! Gorgeous person! And don’t you dear say other wises :)",
      "created_utc": 1614510884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gp7vlxu",
      "author": "None",
      "body": "I really advise to come here and vent whenever you feel like relapsing. Even if no one answers the post, I feel like just expressing the frustration helps. The first few days are very difficult, but then it gets easier. Find a new routine around your usual binge times and stick to it, that helps ☺️",
      "created_utc": 1614543170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gp1kf0w",
      "author": "None",
      "body": "Day 29 is incredible! This gives me hope!",
      "created_utc": 1614447601.0,
      "score": 12,
      "context": [
        {
          "id": "gp0lhig",
          "author": "AnaDion94",
          "body": "Good luck! I know it’s hard, but it does get easier as you go on (I’m on day 29!). Thinking of you and sending you all the support I can!",
          "created_utc": 1614438335.0
        }
      ]
    },
    {
      "id": "gp0yblv",
      "author": "notthezodiackiller71",
      "body": "Wow 29 days is amazing!! Congrats, I'm genuinely so proud of you hun♡",
      "created_utc": 1614441593.0,
      "score": 10,
      "context": [
        {
          "id": "gp0lhig",
          "author": "AnaDion94",
          "body": "Good luck! I know it’s hard, but it does get easier as you go on (I’m on day 29!). Thinking of you and sending you all the support I can!",
          "created_utc": 1614438335.0
        }
      ]
    },
    {
      "id": "gp7vdme",
      "author": "None",
      "body": "The hardest ones are legit the first 7 days 😅 I did 42 days recently (the longer ever for me!) but relapsed and from tomorrow I'm gonna try 45 days. \n\nWe got this together 👐",
      "created_utc": 1614543099.0,
      "score": 2,
      "context": [
        {
          "id": "gp0lhig",
          "author": "AnaDion94",
          "body": "Good luck! I know it’s hard, but it does get easier as you go on (I’m on day 29!). Thinking of you and sending you all the support I can!",
          "created_utc": 1614438335.0
        }
      ]
    }
  ]
}