{
  "id": "lux96e",
  "subreddit": "bulimia",
  "author": "___Dragon",
  "created_utc": 1614564743.0,
  "title": "I just ate a 3 course meal and drank 2 beers. I can’t stop thinking about how when I get home I’m going to purge. I haven’t purged in a year but I can’t seem to stop myself from this thought.",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/lux96e/i_just_ate_a_3_course_meal_and_drank_2_beers_i/",
  "score": 68,
  "num_comments": 15,
  "comments": [
    {
      "id": "gp9ap2s",
      "author": "mmvvvz",
      "body": "Hey friend. You’re allowed to eat a three course meal and have a few beers. Drink lots of water and have a nice poo in the morning. Maybe go for a walk or have a nice workout tomorrow too? You can deal with however many calories you ate tonight but I’m afraid if you purge it could throw you back into the infamous cycle. You have all of our support, we are sending you good vibes and wishing you wellness. Please be gentle to yourself and know you didn’t do anything wrong.",
      "created_utc": 1614566050.0,
      "score": 58,
      "context": []
    },
    {
      "id": "gp9c21o",
      "author": "Kythan1",
      "body": "Listen to music, read, start a Netflix series, try to distract if you can. Make the next few days “extra” healthy and allow yourself some indulgence. Life is too short not to allow yourself some “extra” from time to time.",
      "created_utc": 1614566816.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gp9klng",
      "author": "sweetbird26",
      "body": "Congratulations on making a year!! ❤️ \n\nWe are all rooting for you to keep up the amazing streak you have going. Like a comment earlier said- you are allowed to eat and drink beer. If you slip don’t be hard on yourself. This disease thrives when we focus on our imperfections. You can make it through this and keep going! Keep up your amazing progress.",
      "created_utc": 1614571880.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gp9t7e8",
      "author": "psychicglade",
      "body": "I'm like 6 months into recovery and it's so crazy how my thinking about the \"inevitable purge\" has changed. You know how when you used to binge or think you ate too much or feel any shame and it just clicks that you will purge, that's it, no stopping the purge train? \n\nNow, I have those same guilty associations about eating plenty of times, but the follow-up feelings are maybe 25% resisting the urge to purge and 75% really intense fear that I might slip back into that autopilot. Does this make sense at all? I literally have nightmares about purging now, and wake up incredibly relieved that it was a dream. \n\nYour feelings right now may be similar--yes, digesting a big meal can be emotionally taxing, but you might also be processing some fear about ending up back where you used to be, because a life without bulimia is so much better.",
      "created_utc": 1614577809.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gp9eno4",
      "author": "None",
      "body": "If nothing else, just try to meditate and focus on breathing in and out as you go home. \n\nForgive yourself for eating so much. It happens, its okay. \n\nDistract yourself once home, or start bedtime rituals.",
      "created_utc": 1614568307.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gp9krjq",
      "author": "bebe_inferno",
      "body": "You rock for making it a year. When you get home, take a shower. Anything that happened before the shower is over and done with. You didn’t do anything wrong and you’re going to be okay 🤍💗",
      "created_utc": 1614571984.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gp9m1bt",
      "author": "Stevonnie4ever",
      "body": "It seems like whatever feeling triggers you to purge (whether that be physical like the feeling of fullness, or mental such as the feeling of anxiety) was definitely activated during/after this meal, and thus it is perfectly normal to have urges. Remember that a thought or feeling compelling us to do something is just that, a thought or feeling. I know when triggered to purge I feel so awful and overwhelmed I just want the feeling out of my body, but the thing with anxiety is that if you are able to sit with it it will eventually go down. You will not feel this way forever and if you are able to sit with the feeling this time around imagine what you can manage to sit with in the future. I'm sorry you are struggling at the moment, I do think that the fact that you posted on here and didn't just engage in the behavior is commendable. I hope you have a good rest of your night, perhaps engaging in a relaxing activity or possibly something to distract? Or if you have a trustworthy person in your support system who you can talk to or spend time with?",
      "created_utc": 1614572796.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gpav2jt",
      "author": "AppropriateGiraffe28",
      "body": "Don’t do it. You will not gain weight from eating a lot in one sitting. Don’t do it. You will gain more water weight BY purging. You have got this!",
      "created_utc": 1614608820.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gpb5uzt",
      "author": "5foot3",
      "body": "I purged after I’d been clean for a year, too. It was awful and reminded me why I went into treatment.  I had a strong new clarity on why I didn’t want to go back to disordered behavior even if it did mean losing weight. Fortunately it was a one and done relapse for me. Stay strong.",
      "created_utc": 1614614146.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gpcvgvv",
      "author": "___Dragon",
      "body": "Thank you all so much for your kind words and advice! I appreciate it so much and it helped me a lot. I didn’t purge and decided to partake in self care instead. I appreciate you all 💛",
      "created_utc": 1614642258.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gp9iz7v",
      "author": "rebkh",
      "body": "It took you a full year to get where you are, is it really worth it to throw an entire year away for one purge?",
      "created_utc": 1614570880.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gp9dy4d",
      "author": "baronessblockage",
      "body": "What exactly is it that you ate that is triggering you to purge?",
      "created_utc": 1614567895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpbced8",
      "author": "MrsPicklez",
      "body": "I just wanna point out that sometimes we fail, and that’s perfectly okay. This is our automatic response and can be difficult to beat, there’s nothing wrong with that. Id say to you, friend, what did you learn from this? You managed to go a whole year, that’s awesome. Now youre struggling, and why is that? Break it down piece by piece, find the triggers, make new or smaller challenges you can survive. You are perfect the way you are and can only grow stronger. If you made it through this difficult time, you can learn something. If you purged, that’s fine too, you can also learn from that. I wish you the best 💖",
      "created_utc": 1614617145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpcsyu8",
      "author": "mij3i",
      "body": "Any updates? How did the evening go?",
      "created_utc": 1614640960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gp9f21p",
      "author": "jl9d2",
      "body": "This 💜",
      "created_utc": 1614568542.0,
      "score": 10,
      "context": [
        {
          "id": "gp9ap2s",
          "author": "mmvvvz",
          "body": "Hey friend. You’re allowed to eat a three course meal and have a few beers. Drink lots of water and have a nice poo in the morning. Maybe go for a walk or have a nice workout tomorrow too? You can deal with however many calories you ate tonight but I’m afraid if you purge it could throw you back into the infamous cycle. You have all of our support, we are sending you good vibes and wishing you wellness. Please be gentle to yourself and know you didn’t do anything wrong.",
          "created_utc": 1614566050.0
        }
      ]
    }
  ]
}