{
  "id": "lvc64z",
  "subreddit": "bulimia",
  "author": "novaskisthedeparted",
  "created_utc": 1614612961.0,
  "title": "my mom is my biggest trigger",
  "selftext": "my mom has never officially been diagnosed, but it’s obvious that she’s suffering with bulimia. she purges by over exercising and has damaged her joints to the point that she now requires physical therapy in her 40s and has extremely low bone density. the joint damage has made her extreme exercise more difficult for her, but she hasn’t stopped the bingeing so as a result she has gained quite a bit of weight over the past year or so.\n\nshe is constantly comparing my body to hers. we work in the same building and she will periodically come to my desk to measure my legs/ stomach/ arms/ hips and then compare it to her own. this morning she asked me to covertly go up to her office so I could look at one of her coworkers and tell her whether she was bigger or smaller than the coworker. \n\ni have been in recovery for a few years, and she knows this. we used to feed off of each other’s illness but when I moved out of her house with my husband I started working on fixing that mentality and getting healthier. she, however has just been escalating. every morning before work she calls me to ask me if I weighed myself that morning and what the number was.\n\nit is a constant uphill battle for me to stay in recovery because she is always trying to drag me back down into my illness with her. codependence doesn’t even begin to describe it. i did gain a lot of weight while recovering and am now trying to lose a few pounds in a healthy way without slipping back into the disorder but it’s nearly impossible with her around. i can’t just tell her to bug off because is my mom, and she is so so sick. but at the same time, the constant conscious effort I have to exert to stay in recovery is unbearable and feels very shaky at times.\n\nidk, I guess this is more just a vent than anything. this disease can really be so isolating.",
  "url": "https://www.reddit.com/r/bulimia/comments/lvc64z/my_mom_is_my_biggest_trigger/",
  "score": 106,
  "num_comments": 7,
  "comments": [
    {
      "id": "gpbh6i5",
      "author": "SophieKins",
      "body": "Please please please let her know that her behavior is hurting your mental health. You’ve got to protect yourself x",
      "created_utc": 1614619257.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gpbxvg2",
      "author": "JetPatriot",
      "body": "Just say no.  Consistently and every time- you have to train her.  No I did not weigh myself.   No I will not look at a co worker.  No measuring- you know what my measurements are. You might also think of getting another job somewhere.  Stay strong.",
      "created_utc": 1614626584.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gpbe5gd",
      "author": "Glittering-Cod5256",
      "body": "I’m so sorry you are so strong for going into recovery despite your mom you know some people are not good for us even if they are family even if you love them and you really have to protect your recovery above all maybe you can let her know that she’s hurting your mental health and that you need some space hope it helps",
      "created_utc": 1614617923.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gpd4p1r",
      "author": "nursenightmare",
      "body": "I’m sorry you are going through this. It’s not fair that you’ve been through so much because of your mom’s illnesses. Thank you for being open and honest, you are helping others by doing so and reminding us and yourself that you are not alone.",
      "created_utc": 1614647172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpe3kvm",
      "author": "S2yydrj",
      "body": "This!! My mom triggers me in so many ways and is ALWAYS making hurtful comments, but she's my mom and I want her in my life. I feel you so bad on this, don't know why its so hard for people to be considerate",
      "created_utc": 1614668207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpc65kq",
      "author": "LittleMissCosmic1992",
      "body": "I agree with this 100%",
      "created_utc": 1614630247.0,
      "score": 4,
      "context": [
        {
          "id": "gpbxvg2",
          "author": "JetPatriot",
          "body": "Just say no.  Consistently and every time- you have to train her.  No I did not weigh myself.   No I will not look at a co worker.  No measuring- you know what my measurements are. You might also think of getting another job somewhere.  Stay strong.",
          "created_utc": 1614626584.0
        }
      ]
    },
    {
      "id": "gpdcdc0",
      "author": "JetPatriot",
      "body": "Thank you- it might help OP's sanity",
      "created_utc": 1614651233.0,
      "score": 3,
      "context": [
        {
          "id": "gpbxvg2",
          "author": "JetPatriot",
          "body": "Just say no.  Consistently and every time- you have to train her.  No I did not weigh myself.   No I will not look at a co worker.  No measuring- you know what my measurements are. You might also think of getting another job somewhere.  Stay strong.",
          "created_utc": 1614626584.0
        },
        {
          "id": "gpc65kq",
          "author": "LittleMissCosmic1992",
          "body": "I agree with this 100%",
          "created_utc": 1614630247.0
        }
      ]
    }
  ]
}