{
  "id": "lwai8c",
  "subreddit": "bulimia",
  "author": "kianagunning",
  "created_utc": 1614713682.0,
  "title": "does anyone else get crippling anxiety over their teeth?",
  "selftext": "I know probably lots of people do this I’m just really panicky and alone rn.  \n\nI can’t stop obsessing over my teeth. Every morning I get up and poke around my mouth in front of the mirror for ages. I keep getting convinced that my teeth are shrinking and dying even though looking at past pictures they don’t look that different. Every time I get tooth pain from jaw clenching (thanks zoloft...) I panic that it’s actually pain from a cavity that’s going to make my teeth fall out. I’m constantly googling photos of healthy teeth to try and work out if mine are okay, it feels like they’re much thinner than they’re supposed to be.  \n\nI’m in recovery and have had only maybe 7-8 days of bad b/ping in the past 6 months. And even when I was really bad I was mostly only purging dinner every day, and I’d try to wash my mouth out after when I could with baking soda and water. The last time I saw a dentist was a year ago back when I was full blown relapsed and they said my teeth were fine, but I still can’t get out of my own head.  \n\nI don’t know what to do, checking my teeth takes up so much time and energy every day but I don’t know how to stop it. My teeth used to be the only thing I liked about my appearance and now I’m constantly hiding them.",
  "url": "https://www.reddit.com/r/bulimia/comments/lwai8c/does_anyone_else_get_crippling_anxiety_over_their/",
  "score": 131,
  "num_comments": 8,
  "comments": [
    {
      "id": "gpglljv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1614720069.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gpgntef",
      "author": "Cath1212",
      "body": "I think, first of all, try and make an appointment with your dentist. If it’s been a year since your last appointment, it would be good to have a check up, bulimic or not. It will reassure you and, as the other commenter said, the fact that you have had 7-8 bad days these last 6 months is amazing.\n\nNow I totally get how you feel, obsessing over your teeth and all. I was the same. The way I got over it was by deciding to put all this energy and investment into healthy teeth. I did my research, got appropriate products and now, even though I do have my ups and downs bulimia-wise, my teeth are relatively healthy.",
      "created_utc": 1614721038.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gpgzyw2",
      "author": "justtryingSadGal",
      "body": "hi, i have suffered from b/p for about 8 years now and finally this year i have realized that my mouth and teeth feel different, definitely from decay and stomach acid:( i had to stop smoking weed actually because every time i do i panic and constantly think about my poor mouth and everything that could go wrong. \n\nWhat i’m doing is trying my best to end purging and my teeth have become a very incentive to not get sick anymore. (easier said than done ik) but now i consistently use toothpaste that helps with enamel and gum repair and brush 2x a day and i really think it’s all i can do in my situation without going to a dentist because i’m too scared. \ni hope this kind of helps and i hope you know you aren’t alone here :)",
      "created_utc": 1614726703.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gph269e",
      "author": "AnaDion94",
      "body": "Go to the dentist if you can, it will alleviate a lot of stress. I went last Thursday after b/p several times a day for most of 2020. I was convinced that my teeth had been eroded to nubs, were completely transparent, and every small amount of sensitivity was surely the sign of some damage I’d done.\nBut yeah, saw the dentist, told her about my ED history, and left with a clean bill of health and strict instructions to floss. Everyone in the office also said I had great teeth which helped alleviate a lot of paranoia that everyone who saw me was heckling over my see-through teeth.",
      "created_utc": 1614727816.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gpgw0xx",
      "author": "margd4",
      "body": "Hey! This sounds like it could be a body dysmorphic disorder kind of thing, or another manifestation of anxiety (and quitting a destructive coping mechanism leads to high anxiety in the short term, of course). I struggled with both bulimia and serious but unrelated BDD about my skin/acne. Idk, I'd look into the symptoms of BDD and see if that fits how you feel about your teeth. Even if there were something wrong with your teeth, it seems like the anxiety/checking is disproportionate to whatever the problem is, which is the essence of BDD.\n\nDental stuff is hugely related to genetics also. Given the duration/extent of my bulimia my teeth should be garbage but they're okay?  Though it was in recovery that I first started feeling real panic/grief about how I treated my body, and like how could it still be working after all I'd done to it? I think those feelings are part of the recovery process, sort of coming back into this body that's been through a lot and really being present in it again.",
      "created_utc": 1614724793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gphxg2r",
      "author": "Hularula",
      "body": "Yes, definitely at the height of my bulimia I was terrified of going to the dentist. Years later I mustered up the courage to go to the dentist and it wasn't nearly as bad as I anticipated. I had to get a few fillings and this month am having a gum surgery, but my teeth aren't ruined. It's unlikely that your teeth are ruined either. I can assure you that the anxiety surrounding your oral health is probably worse than your actual oral. That being said, intervention for any dental health issues you have will serve you better the sooner you can get it.\n\nHang in there! You're not alone and it sounds like you're already on your journey to recovery.  <3",
      "created_utc": 1614743986.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gph7wfn",
      "author": "Renmeya",
      "body": "lol yep.fuck bulimia mess up my heart just not my teeth. Ofc both gonna get fucked",
      "created_utc": 1614730750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpgq7kp",
      "author": "kianagunning",
      "body": "Thank you! I’m booking an appt for the easter holidays and I’m doing CBT right now so I’ll try bringing it up in therapy ❤️",
      "created_utc": 1614722081.0,
      "score": 11,
      "context": [
        {
          "id": "gpglljv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1614720069.0
        }
      ]
    },
    {
      "id": "gpgqc2i",
      "author": "kianagunning",
      "body": "Thank you! I’m gonna book an appt for easter if I can ❤️",
      "created_utc": 1614722136.0,
      "score": 3,
      "context": [
        {
          "id": "gpgntef",
          "author": "Cath1212",
          "body": "I think, first of all, try and make an appointment with your dentist. If it’s been a year since your last appointment, it would be good to have a check up, bulimic or not. It will reassure you and, as the other commenter said, the fact that you have had 7-8 bad days these last 6 months is amazing.\n\nNow I totally get how you feel, obsessing over your teeth and all. I was the same. The way I got over it was by deciding to put all this energy and investment into healthy teeth. I did my research, got appropriate products and now, even though I do have my ups and downs bulimia-wise, my teeth are relatively healthy.",
          "created_utc": 1614721038.0
        }
      ]
    }
  ]
}