{
  "id": "m2278u",
  "subreddit": "bulimia",
  "author": "iShouldHaveBeenAbort",
  "created_utc": 1615395510.0,
  "title": "Has any bulimic/binge eating ever actually benefited from eating disorder treatment?",
  "selftext": "We still live in a world where anorexia is kind of the “golden standard” of the eating disorders in terms of MANY things and it’s a prevalent issue that I’ve noticed in eating disorder treatment centers as well. It always feels like it’s automatically assumed restriction is always the main root of our other behaviors like binging... when that is not always the case. I wish there were more treatment centers that specialized in binge eating and bulimia and had actual separate tracks for that instead of combining everyone together because personally I find it quite difficult to relate with the community at times and it sends me back into restriction behaviors that usually aren’t a main issue for me when I’m not in treatment. Treatment centers always say they have “individualized treatment” yet treat every case as a restriction-rooted disorder as if anorexia is the only disorder.. and this is a problem. I know all eating disorders can relate to each other in many ways but they are also quite different and should be treated in their respective ways that would be most effective and beneficial for the individual. If I go into treatment for thousands of dollars, I want to be in an environment that is actually healing, attuned to my needs and emotions, around a community I can relate to and be treated in modalities I can benefit from. Because damn it “food is medicine” for you but could literally KILL me through rupturing my stomach RIGHT NOW.",
  "url": "https://www.reddit.com/r/bulimia/comments/m2278u/has_any_bulimicbinge_eating_ever_actually/",
  "score": 113,
  "num_comments": 29,
  "comments": [
    {
      "id": "gqh009t",
      "author": "maybe-sabrinax",
      "body": "Yeah the main advice i got from therapists and dietitians was „you need to stop restricting”. I haven’t been restricting tho so 🥱",
      "created_utc": 1615398852.0,
      "score": 43,
      "context": []
    },
    {
      "id": "gqhkl32",
      "author": "None",
      "body": "I benefited a lot from forcing my way into group therapy narratives. I didn’t shy away from calling it binging and purging and would admit to my binges and discuss how my purging made me feel. People were very comfortable discussing restriction and I noticed the BED and Bulimia patients would say vague stuff like “engaging in behaviors” and I was like... nah eff that.\n\nI think your experience is going to depend very much on your cohort and your desire to take up space. It also helped that I worked with a therapist who was a recovered bulimic and VERY open about her experience.",
      "created_utc": 1615407170.0,
      "score": 43,
      "context": []
    },
    {
      "id": "gqhbtz4",
      "author": "requiemforpotential",
      "body": "restriction feels more like a thin strip of tape holding back the floodgates of my appetite that is never satisfied , like i ate and ate and ate before i began restricting my binges arent a consequence of restrictions my restriction is a preventative measure to alleviate my inevitable binges and try to manage how much i put in my body. the issue isnt that i should eat more which come to think of my therapist really only worried about that",
      "created_utc": 1615403466.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gqhla9c",
      "author": "yktop1396",
      "body": "I'm an ED therapist and I feel this way too. Programming could be so much better suited for non AN clients.  Each ED is so nuanced they would benefit from having different tracks or programs.",
      "created_utc": 1615407470.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gqhpt5y",
      "author": "cburnard",
      "body": "unfortunately i think it's incredibly difficult to find treatment/a therapist/a medication combo (if one chooses to go that route) that is truly compatible with the patient, and i feel this way about all mental illness, not just EDs.\n\nat least in the US, ED-specific treatment centers are so few and far between, or so expensive (and therefore giving the patient even fewer options), that sometimes people \"take what they can get\" and it really shouldn't be that way. \n\nthe combination of limited resources + the fact that mental illnesses and psychology/psychiatry are not exact sciences can make it hard for people to find something that really works for them.\n\ni think a lot of people will also shame others for not \"getting better\" or for not \"acting nicely\" or for not \"working the program\" b/c that person clearly hasn't gotten the treatment they *need* and also can't do it alone. some folks will see you've received *some* treatment but it then when symptoms continue after that treatment, it becomes the patient's personal failing and not to the fact that the treatment they received wasn't sufficient. just b/c something worked for one person, doesn't mean it'll work for another.\n\nmaybe i'm losing the point here, but i guess i wanted to say i DO NOT think this is your fault, and i agree with all the points you've made. you're paying for the treatment and therefore it should work. i think if you leave treatment and still feel this way, i would recommend trying to search for a therapist who specializes in BED and/or bulimia. if you can't find a compatible path forward with that therapist, you should keep trying until you find someone who you really like. you deserve that much, and more.\n\n💛💛💛",
      "created_utc": 1615409390.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqi3pk5",
      "author": "blue_keiko",
      "body": "I absolutely benefited. I was diagnosed with Bulimia. Maybe I got more out of the program because my bulimia/binge eating was a result of previous restriction though. \n\nI think what helped wasnt so much the structured meal plans but rather learning/unlearned the core beliefs I had that \"triggered\" eating disorder behaviors. \n\nI'm sorry you feel disadvantaged when it comes to treatment options. As frustrating as it may be, you CAN find freedom. It is not easy. And it isn't fast, perfect or pretty! BUT it is possible. I was sure I would die from a ruptured stomach from the force of puking one day. But here I am! No desire to binge! I can eat normal freaking portions of whatever I want and not even think twice! I can say no to desserts simply because I don't feel like having it! But I can also have it and not completely lose control.\n\nIts fucking amazing being recovered. Keep trying!!!",
      "created_utc": 1615415579.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gqgqrma",
      "author": "iShouldHaveBeenAbort",
      "body": "Sorry if this isn’t worded the best or all over the place, missed a few other points I wanted to make but this was just a messy vent",
      "created_utc": 1615395545.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gqj03v3",
      "author": "makeupyourworld",
      "body": "My diagnosis is technically anorexia but my biggest issue is definitely purging (I restrict and purrge). I also feel ashamed and out of place around other anorexics since I use laxatives and don't vomit. I eat about 12-1500 calories per day and people with anorexia tend to tell me I don't seem anorexic I just seem \"lucky to be so thin.\"\n\nI feel much safer in the bulimia community if i'm honest. Less competitive, mean, less shame around purging.",
      "created_utc": 1615432446.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gqhvcun",
      "author": "edie43",
      "body": "I actually benefited a lot from treatment because I learned a lot about nutrition and how and when to eat. It took about a year and I’ve still had a couple of relapses but they have been small and easier to bounce back from. I don’t even know how long it’s been since my last purge. I think my main advice would be to trust the process and find a nutritionist.",
      "created_utc": 1615411801.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqia703",
      "author": "rttnrncdbby",
      "body": "I went from severe Bulimia to Anorexia after treatment, admittedly it didn’t do much. I won’t say this is always the case and will always suggest getting help.",
      "created_utc": 1615418762.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqic1m1",
      "author": "pikpikslink",
      "body": "For me no. I’ve been in long term inpatient treatment and outpatient treatment. I’m 35, I’ve had issues with food since I was around 10/11. \n\nIt’s varied between all different disordered eating habits. I’ve been malnourish and underweight, “normal healthy” weight, I become extremely obese at 122kgs, I’m 90kgs now with my current BED behaviours. \n\nI will never be recovered, this is me and I have lowered my expectations of ever being healthy with my eating. I’ve done so many treatment programs and I stick to it for a while and I always fall back into poor habits.",
      "created_utc": 1615419714.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqkcm4z",
      "author": "ThankfulWonderful",
      "body": "Somewhere else on this thread someone mentions forcing their way into narratives during group therapy. This is a great way to get more out of the program. \n\nI have found that once I started talking about my binge monster- other people would be more comfortable talking about theirs. \n\nDiscussing these closeted habits- brings them out of others as well. \n\nMonte Nido changed my life. They use intuitive eating as a model instead of the exchange system. 10/10 would recommend. I’ve been almost purge free for 300 days after leaving their program last February!",
      "created_utc": 1615464658.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqiiwcs",
      "author": "Several-Fee-4220",
      "body": "Yes I did, they reshaped my thinking for real. It’s work after but it’s the right direction and you stay there until you’re in that direction and taking off then you come home and go that direction. You work on it and go to out patient sometimes to make sure you keep on that right direction, but honestly just understanding the direction was worth everything. Ily!💕",
      "created_utc": 1615423358.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqivbqm",
      "author": "None",
      "body": "I’ve never found a treatment center that my insurance would cover and can’t afford it, so sadly I have no idea what it’s like,\n\nbut I’ve been in psychiatric hospitals that helped treat my bulimia when I was there for other reasons. I’ve been inpatient plenty at different hospitals in different states, and some of them had me pick out what I wanted for meals ahead of time and it helped to see my options on paper and I could have my therapist help me fill it out. Snack times were monitored and snack rooms were usually locked except at one place I went to. One facility would lock bathrooms after meals for an hour which was helpful. \n\nI know it all sounds like the bare minimum, but for places usually focused on helping with suicidal ideation/self harm, it was nice they made those efforts.",
      "created_utc": 1615429859.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqha9fz",
      "author": "blondiesdiary",
      "body": "I’ve been to Alsana in St Louis multiple times and they treat all kinds of eating disorders. I can’t guarantee the other locations are the same but I believe they are. They are very HAES & work with all behaviors. I’d recommend looking into them. (I struggle primarily with bingeing and purging)",
      "created_utc": 1615402809.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqin5lk",
      "author": "the_good_nurse",
      "body": "disagree. I have been to treatment several times to the Eating disorder Unit at Sanford Hospital in Fargo, ND. The program and model is called the ICAT. Completely based on the treatment of BN. It was only after successful treatment of BN did they apply it to other disorders.",
      "created_utc": 1615425623.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gqijud4",
      "author": "Which-Advice5291",
      "body": "I did (kinda do still), but I've been recovering for three years, I don't have any symptom anymore, but the bdd is still hanging on stronger than ever. I researched a lot about eating disorders for my thesis and a lot of studies point out that outpatient and intensive therapy fits better for those suffering from BN and BED. And that's exactly the treatment I'm doing currently, my team is specialised in bulimia and they also have specialised teams for anorexia and binge eating. It's rough tho, because I needed inpatient previous to intensive care and just then outpatient.",
      "created_utc": 1615423862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqipawr",
      "author": "baronessblockage",
      "body": "It is kind of like putting the self medicated binge drinkers with the every day alcohol users.  It just does not work. But everyone is treated the same way.  I think the separation is done to make money.  Why individualize treatment when you can put everyone in the same pot?",
      "created_utc": 1615426736.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqj95ks",
      "author": "Lilith-Rising",
      "body": "I was so frustrated at the therapy program I attempted which was supposed to be best in my state, I had BED and then developed Bulimia, my weight gain(among other symptoms ) was actually severe and after going into obesity resulted in insulin resistance and vein and joint damage. They way they skirted around the weight issue was insulting when I wanted to have clear conversations about the habits that brought me to this point, they flat out told me that society was the problem and weight loss would not be addressed. It was killing me, why don’t we talk about game plans for “weight restoration” in this respect? It was awful and their focus on the idea that I was restricting was outdated, EDs can have so many sources and applying a model of treatment using AN as the only data source results in mistreatment and pseudoscience.\n\nNo symptom of a serious illness should be dismissed or skirted around, patients are owed truth and education to make their own informed decisions regarding treatment plans.",
      "created_utc": 1615437918.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqjdqx5",
      "author": "seasamebun",
      "body": "i havent been in a treatment center but i have seen a dietitian for it . im 2 months into recovery right now but my therapist doesnt specialize eds, she specializes in trauma instead. i worked with a dietitian because i was told to from my psychiatrist, however tbh i hated every single minute with the dietitian. it was extremely frustrating because i feel like she acted a lot more like my main problem was anorexia and all of my concerns about trigger foods and binge urges were just met with \"eat this 1___ calorie meal plan and stop purging\" and \"i cant help u if u dont stop restricting\" like ??? she made me feel bad for having an eating disorder and not understanding how hard it was for me to not restrict or binge or purge. i couldnt stop bp'ing and eating that amount of cals was terrifying to me but she kept pushing me and not letting me go at my own pace and it was just a bad experience that didnt help me at all.it probably helps some people but it definitely wasnt for me, instead i think therapy and just my own self awareness is what has helped me the most",
      "created_utc": 1615440730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqjie3y",
      "author": "Renmeya",
      "body": "Honestly lol even when I don't eat that much I still need to purge, wish they'd understand that.",
      "created_utc": 1615443461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqjrap8",
      "author": "motenashite",
      "body": "My therapist, whom I no longer see, told me “All you have to do is put your mind to stop purging,” and I never went back lmao",
      "created_utc": 1615449147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqjreg1",
      "author": "bunni_bear_boom",
      "body": "The only therapist who ever really helped was my group therapist who ran a women's group based around trauma. And I'm relapsing now so it wasn't a lasting fix but I did learn a lot about psychology and how to explain myself better",
      "created_utc": 1615449216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqjuk4s",
      "author": "shockheadedfranzy",
      "body": "I definitely benefited from my inpatient treatments... but I’m in Germany and our healthcare system is so much better than in the US and a lot of other countries. But here are also differences between the treatments and the approach to it. Nobody’s perfect = not everything works for everyone. You need to try until you find the right therapy for you.",
      "created_utc": 1615451337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqkckw6",
      "author": "ElmarSuperstar131",
      "body": "I agree, it is difficult and I’ve placed a lot of blame on my family for not taking my bulimia and BED seriously. Even now it’s never acknowledged with care or it’s used against me, especially for why I can’t lose weight.",
      "created_utc": 1615464631.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqiiu0v",
      "author": "lacroixlite",
      "body": "My hero. ❤️",
      "created_utc": 1615423322.0,
      "score": 11,
      "context": [
        {
          "id": "gqhkl32",
          "author": "None",
          "body": "I benefited a lot from forcing my way into group therapy narratives. I didn’t shy away from calling it binging and purging and would admit to my binges and discuss how my purging made me feel. People were very comfortable discussing restriction and I noticed the BED and Bulimia patients would say vague stuff like “engaging in behaviors” and I was like... nah eff that.\n\nI think your experience is going to depend very much on your cohort and your desire to take up space. It also helped that I worked with a therapist who was a recovered bulimic and VERY open about her experience.",
          "created_utc": 1615407170.0
        }
      ]
    },
    {
      "id": "gqmnw8f",
      "author": "rileyyj001",
      "body": "When I was in IOP, this sort of direct, matter-of-fact language was explicitly prohibited. No wonder so many of us didn’t successfully complete the program. Tip-toeing around the actual, “taboo” (eye roll 🙄) words helps no one, so I commend you for allowing yourself to go there! I’m sure your honesty helped a lot of people.",
      "created_utc": 1615504055.0,
      "score": 2,
      "context": [
        {
          "id": "gqhkl32",
          "author": "None",
          "body": "I benefited a lot from forcing my way into group therapy narratives. I didn’t shy away from calling it binging and purging and would admit to my binges and discuss how my purging made me feel. People were very comfortable discussing restriction and I noticed the BED and Bulimia patients would say vague stuff like “engaging in behaviors” and I was like... nah eff that.\n\nI think your experience is going to depend very much on your cohort and your desire to take up space. It also helped that I worked with a therapist who was a recovered bulimic and VERY open about her experience.",
          "created_utc": 1615407170.0
        }
      ]
    },
    {
      "id": "gqknui6",
      "author": "iShouldHaveBeenAbort",
      "body": "I’ve been to Monte Nido as well !! That was actually the most recent program I was at and they were actually the best I’ve been to !! If it’s okay to ask, which location did you go to?",
      "created_utc": 1615471719.0,
      "score": 1,
      "context": [
        {
          "id": "gqkcm4z",
          "author": "ThankfulWonderful",
          "body": "Somewhere else on this thread someone mentions forcing their way into narratives during group therapy. This is a great way to get more out of the program. \n\nI have found that once I started talking about my binge monster- other people would be more comfortable talking about theirs. \n\nDiscussing these closeted habits- brings them out of others as well. \n\nMonte Nido changed my life. They use intuitive eating as a model instead of the exchange system. 10/10 would recommend. I’ve been almost purge free for 300 days after leaving their program last February!",
          "created_utc": 1615464658.0
        }
      ]
    },
    {
      "id": "gqncsbo",
      "author": "None",
      "body": "That’s BSSSS. We couldn’t talk about numbers or specific behaviors (like anything considered a tip or a war story) but not being able to say, “Yesterday I purged and this morning I woke up exhausted with a pounding headache and I keep asking myself ‘was it worth it??’”\n\nLike how else do you process your Ed?",
      "created_utc": 1615517104.0,
      "score": 3,
      "context": [
        {
          "id": "gqhkl32",
          "author": "None",
          "body": "I benefited a lot from forcing my way into group therapy narratives. I didn’t shy away from calling it binging and purging and would admit to my binges and discuss how my purging made me feel. People were very comfortable discussing restriction and I noticed the BED and Bulimia patients would say vague stuff like “engaging in behaviors” and I was like... nah eff that.\n\nI think your experience is going to depend very much on your cohort and your desire to take up space. It also helped that I worked with a therapist who was a recovered bulimic and VERY open about her experience.",
          "created_utc": 1615407170.0
        },
        {
          "id": "gqmnw8f",
          "author": "rileyyj001",
          "body": "When I was in IOP, this sort of direct, matter-of-fact language was explicitly prohibited. No wonder so many of us didn’t successfully complete the program. Tip-toeing around the actual, “taboo” (eye roll 🙄) words helps no one, so I commend you for allowing yourself to go there! I’m sure your honesty helped a lot of people.",
          "created_utc": 1615504055.0
        }
      ]
    }
  ]
}