{
  "id": "m2kpmk",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1615448068.0,
  "title": "After 8 years of hiding my ED, turns out my parents don't care",
  "selftext": "Full disclosure, I really am just looking for comfort and support here. \n\nAt the beginning of 2021, due to some persistent support from my SO and hitting a mental breaking point, I realized I needed to address my ED properly. I spoke to my parents, and, long-story-short, I have started therapy and am busy trying to feel less like garbage all the time. Since bringing it up and being officially diagnosed with bulimia, I have had a total of 2 conversations with my parents about this. You'd think it was a nonexistent issue. Yesterday I had a therapy session with them there and it was a disaster. They acted as if I was attacking them, and got incredibly defensive. I sort of gave up halfway through, because they basically said they had done all they could and if I was struggling, the bulk of treatment was up to me. \n\nMy parents have always been bad with mental and emotional issues, but this takes it to another level. Even though I am nearly 20, there is still a big part of me hoping that this will be the thing to make them step up and just act like parents for once- taking the time to be there for me, and actually look after me, because they never really have. \n\nI feel invalidated and angry and so disappointed. It makes me think I should've just kept going on the way I was because this has changed nothing for the better. Even after that, we have gone back to acting like nothing is wrong in the family, and it's extremely upsetting.",
  "url": "https://www.reddit.com/r/bulimia/comments/m2kpmk/after_8_years_of_hiding_my_ed_turns_out_my/",
  "score": 69,
  "num_comments": 10,
  "comments": [
    {
      "id": "gqjrzi0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1615449598.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gqkfi4s",
      "author": "LischenVonEngels",
      "body": "The exact same thing is happening to me! For some reason, some parents want to treat their children like dolls and not legitimate human beings with thoughts and feelings that are completely different from them. In most cases, parents are one of the main reasons for the development of EDs, but they refuse to acknowledge it and act like it's our fault. After my botched therapy attempt, my mother became so erratic and violent with being confronted with the fact that she failed as a parent that the police had to be called. You deserve so much better in life than some childish parents who don't want to take responsibility for the ways that they may have traumatized and wronged their own child.",
      "created_utc": 1615466753.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqkk542",
      "author": "Tramirezmma",
      "body": "In a better world, what kind of reaction would you have preferred OP?",
      "created_utc": 1615469686.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqo2q7j",
      "author": "stillwalkingthefence",
      "body": "So sorry to hear this and that your parents didn't react supportively. I very much understand your anger and disappointment and your experience really reminds me a lot of something similar I went through.\n\nMy parents are like yours: they don't deal well with mental health, and don't speak about emotions. At around your age, I shared with my parents that I was abused by a family member and kept it a secret for ten years, during which I was depressed & suicidal. They were horrified and empathetic when I confessed, but I distinctly remember two things that made me realize they couldn't be part of my recovery.\n\n1) One of the first questions my dad asked is if I wanted a therapist and I said maybe. He made a face and said, \"But then a stranger will know about this bad thing that happened in our family.\"\n\n2) A few days afterwards, I visited the tombstone of my abuser and shouted, screamed, cried, and said everything that I couldn't say as a young victim. I felt vindicated and shared my emotional accomplishment with my mom, who frowned and said, \"Don't do things like that, it's bad. You have to move on.\"\n\nAnd then same: they just acted like everything was normal and didn't bring it up ever again.\n\nA few years later -- after I came out of my depression and was thriving as an adult -- my mom broke down and said she felt like she failed me because she couldn't protect me as a child. I didn't feel that way at all and assured her so, but I saw that even though I had recovered, my mom quietly carried the torture of my trauma for years afterwards.\n\nThat's my experience. I guess all I'm really saying is that I agree with the notion of mourning what you don't have now, and then making peace with it and finding your way forward. Maybe your parents won't be part of your support system on your road to recovery, but that just means you find a different way that works. Please take care; I hope that you can keep us updated on how things are going.",
      "created_utc": 1615534301.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqkdlwe",
      "author": "Quarter_Straight",
      "body": "You have every right to feel the way you do, and I understand the disappointment in your parents but we can’t expect them to understand. You’re kinda setting yourself for failure when you expect a certain thing from them.\nIt’s sad and it sucks, believe me.\nThe best thing you can do at the end of the day is to take care of you. You are your own best friend and know yourself best. Really try to be your own parent, get some help from professions, find a good support group with friends or whoever, go to the doctor, go wherever to make sure you are healthy and happy. It’s a life long journey. \nI have had similar problems with my parents in different ways, but the same thing, and once I gave up the need and started to take myself into my own arms I have found more healing than I have ever before. \nI wish you lots of love and healing! Love and take care of your body, for you! It’s easy to give up on ourselves and punish it.",
      "created_utc": 1615465400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqjv9wv",
      "author": "None",
      "body": "Thank you for taking the time to reply... I appreciate the kind words. I know you are right, and I'm lucky to have other opportunities for support in my life. Thank you for the well wishes <3 I'm still going to do this.",
      "created_utc": 1615451874.0,
      "score": 6,
      "context": [
        {
          "id": "gqjrzi0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1615449598.0
        }
      ]
    },
    {
      "id": "gqkg0kz",
      "author": "None",
      "body": "Yes to the thing about getting super angry with any confrontation! If I raise any sort of issue, even if it's nothing big and I'm super calm, my mom just goes into super defensive mode. It makes communication impossible. I'm sorry to hear you're dealing with something similar and wish you all the best  x",
      "created_utc": 1615467101.0,
      "score": 3,
      "context": [
        {
          "id": "gqkfi4s",
          "author": "LischenVonEngels",
          "body": "The exact same thing is happening to me! For some reason, some parents want to treat their children like dolls and not legitimate human beings with thoughts and feelings that are completely different from them. In most cases, parents are one of the main reasons for the development of EDs, but they refuse to acknowledge it and act like it's our fault. After my botched therapy attempt, my mother became so erratic and violent with being confronted with the fact that she failed as a parent that the police had to be called. You deserve so much better in life than some childish parents who don't want to take responsibility for the ways that they may have traumatized and wronged their own child.",
          "created_utc": 1615466753.0
        }
      ]
    },
    {
      "id": "gqliwmj",
      "author": "None",
      "body": "This is a really good question. Because I know, deep down, I'm being unfair expecting them to rise to the occasion when I actually don't know what I need from them. A part of me even thinks it would just be... weird, for them to suddenly be super caring and attentive? I feel like the time for that has passed and for it to suddenly happen now would be near impossible. So maybe it is for the best. I know where I stand with them and don't need to fool myself into thinking there's more beneath the surface. So... yeah. Good question.",
      "created_utc": 1615485731.0,
      "score": 3,
      "context": [
        {
          "id": "gqkk542",
          "author": "Tramirezmma",
          "body": "In a better world, what kind of reaction would you have preferred OP?",
          "created_utc": 1615469686.0
        }
      ]
    },
    {
      "id": "gqw8eck",
      "author": "None",
      "body": "Thank you so much for this kind response and for sharing your experience. I have also had moments where my parents have acted empathetic and been helpful but it's never... quite right and never extends past that moment. I have just recently been opening up to a few friends about this, which is very new for me as I am an incredibly private person. They've been so supportive and I'm feeling more confident about being able to build up my own/stronger support systems. Thank you again-this really makes me feel less alone <3",
      "created_utc": 1615726306.0,
      "score": 1,
      "context": [
        {
          "id": "gqo2q7j",
          "author": "stillwalkingthefence",
          "body": "So sorry to hear this and that your parents didn't react supportively. I very much understand your anger and disappointment and your experience really reminds me a lot of something similar I went through.\n\nMy parents are like yours: they don't deal well with mental health, and don't speak about emotions. At around your age, I shared with my parents that I was abused by a family member and kept it a secret for ten years, during which I was depressed & suicidal. They were horrified and empathetic when I confessed, but I distinctly remember two things that made me realize they couldn't be part of my recovery.\n\n1) One of the first questions my dad asked is if I wanted a therapist and I said maybe. He made a face and said, \"But then a stranger will know about this bad thing that happened in our family.\"\n\n2) A few days afterwards, I visited the tombstone of my abuser and shouted, screamed, cried, and said everything that I couldn't say as a young victim. I felt vindicated and shared my emotional accomplishment with my mom, who frowned and said, \"Don't do things like that, it's bad. You have to move on.\"\n\nAnd then same: they just acted like everything was normal and didn't bring it up ever again.\n\nA few years later -- after I came out of my depression and was thriving as an adult -- my mom broke down and said she felt like she failed me because she couldn't protect me as a child. I didn't feel that way at all and assured her so, but I saw that even though I had recovered, my mom quietly carried the torture of my trauma for years afterwards.\n\nThat's my experience. I guess all I'm really saying is that I agree with the notion of mourning what you don't have now, and then making peace with it and finding your way forward. Maybe your parents won't be part of your support system on your road to recovery, but that just means you find a different way that works. Please take care; I hope that you can keep us updated on how things are going.",
          "created_utc": 1615534301.0
        }
      ]
    },
    {
      "id": "gqmqnol",
      "author": "LischenVonEngels",
      "body": "Thank you, and exactly! Then they blame you for it and the bad communication when in reality if they were able actually able to be self aware, they would realize that it's their fault!",
      "created_utc": 1615505469.0,
      "score": 2,
      "context": [
        {
          "id": "gqkfi4s",
          "author": "LischenVonEngels",
          "body": "The exact same thing is happening to me! For some reason, some parents want to treat their children like dolls and not legitimate human beings with thoughts and feelings that are completely different from them. In most cases, parents are one of the main reasons for the development of EDs, but they refuse to acknowledge it and act like it's our fault. After my botched therapy attempt, my mother became so erratic and violent with being confronted with the fact that she failed as a parent that the police had to be called. You deserve so much better in life than some childish parents who don't want to take responsibility for the ways that they may have traumatized and wronged their own child.",
          "created_utc": 1615466753.0
        },
        {
          "id": "gqkg0kz",
          "author": "None",
          "body": "Yes to the thing about getting super angry with any confrontation! If I raise any sort of issue, even if it's nothing big and I'm super calm, my mom just goes into super defensive mode. It makes communication impossible. I'm sorry to hear you're dealing with something similar and wish you all the best  x",
          "created_utc": 1615467101.0
        }
      ]
    },
    {
      "id": "gqlu3hm",
      "author": "Tramirezmma",
      "body": "I'm not gonna tell you to try and see their perspective, because you need to take care of yourself before anything at this point. But as a parent myself, I don't know how I'd react either. I'd feel like I failed you, be disappointed you felt like it needed to be hidden for so long, and would be afraid to react too strongly for fear of making something worse. \n\nBut this could be a positive. Your parents have now been allowed in to a vulnerable piece for you, and you could have an opportunity to deepen your connection and establish more open and honest lines of communicating. If they line you, and I think they do even if they're emotionally closed off, then they want you to be close as well.",
      "created_utc": 1615490521.0,
      "score": 3,
      "context": [
        {
          "id": "gqkk542",
          "author": "Tramirezmma",
          "body": "In a better world, what kind of reaction would you have preferred OP?",
          "created_utc": 1615469686.0
        },
        {
          "id": "gqliwmj",
          "author": "None",
          "body": "This is a really good question. Because I know, deep down, I'm being unfair expecting them to rise to the occasion when I actually don't know what I need from them. A part of me even thinks it would just be... weird, for them to suddenly be super caring and attentive? I feel like the time for that has passed and for it to suddenly happen now would be near impossible. So maybe it is for the best. I know where I stand with them and don't need to fool myself into thinking there's more beneath the surface. So... yeah. Good question.",
          "created_utc": 1615485731.0
        }
      ]
    }
  ]
}