{
  "id": "m39o6n",
  "subreddit": "bulimia",
  "author": "lavaycudad",
  "created_utc": 1615523292.0,
  "title": "Does anyone else feel like their ED gives them a sense of purpose?",
  "selftext": "My eating disorder gives me something to do and I feel like I’m good at it. It allows me to plan for my day, and keep me going through life when I’m feeling sad about something else. It makes me feel a little less empty sometimes. I feel like it is a coping mechanism (maybe not a good one) but it keeps me from feeling suicidal. Does anyone else feel like this?",
  "url": "https://www.reddit.com/r/bulimia/comments/m39o6n/does_anyone_else_feel_like_their_ed_gives_them_a/",
  "score": 87,
  "num_comments": 9,
  "comments": [
    {
      "id": "gqnqotn",
      "author": "guide_me_stars",
      "body": "I wouldn't say it gives me a sense of purpose, but it does give me a sense of identity. As I've begun my recovery, I often wonder who I will be without this ED. I've had it for over thirteen years and to some extent, it will always be a part of me but I've structured my days and my identity around this disorder for so long that I wonder how much of it has shaped my interests, coping mechanisms, likes, dislikes, and everything else about me. It's scary to let it go and have the extra burden of rediscovering myself.",
      "created_utc": 1615525163.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gqo9xdl",
      "author": "PrestigiousDaikon219",
      "body": "I relate to this . When I was restricting I felt like I could do anything. I was waking up early and doing all household chores . (I have depression and most times I can’t do these things ) . I kinda felt like I was losing weight and that made me hopeful about my future.But then I started binging 2 days ago I don’t know how to feel right now. I don’t want to do anything anymore ,just eat and sleep. It feels soo dumb but it’s so frustrating.",
      "created_utc": 1615541125.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqojay5",
      "author": "Cath1212",
      "body": "Personally, it gives me something to look forward to (as f***** up as it sounds). I have a lot of assignments to work on atm, so I give myself a ‘goal’ that once I’ve done a good day’s work, I can spoil myself with some food in the evenings. Typing that down now makes me realise how awful this is...\n\nEdit grammar",
      "created_utc": 1615550194.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gqov14n",
      "author": "Turtle_data",
      "body": "It feels like striving to lose weight gives me something to aim for in life. I understand what you're saying 100%.",
      "created_utc": 1615557800.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqpp9lz",
      "author": "Fangz00",
      "body": "I relate to this and it's usually what I fall back on when I feel low or empty... I find myself nostalgic for the worst times in my life and now I can see that it's because it was simple and structured. I literally had nothing to care about other than controling food and working out! It was incredibly sad and I messed up school and all my friendships ( and my health still to this day sadly) but it was ok buecause I had my miserable story going on.\nThe simple and clear goals can calm the existential dread that I think anyone who's slightly neuro divergent is filled with at least semi often when the world gets quiet. There's no clear meaning or path in life so to treat life like a weird sick video game quest arch feels easier. \nI'm recovered(ing) now and I've found that accepting the realities of the world and enjoying them is what has kept me going.. I can't say I don't weirdly get triggered and think about how being a BPD nut job who does drugs and doesn't eat is so ~sexy~ because it's the past! And craving that is normal. It's okay to talk about it this way because eating disorders are just coping mechanisms and it's okay to admit it",
      "created_utc": 1615571780.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqozd34",
      "author": "bryn0099",
      "body": "I think this is a very good thing to recognize and be honest with yourself about. It’s not the eating disorder that’s “wrong” but rather that other parts of life lack purpose and beauty and meaning worth giving up the eating disorder for. I’m thankful for what my eating disorder gave me when I was in such a dark place. And I built up a life worth living without an eating disorder and now I’m happy without it. But I don’t think of it as the worst thing ever. It had a purpose and helped me at that time get through what’s actually worse- feeling helpless, hopeless, like you have nothing worth living for.",
      "created_utc": 1615560012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqp7sfg",
      "author": "None",
      "body": "yes. I say it’s but only hobby and it’s true. home after work with nothing to do? workout, go to the store and look for low calorie foods, b/p, thank about food. it consumes me, but then again, i have nothing else to.",
      "created_utc": 1615564005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqpx5gg",
      "author": "hellohello_0606",
      "body": "It really gives me a goal as sad as that sounds but it’s a great short term goal that I try to achieve",
      "created_utc": 1615575315.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqsw5hs",
      "author": "cecedreaming",
      "body": "This is what has always stopped me from recovering, despite the many times my ED has left me feeling hopeless and suicidal.\n\nMy family can't understand why I don't just stop because it makes me so miserable. \n\nBut it's a crutch for me. If I'm planning calories, then it's a distraction from other bad things in my life. I get a sense of achievement every day I don't binge. My exercise obsession gives me daily endorphin highs. Ultimate happiness for me is weight loss. Unfortunately that means weight gain is incredibly mentally difficult to cope with.\n\nWhen my mum got diagnosed with cancer, food was there for me, and I could numb myself with binges and switch off from the depression I felt. I dont know what I'd do without this coping mechanism.\n\nI'm trying to pick up some more hobbies because I don't want to look back on my life and think of all the things I missed out on. I think I'm getting better at making my ED more balanced with other parts of my life, instead of trying to get rid of it completely. It definitely gives me a sense of control over my life, which I think is pretty common amongst ED sufferers.",
      "created_utc": 1615646793.0,
      "score": 2,
      "context": []
    }
  ]
}