{
  "id": "m3uwsp",
  "subreddit": "bulimia",
  "author": "Missyxmoo",
  "created_utc": 1615594531.0,
  "title": "Had to have all of my teeth pulled",
  "selftext": "I am 31 years old and this week i had all of my teeth pulled. After struggling with bulimia for 16 years and spending over 100k on dental work, i had to have all of my teeth pulled. This is costing 70k to get my teeth restored :(\nIn addition to this my Ive had multiple heart attacks, my kidneys shut down last year, my esophagus has ruptured, my bladder has prolapsed and im left with life long autoimmune issues, bowel obstruction & cardiac complications. \nIf you think this can't happen to you... i promise it can. Im sick of going tiktok and seeing eating disorders glorified when this is the reality of this disease.\nPlease take care of yourselves... no one is exempt from the repercussions.",
  "url": "https://www.reddit.com/r/bulimia/comments/m3uwsp/had_to_have_all_of_my_teeth_pulled/",
  "score": 147,
  "num_comments": 12,
  "comments": [
    {
      "id": "gqr88w2",
      "author": "ModandMitton",
      "body": "I feel this. My liver isn't functioning correctly and I'm going to have several teeth pulled. It's really brave of you to share the reality of what eating disorders do to people, maybe it will help someone who is thinking about seeking help to recover to see the realities of what can happen if they don't seek help.",
      "created_utc": 1615599428.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gqresvk",
      "author": "cburnard",
      "body": "jesus christ my heart goes out to you.",
      "created_utc": 1615603288.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gqrh02f",
      "author": "kcowleries",
      "body": "oh god you really got saddled with the entire list of side effects and repercussions. I hope you're okay finanically speaking after that huge hit, and that you can make some progess towards being okay physically and mentally too. 💜",
      "created_utc": 1615604577.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gqryt3f",
      "author": "NoelleDash",
      "body": "Holy shit, I am so sorry that you are going through this. \n\nI am 37 and have dealt with this diease for  23 years. My teeth are falling out, several of them have been replaced with implants. Everytime I purge I wonder which tooth (or partial tooth) will fall out next.",
      "created_utc": 1615616901.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gqr6u0a",
      "author": "Hexane278",
      "body": "So sorry you are going through this.  Sharing your experience was really brave and my hope is seeing this can help someone else.  Bulimia really is a devastating disease.  Stay strong.",
      "created_utc": 1615598610.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gqs0dev",
      "author": "psychicglade",
      "body": "Thank you for sharing this. I'm 28, 6 months into recovery after 10+ years. I have some autoimmune and esophageal complications myself. It's fucking crazy to be living with/trying to heal from a life-threatening illness that no one takes seriously.",
      "created_utc": 1615618268.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gqr1nbj",
      "author": "whoaprettywoman",
      "body": "I am so sad you're going through all of this. Sending prayers of love and healing. Thank you for sharing maybe it will help someone ❤️",
      "created_utc": 1615595611.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gqrtahe",
      "author": "Odd-Faithlessness851",
      "body": "This is the ugly side of bulimia. It’s deadly and so scary. I got to a point where I was constantly throwing up blood and my face was always swollen. I was physically exhausted and I hated myself. I’m so thankful that you are sharing your experience here. You’ve been through so much more than anyone should have to ever experience. Be gentle with yourself. Sending you love.",
      "created_utc": 1615612494.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqslbqg",
      "author": "None",
      "body": "I’m so sorry you’re going through this. We’re the same age and i only recently found recovery from anorexia after years of treatment and bone damage. EDs are so horrible and physically painful, there’s nothing glamorous or esthetic about them, just wrinkly skin and bad moods and hair loss and moodiness. It’s so all consuming. I wish the best of luck for you in your healing. I had a friend pass away this year from rupturing and heart conditions due to her bulimia. I’ve had friends with EDs commit suicide and I’ve seen girls in their 20s with pacemakers and people who have had grand mal seizures. It’s so serious. All of my love to you.\n\nWhat helped me a lot was realizing that I needed to address the underlying trauma that was causing me to use my ED to distract myself from the pain. I did a lot of exposure work and it helped me greatly to realize that EDs are just keeping us from experiencing the true hurt we hold within ourselves. Sending you all of my love.",
      "created_utc": 1615639345.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqtgk99",
      "author": "None",
      "body": "Thank you for sharing this. I’m a recovered bulimic for a year and a half now. I’ll never forget the health consequences that came with this eating disorder. Sending you all my support and love to you.",
      "created_utc": 1615657851.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqtot3s",
      "author": "baronessblockage",
      "body": "If it weren't for Princess Diana very few people would know about bulimia",
      "created_utc": 1615662124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqvjo3s",
      "author": "b4bykitten",
      "body": "I'm so sorry. That's terrifying, my heart goes out to you ❤",
      "created_utc": 1615702256.0,
      "score": 1,
      "context": []
    }
  ]
}