{
  "id": "m8mi06",
  "subreddit": "bulimia",
  "author": "assassin-mythic",
  "created_utc": 1616175264.0,
  "title": "Why not share...",
  "selftext": "So this post is a bit random but I thought it may be a nice thing to share. I've been struggling with eating disorders for a while now (anorexia that developed into bulimia), but this past year I have really made huge strives towards recovery and can say that I have been purge free for 8 months now!!! It was definitely nowhere remotely near easy but my life now is so different. I did put on quite a bit of weight which was very very hard to do considering I was not underweight to begin with, but my body needed it. I have discovered the multitude of benefits to gaining weight. Its so amazing how when you stop restricting and doing a million things to maintain your body it...works. Like my nails are so fucking strong and healthy now its insane, so many people think I'm wearing acrylics. My hair is growing so much faster and it's so soft. And this might be the best thing yet-I do not think about food, restricting, purging, etc. all day long. I can focus on other things in my life now and it is so freeing. I just hope this reaches someone out there who needs a bit of motivation to treat their bodies and minds right..you all deserve it ❤️",
  "url": "https://www.reddit.com/r/bulimia/comments/m8mi06/why_not_share/",
  "score": 82,
  "num_comments": 7,
  "comments": [
    {
      "id": "grj5wn5",
      "author": "None",
      "body": "Thanks for sharing this, it’s what most of us strive when thinking about recovery. I’m not there yet but your post is giving me hope ☺️",
      "created_utc": 1616193271.0,
      "score": 5,
      "context": []
    },
    {
      "id": "grjdewy",
      "author": "lacroixlite",
      "body": "Thank you for painting a picture of what successful recovery can actually be like. I remember this feeling very well; nothing beats the pure LIFE energy you have without disordered eating ravaging your brain.\n\nHoping that someday I'll get back there. Thanks for being an inspiration, queenie 💖",
      "created_utc": 1616197318.0,
      "score": 3,
      "context": []
    },
    {
      "id": "grjm974",
      "author": "edie43",
      "body": "This really gives me hope. Saving this for when i need to be reminded of why I’m trying to recover. Like right now, lol.",
      "created_utc": 1616202210.0,
      "score": 3,
      "context": []
    },
    {
      "id": "grjrspg",
      "author": "1234__aa",
      "body": "I've been working on recovery for the past six months or so and today I found out I've put on a bit of weight (I was also not underweight to begin with- though my doctor said I'm still in a perfectly healthy range). I really needed this reminder that recovery looks like this and that it is so worth it. Thank you",
      "created_utc": 1616205294.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grjvtyo",
      "author": "froggie-style-meme",
      "body": "Good on you mate, I'm proud of you!",
      "created_utc": 1616207659.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grjw7fg",
      "author": "CesareIs",
      "body": "Congrats! Your story is inspiring and made me want to recover all the more. Thanks for sharing and have a fabulous day :)",
      "created_utc": 1616207878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grjz4vl",
      "author": "gargoyle-of-olay",
      "body": "my nails are so much stronger now that i’m not underweight and my brain is less foggy and i don’t look 65 lol",
      "created_utc": 1616209689.0,
      "score": 2,
      "context": []
    }
  ]
}