{
  "id": "mb7kzm",
  "subreddit": "bulimia",
  "author": "rghaddar",
  "created_utc": 1616477480.0,
  "title": "Please help!! I've lost all control with sugar.",
  "selftext": "I have been out of control with sweets - chocolate, ice cream, cake, or anything sweet - even things that I don't usually like very much. I just CAN'T STOP MYSELF no matter what I do. The guilt is unbelievable. I know what I'm supposed to do but I just can't stop. I hate when I throw up but I'm even more afraid of the weight gain. I've had so many sugar binges in the last few days and I just want to stop but also want to keep going. It tastes so good. Help!!! :(",
  "url": "https://www.reddit.com/r/bulimia/comments/mb7kzm/please_help_ive_lost_all_control_with_sugar/",
  "score": 69,
  "num_comments": 22,
  "comments": [
    {
      "id": "grwqz50",
      "author": "eaklv",
      "body": "I had to cut out sugar for the time being. I can't stop bingeing and purging if I eat sugar aside from fruit and sweet vegetables like sweet potatoes. I even had to cut out some spreads I was having that had added sugar. I have such an issue with it, once I have it I just get completely derailed with my recovery for weeks. I have had the longest success without purging, 2 months, while doing paleo but for me to get my period I need some grains, I don't know why. But I added in some things like quinoa, oats and cheerios but I don't have them everyday. Cheerios actually helped with my anemia and that alone made me feel better.\n\nI do not restrict fruit or carby veggies. If I want stuff myself with cherries, apples, sweet potatoes, white potatoes, whatever I just do it and it helped so much at the time. I kind of slipped up during Christmas and it's been so hard to do better now but I felt amazing when I was doing it that way. I can't have much caffeine because I have sleep issues but I find green tea helps with both sugar cravings and binge urges.",
      "created_utc": 1616489974.0,
      "score": 16,
      "context": []
    },
    {
      "id": "grwgm8o",
      "author": "eqqmcmuffin",
      "body": "im struggling with the same thing :( youre not alone, im sending you love and support <3",
      "created_utc": 1616480380.0,
      "score": 18,
      "context": []
    },
    {
      "id": "grwnbrv",
      "author": "up-and-cumming_rt",
      "body": "This happens to me very often. I’ll eat healthy and slip right back in with a cupcake or candy bar. What works for me is doing low carb, except in a specific way. \n\nI would not deprive myself of calories even though ultimately I wanted to lose the weight from my sugar binges. This is important to not feel deprived and if anything you have to make yourself feel full and satiated. And I definitely don’t recommend it unless you have good health and no familial kidney problems. \n\nSo I would reset my sugar urges by eating lots and lots of my favorite proteins. A lot of it, until I was full and couldn’t even think of eating sugary foods. Veggies as well, mostly broccoli and cauliflower for the fiber and bulk. But I ate til I was stuffed. Chicken, steak, fish, pork, and low carb vegetables. \n\nUltimately I didn’t eat enough calories to gain weight like I was when I binged sugar, but the filling nature of the protein heavy, low carb diet got me through the sugar cravings until they subsided (for me it ranges from 3-8 days of sugar cravings). Any time I craved sugar I reached for low carb food like chicken breast and greens, steak and eggs, pork chops - but nothing with sugar substitutes either. Just whole natural (as can be) foods on the savory/salty side of taste. \n\nThese cravings should be treated as an addiction, as really for some people it’s just as bad as other substances. There might be better, healthier ways. I’m positive there are. But this is the way it works for me and may work for others, particularly if you’re okay with eating lots of meat LOL.\n\nAnd as far as health goes, I’ve had blood work done before and after these resets and never had an issue with any analytes.",
      "created_utc": 1616486437.0,
      "score": 12,
      "context": []
    },
    {
      "id": "grxeml4",
      "author": "None",
      "body": "The best thing that helped me with sugar binges was to eat healthy sweet things that wouldnt give me guilt, anxiety or panic attack. Like sweet potatoes, honey, or some form of fruit that would also fill me in some form of way. Something sweet thats filling helps my sweet binges. I hope you’re okay!",
      "created_utc": 1616506958.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gry0yee",
      "author": "prettyseoul",
      "body": "This use to happen to me. You HAVE to cut off sugar. Sugar is like a drug, it gets you addicted. Like an alcoholic that has to go cold turkey on his drinks. If you cut off sugar you in fact start to not crave for it anymore. \n\nDon’t restrict yourself on carbs such as fruits, starchy vegetables, brown rice, etc. those will help your cravings. \n\nGood luck. You CAN do this.",
      "created_utc": 1616516954.0,
      "score": 5,
      "context": []
    },
    {
      "id": "grxazln",
      "author": "smokdya2",
      "body": "I hit my rock bottom and really wanted to get better. I opened up and told my roommate everything I was going through. I then back her all the candy(which was a ton) that I had just bought, as well as all the boxes of Girl Scout cookies and made her take them away and hide them from me. I find this has helped me. Last night I had a late night urge to binge take over me, abs I was like ohh I’ll just have 3 thin mints, and went to get them only to remember they are locked up hidden somewhere in her room. So it paid off and prevented me from eating them (which I for sure would have eaten WAY more than 3). But I suggest doing the same abs giving all your bad triggering treats to someone. Or just straight up throwing them out. It’s not a perfect solution, but hey, were all just humans doing the best we can:)",
      "created_utc": 1616505089.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gry3z2r",
      "author": "esoterique87",
      "body": "\\*Warning long post\\* This is extremely common and I find sugar to be a huge trigger for me too. I have completely stopped eating sugar because I get an immediate ED response to binge. There are some practical things you can do here in order to break this cycle. Structured Eating, Eat balanced Meals and Accept Delay Distract are from the book 'The Bulimia Help Method' by Ali Kerr & Richard Kerr. This book is a great resource and I highly recommend it.\n\n1. **Reach out.** This is one of the most important parts of recovery. If you don't have a therapist, dietician or coach, I highly recommend seeking professional help. You can recover on your own but if you have support it makes the process so much easier and you feel less alone. If professional help isn't an option then lean on someone you trust who you can contact when you are feeling urges or when you are trying to distract yourself. I'm connecting with my Mom at meals so that I don't binge and purge and it's been very helpful.\n2. **Remove the triggers**. If you find you are out of control around sugar, or any other triggering foods, it's ok to acknowledge this and temporarily stop eating/buying them. Keep them out of sight or better yet, don't buy them. If you order from food apps, delete those apps. Put as much friction between you and the behavior as possible. If you tend to drive to the store to buy binge food, put your keys in an obscure location so that you have to think about what you're doing before you act.\n3. **Structured eating**. Three meals and three snacks a day, no more than three hours apart. Retrain your mind and body to expect food often and regularly. This stabilizes blood sugar and reduces instances of binge urges. When you are well nourished, your body and mind don't have to send out signals to binge. If you are worried about weight gain, keep in mind that eating regularly is one of the best things you can do to maintain a healthy weight as it is a massive boost to your metabolism.\n4.  **Eat balanced meals**. Eat regular meals and snacks made up from fats, proteins and        complex carbohydrates. This will help to stabilize erratic blood sugar levels and in turn reducing those binge urges. I find sticking to whole, mostly unprocessed, low sugar, foods reduces my urge to binge. Nobody really wants to binge on strawberries but strawberry ice-cream is easy to binge on. Pick foods that feel safe to you and the least triggering.\n5. **Accept Delay Distract.** We can't control the fact that we get binge urges because of how our brains are wired to do this behavior. We can control how we respond to those urges. Accept the urge and remind yourself that the binge urge cannot control you, it is not dangerous and does not have to be fought.Delay taking any action towards your urge for 10 minutes and allow the urge to rise and fall. Distract yourself for those 10 minutes. Go for a walk, go for a drive, have a bath, talk to a friend, listen to music, immerse yourself in a project, work or play on your computer. Anything to distract you from those urges will help.\n\nI know how helpless and miserable you can feel in a binge/purge cycle. You are not alone and so many people are going through this right now. I hope even a little of this information was helpful and I'm sending lots of love and support your way ❤️",
      "created_utc": 1616518239.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gryfo7j",
      "author": "savanity__",
      "body": "I’m so sorry! Try fruit with a ton of fiber, maybe with some stevia or calorie free sweetener on top. It may scratch the itch",
      "created_utc": 1616523218.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gs84456",
      "author": "rougeberry",
      "body": "There’s a supplement called sweet defeat which is supposed to control sugar cravings and make sugary things taste bad! If all else fails you could look into that - it’s an all natural supplement https://www.sweetdefeat.com/\n\nIt also regulates blood sugar so good for diabetics as well",
      "created_utc": 1616710354.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grx29db",
      "author": "Glittering-Cod5256",
      "body": "I have to agree with you at first I would feel guilty even with fruit and ended up binging on fruit eventually I had to made peace with fruit and allowed myself to eat it in peace but sugary desserts and stuff like that it’s hard for me not to binge on that",
      "created_utc": 1616499865.0,
      "score": 9,
      "context": [
        {
          "id": "grwqz50",
          "author": "eaklv",
          "body": "I had to cut out sugar for the time being. I can't stop bingeing and purging if I eat sugar aside from fruit and sweet vegetables like sweet potatoes. I even had to cut out some spreads I was having that had added sugar. I have such an issue with it, once I have it I just get completely derailed with my recovery for weeks. I have had the longest success without purging, 2 months, while doing paleo but for me to get my period I need some grains, I don't know why. But I added in some things like quinoa, oats and cheerios but I don't have them everyday. Cheerios actually helped with my anemia and that alone made me feel better.\n\nI do not restrict fruit or carby veggies. If I want stuff myself with cherries, apples, sweet potatoes, white potatoes, whatever I just do it and it helped so much at the time. I kind of slipped up during Christmas and it's been so hard to do better now but I felt amazing when I was doing it that way. I can't have much caffeine because I have sleep issues but I find green tea helps with both sugar cravings and binge urges.",
          "created_utc": 1616489974.0
        }
      ]
    },
    {
      "id": "gs4tgnp",
      "author": "rghaddar",
      "body": "Thank you so much for sharing this! I'm pretty similar in that I tend to be doing okay until I lose it with sugar and it sets me back a few weeks. I'll try out your suggestions :)",
      "created_utc": 1616644501.0,
      "score": 1,
      "context": [
        {
          "id": "grwqz50",
          "author": "eaklv",
          "body": "I had to cut out sugar for the time being. I can't stop bingeing and purging if I eat sugar aside from fruit and sweet vegetables like sweet potatoes. I even had to cut out some spreads I was having that had added sugar. I have such an issue with it, once I have it I just get completely derailed with my recovery for weeks. I have had the longest success without purging, 2 months, while doing paleo but for me to get my period I need some grains, I don't know why. But I added in some things like quinoa, oats and cheerios but I don't have them everyday. Cheerios actually helped with my anemia and that alone made me feel better.\n\nI do not restrict fruit or carby veggies. If I want stuff myself with cherries, apples, sweet potatoes, white potatoes, whatever I just do it and it helped so much at the time. I kind of slipped up during Christmas and it's been so hard to do better now but I felt amazing when I was doing it that way. I can't have much caffeine because I have sleep issues but I find green tea helps with both sugar cravings and binge urges.",
          "created_utc": 1616489974.0
        }
      ]
    },
    {
      "id": "grwhspr",
      "author": "rghaddar",
      "body": "Thank you so much! As simple as this is, it is so helpful :) <3",
      "created_utc": 1616481387.0,
      "score": 12,
      "context": [
        {
          "id": "grwgm8o",
          "author": "eqqmcmuffin",
          "body": "im struggling with the same thing :( youre not alone, im sending you love and support <3",
          "created_utc": 1616480380.0
        }
      ]
    },
    {
      "id": "gs4trua",
      "author": "rghaddar",
      "body": "Thanks! It truly feels like and IS an addiction! I like your idea of also avoiding sugar substitutes. It's really anything sweet that can trigger it and man are the substitutes good haha.",
      "created_utc": 1616644696.0,
      "score": 2,
      "context": [
        {
          "id": "grwnbrv",
          "author": "up-and-cumming_rt",
          "body": "This happens to me very often. I’ll eat healthy and slip right back in with a cupcake or candy bar. What works for me is doing low carb, except in a specific way. \n\nI would not deprive myself of calories even though ultimately I wanted to lose the weight from my sugar binges. This is important to not feel deprived and if anything you have to make yourself feel full and satiated. And I definitely don’t recommend it unless you have good health and no familial kidney problems. \n\nSo I would reset my sugar urges by eating lots and lots of my favorite proteins. A lot of it, until I was full and couldn’t even think of eating sugary foods. Veggies as well, mostly broccoli and cauliflower for the fiber and bulk. But I ate til I was stuffed. Chicken, steak, fish, pork, and low carb vegetables. \n\nUltimately I didn’t eat enough calories to gain weight like I was when I binged sugar, but the filling nature of the protein heavy, low carb diet got me through the sugar cravings until they subsided (for me it ranges from 3-8 days of sugar cravings). Any time I craved sugar I reached for low carb food like chicken breast and greens, steak and eggs, pork chops - but nothing with sugar substitutes either. Just whole natural (as can be) foods on the savory/salty side of taste. \n\nThese cravings should be treated as an addiction, as really for some people it’s just as bad as other substances. There might be better, healthier ways. I’m positive there are. But this is the way it works for me and may work for others, particularly if you’re okay with eating lots of meat LOL.\n\nAnd as far as health goes, I’ve had blood work done before and after these resets and never had an issue with any analytes.",
          "created_utc": 1616486437.0
        }
      ]
    },
    {
      "id": "gs4tsmn",
      "author": "rghaddar",
      "body": "Thank you so much for the ideas!",
      "created_utc": 1616644710.0,
      "score": 2,
      "context": [
        {
          "id": "grxeml4",
          "author": "None",
          "body": "The best thing that helped me with sugar binges was to eat healthy sweet things that wouldnt give me guilt, anxiety or panic attack. Like sweet potatoes, honey, or some form of fruit that would also fill me in some form of way. Something sweet thats filling helps my sweet binges. I hope you’re okay!",
          "created_utc": 1616506958.0
        }
      ]
    },
    {
      "id": "gs4turk",
      "author": "rghaddar",
      "body": "Yes, I think you're right!! At least for the first several weeks I think I really need to just STOP and retrain my taste buds. Thank you so much for the encouragement and motivation.",
      "created_utc": 1616644747.0,
      "score": 2,
      "context": [
        {
          "id": "gry0yee",
          "author": "prettyseoul",
          "body": "This use to happen to me. You HAVE to cut off sugar. Sugar is like a drug, it gets you addicted. Like an alcoholic that has to go cold turkey on his drinks. If you cut off sugar you in fact start to not crave for it anymore. \n\nDon’t restrict yourself on carbs such as fruits, starchy vegetables, brown rice, etc. those will help your cravings. \n\nGood luck. You CAN do this.",
          "created_utc": 1616516954.0
        }
      ]
    },
    {
      "id": "gs4ty54",
      "author": "rghaddar",
      "body": "So glad that worked for you! Thanks for the ideas - need to take everything off the grocery list for sure! The cravings really hit when I know I have sugary snacks in the house.",
      "created_utc": 1616644806.0,
      "score": 1,
      "context": [
        {
          "id": "grxazln",
          "author": "smokdya2",
          "body": "I hit my rock bottom and really wanted to get better. I opened up and told my roommate everything I was going through. I then back her all the candy(which was a ton) that I had just bought, as well as all the boxes of Girl Scout cookies and made her take them away and hide them from me. I find this has helped me. Last night I had a late night urge to binge take over me, abs I was like ohh I’ll just have 3 thin mints, and went to get them only to remember they are locked up hidden somewhere in her room. So it paid off and prevented me from eating them (which I for sure would have eaten WAY more than 3). But I suggest doing the same abs giving all your bad triggering treats to someone. Or just straight up throwing them out. It’s not a perfect solution, but hey, were all just humans doing the best we can:)",
          "created_utc": 1616505089.0
        }
      ]
    },
    {
      "id": "gs4udtt",
      "author": "rghaddar",
      "body": "THANK YOU SO SO MUCH!! I want to print this and put it on my wall for when I'm really in sugar binge mode. So many great and important suggestions, and even though we always hear them scattered, having them together like this was so helpful. Thank you so much for the book recommendation as well! I'll look into it for sure. \n\nI have a therapist but for some reason can't get myself to bring up disordered eating with her even though she's AWESOME. I really need to do it though!! Worst part of all of this is that my degree is in nutrition and dietetics and I'm almost done with PhD in nutritional sciences so I know exactly what I need to do and have access to so many resources and information but can't get myself to do it when the binge hits :( not a good feeling\n\nI really love and appreciate your wonderful suggestions and ideas and thank you for taking the time to write this comment out <3 it is so helpful. Big virtual hugs to you!!",
      "created_utc": 1616645085.0,
      "score": 1,
      "context": [
        {
          "id": "gry3z2r",
          "author": "esoterique87",
          "body": "\\*Warning long post\\* This is extremely common and I find sugar to be a huge trigger for me too. I have completely stopped eating sugar because I get an immediate ED response to binge. There are some practical things you can do here in order to break this cycle. Structured Eating, Eat balanced Meals and Accept Delay Distract are from the book 'The Bulimia Help Method' by Ali Kerr & Richard Kerr. This book is a great resource and I highly recommend it.\n\n1. **Reach out.** This is one of the most important parts of recovery. If you don't have a therapist, dietician or coach, I highly recommend seeking professional help. You can recover on your own but if you have support it makes the process so much easier and you feel less alone. If professional help isn't an option then lean on someone you trust who you can contact when you are feeling urges or when you are trying to distract yourself. I'm connecting with my Mom at meals so that I don't binge and purge and it's been very helpful.\n2. **Remove the triggers**. If you find you are out of control around sugar, or any other triggering foods, it's ok to acknowledge this and temporarily stop eating/buying them. Keep them out of sight or better yet, don't buy them. If you order from food apps, delete those apps. Put as much friction between you and the behavior as possible. If you tend to drive to the store to buy binge food, put your keys in an obscure location so that you have to think about what you're doing before you act.\n3. **Structured eating**. Three meals and three snacks a day, no more than three hours apart. Retrain your mind and body to expect food often and regularly. This stabilizes blood sugar and reduces instances of binge urges. When you are well nourished, your body and mind don't have to send out signals to binge. If you are worried about weight gain, keep in mind that eating regularly is one of the best things you can do to maintain a healthy weight as it is a massive boost to your metabolism.\n4.  **Eat balanced meals**. Eat regular meals and snacks made up from fats, proteins and        complex carbohydrates. This will help to stabilize erratic blood sugar levels and in turn reducing those binge urges. I find sticking to whole, mostly unprocessed, low sugar, foods reduces my urge to binge. Nobody really wants to binge on strawberries but strawberry ice-cream is easy to binge on. Pick foods that feel safe to you and the least triggering.\n5. **Accept Delay Distract.** We can't control the fact that we get binge urges because of how our brains are wired to do this behavior. We can control how we respond to those urges. Accept the urge and remind yourself that the binge urge cannot control you, it is not dangerous and does not have to be fought.Delay taking any action towards your urge for 10 minutes and allow the urge to rise and fall. Distract yourself for those 10 minutes. Go for a walk, go for a drive, have a bath, talk to a friend, listen to music, immerse yourself in a project, work or play on your computer. Anything to distract you from those urges will help.\n\nI know how helpless and miserable you can feel in a binge/purge cycle. You are not alone and so many people are going through this right now. I hope even a little of this information was helpful and I'm sending lots of love and support your way ❤️",
          "created_utc": 1616518239.0
        }
      ]
    },
    {
      "id": "gs4tchv",
      "author": "rghaddar",
      "body": "Thanks for the suggestion!",
      "created_utc": 1616644430.0,
      "score": 1,
      "context": [
        {
          "id": "gryfo7j",
          "author": "savanity__",
          "body": "I’m so sorry! Try fruit with a ton of fiber, maybe with some stevia or calorie free sweetener on top. It may scratch the itch",
          "created_utc": 1616523218.0
        }
      ]
    },
    {
      "id": "gs4vxs0",
      "author": "up-and-cumming_rt",
      "body": "I totally understand you. Some people are able to eat fruit and other healthy sweet alternatives but for me a banana or a plum will send me into a spiral LOL",
      "created_utc": 1616646091.0,
      "score": 2,
      "context": [
        {
          "id": "grwnbrv",
          "author": "up-and-cumming_rt",
          "body": "This happens to me very often. I’ll eat healthy and slip right back in with a cupcake or candy bar. What works for me is doing low carb, except in a specific way. \n\nI would not deprive myself of calories even though ultimately I wanted to lose the weight from my sugar binges. This is important to not feel deprived and if anything you have to make yourself feel full and satiated. And I definitely don’t recommend it unless you have good health and no familial kidney problems. \n\nSo I would reset my sugar urges by eating lots and lots of my favorite proteins. A lot of it, until I was full and couldn’t even think of eating sugary foods. Veggies as well, mostly broccoli and cauliflower for the fiber and bulk. But I ate til I was stuffed. Chicken, steak, fish, pork, and low carb vegetables. \n\nUltimately I didn’t eat enough calories to gain weight like I was when I binged sugar, but the filling nature of the protein heavy, low carb diet got me through the sugar cravings until they subsided (for me it ranges from 3-8 days of sugar cravings). Any time I craved sugar I reached for low carb food like chicken breast and greens, steak and eggs, pork chops - but nothing with sugar substitutes either. Just whole natural (as can be) foods on the savory/salty side of taste. \n\nThese cravings should be treated as an addiction, as really for some people it’s just as bad as other substances. There might be better, healthier ways. I’m positive there are. But this is the way it works for me and may work for others, particularly if you’re okay with eating lots of meat LOL.\n\nAnd as far as health goes, I’ve had blood work done before and after these resets and never had an issue with any analytes.",
          "created_utc": 1616486437.0
        },
        {
          "id": "gs4trua",
          "author": "rghaddar",
          "body": "Thanks! It truly feels like and IS an addiction! I like your idea of also avoiding sugar substitutes. It's really anything sweet that can trigger it and man are the substitutes good haha.",
          "created_utc": 1616644696.0
        }
      ]
    },
    {
      "id": "gs6ir0l",
      "author": "smokdya2",
      "body": "I hear ya on that one!",
      "created_utc": 1616686209.0,
      "score": 1,
      "context": [
        {
          "id": "grxazln",
          "author": "smokdya2",
          "body": "I hit my rock bottom and really wanted to get better. I opened up and told my roommate everything I was going through. I then back her all the candy(which was a ton) that I had just bought, as well as all the boxes of Girl Scout cookies and made her take them away and hide them from me. I find this has helped me. Last night I had a late night urge to binge take over me, abs I was like ohh I’ll just have 3 thin mints, and went to get them only to remember they are locked up hidden somewhere in her room. So it paid off and prevented me from eating them (which I for sure would have eaten WAY more than 3). But I suggest doing the same abs giving all your bad triggering treats to someone. Or just straight up throwing them out. It’s not a perfect solution, but hey, were all just humans doing the best we can:)",
          "created_utc": 1616505089.0
        },
        {
          "id": "gs4ty54",
          "author": "rghaddar",
          "body": "So glad that worked for you! Thanks for the ideas - need to take everything off the grocery list for sure! The cravings really hit when I know I have sugary snacks in the house.",
          "created_utc": 1616644806.0
        }
      ]
    },
    {
      "id": "gs6uvcx",
      "author": "esoterique87",
      "body": "I'm so glad this has helped! It sounds like you are ready to take action and steps toward recovery. I do hope you bring it up to your therapist, removing the shame and secrecy around your ED is an important step towards healing. Sometimes it helps to write down what you want to say if you are anxious about it.\n\nA PhD is an amazing accomplishment! You should be so proud. I can see how binging and purging would feel disheartening to you. Even with all the education and knowledge you have, eating disorders are not rational. Binge urges are especially powerful, and it takes a lot of tools and practice to break them. You might be interested in this podcast called \"Binge Breakers.\" It has helped me a lot and it's free.\n\nI'm always happy when I can help someone, even in a small way. Sending a virtual hug back to you! 🤗 ❤️",
      "created_utc": 1616691095.0,
      "score": 2,
      "context": [
        {
          "id": "gry3z2r",
          "author": "esoterique87",
          "body": "\\*Warning long post\\* This is extremely common and I find sugar to be a huge trigger for me too. I have completely stopped eating sugar because I get an immediate ED response to binge. There are some practical things you can do here in order to break this cycle. Structured Eating, Eat balanced Meals and Accept Delay Distract are from the book 'The Bulimia Help Method' by Ali Kerr & Richard Kerr. This book is a great resource and I highly recommend it.\n\n1. **Reach out.** This is one of the most important parts of recovery. If you don't have a therapist, dietician or coach, I highly recommend seeking professional help. You can recover on your own but if you have support it makes the process so much easier and you feel less alone. If professional help isn't an option then lean on someone you trust who you can contact when you are feeling urges or when you are trying to distract yourself. I'm connecting with my Mom at meals so that I don't binge and purge and it's been very helpful.\n2. **Remove the triggers**. If you find you are out of control around sugar, or any other triggering foods, it's ok to acknowledge this and temporarily stop eating/buying them. Keep them out of sight or better yet, don't buy them. If you order from food apps, delete those apps. Put as much friction between you and the behavior as possible. If you tend to drive to the store to buy binge food, put your keys in an obscure location so that you have to think about what you're doing before you act.\n3. **Structured eating**. Three meals and three snacks a day, no more than three hours apart. Retrain your mind and body to expect food often and regularly. This stabilizes blood sugar and reduces instances of binge urges. When you are well nourished, your body and mind don't have to send out signals to binge. If you are worried about weight gain, keep in mind that eating regularly is one of the best things you can do to maintain a healthy weight as it is a massive boost to your metabolism.\n4.  **Eat balanced meals**. Eat regular meals and snacks made up from fats, proteins and        complex carbohydrates. This will help to stabilize erratic blood sugar levels and in turn reducing those binge urges. I find sticking to whole, mostly unprocessed, low sugar, foods reduces my urge to binge. Nobody really wants to binge on strawberries but strawberry ice-cream is easy to binge on. Pick foods that feel safe to you and the least triggering.\n5. **Accept Delay Distract.** We can't control the fact that we get binge urges because of how our brains are wired to do this behavior. We can control how we respond to those urges. Accept the urge and remind yourself that the binge urge cannot control you, it is not dangerous and does not have to be fought.Delay taking any action towards your urge for 10 minutes and allow the urge to rise and fall. Distract yourself for those 10 minutes. Go for a walk, go for a drive, have a bath, talk to a friend, listen to music, immerse yourself in a project, work or play on your computer. Anything to distract you from those urges will help.\n\nI know how helpless and miserable you can feel in a binge/purge cycle. You are not alone and so many people are going through this right now. I hope even a little of this information was helpful and I'm sending lots of love and support your way ❤️",
          "created_utc": 1616518239.0
        },
        {
          "id": "gs4udtt",
          "author": "rghaddar",
          "body": "THANK YOU SO SO MUCH!! I want to print this and put it on my wall for when I'm really in sugar binge mode. So many great and important suggestions, and even though we always hear them scattered, having them together like this was so helpful. Thank you so much for the book recommendation as well! I'll look into it for sure. \n\nI have a therapist but for some reason can't get myself to bring up disordered eating with her even though she's AWESOME. I really need to do it though!! Worst part of all of this is that my degree is in nutrition and dietetics and I'm almost done with PhD in nutritional sciences so I know exactly what I need to do and have access to so many resources and information but can't get myself to do it when the binge hits :( not a good feeling\n\nI really love and appreciate your wonderful suggestions and ideas and thank you for taking the time to write this comment out <3 it is so helpful. Big virtual hugs to you!!",
          "created_utc": 1616645085.0
        }
      ]
    },
    {
      "id": "gs7zne5",
      "author": "rghaddar",
      "body": "Thank you!! <3 you're amazing! I'll be sure to check out the podcast.",
      "created_utc": 1616708240.0,
      "score": 1,
      "context": [
        {
          "id": "gry3z2r",
          "author": "esoterique87",
          "body": "\\*Warning long post\\* This is extremely common and I find sugar to be a huge trigger for me too. I have completely stopped eating sugar because I get an immediate ED response to binge. There are some practical things you can do here in order to break this cycle. Structured Eating, Eat balanced Meals and Accept Delay Distract are from the book 'The Bulimia Help Method' by Ali Kerr & Richard Kerr. This book is a great resource and I highly recommend it.\n\n1. **Reach out.** This is one of the most important parts of recovery. If you don't have a therapist, dietician or coach, I highly recommend seeking professional help. You can recover on your own but if you have support it makes the process so much easier and you feel less alone. If professional help isn't an option then lean on someone you trust who you can contact when you are feeling urges or when you are trying to distract yourself. I'm connecting with my Mom at meals so that I don't binge and purge and it's been very helpful.\n2. **Remove the triggers**. If you find you are out of control around sugar, or any other triggering foods, it's ok to acknowledge this and temporarily stop eating/buying them. Keep them out of sight or better yet, don't buy them. If you order from food apps, delete those apps. Put as much friction between you and the behavior as possible. If you tend to drive to the store to buy binge food, put your keys in an obscure location so that you have to think about what you're doing before you act.\n3. **Structured eating**. Three meals and three snacks a day, no more than three hours apart. Retrain your mind and body to expect food often and regularly. This stabilizes blood sugar and reduces instances of binge urges. When you are well nourished, your body and mind don't have to send out signals to binge. If you are worried about weight gain, keep in mind that eating regularly is one of the best things you can do to maintain a healthy weight as it is a massive boost to your metabolism.\n4.  **Eat balanced meals**. Eat regular meals and snacks made up from fats, proteins and        complex carbohydrates. This will help to stabilize erratic blood sugar levels and in turn reducing those binge urges. I find sticking to whole, mostly unprocessed, low sugar, foods reduces my urge to binge. Nobody really wants to binge on strawberries but strawberry ice-cream is easy to binge on. Pick foods that feel safe to you and the least triggering.\n5. **Accept Delay Distract.** We can't control the fact that we get binge urges because of how our brains are wired to do this behavior. We can control how we respond to those urges. Accept the urge and remind yourself that the binge urge cannot control you, it is not dangerous and does not have to be fought.Delay taking any action towards your urge for 10 minutes and allow the urge to rise and fall. Distract yourself for those 10 minutes. Go for a walk, go for a drive, have a bath, talk to a friend, listen to music, immerse yourself in a project, work or play on your computer. Anything to distract you from those urges will help.\n\nI know how helpless and miserable you can feel in a binge/purge cycle. You are not alone and so many people are going through this right now. I hope even a little of this information was helpful and I'm sending lots of love and support your way ❤️",
          "created_utc": 1616518239.0
        },
        {
          "id": "gs4udtt",
          "author": "rghaddar",
          "body": "THANK YOU SO SO MUCH!! I want to print this and put it on my wall for when I'm really in sugar binge mode. So many great and important suggestions, and even though we always hear them scattered, having them together like this was so helpful. Thank you so much for the book recommendation as well! I'll look into it for sure. \n\nI have a therapist but for some reason can't get myself to bring up disordered eating with her even though she's AWESOME. I really need to do it though!! Worst part of all of this is that my degree is in nutrition and dietetics and I'm almost done with PhD in nutritional sciences so I know exactly what I need to do and have access to so many resources and information but can't get myself to do it when the binge hits :( not a good feeling\n\nI really love and appreciate your wonderful suggestions and ideas and thank you for taking the time to write this comment out <3 it is so helpful. Big virtual hugs to you!!",
          "created_utc": 1616645085.0
        },
        {
          "id": "gs6uvcx",
          "author": "esoterique87",
          "body": "I'm so glad this has helped! It sounds like you are ready to take action and steps toward recovery. I do hope you bring it up to your therapist, removing the shame and secrecy around your ED is an important step towards healing. Sometimes it helps to write down what you want to say if you are anxious about it.\n\nA PhD is an amazing accomplishment! You should be so proud. I can see how binging and purging would feel disheartening to you. Even with all the education and knowledge you have, eating disorders are not rational. Binge urges are especially powerful, and it takes a lot of tools and practice to break them. You might be interested in this podcast called \"Binge Breakers.\" It has helped me a lot and it's free.\n\nI'm always happy when I can help someone, even in a small way. Sending a virtual hug back to you! 🤗 ❤️",
          "created_utc": 1616691095.0
        }
      ]
    }
  ]
}