{
  "id": "mfhqkt",
  "subreddit": "bulimia",
  "author": "recoveringfrogx",
  "created_utc": 1616992404.0,
  "title": "Pasta stuck up my nose",
  "selftext": "I had a huge binge on pasta and getting it up was more aggressive than usual. I felt a pasta go up my nose and it felt like it was in my brain and I tried for a good 10 minutes to blow it out and out flew the whole ass penne pasta from my nose.\nI’m so happy I don’t have to go to ER because how the hell could I explain this one..\nAnyway will I stop? No:(",
  "url": "https://www.reddit.com/r/bulimia/comments/mfhqkt/pasta_stuck_up_my_nose/",
  "score": 82,
  "num_comments": 9,
  "comments": [
    {
      "id": "gsojcug",
      "author": "Vicariouslylivin",
      "body": "Pasta is horrible like that, so slippery! Iv had spaghetti stuck in my mouth through to my nose. Absolutely disgusting. You almost have an outer body experience and think....’what am I doing with my life’ 😂",
      "created_utc": 1617021656.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gsobv8u",
      "author": "lalaloui22",
      "body": "Mate one time I felt my jaw pop out a bit because my whole ass hand was down my throat and I s2g my life flashed before my eyes. Would've had to go to hospital at 1am and tell them that I took like, a really big bite of an apple? \n\nHoly shit though, bet it felt good snorking it out of your nose.",
      "created_utc": 1617016435.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gsoctcv",
      "author": "pineconedead",
      "body": "Once i was trying to purge ginger (don't even ask me why) and it felt like my mouth nose and head were on flames, I do not recommend!!\n\nBtw I'm joking about this but it's actually a serious illness and I hope one day we'll make it out of this😥",
      "created_utc": 1617017185.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gspemhm",
      "author": "Elllliiiizzzaabeth",
      "body": "I’ve had this happen to me so many times lol we are one and the same! I get COVID tested like 3x a week for school and I’m so worried my swab is gonna end up with a noodle on the end of it 😂",
      "created_utc": 1617037076.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gsqe2zw",
      "author": "GaryTheSnailll75",
      "body": "When I eat a salad wrap, ya know, to be healthy... and then spend 20 minutes blowing lettuce out of my nose. This is fine.",
      "created_utc": 1617053287.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gsoiynd",
      "author": "TheFunkFox",
      "body": "Why doesn’t anyone else plug their nose???",
      "created_utc": 1617021421.0,
      "score": -4,
      "context": []
    },
    {
      "id": "gsut0rz",
      "author": "Renmeya",
      "body": "Fuck it's so painful when this happens , I swear today I didn't think a piece of ham THAT big could exit out my nose until I had to, I think I could have got it back down to my throat had I sniffed inwards but for me at least that feels even worse :/ \n\nIt's definitely gross when this happens :/",
      "created_utc": 1617145567.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsqe97j",
      "author": "GaryTheSnailll75",
      "body": "That’s actually a really good idea, don’t know why my last brain cell didn’t come up with that...",
      "created_utc": 1617053370.0,
      "score": 1,
      "context": [
        {
          "id": "gsoiynd",
          "author": "TheFunkFox",
          "body": "Why doesn’t anyone else plug their nose???",
          "created_utc": 1617021421.0
        }
      ]
    }
  ]
}