{
  "id": "mge6x2",
  "subreddit": "bulimia",
  "author": "tosee6",
  "created_utc": 1617105082.0,
  "title": "It’s. So. Addicting.",
  "selftext": "I’ve been addicted to drugs my whole life and for a long period I was addicted to meth, yes I’m comparing bulimia to meth. \nI remember when I was in addiction I would always say I’m gonna go big tonight but tomorrow I’m taking a break or I’m done and I’m in the exact same pattern with bulimia. It’s wild, I’ve only recently started binge/ purging daily And I’m already in a toxic cycle.  once again I’m going big tonight and quitting tomorrow... sure",
  "url": "https://www.reddit.com/r/bulimia/comments/mge6x2/its_so_addicting/",
  "score": 126,
  "num_comments": 14,
  "comments": [
    {
      "id": "gsskmz3",
      "author": "serendipia1984",
      "body": "Yes. Yes. Oh my god. I've been hooked on meth. I've been hooked on benzos. I've drunk A LOT. But affortunately, I've come clean from all of that.  Yes I even was able to put down weed for some time.\nBut, bulimia.... I can't say the same. Rn I am in a 8 day no b/p streak, but normally I am purging x3 times a day. Its fucking hell man",
      "created_utc": 1617107379.0,
      "score": 48,
      "context": []
    },
    {
      "id": "gstf1an",
      "author": "sp-1213",
      "body": "I was anorexic (then bulimic) as a teen, addicted to adderall in my early 20s, and now i’m back to anorexia in my late 20s. It’s tough but incredibly common to have a drug addiction and an ED.",
      "created_utc": 1617122244.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gssuk3w",
      "author": "beesbutterandflies",
      "body": "Just started therapy with a psychiatrist specialised in addictions who never had an ED patient before. Only went a couple of times but the similarities in both illnesses are astonishing.",
      "created_utc": 1617112854.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gstlphj",
      "author": "None",
      "body": "An ED and a drug addiction are almost the same imo, the difference is you don't need drugs to live but you do need food :/",
      "created_utc": 1617125218.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gssz6vk",
      "author": "esoterique87",
      "body": "I've never had a drug problem but I have definitely experienced the addictive nature of bulimia. I found it especially addictive when I was ritualizing the behavior and going out to buy binge food, which is usually highly palatable, salty, sugary, fatty foods that give you a big dopamine hit. I've heard other people talk about having addictions and Eds and in a lot of cases ED's can be harder to treat because you can't abstain from food. I'm sorry you're struggling and I hope you can get some help and break out of this cycle soon ❤️",
      "created_utc": 1617115101.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gsut3k6",
      "author": "elpintor91",
      "body": "The cravings, the secrets, the hiding in the bathroom coming out a bit different, getting a high after the release of food, promising to quit, promising just one more time or only on special occasions... \n\nYeah it’s pretty similar to a drug addiction. Food is a drug to a lot of people in many ways.",
      "created_utc": 1617145607.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gstpye2",
      "author": "None",
      "body": "I would say it's even more addicting than drugs. Or at least for me it is",
      "created_utc": 1617127129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gstzou0",
      "author": "SelectBeyond5514",
      "body": "This!! I’ve been binging the past 3 days and i just keep saying I’ll wake up tomorrow and do better and it’ll b fine. I’ve said that everyday for the past 3 days. I’ve said the same thing about smoking weed for the past idk how many years. It’ can really get hard.",
      "created_utc": 1617131513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gssx7g8",
      "author": "Glittering-Cod5256",
      "body": "I read that is actually common to have a drug addiction and or drinking problem and having an Ed specifically bulimia, I drank so heavily before I mean I had a bottle of whiskey in my room at all times and used to live the feeling of dehydration crazy thing to explain and was prescribed a benzodiazepine so all that combined with bulimia and  taking appetite suppressors guess I’m lucky to be alive, stopped drinking year back I still do occasionally but drinking runs in my family so.. bezos last year that was haaardd appetite s. Where hard to come by since they are very very dangerous, i believe they’re link to heart attacks and lastly I’m kickings bulimia that’s probably the hardest one , hang in there our brains might be wired differently but it’s possible to quit",
      "created_utc": 1617114159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gssxh25",
      "author": "Narwhal_Songs",
      "body": "Yes, gosh it really is",
      "created_utc": 1617114286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsyee05",
      "author": "ShySchemingGorgon",
      "body": "I can quit drugs.  I can't quit food.  I need to be free of my addiction but I also need it to live.  It sucks.",
      "created_utc": 1617222906.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gssle7b",
      "author": "tosee6",
      "body": "It really sneaks up on you huh. Btw 8 day’s!!!! I’m so happy for you that’s such a big accomplishment ❤️",
      "created_utc": 1617107849.0,
      "score": 19,
      "context": [
        {
          "id": "gsskmz3",
          "author": "serendipia1984",
          "body": "Yes. Yes. Oh my god. I've been hooked on meth. I've been hooked on benzos. I've drunk A LOT. But affortunately, I've come clean from all of that.  Yes I even was able to put down weed for some time.\nBut, bulimia.... I can't say the same. Rn I am in a 8 day no b/p streak, but normally I am purging x3 times a day. Its fucking hell man",
          "created_utc": 1617107379.0
        }
      ]
    },
    {
      "id": "gsx1bxr",
      "author": "None",
      "body": "I absolutely agree and relate to this statement",
      "created_utc": 1617200511.0,
      "score": 3,
      "context": [
        {
          "id": "gstlphj",
          "author": "None",
          "body": "An ED and a drug addiction are almost the same imo, the difference is you don't need drugs to live but you do need food :/",
          "created_utc": 1617125218.0
        }
      ]
    },
    {
      "id": "gsvesdd",
      "author": "acoh97",
      "body": "And there's so many different highs that you get from it: the high from the dopamine hit from the food, the high from the relief of emptiness after purging, the high from the numbness you get during a binge (that's what is really hard to kick for me), the high from restriction, the high from seeing numbers drop from restriction, the high from feeling in control through restriction and the lack of control when bingeing, etc. etc.",
      "created_utc": 1617157280.0,
      "score": 8,
      "context": [
        {
          "id": "gstpye2",
          "author": "None",
          "body": "I would say it's even more addicting than drugs. Or at least for me it is",
          "created_utc": 1617127129.0
        }
      ]
    }
  ]
}