{
  "id": "mmz73s",
  "subreddit": "bulimia",
  "author": "KnownCherry8",
  "created_utc": 1617909399.0,
  "title": "my mom doesn’t care how short my skirts are now that i lost weight. that kind of hurts. she must’ve thought i was gross before.",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/mmz73s/my_mom_doesnt_care_how_short_my_skirts_are_now/",
  "score": 105,
  "num_comments": 11,
  "comments": [
    {
      "id": "gtv4jhl",
      "author": "Eastern_Yam_5975",
      "body": "Yeah part of the reason why I (as someone with an ED) wouldn’t wanna be a mom is because I know I would directly think of my kid’s worth and self worth as related to their weight.",
      "created_utc": 1617920445.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gtuutst",
      "author": "rissispissed",
      "body": "If it helps at all, as a mother with an eating disorder, she's probably just projecting on you. I highly doubt she's grossed out, but I think a lot of moms end up trying to soften the blow of societal expectations by making sure no one has anything to make fun of you for. That doesn't make it mildly okay, but sometimes maternal feelings get mixed in with your own bad experiences, if you get what I mean? I'm sorry to hear that though. Again, that's not okay at all and I'm not trying to make excuses.",
      "created_utc": 1617916033.0,
      "score": 42,
      "context": []
    },
    {
      "id": "gtuql6e",
      "author": "sad-eggrice",
      "body": "My mom was like that with literally everything I wore, skirts, crop tops,shorts. She would make me wear long shirts to cover my butt now she doesn't care if I'm wearing tight pants and short shirts. Now that you've pointed it out, I do feel my mother was grossed out with me. That's sad asf",
      "created_utc": 1617914191.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gtupb7j",
      "author": "waterandicethrowaway",
      "body": "My mom was like that with crop tops lol",
      "created_utc": 1617913642.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gtv1r5e",
      "author": "Conscious-Ad2664",
      "body": "my mother did the same with all tight or revealing clothing",
      "created_utc": 1617919152.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gtv8g7e",
      "author": "None",
      "body": "That doesn’t necessarily mean she thought you were gross, but sadly it’s way more sexualized to have bigger tits/ass etc.",
      "created_utc": 1617922341.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gtx85rb",
      "author": "Vicariouslylivin",
      "body": "No, part of the reason you probably developed an eating disorder was because of your mother and the example she set....if you had a independent, confident and self assured mother she would have told u before the weight loss that you looked fierce and that you don’t have to be thin to wear one! AND you probably would have felt loved just as you are, and not developed an E.D. #sorry #notsorry\nMy daughter is a bigger girl and she regularly looks amazing, and I feel so proud of her when she rocks what she wants to wear!! I didn’t get this treatment when I was young but she will never feel unpretty around me. Not one day!!! That’s my unspoken promise to her. She is fucking gorgeous!",
      "created_utc": 1617970988.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gtvjsch",
      "author": "Xlittleon3",
      "body": "I felt this post a lot.",
      "created_utc": 1617928147.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtw4j2m",
      "author": "ren410",
      "body": "This is why I am how I am.",
      "created_utc": 1617939334.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gtx8cim",
      "author": "Vicariouslylivin",
      "body": "This doesn’t say anything about how we look/looked, it says more about the mothers out there!! What the flying fuck is going on out here?",
      "created_utc": 1617971096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gtxb7x2",
      "author": "waterweightwatchers",
      "body": "My mom did this too :/",
      "created_utc": 1617972723.0,
      "score": 3,
      "context": []
    }
  ]
}