{
  "id": "mnvol5",
  "subreddit": "bulimia",
  "author": "AmeliaStoner",
  "created_utc": 1618019723.0,
  "title": "Does anyone else feel like any food at all is a binge?",
  "selftext": "I've been bullemic for ages, but it's mainly the purging to me, a binge is eating an amount if food a normal person would at a meal time.\nI don't eat much at all, but when I do most of the time I purge because I feel guilty for eating anything at all.\n\nIf I snack on pretzels, and have a piece or two of chocolate, then eat a meal(a smaller portion size than my much smaller partner) then I feel like I have to purge.\n\nI used to binge a little more, I'd eat a little over \"normal\" and feel so bad I'd purge.\n\nBut now I barely eat, but still feel like I have to purge for eating anything at all.\nI end up having protein mix and almond milk to make sure my body dies, but most days I don't keep down really any food at all.\n\nIt's hell on my body but I don't know how to stop. I don't feel I deserve to eat. I feel so fat and disgusting even though I lost 40lbs from stress a year ago and the only weight I gained back was 5-10lbs that I lost when I was so sick I literally couldn't eat for weeks from GI system inflammation.\n\nI know I'm ruining my body. But am I even bulle.ic if i don't really binge? I'm not anorexic because I do eat some(much less than normal but still) but it just comes up so I feel like I don't fit in any community.",
  "url": "https://www.reddit.com/r/bulimia/comments/mnvol5/does_anyone_else_feel_like_any_food_at_all_is_a/",
  "score": 111,
  "num_comments": 12,
  "comments": [
    {
      "id": "gu0cb2c",
      "author": "tired_ass_biatch",
      "body": "I feel that way too, anything that goes in your mouth no matter how much, feels like a binge to me and that sucks cuz I don't really binge",
      "created_utc": 1618026403.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gu1ens0",
      "author": "LeeesaBean",
      "body": "Yea. I'm realizing on my \"binge days\", even tho I feel out of control, my total cals still don't go above 1700 usually. Years ago, I would eat 10,000+ on a binge, so this is a new phase that I find a lot more stressful honestly. I am way more preoccupied with regular food, and am realizing my \"safe list\" is about 4 items long. I can't afford treatment, or more so, I can't afford leaving my family and job for treatment. I feel completely stuck.",
      "created_utc": 1618059583.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gu0pd2m",
      "author": "heartbreakheiress",
      "body": "This is called purging anorexia. I was diagnosed with this a few years back. In simple terms it means that you starve yourself often and when you do give in and eat you have the self control to not let yourself go into a full blown binge. But even with a small/normal portion you feel guilty enough to purge it up.",
      "created_utc": 1618036288.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gu0zqdh",
      "author": "secksOrGTFOplz",
      "body": "If I eat a piece of lettuce I wanna purge . It takes so much out of me mentally to eat a tiny salad with no dressing and not purge.",
      "created_utc": 1618046473.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gu1c03s",
      "author": "paintedidiot",
      "body": "not exactly like that because i definitely have big binges but i always feel the need to purge no matter how much i ate",
      "created_utc": 1618057741.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu18zz8",
      "author": "sweet_ging",
      "body": "I can’t relate this this anymore!!!! Like oh “I had 3 rice cakes with the littlest bit of peanut butter and sugar- free jelly... it’s a binge” . I’m happy ive stopped purging as much though, I’m really coping with things a lot better than I have in the past.",
      "created_utc": 1618055475.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu22zi9",
      "author": "brttbrtt",
      "body": "Yes yes yes. My friends don't get this when I talk about purging, they think I go on out of control binges. I feel like I have control over food and portion. But I literally can't even stomach have one meal / feeling full at all. The only \"safe\" snacks are fruits or applesauce or smoothies as a meal. This is so unsustainable yet I don't see it changing for me.",
      "created_utc": 1618072650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu0up9h",
      "author": "lapetitepapillon",
      "body": "Absolutely, I’m sorry you feel that way too",
      "created_utc": 1618041357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7bdypx",
      "author": "anonymouspony2",
      "body": "I definitely feel like this. A while back, I had days where I gave in to some food and thought they were binges. I remember my first \"binge\" being 449 calories. But now  I binge and purge 2,000+ calories sometimes. Other times, I eat like two crackers and four chips and think it is a binge, and I must go throw it up.",
      "created_utc": 1627827725.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gu0pgka",
      "author": "AmeliaStoner",
      "body": "Thank you, it helps having a name for it.",
      "created_utc": 1618036377.0,
      "score": 5,
      "context": [
        {
          "id": "gu0pd2m",
          "author": "heartbreakheiress",
          "body": "This is called purging anorexia. I was diagnosed with this a few years back. In simple terms it means that you starve yourself often and when you do give in and eat you have the self control to not let yourself go into a full blown binge. But even with a small/normal portion you feel guilty enough to purge it up.",
          "created_utc": 1618036288.0
        }
      ]
    },
    {
      "id": "gu0povu",
      "author": "heartbreakheiress",
      "body": "You're very welcome. I've struggled with this exactly so I'd you need any advice, or words of wisdom, just message me. Good luck, love",
      "created_utc": 1618036585.0,
      "score": 4,
      "context": [
        {
          "id": "gu0pd2m",
          "author": "heartbreakheiress",
          "body": "This is called purging anorexia. I was diagnosed with this a few years back. In simple terms it means that you starve yourself often and when you do give in and eat you have the self control to not let yourself go into a full blown binge. But even with a small/normal portion you feel guilty enough to purge it up.",
          "created_utc": 1618036288.0
        },
        {
          "id": "gu0pgka",
          "author": "AmeliaStoner",
          "body": "Thank you, it helps having a name for it.",
          "created_utc": 1618036377.0
        }
      ]
    },
    {
      "id": "gu0pwp4",
      "author": "AmeliaStoner",
      "body": "Thank you <3<3 If you have any advice on programs or like.. drs to go to I'd love any advice I can get. I know I need to change, I'm having serious health issues and this is making them so much worse, but my body dysphoria is so bad it's hard to stop x.x",
      "created_utc": 1618036778.0,
      "score": 4,
      "context": [
        {
          "id": "gu0pd2m",
          "author": "heartbreakheiress",
          "body": "This is called purging anorexia. I was diagnosed with this a few years back. In simple terms it means that you starve yourself often and when you do give in and eat you have the self control to not let yourself go into a full blown binge. But even with a small/normal portion you feel guilty enough to purge it up.",
          "created_utc": 1618036288.0
        },
        {
          "id": "gu0pgka",
          "author": "AmeliaStoner",
          "body": "Thank you, it helps having a name for it.",
          "created_utc": 1618036377.0
        },
        {
          "id": "gu0povu",
          "author": "heartbreakheiress",
          "body": "You're very welcome. I've struggled with this exactly so I'd you need any advice, or words of wisdom, just message me. Good luck, love",
          "created_utc": 1618036585.0
        }
      ]
    }
  ]
}