{
  "id": "moyjzd",
  "subreddit": "bulimia",
  "author": "Notreallysurebutidc",
  "created_utc": 1618172566.0,
  "title": "I mean this in the kindest way.. but this group can be very regressive regarding recovery.",
  "selftext": "I a 100% believe that this is supposed to be a safe space where you can say what you think unfiltered. When having an eating disorder it’s so isolating that a online group might be the only comforting thing but...\n\n\nI’ve noticed that some post almost seem pro-bulimic, not in the obvious ways but in those slight ways of almost “encouraging” or triggering people. I just wanted to say to people that are actively recovering or just in general to people:\n\nDon’t read all the posts if you can’t handle it. There’s a lot of triggering stuff and some people can handle it some can’t. Some people mention trigger words, or something that can make you relapse (if you’re recovering) or install that “competition” mentally. Please take care of yourself and remove yourself if you’re not strong enough. For your own sake. \n\nI just want us to take care of each other. There’s no one who’s going to understand the pain we have gone through and go through everyday than these people right here. Stay safe friends. I love you all individually.",
  "url": "https://www.reddit.com/r/bulimia/comments/moyjzd/i_mean_this_in_the_kindest_way_but_this_group_can/",
  "score": 143,
  "num_comments": 30,
  "comments": [
    {
      "id": "gu74fcj",
      "author": "avadamaris",
      "body": "can you give an example of the kind of posts you’re talking about? i speak fairly specifically about bulimic behavior but i’ve never purposely encouraged it (i used to in the past) \nbut i would just like to know what sort of things your referring to so that i don’t end up triggering anyone, the last thing i wanna do is hinder someone else’s recovery",
      "created_utc": 1618183563.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gu6wbg6",
      "author": "doppppy",
      "body": "Definitely I just joined the sub and a lot of it doesn’t seem progressive but rather possibly triggering but maybe this is a way people are expressing themselves/using as an outlet about there experiences",
      "created_utc": 1618179128.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gu6wqq5",
      "author": "Nicola-wonderwoman",
      "body": "Thank you so much, so much love for you💜 I’m here to get support and encouragement to get better from bulimia b/p and sometimes it’s so triggering on here,so thank you for reaching out; it means a lot 💜",
      "created_utc": 1618179354.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gu73qhf",
      "author": "Tuca1225",
      "body": "I totally agree, maybe there should be a separate r/ for venting or triggers or something like that. I actually don't mind the venting part cause everyone needs to get stuff out of their chests once in a while, but there's stuff that's really triggering, and some comments are supporting those behaviours instead of supporting the mind of the person and giving them options or something to reflect on. Otherwise, everyone here is to support the other, learn and feel company so I think it's something that will evolve for the better in the future",
      "created_utc": 1618183177.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gu7j2ym",
      "author": "presenttennse",
      "body": "Honestly thanks so much for this post",
      "created_utc": 1618191668.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gu7wz9z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618199664.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gu7bp9z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618187665.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gu97ixo",
      "author": "GrilledRaccoon",
      "body": "I agree. The attitude of this sub of a whole is not very recovery-oriented.",
      "created_utc": 1618236421.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gu78ts2",
      "author": "None",
      "body": "I also would like examples of the almost pro posts your talking about cause I'm not sure what your mean and don't want to create these posts myself. And I've never come across subtle pro bulimia stuff myself.",
      "created_utc": 1618186109.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu8abh4",
      "author": "Narwhal_Songs",
      "body": "I hope I haven't been triggering people lately... im pretty bad in it right now and have been venting some on here and over at r/EDAnonymous. I do however often feel weird/somewhat triggered in the general ED venting subs (like EDA),  with so many anorexic people writing posts on how they avoid eating, when my problem is rather the opposite these days. Here I feel more understood.",
      "created_utc": 1618210249.0,
      "score": 3,
      "context": []
    },
    {
      "id": "guaegmi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618255503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gu72sne",
      "author": "goldenmantella",
      "body": "I don't think that's the intention of most people here, but I have noticed what you mean. I think it's because a lot of us don't have therapists and Reddit is the only forum where we're free to vent about ED issues. Also, I think another more significant contributing factor could be due to more and more proana/mia sites getting shut down. Many of them had pro-recovery spaces, and now that the sites are gone, the people who  utilized them- 1. those who knew they had a problem, not necessarily professionally diagnosed, weren't ready for recovery, and just wanted social support, and 2. those who were diagnosed and actively in recovery- are flocking here to Reddit. Reddit ED forums have as a result become an all-in-one inclusive space, and because of the layout of the subtopics here, we can't filter triggering or safe categories by subject like a lot of the proana/mia sites did. I'm not going to get into a debate on whether or not proana/mia sites should exist, because that's neither here nor there.",
      "created_utc": 1618182654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gu8irjn",
      "author": "Notreallysurebutidc",
      "body": "I just want to start of by saying that don’t feel like you can’t express yourself because I said all that. I think the line between encouraging someone and thinking that you’re helping/relating to someone can be thin.\n\nmentioning binging and purging in example!!!!\nCouldn’t find many examples but one person was talking about how they had binged and physically couldn’t purge it. One person in the comment mentioned they didn’t want to encourage it but recommended a drink that would help them throw up. \n\nI completely understand that the OP felt terrible and the comment wanted to help them to feel better but I feel like some stuff can come of as triggering to someone stumbling across it or the OP(s). I think that you can relate to whoever you want, express however you want but not to forget that telling someone “same” versus saying “I did this to make myself throw up” is two different things. I really wish you all luck and I think try to do everything with right intentions and it will go well. I hope this doesn’t make you feel like you have to censor yourself though (:",
      "created_utc": 1618218819.0,
      "score": 9,
      "context": [
        {
          "id": "gu74fcj",
          "author": "avadamaris",
          "body": "can you give an example of the kind of posts you’re talking about? i speak fairly specifically about bulimic behavior but i’ve never purposely encouraged it (i used to in the past) \nbut i would just like to know what sort of things your referring to so that i don’t end up triggering anyone, the last thing i wanna do is hinder someone else’s recovery",
          "created_utc": 1618183563.0
        }
      ]
    },
    {
      "id": "gub7q3p",
      "author": "None",
      "body": "Also saw a post the other day where the comments sections was giving advice on how to purge with no hands",
      "created_utc": 1618269375.0,
      "score": 2,
      "context": [
        {
          "id": "gu74fcj",
          "author": "avadamaris",
          "body": "can you give an example of the kind of posts you’re talking about? i speak fairly specifically about bulimic behavior but i’ve never purposely encouraged it (i used to in the past) \nbut i would just like to know what sort of things your referring to so that i don’t end up triggering anyone, the last thing i wanna do is hinder someone else’s recovery",
          "created_utc": 1618183563.0
        }
      ]
    },
    {
      "id": "gu8fgs8",
      "author": "Notreallysurebutidc",
      "body": "Yeah exactly, I don’t want to say to people they can express themselves because obviously this is the only way they can do it without judgment. But I don’t recommend this for people who are easily triggered. I hope you can feel comfortable and not triggered while in this sub (:",
      "created_utc": 1618215387.0,
      "score": 4,
      "context": [
        {
          "id": "gu6wbg6",
          "author": "doppppy",
          "body": "Definitely I just joined the sub and a lot of it doesn’t seem progressive but rather possibly triggering but maybe this is a way people are expressing themselves/using as an outlet about there experiences",
          "created_utc": 1618179128.0
        }
      ]
    },
    {
      "id": "gu8fjt9",
      "author": "Notreallysurebutidc",
      "body": "Of course, it’s so lonely when having an eating disorder so I’m definitely with you there. I hope you get better soon and my dms are always open!! So please if you ever feel lonely or need encouragement/support don’t hesitate to write to me. All luck to you love 🧡",
      "created_utc": 1618215476.0,
      "score": 5,
      "context": [
        {
          "id": "gu6wqq5",
          "author": "Nicola-wonderwoman",
          "body": "Thank you so much, so much love for you💜 I’m here to get support and encouragement to get better from bulimia b/p and sometimes it’s so triggering on here,so thank you for reaching out; it means a lot 💜",
          "created_utc": 1618179354.0
        }
      ]
    },
    {
      "id": "gu8fqz2",
      "author": "Notreallysurebutidc",
      "body": "Definitely agree with everything you said, I agree with a separate r/ but I think it’s easier for people to come over here since they can guarantee a response. I love to see when people vent and get support but as you said some comments can unintentionally support that behaviour. I definitely think people are here only for help and to relate to others i just want people to make sure they’re not destroying themselves or others because they’re not well enough to handle it. I’ve seen so much love, support, encouragement towards me and others on this sub but I know like just every other community it can be accidentally triggering. Still love this group and think it’s amazing for people struggling or going through recovery (:",
      "created_utc": 1618215685.0,
      "score": 3,
      "context": [
        {
          "id": "gu73qhf",
          "author": "Tuca1225",
          "body": "I totally agree, maybe there should be a separate r/ for venting or triggers or something like that. I actually don't mind the venting part cause everyone needs to get stuff out of their chests once in a while, but there's stuff that's really triggering, and some comments are supporting those behaviours instead of supporting the mind of the person and giving them options or something to reflect on. Otherwise, everyone here is to support the other, learn and feel company so I think it's something that will evolve for the better in the future",
          "created_utc": 1618183177.0
        }
      ]
    },
    {
      "id": "gu8iy36",
      "author": "Notreallysurebutidc",
      "body": "Of course, it’s important to make clear that we all are in this together but not to drive each other further into the eating disorder. (:",
      "created_utc": 1618219006.0,
      "score": 2,
      "context": [
        {
          "id": "gu7j2ym",
          "author": "presenttennse",
          "body": "Honestly thanks so much for this post",
          "created_utc": 1618191668.0
        }
      ]
    },
    {
      "id": "gu8j469",
      "author": "Notreallysurebutidc",
      "body": "I’m sorry for that... I’m barley active in this group because I’ve been trying to recover for the past year and sometimes this literally makes me feel like relapsing. I encourage you to maybe post if you feel like you need positive support but not to read though some posts because as you said it’s not as positive as it looks like. r/fuckeatingdisorders might be less triggering but I’m not sure. if you feel like you need someone to talk to completely anonymously my dms are always open (:",
      "created_utc": 1618219183.0,
      "score": 4,
      "context": [
        {
          "id": "gu7wz9z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618199664.0
        }
      ]
    },
    {
      "id": "gu8iuym",
      "author": "Notreallysurebutidc",
      "body": "Ahh I think that’s the reason why so many people go over here because it’s extremely active and it just becomes a mess sometimes. r/fuckeatingdisorders is where I usually go. But that’s not for a specific disorder like bulimia but for everyone which also can get messy..",
      "created_utc": 1618218916.0,
      "score": 3,
      "context": [
        {
          "id": "gu7bp9z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618187665.0
        }
      ]
    },
    {
      "id": "gu8jcyy",
      "author": "Notreallysurebutidc",
      "body": "I’m so happy that you feel like you’re understood over here. There’s this saying, which can be very harsh, but “people are not responsible for your triggers” so do post whatever you feel like you need to vent about. Though make sure you’re not encouraging people, people have different triggers, some can’t look at some words, some bodies etc so it can be hard balancing that. I feel like it’s important to make sure people in this community \n1) don’t encourage the behaviour\n2) make sure they’re not *intentionally* triggering someone. In the end of the day you cannot control how other people are going to feel when you express your own feelings.",
      "created_utc": 1618219424.0,
      "score": 3,
      "context": [
        {
          "id": "gu8abh4",
          "author": "Narwhal_Songs",
          "body": "I hope I haven't been triggering people lately... im pretty bad in it right now and have been venting some on here and over at r/EDAnonymous. I do however often feel weird/somewhat triggered in the general ED venting subs (like EDA),  with so many anorexic people writing posts on how they avoid eating, when my problem is rather the opposite these days. Here I feel more understood.",
          "created_utc": 1618210249.0
        }
      ]
    },
    {
      "id": "gv05huy",
      "author": "Notreallysurebutidc",
      "body": "Sorry for very late response :\n\nDefinitely don’t think that it is (most) peoples intention when entering this group. I don’t think anyone, except a evil person, would want someone to continue to suffer a awful disease like bulimia, but as someone who’s been through recovery it’s obvious that the ED doesn’t make you think the most logical. Doesn’t mean it’s right to promote bulimia ofc. I understand that this group is a bit confused (the two points/two types of people who’ve joined the community).\n\nI think it’s pretty clear that no one should encourage an eating disorder. There’s a clear difference between venting and encouraging an eating disorder. I myself this week removed myself from this group because it actually made me feel like I wanted to become bulimic again. Doesn’t mean it’s their fault, people have to be able to learn their triggers. I usually recommend venting but not reading through posts if you know you cannot handle it.\n\nps. no need to argue about promia or ana websites but the description of this group is literally “pro recovery” which means no pro bulimia or pro anorexia or pro anything. In the end of the day, my post was made for people who don’t want to become triggered because this isn’t the best place for recovery in general. Thanks for responding to my post! (:",
      "created_utc": 1618776574.0,
      "score": 1,
      "context": [
        {
          "id": "gu72sne",
          "author": "goldenmantella",
          "body": "I don't think that's the intention of most people here, but I have noticed what you mean. I think it's because a lot of us don't have therapists and Reddit is the only forum where we're free to vent about ED issues. Also, I think another more significant contributing factor could be due to more and more proana/mia sites getting shut down. Many of them had pro-recovery spaces, and now that the sites are gone, the people who  utilized them- 1. those who knew they had a problem, not necessarily professionally diagnosed, weren't ready for recovery, and just wanted social support, and 2. those who were diagnosed and actively in recovery- are flocking here to Reddit. Reddit ED forums have as a result become an all-in-one inclusive space, and because of the layout of the subtopics here, we can't filter triggering or safe categories by subject like a lot of the proana/mia sites did. I'm not going to get into a debate on whether or not proana/mia sites should exist, because that's neither here nor there.",
          "created_utc": 1618182654.0
        }
      ]
    },
    {
      "id": "gubkd9l",
      "author": "avadamaris",
      "body": "i see, thanks for the thorough response. for someone to reply with a specific way to induce purging as a 'solution' would definitely be a no-no in this space, i think. i feel like that would constitute as tips, and this isn't really the place to focus on tips for bulimic behavior. i think we've all been there: problem = binged, solution = purge, asap! but continuing to perpetuate that short term way of seeing things, as throwing up as the only means to alleviate discomfort, only keeps us sick, i think. we should as much as possible focus on the emotions behind what we do and why we might be doing them, looking for connections and seeing each b/p episode as a way to learn.\n\ni've definitely been that person, not even long ago, who would focus on the fact that i couldn't purge in that moment, and ask for tips on how to induce purging, and just in general soliciting tips and focusing solely on behaviors. but i think the best thing to do is remember we're all in different stages of recovery, a lot of us are ambivalent, and some are not even willing to change at all. i think the best way to help anyone ay any stage is to remind them that its NOT about weight, you're more than weight, you're more than what you did or didn't eat, you're more than the amount of exercise you did or didn't do, and you deserve kindness, especially from yourself. sorry i kind of went way off on a tangent there lol",
      "created_utc": 1618276006.0,
      "score": 1,
      "context": [
        {
          "id": "gu74fcj",
          "author": "avadamaris",
          "body": "can you give an example of the kind of posts you’re talking about? i speak fairly specifically about bulimic behavior but i’ve never purposely encouraged it (i used to in the past) \nbut i would just like to know what sort of things your referring to so that i don’t end up triggering anyone, the last thing i wanna do is hinder someone else’s recovery",
          "created_utc": 1618183563.0
        },
        {
          "id": "gu8irjn",
          "author": "Notreallysurebutidc",
          "body": "I just want to start of by saying that don’t feel like you can’t express yourself because I said all that. I think the line between encouraging someone and thinking that you’re helping/relating to someone can be thin.\n\nmentioning binging and purging in example!!!!\nCouldn’t find many examples but one person was talking about how they had binged and physically couldn’t purge it. One person in the comment mentioned they didn’t want to encourage it but recommended a drink that would help them throw up. \n\nI completely understand that the OP felt terrible and the comment wanted to help them to feel better but I feel like some stuff can come of as triggering to someone stumbling across it or the OP(s). I think that you can relate to whoever you want, express however you want but not to forget that telling someone “same” versus saying “I did this to make myself throw up” is two different things. I really wish you all luck and I think try to do everything with right intentions and it will go well. I hope this doesn’t make you feel like you have to censor yourself though (:",
          "created_utc": 1618218819.0
        }
      ]
    },
    {
      "id": "gu8kr6o",
      "author": "Nicola-wonderwoman",
      "body": "Thank you. 💜",
      "created_utc": 1618220865.0,
      "score": 4,
      "context": [
        {
          "id": "gu6wqq5",
          "author": "Nicola-wonderwoman",
          "body": "Thank you so much, so much love for you💜 I’m here to get support and encouragement to get better from bulimia b/p and sometimes it’s so triggering on here,so thank you for reaching out; it means a lot 💜",
          "created_utc": 1618179354.0
        },
        {
          "id": "gu8fjt9",
          "author": "Notreallysurebutidc",
          "body": "Of course, it’s so lonely when having an eating disorder so I’m definitely with you there. I hope you get better soon and my dms are always open!! So please if you ever feel lonely or need encouragement/support don’t hesitate to write to me. All luck to you love 🧡",
          "created_utc": 1618215476.0
        }
      ]
    },
    {
      "id": "gubnr8s",
      "author": "nnogales",
      "body": "i've never seen someone be so nice on this app, you're so sweet ♡ . i've been in recovery for years, but i've had a lot of relapses/trouble committing to it, so i will definitely check that other sub out too. thank you for your kindness, and i wish you the best in your recovery too ☆",
      "created_utc": 1618277739.0,
      "score": 2,
      "context": [
        {
          "id": "gu7wz9z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618199664.0
        },
        {
          "id": "gu8j469",
          "author": "Notreallysurebutidc",
          "body": "I’m sorry for that... I’m barley active in this group because I’ve been trying to recover for the past year and sometimes this literally makes me feel like relapsing. I encourage you to maybe post if you feel like you need positive support but not to read though some posts because as you said it’s not as positive as it looks like. r/fuckeatingdisorders might be less triggering but I’m not sure. if you feel like you need someone to talk to completely anonymously my dms are always open (:",
          "created_utc": 1618219183.0
        }
      ]
    },
    {
      "id": "gu8mg9n",
      "author": "Notreallysurebutidc",
      "body": " 🧡🧡",
      "created_utc": 1618222539.0,
      "score": 5,
      "context": [
        {
          "id": "gu6wqq5",
          "author": "Nicola-wonderwoman",
          "body": "Thank you so much, so much love for you💜 I’m here to get support and encouragement to get better from bulimia b/p and sometimes it’s so triggering on here,so thank you for reaching out; it means a lot 💜",
          "created_utc": 1618179354.0
        },
        {
          "id": "gu8fjt9",
          "author": "Notreallysurebutidc",
          "body": "Of course, it’s so lonely when having an eating disorder so I’m definitely with you there. I hope you get better soon and my dms are always open!! So please if you ever feel lonely or need encouragement/support don’t hesitate to write to me. All luck to you love 🧡",
          "created_utc": 1618215476.0
        },
        {
          "id": "gu8kr6o",
          "author": "Nicola-wonderwoman",
          "body": "Thank you. 💜",
          "created_utc": 1618220865.0
        }
      ]
    },
    {
      "id": "guchs5f",
      "author": "Notreallysurebutidc",
      "body": "I appreciate you saying that, thank you (: Recovery sometimes is/feels like the hardest part of the whole disorder “process”. It takes a lot of strength to try to recover again and again, so it says a lot about you my friend. Thank you, hopefully we can and will one day come to the point of full recovery <3",
      "created_utc": 1618297816.0,
      "score": 1,
      "context": [
        {
          "id": "gu7wz9z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618199664.0
        },
        {
          "id": "gu8j469",
          "author": "Notreallysurebutidc",
          "body": "I’m sorry for that... I’m barley active in this group because I’ve been trying to recover for the past year and sometimes this literally makes me feel like relapsing. I encourage you to maybe post if you feel like you need positive support but not to read though some posts because as you said it’s not as positive as it looks like. r/fuckeatingdisorders might be less triggering but I’m not sure. if you feel like you need someone to talk to completely anonymously my dms are always open (:",
          "created_utc": 1618219183.0
        },
        {
          "id": "gubnr8s",
          "author": "nnogales",
          "body": "i've never seen someone be so nice on this app, you're so sweet ♡ . i've been in recovery for years, but i've had a lot of relapses/trouble committing to it, so i will definitely check that other sub out too. thank you for your kindness, and i wish you the best in your recovery too ☆",
          "created_utc": 1618277739.0
        }
      ]
    }
  ]
}