{
  "id": "mqdu43",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1618355099.0,
  "title": "One last time... or not.",
  "selftext": "Does anyone else get this whole “last supper” attitude where you go all out on a huge b/p because from tomorrow you’ll stop and be in control and on top of your intake, but then the next day comes around and you do it all again? \nI don’t know how to break this cycle. Plus I keep getting super fixated on certain foods and can’t stop thinking about them, atm that’s pancakes. I feel crap, I’m exhausted and I don’t know how to regain control. Any advice appreciated. ❤️",
  "url": "https://www.reddit.com/r/bulimia/comments/mqdu43/one_last_time_or_not/",
  "score": 104,
  "num_comments": 17,
  "comments": [
    {
      "id": "gufirkc",
      "author": "SilverBlaze234",
      "body": "Yes, it’s so exhausting and honestly I’m so done with this cycle. What you have to do it start eating consistently. You might not like it but eating enough throughout the day makes it so that you don’t binge. It will take a while but you need to teach your body that you will keep feeding it",
      "created_utc": 1618358170.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gufmfn5",
      "author": "Sea-Smoke-9498",
      "body": "I’m currently in that cycle: I have my food set aside and no one can eat that, only I can. When I run out, my problem is, everything left is everyone else’s so it feels like I’m stealing along with all the food having a binge warning and red flags plastered all over.",
      "created_utc": 1618360087.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gug6mue",
      "author": "TurningToPage394",
      "body": "This hit home. Sending ❤️.",
      "created_utc": 1618370913.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gufvbct",
      "author": "Ok_Butterfly7093",
      "body": "Honestly iv been stuck in a vicious cycle so long and it’s so tiring, and I’m going through a really bad restriction stage which I know will end in a massive binge",
      "created_utc": 1618364681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gufyes2",
      "author": "momsterrock",
      "body": "Yes, exactly the same....Welcome to my world! 😢😢😢",
      "created_utc": 1618366294.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gugzp63",
      "author": "None",
      "body": "Oh yes!!! I remember some months ago after a b/p  I felt so bad that I had written my emotions and how bad I felt on a piece of paper. Like: \"do you remember how bad you felt? Please stop, you can do it\" I put this piece of paper in my room so I could see it every time. Unfortunately it didn't stop me, maybe for just some days.",
      "created_utc": 1618395191.0,
      "score": 5,
      "context": []
    },
    {
      "id": "guflqbr",
      "author": "Vicariouslylivin",
      "body": "Yep, used to do it every other day! And this continued for yeeears",
      "created_utc": 1618359723.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gug8i3k",
      "author": "Narwhal_Songs",
      "body": "yup all the time. every day.",
      "created_utc": 1618372075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "guhmoyd",
      "author": "ren410",
      "body": "That’s it.   That’s the illness.",
      "created_utc": 1618409673.0,
      "score": 3,
      "context": []
    },
    {
      "id": "guh42s3",
      "author": "Demi_Lovato_",
      "body": "maybe because being nailed by a bunch of italian sounds like fun to me",
      "created_utc": 1618398941.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guhcpj1",
      "author": "Bengalija",
      "body": "Same. I've been on my normal diet for months but on Easter my family cooked for me and since I'm already off my routine I went back to b/p cycle. That lasted till yesterday (so 10 days daily b/p). \n\nToday I finally broke the cycle, from today I'm back to my usual diet and I know that I won't be binging again.\n\nWhat helped me is serious talk with myself, going deep in to my brain. Figuring out that I'm actually depressed and lonely right now and I'm just filling that hole with food. Of course I'm still depressed and lonely but from today I won't be a slave of my own stomach.\n\nI remember how awful I feel after a binge. No matter how hard I crave something the craving doesn't feel as bad as purging after a binge.\n\nTry to eat not processed food and cook for yourself. After that just eat while thinking how that food makes you feel. Try to eat in kitchen, not in from of tv. Try to appreciate the healthy food you're eating. Stay strong.",
      "created_utc": 1618404601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guksx84",
      "author": "No-Ad-2624",
      "body": "No matter how much you eat DONT go to bed with the mindset “I’ll just starve tmr” it just feeds into the cycle that you know never works.",
      "created_utc": 1618466906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guhpvfx",
      "author": "tsukimishin",
      "body": "Yessss this lasted for months, I’m 3 days clean now though and still think like this but once you get to a point where you’ve gone longer without b/p than you usually would you’ll hopefully stop thinking like that because you won’t want to break your streak/record",
      "created_utc": 1618411137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gui4ix9",
      "author": "Summer_lovin25",
      "body": "This is me, and it's so exhausting, it just doesn't stop...",
      "created_utc": 1618417534.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gui8yco",
      "author": "Interesting_Repeat44",
      "body": "Yeah that's me literally every day and l am not even sorry for it which is scary tbh. Although sometimes l really put my mind to it and don't bingde for maybe few weeks but than l start over.",
      "created_utc": 1618419452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gugfo2l",
      "author": "Lilbeans17",
      "body": "This is so true! My dietician made me a meal plan and I haven’t binged in weeks. But I know how hard it can be to eat consistently. I struggle with it every single day",
      "created_utc": 1618376939.0,
      "score": 8,
      "context": [
        {
          "id": "gufirkc",
          "author": "SilverBlaze234",
          "body": "Yes, it’s so exhausting and honestly I’m so done with this cycle. What you have to do it start eating consistently. You might not like it but eating enough throughout the day makes it so that you don’t binge. It will take a while but you need to teach your body that you will keep feeding it",
          "created_utc": 1618358170.0
        }
      ]
    },
    {
      "id": "guhk8iw",
      "author": "elphieblue",
      "body": "literally took me years and I gained SO MUCH in the initial 3 months that I slowly lost over a couple years n am not at a new low weight or at least I think it’s a low weight 🎉I haven’t weighed myself but I’ve never felt this skinny looking before n have gotten comments on it too so going off that lol",
      "created_utc": 1618408499.0,
      "score": 3,
      "context": [
        {
          "id": "gufirkc",
          "author": "SilverBlaze234",
          "body": "Yes, it’s so exhausting and honestly I’m so done with this cycle. What you have to do it start eating consistently. You might not like it but eating enough throughout the day makes it so that you don’t binge. It will take a while but you need to teach your body that you will keep feeding it",
          "created_utc": 1618358170.0
        }
      ]
    }
  ]
}