{
  "id": "mqr6u7",
  "subreddit": "bulimia",
  "author": "CocoaButterNice",
  "created_utc": 1618408877.0,
  "title": "I don’t want to binge anymore",
  "selftext": "I don’t want to, yet I still impulse buy binge foods. Every day. It never stops. I’m not in control at all. \n\nI know I am slowly getting better, my binges are smaller than they were and less frequent. I used to b/p up to 20+ times a day and I am down to 2-3 and up to 7 on bad days. I know it’s an improvement but I just want to kick myself in the vagina and say “C’moooooon stop doing this. This is crazy. Insanity, honestly. \n\nSo repetitive,  boring, absurd. I’m in my own food world and it’s gotten worse this pandemic. My girlfriend’s been a huge support for me, I feel like I am disappointing her every time I throw up, but she says I don’t. \n\nIt’s making me cranky in my day-to-day because I am continually annoyed with myself. So in my own head too. Writing this out has helped a little as re-reading some lines makes me cackle, darkly. \n\nCan you relate at all?",
  "url": "https://www.reddit.com/r/bulimia/comments/mqr6u7/i_dont_want_to_binge_anymore/",
  "score": 105,
  "num_comments": 7,
  "comments": [
    {
      "id": "gui46m4",
      "author": "Glittering-Cod5256",
      "body": "Absolutely, recovery is not linear as long as you keep on going and doing your best you will get better ❤️",
      "created_utc": 1618417389.0,
      "score": 12,
      "context": []
    },
    {
      "id": "guix62j",
      "author": "None",
      "body": "Getting out of the cycle is tough. It really is. I highly recommend picking up \"intuitive eating\" book (the latest edition) (DM me for more info on this if you need it).\n\nIve been in BP cycles for the past couple years, and I've relapsed back to my old ways again and again and again. I can say that that book gave me a mindset change. Do i still have bad days? Have I still B/P? Yes, but never in my life have I been so committed to recovery. That book gave me a new perspective on my struggle, one that has helped me choose recovery way more often than I have ever done in my life.",
      "created_utc": 1618430042.0,
      "score": 10,
      "context": []
    },
    {
      "id": "guj4ln6",
      "author": "gulletgod",
      "body": "Can totally relate, it's just like routine I guess?? But so draining, so pointless and dull",
      "created_utc": 1618433298.0,
      "score": 5,
      "context": []
    },
    {
      "id": "guhtvc5",
      "author": "None",
      "body": "I can relate. Especially with impulsively buying binge foods. Idk how much money I’ve spent on a whim for food that I end up throwing away a few days later. In the moment I want it and nothing else will do, and after I binge, I just feel so guilty and gross that I don’t even wanna look at the package. I feel sick about it. It’s overwhelming trying to reason with myself in that moment on whether I need it or not, knowing that I most definitely don’t, and that if I buy it I’ll only be throwing it away anyway. It’s a constant battle in my head that I don’t usually win. Congratulations on your b/p improvements. I’m sure a lot of stress has gone down with it.",
      "created_utc": 1618412919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gul1aj6",
      "author": "None",
      "body": "Absolutely. I’ve been doing this since I was 20...I’m 35. It absolutely comes and goes for me.  During times of high stress it hits pretty badly. I’m sorry I can’t say anything to make it better but just know you aren’t alone. Take it one day at a time.❤️❤️",
      "created_utc": 1618474713.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guk1019",
      "author": "None",
      "body": "You can do it ❤️ it is a great sign that you have made progress to reduce the times of b/p. You are beautiful! I hope you can fight the urge and find another way to cope. I am hopeful for you and your journey ❤️",
      "created_utc": 1618449511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guk140y",
      "author": "None",
      "body": "I relate oh my gosh I spend so much money on food that I eat and just throw up and then I have to get even more because I’m hungry and then it happens over and overrrrrr",
      "created_utc": 1618449569.0,
      "score": 2,
      "context": [
        {
          "id": "guhtvc5",
          "author": "None",
          "body": "I can relate. Especially with impulsively buying binge foods. Idk how much money I’ve spent on a whim for food that I end up throwing away a few days later. In the moment I want it and nothing else will do, and after I binge, I just feel so guilty and gross that I don’t even wanna look at the package. I feel sick about it. It’s overwhelming trying to reason with myself in that moment on whether I need it or not, knowing that I most definitely don’t, and that if I buy it I’ll only be throwing it away anyway. It’s a constant battle in my head that I don’t usually win. Congratulations on your b/p improvements. I’m sure a lot of stress has gone down with it.",
          "created_utc": 1618412919.0
        }
      ]
    }
  ]
}