{
  "id": "mrbwyf",
  "subreddit": "bulimia",
  "author": "Disastrous-Level-758",
  "created_utc": 1618482751.0,
  "title": "I wish I was still anorexic",
  "selftext": "Five years ago I developed anorexia and although it was terrifying at the time and I wanted nothing more than to recover, I had everyone rallying around me begging me to get better, the doctors took me seriously, and before everyone else got involved, whilst I was still losing weight I felt like I finally had a way to escape. No more suicide attempts and I almost felt weirdly content. \n\nFast forward to now, post recovery and a raging bulimic and I’ve never felt so close to the edge. Bulimia has destroyed me, I’ve dropped out of university, moved back in with my parents who don’t want me here, constantly self harm, feel as suicidal as ever and the only things I get any enjoyment out of are the binge in the moment and drugs. I have one friend but she’s moved away now and I have no reason to live. I hate myself more than I thought was even possible and I want to get help but I’m certain nobody will take me seriously at a healthy weight. This shit is awful.",
  "url": "https://www.reddit.com/r/bulimia/comments/mrbwyf/i_wish_i_was_still_anorexic/",
  "score": 96,
  "num_comments": 13,
  "comments": [
    {
      "id": "gulybsn",
      "author": "None",
      "body": "Same here, diagnosed with anorexia 5 years ago and then \"switched\" to bulimia. I've been trying to recover for a few months and recently been trying a pseudo \"all-in\" approach. Pretty scary, but after all this time the only thing I want is a healthy relationship with food. These thoughts of \"I wish I was still anorexic\" come to mind often. Bulimia for me has also been much more traumatic than anorexia, but when I was anorexic I was still miserable. I try to change the thought to: I wish I could eat like a normal person again. No food rules, not thinking about food and numbers all the time, not destroying my body in one way or another, not feeling sorry for myself, not hating the way I look...  Sure bulimia is shit, but anorexia isn't much better. The only thought that is worth it is recovery, and it's the only one that will give you your life back. Sending you much love and strength <3",
      "created_utc": 1618497762.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gumesqq",
      "author": "avadamaris",
      "body": "i feel like i could’ve written this. anorexia is so appealing in theory, and it’s so rosy in my memory because i felt the way i looked which was frail and childish, and people treated me that way too, which i admit i enjoyed. now that i look the part of a healthy adult, i’m expected to act that way and complete school while working but in my mind i still feel like a stupid child, i have no idea what i want except being thin, and nobody is giving me a break. i binge and purge everyday and sometimes i don’t even purge just to punish myself and push the limits of my self hatred. i gained like 30 lbs in the last month and people have certainly noticed. i just want to stop eating again. (but i don’t even feel like i have the willpower, which is another thing that makes me feel shittier).",
      "created_utc": 1618504948.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gul9evj",
      "author": "Disastrous-Level-758",
      "body": "It won’t let me edit but anyways, sorry for the rant, just had to get it off my chest.",
      "created_utc": 1618482905.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gun16ak",
      "author": "Celestialghosty",
      "body": "Honestly I can relate to this so much, when I was anorexic at least I liked how i looked, liked my body, had medical professionals take me seriously. Now, the ED clinic refuses to work with me, I can't look at my body or leave my house and I'm experiencing a lot more physical symptoms of ill health, including a calcium deficiency. I'm sending you all the good vibes and hope things get easier for you in time, and know that you're not alone in this ✨",
      "created_utc": 1618514673.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gulh4hy",
      "author": "Interesting_Repeat44",
      "body": "Are there any organisations you can call and talk to in your country? In mine there is one and l call them when l feel like binging and just talking helps.",
      "created_utc": 1618488835.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gull27p",
      "author": "ddonniedarko_",
      "body": "first off, i'm truly sorry, i know that this is absolute hell :( i'm in a very similar (if not the same) situation right now and i've honestly never felt worse about myself. don't wanna make this about me tho, so please, seek out for help - no matter what kind. i totally get ur fear of not being taken seriously, but remember that a healthy weight doesn't magically create a healthy mind. that's just not how it works and any professional should be aware of that. wishing u all the best, i'm rooting for u!",
      "created_utc": 1618491209.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gumkq25",
      "author": "fathugepotat",
      "body": "I cant relate 100% :( Absolutely hate this",
      "created_utc": 1618507502.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gum4hz1",
      "author": "None",
      "body": "Me too",
      "created_utc": 1618500489.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gun0wcx",
      "author": "krissycmt",
      "body": "I hate it too! But keep holding on . The world needs you 💖",
      "created_utc": 1618514556.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gunhapm",
      "author": "pineconedead",
      "body": "Same.. I'm with you. I feel like I'm drowning in this and can't escape from life. But nobody cares about how I'm doing anymore cause after my forced recovery from anorexia my body has gone back to a healthy weight, the kgs I was when I was bulimic. I can't help but think of those times when at my lowest weight I was happy with who I was and could actually function during the day without losing myself😔",
      "created_utc": 1618521660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gunp5hy",
      "author": "11572762",
      "body": "Story of my life not gonna generalize all bulimics and anorexics but that kind of starving wasn’t helping me at school so I switched to instant gratification mode. Neither are healthier or helpful",
      "created_utc": 1618525324.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gum1me9",
      "author": "Disastrous-Level-758",
      "body": "I’ll have a look into it, I like the idea of having some anonymity, that’s a great suggestion thank you",
      "created_utc": 1618499235.0,
      "score": 5,
      "context": [
        {
          "id": "gulh4hy",
          "author": "Interesting_Repeat44",
          "body": "Are there any organisations you can call and talk to in your country? In mine there is one and l call them when l feel like binging and just talking helps.",
          "created_utc": 1618488835.0
        }
      ]
    },
    {
      "id": "gumeoy1",
      "author": "Interesting_Repeat44",
      "body": "Yeah it should be like AA meeting for eating disorder, it's anonymous. That's how it is in my country at least so.",
      "created_utc": 1618504903.0,
      "score": 4,
      "context": [
        {
          "id": "gulh4hy",
          "author": "Interesting_Repeat44",
          "body": "Are there any organisations you can call and talk to in your country? In mine there is one and l call them when l feel like binging and just talking helps.",
          "created_utc": 1618488835.0
        },
        {
          "id": "gum1me9",
          "author": "Disastrous-Level-758",
          "body": "I’ll have a look into it, I like the idea of having some anonymity, that’s a great suggestion thank you",
          "created_utc": 1618499235.0
        }
      ]
    }
  ]
}