{
  "id": "ms50ms",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1618585348.0,
  "title": "even if i stopped the habits, i would still want to lose weight.",
  "selftext": "even if i didnt restrict, binge or purge, i would still want to lose weight. i just cant see how i wouldnt want to. its too ingrained in me. i want to be skinnier. i know i cant have that AND be mentally stable. so i guess its one or the other. but i cannot fathom being okay with my weight now. im so huge. so i guess ill always be sorta unstable?",
  "url": "https://www.reddit.com/r/bulimia/comments/ms50ms/even_if_i_stopped_the_habits_i_would_still_want/",
  "score": 98,
  "num_comments": 3,
  "comments": [
    {
      "id": "guqollm",
      "author": "peanutbutterandjoe",
      "body": "Not necessarily unstable. I am currently in recovery, but that doesn’t mean I’m perfect. The point for me is that while I would choose to be skinnier if I could, because I don’t practice the same habits it is not the foremost thought in my mind. I want to lose weight and when it comes up I still don’t love my body, but I don’t spend every waking hour hating myself and focusing on the physical. Recovery doesn’t always mean rainbows and sunshine and having the perfect mental image, sometimes it just means living a life that isn’t focused on everything wrong with me. I hope that not thinking about it in black and white terms makes it a little easier to see a path to recovery. Please feel free to reach out if you need someone to listen!",
      "created_utc": 1618590568.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gusyqci",
      "author": "Vicariouslylivin",
      "body": "I know you can’t imagine it, and that is why you are where you are now. But believe it or not (I have always thought I was fat since I was 7) when you find recovery you do reach a point where you feel content. You can’t see it now but it’s important for you to know that it is possible xx",
      "created_utc": 1618631252.0,
      "score": 4,
      "context": []
    },
    {
      "id": "guqe3ec",
      "author": "None",
      "body": "If your overweight, stopping BP and eating the right amount of calories will naturally take you to your healthy weight.\n\nI'm bulimic and overweight and my doctor doesn't recommend I stay overweight because that would mean I'm still engaging in binge eating behavior.",
      "created_utc": 1618586070.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gutljig",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1618649414.0,
      "score": 1,
      "context": []
    }
  ]
}