{
  "id": "mt0cgh",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1618697683.0,
  "title": "Question: Bulimia, fixing metabolism and CICO?",
  "selftext": "Hi everyone!\n\nI think bulimia messed up my metabolism.\n\nIdk how can I restore it? Any tips?\n\nI tried to do CICO and exercise but it led to weight gain? I’m literally eating 1.2-1.4k cal/day + the deficit from exercising = weight gain??\n\nI’m confused with the results and idk what to do.\n\nAny tips on fixing my metabolism?\n\nWhy am I gaining weight instead of losing??",
  "url": "https://www.reddit.com/r/bulimia/comments/mt0cgh/question_bulimia_fixing_metabolism_and_cico/",
  "score": 88,
  "num_comments": 10,
  "comments": [
    {
      "id": "gux9jjl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1618709359.0,
      "score": 5,
      "context": []
    },
    {
      "id": "guxbccu",
      "author": "HermioneGranger7243",
      "body": "Are you weight training? Weight training is much more helpful to increase your metabolism than cardio. But, the only way it will do that is if you actually build muscle. Muscle mass burns a lot of extra calories each day. In order to build the muscle you’ll most likely need to be eating more calories a day than you are now. I know it sounds counter intuitive but I can tell you first hand that it works. I dropped 3 sizes over the course of a year weight training 45-60 min 5 times a week. I would maybe do 20 min of stairs or HITT twice a week if I wanted to add in cardio but no more than that and not every week. To start focus on getting 100g of protein in each day and weight training 4x a week. Two upper Body, Two Lower body. Do your calculations and eat at your maintenance calories or just under for a couple weeks and see how you’re feeling. Give your body a chance to heal and it will. Eventually you will be able to lose or maintain weight at a much higher calorie count. Also don’t be afraid to lift heavy, you won’t get bulky I promise. It is very hard to gain muscle mass, but it is worth it. If the idea of eating at your maintenance calories is killing you then you can try a deficit but only 200-300 calories below your maintenance. Anything more than that is too aggressive and any weight lost will be easily regained.",
      "created_utc": 1618710432.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gux2pbk",
      "author": "Tuca1225",
      "body": "Have you considered exercise has increased your muscle mass??, Certain volume of muscle weights more than the same volume of fat. Also, please be careful with your daily calorie intake, it's too low!",
      "created_utc": 1618705494.0,
      "score": 9,
      "context": []
    },
    {
      "id": "guxxxgv",
      "author": "dxxdflxwers",
      "body": "after a long time of calorie restriction (especially when paired with excessive cardio) your metabolism eventually slows down, which make sense because back when we were hunter gatherers, food was hard to come by and we wouldn’t be able to survive if our metabolisms were roaring and we couldn’t get enough food. \n\nCICO still applies, but if your metabolism has slowed down so much it makes sense that you’d gain on even 1300-1400 a day :\\\n\nthe only way i’ve tried fixing my metabolism is with weight training (using compound exercises like heavy squats &  deadlifts etc), and slowly increasing my calories over time (around 100/day a week or so). the process is called reverse dieting and you can prolly search it up online for more information! \n\n(personally i tried increasing my calories to up to 600/day without really seeing a big visual change, but that’s because i don’t have a scale) \n\nas for the mental barrier when gaining weight, it really helped me to see people’s before/after photos and to know that they were significantly heavier but looked better because of more muscle mass and less fat mass. it gives a really toned appearance and not flabby/skinny fat at all. \n\ni recommend natacha oceane’s youtube as she gives really good information about how to increase your metabolism, and how your metabolism adapts and all that stuff! she really helped me a lot when i was on the border of relapsing again, her content is just overall really informative and positive! \n\nhope this helps :)",
      "created_utc": 1618725247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guy824g",
      "author": "testfreak377",
      "body": "You can have your doctor order a thyroid panel, I had low t4 to t3 conversion. Now I take 25mcg of t3 once a day. Won’t say how many more calories I can eat on here but if I dont have an extra protein meal before bed I’ll lose weight very quickly. Unlike before where I would just maintain\n\nYou need to also make sure you have the enough b vitamins so you body can use the nutrients you give it. A high quality methylated b complex is what I would recommend \n\nAdding more muscle will increase metabolic rate at rest or otherwise\n\nGetting enough quality sleep will lower cortisol and promote a healthy metabolism.",
      "created_utc": 1618734636.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv539um",
      "author": "WayOfHammer",
      "body": "Imo cal is not a good way of measuring what you eat. In the last few years I have researched a lot about about the different aspects of good health since I was not in the best condition and I have improved a lot by eating more raw & fresh & living (sprouts etc.), less uncooked, less dairy products, tried being straightly vegan for 6 months, different supplements (highly dosed vitamins & minerals), fasting and different herbs & spices with natural healing properties. There is 1 thing I can recommend generally for everything and that is golden milk. The original recipe consists of Curcuma, Cinnamon, Black Pepper and Nutmeg getting warmed up together with fresh ginger, coconut oil and water : (plant) milk (ratio as you like) of your choice. My own recipe also includes a little Cardamom and Coriander and I prefer to use barely steaming water, followed by a little shot of oatmilk and some good honey. The ingredients can have many healing properties such as to lower inflammation overall in the body, assisting your body to rebalance hormones, stabilizing the psyche, reducing psychoses & sleeping issues while also tasting quite good, to name just the positive effects I know of. If you'd like to discuss your metabolism and talk about what can be done to strengthen your health, feel free to message me directly. This offer is also valid for anyone who reads this as I wish for all of us to be in the best health possible and for this I will gladly use my time to share my knowledge etc. without charge.",
      "created_utc": 1618874405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvtft9a",
      "author": "None",
      "body": "Tried to comment on your latest post bc you don’t want a message. Focus on yourself! I hope everything goes great. And you got this :)",
      "created_utc": 1619358495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guxe41a",
      "author": "AppleJaXstar",
      "body": "Which metabolic restoration program did you use?",
      "created_utc": 1618712050.0,
      "score": 3,
      "context": [
        {
          "id": "gux9jjl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618709359.0
        }
      ]
    },
    {
      "id": "gux9pk6",
      "author": "None",
      "body": "But... my brain can’t handle weight gain 😭\n\nAlso, thanks for the advice! I’ll look it up!",
      "created_utc": 1618709458.0,
      "score": 2,
      "context": [
        {
          "id": "gux9jjl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618709359.0
        }
      ]
    },
    {
      "id": "guxbhf6",
      "author": "None",
      "body": "I do cardio!",
      "created_utc": 1618710516.0,
      "score": 1,
      "context": [
        {
          "id": "guxbccu",
          "author": "HermioneGranger7243",
          "body": "Are you weight training? Weight training is much more helpful to increase your metabolism than cardio. But, the only way it will do that is if you actually build muscle. Muscle mass burns a lot of extra calories each day. In order to build the muscle you’ll most likely need to be eating more calories a day than you are now. I know it sounds counter intuitive but I can tell you first hand that it works. I dropped 3 sizes over the course of a year weight training 45-60 min 5 times a week. I would maybe do 20 min of stairs or HITT twice a week if I wanted to add in cardio but no more than that and not every week. To start focus on getting 100g of protein in each day and weight training 4x a week. Two upper Body, Two Lower body. Do your calculations and eat at your maintenance calories or just under for a couple weeks and see how you’re feeling. Give your body a chance to heal and it will. Eventually you will be able to lose or maintain weight at a much higher calorie count. Also don’t be afraid to lift heavy, you won’t get bulky I promise. It is very hard to gain muscle mass, but it is worth it. If the idea of eating at your maintenance calories is killing you then you can try a deficit but only 200-300 calories below your maintenance. Anything more than that is too aggressive and any weight lost will be easily regained.",
          "created_utc": 1618710432.0
        }
      ]
    },
    {
      "id": "guy3xop",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1618730581.0,
      "score": 5,
      "context": [
        {
          "id": "gux9jjl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618709359.0
        },
        {
          "id": "guxe41a",
          "author": "AppleJaXstar",
          "body": "Which metabolic restoration program did you use?",
          "created_utc": 1618712050.0
        }
      ]
    },
    {
      "id": "guywy21",
      "author": "AppleJaXstar",
      "body": "Is this considered “metabolic restoration” as you referred to earlier? I googled, before posting here, and the first few that came up were programs that you had to sign up for, without much information on the actual details.\n\nPlanning meals ahead and intuitive eating don’t seem like metabolic restoration. However, it’s definition is still unclear to me, which is why I asked which program you used. Maybe a better question would be “what is metabolic restoration and what type of action steps does this program include?”",
      "created_utc": 1618754778.0,
      "score": 2,
      "context": [
        {
          "id": "gux9jjl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618709359.0
        },
        {
          "id": "guxe41a",
          "author": "AppleJaXstar",
          "body": "Which metabolic restoration program did you use?",
          "created_utc": 1618712050.0
        },
        {
          "id": "guy3xop",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618730581.0
        }
      ]
    }
  ]
}