{
  "id": "mv8cmb",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1618979940.0,
  "title": "bulimia is so funny and so gross",
  "selftext": "it’s just so wild how chill i am with vomit and shit now. i’ve shit myself as an adult after tooo many drugs. i’ve thrown up in public toilets, in my own arms, in food packaging, and cleaned up after many (usually drujk$ friends because over a decades worth of bulimia has made me numb to what grows inside of us. just now, i gagged and upchucked a bit due to an ocd ritual and i use swallowed it right back. i disgust myself but also what a superpower.",
  "url": "https://www.reddit.com/r/bulimia/comments/mv8cmb/bulimia_is_so_funny_and_so_gross/",
  "score": 83,
  "num_comments": 8,
  "comments": [
    {
      "id": "gvarxus",
      "author": "MaeveTheLion",
      "body": "Hahaha, agree. Sometimes I think about the Enron execs (company that slowly, then quickly committed massive amount of fraud). They crossed a moral line once, and then they kept crossing it. And it got easier and easier up to the point that where they were doing things they'd never have imagined they were capable of in their younger days. I'm sure they wondered (like I do sometimes) how to stop what feels like a moving freight train.",
      "created_utc": 1618989123.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gvawd8y",
      "author": "EasyBakedToast",
      "body": "So relatable, its weirdly interesting to notice how \"normal\" things become after a while that i would consider as fucked up some years ago.",
      "created_utc": 1618993347.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gvbqvxr",
      "author": "RexieRachie",
      "body": "I know! If my head was anywhere near a toilet before, I’d be so disgusted. Now I get to points where I don’t give a fuck when I’m tired and will just lay my forehead on one while I purge. I’ll also unclog a pukey toilet with my hand or random objects",
      "created_utc": 1619014793.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gvcm6mk",
      "author": "None",
      "body": "Yeh for sure, I think I’m one of the least disgustable people that I know when it comes to the human body after years of BPED lol. I actually think this is a positive to come out of this, I’ll braid my friends hair whilst they’re throwing up drunk, I’ll go down on a partner on their period and will change any diaper no questions asked.",
      "created_utc": 1619028160.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvu7jcb",
      "author": "verswace",
      "body": "duuuuuuuuuuude. hahahahhaha YES. OMG. sharing stories with other bulimics about the weird shit weve done is HILARIOUS and cathartic. I feel like if someone who hasnt experienced it theyd be HORRIFIED about the details but also about how FUNNY it is. hahah. \n\nlike one time i threw up ramen noodles and a noodle came out my nose and i pulled it out. i could feel it come all the way through my esophagus and out my nose. it was kinda cool haha.\n\nor about how delicious ice cream is to throw up haha. like its still cold and tastes exactly the same. lolol. \n\nliterally nothing grosses me out when it comes to the human body now. its totally a superpower.",
      "created_utc": 1619372475.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvbn3ky",
      "author": "Narwhal_Songs",
      "body": "YEAH THIS\n\nWhen my ED was purely restrictive my then BF once said \n\n\"I've bought some pizza you can have some but you have to promise not to throw up\"\n\nand I was like \"No, I would never, that's gross\"\n\n... and now I can't miss my weekly purge (trying to stick with once a week but its soo hard)",
      "created_utc": 1619012977.0,
      "score": 2,
      "context": [
        {
          "id": "gvawd8y",
          "author": "EasyBakedToast",
          "body": "So relatable, its weirdly interesting to notice how \"normal\" things become after a while that i would consider as fucked up some years ago.",
          "created_utc": 1618993347.0
        }
      ]
    }
  ]
}