{
  "id": "mxclus",
  "subreddit": "bulimia",
  "author": "hdjldk",
  "created_utc": 1619238482.0,
  "title": "I started purging three months ago. I was almost a year clean from anorexia. A few weeks ago my whole world came crashing down and I ate more than I ever had in my entire life, including foods I'm allergic to and meat. I'm a vegetarian",
  "selftext": "\nA few weeks ago, I found out my boyfriend wasn't happy and only stayed to keep me happy. We broke up. I only had him and one friend left. But at the time, that one friend wasn't messaging much, and after we split up we rarely spoke. I was failing my classes and lost my passion for music, art and sports. I was alone, so I ate. I ate, and I ate, and I ate. I ate wheat and dairy, both foods I'm allergic to. I ate a few slices of roast beef; I'm a vegetarian. I'm beyond ashamed of myself and I'm losing the will to do anything. I gave up on my classes, I'm afraid I'm going to repeat sophomore year. I've been so out of energy and I need medical care for a number of reasons but I can't get it because of the virus. I injured myself trying to get in better shape. The only good thing I've got right now are my short stories. It's the only productive thing I do now, writing. Usually it's how I express my frustrations and depression.\n\nI feel like it just won't get better.",
  "url": "https://www.reddit.com/r/bulimia/comments/mxclus/i_started_purging_three_months_ago_i_was_almost_a/",
  "score": 74,
  "num_comments": 1,
  "comments": [
    {
      "id": "gvnwf7d",
      "author": "Goblin_at_heart",
      "body": "Binge eating is a coping mechanism that you use, because you had to figure one out on your own. You were never taught how to cope in a different way, so don't beat yourself up about it. Even about the eating meat (I'm not a meat eater too), it's more than okay to slip up here, not even just because of the ED, but because you are a human being and no human is perfect.\n\nIt's really hard to pull yourself out of a depression, but it will pass. When I'm in this phase I will have a list of 'bare minimum' activities to do, including passions that relax me like art. And then if I have a day that's better I'll commit to doing a bit more like a walk outside, work, etc., But the important thing is that my expectations are realistic and not another thing I can beat myself up about. It's important that you know you are doing the best you can right now, and you will get back to your normal and best self.\n\nCovid makes it all so much harder, but when you're ready throw yourself into making friends. Join a club, find a group hobby, a yoga class or meditation class or something.\n\nI agree with the other commenter that your ex was likely not an end game man.",
      "created_utc": 1619255407.0,
      "score": 5,
      "context": []
    }
  ]
}