{
  "id": "mxjzh3",
  "subreddit": "bulimia",
  "author": "tosee6",
  "created_utc": 1619270918.0,
  "title": "I feel like I’m fucking decaying",
  "selftext": "I was 2 days clean but had a shit tonne of cheese and bread all because a guy hasn’t messaged so my brain went crazy. I keep telling myself he was lying and he thinks I’m a fat disgusting ugly troll and now I REALLY feel like a fat disgusting troll because of all the cheese and bread I couldn’t get up. I tried so hard my brain feels like it’s gonna explode and I feel like there’s chucks of cheese in my throat. Idk this is a stupid rant I’m just so anxious because I really strained myself this time and my stomach is so full. This feels like the end of the fucking world",
  "url": "https://www.reddit.com/r/bulimia/comments/mxjzh3/i_feel_like_im_fucking_decaying/",
  "score": 79,
  "num_comments": 7,
  "comments": [
    {
      "id": "gvpgipi",
      "author": "Nonamemeisback",
      "body": "Go to sleep. Poop it in the morning. Try harder tomorrow. Repeat.",
      "created_utc": 1619274974.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gvp82vk",
      "author": "krzychu_dobra_morda",
      "body": "It may feel like the end of the world but all the anger, grief and disgust will pass. Give yourself some time and be gentle to yoruself",
      "created_utc": 1619272848.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gvq97i0",
      "author": "Wrencer4Endgame",
      "body": "I used to be like that too (eating a lot when sth like not getting a reply back happened) and it was so hard working on that issue : / sending you strenght !!",
      "created_utc": 1619284920.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gvqe1gb",
      "author": "None",
      "body": "Go for a walk. Get your mind on something else.",
      "created_utc": 1619287279.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvqm3vk",
      "author": "ihatemyselflolxox",
      "body": "no advice just want to let you know i’m going through something similar, the last two days have been awful i can’t control my binges and the anxiety you feel when you can’t/don’t get everything up is unreal, sorry i can’t help but just wanted to let you know your definitely not alone.",
      "created_utc": 1619291253.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvrpj26",
      "author": "None",
      "body": "I know it sucks right now, but believe me tomorrow you will feel so much better than you do now. I was in the exact same position as you yesterday except swap cheese for a family size sour patch kids.... (GUMMY CANDY NEVERRRRR COMES UP FOR ME FML). Anyways. Wear comfy clothes. Dont go past mirrors for a while. Do some selfcare like a face mask and a bath. Give yourself permission to relax and just watch a movie or something you enjoy. I promise you, the boy you are messaging doesn't notice. We are our worst critics. Its just one day in the grande scheme of things girl.",
      "created_utc": 1619311956.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvr8kv1",
      "author": "c-ish",
      "body": "This was so real and funny",
      "created_utc": 1619302750.0,
      "score": 8,
      "context": [
        {
          "id": "gvpgipi",
          "author": "Nonamemeisback",
          "body": "Go to sleep. Poop it in the morning. Try harder tomorrow. Repeat.",
          "created_utc": 1619274974.0
        }
      ]
    }
  ]
}