{
  "id": "n3k10s",
  "subreddit": "bulimia",
  "author": "plslovemebvck",
  "created_utc": 1620002542.0,
  "title": "Question about you guys",
  "selftext": "hey so i’m 21(m) and have been bulimic since i was 15. i was just wondering what everyone else in this subreddit is like, so i can put an image of you guys in my head. thank you, really!",
  "url": "https://www.reddit.com/r/bulimia/comments/n3k10s/question_about_you_guys/",
  "score": 234,
  "num_comments": 355,
  "comments": [
    {
      "id": "gwqdkoj",
      "author": "MediumPsychological9",
      "body": "I’m 21 f and was bulimic from 2017-2020 but recovered! Staying here to keep myself accountable and bc the posts are still so relatable",
      "created_utc": 1620004872.0,
      "score": 127,
      "context": []
    },
    {
      "id": "gwrtmpf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620042983.0,
      "score": 89,
      "context": []
    },
    {
      "id": "gwqawvq",
      "author": "AnaDion94",
      "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
      "created_utc": 1620003400.0,
      "score": 67,
      "context": []
    },
    {
      "id": "gwsdyii",
      "author": "lunger_sally",
      "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
      "created_utc": 1620053120.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gwqiaph",
      "author": "testfreak377",
      "body": "I’m 19(m) had bulimia since 15 but only the last year has it been bad. Competed in triathlons till 13 then started bodybuilding. Unfortunately couldn’t continue with that due to binging and purging, but I will continue that and other pursuits after I choose to recover. I love trucks, Hypercars and murdered out Escalade would be a badass daily driver.\n\nFuck this illness I will beat it into submission one day soon !",
      "created_utc": 1620007475.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gwqceks",
      "author": "None",
      "body": "I’m 19(f) and I’ve had anorexia for about three years and bulimia for about 2. I love being outside (especially hiking), photography, baking, and growing/taking care of plants. :)",
      "created_utc": 1620004222.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gwqlqws",
      "author": "carlyilanar",
      "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
      "created_utc": 1620009406.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gwqsbbj",
      "author": "chronaloid",
      "body": "I’m 20 m and have been eating disordered since I was 14 at least but only truly bulimic since I was like 19... idek anymore. My main interests are herpetology and linguistics. Cool thread to read thru.",
      "created_utc": 1620013343.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gwublkz",
      "author": "esoterique87",
      "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
      "created_utc": 1620083293.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gwqhow1",
      "author": "punkgoob",
      "body": "25, cis female, only recently diagnosed with bulimia I've been struggling on and off with since age 15. I'm in recovery now and currently work as a mental health counselor.",
      "created_utc": 1620007141.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h0ch003",
      "author": "the_bananafish",
      "body": "I’m late to this, but as a 30 year old it helps a lot to see other adults going through this as well. I mean I wish they weren’t suffering but I know a lot of my self-loathing comes from this internalized idea that my ED is something I should’ve grown out of by now (that’s a toxic idea obviously but I can’t help thinking it), which makes me feel alone. I’m a graduate student in a great program and career that I love. I don’t know how long I’ve had an ED, maybe 6-8 years. No one in my real life knows about it except people on the internet.",
      "created_utc": 1622659688.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gwu0p2j",
      "author": "lonellyrabbit",
      "body": "hi! i‘m a 17 year old girl from Germany. I have been bulimic for 3/4 years, kept it a secret until now. only recently I made a quite big change in my life, told my mom about it, went to hospital and now I quit school to recover and have to go to a ed clinic soon. I’m scared what‘s gonna happen now that everyone knows, because it was my tiny little secret that kept me protected and helped me deal w the shit in this world. I don‘t know who I am without it as I spent all my teenage years walking from fridge to toilet and back. But I hope there is a better life ahead. I wish you the best of luck on your recovery journey. ✨",
      "created_utc": 1620078209.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gxkyov5",
      "author": "None",
      "body": "26, male. Struggled with bulimia as a teen. Was in treatment for it, recovered. Relapsed last year right before the pandemic shut down lol. struggled with it all throughout quarantine. Was in denial the entire year until December when I finally decided to start going to a support group for it. At first I kept track of how long the last time I purged was, but I lapsed after about 3 weeks the first time? I don't keep track anymore. Keeping track of the days made me feel like a failure when I'd get the urge to purge. However I think the last time I purged was a week ago? I don't remember the specific day/night. I've been a lot busier with work & stuff lately so it's been easier to fill my time. \n\nIt was hard to accept it last year because it had been years & I didn't want to believe that I was in the same place I was when I was 16 (10 years ago) plus I don't live in my hometown so carrying this ED with me 10 years later as an adult in my new life/town, it just felt unbelievable. I honestly thought \"how do I go about forming strong connections with those struggling the same as me in a place I don't associate this disorder with?\" However, I think the worst part about this relapse was keeping it to myself. Keeping it hidden made me want to do it more. I realized that the more I talked about it with my support group & even close friends, the more I became aware of the reality of it, compelling me to want to stop. But that's absolutely just my mindset, in no way to I think talking about it is the full cure of an ED haha. However, I think opening up about it & being honest with the right people who understand, it may not \"cure\" you but it definitely makes things different in some way. We just need to surround ourselves with people who understand & won't harshly judge us or even judge us at all. \n\nBest of luck!",
      "created_utc": 1620629251.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gwqtnar",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620014210.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwvghoi",
      "author": "sheddinglikeamofo",
      "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
      "created_utc": 1620104872.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h2plunj",
      "author": "anonymouspony2",
      "body": "Hi, I'm a thirteen-year-old girl who got caught in a vicious cycle of binging, exercising, fasting, and restricting starting from the past month. It started with trying to lose weight in March. I lost fifteen pounds but gained six back due to the binging. I binged because I was really stressed out from school and such. I made myself throw up a week ago and have been doing that every day since. Yes, I know I'm pretty young, lol, but adolescence is when the problem usually starts, and I want to get help before it gets any worse. I'm currently trying to gather the courage to ask my parents for help. :) I hope things will get better for you one day, even if it cannot be today. Always keep hope that things will improve. You're strong and can get through this!",
      "created_utc": 1624406130.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwqld3c",
      "author": "None",
      "body": "I'm an 18 year old guy and I'm about 5'5 5'6. I was on and off with it but in the last month I slimmed from 165lbs to 152lbs. I've always been concerned about my weight because sophomore year in high school I was 230lbs. I used to be a band kid but my section had their own period so I only spent time with them and they were bullies which made me leave and start losing weight. I don't care about them now but the idea that someone thinks I'm gross or that I think I'm gross bothers me.",
      "created_utc": 1620009194.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwywvzy",
      "author": "NightWorldPerson",
      "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
      "created_utc": 1620174819.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx2ygrj",
      "author": "Kariatide",
      "body": "I’m 39 . I had anorexia in my teen years which developed to bulimia\nI got “cured” but Not fully. I gained a lot of weight in my 20s but I didn’t care\nI got married then had a nasty divorce at 35 followed by a relationship with a guy who really put me down so I developed bulimia again and have been struggling for the last 4 years\nI went to therapy which helped but covid made me go back to the bad habits :(\n\nI absolutely love animals and cats in particular; I love going to the gym, to the pool, beach, partying with friends, going to the movies and theatre",
      "created_utc": 1620253264.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwr2xt6",
      "author": "Column-V",
      "body": "Im 21 m and I have been bulimic since I was a preteen. I’m married, have 2 jobs, and go to university for political science. I just started seeking help this year. Hope you’re doing well.",
      "created_utc": 1620021066.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwtb47n",
      "author": "mondaysme",
      "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
      "created_utc": 1620067079.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxsxsad",
      "author": "hdjldk",
      "body": "I'm 16F, I've been bulimic for four months. I developed bulimia right at my one year mark being clean from anorexia, which I'd had since I was about ten or eleven. I don't do much, but I love drawing digital portraits, singing and knitting. I'm tryna spend more time with my reptiles and I'm tryna work on my diet and exercise (I used to be super fit, but had to stop due to covid). All around my ex told me I was one of the unfunniest people he's met and the girl his friends wanted him to be with said I'm a bitch who makes everyone sad. Yay",
      "created_utc": 1620783546.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gydaikz",
      "author": "turnipkitty112",
      "body": "16F, been struggling with anorexia nervosa for 2 1/2 years. I’ve had bouts of purging before but for the past few months I’ve really spiralled into b/p almost every day, sometimes several times per day. I also struggle with anxiety, depression and self harm. Sometimes I don’t want to get better but I know I need to stay alive to take care of my cat, who I love more than anything on earth (ik that’s kinda a dumb reason but it’s all I have right now)",
      "created_utc": 1621199921.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gye3zjc",
      "author": "bitchwhorehannah",
      "body": "18 year old 5ft tall jewish girl, been disordered since age 12, on and off bulimic but currently getting treatment for throwing up. i’m going to law school, vape a lot, and love love love candles. my favorite show is family guy, and i do winged eyeliner every day.",
      "created_utc": 1621214532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gyrsk2q",
      "author": "dizzyandsid",
      "body": "I’m 37, non-binary, and have dealt with bulimia off and on since I was 13. I’m trying to recover and have had six days this week with no behaviors. I’m a circus artist and circus arts instructor, I love to read, and I have an awesome pit bull who is my best pal.",
      "created_utc": 1621475148.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h01o7qx",
      "author": "Throwaway98745610",
      "body": "I’m obviously a bit late to this post, but I just recently came into this subreddit. I’m 25F, was bulimic all throughout my high school years with brief relapses in college and grad school (never sought treatment though and never received an actual diagnosis). Over the past year I actually managed to lose around 60 pounds just by dieting and exercise with only a few purges along the way (something I never thought would be possible). But the weight change (bringing me back down to my high school weight) triggered a lot of trauma relating to a rape I experienced when I was 16, and with this stress I’m worried that I’m on the verge of relapsing. It started with occasional purging when I was nauseous from not sleeping or just from stress, when I told myself if I could just throw up then I’d feel better. Now I’ve noticed that I’m “conveniently” nauseous everytime I have a high-calorie meal, and still using that same reasoning that the purging is only for temporary relief, not a psychological need. But still, it’s not even remotely close to how bad it was in high school",
      "created_utc": 1622432490.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1lkfmn",
      "author": "winnie0718",
      "body": "31(f) have had bulimia since I was 10. The first time I got help was when I was 21 and since, I’ve had many relapses. Now-a-days they are less frequent, but the body dysmorphia can make it hard. I was feeling lonely in these feelings and just discovered this thread and I felt compelled to share. Thank you all for being so brave.",
      "created_utc": 1623568181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2pkygh",
      "author": "The_healing",
      "body": "34 female.  Two kids. Been in and out of the mess I call bulimia. Gone years without doing it to eventually fall back into it because it starts out as anorexia because of relationship stress. Then swing wildly back to binging, and then b/p as to regulate my weight because i didn’t want to lose my relationship. As a child I was over weight and teased horribly in school. Boyfriends would dump me for skinnier girls and so I basically lost myself to it when I was 15 after years of trying to lose weight and try different diets secretly so my mom wouldnt know. I also had very emotionally and physically abusive boyfriends even after I started my eating disorder. \nToday I am more open and optimistic this time around. It’s basically my only Vice I’ve ever had. I’m learning to  actually love myself and try not to be afraid of losing people because they have shallow relationship with me. I can say logically I am better off without it. But emotionally, I’m getting there and learning to trust myself. After all, I’m really starting to enjoy myself a lot!",
      "created_utc": 1624405643.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwrkkk7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620036885.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwu0pi2",
      "author": "botaglove",
      "body": "I’m 29 and my eating disorder journey began at age 10 — I went through bulimia, EDNOS, anorexia, AFRID... I’ve been in recovery for about 5 years now :) occasionally still have slips but no more relapses or hospitalizations. Still see a dietician, therapist, and MD, and visit subs like these :)\n\nI love plants and art so much! Currently working towards a doctorate degree in nursing. Eventual goal is to be in the eating disorder field but I would like a solid 5 more years of recovery at least under my belt.",
      "created_utc": 1620078214.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwuu2s9",
      "author": "Sweetbb96",
      "body": "Hi! Im Leslie Im 25 and ive been bulimic from 2014-present. I’ve had lots of breaks from b/p but after I had my son in 2018 it’s been pretty non stop. I finally sought out therapy a month ago so I’m on the road to recovery. It got to a point where i was putting my b/p before my son and I knew i had to finally get help. Im diagnosed Anxious-Avoidant attachment style and Atelophobia, so thats a little about me.",
      "created_utc": 1620092197.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwuuhhi",
      "author": "rigadoontoon",
      "body": "i'm 18(nb) and i've struggled with disordered eating habits since kindergarten. i love my friends, drawing with dip pens, making and listening to music, and my shitty, steadily growing collection of stick and pokes that i use to cope :) i hope ur well and if not, i send love and warmth and hugs your way <3 it's nice to meet u!! :)",
      "created_utc": 1620092394.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwy78hw",
      "author": "tootegost",
      "body": "New to reddit altogether. I'm 18 and nonbinary, have been having ed for 7 yrs now with varying behaviors. The last two years I've been bulimic. I live with a cat and try to grow vegetables on my balcony. I have many intensive interests but since last fall Dungeons & Dragons has been pretty dominant. Other things are for example language learning, arts and crafts, photographing street art, and music. :) This happens to be my very first text on Reddit, quite suitable for it to be an introduction.",
      "created_utc": 1620162996.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwycc6m",
      "author": "justahumanlikeu",
      "body": "22, they/her, started struggling with ED at 12 and started purging at 18",
      "created_utc": 1620165180.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gx9bah8",
      "author": "None",
      "body": "hey, nice to meet you! i'm 23 and non binary. i have orange hair. i love music (mostly emo, punk, alt rock, but other genres too!), art and nature. i'm currently trying to recover by myself (since about a month now), as no one knows about my disordered eating. i've had it since about 14/15, and i'm so tired of food controlling me. it's actually not going too badly!",
      "created_utc": 1620383886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gybols9",
      "author": "6Maekki",
      "body": "hey I'm 23, f and i was struggling with bulimia for about a year and a half. i started to recover when i realized how awful it is what I'm doing to my body and mental health. before any of this started happening, at 17 i was the fattest i had ever been my whole life. i started changing that by eating healthy and exercising and at the time i lost 17 kg in like 5 months. i was soooo happy and i maintained that weight for about a year when i started to not care that much about how healthy i was eating. i didnt gain a LOT of weight but i still gained enough to not look like i want to anymore. i had the mindset of \"i got here by hard work and I'm not gonna throw all of that away just by being dumb and not caring about what i ate\". so i started watching my weight for a few months but bcs of uni stress i was just eating junk and loads of it and it took 1 overeating for me to start purging. i didn't consult anyone nor was i diagnosed but i did manage to beat it on my own! been clean for almost 2 years now (with the exception of a couple of times when i was drinking a lot at parties and then getting sick because of that) and i gotta say, recovery was NOT easy. because of purging i had lost so much weight at an unhealthy point that anything i ate in recovery i wanted to instantly throw up because i was gaining a lot of it back. but i just kept saying to myself that it's not worth it bcs it literally does nothing healthy for your system it only decays it very slowly but tricking you by making you look skinny. like i said not easy but TOTALLY worth it. i guess the only thing i hate since then is the constant preoccupation with what to eat and what not to eat... its so tiring and not good for your mental health but i guess it just sticks with ya :/\n \nANYWAYS OMG\n\nTHIS IS SUCH A LONG COMMENT IM SO SORRY BUT SOMETIMES IT FEELS GOOD TO GET IT ALL OUT😭\n \ngood luck to anyone out there trying to recover or struggling, just keep in mind that you CAN DO IT. your mind and will are much more powerful than the ilness if you want them to be💜💜",
      "created_utc": 1621173072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h08oaa0",
      "author": "VanaEvich",
      "body": "&#x200B;\n\nit took me 12 long years to recover....I was bulimic from 2007-2019 or from 16-28 year. \n\n2 years after, Im here because I still cant believe I made it all by myself....",
      "created_utc": 1622583232.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h08vkse",
      "author": "paperboy244",
      "body": "22 (Afab Non Binary), been diagnosed as bulimic since I was 14. Been in treatment a few times and relapsed pretty bad last year, due to COVID stress! Much love everybody.",
      "created_utc": 1622586719.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1bd9fv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623352365.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1muv3n",
      "author": "Organic_Goat",
      "body": "I’m 21 and I’ve had bulimia on and off since I was about 16. I was a three sport athlete in high school and then went to college to play. I was always on the bit of the bigger side but after getting torn up by everyone and especially my coach about my weight I started dropping weight which then led to me breaking my ankle and getting a stress fracture in my tibia. I ended up leaving the school because I wanted to pursue a different career path that that school didn’t have and now I’m home and working and slowly trying to get better :)",
      "created_utc": 1623601016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3eo14f",
      "author": "xijokke",
      "body": "I’m Cal (17, F) I’ve been bulimic since about 14. I am about 5’7 with reddish hair. Right now is probably the worst I’ve ever been if I’m honest but hoping to get out of it. Depressing shit aside, I really like music and mess around with a lot of different instruments but primarily I play bass.",
      "created_utc": 1624942316.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3f6l4f",
      "author": "itsalltetherballbaby",
      "body": "I’m 18 female, and I’m a fulltime athlete :) my technical diagnoses is Anorexia Nervosa with Bulimic tendencies.  I like being here because it validates my struggle",
      "created_utc": 1624958335.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3snmuy",
      "author": "skeletonprincess20",
      "body": "i’m 20 (almost 21) f, i’ve been bulimic since like 7th grade. i’ll recover for a bit and then sink back into it whenever anything bad happens :(",
      "created_utc": 1625227767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6abgis",
      "author": "zobeeris",
      "body": "I am 21 f and my body image has been bad for as long as I can remember. I first became anorexic at 18 after downloading MyFitnessPal and severely restricting my calorie intake which led to me losing lots of weight very quickly. I was very underweight to the point where I was hospitalized for about 5 months, which was then followed by me going to a specialized clinic for eating disorders. Shortly after I was discharged and returned home again, I started restricting again and also developed bulimia because I was very uncomfortable with all the weight I had gained during treatment. \n\nMy relationship with food and my body is still pretty bad and I consume far too much ED-related content, but I'm managing currently :)",
      "created_utc": 1627069753.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6f78ay",
      "author": "lunarpolaris",
      "body": "I’m 17, nonbinary and I was diagnosed with anorexia at 14, EDNOS at 15 and I’m now clinically suspected to have bulimia (if I was honest at the ED intake I probably would’ve been diagnosed) everyone around me thinks I’m pretty much recovered and I got discharged from the clinic in 2020 but every time I’m alone I b/p, the truth is gonna come out at some point but I’m not too concerned about that right now lol",
      "created_utc": 1627172199.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7lbyi6",
      "author": "None",
      "body": "I just found the sub so I’m new here but I’m 27 and have had bulimia since I was 15. I’ve had three kids and the only time in my life when I didn’t have an eating disorder is when I was pregnant. Currently thought I had finally kicked it after my last baby. But here I am six months PP and at it again. Ugh. I hope one day I can just eat and chill instead of eat and spill. 🙃",
      "created_utc": 1628020780.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h81fe3d",
      "author": "One_Economist_1562",
      "body": "21 F from Australia, diagnosed with bulimia and other disordered here and there since 2017. I was in recovery for several months last year, but it all went downhill during Christmas. Probably at my worst right now :( this subreddit has been a saving grace. It is saddening to know so many other struggle, but it brings some comfort that I am not alone. Sending everyone love and safety x",
      "created_utc": 1628329284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h8us6j5",
      "author": "fluid-colors",
      "body": "I am a 35 y/o female. My ED started when I was around 13-14 (mostly restricting) but I was able to recover. Never struggled with it again until the past few months when my husband told me he wanted a divorce. Now I'm in the middle of a relapse with restricting and binging/purging and not quite ready for recovery yet. Everyone keeps congratulating me on my weight loss (I started with being overweight this time around).",
      "created_utc": 1628901998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hb4weuw",
      "author": "ummagumma_1987",
      "body": "I’m 34f and have had an ED since I was… 16?  I manage to stave it off for two years.  Being active and moving my body has been instrumental in that.  Recently, I’ve been with my partner who is really triggering my eating disorder.  I’m trying to tell him what support i need, like “show me that you’re attracted to other body types”.  But he seems to not have the emotional intelligence to truly understand, and is now telling me that I’m using my eating disorder as a weapon, saying things like, “I want to add that using your eating disorder to invalidate or not even listen to what I have to say feels manipulative.”  I’m sitting on my porch, smoking a cigarette, and decided to join this subreddit for support in hopes I can teach my partner to communicate with me in a way that doesn’t invalidate my triggers and eating disorder.  That comment definitely triggered me.",
      "created_utc": 1630461323.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hc70izc",
      "author": "NumbMePlz",
      "body": "18 male, big weed smoker, always the class clown growing up. Nobody really expected any of this from me. So I kept it sealed up for along time.",
      "created_utc": 1631203024.0,
      "score": 2,
      "context": []
    },
    {
      "id": "het4r1b",
      "author": "Mx-Sinister",
      "body": "21 NB, been bulimic since I was 11.",
      "created_utc": 1632972490.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hh2ciwy",
      "author": "queencowboy",
      "body": "i do not wish to be perceived lol\n\ni’ve been diagnosed with every ED there is at some point in my long yet short life. consistently bulimic for 18 years, now with 3.5 years recovery from b/p under my belt :)\nmy EDNOS is out of control, though :( my only “safe foods” are raw veggies, protein bars, and enough candy to put a child in a coma.",
      "created_utc": 1634525796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hhs5x35",
      "author": "chrollocooch",
      "body": "im 17 afab, non binary. Ive had an ed since I was 12, began with binging and purging, morphed to binge and restriction, to straight up restriction to now b/p again. I have an abundance of problems outside of bulimia, such as depression, suicidal ideation, never having my shit together and weed dependency. I also like to crochet and draw. I hope everyone is ok",
      "created_utc": 1635022124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hmrf9me",
      "author": "Meekmoss",
      "body": "Not sure if this is still relevant, but I’m eighteen (NB), I’ve been anorexic since fourteen, and bulimic since about fifteen. Ive been in intensive treatment, but nothing seems to fully kick this disorder’s ass. Still struggling but better.\nI’m a college student now, in my first year, an intended psych major. I love writing, and just being out and about, with friends and such.",
      "created_utc": 1638335733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwqh4xd",
      "author": "None",
      "body": "I’m 27, diagnosed with anorexia with purging tendencies. I’ve struggled with my ED for 12 years and was nearly recovered until my current relapse has taken a toll on all of that. I love cats (I have one), going to the gym, working with children, and enjoy singing. I just got my license a couple of months ago.. after years of being absolutely terrified lmao. I think this kind of post is a good idea!",
      "created_utc": 1620006837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwr2ktg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620020770.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwrg2cf",
      "author": "None",
      "body": "Hey I'm 23 f and I never had problems with food until 2 years ago that I became bulimic",
      "created_utc": 1620033101.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwrhq4v",
      "author": "AppropriateGiraffe28",
      "body": "21 (f) bulimic from 14 started recovery 26th May 2020 :)",
      "created_utc": 1620034671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwrmctc",
      "author": "SharriSchwab",
      "body": "Hi! I'm 19F and at a young age I struggled with anorexia then became bulimic/BED then at 16 I again had anorexia but now I am at a good healthy weight and sometimes struggle with eating normally (sometimes way too much and purge and sometimes too little) \n\nButtt we all just need to give it time and trust our bodies! At first I thought I'd never stop b/p, but now when I'm full I can stop! \n\nOur body is sooo extremely smart fr. Certain trauma/problems/triggers whatsoever need to be handled first, that makes getting better a lot easier :) \n\nGood luck and enjoy life y'all x",
      "created_utc": 1620038211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwt6sjr",
      "author": "dicksandtits420",
      "body": "14, f, I've only been diagnosed for a few months but its been like this since 2018:)\n\nedit: ig we're sharing so I really like my cat and the show rick and morty. that's basically it, other then that and smoking pot, thats who I am",
      "created_utc": 1620065271.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwvg02j",
      "author": "None",
      "body": "I'm a 31 yr-old queer cis female who started restricting hard at 14 and was actively bulimic from 15-29. I've been in therapy for my ED and depression/anxiety since then and I'm in an area with ED gurus, so I've been mega fortunate in my treatment experience. I'm 2 years into recovery as of April and 5 years sober in June, and I attribute a lot of the recent growth in my ED recovery to being able to overcome that. Things didn't really start to change until I quit drinking but when they did, they changed A LOT. I still have to work at my ED every day but it's nothing like it used to be, and making good connections with others in recovery helps sooooo much.\n\nI've got a good job but I'm looking for something that I'll like more. Graduating college in a few weeks and starting grad school in the Fall.",
      "created_utc": 1620104528.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gww545i",
      "author": "Narwhal_Songs",
      "body": "29F, been struggling with bulimia for six months",
      "created_utc": 1620125959.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwz9opl",
      "author": "Acrobatic_Cut2772",
      "body": "16 F have had bulimia since i was 15 and anorexia since i was also 14/15",
      "created_utc": 1620180930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx76qkk",
      "author": "None",
      "body": "I'm 20 (f) and have had an ED since 16 but didn't start purging until like 17-18 ish. So yeah I def got my shit together",
      "created_utc": 1620335941.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx7kldx",
      "author": "januaryjay2",
      "body": "Hi I’m 30yo F. Been struggling for 10 years. There’s not any help for EDs in my area, hopefully one day I’ll be healed ❤️",
      "created_utc": 1620342210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx89110",
      "author": "heyocheryo",
      "body": "Heyo! I’m 20 (f) and i have been anorexic from 2011 and bulimic (but with subjective binges/not really binges) since 2019 and now i’m kinda floating around with atypical bulimic anorexia? lol idk. that’s what the doctors calls it. \nI’m norwegian and rn i’m working in norways biggest environmentalist organization for/by youths! i love analog photography, dance and plants!",
      "created_utc": 1620354680.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxcyo2r",
      "author": "Trashcan5742",
      "body": "(21F) struggle with Bulimia and anorexia, recovering slowly but surely. Used to be in a lot of sports in highschool and worked out regularly after highschool, recently stopped exercising at all except for yoga because my body became ti weak to handle it.",
      "created_utc": 1620451999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxdf0gn",
      "author": "RepresentativeDry992",
      "body": "i’m 16(f), i’ve been struggling with bulimia for the past 9 months although i’ve had several restrictive behaviours for the past 2 years or so. recently it’s got pretty bad but i’m getting help to start recovery so i’m hopeful :)",
      "created_utc": 1620467268.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxlo46b",
      "author": "None",
      "body": "I'm 21f, ive been bulimic on and off since I was 11. Right now I am off and I hope to stay that way.",
      "created_utc": 1620650610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxtc9nm",
      "author": "None",
      "body": "Hey! 23F, started purging at 12. I'm at a low-normal weight, androgynous-looking, full-time cook, alcoholic, idk\nI love music and books, especially humanities essays and jazz",
      "created_utc": 1620791286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxtief4",
      "author": "ChemGirlHelp",
      "body": "I’m 24 soon to be 25 bullimic since I was......15-16? I’m a science major undergrad",
      "created_utc": 1620795106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxubuy7",
      "author": "None",
      "body": "Hey! I’m 15F. Growing up, I was told I was overweight. I became an atypical anorexic. Then, I lost so much weight, I became an actual anorexic. I later found out I was never overweight - haha (BMI is a flawed indicator of health, but still). By that time, I was already too entrenched in anorexia to do anything but suffer for a long while. I recovered only to fall into bulimia. I’ve been actually recovered for a couple more months now, though. I’m crossing my fingers and hoping it sticks!",
      "created_utc": 1620819789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy5drsl",
      "author": "LerkaHalerka24",
      "body": "I’m 17f and I developed bulimia in late December while a crazy depressive self destructive episode. I’m struggling to recover but it’s causing me serious health issues and I know I need to get a handle on this thing. I’m staying here to try to stay out of the unhealthy mindset",
      "created_utc": 1621028567.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy9svqw",
      "author": "ciringan",
      "body": "hi\n\nI had bulimia since I was 17. I stopped 4 years ago. One day I decided to stop I was tired of it \n\nIt was extremely difficult but I took day by day. I try really hard everyday to see the positive side to be in control to eat because I was hungry. Day by day things can change.",
      "created_utc": 1621124377.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyatbxm",
      "author": "StraightCantaloupe16",
      "body": "21F; also began when I was 15 in high school",
      "created_utc": 1621148129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyo14nc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621405763.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyr0e85",
      "author": "Theshyrelatableone",
      "body": "Hey, I’m 18 F and have been bulimic since 2019 and still on going! I thought I was recovering but only now it’s gotten worse.. I cannot stop feeling guilty. Also a question for you guys out there, I don’t know if this is normal but do guys consider like a snack or one meal a “binge eat” ? Like when I eat a meal in my head that’s me binging and automatically go throw up. Idk",
      "created_utc": 1621461074.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyuypff",
      "author": "Unfair-Long1508",
      "body": "I’m early-mid twenties, have been bulimic since I was 12 so most of my life. Struggled to various degree throughout that time - currently trying to recover",
      "created_utc": 1621539191.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyw9ybg",
      "author": "bestjamieever89",
      "body": "31 female, struggling for about 7-8 years.",
      "created_utc": 1621561939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gz08n1a",
      "author": "rubytheloser16",
      "body": "16F (ik the age for reddit is 17, plz don't attack me 😅) but I've been bulimic since I was 12 or 13 and it just gets worse the older I get, worst part is... Everyone thinks I don't suffer with it anymore but the truth is, I've just gotten a lot better at hiding it.. I'm tired of constantly eating in secret and lying to my friends and family but I also don't want help because it's been a pretty big coping mechanism of mine and since I'm on the chunkier side, I'm scared I'd get turned down for \"not being sick enough\" .",
      "created_utc": 1621644157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gz1cnxg",
      "author": "Inevitable-Fix547",
      "body": "21m, bulimic since 15 just like you. It's under control for me as long as I diligently track calories and keep all trigger foods out of the fridge/cupboard. I don't have the willpower to track year round though and that's when it gets bad again. \n\nIf I'm not tracking I can even eat a meal which logically I know isn't that catastrophic but simply the inability to put my finger in how much I ate makes me too paranoid to avoid purging\n\nIf anything getting fitter didn't help. After you go through some extreme suffering to get ripped the idea of letting a binge ruin years of work is incomprehensible. \n\nI'm an engineering student working on my masters and my two biggest passions are weightlifting and cooking",
      "created_utc": 1621672317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gz2pat3",
      "author": "tootifruitidjibouti",
      "body": "I’m 31, started purging at 15 and was actively bulimic from 17-27. Did ok-ish for a little bit, wound up developing anorexia instead for a bit (with no BPing which continues to amaze me), and now I’m not super sure where I’m at. I’ve considered myself recovered from bulimia but change always gets to me and I’ve just graduated with my masters and I’m getting married in five months so that’s some change I’m trying to cope with I guess. We’ll see.",
      "created_utc": 1621704590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzm1i4r",
      "author": "Divine_Entity02",
      "body": "I'm 18 and have been bulimic since I was 13",
      "created_utc": 1622100464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gznmz7r",
      "author": "napolionnappe",
      "body": "I'm 21 m. I've had bulimia since I was 9 years old. I'm alive and in recovery I still purge from time to time but it's much less frequent now than before. The same with the binge eating. I haven't binge eaten in like a few weeks",
      "created_utc": 1622134670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzpobml",
      "author": "your_average_egirl",
      "body": "20 F, 4’11 and have struggled since I was 12. Started as a “punishment” to myself, became about control when I was put into foster care and alleviating gender dysphoria at 14, started again as a trauma response and self preservation method at 17, now is a “diet” but really a way to feel like I’m controlling and “accomplishing” something as \nan adult",
      "created_utc": 1622168911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzpu8na",
      "author": "Kind-of-emo-",
      "body": "I’m 15, cis female. I’ve had on and off Bulimia for about 3, maybe 4 years now. Only recently diagnosed. Always been insecure, and constant bullying in my early childhood has not helped. Am currently undergoing treatment, but it’s really hard, haha. I like doing art, and playing video games. All for cottage core stuff, too. There’s me in a nutshell. (:",
      "created_utc": 1622172171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h05zfjw",
      "author": "rbeebuzzbuzz",
      "body": "i'm 21f, almost 22! \n\ni've had an eating disorder since i was 11, first anorexia (restricting subtype) and was extremely underweight by 12. i decided to try and gain weight around 14/15 because i used to love running but couldn't anymore. after weight restoration (at 17), i began b/p-ing and have been bulimic ever since.\n\ni love reading, writing, hiking, yoga and rock climbing!",
      "created_utc": 1622528486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h07y215",
      "author": "deeppurplecircles",
      "body": "26 f bulimic/restrictive circa 2011, never really stopped just became a part of my day to day life",
      "created_utc": 1622571323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h09pmif",
      "author": "bulimiaAMAthrowaway",
      "body": "I'm 20(F) and have been on and off again bulimic for the past 4 years. This recent relapse has lasted the last 3 months and i'm still struggling with it",
      "created_utc": 1622602148.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0drcej",
      "author": "meggymiss",
      "body": "21 year old female student! Behaviours began around 14? Very mild apart from a few points in my life up until about 2 years ago. Now in recovery! Three weeks no purging but have a lot of problems with spitting food and restricting.",
      "created_utc": 1622680600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0i5o2j",
      "author": "None",
      "body": "18F I’ve been bulimic since I was 16. Started out after being a kid who ate whatever she wanted and never gained until I was diagnosed with hyperthyroidism and lupus, the meds stopped me from losing weight and suddenly blew up an extra 40 pounds. I started with a friend but she stopped and I never did even after we stopped being friends. \n\nI used to play every sport, boxing, MMA, gymnastics, cheer, soccer, basketball and volleyball. These days I’m more focused on studies. Just earned my paralegal certification in a year as a senior in high school. Mmmmm fun fact I also have 10 piercings and 1 tattoo.",
      "created_utc": 1622764326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0zt6xh",
      "author": "joesprocket16",
      "body": "I’m a 25 m and was bulimic from 2013-2017. I am currently struggling with having more relapses on a regular basis which is why I am here.",
      "created_utc": 1623125122.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h12yzw0",
      "author": "mimu123",
      "body": "I’m 19 and have been struggling with my body image for about 5 years but have only recently become bulimic, I want to stop now because of the face swelling in my face! Does anyone know when this goes down? I feel like it never will",
      "created_utc": 1623190344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h19hb0y",
      "author": "TwoGroundbreaking573",
      "body": "I’m 15 and have had bulima for 7 months now. I have always struggled with body image ever since elementary school and the depression and anxiety that I’ve had for 4-5 years is fueling my ed. But many times I don’t feel sick enough so I try to fast for a week or two or restrict. When I fail I feel like a failure and would try to vomit but it would work so I cry. I’ve bee stuck in this mental breaking cycle for months but I don’t really want help now. Maybe when I’m dying. \n\nAlso, I like to draw\n(froggie_doggie355) insta",
      "created_utc": 1623320032.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1fjrjd",
      "author": "maria2345567",
      "body": "Bulimic for a little over 6 months",
      "created_utc": 1623435945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1kbkij",
      "author": "darkdemonofthemist",
      "body": "24F had problems with bingeing and purging from about 2012-2016, stopped bingeing when I was put on Prozac, still purge occasionally. Started with anorexia in 2011 at 14",
      "created_utc": 1623538840.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1l47kt",
      "author": "eaklv",
      "body": "27f, bulimic in high school to anorexia through my 20s now back and forth a lot 🙄 Dancer and trying to get my pilates certification. I love to be active but am pretty introverted. Started recovery last year but it never sticks too long.",
      "created_utc": 1623556021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1zxw7s",
      "author": "goldenmantella",
      "body": "29 year old woman, off-and-on bulimia and anorexia since 2010. Otherwise-specified category with orthorexia and compulsive overexercise a couple years before then, and anorexia at age 13. Cycling between relapse and recovery",
      "created_utc": 1623868426.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h26e3xs",
      "author": "Significant_Subject1",
      "body": "I’m 26 f and have been bulimic for about 8 years. I’ve been overweight my entire life and started experimenting with diet pills/purging just after graduating high school. It didn’t affect me much and I stopped for nearly 3 years, then picked it up again out of nowhere. I’ve been serving/bartending since 20 (working in the service industry with an ED suuuuucks!) I love crocheting, raving, my dogs, and obsessively buying books faster than I could ever read them.",
      "created_utc": 1623992658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2cnvt5",
      "author": "polkah",
      "body": "Just joined this sub, I'm 23, studying art .After years of being overweight, a bit over a year ago I got into rock climbing, which gave me the strength and will to be more active, and a bit more mindful about how i ate, without restricting myself or being super obsessed with dieting or anything. With the lockdown and the inability to do most activity, I started exercising daily at home, and be more and more obsessed with what I ate, my weight and appearance. For months I counted every calories I ate, never allowing myself to step out of my food plan, and lost a ton of weight. About 2 months ago I began having binge eating episodes followed by purging. At first they were quite rare, but they have been more and more common lately, now it's about 1 to 3 times a week. I think i'm quite lucky that I quickly realize I had a problem though, and I started looking up which doctor I could go and talk to, I'm slowly telling myself that this isn't a problem I'm gonna be able to solve on myself.",
      "created_utc": 1624129565.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2indyz",
      "author": "marsmango5",
      "body": "21, nonbinary, been on and off with ana since i was 10 but recently developed bulimia",
      "created_utc": 1624264504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2l19a8",
      "author": "deadskank",
      "body": "im 19 and i have struggled on and off with purging since I was 12 yrs old. now that i say it like that it seems rlly sad lmfao",
      "created_utc": 1624311657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2lmwfj",
      "author": "professionalfatasss",
      "body": "i’m 19, almost 20 (f) and i’ve had disordered eating since early middle school, but for many years it was mostly bulimia. I now struggle with a vicious restrict, binge, purge cycle. i’m also a hands free purger, which oddly feels invalidating to me since i don’t have the typical “bulimic mark” on my knuckles. anyways i’m over sharing lol",
      "created_utc": 1624322952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2plv1s",
      "author": "CherrySodaBoy92",
      "body": "I’m 29 (m) and I’ve been bulimic since high school. It’s come and gone in waves, some waves being worse than others - usually brought on by stressful times that I’ve gone thru. The last being losing my job during covid and being unemployed in Los Angeles for a few months. Things are finally bouncing back and I’m doing better but this was probably the worst it’s ever been for me. However, I’ve finally reached a point where I’ve accepted I need to get help and It’s on my to do list.",
      "created_utc": 1624406136.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2sj4np",
      "author": "None",
      "body": "I am 16F and have suffered from anorexia nervosa since I was 15. It was only until this past year my illness has gotten worse. COVID definitely didn’t help with everyone being so isolated. I love hiking, running, cooking (yeah, I know. Ironic am I right?), and gardening. I hope to beat anorexia before I am an adult.",
      "created_utc": 1624470472.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2ym49t",
      "author": "None",
      "body": "Im 17f, I have had disordered since i was 15 but only during quarantine has it manifested into something much worst",
      "created_utc": 1624595548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h38psbe",
      "author": "None",
      "body": "A little late... I'm 23 f, I have bulimia since 2 years. Before, I never had any eating disorder... I was natural skinny and people used to bully me for that and make stories behind my back.. Calling me anorexic, that I didn't eat ecc ecc... But I ate whatever I wanted without mixing emotions, food never been a problem to me. Unfortunately since 2 years I use food for fulling my internal voids and emptiness. I really want to die sometimes.",
      "created_utc": 1624821828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h397e8u",
      "author": "RumyanaRomelova",
      "body": "Hi. I'm 18, female and I've struggled with anorexia for the last three years and a half. I'm attempting recovery but have gained weight and started purging. I've honestly downloaded Reddit for tips on how to purge but I'm on the recovery track again and will try my very best not to. I don't want to live in that hell all my life (despite being suicidal and hoped to die because of anorexia. Now I've decided if I die it's gonna be because I say so not because ana does).",
      "created_utc": 1624830558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h39jhb7",
      "author": "purplefluffysnail",
      "body": "22F from Switzerland and have had some form of disordered eating at least since puberty. I was stuck in a binge/restrict cycle for a few years, then started purging in december of 2016 during a bad depressive episode. Since then I’ve been in a vicious cycle of binging and purging. Currently in a php programm, but struggling with ambivalence vis a vis recovery. Also reconsidering whether I want to continue with my studies (philosophy/history) as it causes me a disproportionate amount of anxiety.",
      "created_utc": 1624837124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3dknhh",
      "author": "DramaticBat",
      "body": "I'm 24 f. I've had it since I was 17. It started from trying to lose weight, then I lost more weight throughout college. I abused adderall and Vyvanse for a short time back in college as well. I guess I was in recovery since June 2020. But my fiancé passed away suddenly this month, so its coming back again.",
      "created_utc": 1624920978.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3qc616",
      "author": "stardustbasically",
      "body": "16f, i think i’ve basically developed it at this point, learned how to do it a few days ago and since then it’s been nonstop. currently sitting on the floor of my bathroom about to go again but i think after this im going to try and stay clean until as far as maybe monday? quite ambitious but i’ll try my best. before this i struggled with anorexic/restrictive tendencies but was in self induced quasi recovery for a month. ya:/",
      "created_utc": 1625175237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h49d7mf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1625593122.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4cd15o",
      "author": "theHBIC",
      "body": "I’m 31f. I’ve had bulimia for the last 8 years on and off, with the last 5 being pretty relentless. I had anorexia in high school, recovered on my own in college, then took a hard left into purging during my first full year in my career (it took me about three years to find a full time job after I graduated). I am medically obese and have been to treatment twice, trying to fight the need to go a third time.",
      "created_utc": 1625657616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4i37qk",
      "author": "None",
      "body": "20(m)\n\nBullimic since age 14-15-ish. Currently am able to keep weight stable with some questionable methods. \n\nOverall, as long I have something I'm focused on, be it a lot of school work or a game/book I'm addicted to (I like playing video games and I like reaidng even more), can keep me away from the toilet with no problems. The moment I'm out of games or books, I find myself usually feeling bored and kind of \"empty\"? It's hard to describe. Then I tend to do this thing everyone else knows, \"binging\" and my bullimic reflexes kick in and I purge, cycle repeats. So overall \"cure\" was something that I can lose myself into. The moment that is out, I'm out as well. \n\nBecause of that, Covid really didn't make a difference for me. Games and books I read on my computer/phone, so a pandemic doesn't do much. Didn't went out a lot to begin with. I think the most annoying thing about me, and an \"irl social life\" would be that I couldn't attend any gatherings that involve food. I need the right time and right mood to eat stuff. Else I just feel like something invaded my body, bullimic reflexes kick in, purge, cycle repeats. Probably that's why I avoid social situations in general. \n\nThat's about it. Hope you can get an image.",
      "created_utc": 1625768963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4k5l2z",
      "author": "Individual_Piano1061",
      "body": "I'm a 12 year old girl, have had binge purge type anorexia for 1 year. I have 2 cat, do rhythmic gymnastics and love going on walks/hikes with friends and family (I have an additional diagnosis of OCD).",
      "created_utc": 1625807214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4n9m76",
      "author": "MoschinoLover",
      "body": "I am a 21 F and have had an ED since 13. I started with restricting and using diet pills (might be considered bulimic not sure), to being underweight for a time period and only restricting (diagnosed as anorexic), to getting at a healthy weight and having cycles of binging, purging, and restricting. I’ve been clean for a few months but I still consider myself to have an ED because those tendencies are still there. I guess I’ve been severely restricting lately but I’ve been immensely stressed so eating is just hard right now. But no binging and purging for now.",
      "created_utc": 1625872703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4tcgjf",
      "author": "wafflerain5",
      "body": "18F and have oscillated between binge eating, bulimia since 14 after a short stint of restriction.",
      "created_utc": 1626016305.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4tdkow",
      "author": "cactusscorpion",
      "body": "i’m 19m and have basically struggled with disordered eating for my whole life but in the past 3? years it’s probably been at it’s worst and most consistent in my behaviours",
      "created_utc": 1626016883.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4uucik",
      "author": "lilly_illy",
      "body": "26 f, been bulimic for probably around 5 years now. I do it once every 2-3 weeks (used to be 1-2 times a week). Never got help, and still trying to recover once and for all on my own.",
      "created_utc": 1626042548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4x8q43",
      "author": "dalexearnhardtsghost",
      "body": "I’m 27. I’ve been bulimic since I was 11. And my teeth are starting to feel icky. My mom has struggled with ED her whole life and that kinda pushed me into that direction as well with her comments towards me and about herself, being weird about food and glorifying underweight models. She regrets it now seeing how bad I am going through it. But body dysmorphia and mental instability is hard to deal with and I can’t blame her for it. As I got older my bulimia got worse and multiple times daily sometimes every meal. I want to get help and change but it’s very hard because binging and purging is an eating disorder and a coping mechanism for me and I’m almost scared to lose it. And it fuels it when people tell me I look like I’m losing weight… (maybe this is part of the reason they tell you not to say that anymore lol) had times of just plain old not eating as well. On the other side of the toilet (lol) I’m a barber, a musician, I ride horses and barrel race, I go to the river every weekend, and honestly enjoy my life with my boyfriend and dog. My boyfriend actually knows About my bulimia. He didn’t for awhile and then he heard me doing it. He tried to push me to get help for a long time then realized it needs to be my decision. So he’s my emotional support after the fact although I almost felt it was easier to deal with when nobody knew. \nThankyou for posting this. It makes me feel heard and happy I’m talking about this.     P.s. we all know it’s hard to get help, so in the meantime does anyone do anything to help their teeth stay ok?",
      "created_utc": 1626099836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h50ah37",
      "author": "monsterhandholder",
      "body": "19m, relapsed back into bulimia after forced, traumatizing anorexia recovery january-february. Eating disordered since birth thanks to my freak father; started engaging with it directly around 13 years old.",
      "created_utc": 1626155061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h51zl4o",
      "author": "None",
      "body": "Mid 20yo female. I’ve been struggling on and off with EDs for 10 years. Never been in treatment or that bad. Still not helping.",
      "created_utc": 1626195130.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h55254r",
      "author": "None",
      "body": "I am 20f, have been a bulimic since 2017 after my anorexia",
      "created_utc": 1626259286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h583tbi",
      "author": "SinfullySinatra",
      "body": "I am 21 (f) and I’ve had BED since about 17. This morphed into what I believe is non-purging bulimia with excessive exercise and restricting or perhaps EDNOS. I’m autism is a garden variety of other mental illness as well as celiac disease. I’m currently doing the prerequisites to get into nursing school. I love to ride my bike, write, reading, nap, cook, and stim. I love cats(I have 3 and feed many ferals), love children, love Fall Out Boy and MCU. My goals are to recover, lose weight, graduate with a BSN, and become a mother.",
      "created_utc": 1626313397.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h58czez",
      "author": "FewGoal2194",
      "body": "I'm 23f was bulimic from 2012-2020 recovered for 325 days now!",
      "created_utc": 1626318192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5bafxw",
      "author": "flamingtrashmonster",
      "body": " I’m 25 f. Bulimic since 15. Developed an ED around 14. \n\nParents didn’t give a shit about my ED. My dad already ignored me for the most part so that was expected. My mom was verbally and emotionally abusive, and my bulimia made me even more vulnerable to her abuse. Extremely vulnerable. Began to smoke cigarettes and drink by late 16 to cope, then drugs. Found our adderall would stop the b/ping (and me eating at all), so I began to abuse it until I started having seizures - and even then I didn’t stop. Was kicked out right at 18, thought that was the end. \n\nAnd now I’m here. Things are much better :)",
      "created_utc": 1626378559.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5i7lwu",
      "author": "Lyswaldo11",
      "body": "I’m 22, I was diagnosed with anorexia when I was 15, but then became bulimic when I was 20.",
      "created_utc": 1626521071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5j6e3o",
      "author": "Pure_Point2682",
      "body": "31 year old female here. Been struggling since I were 15.  I been eating once a day, then purging after meals because I eat too much then feel guilty. I also used to exercise 10 to 15 hours a week but due to COVID gyms here are closed so I feel awful. I gained so much weight, now I don’t know what to do really. Have not been eating now for 20 hours and I feel like eating a lot. I wish I could control myself but also I feel proud when in not eating and purging :,) I don’t think I will ever get normal",
      "created_utc": 1626540750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5sttur",
      "author": "Unfair-Long1508",
      "body": "Early 20s, female, and have been bulimic since I was 12. Various phases of being really sick to recovered to not as sick between those times. Currently struggling a bit but overall trying to recover",
      "created_utc": 1626729895.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5t3xtr",
      "author": "AnonIsAFangirl90",
      "body": "I’m 31. Malay from Malaysia. 162cm, 74kg. Chubby/overweight on the bmi scale. I used to be a scrawny kid who could eat anything and not gain wait until I reached 10 and became chubby because I suddenly started growing boobs. I hated my body from then on right up until I was 16, called all kinds of hateful names for being chubby like “fat”, “fat bitch”, “she shakes the ground when she walks by”, “giantess”, etc. I started going on a more extreme diet at 16, obtaining some herbal diet pills and really really abstaining from sinful foods. I became obsessed with losing weight and whenever I ate something bad like lasagna or cake, I would throw it up. I remembered once when I was eating a slice of chocolate cake and being so consumed with guilt I put my head down on the table and cried. Just sobbed and my mom asked me “what’s wrong!?” all concerned like. I told her I felt so guilty for wanting to eat the cake. She told me it was okay to indulge and enjoy in cake sometimes. A little after that, once I couldn’t throw up in the bathroom I shared with my brother because he was using it so I had to throw up in my parents’ room. My mom saw remnants of my little escapade and she spoke to me. She asked me if I had been throwing up and I said yes, I started crying and I told her that I so desperately wanted to be skinny. She said “But this is not the right way. Lily, you could die.” And in my tears I said “I’d rather die skinny than die fat.” \n\nSuch painful memories. Just thinking about that time makes me so sad. I lost 7kgs at 16 quite rapidly. I became 62kg and many people complimented me. I cried nearly every night in bed. \n\nI gained it all back at 17. Lost weight again at 21 by completely cutting out rice which is our main energy/carb source. And when I say completely, I mean completely. Absolutely no rice whatsoever. I was starving constantly…But compliments helped.\n\nI gained so much when I started working and had access to money and whatever food I wanted at 23. I ate and ate and was diagnosed with pre-diabetes. I was diagnosed with diabetes type 2 at 26. I tried to go to a slimming spa to help me lose weight but all it did was make me go so deep into credit card debt. I lost only 3kg. At 28, I dieted as hard as I could only relapsing once. I lost the weight again. Went from 80 to 70kg. \n\nI’ve gained 4kg since with me yo-yo-ing up and down from 70 to 71 to 73 to 74 and you get the idea. I haven’t actively purged from guilt since January this year.",
      "created_utc": 1626734542.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5xjkd4",
      "author": "None",
      "body": "20, female. First b/p I was 13. I have always been “healthy”, normal weight, just yoyoing between borderline underweight and borderline overweight but mostly somewhere in between.",
      "created_utc": 1626820599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6kcvca",
      "author": "Alternative_Slip_808",
      "body": "I am 33f from the west coast of Canada. I have been bulimic and anorexic since I was 14. After I turned 29, I was ED clean for a while, but I slipped back into disordered eating after I had my son. I just recently started kickboxing so I am hoping this will put me on the right path. We will see, I guess.",
      "created_utc": 1627287252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6ko9mc",
      "author": "annouchka1995",
      "body": "Hi! I'm 26f, I struggled with disordered eating since I was 13-14 - was obsessed with my weight and staying thin since I was a child, doing ballet. My dad was always obsessed with fitness and staying lean, would make fun of fat people and commented on my older sister's weight gain when she went through puberty - I was terrified of going through the same thing, started with eating as little as I could but became bulimic at 14-15 when my mother passed from cancer. Since then I've been struggling with it, the worst was when I was 20-22. Now I am in recovery but it's still 80%-90% of my thoughts and I still have a lot of work to do, esp when I am in pain or anxious. I am a PhD student in fashion and I teach, I love my field of studies, arts, poetry, all types of movement including music that are not in front of a mirror, writing and learning about the brain. (wow I realize most of my adult interests are all related somehow to my history of ED... lol anyone else)",
      "created_utc": 1627297451.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6rmxca",
      "author": "itwill_beokay",
      "body": "Im 27 been off and on bulimic since I was 12. Havent gone a day without purging now for 2 weeks and I am struggling to stop.",
      "created_utc": 1627428786.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6sx1zf",
      "author": "lostinth3Abyss",
      "body": "24 f",
      "created_utc": 1627454794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6uits6",
      "author": "Ace_of_rainbows",
      "body": "New here I guess! I’m 22 now and was bulimic since I was 15 or 16, promised myself last year I’d do whatever I could to get better, it went well for 8 months, but after a breakup I had a relapse, which leads me to now, almost 7 months since and doing better!",
      "created_utc": 1627489955.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6zc4hw",
      "author": "dalexearnhardtsghost",
      "body": "Thankyou for this post btw!!!",
      "created_utc": 1627580584.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h72buu5",
      "author": "curiouscluck",
      "body": "i've been on and off with bulimia for around 3 years. i'm 34, im a human rights lawyer and i've never sought external help",
      "created_utc": 1627637545.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h79kqvt",
      "author": "versaceshusband",
      "body": "Im 21f and have been struggling with bulimia since 2017 on and off (currently 1 month clean!)",
      "created_utc": 1627781255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7hjra2",
      "author": "kaitlyn-leeloo",
      "body": "I'm 17 (f), been ED since 13. I started my recovery in March of 2021, but was clinically diagnosed in early February 2021. Since middle school I've jumped in between bulimia and anorexia, it really does make me sad though how long this has been going on. I honestly feel like I've wasted all my teenage years to this illness. :(",
      "created_utc": 1627945856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7kxnc4",
      "author": "Enough_Cow6484",
      "body": "I'm 19 and have been bulimic since 14",
      "created_utc": 1628014819.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7l4r0x",
      "author": "jazi2306",
      "body": "18F has been struggling with bulimia since the age of 14. I really struggle with even just a little bit of weight gain and i used to have both anorexia and bulimia but now i just can’t seem to starve myself all i want to do is stuff my face and then purge.",
      "created_utc": 1628017774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7pou82",
      "author": "None",
      "body": "im a 16 year old girl, i've been bulimic and anorexic since i was 11-12, in recovery but i slip often 🌸",
      "created_utc": 1628104611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h82odj7",
      "author": "back_againx13",
      "body": "I'm a 43-yr old female that developed anorexia at 30 after a painful divorce. After almost 2 years I became bulimic, which I've been battling ever since. I've recently made a huge amount of progress, though, which has given me hope that the end of this nightmare might actually be possible. I also have a couple of other significant psychiatric diagnoses that complicate all this bullshit even more, but I'm putting one foot in front of the other and am doing better than i have in a very long time.\n\nThis is a great forum and i hope that you find it helpful. I'm really happy to see that you've decided to participate. Men are very much under-represented and underserved when it comes to eating disorders. I'm a very open person and love to help others, so if you ever need to talk to a total stranger about something that's on your mind, feel free to inbox me. Best of luck to you, and i hope you and yours are happy and healthy out there!",
      "created_utc": 1628355860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h84gtjp",
      "author": "None",
      "body": "I’m 25 (F) and have been struggling with bulimia for almost 16yrs now. I’m in recovery but it’s progress. I slip but always try to get back up. I’m also a vegan chef so I guess that’s it really. I turned my obsession into a career and it’s actually helped with my recovery or constant attempts with recovery.",
      "created_utc": 1628388177.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h85yfxp",
      "author": "speakloudly",
      "body": "31f struggled with restricted eating at 12 which developed into bulimia by the age of 14 and I just recently recovered. I am a high-level assistant in the entertainment industry and up until a year ago I was severely suffering. I have two kids (4m,5monthsf) and they motivate me to continue to do well.",
      "created_utc": 1628427725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8lcdag",
      "author": "Spiderman230",
      "body": "I am 20F and I was discharged from the eating disorder clinic when I turned 18. I had bulimia/ednos from when I was 14-17.I have been basically recovered for almost 3 years now. However, I'm just having my old ED thoughts a lot lately",
      "created_utc": 1628721991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8m33er",
      "author": "kathl51",
      "body": "i’m only 15 (shhhh don’t tell reddit) and i have had disordered eating (possibly bed) since i was 7 and bulimia since 2019. i still haven’t recovered but idk i try my best",
      "created_utc": 1628739561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8nc0rc",
      "author": "Albatross0216001",
      "body": "I am 20, female, been bulimic since I was 17, and still am. I am a medical student and fitness enthusiast. I ran a half-marathon last year, I passed all my exams, looking forward to be 3rd year in medical school, while been bulimic almost every day. It's hard keeping you mind on track with this disease, sometimes I wonder how much better I would be without it. 🙁",
      "created_utc": 1628772008.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8ydzlu",
      "author": "JellyCharacter1653",
      "body": "Hi I’m 14 been struggling with bulimia since I was 10 n now anorexia I haven’t gotten professional help Bc of my mom I try n tell her but it always turns into an argument she’ll say oh so it’s my fault or you better not talk to me about this n she’s a nurse a freaking nurse I weigh like 105 Bc of a bad breakup where I didn’t eat for basically months and nobody noticed I’m trying to recover on my own rn with the support of my bsfs n stuff n I’ll relapse sometimes with bulimia",
      "created_utc": 1628974972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h91p260",
      "author": "s05k14w68",
      "body": "I’m 53 & went through anorexia-bulimia-anorexia-bulimia on & off depending on where I was in life.  Right now I’m menopausal & using restrictive behaviors to ward off age-related weight gain.  I’m on this sub to gauge my thought process against comments & behaviors here.  I find myself obsessed with losing & keeping weight off under the guise of being healthy but it consumes a lot of my headspace.",
      "created_utc": 1629044858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h98gg2f",
      "author": "None",
      "body": "23 f, bulimic since 15. A byproduct of my bpd",
      "created_utc": 1629163715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9eohu9",
      "author": "fsk1116",
      "body": "I’m 28(f) and have had anorexia nervosa binge/ purge subtype for 14 years. I’ve had several years in recovery, but recently relapsed. This group has helped me so much with not feeling so alone.",
      "created_utc": 1629293725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9lw7lm",
      "author": "Cyber_jax",
      "body": "I’m 18(m) and I’ve struggled with an eating disorder since I was 13 I was in an extremely physically abusive household and they would lock me in a room by myself and not allow me to eat I felt like I deserved it so I started restricting and purging whenever I did eat something now I’m a barley functioning adult",
      "created_utc": 1629422626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9pmgwh",
      "author": "kedikahveicer",
      "body": "29, M. Eng.\n\nI've had bulimia since being about 14/15. I've basically yoyo-d between the weight ranges for those years and it's been pretty tragic. I've seen morbid obesity, I've seen being underweight almost being dx with anorexia, with mentions of anorexia in my GP Health Record (... which I only found out in the last few weeks).\n\nI only joined today. I figured it was about time I had somewhere to talk about it. Especially since I'm relapsing pretty hard rn and my support network has weakened.",
      "created_utc": 1629493793.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9ynfq5",
      "author": "allratsarebi",
      "body": "i’m 19m, i’ve had bulimia since i was 15 was in remission for 4 years and relapsed recently but i’m trying to take my hobbies and life back :) i love baking and running and i have pet rats and i’m a barista!!",
      "created_utc": 1629670752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hatn5mr",
      "author": "van_dalismus",
      "body": "31, f. \nStarted with 14ish, had a relapse recently after almost a year of being free of messing. \nTried those funny diary cards earlier but only a strict diet helped yet.\nTrying to see it as reaching a a further level.. Next level would be crossing 1.5y. Hoping for the best.\n\nGood luck to you!",
      "created_utc": 1630256401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hbaetgc",
      "author": "LifeisHard2257",
      "body": "20 (F) I’ve had an eating disorder since my early teens around 14 or 15 is when it started. I don’t know what it was characterized as back then but I would binge and restrict until I lost the couple pounds that I gained from binging. Since 2019 I’ve been full on bulimic with binging, purging and restricting. It’s a terrible cycle. I’ve been to treatment out of state in Indiana in a in home facility for 2 months. It was one of the hardest things I ever done and honestly I need to go back but I’m not in recovery",
      "created_utc": 1630567041.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hbdfb4o",
      "author": "EconomistRare5634",
      "body": "I’m 18, f and have had bulimi since I was 14 years old. I’ve joined because it makes me feel better knowing I am not the only one going through this and there is hope for improvement. Nice to meet you all!",
      "created_utc": 1630620951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hbejpkj",
      "author": "Illustrious-Ad5059",
      "body": "I’m 24(f) and had bulimia since December of 2019. I’ve had issues with binge eating and insecurity around food/self image since I was a little kid though. Seeing a therapist and dietitian that specialize in eating disorders and things have sorta gotten better! Keep your head up 💗",
      "created_utc": 1630640113.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hbhwom0",
      "author": "_intusmortuis_",
      "body": "32F, mom, accountant, I've had an eating disorder for 20 years. Struggling really badly right now. I wish I had an identity outside of those 3 descriptors, but I really don't. I used to have dreams. I used to feel smart and driven and passionate. Now I'm just forcing myself to live each day to make it to the next, hoping one day something will click and I'll get better before I have an esophageal rupture and die in a toilet bowl filled with my own shame. Sorry that got so dark, but I guess that's the best way to describe me.",
      "created_utc": 1630705257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hc1p84d",
      "author": "workingonselfkind",
      "body": "31F-EDs from 18 and some disordered thoughts/behaviors before that.",
      "created_utc": 1631101000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hc7vr8l",
      "author": "TealAppeal85",
      "body": "Freelance artist, and do paid commission work thru my instagram @tealappeal80. I'm 180lbs and I've had Bulimia since i was 15 due to severe bullying/abuse in school (Yay) I used to be 300lbs...😅",
      "created_utc": 1631215923.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hccmtgd",
      "author": "the_peanut_shuffler",
      "body": "25m have had binge eating issues for life, but had bulimia from 20-22 with vomiting, but stopped vomiting frequently at that point",
      "created_utc": 1631302870.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hcjtgg0",
      "author": "ChaosShenanigans",
      "body": "Im 30 f, started out as anorexic from age 14 and that gradually developed into bulimia. At present I have been in treatment since 2015, but I seem to switch between bulimic disordered food behaviours and anorexic disordered food behaviours. I have intense periods of bp and then I have periods of heavy restriction, which after a couple of weeks/months lead back to bp.   \nIf I had a magic wand to make it all go away I'd do it in a heartbeat. Sometimes I think I'll never fully recover bur that wont stop me from trying my hardest.",
      "created_utc": 1631445149.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hcmq5oa",
      "author": "None",
      "body": "22f, had bulimia since 15, disordered eating pm all my life",
      "created_utc": 1631491920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hd5mt28",
      "author": "TwoEnns",
      "body": "I’m over 50 and have struggled with bulimia for the past 10 years (maybe a little less). \nMenopause and weight gain made me think it was actually a good idea, for weight control. So dumb.\nThis can hit anyone, at any stage of life, and it is so insidious. Also, I think it’s like this big secret, but I’m pretty sure my friends and husband know. Hard to control; I hope we all are gentle with ourselves, and forgiving.",
      "created_utc": 1631843438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdx9l09",
      "author": "Godzilla_Exploding",
      "body": "18 (f). The bulimia started this year. One day i ate a lot and then decided that i should at least try to throw up to feel better before going to bed. The next morning when i weighed myself, i realized i had not take any weight on. So i continued the pattern. Til now.",
      "created_utc": 1632368376.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdxjd2q",
      "author": "None",
      "body": "22 and bulimic for 8 years. I do not binge/purge as much as I used to but i’m really struggling with laxative abuse. not because i think it’ll make me lose weight but because i’ve been restricting as well and can not shit on my own at all",
      "created_utc": 1632374440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdxq5gp",
      "author": "None",
      "body": "21 (f) bulimic 13- today, on and off recovery, Hispanic, fat as fuck",
      "created_utc": 1632379575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdy20wg",
      "author": "None",
      "body": "I'm 29.\n\nStarted severely binge eating age 14-16. Gained weight rapidly. Became overweight, got sick of going to bed feeling sick and full every day. Hated what I looked like, felt like shit all the time.\n\n Started purging here and there and then every day. Rapidly (12 month) lost 10kg by 17,  by 18 years old I'd lost 17kg. \n\nBetween 18-23 I maintained a weight of a 16-18.0 BMI. I was very very underweight I looked skeletal and probably was bulimarexic. I regularly ditched events to binge purge and spent so much money on it. I was in such denial. *At least it's not drugs, I deserve it, its the only thing that makes my life bearable, you are just jealous because you aren't thin. Lol idiots trying to make me overeat I'm just gonna throw up.*\n\nAt 25 I identified it as a coping mechanism more than anything. That's what it is and was first and foremost. The fact I'm not morbidly obese and haven't suffered from my stomach exploding were just side effect advatages from purging the huge binges I still even engage in today.\n\nI currently still engage in this behaviour almost every day but I will also eat.several.meals properly, sometimes even post binge. I am also sitting comfortablly at a 19-20BMI. I regularly feel very tired out, it's catching up with me for sure.\n\nIt's affected a huge amount of my life financially, relationships, the ability to complete education, having to avoid social situations, being caught out for what I was doing in social situations. I posted a reply on an old account that I thought was quite light hearted and funny of some of them. The OP replied full of saddness and.pity for me.\n\nPlease try to get help so you aren't in my position. Save yourself $100k.",
      "created_utc": 1632390381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "he1d8v9",
      "author": "Callmecucumbere",
      "body": "I’m 28(f) and I’ve been bulimic since 15/16. It’s been up and down but I’ve purged usually once a day up to 6 times except for 2 one week long periods of time, as well as several days here and there. I’m in an IOP program right now. I’ve struggled with alcohol addiction and have been sober for over 2 years now trying to work on this. It’s hard.",
      "created_utc": 1632446922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "he701k7",
      "author": "Nuppual",
      "body": "I'm 18 and started bulimic behaviour when l was 14. It's worst at spring idk why.🤣 l'm bulimic like one month and then stop from 2 weeks to 3 months but it always comes back bc l'm not trying to stop l just try to be skinni.🤔",
      "created_utc": 1632553896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hebgdye",
      "author": "MourtyMourtMourt",
      "body": "I’m a 39 year old woman, mother of two young kids (old I know) I have had eating disorders all my life. I am mostly recovered, except for my binge eating disorder. That one keeps tearing its ugly head",
      "created_utc": 1632638315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hebreu4",
      "author": "stelas",
      "body": "I'm 23f and living in Melbourne, Australia. I had anorexia from ages 13-15 and bulimic 16-now",
      "created_utc": 1632647025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hepn2i9",
      "author": "jbpdaddy666",
      "body": "31 (F). Disordered eating from young - sneaking food to eat in private. Developed into bulimia at 15 during full-time ballet training (the perfect environment). I recovered and maintained a healthy weight 16-23. I relapsed at 24 due to hormonal weight gain and have been on/off since then, with significant weight fluctuations. I am hoping to have a baby in the next 2-3 years and am committed to my recovery now for this. I have just made the commitment in the last few weeks, attempting self-education and help first. I have promised myself if I cannot succeed with this after 6 months to seek professional help. Much love to all in this sub 💕",
      "created_utc": 1632916439.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hey1trt",
      "author": "None",
      "body": "I’m 20f and was bulimic 2011-2020 but I have since recovered",
      "created_utc": 1633068120.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfapkvs",
      "author": "Sweaty_Ad_8262",
      "body": "i’m 15 and currently suffering with undiagnosed eating disorder. no i’m not one of those salad bowl “omg i’m so fat” girls. i’m severely underweight and can’t even get out of bed anymore",
      "created_utc": 1633309497.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfgpqb9",
      "author": "None",
      "body": "29 (F), have struggled with bulimia for over 10 years now. Constant internal battle between wanting to recover (and being terrified at the prospect of doing so), or just giving in and letting this beast win. \n\nSo sorry there are so many of us out here, but happy to have found this community. Love and warmth to you all💕",
      "created_utc": 1633430488.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hgs4c2b",
      "author": "neveragainscully",
      "body": "I’m almost 40, and have battled disordered eating since single digits. First diagnosed with AN at 17, that became a BN diagnosis around age 22… I had a mostly recovered long period of time in my late 20s, and several extended periods of bulimia in my mid 30s… mirrored with disordered eating to gain a new EDNOS (ig now that’s OSFED, but my chart says EDNOS…) diagnosis more recently. Last few months I have slid back into full blown (laxative abuse) bulimic behaviours and it’s been really miserable. I deal with cPTSD, DID, OCD and severe insomnia as well as NSSI and a host of physical illnesses. And while I logically know that very quickly this will become something I do not and cannot control… I know that I fall onto the ED trap with that intention: something I can control because nothing else in my life feels controllable.",
      "created_utc": 1634328769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hh5naeg",
      "author": "RosaShark",
      "body": "26 (f). I started developing an eating disorder when I was 13. Got help when I was 20, but depression and anxiety has made me relapse. I’m trying to recover now with a diet plan (not to lose weight, but to prevent binging and unhealthy food). I’m also working on my self-esteem.",
      "created_utc": 1634592000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhff06j",
      "author": "borderlinebaggage",
      "body": "I’m 20f started with anorexia 12 till about 14 and been fighting bulimia ever since until this year where I kinda fit into both? So I guess anorexia purge??? Not sure, don’t want to self diagnose I’m just guessing :/ I don’t work atm cause of other mental health issues but one day I wanna be an occupational therapist for the nhs!",
      "created_utc": 1634773549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhq26k3",
      "author": "wwwdotWeirdperson",
      "body": "I’m 14(f) and have been bulimic since I was 13, anorexic since I was 12. \n\nI hope you have a speedy recovery! If anyone feels the need to dm me, feel free, I’m here to help<3",
      "created_utc": 1634979225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhwm8ha",
      "author": "alexisseffy",
      "body": "Im 16 (F) have been binging/purging/restricting since I was 13. I've struggled with body image, self harm, skin picking,  and anxiety since I was much younger, and childhood trauma to top it all off. First started having symptoms of depression when I was 11. I kept it a secret until I told my pediatrician in Feb 2020 and got diagnosed and got meds; she has helped me soo much! Now I'm 6 months into recovery, not recovered, but at least doing better. I definetly do not regret reaching out for help, even though it was very difficult. It sucks, but at least I have professional help and Reddit! I see a therapist, pediatrician, psychiatrist, and dietitan. And went to an IOP program for 2.5 months. Still consider myself to have an ED. I like art (watercolor), my doggo, and reading :)",
      "created_utc": 1635107710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hj4fe0g",
      "author": "Own-Newspaper1296",
      "body": "I’m 29 f. I’ve had body dysmorphia and an ED from probably the age of 18. I’ve been bulimic for a few years but earlier this week I’ve admitted my problem to my partner and decided it’s time to stop.\nI’ve hated myself for long enough, I can’t do it anymore.",
      "created_utc": 1635925827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjxgjjf",
      "author": "myonlyonethrowaway",
      "body": "20m. Bulimic for about 3 years, though i managed to stop for about a year and then some. Back to it though unfortunately.",
      "created_utc": 1636461730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjysq8p",
      "author": "Forget-Me-Not-Fairy",
      "body": "I 22F have been bulimic since I was 12 but was anorexic the previous year so 11 was when this shit started. In 10yrs the longest I have gone without purging is 2 months. Looking for the motivation to recover but things are pretty bleak rn so fml",
      "created_utc": 1636482746.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjzhm84",
      "author": "schreckbn",
      "body": "24 (m) Im relatively new to all of this and don’t know what to think, to start I feel like there’s little to no men (tech less than 10%) so it’s nice to see someone of the same gender. I’ve been a binge eater for as long as I can remember. I’ve newly picked up purging and not going to lie, I love it. I feel like I have power over my life again. I just moved to NYC with my now ex boyfriend. I have anxiety and OCD. Plus I’m gay. Keeps my life relatively busy. XX",
      "created_utc": 1636492625.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hk6ivwk",
      "author": "Enough_Cow6484",
      "body": "I'm 19 f, have bulimia since 14. I make things from clay. I study management. I'm now almost 9 days bp free",
      "created_utc": 1636619338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hkt7g3z",
      "author": "CarlyS322",
      "body": "22 year old female here . Developed anorexia at age 11. Recovered somewhat for a short period of time . Developed bulimia at age 13 (almost 14)  Dealt with bulimia and anorexia . Was also hospitalized inpatient at age 14. Had a feeding tube. Recovered . Had a few relapses here and there , but nothing major .  Had a major relapse at age 20. Recovered . I hadn’t purged for two years ... until today.",
      "created_utc": 1637034419.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hkx5ymr",
      "author": "Emmybug12",
      "body": "21, been bulimic since I was 19, anorexic from 13-18 then tried recovery",
      "created_utc": 1637106698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hky5l9p",
      "author": "someday0001",
      "body": "I am 19, I have been eating disordered since I was 15. Back then I wasn't diagnosed with anything. I wasn't anorexic or bulimia, I think I was somewhere in the middle. I basically starved myself for days, then I would binge and the cycle would repeat. I lost a lot of weight, but I was slightly overweight before so people just thought I was getting healthy. Anyways time went on, I somehow managed to recover around 17. My eating pretty much normalized until spring last year when I tried purging for the first time. Now I am bulimic.",
      "created_utc": 1637122767.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hl5dc0o",
      "author": "None",
      "body": "I'm 15(nb) and have been bulimic since I was 7. It had been bad for a while and got worse in high school and I've been in treatment for about a year, in outpatient now. Nice to meet you!",
      "created_utc": 1637258924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hl7g9nx",
      "author": "None",
      "body": "Im 15 M, I wanted an eating disorder from a very young age really, i remember reading like hunger games or whatever and there was this page were everyone is partying and it said that the people at the capital throw up to eat more, I remember really wanting to do that for a few years but I was to scared to try. I started actually purging when I was 13. I was recovered for like… months. Like I was completely cured and then I did it again randomly, then again cured for months. And now Im here breaking my streak again lol. Im a bit of a health nut, I love exercise and eating healthy. But because of that I have these people (honestly fuck them from the bottom of my heart FUCK them) who pressure me to eat unhealthy everywhere bc they want me to stop being healthy I guess idk, they think its fun to break everything I work for and make me cave in to some sweets and fast food. Thing is though that, i can’t just eat a little cookie here and there like EVERYONE ELSE CAN. No, i start binging, then I purge. But the people around me keep enabling me and im sorry I definitely went on a bit of a rant lol. \n\nBut yeah 15M and health and fitness crazy",
      "created_utc": 1637290641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlku6l4",
      "author": "elvensnowfae",
      "body": "Bulimic for 16 years straight. Haven’t thrown up in 2-3 months and hoping to start recovery next year with a specialist.",
      "created_utc": 1637540897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hluoetl",
      "author": "Sprmodelcitizen",
      "body": "I’m 38. I was bulimic for 20 years. And it took many years for me to come out of it. But it’s freaking amazing what we can accomplish when we don’t devote every waking minute to thinking about our weight/how to bnp/ when we can get into a bathroom.",
      "created_utc": 1637721715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlvz609",
      "author": "None",
      "body": "I'm 24M, just got diagnosed with bulimia, first symptoms started 2018 tho.\nHad problems with loss of control while eating since my earliest childhood. \nI'm not vomiting but I'm alternating between periods of bingeing or fasting (days to a few weeks).\nWill visit a clinic for eating disorder in the beginning of the next year.",
      "created_utc": 1637751967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm0acld",
      "author": "pal3luna_",
      "body": "17 (18 in a few days), They/She AFAB. I’ve had multiple different eating disorders since I was 13 ranging from ARFID and orthorexia to Ana and bulimia. I’m on here just so I know I’m not alone and drowning in hell. Nice to meet you:)",
      "created_utc": 1637823472.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm12193",
      "author": "obsessedpunk",
      "body": "I’m 19(m) and I don’t have a diagnosed ED, I’ve had problems with disordered eating for a while now tho which lately turned into throwing up after meals. I never really binged yet, kinda had the urge to but was somehow able not to go through with it.\nI feel a little out of control with what’s going on rn and I just wanna gain back what little control I had before I started throwing up after meals so yea",
      "created_utc": 1637844622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm5yjiw",
      "author": "spentundies",
      "body": "I am 42(m), have also been bulimic since 15. I started purging to make weight for wrestling meets. I’ve only been lurking this sub for about a month, I wish I’d known about it earlier. It’s so much easier to deal with  EDs when there are people to talk about it with. Be well!",
      "created_utc": 1637942023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm8mix6",
      "author": "Freyabees",
      "body": "I’m 31 and I’ve had bulimia for a year. I got it from dieting and realizing I could cheat on my diet and just get rid of it.",
      "created_utc": 1637988243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmidnyl",
      "author": "fivefootfeed",
      "body": "hey! 20f, can’t tell you how long i’ve had an ed but bulimic since i was 17, and stopped from 18 until this summer where it started up again. used to binge and purge but it’s mostly just purging these days",
      "created_utc": 1638174374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmiro66",
      "author": "aaaaallllt",
      "body": "30, trans guy. Disordered eating all of my life basically, narc parents with eating issues projecting onto me and all of that shit, scapegoat of the family etc.  Started restricting when I was 15, went into b/p mode at 17 and been stuck here since. Been in and out of therapy since I was 8. “Recovered” briefly and relapsed twice, once at 24 and once at 26-27. Overall it’s become less intrusive in my life, less frequent, I bodybuild so I need to actually eat and digest a lot of food, so I do, but still binge/purge ritualistically twice per week. If I’m not lifting I’m binging because I’m chronically bored and self isolate to the extreme especially after Covid hit. Not really sure how to get back into the world.",
      "created_utc": 1638186108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmog6g9",
      "author": "None",
      "body": "30s, (F). 15 years on and off bulimic.",
      "created_utc": 1638289891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmrr5ym",
      "author": "battoes666",
      "body": "I'm 18 f and i've been anorexic since i was 14, but i've hated my body since as far back as I can remember. But this past month i've starting actually purging after my binges. I really love art and punk and metal music and I'm working on becoming a tattoo artist after I graduate high school.",
      "created_utc": 1638343324.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hn8viqj",
      "author": "birdcrazy222",
      "body": "I  am 56 (f) and started bulimia at age 15 and had it on and off over the years. I've been in therapy for years and have grown tremendously in many ways but it didn't stop the bingeing and purging. I joined OA (overeaters anonymous) and am in recovery now. I don't binge or purge. OA changed my life.",
      "created_utc": 1638655396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hn9hkpj",
      "author": "Xenaphobic",
      "body": "I'm 24, 25 next month (afab) developed bulimia at age 12. Had food issues for a while before that. I can answer any other questions anyone may have : )",
      "created_utc": 1638664832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnbumtf",
      "author": "CaptainStardawg",
      "body": "This thread is old, but I just wanted to say that I am a female, 19, and my bulimia was caused by a medication I was put on. I have bipolar affective disorder, and I tried a new medication called aripiprazole. Unbeknownst to me, many people who have taken this medication developed gambling addictions, eating disorders (bulimia, binge eating disorder) and other impulsive, addictive behaviours. That was when I was 16. I’ve had disordered eating all my life, but I was hospitalised for a brief period when I was 17- all due to that antipsychotic, aripiprazole. I no longer binge and make myself vomit, but I have to admit that I still get excited when I go a day without eating.",
      "created_utc": 1638716279.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnf99yw",
      "author": "Ok_Test2848",
      "body": "Im 21 now I started throwing up so much in 2020 for a whole year I lost so much weight I ran went to the gym I literally looked like a bone and aside from all that , I lost my voice , I feel dumb.  I totally forgot what it’s like to laugh",
      "created_utc": 1638766710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hng3j4n",
      "author": "Wayward-Dog",
      "body": "17 yr old (f) and started when I had lost a lot of weight from a better diet at 15 I think, tried recovery and it didn't work. Still do it, both because of body issues but also I hate the feeling of being full and sluggish :)",
      "created_utc": 1638789482.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnnzh0v",
      "author": "plaje13",
      "body": "I'm 25 (f) and have been bulimic since I was 16.\nNobody knows except my fiancé. It's my darkest deepest secret.\nBut after years without a doctor, I recently found one and finally opened up. Hopefully I can get help soon. I hope the best for all of you :)",
      "created_utc": 1638927337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hntc7ca",
      "author": "xenomorphiious",
      "body": "I’ve struggled my whole life since I can remember with body image and restricting and binging. I think my eating disorder really developed in late 2019 early 2020 - present. I think it’s bulimia?",
      "created_utc": 1639024593.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnx6ls2",
      "author": "theantimatterplan",
      "body": "29f. Bulimic from 15. Recovered from about 20 onwards. Still struggled with food addiction for a long time until I went gluten free and sugar free. Occasionally visit these spaces to help out and stay on track",
      "created_utc": 1639095299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hol9tbk",
      "author": "Ok_Test2848",
      "body": "Im 21 when i was 19 I became extremely bulemia I would purge so much barley eat run so much drink a lot workout too much throw up throw up I completely messed myself up",
      "created_utc": 1639533339.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hol9u2q",
      "author": "Ok_Test2848",
      "body": "I lost my voice",
      "created_utc": 1639533348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hp84w3v",
      "author": "captivebycalypso",
      "body": "I’m 22, female, and I started with starving myself when I was 13-14. I’ve been abusing laxatives and water pills on and off for years now. My last therapist referred me to an outpatient ED program in October but I haven’t gotten help yet.",
      "created_utc": 1639954529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpdnj4x",
      "author": "bee102019",
      "body": "I hope this isn't triggering for anyone, so I'll put a \\*trigger warning\\* here.\n\n&#x200B;\n\nI'm 35/f. I became bulimic in 2012 at the age of 26. It was a stressful time in my life, as I was working on my third degree and it was extremely intense. I think I have a unique case of bulimia because my disorder isn't tied to food issues, body image, etc. It's rooted in anxiety. I don't binge because I want food. I simply binge because I want to purge. When I purge I feel like all the negative emotions temporarily disappear. It's a coping mechanism for my anxiety, depression, and PTSD. I've never been even remotely overweight (never been over 105 lbs in my life), and when I was bulimic I was very aware that I was very sickly and did not look well. At my lowest I was 78 lbs. Also, because my bulimia developed later in life, while typically (but not always) it develops sooner, it seems atypical. Is anyone else out there like me?  \n\n\nFortunately, since then, I have successfully recovered. I've maintained recovery for several years now. I'm back up to \\~90 lbs (I'm only 5' tall FYI, so this is a healthy weight). l. I love having boobs and a butt again. I love having energy again. Not having to wear baggy clothes to hide the fact that I'm basically a skeleton. Recovery is possible and it is so, so worth it!",
      "created_utc": 1640056120.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpqprh1",
      "author": "tearsunderskin",
      "body": "i’m 19f and have been struggling with this shit for about 2 years now after ‘‘anorexia’’, that wasn’t severe but was probably enough for me to develop a huge hunger for every single edible item. My longest remission was for about ~3 weeks. Otherwise, it’s a daily thing, even more like my whole life is just around bulimia, not vice versa",
      "created_utc": 1640301235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hps950a",
      "author": "Daft_Sauce",
      "body": "I'm 29f actually just threw up last night and tonight for my first time. Uhm. Only dinner though. So I eat lunch at 1-2pm dinner at 930pm go to the bathroom at 10pm. I'm new here, really really not sure why I'm doing this?",
      "created_utc": 1640330556.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpuc7mf",
      "author": "Weary_Alfalfa_3406",
      "body": "18f and was bulimic since 2019!! I was anorexic during 2017-2019 time frame though",
      "created_utc": 1640375550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpvhauj",
      "author": "Akronyx",
      "body": "Hey I’m 23 m and just now falling into it..",
      "created_utc": 1640397577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hq9kd8u",
      "author": "Then-Air-3771",
      "body": "i am almost 18 and bulimic for almost two years. i am a dancer and it has really drained my dreams of becoming a professional. nice to meet you hahah",
      "created_utc": 1640689828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqa4mha",
      "author": "None",
      "body": "kind of feel singled out by my age when i scroll but iam a 14 year old girl i started when i was eight continued throwing up my food until i was ten then stopped completely for two years but then it started again when i was 12 now jm forteen and getting better my stringest was 28days im clean for 15days :)",
      "created_utc": 1640702263.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqbndk9",
      "author": "January1387",
      "body": "34f bulimic/an for 21 years. Did the whole in/out treatment, never actually recover relapse cycle until it grew old. Found my ‘stable’ about 8 years ago.",
      "created_utc": 1640724584.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwqdxro",
      "author": "plslovemebvck",
      "body": "wow, you’re amazing. i’m so happy for you. please keep it up!",
      "created_utc": 1620005074.0,
      "score": 34,
      "context": [
        {
          "id": "gwqdkoj",
          "author": "MediumPsychological9",
          "body": "I’m 21 f and was bulimic from 2017-2020 but recovered! Staying here to keep myself accountable and bc the posts are still so relatable",
          "created_utc": 1620004872.0
        }
      ]
    },
    {
      "id": "hg0bx52",
      "author": "Impossible_Editor_98",
      "body": "How did you recovered?",
      "created_utc": 1633803706.0,
      "score": 3,
      "context": [
        {
          "id": "gwqdkoj",
          "author": "MediumPsychological9",
          "body": "I’m 21 f and was bulimic from 2017-2020 but recovered! Staying here to keep myself accountable and bc the posts are still so relatable",
          "created_utc": 1620004872.0
        }
      ]
    },
    {
      "id": "gwrzsx5",
      "author": "plslovemebvck",
      "body": "this may be weird, but just, thank you. it’s not often I see someone who has gone through this for a while and has lived to tell. also, your daughter being open about this to you is so inspiring. i feel like that is one of the biggest struggles, telling someone, and your daughter is awesome for doing that. i kind of envy her. anyway, i’m glad you both are doing well, and yes, of course i will come to you for questions. Thank you!",
      "created_utc": 1620046472.0,
      "score": 29,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "h85y1c7",
      "author": "speakloudly",
      "body": "I was just reading this and I am a newly recovered bulimic. I am 31f and I have two children. I worry for them as I wish for no one to suffer the way I did. \nHow did you come to know about your daughter's disorder? Did she know about yours? I apologized if I am asking too much it would just be helpful.",
      "created_utc": 1628427475.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "h4tco9b",
      "author": "wafflerain5",
      "body": "Hey, how did you recover on your own. I've been trying to do that for months but I think I'm just lying to myself, I relapse so often.",
      "created_utc": 1626016416.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "h57qj8j",
      "author": "Disordernymity",
      "body": "I’m a 38f who was also dx’d w/anorexia at a young age which turned into bulimia off-and-on for the past 20+ years - basically every time I try to lose weight, I fall back into it. It’s awful; I have an aunt in her 60’s who has a heart condition from decades of bulimia. I have also lost and damaged teeth from this damn disease! I’m hoping upon hope that my daughter doesn’t end up with a disordered relationship with food.",
      "created_utc": 1626306499.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "hb8ep1y",
      "author": "back_againx13",
      "body": "As a 43-year old woman who developed an eating disorder relatively late in life (at 30, after a nasty divorce) I am *so grateful* that you shared a bit of your story! While I think we all have basically the same essential experience of having an eating disorder, I sometimes feel awkward because I'm so much older; I feel like I'm violating a space that is more for younger women - even though I know that's not true and no one has *ever* given me that impression here. It's just my insecurity. Thanks so much for your courage and wisdom!",
      "created_utc": 1630528826.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "hh2d7br",
      "author": "queencowboy",
      "body": "18! impressive. i have 11: 8 root canals + 3 completely lost teeth (working on number 4. losing teeth in recovery is the most heartbreaking thing).",
      "created_utc": 1634526156.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        }
      ]
    },
    {
      "id": "gwqcpo3",
      "author": "plslovemebvck",
      "body": "lmao thank you! i bet your socks look amazing and your cookies are out of this world 🗺",
      "created_utc": 1620004393.0,
      "score": 22,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        }
      ]
    },
    {
      "id": "h5aut0w",
      "author": "SinfullySinatra",
      "body": "Ooh sock designing sounds fun",
      "created_utc": 1626371791.0,
      "score": 8,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        }
      ]
    },
    {
      "id": "hjocd2e",
      "author": "candiwarrior",
      "body": "sorry for the ignorance on the topic, what do you mean exactly by \"being in recovery\"? thanks",
      "created_utc": 1636294981.0,
      "score": 1,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        }
      ]
    },
    {
      "id": "hjoi8f5",
      "author": "AnaDion94",
      "body": "It means that for 281 days I have been actively and successfully refraining from the binge/purge cycle.",
      "created_utc": 1636297528.0,
      "score": 1,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        }
      ]
    },
    {
      "id": "gwsll97",
      "author": "plslovemebvck",
      "body": "seeking a professional for help is sooooo hard, but i believe in you! please let me know how it goes! and please stay strong. from what you’ve told me, it sounds super exhausting, and i can only imagine the relief you’ll finally get when everything is finally settled. i’ll be waiting!",
      "created_utc": 1620056390.0,
      "score": 4,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        }
      ]
    },
    {
      "id": "h6wg4l9",
      "author": "Disordernymity",
      "body": "Just pulled up this stickied post and read your response. I so feeeel the not being the same size for a year. I fluctuate dramatically and have a wide variety of sizes hanging in my closet - including maternity clothes ranging from small to XL! \n\nGood for you for having professional help on your list!! I’m still trying to get the courage up for that and for talking to my husband (who doesn’t believe in therapy nor paying a bunch of money for it) about it.",
      "created_utc": 1627520401.0,
      "score": 5,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        }
      ]
    },
    {
      "id": "h4k1grq",
      "author": "Puzzledchica",
      "body": "I am sorry about this. I am also working on this and as you say is exhausting thinking about weight allthe time.",
      "created_utc": 1625804398.0,
      "score": 3,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        }
      ]
    },
    {
      "id": "hb8gmtl",
      "author": "back_againx13",
      "body": "I'm glad to hear from another tall woman whose weight has fluctuated a lot! I'm also 5'10\" and have been anywhere from 140-240, and I've gone through several entire wardrobes because of it. It gets so frustrating!!",
      "created_utc": 1630529635.0,
      "score": 3,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        }
      ]
    },
    {
      "id": "h4uvdz5",
      "author": "lilly_illy",
      "body": "Fuck. I admire you for surviving all this. I only had a few rough periods like this (with purging several times a week and running 5-10k afterwards). Now I think I got it under control but I still do it when I'm stressed out or sad about something (several times a month usually). I've been debating with myself about getting help. I'm afraid talking about this will get me even more focused on this thing, and so far the opposite worked best for me - live life without obsessing about food. Anyway.\n\nThanks for sharing this. You are a strong woman! I hope you do get help and eventually recover.",
      "created_utc": 1626043022.0,
      "score": 2,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        }
      ]
    },
    {
      "id": "gwqj377",
      "author": "plslovemebvck",
      "body": "i’m in your boat bro. i’ve ran 4 full marathons (first being at 15 when i started this) and a dozen halves. i also saved money to buy a 65 mustang last year. check my insta @Lcwkee. this shit sucks :/ i’m more prone to breaking things when i skate now, like my foot and finger so far. hopefully one day this will all go away",
      "created_utc": 1620007916.0,
      "score": 4,
      "context": [
        {
          "id": "gwqiaph",
          "author": "testfreak377",
          "body": "I’m 19(m) had bulimia since 15 but only the last year has it been bad. Competed in triathlons till 13 then started bodybuilding. Unfortunately couldn’t continue with that due to binging and purging, but I will continue that and other pursuits after I choose to recover. I love trucks, Hypercars and murdered out Escalade would be a badass daily driver.\n\nFuck this illness I will beat it into submission one day soon !",
          "created_utc": 1620007475.0
        }
      ]
    },
    {
      "id": "gwqclfp",
      "author": "plslovemebvck",
      "body": "love a plant mom! 🌱",
      "created_utc": 1620004327.0,
      "score": 11,
      "context": [
        {
          "id": "gwqceks",
          "author": "None",
          "body": "I’m 19(f) and I’ve had anorexia for about three years and bulimia for about 2. I love being outside (especially hiking), photography, baking, and growing/taking care of plants. :)",
          "created_utc": 1620004222.0
        }
      ]
    },
    {
      "id": "h0dn03g",
      "author": "LearningAsIGo89",
      "body": "Similar boat as you but I’m an executive communications director. 32 and have been bulimic since 16. I can’t seem to kick this hellish dis-ease and from the outside in everything looks like rainbows and butterflies. I’m just trying to find and accept help wherever I can at this point.",
      "created_utc": 1622678455.0,
      "score": 8,
      "context": [
        {
          "id": "gwqlqws",
          "author": "carlyilanar",
          "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
          "created_utc": 1620009406.0
        }
      ]
    },
    {
      "id": "gwqt0w3",
      "author": "plslovemebvck",
      "body": "also, if you find things you love to do, and always occupy your time, i feel like a relationship isn’t necessary...but i’m also kind of hypocritical, since there are moments where i feel like having someone by my side would make me more happy at times :/",
      "created_utc": 1620013804.0,
      "score": 6,
      "context": [
        {
          "id": "gwqlqws",
          "author": "carlyilanar",
          "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
          "created_utc": 1620009406.0
        }
      ]
    },
    {
      "id": "gwqlwbx",
      "author": "plslovemebvck",
      "body": "that is insane! i bet you have so many people admiring you atm <3",
      "created_utc": 1620009490.0,
      "score": 2,
      "context": [
        {
          "id": "gwqlqws",
          "author": "carlyilanar",
          "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
          "created_utc": 1620009406.0
        }
      ]
    },
    {
      "id": "hixsui2",
      "author": "coffeeketolift",
      "body": "Late to the party but have to ask how you have managed to be so successful in your career while dealing with this?! I've found that it drains my confidence and my drive to pursue the things I want in life. It feels like I can't really be myself or function until this is gone.",
      "created_utc": 1635804847.0,
      "score": 1,
      "context": [
        {
          "id": "gwqlqws",
          "author": "carlyilanar",
          "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
          "created_utc": 1620009406.0
        }
      ]
    },
    {
      "id": "gwqsoj3",
      "author": "plslovemebvck",
      "body": "yo that’s awesome, i’m currently study spanish and japanese every day. 1, so i can finally become fully fluent in spanish and 2, to learn what i can to go visit japan! but hey..time flies doesn’t it?",
      "created_utc": 1620013580.0,
      "score": 4,
      "context": [
        {
          "id": "gwqsbbj",
          "author": "chronaloid",
          "body": "I’m 20 m and have been eating disordered since I was 14 at least but only truly bulimic since I was like 19... idek anymore. My main interests are herpetology and linguistics. Cool thread to read thru.",
          "created_utc": 1620013343.0
        }
      ]
    },
    {
      "id": "gxuc92n",
      "author": "None",
      "body": "Anorexia (restrictive) - anorexia (b/p) - bulimia was my progression at 14/15. Your recovery work is so inspiring. I’m struggling with overshoot weight right now and a desire to relapse (romanticization). I’m sorry for all the trouble, but can I ask if you have any advice?",
      "created_utc": 1620820052.0,
      "score": 2,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        }
      ]
    },
    {
      "id": "gwybyn7",
      "author": "plslovemebvck",
      "body": "i’m so glad you are in recovery, like genuinely! but i have a question, mainly for myself. How did you take the first step towards help and what did you do?",
      "created_utc": 1620165018.0,
      "score": 1,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        }
      ]
    },
    {
      "id": "gwqj67i",
      "author": "plslovemebvck",
      "body": "oh wow, how the turntables lmao. i’m so happy for you!",
      "created_utc": 1620007962.0,
      "score": 1,
      "context": [
        {
          "id": "gwqhow1",
          "author": "punkgoob",
          "body": "25, cis female, only recently diagnosed with bulimia I've been struggling on and off with since age 15. I'm in recovery now and currently work as a mental health counselor.",
          "created_utc": 1620007141.0
        }
      ]
    },
    {
      "id": "gwyckfd",
      "author": "plslovemebvck",
      "body": "thank you <3 but also, let it happen. be open to the process of recovery, and let them know what you are truly feeling. i believe in you, really, and i promise everything will be okay <3",
      "created_utc": 1620165279.0,
      "score": 1,
      "context": [
        {
          "id": "gwu0p2j",
          "author": "lonellyrabbit",
          "body": "hi! i‘m a 17 year old girl from Germany. I have been bulimic for 3/4 years, kept it a secret until now. only recently I made a quite big change in my life, told my mom about it, went to hospital and now I quit school to recover and have to go to a ed clinic soon. I’m scared what‘s gonna happen now that everyone knows, because it was my tiny little secret that kept me protected and helped me deal w the shit in this world. I don‘t know who I am without it as I spent all my teenage years walking from fridge to toilet and back. But I hope there is a better life ahead. I wish you the best of luck on your recovery journey. ✨",
          "created_utc": 1620078209.0
        }
      ]
    },
    {
      "id": "h3f4kqc",
      "author": "None",
      "body": "Hey- thanks for sharing this. You’re story is important, and so are you.",
      "created_utc": 1624956341.0,
      "score": 1,
      "context": [
        {
          "id": "gxkyov5",
          "author": "None",
          "body": "26, male. Struggled with bulimia as a teen. Was in treatment for it, recovered. Relapsed last year right before the pandemic shut down lol. struggled with it all throughout quarantine. Was in denial the entire year until December when I finally decided to start going to a support group for it. At first I kept track of how long the last time I purged was, but I lapsed after about 3 weeks the first time? I don't keep track anymore. Keeping track of the days made me feel like a failure when I'd get the urge to purge. However I think the last time I purged was a week ago? I don't remember the specific day/night. I've been a lot busier with work & stuff lately so it's been easier to fill my time. \n\nIt was hard to accept it last year because it had been years & I didn't want to believe that I was in the same place I was when I was 16 (10 years ago) plus I don't live in my hometown so carrying this ED with me 10 years later as an adult in my new life/town, it just felt unbelievable. I honestly thought \"how do I go about forming strong connections with those struggling the same as me in a place I don't associate this disorder with?\" However, I think the worst part about this relapse was keeping it to myself. Keeping it hidden made me want to do it more. I realized that the more I talked about it with my support group & even close friends, the more I became aware of the reality of it, compelling me to want to stop. But that's absolutely just my mindset, in no way to I think talking about it is the full cure of an ED haha. However, I think opening up about it & being honest with the right people who understand, it may not \"cure\" you but it definitely makes things different in some way. We just need to surround ourselves with people who understand & won't harshly judge us or even judge us at all. \n\nBest of luck!",
          "created_utc": 1620629251.0
        }
      ]
    },
    {
      "id": "gwqtt6y",
      "author": "plslovemebvck",
      "body": "i am so proud of you, genuinely. i may not know you personally, but i know the battle is hard. keep it up soldier, love you <3",
      "created_utc": 1620014317.0,
      "score": 1,
      "context": [
        {
          "id": "gwqtnar",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620014210.0
        }
      ]
    },
    {
      "id": "gwyb7dl",
      "author": "plslovemebvck",
      "body": "sorry the late reply, but your dog is badass as hell! and also, did you eat the chicken 😏, was it good ?😤",
      "created_utc": 1620164692.0,
      "score": 2,
      "context": [
        {
          "id": "gwvghoi",
          "author": "sheddinglikeamofo",
          "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
          "created_utc": 1620104872.0
        }
      ]
    },
    {
      "id": "h9d9b3b",
      "author": "lilykristine",
      "body": "Please please reach out, they love you and want the best for you!! My story started out like yours, im 22 now and it's taken over my life. Once your brain creates a habit, it is SO hard to undo it. I wish the best for you hunny ❤",
      "created_utc": 1629255549.0,
      "score": 2,
      "context": [
        {
          "id": "h2plunj",
          "author": "anonymouspony2",
          "body": "Hi, I'm a thirteen-year-old girl who got caught in a vicious cycle of binging, exercising, fasting, and restricting starting from the past month. It started with trying to lose weight in March. I lost fifteen pounds but gained six back due to the binging. I binged because I was really stressed out from school and such. I made myself throw up a week ago and have been doing that every day since. Yes, I know I'm pretty young, lol, but adolescence is when the problem usually starts, and I want to get help before it gets any worse. I'm currently trying to gather the courage to ask my parents for help. :) I hope things will get better for you one day, even if it cannot be today. Always keep hope that things will improve. You're strong and can get through this!",
          "created_utc": 1624406130.0
        }
      ]
    },
    {
      "id": "gwydxwa",
      "author": "plslovemebvck",
      "body": "you have so much potential!! and i’m being honest! try working out! at first you may consider it as a form or purging, but eventually you might start to love it and switch over to wanting to become swole 💪 i’m a runner, with 4 marathons under me and a dozen halves, and it has definitely helped my mind a bit. working out is therapeutic, and it doesn’t hurt to try!",
      "created_utc": 1620165885.0,
      "score": 1,
      "context": [
        {
          "id": "gwqld3c",
          "author": "None",
          "body": "I'm an 18 year old guy and I'm about 5'5 5'6. I was on and off with it but in the last month I slimmed from 165lbs to 152lbs. I've always been concerned about my weight because sophomore year in high school I was 230lbs. I used to be a band kid but my section had their own period so I only spent time with them and they were bullies which made me leave and start losing weight. I don't care about them now but the idea that someone thinks I'm gross or that I think I'm gross bothers me.",
          "created_utc": 1620009194.0
        }
      ]
    },
    {
      "id": "gx7mnrm",
      "author": "plslovemebvck",
      "body": "lmao thank you. what advice would you give to someone like us. like currently i’m at 102, and before i thought my ideal body was at 109. but now weighing 102, i still feel fat. i remember thinking that once i can see my sternum (109), that, that would mean i’m good, but now i don’t even care about the sternum, but am noticing a decrease in pectoral and leg muscle now. so, what advice would you give?",
      "created_utc": 1620343219.0,
      "score": 2,
      "context": [
        {
          "id": "gwywvzy",
          "author": "NightWorldPerson",
          "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
          "created_utc": 1620174819.0
        }
      ]
    },
    {
      "id": "gx7nrju",
      "author": "plslovemebvck",
      "body": "you’ve gone through a lot :( BUTTTTTTTTT, you seem sooo strong, i admire you! i love movies, the gym, and theatre too! weirdly, the last role i played in a performance was a gay character bc i’m so thin and small :/",
      "created_utc": 1620343767.0,
      "score": 3,
      "context": [
        {
          "id": "gx2ygrj",
          "author": "Kariatide",
          "body": "I’m 39 . I had anorexia in my teen years which developed to bulimia\nI got “cured” but Not fully. I gained a lot of weight in my 20s but I didn’t care\nI got married then had a nasty divorce at 35 followed by a relationship with a guy who really put me down so I developed bulimia again and have been struggling for the last 4 years\nI went to therapy which helped but covid made me go back to the bad habits :(\n\nI absolutely love animals and cats in particular; I love going to the gym, to the pool, beach, partying with friends, going to the movies and theatre",
          "created_utc": 1620253264.0
        }
      ]
    },
    {
      "id": "gwr4bsl",
      "author": "plslovemebvck",
      "body": "you’re doing a lot man, that is literally crazy! just stay focused, and you’ll always have someone for support (you’re partner)!",
      "created_utc": 1620022233.0,
      "score": 1,
      "context": [
        {
          "id": "gwr2xt6",
          "author": "Column-V",
          "body": "Im 21 m and I have been bulimic since I was a preteen. I’m married, have 2 jobs, and go to university for political science. I just started seeking help this year. Hope you’re doing well.",
          "created_utc": 1620021066.0
        }
      ]
    },
    {
      "id": "gwycswl",
      "author": "plslovemebvck",
      "body": "if you’re active and still full of energy, i want to be like you! bc i feel like the exhaustion and fatigue is what gets to us heavily, and that’s what i despise the most :/",
      "created_utc": 1620165382.0,
      "score": 4,
      "context": [
        {
          "id": "gwtb47n",
          "author": "mondaysme",
          "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
          "created_utc": 1620067079.0
        }
      ]
    },
    {
      "id": "gxzs87a",
      "author": "TranZeitgeist",
      "body": "Just putting it out there, some 16 year olds have a special talent for saying hurtful, pointed things. Digital portraits is a cool skill to work on. idk what style you like, but can I share a yt portrait artist I enjoy? - [Danica Sills](https://www.youtube.com/channel/UChbmw2hACnc5JqYp_ItUfgg)",
      "created_utc": 1620922928.0,
      "score": 1,
      "context": [
        {
          "id": "gxsxsad",
          "author": "hdjldk",
          "body": "I'm 16F, I've been bulimic for four months. I developed bulimia right at my one year mark being clean from anorexia, which I'd had since I was about ten or eleven. I don't do much, but I love drawing digital portraits, singing and knitting. I'm tryna spend more time with my reptiles and I'm tryna work on my diet and exercise (I used to be super fit, but had to stop due to covid). All around my ex told me I was one of the unfunniest people he's met and the girl his friends wanted him to be with said I'm a bitch who makes everyone sad. Yay",
          "created_utc": 1620783546.0
        }
      ]
    },
    {
      "id": "gxlewhd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620644337.0,
      "score": 2,
      "context": [
        {
          "id": "gwrkkk7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620036885.0
        }
      ]
    },
    {
      "id": "gwrza84",
      "author": "plslovemebvck",
      "body": "if i may ask..what made you want to go back?",
      "created_utc": 1620046206.0,
      "score": 1,
      "context": [
        {
          "id": "gwrkkk7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620036885.0
        }
      ]
    },
    {
      "id": "gwycb8u",
      "author": "plslovemebvck",
      "body": "oh my fucking god, you would be an amazing help for everyone who suffers with an ED! having someone who has been in the same boat as you, who can help, is priceless. We support your journey 100000000%, and i love plant mom 🌱",
      "created_utc": 1620165168.0,
      "score": 3,
      "context": [
        {
          "id": "gwu0pi2",
          "author": "botaglove",
          "body": "I’m 29 and my eating disorder journey began at age 10 — I went through bulimia, EDNOS, anorexia, AFRID... I’ve been in recovery for about 5 years now :) occasionally still have slips but no more relapses or hospitalizations. Still see a dietician, therapist, and MD, and visit subs like these :)\n\nI love plants and art so much! Currently working towards a doctorate degree in nursing. Eventual goal is to be in the eating disorder field but I would like a solid 5 more years of recovery at least under my belt.",
          "created_utc": 1620078214.0
        }
      ]
    },
    {
      "id": "gwybpeq",
      "author": "plslovemebvck",
      "body": "hi Leslie, this may seem weird but i promise it’s heartfelt. I’m glad your son has came into your life and has really motivated you to want to get better. A strong mom is hero, and you’ll always be a hero to him, i promise!",
      "created_utc": 1620164908.0,
      "score": 2,
      "context": [
        {
          "id": "gwuu2s9",
          "author": "Sweetbb96",
          "body": "Hi! Im Leslie Im 25 and ive been bulimic from 2014-present. I’ve had lots of breaks from b/p but after I had my son in 2018 it’s been pretty non stop. I finally sought out therapy a month ago so I’m on the road to recovery. It got to a point where i was putting my b/p before my son and I knew i had to finally get help. Im diagnosed Anxious-Avoidant attachment style and Atelophobia, so thats a little about me.",
          "created_utc": 1620092197.0
        }
      ]
    },
    {
      "id": "gwybg4r",
      "author": "plslovemebvck",
      "body": "WAIT QUESTION(s)!! i’m genuinely curious, what made you develop restricted eating habits that young? and also, DO YOU REPLACE THE NEEDLE AFTER EVERY USE???!??",
      "created_utc": 1620164798.0,
      "score": 1,
      "context": [
        {
          "id": "gwuuhhi",
          "author": "rigadoontoon",
          "body": "i'm 18(nb) and i've struggled with disordered eating habits since kindergarten. i love my friends, drawing with dip pens, making and listening to music, and my shitty, steadily growing collection of stick and pokes that i use to cope :) i hope ur well and if not, i send love and warmth and hugs your way <3 it's nice to meet u!! :)",
          "created_utc": 1620092394.0
        }
      ]
    },
    {
      "id": "gwyar9y",
      "author": "plslovemebvck",
      "body": "hiii, what’s your cats name and what breed?? and also...what character class do you main in D&D👀? i was always a warlock and was in a D&D club in high school for a bit",
      "created_utc": 1620164498.0,
      "score": 1,
      "context": [
        {
          "id": "gwy78hw",
          "author": "tootegost",
          "body": "New to reddit altogether. I'm 18 and nonbinary, have been having ed for 7 yrs now with varying behaviors. The last two years I've been bulimic. I live with a cat and try to grow vegetables on my balcony. I have many intensive interests but since last fall Dungeons & Dragons has been pretty dominant. Other things are for example language learning, arts and crafts, photographing street art, and music. :) This happens to be my very first text on Reddit, quite suitable for it to be an introduction.",
          "created_utc": 1620162996.0
        }
      ]
    },
    {
      "id": "gwyf3g0",
      "author": "plslovemebvck",
      "body": "how are you feeling right now? and at what time do you feel your worst? i know after 3 purges in a day, i absolutely hate myself, but what about you? i feel great atm, bc i just finished some hw and am about to walk my dogs! i ate a banana and some cuties, so i’m not hungry right now, and so far, i’m hoping today will be a win for me!",
      "created_utc": 1620166401.0,
      "score": 1,
      "context": [
        {
          "id": "gwycc6m",
          "author": "justahumanlikeu",
          "body": "22, they/her, started struggling with ED at 12 and started purging at 18",
          "created_utc": 1620165180.0
        }
      ]
    },
    {
      "id": "h1lkoyc",
      "author": "winnie0718",
      "body": "Very well said 💪🏼",
      "created_utc": 1623568421.0,
      "score": 2,
      "context": [
        {
          "id": "h1bd9fv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623352365.0
        }
      ]
    },
    {
      "id": "h1s6d4v",
      "author": "lovedecay",
      "body": "you are definitely wise beyond your years",
      "created_utc": 1623709233.0,
      "score": 2,
      "context": [
        {
          "id": "h1bd9fv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623352365.0
        }
      ]
    },
    {
      "id": "h6abzvh",
      "author": "plslovemebvck",
      "body": "dude omfg, thank you for mentioning my fitness pal. i use it religious to stay under 1000cal a day. rn i weigh 98lbs and i’m 5’5. i feel fine and for the first time don’t look like i have any fat on me even after i eat. albeit, i am 20lbs under normal, “healthy” weight, but as long as i can still workout an hour everyday (skateboarding), i feel as though nothing is wrong with me",
      "created_utc": 1627069990.0,
      "score": 1,
      "context": [
        {
          "id": "h6abgis",
          "author": "zobeeris",
          "body": "I am 21 f and my body image has been bad for as long as I can remember. I first became anorexic at 18 after downloading MyFitnessPal and severely restricting my calorie intake which led to me losing lots of weight very quickly. I was very underweight to the point where I was hospitalized for about 5 months, which was then followed by me going to a specialized clinic for eating disorders. Shortly after I was discharged and returned home again, I started restricting again and also developed bulimia because I was very uncomfortable with all the weight I had gained during treatment. \n\nMy relationship with food and my body is still pretty bad and I consume far too much ED-related content, but I'm managing currently :)",
          "created_utc": 1627069753.0
        }
      ]
    },
    {
      "id": "h96cas2",
      "author": "lunger_sally",
      "body": "\"eat and chill instead of eat and spill\" - excellent motto. I hope you can find the strength to get through this!",
      "created_utc": 1629132001.0,
      "score": 2,
      "context": [
        {
          "id": "h7lbyi6",
          "author": "None",
          "body": "I just found the sub so I’m new here but I’m 27 and have had bulimia since I was 15. I’ve had three kids and the only time in my life when I didn’t have an eating disorder is when I was pregnant. Currently thought I had finally kicked it after my last baby. But here I am six months PP and at it again. Ugh. I hope one day I can just eat and chill instead of eat and spill. 🙃",
          "created_utc": 1628020780.0
        }
      ]
    },
    {
      "id": "hc71946",
      "author": "plslovemebvck",
      "body": "i feel you bro..",
      "created_utc": 1631203320.0,
      "score": 1,
      "context": [
        {
          "id": "hc70izc",
          "author": "NumbMePlz",
          "body": "18 male, big weed smoker, always the class clown growing up. Nobody really expected any of this from me. So I kept it sealed up for along time.",
          "created_utc": 1631203024.0
        }
      ]
    },
    {
      "id": "hh2gv0j",
      "author": "plslovemebvck",
      "body": "lmao i have a huge sweet tooth too, it can be deadly 🧟",
      "created_utc": 1634528143.0,
      "score": 1,
      "context": [
        {
          "id": "hh2ciwy",
          "author": "queencowboy",
          "body": "i do not wish to be perceived lol\n\ni’ve been diagnosed with every ED there is at some point in my long yet short life. consistently bulimic for 18 years, now with 3.5 years recovery from b/p under my belt :)\nmy EDNOS is out of control, though :( my only “safe foods” are raw veggies, protein bars, and enough candy to put a child in a coma.",
          "created_utc": 1634525796.0
        }
      ]
    },
    {
      "id": "gwyegvh",
      "author": "plslovemebvck",
      "body": "oh wow! you seem incredibly busy, and i love that! i know what i say won’t mean much, since i’m younger, but having hobbies nonstop with also some time to rest and just sit there and think, has helped my mind. meditating is great, it has helped open my third eye 👁, and the rose quartz on my thumb always helps me realize that i am loved, just like you are. you’re family, you’re friends, and children are all counting on you. you can’t let this get this better of you. show them that you will not take anyone or anything’s shit! you got this!",
      "created_utc": 1620166119.0,
      "score": 2,
      "context": [
        {
          "id": "gwqh4xd",
          "author": "None",
          "body": "I’m 27, diagnosed with anorexia with purging tendencies. I’ve struggled with my ED for 12 years and was nearly recovered until my current relapse has taken a toll on all of that. I love cats (I have one), going to the gym, working with children, and enjoy singing. I just got my license a couple of months ago.. after years of being absolutely terrified lmao. I think this kind of post is a good idea!",
          "created_utc": 1620006837.0
        }
      ]
    },
    {
      "id": "gwr47xt",
      "author": "plslovemebvck",
      "body": "can we talk? is that okay? is there somewhere i can reach you?",
      "created_utc": 1620022142.0,
      "score": 2,
      "context": [
        {
          "id": "gwr2ktg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620020770.0
        }
      ]
    },
    {
      "id": "gwrhrv8",
      "author": "plslovemebvck",
      "body": "how’s life atm? what are your hobbies?",
      "created_utc": 1620034716.0,
      "score": 1,
      "context": [
        {
          "id": "gwrg2cf",
          "author": "None",
          "body": "Hey I'm 23 f and I never had problems with food until 2 years ago that I became bulimic",
          "created_utc": 1620033101.0
        }
      ]
    },
    {
      "id": "gwrht2l",
      "author": "plslovemebvck",
      "body": "no wayyyy, please tell me how you got started!",
      "created_utc": 1620034746.0,
      "score": 1,
      "context": [
        {
          "id": "gwrhq4v",
          "author": "AppropriateGiraffe28",
          "body": "21 (f) bulimic from 14 started recovery 26th May 2020 :)",
          "created_utc": 1620034671.0
        }
      ]
    },
    {
      "id": "gwrzclk",
      "author": "plslovemebvck",
      "body": "thank you <3",
      "created_utc": 1620046240.0,
      "score": 2,
      "context": [
        {
          "id": "gwrmctc",
          "author": "SharriSchwab",
          "body": "Hi! I'm 19F and at a young age I struggled with anorexia then became bulimic/BED then at 16 I again had anorexia but now I am at a good healthy weight and sometimes struggle with eating normally (sometimes way too much and purge and sometimes too little) \n\nButtt we all just need to give it time and trust our bodies! At first I thought I'd never stop b/p, but now when I'm full I can stop! \n\nOur body is sooo extremely smart fr. Certain trauma/problems/triggers whatsoever need to be handled first, that makes getting better a lot easier :) \n\nGood luck and enjoy life y'all x",
          "created_utc": 1620038211.0
        }
      ]
    },
    {
      "id": "gwyd6zq",
      "author": "plslovemebvck",
      "body": "hiiii!!! your username is totally something i would expect from a 14 year old (no hate, just smiling at the mindset i also had that age)! but also, what’s your cats’s name? favorite episode/season? and what strand is your preferred one? unless you mostly smoke dab pens, then what flavor?",
      "created_utc": 1620165554.0,
      "score": 1,
      "context": [
        {
          "id": "gwt6sjr",
          "author": "dicksandtits420",
          "body": "14, f, I've only been diagnosed for a few months but its been like this since 2018:)\n\nedit: ig we're sharing so I really like my cat and the show rick and morty. that's basically it, other then that and smoking pot, thats who I am",
          "created_utc": 1620065271.0
        }
      ]
    },
    {
      "id": "gww0thi",
      "author": "plslovemebvck",
      "body": "awwww🥺 i’m so happy you’re moving forward with life. what do you plan on studying in grad school?",
      "created_utc": 1620122453.0,
      "score": 1,
      "context": [
        {
          "id": "gwvg02j",
          "author": "None",
          "body": "I'm a 31 yr-old queer cis female who started restricting hard at 14 and was actively bulimic from 15-29. I've been in therapy for my ED and depression/anxiety since then and I'm in an area with ED gurus, so I've been mega fortunate in my treatment experience. I'm 2 years into recovery as of April and 5 years sober in June, and I attribute a lot of the recent growth in my ED recovery to being able to overcome that. Things didn't really start to change until I quit drinking but when they did, they changed A LOT. I still have to work at my ED every day but it's nothing like it used to be, and making good connections with others in recovery helps sooooo much.\n\nI've got a good job but I'm looking for something that I'll like more. Graduating college in a few weeks and starting grad school in the Fall.",
          "created_utc": 1620104528.0
        }
      ]
    },
    {
      "id": "gwyazwe",
      "author": "plslovemebvck",
      "body": ":(",
      "created_utc": 1620164601.0,
      "score": 2,
      "context": [
        {
          "id": "gww545i",
          "author": "Narwhal_Songs",
          "body": "29F, been struggling with bulimia for six months",
          "created_utc": 1620125959.0
        }
      ]
    },
    {
      "id": "gx7mzse",
      "author": "plslovemebvck",
      "body": "hiiiii, how are you? like at this moment, how do you feel? bc i feel okay. i ate a sándwich earlier and i think i’ll keep it in my system for today. i went skating today (almost landed a tre flip!), walked my dogs, worked, and am doing hw. so, so far i feel good. wbu, are you okay? can we talk? you can dm on insta @Lcwkee if you want or just reply to this that’s cool too!",
      "created_utc": 1620343383.0,
      "score": 2,
      "context": [
        {
          "id": "gwz9opl",
          "author": "Acrobatic_Cut2772",
          "body": "16 F have had bulimia since i was 15 and anorexia since i was also 14/15",
          "created_utc": 1620180930.0
        }
      ]
    },
    {
      "id": "gx7urze",
      "author": "plslovemebvck",
      "body": "shit together gang 💯...but also..what specifics are the reason you do this? like for me, i think my chest muscles are a little too much, i want the thigh gap, and to keep my abs. wbu..? it’s okay if you don’t want to say, i still love you <3",
      "created_utc": 1620347351.0,
      "score": 2,
      "context": [
        {
          "id": "gx76qkk",
          "author": "None",
          "body": "I'm 20 (f) and have had an ED since 16 but didn't start purging until like 17-18 ish. So yeah I def got my shit together",
          "created_utc": 1620335941.0
        }
      ]
    },
    {
      "id": "gx7v1ev",
      "author": "plslovemebvck",
      "body": "be the help. be the warrior you are, and help yourself. and try to reach out if possible! i’m sure there are others like you in your area! if anything, you could build a connection...that’s part of the reason i asked this question about everyone.. i love you <3",
      "created_utc": 1620347485.0,
      "score": 1,
      "context": [
        {
          "id": "gx7kldx",
          "author": "januaryjay2",
          "body": "Hi I’m 30yo F. Been struggling for 10 years. There’s not any help for EDs in my area, hopefully one day I’ll be healed ❤️",
          "created_utc": 1620342210.0
        }
      ]
    },
    {
      "id": "gx8jl9o",
      "author": "plslovemebvck",
      "body": "whoa...that’s impressive. i’m so happy for your working life rn! and interesting 🤔 count it as a blessing that you can selective binge, bc i know for me and others, once we start eating, we can’t stop :/   BUT STILL, IM SO HAPPY FOR YOU! please help save our future, we’re counting on you!",
      "created_utc": 1620360767.0,
      "score": 1,
      "context": [
        {
          "id": "gx89110",
          "author": "heyocheryo",
          "body": "Heyo! I’m 20 (f) and i have been anorexic from 2011 and bulimic (but with subjective binges/not really binges) since 2019 and now i’m kinda floating around with atypical bulimic anorexia? lol idk. that’s what the doctors calls it. \nI’m norwegian and rn i’m working in norways biggest environmentalist organization for/by youths! i love analog photography, dance and plants!",
          "created_utc": 1620354680.0
        }
      ]
    },
    {
      "id": "h1s9556",
      "author": "lovedecay",
      "body": "what helps to stay away from the binging ?",
      "created_utc": 1623710511.0,
      "score": 1,
      "context": [
        {
          "id": "gznmz7r",
          "author": "napolionnappe",
          "body": "I'm 21 m. I've had bulimia since I was 9 years old. I'm alive and in recovery I still purge from time to time but it's much less frequent now than before. The same with the binge eating. I haven't binge eaten in like a few weeks",
          "created_utc": 1622134670.0
        }
      ]
    },
    {
      "id": "h397ivg",
      "author": "RumyanaRomelova",
      "body": "Almost 19 actually. Am gonna be 19 in 5 days.",
      "created_utc": 1624830624.0,
      "score": 1,
      "context": [
        {
          "id": "h397e8u",
          "author": "RumyanaRomelova",
          "body": "Hi. I'm 18, female and I've struggled with anorexia for the last three years and a half. I'm attempting recovery but have gained weight and started purging. I've honestly downloaded Reddit for tips on how to purge but I'm on the recovery track again and will try my very best not to. I don't want to live in that hell all my life (despite being suicidal and hoped to die because of anorexia. Now I've decided if I die it's gonna be because I say so not because ana does).",
          "created_utc": 1624830558.0
        }
      ]
    },
    {
      "id": "h3nrcsl",
      "author": "derliesl",
      "body": "I am so sorry for your sudden loss. Are you getting help or support to cope with grief? Please take care of yourself.",
      "created_utc": 1625126117.0,
      "score": 2,
      "context": [
        {
          "id": "h3dknhh",
          "author": "DramaticBat",
          "body": "I'm 24 f. I've had it since I was 17. It started from trying to lose weight, then I lost more weight throughout college. I abused adderall and Vyvanse for a short time back in college as well. I guess I was in recovery since June 2020. But my fiancé passed away suddenly this month, so its coming back again.",
          "created_utc": 1624920978.0
        }
      ]
    },
    {
      "id": "h96c1r4",
      "author": "lunger_sally",
      "body": " I am sorry that you are in this situation. You deserve to focus your energy on positive life experiences. I hope you can find help <3",
      "created_utc": 1629131903.0,
      "score": 2,
      "context": [
        {
          "id": "h8ydzlu",
          "author": "JellyCharacter1653",
          "body": "Hi I’m 14 been struggling with bulimia since I was 10 n now anorexia I haven’t gotten professional help Bc of my mom I try n tell her but it always turns into an argument she’ll say oh so it’s my fault or you better not talk to me about this n she’s a nurse a freaking nurse I weigh like 105 Bc of a bad breakup where I didn’t eat for basically months and nobody noticed I’m trying to recover on my own rn with the support of my bsfs n stuff n I’ll relapse sometimes with bulimia",
          "created_utc": 1628974972.0
        }
      ]
    },
    {
      "id": "h96bm78",
      "author": "lunger_sally",
      "body": "I completely relate with the consumption of headspace. It can be overwhelming. Sending you love today! Stay strong.",
      "created_utc": 1629131735.0,
      "score": 1,
      "context": [
        {
          "id": "h91p260",
          "author": "s05k14w68",
          "body": "I’m 53 & went through anorexia-bulimia-anorexia-bulimia on & off depending on where I was in life.  Right now I’m menopausal & using restrictive behaviors to ward off age-related weight gain.  I’m on this sub to gauge my thought process against comments & behaviors here.  I find myself obsessed with losing & keeping weight off under the guise of being healthy but it consumes a lot of my headspace.",
          "created_utc": 1629044858.0
        }
      ]
    },
    {
      "id": "he2jf82",
      "author": "plslovemebvck",
      "body": "regarding purging, i can only imagine how your throat feels..bc i know mine is sore sometimes. but for being sober for two years, that’s awesome!! congratulations, i’m proud of you!",
      "created_utc": 1632474307.0,
      "score": 1,
      "context": [
        {
          "id": "he1d8v9",
          "author": "Callmecucumbere",
          "body": "I’m 28(f) and I’ve been bulimic since 15/16. It’s been up and down but I’ve purged usually once a day up to 6 times except for 2 one week long periods of time, as well as several days here and there. I’m in an IOP program right now. I’ve struggled with alcohol addiction and have been sober for over 2 years now trying to work on this. It’s hard.",
          "created_utc": 1632446922.0
        }
      ]
    },
    {
      "id": "hfaq82o",
      "author": "plslovemebvck",
      "body": "do you feel tired (sleepy) all the time or physically exhausted?",
      "created_utc": 1633309811.0,
      "score": 2,
      "context": [
        {
          "id": "hfapkvs",
          "author": "Sweaty_Ad_8262",
          "body": "i’m 15 and currently suffering with undiagnosed eating disorder. no i’m not one of those salad bowl “omg i’m so fat” girls. i’m severely underweight and can’t even get out of bed anymore",
          "created_utc": 1633309497.0
        }
      ]
    },
    {
      "id": "hqicoqy",
      "author": "kyacase",
      "body": "I’m not the person you asked this question to but my situation is the same so I’ll answer. \n\nI recovered because bulimia made me miserable. I was so tired and depressed but I wanted to be an skinny and thought this was the only way. Eventually I realized that mindset was really toxic and not everyone is going to like me just because I’m thin. Anyway In order to quit I found a food I absolutely couldn’t throw up. Spicy omelettes. Lots of hot sauce, it feels absolutely awful coming up and omelettes are super healthy anyway. It gave me a place to start working on recovery and slowly I started de restricting more foods and now I can eat whatever and still feel mostly alright. :)",
      "created_utc": 1640840395.0,
      "score": 1,
      "context": [
        {
          "id": "gwqdkoj",
          "author": "MediumPsychological9",
          "body": "I’m 21 f and was bulimic from 2017-2020 but recovered! Staying here to keep myself accountable and bc the posts are still so relatable",
          "created_utc": 1620004872.0
        },
        {
          "id": "hg0bx52",
          "author": "Impossible_Editor_98",
          "body": "How did you recovered?",
          "created_utc": 1633803706.0
        }
      ]
    },
    {
      "id": "gws3d8h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620048239.0,
      "score": 22,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "gwrzsx5",
          "author": "plslovemebvck",
          "body": "this may be weird, but just, thank you. it’s not often I see someone who has gone through this for a while and has lived to tell. also, your daughter being open about this to you is so inspiring. i feel like that is one of the biggest struggles, telling someone, and your daughter is awesome for doing that. i kind of envy her. anyway, i’m glad you both are doing well, and yes, of course i will come to you for questions. Thank you!",
          "created_utc": 1620046472.0
        }
      ]
    },
    {
      "id": "h89zzg7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1628511003.0,
      "score": 3,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h85y1c7",
          "author": "speakloudly",
          "body": "I was just reading this and I am a newly recovered bulimic. I am 31f and I have two children. I worry for them as I wish for no one to suffer the way I did. \nHow did you come to know about your daughter's disorder? Did she know about yours? I apologized if I am asking too much it would just be helpful.",
          "created_utc": 1628427475.0
        }
      ]
    },
    {
      "id": "h4vk29v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1626055997.0,
      "score": 2,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h4tco9b",
          "author": "wafflerain5",
          "body": "Hey, how did you recover on your own. I've been trying to do that for months but I think I'm just lying to myself, I relapse so often.",
          "created_utc": 1626016416.0
        }
      ]
    },
    {
      "id": "h57tn68",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1626308132.0,
      "score": 2,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h57qj8j",
          "author": "Disordernymity",
          "body": "I’m a 38f who was also dx’d w/anorexia at a young age which turned into bulimia off-and-on for the past 20+ years - basically every time I try to lose weight, I fall back into it. It’s awful; I have an aunt in her 60’s who has a heart condition from decades of bulimia. I have also lost and damaged teeth from this damn disease! I’m hoping upon hope that my daughter doesn’t end up with a disordered relationship with food.",
          "created_utc": 1626306499.0
        }
      ]
    },
    {
      "id": "h5avbag",
      "author": "AnaDion94",
      "body": "It is the funniest thing in the world that I just got out of a meeting, put my head down and thought “god, I hate my job” and then immediately saw this notification 😭😂😂\n\nEdit: for what it’s worth, the actual sock part is fun. Is the company that’s miserable, so you’re not wrong.",
      "created_utc": 1626372001.0,
      "score": 11,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        },
        {
          "id": "h5aut0w",
          "author": "SinfullySinatra",
          "body": "Ooh sock designing sounds fun",
          "created_utc": 1626371791.0
        }
      ]
    },
    {
      "id": "gwsrdmu",
      "author": "lunger_sally",
      "body": "thank you so much for the kind words & encouragement! It means so much!",
      "created_utc": 1620058821.0,
      "score": 2,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        },
        {
          "id": "gwsll97",
          "author": "plslovemebvck",
          "body": "seeking a professional for help is sooooo hard, but i believe in you! please let me know how it goes! and please stay strong. from what you’ve told me, it sounds super exhausting, and i can only imagine the relief you’ll finally get when everything is finally settled. i’ll be waiting!",
          "created_utc": 1620056390.0
        }
      ]
    },
    {
      "id": "h95m7q1",
      "author": "lunger_sally",
      "body": "Thank you! I made the first call to schedule an appointment with a professional... It was sooo awkward. I'm so sorry your husband doesn't believe in therapy, as it may help tremendously! Sending you some extra love!",
      "created_utc": 1629121340.0,
      "score": 2,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        },
        {
          "id": "h6wg4l9",
          "author": "Disordernymity",
          "body": "Just pulled up this stickied post and read your response. I so feeeel the not being the same size for a year. I fluctuate dramatically and have a wide variety of sizes hanging in my closet - including maternity clothes ranging from small to XL! \n\nGood for you for having professional help on your list!! I’m still trying to get the courage up for that and for talking to my husband (who doesn’t believe in therapy nor paying a bunch of money for it) about it.",
          "created_utc": 1627520401.0
        }
      ]
    },
    {
      "id": "h95mv27",
      "author": "lunger_sally",
      "body": "Sending you some extra love today! <3",
      "created_utc": 1629121637.0,
      "score": 1,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        },
        {
          "id": "h4k1grq",
          "author": "Puzzledchica",
          "body": "I am sorry about this. I am also working on this and as you say is exhausting thinking about weight allthe time.",
          "created_utc": 1625804398.0
        }
      ]
    },
    {
      "id": "h95mqtk",
      "author": "lunger_sally",
      "body": "It seems that you found some of your triggers, which is great! Now you need to figure out how to avoid pulling that trigger. I feel that I've slowly been getting better, but I just want to talk to someone and see if they have any tricks on coping with triggers etc. You're also a strong person! <3 Stay positive and keep moving forward, you're making more progress than you realize!",
      "created_utc": 1629121584.0,
      "score": 1,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        },
        {
          "id": "h4uvdz5",
          "author": "lilly_illy",
          "body": "Fuck. I admire you for surviving all this. I only had a few rough periods like this (with purging several times a week and running 5-10k afterwards). Now I think I got it under control but I still do it when I'm stressed out or sad about something (several times a month usually). I've been debating with myself about getting help. I'm afraid talking about this will get me even more focused on this thing, and so far the opposite worked best for me - live life without obsessing about food. Anyway.\n\nThanks for sharing this. You are a strong woman! I hope you do get help and eventually recover.",
          "created_utc": 1626043022.0
        }
      ]
    },
    {
      "id": "h6fyw28",
      "author": "FairlyLocalDumbass",
      "body": "OOOOH A STANG!!!",
      "created_utc": 1627188853.0,
      "score": 1,
      "context": [
        {
          "id": "gwqiaph",
          "author": "testfreak377",
          "body": "I’m 19(m) had bulimia since 15 but only the last year has it been bad. Competed in triathlons till 13 then started bodybuilding. Unfortunately couldn’t continue with that due to binging and purging, but I will continue that and other pursuits after I choose to recover. I love trucks, Hypercars and murdered out Escalade would be a badass daily driver.\n\nFuck this illness I will beat it into submission one day soon !",
          "created_utc": 1620007475.0
        },
        {
          "id": "gwqj377",
          "author": "plslovemebvck",
          "body": "i’m in your boat bro. i’ve ran 4 full marathons (first being at 15 when i started this) and a dozen halves. i also saved money to buy a 65 mustang last year. check my insta @Lcwkee. this shit sucks :/ i’m more prone to breaking things when i skate now, like my foot and finger so far. hopefully one day this will all go away",
          "created_utc": 1620007916.0
        }
      ]
    },
    {
      "id": "h428un8",
      "author": "workingonselfkind",
      "body": "32, since I was 18. Anorexia and bulimia and alcohol use disorder. I have been able to embrace sobriety but still struggle with EDs.",
      "created_utc": 1625432126.0,
      "score": 1,
      "context": [
        {
          "id": "gwqlqws",
          "author": "carlyilanar",
          "body": "32 female. Been struggling for 7ish years. Working on recovering! Some days are better than others. I’m a high level executive assistant! I have 2 nieces and a nephew who are the lights of my life. Unfortunately still single",
          "created_utc": 1620009406.0
        },
        {
          "id": "h0dn03g",
          "author": "LearningAsIGo89",
          "body": "Similar boat as you but I’m an executive communications director. 32 and have been bulimic since 16. I can’t seem to kick this hellish dis-ease and from the outside in everything looks like rainbows and butterflies. I’m just trying to find and accept help wherever I can at this point.",
          "created_utc": 1622678455.0
        }
      ]
    },
    {
      "id": "gwqt1f4",
      "author": "chronaloid",
      "body": "That’s really cool! I’ve studied Spanish in the past but am bouncing between Russian and French rn :) good luck in your studies!",
      "created_utc": 1620013813.0,
      "score": 2,
      "context": [
        {
          "id": "gwqsbbj",
          "author": "chronaloid",
          "body": "I’m 20 m and have been eating disordered since I was 14 at least but only truly bulimic since I was like 19... idek anymore. My main interests are herpetology and linguistics. Cool thread to read thru.",
          "created_utc": 1620013343.0
        },
        {
          "id": "gwqsoj3",
          "author": "plslovemebvck",
          "body": "yo that’s awesome, i’m currently study spanish and japanese every day. 1, so i can finally become fully fluent in spanish and 2, to learn what i can to go visit japan! but hey..time flies doesn’t it?",
          "created_utc": 1620013580.0
        }
      ]
    },
    {
      "id": "gxv660q",
      "author": "esoterique87",
      "body": "No trouble at all. I'm not personally a recovery coach but I am working with a coach at the moment. I like to come on this forum and try to help others and share some tools/tips that I've learned. I know how difficult recovery can be, especially if you don't have professional help. I can link you to a great video that my coach did about overshoot weight. You can find her video [here](https://www.youtube.com/watch?v=eHhOUivBCMo).\n\nI definitely understand the temptation to go back to your ED and to lose weight. I relapsed last spring after gaining weight and not having the proper tools to help with body image. I went back to restriction which then led me back to bulimia and now I am climbing out of that relapse. Your ED is telling you that your body is the problem but in reality it's your eating disorder that is the problem. A big part of recovery is learning how to talk to yourself and how to accept your body. You don't always have to love it but you can accept it and treat yourself with kindness.\n\nThere is a great tool you can use to help with body image. Imagine a friend or a loved one who is in your position. They are in recovery and now they are struggling with their body image. What would you say to that person? I'm sure it would be something kind, compassionate and supportive right? That is your healthy self. When you are having ED thoughts about your body, try to respond to them in the way you would for another person. Your ED voice doesn't have to dominate your headspace, you have the ability to respond to it and to change the story you are telling yourself. I hope this helps! ❤️",
      "created_utc": 1620834428.0,
      "score": 2,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        },
        {
          "id": "gxuc92n",
          "author": "None",
          "body": "Anorexia (restrictive) - anorexia (b/p) - bulimia was my progression at 14/15. Your recovery work is so inspiring. I’m struggling with overshoot weight right now and a desire to relapse (romanticization). I’m sorry for all the trouble, but can I ask if you have any advice?",
          "created_utc": 1620820052.0
        }
      ]
    },
    {
      "id": "gx1ma7v",
      "author": "esoterique87",
      "body": "Thank you! I appreciate the support. My very first steps towards recovery were first telling my Mom. Reaching out and telling someone can really get the ball rolling. I also read books and consumed a lot of recovery content on YouTube. I really wanted to be free of bulimia but I couldn't do it on my own, no matter how many books I read or videos I watched. A YouTuber, who I really admired and related to, happened to also be a recovery coach so I reached out to her. I was lucky enough to get a spot and I have been making much better progress than I did on my own. \n\nTaking any steps, no matter how small, is a good thing. It could be reading books or telling someone or finding a therapist/coach, even coming on this forum. No matter what you decide to do, you will never feel 100% ready to recover. There is no perfect time or level of preparedness. You just have to make the decision and start taking steps.\n\nHere are some of the resources I used/currently use in recovery. \n\nBooks: [The Bulimia Help Method](https://www.amazon.com/Bulimia-Help-Method-Revolutionary-Approach-ebook/dp/B00PB7JI5A) by Ali Kerr and Richard Kerr, [8 Keys to Recovery From an Eating Disorder](https://www.amazon.com/Keys-Recovery-Eating-Disorder-Therapeutic/dp/0393706958) by Carolyn Costin\n\nYouTube: [WhatMiaDidNext](https://www.youtube.com/c/WhatMiaDidNext/featured), [Megsy Recovery](https://www.youtube.com/channel/UCey1WBhNthBx0vDy-pHe9uw), [Binge Breakers](https://www.youtube.com/channel/UC9bGHx5Vr96hjaN5oDZlcFA)",
      "created_utc": 1620232915.0,
      "score": 2,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        },
        {
          "id": "gwybyn7",
          "author": "plslovemebvck",
          "body": "i’m so glad you are in recovery, like genuinely! but i have a question, mainly for myself. How did you take the first step towards help and what did you do?",
          "created_utc": 1620165018.0
        }
      ]
    },
    {
      "id": "gwyeuzz",
      "author": "lonellyrabbit",
      "body": "aaah, thank you, means a lot. :] <3",
      "created_utc": 1620166294.0,
      "score": 1,
      "context": [
        {
          "id": "gwu0p2j",
          "author": "lonellyrabbit",
          "body": "hi! i‘m a 17 year old girl from Germany. I have been bulimic for 3/4 years, kept it a secret until now. only recently I made a quite big change in my life, told my mom about it, went to hospital and now I quit school to recover and have to go to a ed clinic soon. I’m scared what‘s gonna happen now that everyone knows, because it was my tiny little secret that kept me protected and helped me deal w the shit in this world. I don‘t know who I am without it as I spent all my teenage years walking from fridge to toilet and back. But I hope there is a better life ahead. I wish you the best of luck on your recovery journey. ✨",
          "created_utc": 1620078209.0
        },
        {
          "id": "gwyckfd",
          "author": "plslovemebvck",
          "body": "thank you <3 but also, let it happen. be open to the process of recovery, and let them know what you are truly feeling. i believe in you, really, and i promise everything will be okay <3",
          "created_utc": 1620165279.0
        }
      ]
    },
    {
      "id": "gwquh6r",
      "author": "Mean-Competition3757",
      "body": "❤️❤️ same to you! Thank you",
      "created_utc": 1620014761.0,
      "score": 3,
      "context": [
        {
          "id": "gwqtnar",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620014210.0
        },
        {
          "id": "gwqtt6y",
          "author": "plslovemebvck",
          "body": "i am so proud of you, genuinely. i may not know you personally, but i know the battle is hard. keep it up soldier, love you <3",
          "created_utc": 1620014317.0
        }
      ]
    },
    {
      "id": "gwycc32",
      "author": "sheddinglikeamofo",
      "body": "Haven’t eaten it yet but I suspect tonight it’ll be dinner",
      "created_utc": 1620165179.0,
      "score": 1,
      "context": [
        {
          "id": "gwvghoi",
          "author": "sheddinglikeamofo",
          "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
          "created_utc": 1620104872.0
        },
        {
          "id": "gwyb7dl",
          "author": "plslovemebvck",
          "body": "sorry the late reply, but your dog is badass as hell! and also, did you eat the chicken 😏, was it good ?😤",
          "created_utc": 1620164692.0
        }
      ]
    },
    {
      "id": "gwyf4rc",
      "author": "sheddinglikeamofo",
      "body": "lol for sure I have a small video of me plucking it too if you’re interested?",
      "created_utc": 1620166417.0,
      "score": 1,
      "context": [
        {
          "id": "gwvghoi",
          "author": "sheddinglikeamofo",
          "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
          "created_utc": 1620104872.0
        },
        {
          "id": "gwyb7dl",
          "author": "plslovemebvck",
          "body": "sorry the late reply, but your dog is badass as hell! and also, did you eat the chicken 😏, was it good ?😤",
          "created_utc": 1620164692.0
        }
      ]
    },
    {
      "id": "gx8j2rz",
      "author": "NightWorldPerson",
      "body": "It depends on person to person. If you feel ready or want to get help, I would say to visit your doctor/nurse practitioner and ask for confidentiality and tell them what's going on and that you want to discuss situations for getting mentally and physically better. Even if you have to write it on paper and show it to them, that's okay. \n\nIf you have a family member or a friend, tell them. Ask them to help you through this and step up a schedule/plan that focuses on you gaining back the weight. Like little goals for over long periods of time, and if you miss  or mess it up, it's okay. This is a healing process that takes time. \n\nI know that this subreddit has information and guides on getting better. Maybe that could be your start.\n\nThere's also the national hotline for ED,\n\nhttps://www.nationaleatingdisorders.org/help-support/contact-helpline\n\nIf you want to PM me, I'm always here to talk to. I hope that this is a starting point in recovery for you. I believe in you and I'm proud of you for joining this subreddit!",
      "created_utc": 1620360438.0,
      "score": 2,
      "context": [
        {
          "id": "gwywvzy",
          "author": "NightWorldPerson",
          "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
          "created_utc": 1620174819.0
        },
        {
          "id": "gx7mnrm",
          "author": "plslovemebvck",
          "body": "lmao thank you. what advice would you give to someone like us. like currently i’m at 102, and before i thought my ideal body was at 109. but now weighing 102, i still feel fat. i remember thinking that once i can see my sternum (109), that, that would mean i’m good, but now i don’t even care about the sternum, but am noticing a decrease in pectoral and leg muscle now. so, what advice would you give?",
          "created_utc": 1620343219.0
        }
      ]
    },
    {
      "id": "h1s5ouy",
      "author": "lovedecay",
      "body": "wtf does this question even mean",
      "created_utc": 1623708956.0,
      "score": 2,
      "context": [
        {
          "id": "gwywvzy",
          "author": "NightWorldPerson",
          "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
          "created_utc": 1620174819.0
        },
        {
          "id": "gx7mnrm",
          "author": "plslovemebvck",
          "body": "lmao thank you. what advice would you give to someone like us. like currently i’m at 102, and before i thought my ideal body was at 109. but now weighing 102, i still feel fat. i remember thinking that once i can see my sternum (109), that, that would mean i’m good, but now i don’t even care about the sternum, but am noticing a decrease in pectoral and leg muscle now. so, what advice would you give?",
          "created_utc": 1620343219.0
        }
      ]
    },
    {
      "id": "gwymm45",
      "author": "mondaysme",
      "body": "Physically, I feel I have been very fortunate. Two children and a grandchild. I still work. My relationship with food sucks. I know I must, but there isn't a lot of joy in eating. Even things I enjoy I will deny myself to eat. I don't like to see others eat or obsess about food. I feel like I've won the war on being actively bulimic, but I don't think I will escape this, ever.",
      "created_utc": 1620169914.0,
      "score": 3,
      "context": [
        {
          "id": "gwtb47n",
          "author": "mondaysme",
          "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
          "created_utc": 1620067079.0
        },
        {
          "id": "gwycswl",
          "author": "plslovemebvck",
          "body": "if you’re active and still full of energy, i want to be like you! bc i feel like the exhaustion and fatigue is what gets to us heavily, and that’s what i despise the most :/",
          "created_utc": 1620165382.0
        }
      ]
    },
    {
      "id": "gxzxvkj",
      "author": "hdjldk",
      "body": "16 year olds suck ass sometimes man\n\nAlso, that's such a beautiful style! I've always wanted to try something like that, but I've never had the courage to do it for fear of failing. I usually do realism portraits :)",
      "created_utc": 1620925309.0,
      "score": 2,
      "context": [
        {
          "id": "gxsxsad",
          "author": "hdjldk",
          "body": "I'm 16F, I've been bulimic for four months. I developed bulimia right at my one year mark being clean from anorexia, which I'd had since I was about ten or eleven. I don't do much, but I love drawing digital portraits, singing and knitting. I'm tryna spend more time with my reptiles and I'm tryna work on my diet and exercise (I used to be super fit, but had to stop due to covid). All around my ex told me I was one of the unfunniest people he's met and the girl his friends wanted him to be with said I'm a bitch who makes everyone sad. Yay",
          "created_utc": 1620783546.0
        },
        {
          "id": "gxzs87a",
          "author": "TranZeitgeist",
          "body": "Just putting it out there, some 16 year olds have a special talent for saying hurtful, pointed things. Digital portraits is a cool skill to work on. idk what style you like, but can I share a yt portrait artist I enjoy? - [Danica Sills](https://www.youtube.com/channel/UChbmw2hACnc5JqYp_ItUfgg)",
          "created_utc": 1620922928.0
        }
      ]
    },
    {
      "id": "gwrzyj2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620046554.0,
      "score": 2,
      "context": [
        {
          "id": "gwrkkk7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620036885.0
        },
        {
          "id": "gwrza84",
          "author": "plslovemebvck",
          "body": "if i may ask..what made you want to go back?",
          "created_utc": 1620046206.0
        }
      ]
    },
    {
      "id": "gwycet3",
      "author": "rigadoontoon",
      "body": "so when we were little, my brothers were always thin and athletic, and my parents praised them a lot, whereas i was average/a little bit chubby and i got yelled at for it. my parents are abusive so i'd get hit/yelled at if i wasted food, ate too much or too little, and i didnt know how to act to please them. that's my guess at least :\\ and YES YES OF COURSE THEYRE ALL STERILE AND NEW I PROMISE !!!!!!! i just did a wombat and a little face on my left leg hehe :>",
      "created_utc": 1620165211.0,
      "score": 1,
      "context": [
        {
          "id": "gwuuhhi",
          "author": "rigadoontoon",
          "body": "i'm 18(nb) and i've struggled with disordered eating habits since kindergarten. i love my friends, drawing with dip pens, making and listening to music, and my shitty, steadily growing collection of stick and pokes that i use to cope :) i hope ur well and if not, i send love and warmth and hugs your way <3 it's nice to meet u!! :)",
          "created_utc": 1620092394.0
        },
        {
          "id": "gwybg4r",
          "author": "plslovemebvck",
          "body": "WAIT QUESTION(s)!! i’m genuinely curious, what made you develop restricted eating habits that young? and also, DO YOU REPLACE THE NEEDLE AFTER EVERY USE???!??",
          "created_utc": 1620164798.0
        }
      ]
    },
    {
      "id": "gwznvxb",
      "author": "tootegost",
      "body": "My cat's name is Utu, it means something like \"fog, haze, mist\". She isn't any breed but just a basic cat. I like to try and play all classes but I've always preferred (in video games too) all melee classes. So as basic as it may sound I really like playing a fighter.",
      "created_utc": 1620188699.0,
      "score": 1,
      "context": [
        {
          "id": "gwy78hw",
          "author": "tootegost",
          "body": "New to reddit altogether. I'm 18 and nonbinary, have been having ed for 7 yrs now with varying behaviors. The last two years I've been bulimic. I live with a cat and try to grow vegetables on my balcony. I have many intensive interests but since last fall Dungeons & Dragons has been pretty dominant. Other things are for example language learning, arts and crafts, photographing street art, and music. :) This happens to be my very first text on Reddit, quite suitable for it to be an introduction.",
          "created_utc": 1620162996.0
        },
        {
          "id": "gwyar9y",
          "author": "plslovemebvck",
          "body": "hiii, what’s your cats name and what breed?? and also...what character class do you main in D&D👀? i was always a warlock and was in a D&D club in high school for a bit",
          "created_utc": 1620164498.0
        }
      ]
    },
    {
      "id": "h2nbkyu",
      "author": "sigmundfreudofficial",
      "body": "Appreciate it :'^)",
      "created_utc": 1624367183.0,
      "score": 1,
      "context": [
        {
          "id": "h1bd9fv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623352365.0
        },
        {
          "id": "h1lkoyc",
          "author": "winnie0718",
          "body": "Very well said 💪🏼",
          "created_utc": 1623568421.0
        }
      ]
    },
    {
      "id": "h2nd521",
      "author": "sigmundfreudofficial",
      "body": "thank you dude-- this is a huge compliment for me xP",
      "created_utc": 1624368045.0,
      "score": 1,
      "context": [
        {
          "id": "h1bd9fv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623352365.0
        },
        {
          "id": "h1s6d4v",
          "author": "lovedecay",
          "body": "you are definitely wise beyond your years",
          "created_utc": 1623709233.0
        }
      ]
    },
    {
      "id": "gwyemwc",
      "author": "plslovemebvck",
      "body": "your**** and i meant when i said children, my sister is a teacher and calls them her “kids” all the time lmao",
      "created_utc": 1620166193.0,
      "score": 1,
      "context": [
        {
          "id": "gwqh4xd",
          "author": "None",
          "body": "I’m 27, diagnosed with anorexia with purging tendencies. I’ve struggled with my ED for 12 years and was nearly recovered until my current relapse has taken a toll on all of that. I love cats (I have one), going to the gym, working with children, and enjoy singing. I just got my license a couple of months ago.. after years of being absolutely terrified lmao. I think this kind of post is a good idea!",
          "created_utc": 1620006837.0
        },
        {
          "id": "gwyegvh",
          "author": "plslovemebvck",
          "body": "oh wow! you seem incredibly busy, and i love that! i know what i say won’t mean much, since i’m younger, but having hobbies nonstop with also some time to rest and just sit there and think, has helped my mind. meditating is great, it has helped open my third eye 👁, and the rose quartz on my thumb always helps me realize that i am loved, just like you are. you’re family, you’re friends, and children are all counting on you. you can’t let this get this better of you. show them that you will not take anyone or anything’s shit! you got this!",
          "created_utc": 1620166119.0
        }
      ]
    },
    {
      "id": "gwr5en3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620023165.0,
      "score": 1,
      "context": [
        {
          "id": "gwr2ktg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620020770.0
        },
        {
          "id": "gwr47xt",
          "author": "plslovemebvck",
          "body": "can we talk? is that okay? is there somewhere i can reach you?",
          "created_utc": 1620022142.0
        }
      ]
    },
    {
      "id": "h324tjd",
      "author": "dicksandtits420",
      "body": "my cats name is whiskey! I also managed to get another one since this comment was posted and his name is max:) and honestly I hate to say it but my favorite episode is probably season 5 episode 1 lmao and my favorite strain is pink lady:)",
      "created_utc": 1624669121.0,
      "score": 1,
      "context": [
        {
          "id": "gwt6sjr",
          "author": "dicksandtits420",
          "body": "14, f, I've only been diagnosed for a few months but its been like this since 2018:)\n\nedit: ig we're sharing so I really like my cat and the show rick and morty. that's basically it, other then that and smoking pot, thats who I am",
          "created_utc": 1620065271.0
        },
        {
          "id": "gwyd6zq",
          "author": "plslovemebvck",
          "body": "hiiii!!! your username is totally something i would expect from a 14 year old (no hate, just smiling at the mindset i also had that age)! but also, what’s your cats’s name? favorite episode/season? and what strand is your preferred one? unless you mostly smoke dab pens, then what flavor?",
          "created_utc": 1620165554.0
        }
      ]
    },
    {
      "id": "gx3pykg",
      "author": "None",
      "body": "Spanish! I'd love to be a translator. \n\nYou've got so many experiences ahead of you and obviously a good heart. I hope that as you continue to grow, you find more of what you need to fill the space that bulimia tries to fill. So much changes between 21 and 31, it's going to surprise and delight you.",
      "created_utc": 1620266542.0,
      "score": 1,
      "context": [
        {
          "id": "gwvg02j",
          "author": "None",
          "body": "I'm a 31 yr-old queer cis female who started restricting hard at 14 and was actively bulimic from 15-29. I've been in therapy for my ED and depression/anxiety since then and I'm in an area with ED gurus, so I've been mega fortunate in my treatment experience. I'm 2 years into recovery as of April and 5 years sober in June, and I attribute a lot of the recent growth in my ED recovery to being able to overcome that. Things didn't really start to change until I quit drinking but when they did, they changed A LOT. I still have to work at my ED every day but it's nothing like it used to be, and making good connections with others in recovery helps sooooo much.\n\nI've got a good job but I'm looking for something that I'll like more. Graduating college in a few weeks and starting grad school in the Fall.",
          "created_utc": 1620104528.0
        },
        {
          "id": "gww0thi",
          "author": "plslovemebvck",
          "body": "awwww🥺 i’m so happy you’re moving forward with life. what do you plan on studying in grad school?",
          "created_utc": 1620122453.0
        }
      ]
    },
    {
      "id": "gx7was2",
      "author": "None",
      "body": "I think I might be in the minority but also let me know if anybody is the same. But my ED didn't stem from self-esteem issues (even though sometimes it does happen). I started to restrict food if I had bad grades or I was awkward during a conversation. Basically, I used it as a punishment and reward system which snowballed. It eventually turned into me not believing that I deserve food, which is where I am now pretty much.  I also purge but that's mostly because my body wants it out of me or I'm really depressed. However, I haven't been able to purge lately because of lockdown. 😢",
      "created_utc": 1620348125.0,
      "score": 1,
      "context": [
        {
          "id": "gx76qkk",
          "author": "None",
          "body": "I'm 20 (f) and have had an ED since 16 but didn't start purging until like 17-18 ish. So yeah I def got my shit together",
          "created_utc": 1620335941.0
        },
        {
          "id": "gx7urze",
          "author": "plslovemebvck",
          "body": "shit together gang 💯...but also..what specifics are the reason you do this? like for me, i think my chest muscles are a little too much, i want the thigh gap, and to keep my abs. wbu..? it’s okay if you don’t want to say, i still love you <3",
          "created_utc": 1620347351.0
        }
      ]
    },
    {
      "id": "h3sc3i2",
      "author": "DramaticBat",
      "body": "I have a therapist, but I feel only time helps with this grief. Thank you.",
      "created_utc": 1625218986.0,
      "score": 1,
      "context": [
        {
          "id": "h3dknhh",
          "author": "DramaticBat",
          "body": "I'm 24 f. I've had it since I was 17. It started from trying to lose weight, then I lost more weight throughout college. I abused adderall and Vyvanse for a short time back in college as well. I guess I was in recovery since June 2020. But my fiancé passed away suddenly this month, so its coming back again.",
          "created_utc": 1624920978.0
        },
        {
          "id": "h3nrcsl",
          "author": "derliesl",
          "body": "I am so sorry for your sudden loss. Are you getting help or support to cope with grief? Please take care of yourself.",
          "created_utc": 1625126117.0
        }
      ]
    },
    {
      "id": "he3wyly",
      "author": "Callmecucumbere",
      "body": "It actually really rarely feels sore, I always stop when it starts getting acidic coming up (toward the end). I think with how much I purge and for how long I don’t digest food the same so it takes a while (usually more than 2 hours) for it to start being acidic. \n\nHonestly I wish I had more negative side effects because I think it would help me quit. The only really negative side effects are puffy cheeks, unstable weight (my weight fluctuates up and down a lot), and then anxiety/depression. But no medical or health issues. Never been to the hospital, no dental issues, no electrolyte imbalances. It’s wild.",
      "created_utc": 1632500888.0,
      "score": 1,
      "context": [
        {
          "id": "he1d8v9",
          "author": "Callmecucumbere",
          "body": "I’m 28(f) and I’ve been bulimic since 15/16. It’s been up and down but I’ve purged usually once a day up to 6 times except for 2 one week long periods of time, as well as several days here and there. I’m in an IOP program right now. I’ve struggled with alcohol addiction and have been sober for over 2 years now trying to work on this. It’s hard.",
          "created_utc": 1632446922.0
        },
        {
          "id": "he2jf82",
          "author": "plslovemebvck",
          "body": "regarding purging, i can only imagine how your throat feels..bc i know mine is sore sometimes. but for being sober for two years, that’s awesome!! congratulations, i’m proud of you!",
          "created_utc": 1632474307.0
        }
      ]
    },
    {
      "id": "hfaqi4x",
      "author": "Sweaty_Ad_8262",
      "body": "constantly. but funnily enough, i can never get to sleep because of the pain and constant anxiety. i’m trying to get help, i don’t want this to be my life.",
      "created_utc": 1633309947.0,
      "score": 2,
      "context": [
        {
          "id": "hfapkvs",
          "author": "Sweaty_Ad_8262",
          "body": "i’m 15 and currently suffering with undiagnosed eating disorder. no i’m not one of those salad bowl “omg i’m so fat” girls. i’m severely underweight and can’t even get out of bed anymore",
          "created_utc": 1633309497.0
        },
        {
          "id": "hfaq82o",
          "author": "plslovemebvck",
          "body": "do you feel tired (sleepy) all the time or physically exhausted?",
          "created_utc": 1633309811.0
        }
      ]
    },
    {
      "id": "gwsl59c",
      "author": "plslovemebvck",
      "body": "you’re awesome! and i agree, humor helps!...even if it’s kinda morbid :/",
      "created_utc": 1620056202.0,
      "score": 5,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "gwrzsx5",
          "author": "plslovemebvck",
          "body": "this may be weird, but just, thank you. it’s not often I see someone who has gone through this for a while and has lived to tell. also, your daughter being open about this to you is so inspiring. i feel like that is one of the biggest struggles, telling someone, and your daughter is awesome for doing that. i kind of envy her. anyway, i’m glad you both are doing well, and yes, of course i will come to you for questions. Thank you!",
          "created_utc": 1620046472.0
        },
        {
          "id": "gws3d8h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620048239.0
        }
      ]
    },
    {
      "id": "gzka2e1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622063864.0,
      "score": 3,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "gwrzsx5",
          "author": "plslovemebvck",
          "body": "this may be weird, but just, thank you. it’s not often I see someone who has gone through this for a while and has lived to tell. also, your daughter being open about this to you is so inspiring. i feel like that is one of the biggest struggles, telling someone, and your daughter is awesome for doing that. i kind of envy her. anyway, i’m glad you both are doing well, and yes, of course i will come to you for questions. Thank you!",
          "created_utc": 1620046472.0
        },
        {
          "id": "gws3d8h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620048239.0
        }
      ]
    },
    {
      "id": "h8cqdhk",
      "author": "speakloudly",
      "body": "I read this and cried. I wish so badly that my mom had your mindset when I was your daughter's age. You've been doing everything so right and she must be so blessed to have such an amazing support system. \n\nI reached out because unfortunately my mother was an enabler to my disorder, along with my siblings disorders. We were raised to fear being obese or \"fat\" and we were raised with a fear of being unwanted. Out of the four of us, three of us were diagnosed with eating disorders and depression. My mother would use the disorder against us and mock us with it. \n\n I am by no means trying to create a sob story but I just don't know what a supportive mother would look like. I am the second oldest and my two younger siblings who went to get help would use me as support. And I loved that and I made our bond now very strong. However, they were in their teens and I wasn't their mom, I was their sister so it was different. I'm just worried that j will do something, or say something that will trigger them and that I won't notice. \n\nMy fear inevitably boils down to me not wanting my children to feel how I felt. I don't want them to have a broken relationship with food. I don't want to be like my mother. \n\nReading this really means alot to me and helps more than you know. \n\nI wish your family a life time of happiness.",
      "created_utc": 1628555732.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h85y1c7",
          "author": "speakloudly",
          "body": "I was just reading this and I am a newly recovered bulimic. I am 31f and I have two children. I worry for them as I wish for no one to suffer the way I did. \nHow did you come to know about your daughter's disorder? Did she know about yours? I apologized if I am asking too much it would just be helpful.",
          "created_utc": 1628427475.0
        },
        {
          "id": "h89zzg7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628511003.0
        }
      ]
    },
    {
      "id": "h6raf1g",
      "author": "textbookroadmapnot",
      "body": "It’s not ironic that your daughter started, for godsake, she picked up signals from you. Genetic? you don’t have a clue, Your opinions on this are dangerous.",
      "created_utc": 1627422946.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h4tco9b",
          "author": "wafflerain5",
          "body": "Hey, how did you recover on your own. I've been trying to do that for months but I think I'm just lying to myself, I relapse so often.",
          "created_utc": 1626016416.0
        },
        {
          "id": "h4vk29v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1626055997.0
        }
      ]
    },
    {
      "id": "h580vvp",
      "author": "Disordernymity",
      "body": "Thank you, she’s a toddler right now, and it’s sad that these thoughts hit me as soon as she was born (we didn’t find out the sex beforehand). I still struggle with disordered eating, and hope I can find recovery before she gets old enough to recognize it. I’m sorry that you and your daughter have experienced this, but I so much appreciate your insight and wisdom!",
      "created_utc": 1626311903.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h57qj8j",
          "author": "Disordernymity",
          "body": "I’m a 38f who was also dx’d w/anorexia at a young age which turned into bulimia off-and-on for the past 20+ years - basically every time I try to lose weight, I fall back into it. It’s awful; I have an aunt in her 60’s who has a heart condition from decades of bulimia. I have also lost and damaged teeth from this damn disease! I’m hoping upon hope that my daughter doesn’t end up with a disordered relationship with food.",
          "created_utc": 1626306499.0
        },
        {
          "id": "h57tn68",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1626308132.0
        }
      ]
    },
    {
      "id": "h5aw1r8",
      "author": "SinfullySinatra",
      "body": "Ha nice.",
      "created_utc": 1626372305.0,
      "score": 2,
      "context": [
        {
          "id": "gwqawvq",
          "author": "AnaDion94",
          "body": "I’m 27, female, and have developed bulimia last year (woohoo covid) after years of various disordered behaviors. I’ve been in recovery for 93 days. \nI’m a sock designer and like baking cookies (this feels like a get to know you exercise, so those are my fun facts).",
          "created_utc": 1620003400.0
        },
        {
          "id": "h5aut0w",
          "author": "SinfullySinatra",
          "body": "Ooh sock designing sounds fun",
          "created_utc": 1626371791.0
        },
        {
          "id": "h5avbag",
          "author": "AnaDion94",
          "body": "It is the funniest thing in the world that I just got out of a meeting, put my head down and thought “god, I hate my job” and then immediately saw this notification 😭😂😂\n\nEdit: for what it’s worth, the actual sock part is fun. Is the company that’s miserable, so you’re not wrong.",
          "created_utc": 1626372001.0
        }
      ]
    },
    {
      "id": "gwyd8fo",
      "author": "plslovemebvck",
      "body": "of course!!!",
      "created_utc": 1620165571.0,
      "score": 3,
      "context": [
        {
          "id": "gwsdyii",
          "author": "lunger_sally",
          "body": "31 (f) bulimic since I was 21. Always struggled with body image and had disordered eating since my teens. My bulimia was really bad for the first 3 years - I was purging almost everything and running 5 miles a day. Now, I'm active but overweight and still struggle with my body image. In the last 5 years I've weighed anywhere from 140lbs up to my largest at 265lbs (I'm 5'10\"). I've never had a full year where I stayed the same clothing size. It's all exhausting. I have months were I'm okay, and months where I'm not okay. I have a few medical things that I am taking care of this year, and finding a professional for treatment is on that list. Sending love to everyone struggling, recovering, and anything in-between.",
          "created_utc": 1620053120.0
        },
        {
          "id": "gwsll97",
          "author": "plslovemebvck",
          "body": "seeking a professional for help is sooooo hard, but i believe in you! please let me know how it goes! and please stay strong. from what you’ve told me, it sounds super exhausting, and i can only imagine the relief you’ll finally get when everything is finally settled. i’ll be waiting!",
          "created_utc": 1620056390.0
        },
        {
          "id": "gwsrdmu",
          "author": "lunger_sally",
          "body": "thank you so much for the kind words & encouragement! It means so much!",
          "created_utc": 1620058821.0
        }
      ]
    },
    {
      "id": "gwqtcau",
      "author": "plslovemebvck",
      "body": "thank you sir, こちらこそ！(likewise)",
      "created_utc": 1620014006.0,
      "score": 2,
      "context": [
        {
          "id": "gwqsbbj",
          "author": "chronaloid",
          "body": "I’m 20 m and have been eating disordered since I was 14 at least but only truly bulimic since I was like 19... idek anymore. My main interests are herpetology and linguistics. Cool thread to read thru.",
          "created_utc": 1620013343.0
        },
        {
          "id": "gwqsoj3",
          "author": "plslovemebvck",
          "body": "yo that’s awesome, i’m currently study spanish and japanese every day. 1, so i can finally become fully fluent in spanish and 2, to learn what i can to go visit japan! but hey..time flies doesn’t it?",
          "created_utc": 1620013580.0
        },
        {
          "id": "gwqt1f4",
          "author": "chronaloid",
          "body": "That’s really cool! I’ve studied Spanish in the past but am bouncing between Russian and French rn :) good luck in your studies!",
          "created_utc": 1620013813.0
        }
      ]
    },
    {
      "id": "gxwewen",
      "author": "None",
      "body": "It does. Thank you. For the video and your words. Still, what you’re doing is inspiring. I’m so glad to hear you’re getting better.",
      "created_utc": 1620852617.0,
      "score": 1,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        },
        {
          "id": "gxuc92n",
          "author": "None",
          "body": "Anorexia (restrictive) - anorexia (b/p) - bulimia was my progression at 14/15. Your recovery work is so inspiring. I’m struggling with overshoot weight right now and a desire to relapse (romanticization). I’m sorry for all the trouble, but can I ask if you have any advice?",
          "created_utc": 1620820052.0
        },
        {
          "id": "gxv660q",
          "author": "esoterique87",
          "body": "No trouble at all. I'm not personally a recovery coach but I am working with a coach at the moment. I like to come on this forum and try to help others and share some tools/tips that I've learned. I know how difficult recovery can be, especially if you don't have professional help. I can link you to a great video that my coach did about overshoot weight. You can find her video [here](https://www.youtube.com/watch?v=eHhOUivBCMo).\n\nI definitely understand the temptation to go back to your ED and to lose weight. I relapsed last spring after gaining weight and not having the proper tools to help with body image. I went back to restriction which then led me back to bulimia and now I am climbing out of that relapse. Your ED is telling you that your body is the problem but in reality it's your eating disorder that is the problem. A big part of recovery is learning how to talk to yourself and how to accept your body. You don't always have to love it but you can accept it and treat yourself with kindness.\n\nThere is a great tool you can use to help with body image. Imagine a friend or a loved one who is in your position. They are in recovery and now they are struggling with their body image. What would you say to that person? I'm sure it would be something kind, compassionate and supportive right? That is your healthy self. When you are having ED thoughts about your body, try to respond to them in the way you would for another person. Your ED voice doesn't have to dominate your headspace, you have the ability to respond to it and to change the story you are telling yourself. I hope this helps! ❤️",
          "created_utc": 1620834428.0
        }
      ]
    },
    {
      "id": "gx7ngba",
      "author": "plslovemebvck",
      "body": "thank you, i love you <3 i love reading and will totally buy these books once i finish the one i’m reading right now! bless you!",
      "created_utc": 1620343610.0,
      "score": 2,
      "context": [
        {
          "id": "gwublkz",
          "author": "esoterique87",
          "body": "I'm 33 f and I have had an eating disorder since I was 15. It started as anorexia and morphed into anorexia/binge purge subtype and then eventually bulimia. I used to get a lot of unwanted attention around my body as a teenager, mostly stares, comments and unwanted touching. I lost weight because I wanted to feel safer in my body but unfortunately it turned into an ED. My bulimia kicked in hard around 2016 when my sister got married and I lost a lot of friends. I turned to bulimia because I felt so alone and I still really hated myself. I started my recovery four years ago, it's been a very slow process for me. I still struggle with thoughts, urges and behaviors and I am not completely free of them. I'm working with a recovery coach and I'm making good progress. I'm here to help others but also to help myself along the way.",
          "created_utc": 1620083293.0
        },
        {
          "id": "gwybyn7",
          "author": "plslovemebvck",
          "body": "i’m so glad you are in recovery, like genuinely! but i have a question, mainly for myself. How did you take the first step towards help and what did you do?",
          "created_utc": 1620165018.0
        },
        {
          "id": "gx1ma7v",
          "author": "esoterique87",
          "body": "Thank you! I appreciate the support. My very first steps towards recovery were first telling my Mom. Reaching out and telling someone can really get the ball rolling. I also read books and consumed a lot of recovery content on YouTube. I really wanted to be free of bulimia but I couldn't do it on my own, no matter how many books I read or videos I watched. A YouTuber, who I really admired and related to, happened to also be a recovery coach so I reached out to her. I was lucky enough to get a spot and I have been making much better progress than I did on my own. \n\nTaking any steps, no matter how small, is a good thing. It could be reading books or telling someone or finding a therapist/coach, even coming on this forum. No matter what you decide to do, you will never feel 100% ready to recover. There is no perfect time or level of preparedness. You just have to make the decision and start taking steps.\n\nHere are some of the resources I used/currently use in recovery. \n\nBooks: [The Bulimia Help Method](https://www.amazon.com/Bulimia-Help-Method-Revolutionary-Approach-ebook/dp/B00PB7JI5A) by Ali Kerr and Richard Kerr, [8 Keys to Recovery From an Eating Disorder](https://www.amazon.com/Keys-Recovery-Eating-Disorder-Therapeutic/dp/0393706958) by Carolyn Costin\n\nYouTube: [WhatMiaDidNext](https://www.youtube.com/c/WhatMiaDidNext/featured), [Megsy Recovery](https://www.youtube.com/channel/UCey1WBhNthBx0vDy-pHe9uw), [Binge Breakers](https://www.youtube.com/channel/UC9bGHx5Vr96hjaN5oDZlcFA)",
          "created_utc": 1620232915.0
        }
      ]
    },
    {
      "id": "gwyf5fy",
      "author": "plslovemebvck",
      "body": "lmao you’re welcome <3",
      "created_utc": 1620166426.0,
      "score": 1,
      "context": [
        {
          "id": "gwu0p2j",
          "author": "lonellyrabbit",
          "body": "hi! i‘m a 17 year old girl from Germany. I have been bulimic for 3/4 years, kept it a secret until now. only recently I made a quite big change in my life, told my mom about it, went to hospital and now I quit school to recover and have to go to a ed clinic soon. I’m scared what‘s gonna happen now that everyone knows, because it was my tiny little secret that kept me protected and helped me deal w the shit in this world. I don‘t know who I am without it as I spent all my teenage years walking from fridge to toilet and back. But I hope there is a better life ahead. I wish you the best of luck on your recovery journey. ✨",
          "created_utc": 1620078209.0
        },
        {
          "id": "gwyckfd",
          "author": "plslovemebvck",
          "body": "thank you <3 but also, let it happen. be open to the process of recovery, and let them know what you are truly feeling. i believe in you, really, and i promise everything will be okay <3",
          "created_utc": 1620165279.0
        },
        {
          "id": "gwyeuzz",
          "author": "lonellyrabbit",
          "body": "aaah, thank you, means a lot. :] <3",
          "created_utc": 1620166294.0
        }
      ]
    },
    {
      "id": "gwyeuf8",
      "author": "plslovemebvck",
      "body": "this may be weird, but i am stoked!!! send me a pic (if you want, it’s totally okay if not) on insta or snap @Lcwkee   !!!",
      "created_utc": 1620166287.0,
      "score": 2,
      "context": [
        {
          "id": "gwvghoi",
          "author": "sheddinglikeamofo",
          "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
          "created_utc": 1620104872.0
        },
        {
          "id": "gwyb7dl",
          "author": "plslovemebvck",
          "body": "sorry the late reply, but your dog is badass as hell! and also, did you eat the chicken 😏, was it good ?😤",
          "created_utc": 1620164692.0
        },
        {
          "id": "gwycc32",
          "author": "sheddinglikeamofo",
          "body": "Haven’t eaten it yet but I suspect tonight it’ll be dinner",
          "created_utc": 1620165179.0
        }
      ]
    },
    {
      "id": "gwyfyyy",
      "author": "plslovemebvck",
      "body": "i can’t see the last reply for some reason, but yes!!! i kinda love morbid stuff like that, it fascinates the dahmer in me (i promise i’m not a serial killer). but yes, that would be amazing!",
      "created_utc": 1620166793.0,
      "score": 2,
      "context": [
        {
          "id": "gwvghoi",
          "author": "sheddinglikeamofo",
          "body": "28f. I started off with anorexia when I was 14-16. Then switched to bulimia (non purging) then switched to purging. I’ve been in recovery off and on for 5ish years. I’m determined to kick this though.\n\nI work in agriculture. I enjoy reading, gardening, dancing, rollerblading, hiking (just about anything out of doors). I live in a super rural area on the west coast in the u.s. my dog killed a chicken today so I’m plucking it tonight 🙃",
          "created_utc": 1620104872.0
        },
        {
          "id": "gwyb7dl",
          "author": "plslovemebvck",
          "body": "sorry the late reply, but your dog is badass as hell! and also, did you eat the chicken 😏, was it good ?😤",
          "created_utc": 1620164692.0
        },
        {
          "id": "gwycc32",
          "author": "sheddinglikeamofo",
          "body": "Haven’t eaten it yet but I suspect tonight it’ll be dinner",
          "created_utc": 1620165179.0
        }
      ]
    },
    {
      "id": "gx8jovn",
      "author": "plslovemebvck",
      "body": "thank you <3 🥺",
      "created_utc": 1620360832.0,
      "score": 1,
      "context": [
        {
          "id": "gwywvzy",
          "author": "NightWorldPerson",
          "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
          "created_utc": 1620174819.0
        },
        {
          "id": "gx7mnrm",
          "author": "plslovemebvck",
          "body": "lmao thank you. what advice would you give to someone like us. like currently i’m at 102, and before i thought my ideal body was at 109. but now weighing 102, i still feel fat. i remember thinking that once i can see my sternum (109), that, that would mean i’m good, but now i don’t even care about the sternum, but am noticing a decrease in pectoral and leg muscle now. so, what advice would you give?",
          "created_utc": 1620343219.0
        },
        {
          "id": "gx8j2rz",
          "author": "NightWorldPerson",
          "body": "It depends on person to person. If you feel ready or want to get help, I would say to visit your doctor/nurse practitioner and ask for confidentiality and tell them what's going on and that you want to discuss situations for getting mentally and physically better. Even if you have to write it on paper and show it to them, that's okay. \n\nIf you have a family member or a friend, tell them. Ask them to help you through this and step up a schedule/plan that focuses on you gaining back the weight. Like little goals for over long periods of time, and if you miss  or mess it up, it's okay. This is a healing process that takes time. \n\nI know that this subreddit has information and guides on getting better. Maybe that could be your start.\n\nThere's also the national hotline for ED,\n\nhttps://www.nationaleatingdisorders.org/help-support/contact-helpline\n\nIf you want to PM me, I'm always here to talk to. I hope that this is a starting point in recovery for you. I believe in you and I'm proud of you for joining this subreddit!",
          "created_utc": 1620360438.0
        }
      ]
    },
    {
      "id": "gx7m7hb",
      "author": "plslovemebvck",
      "body": "the war is long,  it you’ve won multiple battles already. you will prevail, i know it. you’re resilient and that is so awe inspiring. i believe in you!",
      "created_utc": 1620342997.0,
      "score": 5,
      "context": [
        {
          "id": "gwtb47n",
          "author": "mondaysme",
          "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
          "created_utc": 1620067079.0
        },
        {
          "id": "gwycswl",
          "author": "plslovemebvck",
          "body": "if you’re active and still full of energy, i want to be like you! bc i feel like the exhaustion and fatigue is what gets to us heavily, and that’s what i despise the most :/",
          "created_utc": 1620165382.0
        },
        {
          "id": "gwymm45",
          "author": "mondaysme",
          "body": "Physically, I feel I have been very fortunate. Two children and a grandchild. I still work. My relationship with food sucks. I know I must, but there isn't a lot of joy in eating. Even things I enjoy I will deny myself to eat. I don't like to see others eat or obsess about food. I feel like I've won the war on being actively bulimic, but I don't think I will escape this, ever.",
          "created_utc": 1620169914.0
        }
      ]
    },
    {
      "id": "gwydfta",
      "author": "plslovemebvck",
      "body": "well take control of the train. i know it’s and i may be speaking out my ass bc i’m a hypocrite, but i can always keep you accountable, if you keep me?",
      "created_utc": 1620165662.0,
      "score": 1,
      "context": [
        {
          "id": "gwrkkk7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620036885.0
        },
        {
          "id": "gwrza84",
          "author": "plslovemebvck",
          "body": "if i may ask..what made you want to go back?",
          "created_utc": 1620046206.0
        },
        {
          "id": "gwrzyj2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620046554.0
        }
      ]
    },
    {
      "id": "gwyferi",
      "author": "plslovemebvck",
      "body": "family is the worst..i know... but also, SEND ME A PICTURE OF THE FUCKING WOMBAT (if you want to of course, you don’t have to i promise)!!! my snap or insta is @Lcwkee",
      "created_utc": 1620166541.0,
      "score": 1,
      "context": [
        {
          "id": "gwuuhhi",
          "author": "rigadoontoon",
          "body": "i'm 18(nb) and i've struggled with disordered eating habits since kindergarten. i love my friends, drawing with dip pens, making and listening to music, and my shitty, steadily growing collection of stick and pokes that i use to cope :) i hope ur well and if not, i send love and warmth and hugs your way <3 it's nice to meet u!! :)",
          "created_utc": 1620092394.0
        },
        {
          "id": "gwybg4r",
          "author": "plslovemebvck",
          "body": "WAIT QUESTION(s)!! i’m genuinely curious, what made you develop restricted eating habits that young? and also, DO YOU REPLACE THE NEEDLE AFTER EVERY USE???!??",
          "created_utc": 1620164798.0
        },
        {
          "id": "gwycet3",
          "author": "rigadoontoon",
          "body": "so when we were little, my brothers were always thin and athletic, and my parents praised them a lot, whereas i was average/a little bit chubby and i got yelled at for it. my parents are abusive so i'd get hit/yelled at if i wasted food, ate too much or too little, and i didnt know how to act to please them. that's my guess at least :\\ and YES YES OF COURSE THEYRE ALL STERILE AND NEW I PROMISE !!!!!!! i just did a wombat and a little face on my left leg hehe :>",
          "created_utc": 1620165211.0
        }
      ]
    },
    {
      "id": "gx7n6lr",
      "author": "plslovemebvck",
      "body": "no i think that’s cool as shit, almost in every rpg, like skyrim and fallout, i almost did a melee run. so, i support 100%! and your cat has a beautiful name",
      "created_utc": 1620343476.0,
      "score": 1,
      "context": [
        {
          "id": "gwy78hw",
          "author": "tootegost",
          "body": "New to reddit altogether. I'm 18 and nonbinary, have been having ed for 7 yrs now with varying behaviors. The last two years I've been bulimic. I live with a cat and try to grow vegetables on my balcony. I have many intensive interests but since last fall Dungeons & Dragons has been pretty dominant. Other things are for example language learning, arts and crafts, photographing street art, and music. :) This happens to be my very first text on Reddit, quite suitable for it to be an introduction.",
          "created_utc": 1620162996.0
        },
        {
          "id": "gwyar9y",
          "author": "plslovemebvck",
          "body": "hiii, what’s your cats name and what breed?? and also...what character class do you main in D&D👀? i was always a warlock and was in a D&D club in high school for a bit",
          "created_utc": 1620164498.0
        },
        {
          "id": "gwznvxb",
          "author": "tootegost",
          "body": "My cat's name is Utu, it means something like \"fog, haze, mist\". She isn't any breed but just a basic cat. I like to try and play all classes but I've always preferred (in video games too) all melee classes. So as basic as it may sound I really like playing a fighter.",
          "created_utc": 1620188699.0
        }
      ]
    },
    {
      "id": "gwr5gwt",
      "author": "plslovemebvck",
      "body": "do you have an insta or snap? i feel like that’s safest",
      "created_utc": 1620023222.0,
      "score": 1,
      "context": [
        {
          "id": "gwr2ktg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620020770.0
        },
        {
          "id": "gwr47xt",
          "author": "plslovemebvck",
          "body": "can we talk? is that okay? is there somewhere i can reach you?",
          "created_utc": 1620022142.0
        },
        {
          "id": "gwr5en3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620023165.0
        }
      ]
    },
    {
      "id": "gx7ny2s",
      "author": "plslovemebvck",
      "body": "i honestly can’t wait, i am super excited! once i turned 21, i feel like something within me changed and made me want to better myself. it may be the 7 year saturn cycle 🤔??? i don’t know, but i can’t wait!!!",
      "created_utc": 1620343857.0,
      "score": 1,
      "context": [
        {
          "id": "gwvg02j",
          "author": "None",
          "body": "I'm a 31 yr-old queer cis female who started restricting hard at 14 and was actively bulimic from 15-29. I've been in therapy for my ED and depression/anxiety since then and I'm in an area with ED gurus, so I've been mega fortunate in my treatment experience. I'm 2 years into recovery as of April and 5 years sober in June, and I attribute a lot of the recent growth in my ED recovery to being able to overcome that. Things didn't really start to change until I quit drinking but when they did, they changed A LOT. I still have to work at my ED every day but it's nothing like it used to be, and making good connections with others in recovery helps sooooo much.\n\nI've got a good job but I'm looking for something that I'll like more. Graduating college in a few weeks and starting grad school in the Fall.",
          "created_utc": 1620104528.0
        },
        {
          "id": "gww0thi",
          "author": "plslovemebvck",
          "body": "awwww🥺 i’m so happy you’re moving forward with life. what do you plan on studying in grad school?",
          "created_utc": 1620122453.0
        },
        {
          "id": "gx3pykg",
          "author": "None",
          "body": "Spanish! I'd love to be a translator. \n\nYou've got so many experiences ahead of you and obviously a good heart. I hope that as you continue to grow, you find more of what you need to fill the space that bulimia tries to fill. So much changes between 21 and 31, it's going to surprise and delight you.",
          "created_utc": 1620266542.0
        }
      ]
    },
    {
      "id": "gx7o17i",
      "author": "plslovemebvck",
      "body": "and thank you <3",
      "created_utc": 1620343902.0,
      "score": 1,
      "context": [
        {
          "id": "gwvg02j",
          "author": "None",
          "body": "I'm a 31 yr-old queer cis female who started restricting hard at 14 and was actively bulimic from 15-29. I've been in therapy for my ED and depression/anxiety since then and I'm in an area with ED gurus, so I've been mega fortunate in my treatment experience. I'm 2 years into recovery as of April and 5 years sober in June, and I attribute a lot of the recent growth in my ED recovery to being able to overcome that. Things didn't really start to change until I quit drinking but when they did, they changed A LOT. I still have to work at my ED every day but it's nothing like it used to be, and making good connections with others in recovery helps sooooo much.\n\nI've got a good job but I'm looking for something that I'll like more. Graduating college in a few weeks and starting grad school in the Fall.",
          "created_utc": 1620104528.0
        },
        {
          "id": "gww0thi",
          "author": "plslovemebvck",
          "body": "awwww🥺 i’m so happy you’re moving forward with life. what do you plan on studying in grad school?",
          "created_utc": 1620122453.0
        },
        {
          "id": "gx3pykg",
          "author": "None",
          "body": "Spanish! I'd love to be a translator. \n\nYou've got so many experiences ahead of you and obviously a good heart. I hope that as you continue to grow, you find more of what you need to fill the space that bulimia tries to fill. So much changes between 21 and 31, it's going to surprise and delight you.",
          "created_utc": 1620266542.0
        }
      ]
    },
    {
      "id": "gx8jcao",
      "author": "plslovemebvck",
      "body": "that’s good!!! purging is bad 😤",
      "created_utc": 1620360607.0,
      "score": 1,
      "context": [
        {
          "id": "gx76qkk",
          "author": "None",
          "body": "I'm 20 (f) and have had an ED since 16 but didn't start purging until like 17-18 ish. So yeah I def got my shit together",
          "created_utc": 1620335941.0
        },
        {
          "id": "gx7urze",
          "author": "plslovemebvck",
          "body": "shit together gang 💯...but also..what specifics are the reason you do this? like for me, i think my chest muscles are a little too much, i want the thigh gap, and to keep my abs. wbu..? it’s okay if you don’t want to say, i still love you <3",
          "created_utc": 1620347351.0
        },
        {
          "id": "gx7was2",
          "author": "None",
          "body": "I think I might be in the minority but also let me know if anybody is the same. But my ED didn't stem from self-esteem issues (even though sometimes it does happen). I started to restrict food if I had bad grades or I was awkward during a conversation. Basically, I used it as a punishment and reward system which snowballed. It eventually turned into me not believing that I deserve food, which is where I am now pretty much.  I also purge but that's mostly because my body wants it out of me or I'm really depressed. However, I haven't been able to purge lately because of lockdown. 😢",
          "created_utc": 1620348125.0
        }
      ]
    },
    {
      "id": "h8ewiib",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1628605672.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h85y1c7",
          "author": "speakloudly",
          "body": "I was just reading this and I am a newly recovered bulimic. I am 31f and I have two children. I worry for them as I wish for no one to suffer the way I did. \nHow did you come to know about your daughter's disorder? Did she know about yours? I apologized if I am asking too much it would just be helpful.",
          "created_utc": 1628427475.0
        },
        {
          "id": "h89zzg7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628511003.0
        },
        {
          "id": "h8cqdhk",
          "author": "speakloudly",
          "body": "I read this and cried. I wish so badly that my mom had your mindset when I was your daughter's age. You've been doing everything so right and she must be so blessed to have such an amazing support system. \n\nI reached out because unfortunately my mother was an enabler to my disorder, along with my siblings disorders. We were raised to fear being obese or \"fat\" and we were raised with a fear of being unwanted. Out of the four of us, three of us were diagnosed with eating disorders and depression. My mother would use the disorder against us and mock us with it. \n\n I am by no means trying to create a sob story but I just don't know what a supportive mother would look like. I am the second oldest and my two younger siblings who went to get help would use me as support. And I loved that and I made our bond now very strong. However, they were in their teens and I wasn't their mom, I was their sister so it was different. I'm just worried that j will do something, or say something that will trigger them and that I won't notice. \n\nMy fear inevitably boils down to me not wanting my children to feel how I felt. I don't want them to have a broken relationship with food. I don't want to be like my mother. \n\nReading this really means alot to me and helps more than you know. \n\nI wish your family a life time of happiness.",
          "created_utc": 1628555732.0
        }
      ]
    },
    {
      "id": "h6rfspf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1627425416.0,
      "score": 2,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h4tco9b",
          "author": "wafflerain5",
          "body": "Hey, how did you recover on your own. I've been trying to do that for months but I think I'm just lying to myself, I relapse so often.",
          "created_utc": 1626016416.0
        },
        {
          "id": "h4vk29v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1626055997.0
        },
        {
          "id": "h6raf1g",
          "author": "textbookroadmapnot",
          "body": "It’s not ironic that your daughter started, for godsake, she picked up signals from you. Genetic? you don’t have a clue, Your opinions on this are dangerous.",
          "created_utc": 1627422946.0
        }
      ]
    },
    {
      "id": "gx8ljj7",
      "author": "NightWorldPerson",
      "body": "Of course! 🥰🌻",
      "created_utc": 1620362052.0,
      "score": 1,
      "context": [
        {
          "id": "gwywvzy",
          "author": "NightWorldPerson",
          "body": "I'm 22F and I honestly can't fully remember when it started exactly. I know that it happened after I was 9 because of a traumatic event. I was mostly anorexic and slightly bulimic. I've been well since I was 17 and haven't relapsed since. I recently joined this sub to hopefully help others and be a listener for when people just want to be heard. Thank you for asking us, it's a good question OP.",
          "created_utc": 1620174819.0
        },
        {
          "id": "gx7mnrm",
          "author": "plslovemebvck",
          "body": "lmao thank you. what advice would you give to someone like us. like currently i’m at 102, and before i thought my ideal body was at 109. but now weighing 102, i still feel fat. i remember thinking that once i can see my sternum (109), that, that would mean i’m good, but now i don’t even care about the sternum, but am noticing a decrease in pectoral and leg muscle now. so, what advice would you give?",
          "created_utc": 1620343219.0
        },
        {
          "id": "gx8j2rz",
          "author": "NightWorldPerson",
          "body": "It depends on person to person. If you feel ready or want to get help, I would say to visit your doctor/nurse practitioner and ask for confidentiality and tell them what's going on and that you want to discuss situations for getting mentally and physically better. Even if you have to write it on paper and show it to them, that's okay. \n\nIf you have a family member or a friend, tell them. Ask them to help you through this and step up a schedule/plan that focuses on you gaining back the weight. Like little goals for over long periods of time, and if you miss  or mess it up, it's okay. This is a healing process that takes time. \n\nI know that this subreddit has information and guides on getting better. Maybe that could be your start.\n\nThere's also the national hotline for ED,\n\nhttps://www.nationaleatingdisorders.org/help-support/contact-helpline\n\nIf you want to PM me, I'm always here to talk to. I hope that this is a starting point in recovery for you. I believe in you and I'm proud of you for joining this subreddit!",
          "created_utc": 1620360438.0
        },
        {
          "id": "gx8jovn",
          "author": "plslovemebvck",
          "body": "thank you <3 🥺",
          "created_utc": 1620360832.0
        }
      ]
    },
    {
      "id": "gx7mtvu",
      "author": "mondaysme",
      "body": "Ah, the war is long, indeed. Thank you! It's always a day away, but so far I do feel good about it!",
      "created_utc": 1620343304.0,
      "score": 3,
      "context": [
        {
          "id": "gwtb47n",
          "author": "mondaysme",
          "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
          "created_utc": 1620067079.0
        },
        {
          "id": "gwycswl",
          "author": "plslovemebvck",
          "body": "if you’re active and still full of energy, i want to be like you! bc i feel like the exhaustion and fatigue is what gets to us heavily, and that’s what i despise the most :/",
          "created_utc": 1620165382.0
        },
        {
          "id": "gwymm45",
          "author": "mondaysme",
          "body": "Physically, I feel I have been very fortunate. Two children and a grandchild. I still work. My relationship with food sucks. I know I must, but there isn't a lot of joy in eating. Even things I enjoy I will deny myself to eat. I don't like to see others eat or obsess about food. I feel like I've won the war on being actively bulimic, but I don't think I will escape this, ever.",
          "created_utc": 1620169914.0
        },
        {
          "id": "gx7m7hb",
          "author": "plslovemebvck",
          "body": "the war is long,  it you’ve won multiple battles already. you will prevail, i know it. you’re resilient and that is so awe inspiring. i believe in you!",
          "created_utc": 1620342997.0
        }
      ]
    },
    {
      "id": "gwydj3n",
      "author": "plslovemebvck",
      "body": "i know it’s hard*****",
      "created_utc": 1620165703.0,
      "score": 1,
      "context": [
        {
          "id": "gwrkkk7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620036885.0
        },
        {
          "id": "gwrza84",
          "author": "plslovemebvck",
          "body": "if i may ask..what made you want to go back?",
          "created_utc": 1620046206.0
        },
        {
          "id": "gwrzyj2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620046554.0
        },
        {
          "id": "gwydfta",
          "author": "plslovemebvck",
          "body": "well take control of the train. i know it’s and i may be speaking out my ass bc i’m a hypocrite, but i can always keep you accountable, if you keep me?",
          "created_utc": 1620165662.0
        }
      ]
    },
    {
      "id": "gwylqjx",
      "author": "rigadoontoon",
      "body": "yay!! mine is umbroombroom :) note i literally never use snap pffff but i deleted insta, there is a wombat coming ur way !!!!!",
      "created_utc": 1620169494.0,
      "score": 2,
      "context": [
        {
          "id": "gwuuhhi",
          "author": "rigadoontoon",
          "body": "i'm 18(nb) and i've struggled with disordered eating habits since kindergarten. i love my friends, drawing with dip pens, making and listening to music, and my shitty, steadily growing collection of stick and pokes that i use to cope :) i hope ur well and if not, i send love and warmth and hugs your way <3 it's nice to meet u!! :)",
          "created_utc": 1620092394.0
        },
        {
          "id": "gwybg4r",
          "author": "plslovemebvck",
          "body": "WAIT QUESTION(s)!! i’m genuinely curious, what made you develop restricted eating habits that young? and also, DO YOU REPLACE THE NEEDLE AFTER EVERY USE???!??",
          "created_utc": 1620164798.0
        },
        {
          "id": "gwycet3",
          "author": "rigadoontoon",
          "body": "so when we were little, my brothers were always thin and athletic, and my parents praised them a lot, whereas i was average/a little bit chubby and i got yelled at for it. my parents are abusive so i'd get hit/yelled at if i wasted food, ate too much or too little, and i didnt know how to act to please them. that's my guess at least :\\ and YES YES OF COURSE THEYRE ALL STERILE AND NEW I PROMISE !!!!!!! i just did a wombat and a little face on my left leg hehe :>",
          "created_utc": 1620165211.0
        },
        {
          "id": "gwyferi",
          "author": "plslovemebvck",
          "body": "family is the worst..i know... but also, SEND ME A PICTURE OF THE FUCKING WOMBAT (if you want to of course, you don’t have to i promise)!!! my snap or insta is @Lcwkee",
          "created_utc": 1620166541.0
        }
      ]
    },
    {
      "id": "h8ju31a",
      "author": "speakloudly",
      "body": "Thank you so much.  You don't understand how helpful your words have been. I'm just so worried and I know that's apart of my anxiety that ED has so kindly left me with. \n\nI am still working on my relationship with food, and accepting that recovery doesn't just happen, it's a lifetime process. Reading your story just gives me more assurance that I am really not along.  \n\nI appreciate this so much❤️",
      "created_utc": 1628699235.0,
      "score": 1,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h85y1c7",
          "author": "speakloudly",
          "body": "I was just reading this and I am a newly recovered bulimic. I am 31f and I have two children. I worry for them as I wish for no one to suffer the way I did. \nHow did you come to know about your daughter's disorder? Did she know about yours? I apologized if I am asking too much it would just be helpful.",
          "created_utc": 1628427475.0
        },
        {
          "id": "h89zzg7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628511003.0
        },
        {
          "id": "h8cqdhk",
          "author": "speakloudly",
          "body": "I read this and cried. I wish so badly that my mom had your mindset when I was your daughter's age. You've been doing everything so right and she must be so blessed to have such an amazing support system. \n\nI reached out because unfortunately my mother was an enabler to my disorder, along with my siblings disorders. We were raised to fear being obese or \"fat\" and we were raised with a fear of being unwanted. Out of the four of us, three of us were diagnosed with eating disorders and depression. My mother would use the disorder against us and mock us with it. \n\n I am by no means trying to create a sob story but I just don't know what a supportive mother would look like. I am the second oldest and my two younger siblings who went to get help would use me as support. And I loved that and I made our bond now very strong. However, they were in their teens and I wasn't their mom, I was their sister so it was different. I'm just worried that j will do something, or say something that will trigger them and that I won't notice. \n\nMy fear inevitably boils down to me not wanting my children to feel how I felt. I don't want them to have a broken relationship with food. I don't want to be like my mother. \n\nReading this really means alot to me and helps more than you know. \n\nI wish your family a life time of happiness.",
          "created_utc": 1628555732.0
        },
        {
          "id": "h8ewiib",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628605672.0
        }
      ]
    },
    {
      "id": "h91pav1",
      "author": "s05k14w68",
      "body": "I hope you don’t take that comment ^^^^ seriously.",
      "created_utc": 1629044961.0,
      "score": 2,
      "context": [
        {
          "id": "gwrtmpf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620042983.0
        },
        {
          "id": "h4tco9b",
          "author": "wafflerain5",
          "body": "Hey, how did you recover on your own. I've been trying to do that for months but I think I'm just lying to myself, I relapse so often.",
          "created_utc": 1626016416.0
        },
        {
          "id": "h4vk29v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1626055997.0
        },
        {
          "id": "h6raf1g",
          "author": "textbookroadmapnot",
          "body": "It’s not ironic that your daughter started, for godsake, she picked up signals from you. Genetic? you don’t have a clue, Your opinions on this are dangerous.",
          "created_utc": 1627422946.0
        },
        {
          "id": "h6rfspf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1627425416.0
        }
      ]
    },
    {
      "id": "gx7v359",
      "author": "plslovemebvck",
      "body": "🥺 i’m glad",
      "created_utc": 1620347509.0,
      "score": 2,
      "context": [
        {
          "id": "gwtb47n",
          "author": "mondaysme",
          "body": "I'm 61 and female. I started when I was 16 and quit when I was 25. I've never been able to get past the mindset of weight. I weigh 106 most days and I'm 5 ft 4.",
          "created_utc": 1620067079.0
        },
        {
          "id": "gwycswl",
          "author": "plslovemebvck",
          "body": "if you’re active and still full of energy, i want to be like you! bc i feel like the exhaustion and fatigue is what gets to us heavily, and that’s what i despise the most :/",
          "created_utc": 1620165382.0
        },
        {
          "id": "gwymm45",
          "author": "mondaysme",
          "body": "Physically, I feel I have been very fortunate. Two children and a grandchild. I still work. My relationship with food sucks. I know I must, but there isn't a lot of joy in eating. Even things I enjoy I will deny myself to eat. I don't like to see others eat or obsess about food. I feel like I've won the war on being actively bulimic, but I don't think I will escape this, ever.",
          "created_utc": 1620169914.0
        },
        {
          "id": "gx7m7hb",
          "author": "plslovemebvck",
          "body": "the war is long,  it you’ve won multiple battles already. you will prevail, i know it. you’re resilient and that is so awe inspiring. i believe in you!",
          "created_utc": 1620342997.0
        },
        {
          "id": "gx7mtvu",
          "author": "mondaysme",
          "body": "Ah, the war is long, indeed. Thank you! It's always a day away, but so far I do feel good about it!",
          "created_utc": 1620343304.0
        }
      ]
    }
  ]
}