{
  "id": "n3xb1k",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1620051658.0,
  "title": "Friend invalidating me constantly",
  "selftext": "Here are some of the things she has said:\n\nIf you really wanted to lose weight you’d workout (I have a history of exercise bulimia)\n\nWhy don’t you just starve/ you’d be better off starving. (Noo I’ve never tried that 🙄)\n\nYou need to be independent/have a job like ~moi~ to be bulimic, otherwise you’re just selfish and hurting your parents financially (like I chose this)\n\nBulimics make no sense (duh that’s why it’s a mental disorder. )\n\nYou’re just bored with your life.",
  "url": "https://www.reddit.com/r/bulimia/comments/n3xb1k/friend_invalidating_me_constantly/",
  "score": 84,
  "num_comments": 12,
  "comments": [
    {
      "id": "gwscuto",
      "author": "lunger_sally",
      "body": "\"friend\"? That is not a friend. That's someone who doesn't comprehend bulimia. You'll be better off without this person in your life.",
      "created_utc": 1620052617.0,
      "score": 59,
      "context": []
    },
    {
      "id": "gwsdz40",
      "author": "None",
      "body": "I had a similar thing with a friend of mine\nThey would invalidate my s/h because they did it first and would always say I did it for attention and I glamorised it.\n\nSo I know it's horrible having a friend invalidate your struggles.\n\nBest thing Todo is not speak to them, even better is to cut them off, but I know that can be tough. So I would stop talking to them about your struggles and find better people to help you.\n\nYou are valid, it's tough and difficult. But you are valid for your struggles. And it's okay.",
      "created_utc": 1620053127.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gwtg0or",
      "author": "Even-Pilot266",
      "body": "I had a “friend” like this. Not with bulimia but just about everything else I ever did. My therapist asked me what I had in common with her other than time and I honestly couldn’t think of a damn thing. I haven’t spoken to her in a year and honestly I feel great about it. \n\nAsk yourself if she’s adding value to your life and why you keep her around.",
      "created_utc": 1620069158.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gwstzn4",
      "author": "PhantomOfTheNopera",
      "body": "If you believe it's worth having this person in your life (I'm assuming she's ✨_amazing_✨ apart from this for you to even consider still having her as a friend). Tell her not to talk to you about bulimia until she educates herself on it. Her 'expertise' is a mix of misconceptions, unqualified opinions and compete lack of empathy. If she is not interested in educating herself (by looking up reliable sources) tell her to go ahead and keep her opinions to herself.",
      "created_utc": 1620059928.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gwtm1ty",
      "author": "FayrisDraconis",
      "body": "Maybe she is what's boring you so hard.\nI wouldn't put up with that shit just to keep a \"friend\".",
      "created_utc": 1620071762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwu1fho",
      "author": "None",
      "body": "Just because you have known someone a long time/worked with someone/been to school with someone/grown up together/shared a million amazing experiences together... they are not your friend unless they act like a friend. They are just someone you know well who is being mean to you.",
      "created_utc": 1620078539.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwuapkk",
      "author": "prettyseoul",
      "body": "Tf, out to the streets she goes",
      "created_utc": 1620082869.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwt25ou",
      "author": "nmain88",
      "body": "Friend? No. This sounds like someone who wants to push their insecurities onto you or use you to make themselves feel better. Bulimia or not these are super shitty things to say to anyone and I really hope this person decides to stop being such an asshole. Sorry for the rant I’ve been in this situation before and it’s frustrating that others still have to deal with ppl like this",
      "created_utc": 1620063366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwtq704",
      "author": "SelectBeyond5514",
      "body": "These are not your friends",
      "created_utc": 1620073583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwub65b",
      "author": "Cath1212",
      "body": "Please don’t waste your time with that ‘friend’. You deserve love and care, not that kind of toxic mindset!",
      "created_utc": 1620083089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwvu47x",
      "author": "None",
      "body": "Bulimia is the same as with litterally everything else in the world; it makes no sense if you don´t understand it. But if you are familiar with the underlying psychopathology it makes perfect sense.  \n\n\nYour friend is an ass. Friends are supposed to be supportive when someone has a problem, regardless if they understand it or not.",
      "created_utc": 1620116391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwv5kpp",
      "author": "reddituserjpg",
      "body": "i agree, this person is not a friend.\nfriends don’t make you feel like shit",
      "created_utc": 1620098099.0,
      "score": 3,
      "context": [
        {
          "id": "gwscuto",
          "author": "lunger_sally",
          "body": "\"friend\"? That is not a friend. That's someone who doesn't comprehend bulimia. You'll be better off without this person in your life.",
          "created_utc": 1620052617.0
        }
      ]
    }
  ]
}