{
  "id": "n5wjng",
  "subreddit": "bulimia",
  "author": "onesmallbeast",
  "created_utc": 1620266352.0,
  "title": "Small victory",
  "selftext": "Before my disordered eating habits developed I really loved potatoes, but last year as they became one of my fear foods, I started really hating them (both mentally and taste-wise) which was of course quite sad and distressing.\n\nAnyway I ate a whole potato today with my dinner and didn't get upset! Not a very big one but not a tiny one either. I even really liked the taste again and started to think about how I might incorporate them into more meals.\n\nEdit: Thank you everyone for the kind words, the upvotes, the hugz award, just everything. I'm gonna eat another potato today :)",
  "url": "https://www.reddit.com/r/bulimia/comments/n5wjng/small_victory/",
  "score": 67,
  "num_comments": 5,
  "comments": [
    {
      "id": "gx457qp",
      "author": "reddituserjpg",
      "body": "congrats, i’m seriously proud of you. best of luck on the rest of your recovery <33",
      "created_utc": 1620275085.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gx45bz2",
      "author": "ModandMitton",
      "body": "This is awesome! Eating a fear food is a huge win.",
      "created_utc": 1620275163.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gx5yovh",
      "author": "AnaDion94",
      "body": "Hey congratulations!! \nI looove potatoes, especially fries, but also grew to hate them in the thick of my b/p period. Then in recovery it became a fear food for me too. I’ve been integrating them more and more and really enjoying them again",
      "created_utc": 1620317732.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx5pxu0",
      "author": "mythicaljellyfish",
      "body": "so proud of you love, youre doing so amazing and i wish you the best of luck with recovering:)))))<33",
      "created_utc": 1620314054.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gx7l81s",
      "author": "januaryjay2",
      "body": "Yay!!! Good for you. Congrats :)",
      "created_utc": 1620342515.0,
      "score": 2,
      "context": []
    }
  ]
}