{
  "id": "n7brhk",
  "subreddit": "bulimia",
  "author": "3LeftFeetOK",
  "created_utc": 1620429306.0,
  "title": "I'm just so tired.",
  "selftext": "I'm 45. I've been at this since I was a kid. I've been to treatment multiple times. I've been in therapy most of my life. I've tried all the meds. Nothing ever worked for very long. I've given up and figure this is my life now.\n\nI hate it. I hate what it's done to my body. I hate what it's done to my mental state. I hate what it's done to my finances.\n\nI hate that multiple times a day I find myself leaning over the toilet, wishing I would just die, but yet it happens again and again.\n\nDoes the depression make the bulimia worse or does the bulimia make the depression worse? Which came first? Did one cause the other or did I just luck out in the mental illness lottery?\n\nI just really want to go to sleep and not wake up. I'm tired of all this.",
  "url": "https://www.reddit.com/r/bulimia/comments/n7brhk/im_just_so_tired/",
  "score": 100,
  "num_comments": 24,
  "comments": [
    {
      "id": "gxc9lsx",
      "author": "porchdawg",
      "body": "It's exhausting - I know, I'm in my 60s.  I've tried too - don't give up.  But in the meantime, please take care of yourself.  I think the exhaustion exacerbates the depression.  I have found that replacing electrolytes makes a big difference.  Gatorade could work but I take a powdered mix (gotta watch those calories, right?).",
      "created_utc": 1620436334.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gxbytir",
      "author": "RedVelvet1108",
      "body": "I'm really sorry you have to go through this. I guess most of us here know what it feels like and it's one of the worst emotional states you can experience as a human being. Is there anything that brings you a sense of comfort, joy, relaxation or support? Can you call a friend?",
      "created_utc": 1620430448.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gxcb02v",
      "author": "None",
      "body": "I don't have many answers for you, but I just want you to know I get it. I just turned 50. 50 and I'm still struggling with this! when I turned 40, I swore to myself it wouldn't last til 45, that I would recover. And here I am. Same day, same struggle. I also have tried pretty much everything I know. I have even tried training my service dogs to help me. I hate it too. :( I'm sorry- I wish I knew answers. I get more tired by the year. I do know this, though. In 30 years of being bulimic, I hold onto hope that some day, one day, I'll know how to recover. It's the reason I keep going. Someday, maybe we'll get our answers. We'll never know if we don't keep trying.",
      "created_utc": 1620437122.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gxcd4cc",
      "author": "currypaint",
      "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
      "created_utc": 1620438326.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gxdr7vr",
      "author": "Competitive_Day_901",
      "body": "As long as you are alive don't give up on yourself. Even if every single person that was in your life leaves don't leave yourself behind. I know it's hard, when the weather is nice and you're feeling miserable and you want to spit at the sky. It 's hard and it's tiring but you are still here, you still have so much life in front of you, you haven't even reached half yet you have the power to change Halt of your life why give up now? don't you feel bad for your own person who has suffered so much already? do not end this before you give your own person at least this other half of your life and try your best to make it better.\nWe're here for you and we're proud of you for being so strong until now!",
      "created_utc": 1620477537.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gxduelp",
      "author": "Boosey0910",
      "body": "I'm 53 and I can say honestly that it's only in the past 2 years I've finally feel almost recovered from my ED.  There was so much grief from childhood  and adult trauma(s)  I hadn't processed despite years in therapy.  I kept getting injured (thanks to overexercising) and the self hatred was at an all time high.  A bad sports injury forced me to rest (along with COVID lockdown) and that's when the shit got real.  I couldn't run or starve or purge the pain away.  I finally broke and that's when the healing began.  So I truly believe it's never too late to heal.  Life on the other side of bulimia may be so amazing for you, but you'll never know if you aren't here anymore.   The depression started to lift with the right medication and with proper fueling of my body. You are so worth a happy life free of bingeing.",
      "created_utc": 1620479621.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxeqo87",
      "author": "mmolleur",
      "body": "I gave therapy one last try at your age and it stuck. Looking back, I think being exhausted and knowing anything would be better than keeping on with what I was doing was part of the reason it did (I'm 72 now.) My last therapist specialized in ED and she sent me to an intuitive eating oriented RD, who is the person who basically \"saved\" me. My RD believed so strongly that if I just stopped over and under feeding my body, it would settle at a weight I could be happy with that she convinced me. It was incredibly hard to give up diet culture but my weight did settle. I've been about 15/20 lbs over my \"ideal weight\" for about 25  years but I look like a normal person (you know, not a model or actress or very slim, but no one would say I'm \"fat.\"\n\nBut most importantly it worked because I was willing to try anything, I did what she wanted: I ate all the ice cream and pizza for months till my body believed that I wouldn't put it on another diet or make myself throw up. And somehow, miraculously, the need to binge and purge lifted and then food became something to nourish myself with 3 times a day and I started to be interested in other things. Things I had been interested in during early adolescence, before I went on that first diet. It was like growing up again, finding out what I really wanted and starting to do those things instead of stuffing myself or dieting. \n\nRegarding depression, I can share that I come from a line of depressed women. I think the depression leads to bad self image and that contributes to the tendency to have ED. A few times when I was on Prozac or Paxil bulimia went away but it always came back when I went off because I couldn't handle other side effects. My last therapy was without drugs.\n\nDon't give up on yourself; life can get better. I went to lots of therapy and, looking back, most of the therapists didn't help me because of the chemistry between us. It has to be right. They have to \"get\" you. Keep trying to find the people who can help you fix yourself.",
      "created_utc": 1620496231.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxccj01",
      "author": "back_againx13",
      "body": "I'm 43 and developed an eating disorder (anorexia first, which then morphed into bulimia and stayed there for a decade) when I was 30. I relate to this post so hard, my friend. I've gotten much better about the behaviors, but the thoughts have been almost impossible to drive out.\n\nOver the past month and a half, however, I've made vast improvement after I read the book {\"Bright Line Eating\" by Susan Pierce Thompson.} I detest self help books and their smug, empty cliches, but this book was written by a neuroscientist who backed her theories up with data and it *clicked.* (I tried to have a bot give you a summary of the book, hopefully it worked.) She doesn't talk about calories or anything that triggered me, either. The idea is pretty simple, and it sounded like something I could actually do. And I was so fucking ready.\n\nFor thirteen fucking years, I have **hated** myself every single time I've put a bite of food in my mouth, and I've struggled with the same chicken/egg question about depression and bulimia. But I've been doing this program and those thoughts are much, much more quiet. Now when I make my meals I'm not telling myself what a fat, disgusting pig I am and worried about how I'm going to react after I'm done eating and fighting off urges to self harm and shit. I know my diet is okay, I know why I'm eating the foods I'm eating, and I'm actually able to enjoy eating sometimes.\n\nI've been meaning to make a post about the book here, but I'm always worried about accidentally harming someone with my recommendation. For example, there **are** ways that you could use this program for disordered ends if your commitment to recovery isn't quite there yet. If you care to inbox me, I'd love to talk further with you. It's difficult to find someone in my age group who is affected by this shit, and it sounds like we have some things in common. Feel free to hit me up any time. Just keep putting one foot in front of the other. Sometimes that's what success looks like. Take care.",
      "created_utc": 1620437984.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gxcszlk",
      "author": "gulletgod",
      "body": "I can totally understand the exhaustion, it is incredibly draining livingike this. Do you have a support system (therapist/close friends) that you can reach out to?",
      "created_utc": 1620447823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gxcuoqp",
      "author": "None",
      "body": "bulimia makes the depression worse, when you deprive yourself of nutrients that’s what happens x",
      "created_utc": 1620448975.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gxd5q6t",
      "author": "itsokayryujin",
      "body": "Baby, I trust you can make it. Honestly, we all can 💕",
      "created_utc": 1620458104.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gxbzoft",
      "author": "3LeftFeetOK",
      "body": "The things that used to give me comfort, knitting, crocheting, YouTube, don't interest me as much lately. And I really don't want to talk to anyone in my life. I much prefer my contact with humanity filtered through technology.",
      "created_utc": 1620430897.0,
      "score": 14,
      "context": [
        {
          "id": "gxbytir",
          "author": "RedVelvet1108",
          "body": "I'm really sorry you have to go through this. I guess most of us here know what it feels like and it's one of the worst emotional states you can experience as a human being. Is there anything that brings you a sense of comfort, joy, relaxation or support? Can you call a friend?",
          "created_utc": 1620430448.0
        }
      ]
    },
    {
      "id": "gxceqfk",
      "author": "3LeftFeetOK",
      "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
      "created_utc": 1620439242.0,
      "score": 16,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        }
      ]
    },
    {
      "id": "gxdrf42",
      "author": "Competitive_Day_901",
      "body": "I am glad you at least reach to people through technology and don't isolate yourself. Don't give up, we're here for each other!",
      "created_utc": 1620477673.0,
      "score": 6,
      "context": [
        {
          "id": "gxbytir",
          "author": "RedVelvet1108",
          "body": "I'm really sorry you have to go through this. I guess most of us here know what it feels like and it's one of the worst emotional states you can experience as a human being. Is there anything that brings you a sense of comfort, joy, relaxation or support? Can you call a friend?",
          "created_utc": 1620430448.0
        },
        {
          "id": "gxbzoft",
          "author": "3LeftFeetOK",
          "body": "The things that used to give me comfort, knitting, crocheting, YouTube, don't interest me as much lately. And I really don't want to talk to anyone in my life. I much prefer my contact with humanity filtered through technology.",
          "created_utc": 1620430897.0
        }
      ]
    },
    {
      "id": "gxernjn",
      "author": "mmolleur",
      "body": "Yes, that's classic depressive behavior, right?  Not wanting to see anybody when that's what you need the most. At least you're reaching out here, and hopefully something will click. Some advice from a well wishing stranger.",
      "created_utc": 1620496700.0,
      "score": 4,
      "context": [
        {
          "id": "gxbytir",
          "author": "RedVelvet1108",
          "body": "I'm really sorry you have to go through this. I guess most of us here know what it feels like and it's one of the worst emotional states you can experience as a human being. Is there anything that brings you a sense of comfort, joy, relaxation or support? Can you call a friend?",
          "created_utc": 1620430448.0
        },
        {
          "id": "gxbzoft",
          "author": "3LeftFeetOK",
          "body": "The things that used to give me comfort, knitting, crocheting, YouTube, don't interest me as much lately. And I really don't want to talk to anyone in my life. I much prefer my contact with humanity filtered through technology.",
          "created_utc": 1620430897.0
        }
      ]
    },
    {
      "id": "gxcis7g",
      "author": "currypaint",
      "body": "Since you've been to therapy for so long, I don't know if I can tell you anything you haven't heard before. It's possible that your therapy didn't go deep enough into the childhood trauma. It's also possible that the bulimia is a coping mechanism for thoughts and emotions that are a bit harder to pinpoint. My other thought is that maybe you're struggling with a disorder other than bulimia and depression, and this could be more physical than mental. I don't know. I wish for you to work through this somehow. You've suffered a long, long time and how incredible would it feel to triumph over the illness. Don't be afraid to keep reaching out for help, there are a lot of amazing people out there to hear your story.",
      "created_utc": 1620441509.0,
      "score": 10,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        }
      ]
    },
    {
      "id": "gxdasxb",
      "author": "sylveon-plath",
      "body": "You're being really hard on yourself. You aren't a failure. You are a victim of abuse and have a terrible disorder. Please try to be kinder to yourself. I know it's hard, I do the negative self-talk too, but you don't deserve that. Please take care of yourself.",
      "created_utc": 1620463060.0,
      "score": 8,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        }
      ]
    },
    {
      "id": "gxcwhzp",
      "author": "arigato-cheburashka",
      "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
      "created_utc": 1620450307.0,
      "score": 7,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        }
      ]
    },
    {
      "id": "gxd495b",
      "author": "3LeftFeetOK",
      "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
      "created_utc": 1620456732.0,
      "score": 4,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        }
      ]
    },
    {
      "id": "gxdjukm",
      "author": "victoriousbbyg",
      "body": "DBT?",
      "created_utc": 1620471874.0,
      "score": 3,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        },
        {
          "id": "gxd495b",
          "author": "3LeftFeetOK",
          "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
          "created_utc": 1620456732.0
        }
      ]
    },
    {
      "id": "gxdsofp",
      "author": "3LeftFeetOK",
      "body": "No, EMDR.",
      "created_utc": 1620478520.0,
      "score": 2,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        },
        {
          "id": "gxd495b",
          "author": "3LeftFeetOK",
          "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
          "created_utc": 1620456732.0
        },
        {
          "id": "gxdjukm",
          "author": "victoriousbbyg",
          "body": "DBT?",
          "created_utc": 1620471874.0
        }
      ]
    },
    {
      "id": "gxdz44w",
      "author": "victoriousbbyg",
      "body": "No, I was asking if you had tried DBT as well.",
      "created_utc": 1620482366.0,
      "score": 2,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        },
        {
          "id": "gxd495b",
          "author": "3LeftFeetOK",
          "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
          "created_utc": 1620456732.0
        },
        {
          "id": "gxdjukm",
          "author": "victoriousbbyg",
          "body": "DBT?",
          "created_utc": 1620471874.0
        },
        {
          "id": "gxdsofp",
          "author": "3LeftFeetOK",
          "body": "No, EMDR.",
          "created_utc": 1620478520.0
        }
      ]
    },
    {
      "id": "gxdzjdr",
      "author": "3LeftFeetOK",
      "body": "Yeah. At this point I've tried just about everything except TMS and a lobotomy.",
      "created_utc": 1620482600.0,
      "score": 3,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        },
        {
          "id": "gxd495b",
          "author": "3LeftFeetOK",
          "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
          "created_utc": 1620456732.0
        },
        {
          "id": "gxdjukm",
          "author": "victoriousbbyg",
          "body": "DBT?",
          "created_utc": 1620471874.0
        },
        {
          "id": "gxdsofp",
          "author": "3LeftFeetOK",
          "body": "No, EMDR.",
          "created_utc": 1620478520.0
        },
        {
          "id": "gxdz44w",
          "author": "victoriousbbyg",
          "body": "No, I was asking if you had tried DBT as well.",
          "created_utc": 1620482366.0
        }
      ]
    },
    {
      "id": "gxdzpya",
      "author": "victoriousbbyg",
      "body": "Have you ever found a worker that you really gel with? The rapport is the biggest thing when it comes to outcomes. Someone who’s invalidating you or just doesn’t sit right for whatever reason, they’ll never get the best outcomes.",
      "created_utc": 1620482700.0,
      "score": 3,
      "context": [
        {
          "id": "gxcd4cc",
          "author": "currypaint",
          "body": "How old were you when bulimia started? What was going on in your life at that time, if you feel comfortable sharing?",
          "created_utc": 1620438326.0
        },
        {
          "id": "gxceqfk",
          "author": "3LeftFeetOK",
          "body": "Before I started throwing up as a way to avoid weight gain, I would throw up after holiday meals when I had eaten so much my stomach hurt. The goal then was only to stop feeling so nauseated. I was probably 8 or 9. I learned quickly to be able to tell when the nausea, whatever the cause, was the kind that would go away if I threw up. So even for stomach bugs, if I knew throwing up would make me feel better, I'd make myself vomit. Even now, I absolutely HATE being nauseated. And to be honest, I actually kind of like the feeling of a really good vomit. (I know, I'm weird.)\n\nAs for what was going on in my life? My dad was abusive. I don't think I realized he was abusive until I was in my teens. I'm pretty sure when it's all you know, then it's normal. I'm not trying to use my home life as an excuse, tho. No one held a gun to my head and made me a failure.",
          "created_utc": 1620439242.0
        },
        {
          "id": "gxcwhzp",
          "author": "arigato-cheburashka",
          "body": "Have you tried EMDR therapy yet? It is really helpful for many people who struggle with trauma. It might be worth a shot",
          "created_utc": 1620450307.0
        },
        {
          "id": "gxd495b",
          "author": "3LeftFeetOK",
          "body": "I tried it with a therapist once. I ended up having a panic attack every time we tried.",
          "created_utc": 1620456732.0
        },
        {
          "id": "gxdjukm",
          "author": "victoriousbbyg",
          "body": "DBT?",
          "created_utc": 1620471874.0
        },
        {
          "id": "gxdsofp",
          "author": "3LeftFeetOK",
          "body": "No, EMDR.",
          "created_utc": 1620478520.0
        },
        {
          "id": "gxdz44w",
          "author": "victoriousbbyg",
          "body": "No, I was asking if you had tried DBT as well.",
          "created_utc": 1620482366.0
        },
        {
          "id": "gxdzjdr",
          "author": "3LeftFeetOK",
          "body": "Yeah. At this point I've tried just about everything except TMS and a lobotomy.",
          "created_utc": 1620482600.0
        }
      ]
    }
  ]
}