{
  "id": "na2bzg",
  "subreddit": "bulimia",
  "author": "fenerell",
  "created_utc": 1620753852.0,
  "title": "I just found out when it was too late",
  "selftext": "I have always been able to throw up at will. I had some stomach problems when i was a teen (helicobacter pylori) and that's when i discover that i can just tighten the abdominal muscles and i will just spit the food i just ate. That's what i've been calling that - spitting. \n\nOne depressive epizode later and i noticed that i hate and just can't stand the feeling of full stomach. I needed to 'spit' it, it was no longer a choice, just urging need. Sometimes i went weeks without throwing up, but in times of stress i simply had to get rid of every single thing that i ate. I was having normal meals and all, just throwing up after.\n\nI treated it like some cheating, i could eat a bag of chips and without consequences bc i throw them up right after i'm done, still on my diet and all.\n\nI noticed how throwing up calms me down, how light i feel after, how it helps me loose my weight. I went from 74kg (165 lb) to 62kg (136lb) in 6 months. It was wonderfull. \n\nI never consider myself to have an ED, just thought that i found a way to 'cheat' diet. No restrictions, just weight loss and no more that awfully full stomach feeling.\n\nUntil i started to feel dizzy, i would trip on a flat sidewalk, i had no energy. And i made right connection to throwing up, but not throwing up became impossible. If i ate anything i would feel guilty, i would panic that i'll be fat, it was very self-hatred triggering. It was so bad that i stopped eating at all. \n\nIt was about a month ago when it hitted me: it's bulimia, i'm bulimic. I'm 27, and was having ED since my teens and not realising it until now. I'm terrified. I can't eat, and when i do, i purge bc not purging is causing me so much stress. I know it's killing me slowly, i was convinced that i can just stop when i'll be happy with my look but i can't. \n\nSince i found out i'm freaking out. I can't muster the energy to fight it, because my 'cheat diet' and loosing weight was like the only thing i was proud of, and now it's all corrupted. I can't live like this, but i feel like i won't survive if i gain some weight again..",
  "url": "https://www.reddit.com/r/bulimia/comments/na2bzg/i_just_found_out_when_it_was_too_late/",
  "score": 74,
  "num_comments": 7,
  "comments": [
    {
      "id": "gxrzoys",
      "author": "i-like-empanadas",
      "body": "That’s how it starts, you think “It’s not a problem I only do it sometimes” and then slowly sometimes turns into everyday, to the point when you can’t just brush it off and ignore it anymore.",
      "created_utc": 1620767248.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gxslifo",
      "author": "Boosey0910",
      "body": "Please get some help.  Your ED isn't your friend and it is slowly going to drag your health way down.",
      "created_utc": 1620777353.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gxs890n",
      "author": "AppropriateGiraffe28",
      "body": "Omg yes! I used to call it ‘burping’ I’m still in recovery... pretty sure I have rumination? Still undiagnosed but recovery is beaut!",
      "created_utc": 1620770998.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxs7bq9",
      "author": "Celestialghosty",
      "body": "I feel this, I've never stuck my fingers down my throat type of purged, I can just.... Bring it back up, I think of it as regurgitation, it doesn't taste as bad as puking and I kinda enjoyed it but even though I realise this is disordered behaviour I still struggle to think of myself as a 'bulimic' because in my head it takes a lot of strength to be able to stick your fingers down your throat, and I always think of myself as 'a pussy ass bitch who can't even throw up right' therefore my ED 'isn't real', I've always felt alone in this type of purging and it's less isolating to realise others do it to and my heart goes out to you, I hope you begin to recover and regain strength and things start to look up for you 🥺",
      "created_utc": 1620770580.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gxs56kw",
      "author": "None",
      "body": "You may have Bulimia, but that is not all of what you are. Don't let the bulimia take over every thought and action. Easier said than done, but Ill give you some advice that took me a long, long time to follow. Ask for help. Yup that's the best advice I've ever been given in my life, and its the hardest to follow. Its so easy to tell yourself that you can deal with it, that you don't need people to butt in to your problems. Its easy to be scared and hide what's going on. Its easy to continue to purge and slowly whither away. Yeah its easy to do these things, what's hard is to reach out and get help. Nothing in life that's worth having though comes easily. I get it, you're scared. What you need to do though is ask for help from someone you trust. It can be a friend, SO, parent, doctor, therapist. It doesn't matter, but you need to reach out for help because sometimes we all need help. I honestly always thought that if I went to a doctor or therapist about my bulimia it would be akin to saying I was weak and couldn't fix my own problems. This is laughably wrong. A strong person seeks help when they need it, and it seems to me that from your post this is the time you need help. I know you're a strong person because you have lived with an ED for a decade. No one who is weak can do that. I believe in you, and every person on this sub I'm sure feels the same way. The bottom line is, you believe this disease is out of your control. That is wrong, you are in control, and the next step for your recovery is to find someone who can open up to in person. Its not too late, and it will never be too late until they've planted your ass in the ground. So pick up that phone and call your doctors office, or your therapist or your mom. Call whomever you think will be there for you, because opening up about your bulimia is the second step for your recovery. The first one was recognizing what is going on, and you bravely did that already.",
      "created_utc": 1620769627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxs7sr2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1620770793.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gxsiqa9",
      "author": "TranZeitgeist",
      "body": "That's not a rule, and it's relevant to OP's story.",
      "created_utc": 1620775978.0,
      "score": 1,
      "context": [
        {
          "id": "gxs7sr2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1620770793.0
        }
      ]
    }
  ]
}