{
  "id": "na7odf",
  "subreddit": "bulimia",
  "author": "i-like-empanadas",
  "created_utc": 1620767043.0,
  "title": "Walked to the supermarket at 10 pm and got a full bag of donuts which I was planning to eat on my own tonight",
  "selftext": "On my way back for the first time ever I managed to have enough willpower to throw it in the trash.\nI did eat one and threw it up as soon as I got back. But at least I didn’t have to spend half an hour throwing up the whole bag.",
  "url": "https://www.reddit.com/r/bulimia/comments/na7odf/walked_to_the_supermarket_at_10_pm_and_got_a_full/",
  "score": 126,
  "num_comments": 6,
  "comments": [
    {
      "id": "gxs3mqq",
      "author": "None",
      "body": "Good for you! So much better to throw problematic food away. Not worth the emotional energy.",
      "created_utc": 1620768947.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gxss9y9",
      "author": "None",
      "body": "It can be so hard to stop at the beginning of any binge, but now you've done it! That's a huge step in breaking the b/p cycle. Way to go!",
      "created_utc": 1620780749.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gxsqsfn",
      "author": "OccasionBackground33",
      "body": "Small changes! Small steps! Thanks for sharing your tiny but important victory.",
      "created_utc": 1620780001.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gxsyaxm",
      "author": "Auralinde",
      "body": "I did similarly the other day! I ordered a pizza and felt bad after it came in, so I purged the one slice I had eaten and threw it away. It's not much but small victories are still victories! I'm proud of you!",
      "created_utc": 1620783806.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gxsy4ti",
      "author": "little-pinkie",
      "body": "Awesome job!! Baby steps. Actually that’s a huge step. It’s really hard for me not to do this tonight",
      "created_utc": 1620783720.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gxup8ls",
      "author": "talktoaliens",
      "body": "nice!!\ni took some leftovers out of the fridge the other day, put it in the microwave and just before i turned it on, took it back out and went to the gym instead. granted i ended up bping the leftovers later in the day, but i still count that as a win",
      "created_utc": 1620827105.0,
      "score": 3,
      "context": []
    }
  ]
}