{
  "id": "nb9o2x",
  "subreddit": "bulimia",
  "author": "grootlee",
  "created_utc": 1620885242.0,
  "title": "One month purge free!!!",
  "selftext": "Today marks one month purge free, which I honestly am so relieved and proud to have finally reached this point. HOWEVER, I have also not weighed myself for the past 6 months. I have absolutely no concept of what my body actually looks like to other people because I used the number on the scale to validate/reassure me that I was at an “acceptable” size. Because of this, I basically switched from purging through throwing up to purging through exercise to deal with the anxiety that comes from not knowing, and I don’t know how to stop. Does anyone have any experience with this and how they managed to cut back on the exercise? It’s getting more and more obsessive and I really am trying to give my best at recovery.",
  "url": "https://www.reddit.com/r/bulimia/comments/nb9o2x/one_month_purge_free/",
  "score": 97,
  "num_comments": 12,
  "comments": [
    {
      "id": "gxyild5",
      "author": "luca-nicoletti",
      "body": "Congrats on your puke-free month. Unfortunately, I'm in the same situation (my bulimia actually started with excessive exercise and then moved into puking, now I'm back only at exercises again). Unfortunately there's no easy fix to this, above the mindset of \"fixing\" what you eat more than you should, exercise comes with other benefits which makes your brain more into it, dopamine after a workout being one of them.\n\nThe \"feeling well\" also is hard to discard.\n\nWhat I suggest is to get followed by a personal trainer. They will set up a routine for you and they surely know better how much rest is vital for a good workout routine.\n\nI'd give that a try being you! :)",
      "created_utc": 1620897219.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gxyb2k7",
      "author": "None",
      "body": "Congrats on 1 month purge free. That’s amazing and really inspiring! Can I ask you if you have experienced any differences in your face/glands? Many people get so puffy and swollen in the face \n\nAlso I dont exercise so it’s really hard for me to give out tips",
      "created_utc": 1620890088.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gxycp1z",
      "author": "Anarchy_Beryl",
      "body": "I had to completely cut out exercise for a bit, and focus on being able to eat and accept the food if that makes sense? Like when I stopped purging initially I just started restricting  or getting obsessive w cardio to \"balance\" it out - which is not the play for long term health",
      "created_utc": 1620891573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxyk8yt",
      "author": "enhtie",
      "body": "Congrats!! I’m one week free as of today! We will get through this!",
      "created_utc": 1620898787.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gy04bkt",
      "author": "SoundSecret",
      "body": "hell yea! i don’t know you but i’m so proud! \n\ni’ve struggled with compulsive exercising and still do. \n\nthis is a niche situation personal to me but: i had a pretty bad health scare a few months ago. i couldn’t eat for a while, my body got weak and i was terrified. from that day forward i realized that i take my body for granted, and something inside me completely changed. my body is so sacred to me, and it’s function is much more important than what i looked like. terrified of death, i didn’t think about what my body looked like. i was just praying that it was okay. \n\nthat lesson is one of the most important flashbulb moments in my life. i want to exercise to take care of myself, i want to eat well to nourish my body. \n\nidk if any of that applies to this, but that’s what saved me. i still struggle sometimes, but sometimes taking it from a different perspective can really shift your mindset. i had severe bulimia for a while, along with a bunch of other weird ED habits i’d had since third grade. i’m 18, and it took me that long to realize that my body is a vessel for my consciousness. and that’s where all of my value lies. \n\n(i also did a lot of acid lol).",
      "created_utc": 1620928001.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gy0di8x",
      "author": "Shiroi_momo",
      "body": "Congrats! I’m in the same boat and in 2 days, I’ll reach my one month as well! I also stored away my scale and feel the need to earn a meal though exercising. \n\nI found that my Apple Watch helped me in many ways. I would have a set goal for my “move ring”, and as long as I hit that move goal by the end of the day, I stop. \n\nI also didn’t set the bar too high, but I found a middle ground to make sure I’m still getting in at least 30 minutes of exercise a day for health. It’s also important to note to give yourself 1-2 days of rest without an intensive workout! On those days I take a light walk, do yoga, or super light exercise in comparisons to what I do during the week/non rest days. \n\nLastly, sometimes I like to plan my workouts by the week. By having it written out, I can physically see what my exercise routine might look like and I try to stick to it to not overwork myself!",
      "created_utc": 1620931764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy01hhy",
      "author": "jadeeeeeeeeeeeeeee",
      "body": "mine did the same ! exercise, purge, now back to exercise. sucks man",
      "created_utc": 1620926827.0,
      "score": 2,
      "context": [
        {
          "id": "gxyild5",
          "author": "luca-nicoletti",
          "body": "Congrats on your puke-free month. Unfortunately, I'm in the same situation (my bulimia actually started with excessive exercise and then moved into puking, now I'm back only at exercises again). Unfortunately there's no easy fix to this, above the mindset of \"fixing\" what you eat more than you should, exercise comes with other benefits which makes your brain more into it, dopamine after a workout being one of them.\n\nThe \"feeling well\" also is hard to discard.\n\nWhat I suggest is to get followed by a personal trainer. They will set up a routine for you and they surely know better how much rest is vital for a good workout routine.\n\nI'd give that a try being you! :)",
          "created_utc": 1620897219.0
        }
      ]
    },
    {
      "id": "gxzkli3",
      "author": "grootlee",
      "body": "Thank you!! And tbh I do think my face is noticeably more swollen, but EDs are such a mind fuck that I can’t tell how severe it actually is. 🤷‍♀️",
      "created_utc": 1620919688.0,
      "score": 2,
      "context": [
        {
          "id": "gxyb2k7",
          "author": "None",
          "body": "Congrats on 1 month purge free. That’s amazing and really inspiring! Can I ask you if you have experienced any differences in your face/glands? Many people get so puffy and swollen in the face \n\nAlso I dont exercise so it’s really hard for me to give out tips",
          "created_utc": 1620890088.0
        }
      ]
    },
    {
      "id": "gxzl03r",
      "author": "grootlee",
      "body": "Yes, that’s exactly what I’m doing right now oof. I’m anxious about not purging and it potentially causing weight gain so to offset it I exercise like crazy until I feel like I’m not “in danger” of gaining weight",
      "created_utc": 1620919862.0,
      "score": 3,
      "context": [
        {
          "id": "gxycp1z",
          "author": "Anarchy_Beryl",
          "body": "I had to completely cut out exercise for a bit, and focus on being able to eat and accept the food if that makes sense? Like when I stopped purging initially I just started restricting  or getting obsessive w cardio to \"balance\" it out - which is not the play for long term health",
          "created_utc": 1620891573.0
        }
      ]
    },
    {
      "id": "gxzl971",
      "author": "grootlee",
      "body": "Yes, we definitely will!! The one week mark is such a huge milestone. Keep going strong! You’ll be at one month before you know it. 🥳🎉",
      "created_utc": 1620919970.0,
      "score": 2,
      "context": [
        {
          "id": "gxyk8yt",
          "author": "enhtie",
          "body": "Congrats!! I’m one week free as of today! We will get through this!",
          "created_utc": 1620898787.0
        }
      ]
    },
    {
      "id": "gy0pyvm",
      "author": "None",
      "body": "More swollen after not b/pi’ing?",
      "created_utc": 1620936846.0,
      "score": 1,
      "context": [
        {
          "id": "gxyb2k7",
          "author": "None",
          "body": "Congrats on 1 month purge free. That’s amazing and really inspiring! Can I ask you if you have experienced any differences in your face/glands? Many people get so puffy and swollen in the face \n\nAlso I dont exercise so it’s really hard for me to give out tips",
          "created_utc": 1620890088.0
        },
        {
          "id": "gxzkli3",
          "author": "grootlee",
          "body": "Thank you!! And tbh I do think my face is noticeably more swollen, but EDs are such a mind fuck that I can’t tell how severe it actually is. 🤷‍♀️",
          "created_utc": 1620919688.0
        }
      ]
    }
  ]
}