{
  "id": "nbovix",
  "subreddit": "bulimia",
  "author": "aesperia",
  "created_utc": 1620933567.0,
  "title": "I can only avoid binges by not eating at all and it's killing me",
  "selftext": "TW: Mental health, mention of death. Also English i not my mothertongue, so bear with me.\n\nLet's put this out first: I have a heart condition. I have under in the surgical room, hospitalized many times and in short should definetely not avoid eating. \n\nBut, and here i think I resonate with many here, I hate myself more than I care about my health. When I faint by heart issues, more often than not, people ask me \"Have you been eating well?\". I lie. They offer me sugar. I play my best lies to avoid eating it, even when they are just about to call an ambulance.\n\nOne of my many times in hospital, my mother came to visit. She brought a sweet typical of our country. I ate it all in one day - it was for 8 people. I purged in bathroom. \n\nTwo days before, I had underwent surgery. \n\nThree years have passed since then. I have gained and lost weight as if on a rollercoaster. I was never fat, but dangerously thin, so much that medicines didn't have effect anymore. I attempted suicide three times.  \n\nAs I write this, I am yet again feeling dizzy from either the heart or the lack of calories, in a desperate attempt to lose weight again. In a way I feel good about this, because even on the days I eat plenty, my heart doesn't work properly, so I might as well sacrifice everything to the mythical altar of beauty. Having a chronic illness at such a young age robbed me of my energy and most of my hopes. Having had a mental illness even longer than that simply destroyed me from the get go. \n\nEvery couple of days I go to the supermarket and try so hard to boy something normal, but I know I'll only end up bingeing anyway. Food has become either love or hate for me, no inbetween, just as desperately as I hate myself.",
  "url": "https://www.reddit.com/r/bulimia/comments/nbovix/i_can_only_avoid_binges_by_not_eating_at_all_and/",
  "score": 142,
  "num_comments": 13,
  "comments": [
    {
      "id": "gy118ih",
      "author": "avadamaris",
      "body": "i understand, the switch is either turned to binging, or starving. the in-between sounds so impossible it’s hopeless. i’m sure your heart condition must be complicating things so much more. i’m sorry. i wish i had advice but it would be hypocritical to advise you to do anything.",
      "created_utc": 1620941877.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gy1dls2",
      "author": "Renmeya",
      "body": "Uff this is me as well! I feel like I've eaten so much minute I touch food and then I just end up binging because I know I'll have to purge anyway...",
      "created_utc": 1620948033.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gy11na5",
      "author": "lostinth3Abyss",
      "body": "I struggle with that too",
      "created_utc": 1620942080.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gy1enmp",
      "author": "raesayshi",
      "body": "Hey friend I fee you do you want a Spotify playlist that I made that might help u get through moments that sucks ass?",
      "created_utc": 1620948573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy1nljs",
      "author": "chanajacobs",
      "body": "I’m so sorry about this :( \nTry and find some things you enjoy doing in life and things that make you happy ❤️ life is very short so just try to enjoy it if you can",
      "created_utc": 1620953224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy0v356",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1620938997.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gy3gm7q",
      "author": "kal_3",
      "body": "Have you tried therapy? Eating disorders are more than just food obsessions, it is a diagnosed disease. Much like your heart has required professional medical intervention, so does the mind. Your suicide attempts and control issues with food, in addition to dealing with a chronic heart issue, all play into mental disease, which in turn into physical disease. There are plenty of support groups and affordable, accessible therapy options. Some therapy options include video chat or even texting sessions. This is a battle that you need an army for, and that includes medical professionals and others who can support you. Please seek help, you’re young and there is so much to live for and enjoy in life.",
      "created_utc": 1620997976.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy3s4t1",
      "author": "esoterique87",
      "body": "I'm so sorry you're struggling, I definitely understand how you feel about food. Bulimia is very all or nothing, you're either restricting or you're binging and purging. I understand how hopeless you can feel and you wonder if you will ever be able to have a better relationship with food. I have a couple of suggestions that may help. \n\nIf you have access to professional help, please seek it out. I say this to everyone in this forum because it is so important. I was in the same spot as you and I felt completely hopeless, now I have a coach and I have made amazing progress in my recovery. Professional help can provide you with the tools you need to combat this illness. You don't have to fight this alone, and it is so much easier when you have guidance.\n\nIf professional help isn't an option, do you have anyone who can sit with you while you eat? I was really struggling with eating normally too and now I have my Mom sit with me at most meals so I don't binge and purge. It can really help to have someone who is aware of your ED and who can sit with you for 60-90 minutes after a meal. If you don't have someone who can sit with you, is there someone you can call or reach out to? Connection is so important in recovery and having people who can support us goes such a long way. Most of us binge and purge in private so if we can reach out to people, it can prevent you from engaging in those behaviors.\n\nIf you don't have someone to reach out to, there is an amazing tool where you dialogue between your ED voice and your healthy voice. Write down the things your ED is telling you and respond to them. Your eating disorder does not have the final say, you can talk back to it and this really impacts your actions. If you start to keep track of the things your ED is saying, you can start to recognize its patterns, thoughts and beliefs and begin to challenge them. Here are a few examples;\n\n**ED Thought**: I'm just going to binge and purge this food anyways, I might as well buy all my binge foods. \n\n**Healthy Self**: I don't have to binge and purge, and my eating disorder cannot predict the future. I am going to buy food with the intention of not binging and purging.\n\n**ED Thought**: Even when I am at a healthy weight I will be miserable, so I might as well be thin and miserable than fat and miserable. \n\n**Healthy Self**: You can't predict how you will feel at a healthy weight because you have never been there long enough. All you know for sure is that you are absolutely miserable and alone when you are sickly thin. This is a known fact, whereas you don't know how you will feel if you gain weight and become healthy.\n\nIf you are buying food at the store and your ED is already telling you that you're going to binge and purge, it will most likely happen. If you talk back to it and reframe your intentions around the food, your actions are more likely to shift. You have a lot more power than you realize and your eating disorder does not get to have the final say. If you are having trouble getting in touch with your healthy voice, imagine what you would say to someone else. \n\nI hope some of this was helpful and I promise you that there is hope. I'm sending lots of support and love your way ❤️",
      "created_utc": 1621003272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy1b8zp",
      "author": "aesperia",
      "body": "Your taking the time alone the write is encouraging. Thank you",
      "created_utc": 1620946832.0,
      "score": 5,
      "context": [
        {
          "id": "gy118ih",
          "author": "avadamaris",
          "body": "i understand, the switch is either turned to binging, or starving. the in-between sounds so impossible it’s hopeless. i’m sure your heart condition must be complicating things so much more. i’m sorry. i wish i had advice but it would be hypocritical to advise you to do anything.",
          "created_utc": 1620941877.0
        }
      ]
    },
    {
      "id": "gy4ypy6",
      "author": "ashleylynae7",
      "body": "I do!",
      "created_utc": 1621021658.0,
      "score": 1,
      "context": [
        {
          "id": "gy1enmp",
          "author": "raesayshi",
          "body": "Hey friend I fee you do you want a Spotify playlist that I made that might help u get through moments that sucks ass?",
          "created_utc": 1620948573.0
        }
      ]
    },
    {
      "id": "gy33dm4",
      "author": "aesperia",
      "body": "Thank you :) I do what I can",
      "created_utc": 1620990014.0,
      "score": 2,
      "context": [
        {
          "id": "gy1nljs",
          "author": "chanajacobs",
          "body": "I’m so sorry about this :( \nTry and find some things you enjoy doing in life and things that make you happy ❤️ life is very short so just try to enjoy it if you can",
          "created_utc": 1620953224.0
        }
      ]
    },
    {
      "id": "gy1b4ne",
      "author": "aesperia",
      "body": "Many arrhythmias and bradycardia, but the cause is uncertain as they are way too many for my age. They cannot find a definitive solution for it.",
      "created_utc": 1620946770.0,
      "score": 4,
      "context": [
        {
          "id": "gy0v356",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1620938997.0
        }
      ]
    },
    {
      "id": "gy3kzrr",
      "author": "aesperia",
      "body": "I was in therapy for over ten years, but for depression. The ed is something I developed relatively recently, also I imagine due to the stress of the heart condition and chronic illness. Unfortunately, there was never the space for it to be a priority. I know it's horrible and I really feel bad for it. I am not even in therapy now because I quite literally had to flee my home to escape a very toxic family situation, following my last suicide attempt six months ago. I knew that if I didn't make a run for it, I would surely try again. \n\nAs now I am abroad, I cannot easily see a cardiologist not a psychiatrist, but I am trying to arrange it. Pandemic makes it harder, but I am doing what I can.",
      "created_utc": 1621000093.0,
      "score": 1,
      "context": [
        {
          "id": "gy3gm7q",
          "author": "kal_3",
          "body": "Have you tried therapy? Eating disorders are more than just food obsessions, it is a diagnosed disease. Much like your heart has required professional medical intervention, so does the mind. Your suicide attempts and control issues with food, in addition to dealing with a chronic heart issue, all play into mental disease, which in turn into physical disease. There are plenty of support groups and affordable, accessible therapy options. Some therapy options include video chat or even texting sessions. This is a battle that you need an army for, and that includes medical professionals and others who can support you. Please seek help, you’re young and there is so much to live for and enjoy in life.",
          "created_utc": 1620997976.0
        }
      ]
    },
    {
      "id": "gy8dmff",
      "author": "raesayshi",
      "body": "[playlist by me may 2021](https://open.spotify.com/playlist/3j6sjcJa0158b98xjzrLyt?si=ueKPRaLOS0qwDHNh-5xweQ)",
      "created_utc": 1621098147.0,
      "score": 1,
      "context": [
        {
          "id": "gy1enmp",
          "author": "raesayshi",
          "body": "Hey friend I fee you do you want a Spotify playlist that I made that might help u get through moments that sucks ass?",
          "created_utc": 1620948573.0
        },
        {
          "id": "gy4ypy6",
          "author": "ashleylynae7",
          "body": "I do!",
          "created_utc": 1621021658.0
        }
      ]
    }
  ]
}