{
  "id": "niilde",
  "subreddit": "bulimia",
  "author": "haunted_moose111",
  "created_utc": 1621689938.0,
  "title": "Extremely warped body image",
  "selftext": "I’m a 17 year old male and have been bulimic for 4 years now. I feel fine looking at myself before I’ve eaten but whenever I eat food I see myself in an entirely different way and just think I’m disgusting. My body seems to actually warp in my own eyes and I really don’t know what to do.",
  "url": "https://www.reddit.com/r/bulimia/comments/niilde/extremely_warped_body_image/",
  "score": 68,
  "num_comments": 5,
  "comments": [
    {
      "id": "gz235m1",
      "author": "AnxietyOk5407",
      "body": "i feel the same way i’m 17F … it’s like i’ll be perfectly fine before eating and as soon as i do my mind sees a whole different person that looks completely different it’s like i don’t recognize myself. it also doesn’t help that i can’t live without constant body checking every single chance that i get. i hope things get better, just know you aren’t alone ):",
      "created_utc": 1621693259.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gz2jekv",
      "author": "dizzyandsid",
      "body": "I call this crazy eyes. No matter how much my weight / size fluctuates, I always see a fat, lumpy person when I look in the mirror. Logically I know I’m on the small side and fairly muscular, but all my crazy eyes see is a big disgusting failure. It feels awful. \nDoes anyone know about your bulimia? Could you tell your parents, or a school counselor, or your primary care doctor? If you could get into a therapy situation, they would have some suggestions for how to feel better. \nI’m sorry you’re dealing with this. I hope you find some peace.",
      "created_utc": 1621701727.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gz211vv",
      "author": "dolefulAlchemist",
      "body": "sounds like body dysmorphia :(",
      "created_utc": 1621692133.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gz2atv0",
      "author": "esoterique87",
      "body": "This sounds like body dysmorphia which is very common in those with eating disorders. You can help yourself if you start reducing body checking behaviors. If you are aware that checking your body after eating triggers your eating disorder then try to avoid doing that. Especially avoid checking your stomach because yes, it will look bigger after you've eaten. It doesn't mean you are disgusting, it just means your stomach has food in it. I used to body check first thing in the morning and that would determine how the rest of my day was going to go. I found that once I stopped doing that, my eating disorder stopped showing up in the morning. \n\nAnother great tool you can use are dialogues between your ED self and your Healthy self. We all have an ED self and it usually is abusive, negative, critical and cruel. We also have a Healthy Self that we are all born with and it usually shows up for other people. Whenever you have an ED thought about your body, write it down and respond to it. It helps to imagine what you would say to a loved one if they were having negative thoughts about their body. For example:\n\nEd Thought: Eating food makes me look disgusting\n\nHealthy Self: You do not look disgusting, nothing has changed about your body just because you have eaten. Your body image cannot be trusted because it is warped. You deserve to eat and to treat yourself with kindness.\n\nThis is a very powerful tool that will help you identify what your eating disorder sounds like and what it's messages and beliefs are. Your eating disorder is going to keep telling you that your body is disgusting so that you will keep relying on it. Every time you challenge your ED, you weaken it. I hope this made sense and I'm sending lots of support your way. ❤️",
      "created_utc": 1621697334.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gz2rl71",
      "author": "Far-Eggplant-4929",
      "body": "Claraandherself on tiktok has helped me so much with this",
      "created_utc": 1621705716.0,
      "score": 1,
      "context": []
    }
  ]
}