{
  "id": "nruy8z",
  "subreddit": "bulimia",
  "author": "selkiex",
  "created_utc": 1622775416.0,
  "title": "I know it’s not a lot, but I haven’t purged in 2 days",
  "selftext": "For the past 4 years I’ve been purging 5-10 times a day and for a few months I’ve been weening down to 1-2x a day, and now I’ve made it to 2 whole days without purging. I’m so proud but also terrified. I’m only making this post because I want to hold myself accountable for awhile so I don’t purge every again if I can help it. I want to stop. I want to do better.",
  "url": "https://www.reddit.com/r/bulimia/comments/nruy8z/i_know_its_not_a_lot_but_i_havent_purged_in_2_days/",
  "score": 179,
  "num_comments": 21,
  "comments": [
    {
      "id": "h0iu0ym",
      "author": "Deformographyx",
      "body": "Congratulations! It’s a step forward even if it’s scary one. 2 days is a big feat. It’s always one step at a time and now you’re at 2 days! Take it one breath at a time because sometimes it’s scary but you’re doing this and that’s all that matters. I’m a message away if you need someone 💛",
      "created_utc": 1622776189.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h0jegop",
      "author": "Losingmymind_7",
      "body": "That’s amazing! It might not sound like much to someone who doesn’t get it but you know the effort it took to get to this point, you know it’s a much bigger achievement! \nYou should be very proud of yourself and I hope this is just the start of a healthier and happier future for you 💕",
      "created_utc": 1622788603.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h0jymsx",
      "author": "clumsycouture",
      "body": "That so amazing! I’m so proud of you! And next thing you know it will be 2 weeks, then 2 months, then 2 years! Next thing you know you’re going on ten years Bulimia free!!! As someone who thought “what’s the point I’ll never be able to have a normal, healthy relationship with food” I can say you will! And your thoughts are lying to you! I was Bulimic and Anorexic for 5 years and I’ve now been in recovery for almost ten years now. The last time I purged was over 9 years ago!\n\n\nI decided one day I was tired of lying, and the sore throats and ditching my friends all the time. I was so tired of being constipated and bloated. I’m not saying it’s easy but every day gets easier! I had Bulimia and Anorexia and over the pandemic I got to the biggest I’ve ever been as an adult, but decided I wasn’t going to fall into bad patterns I had all but thought was done and dealt with.  I was a chubby teenager and decided Bulimia would be a good diet, please if you’re reading this and are thinking about purging for a couple days and you’ll quit… don’t do it. It’s a disease and lasts a lifetime. Recovery is the best thing I’ve ever decided to do for myself! Good for you and take it one day at a time. Remember tomorrow’s a new day don’t beat yourself up too much.",
      "created_utc": 1622805533.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h0j4ulw",
      "author": "dizzyandsid",
      "body": "Yeah!!!! That’s freaking great! Not just the two days, but reducing the amount of purges, too. If you purge again, don’t beat yourself up. Recovery isn’t always linear. What I’ve been doing is drawing a little heart in my planner on the days I don’t do behaviors. That way, if I relapse, I can go back and look at the hearts and see how much better I’m doing in general. It’s goofy, but it helps. I’m proud of you. Keep doing the best you can.",
      "created_utc": 1622782190.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h0k7ym0",
      "author": "MonsterMamaLu",
      "body": "Wrong. That IS a lot!!!  One day at a time, celebrate every baby step and little victory.  Don’t let setbacks give you an “all or nothing” mentality.  I preferred not to count the days in a row I went b/p free, but how many days out of the week/month I did.  Sometimes I think taking the AA type mentality of gaining certain day “chips” can be counterproductive - just because you have a slip up doesn’t negate the progress you’ve made.  I know how hard it is to overcome the beast of bulimia, I’m proud of you.",
      "created_utc": 1622810937.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0jh8l9",
      "author": "iforgotmyedaccount",
      "body": "Congratulations!",
      "created_utc": 1622790839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0jkc0b",
      "author": "ChoicesPlayer",
      "body": "no no it IS a lot ! stopping yourself from purging everyday, breaking the cycle, is so hard and takes so much energy, strengh and resolve. I'm so proud of you ! Congrats <3",
      "created_utc": 1622793467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0jtrna",
      "author": "Lost-Inflation-480",
      "body": "I'm soo proud of you☺☺☺💓",
      "created_utc": 1622801784.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0k1qdm",
      "author": "aytlolcan",
      "body": "CONGRATULATION! That’s really great, so so so proud of you 👏🏻",
      "created_utc": 1622807513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0ki4qc",
      "author": "monalisahan",
      "body": "I’m so proud of you!!! Please remember that recovery isn’t linear, so if you have a lapse, just forgive yourself and start the next day fresh. You’ve got this, and we are all here for you <3",
      "created_utc": 1622815873.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0kmdzi",
      "author": "None",
      "body": "proud of u !!",
      "created_utc": 1622817781.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0kqp6o",
      "author": "rrrachel_rocks",
      "body": "Way to go!! This IS a big deal! So proud of you! 💜💜",
      "created_utc": 1622819639.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0ktnce",
      "author": "enhtie",
      "body": "Congratulations and good job!! The progress that you’ve made is honestly amazing and I wish you the best of luck on your journey <3.",
      "created_utc": 1622820906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0l66hu",
      "author": "egglesswench",
      "body": "Don't undermine this victory! This is the start of something great. 2 days will turn into 2 weeks etc. Just remember.. if you slip up it doesn't change anything. You still made it x days/weeks/months. It does not negate your progress. One day at a time",
      "created_utc": 1622826314.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0melf1",
      "author": "shuffy94",
      "body": "Hell yeah! I used to refuse to celebrate any victories because it didn't mean \"much\". I went over a year without purging, ignoring my success until I relapsed. I was expecting to just completely die at my \"lost\" progress, but it took that to realize each day was a milestone in itself because it's such a hard battle to fight everyday.\n\n Keep your head high, even in your personal lows because you're fighting something really shitty that doesn't play fair. Lots of love!",
      "created_utc": 1622845856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0j7tim",
      "author": "cardamom89",
      "body": "2 days is incredible! And that you had reduced the frequency of purging is a huge achievement too - well done you <3\n\nIf it helps to know that you aren't alone - I actually saw your post because I was opening this sub to write an almost-identical one myself - 4 years of 5+ daily purges, and now on a couple of days purge-free. Came here to post to try and distract myself from the urge to purge after lunch, and because noone else would understand just how big a deal 2 days is.\n\nRecovery is hard but it's going to be worth it x (right..?)",
      "created_utc": 1622783989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2eqrbt",
      "author": "catxcat310",
      "body": "Great job!",
      "created_utc": 1624176935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0j9sz4",
      "author": "selkiex",
      "body": "Thank you so much for the encouragement. I’m really going to try this time!",
      "created_utc": 1622785224.0,
      "score": 5,
      "context": [
        {
          "id": "h0iu0ym",
          "author": "Deformographyx",
          "body": "Congratulations! It’s a step forward even if it’s scary one. 2 days is a big feat. It’s always one step at a time and now you’re at 2 days! Take it one breath at a time because sometimes it’s scary but you’re doing this and that’s all that matters. I’m a message away if you need someone 💛",
          "created_utc": 1622776189.0
        }
      ]
    },
    {
      "id": "h0j9vtr",
      "author": "selkiex",
      "body": "I’m so glad you have such a great system. I’m still learning how to recover and I know it’s not going to be perfect but I’m doing my best and that’s enough. Thank you so much",
      "created_utc": 1622785278.0,
      "score": 6,
      "context": [
        {
          "id": "h0j4ulw",
          "author": "dizzyandsid",
          "body": "Yeah!!!! That’s freaking great! Not just the two days, but reducing the amount of purges, too. If you purge again, don’t beat yourself up. Recovery isn’t always linear. What I’ve been doing is drawing a little heart in my planner on the days I don’t do behaviors. That way, if I relapse, I can go back and look at the hearts and see how much better I’m doing in general. It’s goofy, but it helps. I’m proud of you. Keep doing the best you can.",
          "created_utc": 1622782190.0
        }
      ]
    },
    {
      "id": "h0khqcb",
      "author": "monalisahan",
      "body": "I used to do this too!! It’s a great system",
      "created_utc": 1622815692.0,
      "score": 2,
      "context": [
        {
          "id": "h0j4ulw",
          "author": "dizzyandsid",
          "body": "Yeah!!!! That’s freaking great! Not just the two days, but reducing the amount of purges, too. If you purge again, don’t beat yourself up. Recovery isn’t always linear. What I’ve been doing is drawing a little heart in my planner on the days I don’t do behaviors. That way, if I relapse, I can go back and look at the hearts and see how much better I’m doing in general. It’s goofy, but it helps. I’m proud of you. Keep doing the best you can.",
          "created_utc": 1622782190.0
        }
      ]
    },
    {
      "id": "h0j9rm9",
      "author": "selkiex",
      "body": "I think it will be worth it. We just gotta keep trying to do our best and it’ll hopefully get better. I’m also proud of you for not purging in a few days— I really do understand how hard it has been",
      "created_utc": 1622785199.0,
      "score": 1,
      "context": [
        {
          "id": "h0j7tim",
          "author": "cardamom89",
          "body": "2 days is incredible! And that you had reduced the frequency of purging is a huge achievement too - well done you <3\n\nIf it helps to know that you aren't alone - I actually saw your post because I was opening this sub to write an almost-identical one myself - 4 years of 5+ daily purges, and now on a couple of days purge-free. Came here to post to try and distract myself from the urge to purge after lunch, and because noone else would understand just how big a deal 2 days is.\n\nRecovery is hard but it's going to be worth it x (right..?)",
          "created_utc": 1622783989.0
        }
      ]
    }
  ]
}