{
  "id": "nuj0o5",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1623088888.0,
  "title": "seeing myself on camera is painful",
  "selftext": "facetiming, friends taking pictures and videos. i cannot stand to look. when im not on video i can forget about how much weight ive gained and how ugly i look but on camera i just look awful and im 3x the size of all my friends.\n\nits a massive trigger. \n\ni dont know how to deal with that. that im actually bigger than i think i am. that i only think about dieting once i see myself on camera and realise that. im so tired of being fat",
  "url": "https://www.reddit.com/r/bulimia/comments/nuj0o5/seeing_myself_on_camera_is_painful/",
  "score": 117,
  "num_comments": 9,
  "comments": [
    {
      "id": "h0xx2ck",
      "author": "carlyilanar",
      "body": "Literally could have written this myself",
      "created_utc": 1623092391.0,
      "score": 21,
      "context": []
    },
    {
      "id": "h0y31c9",
      "author": "mulberryvixen",
      "body": "Yes 1millionx \n\nSorry I don't have any advice but you're not alone x",
      "created_utc": 1623094928.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h0z3psv",
      "author": "rileyyj001",
      "body": "I literally will not FaceTime or Zoom. Front-facing cameras are the devils’ work and should be outlawed.",
      "created_utc": 1623111743.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h0yamyr",
      "author": "schoolgrlvamp666",
      "body": "the worst part is when people don’t understand",
      "created_utc": 1623098140.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h0ybib5",
      "author": "bomboleobombolea",
      "body": "Yeah its like oh wait this is how I look? My work is making videos and a lot of times the people who see themselves on video react weirdly. No one is comfortable with seeing themself on camera even those that are comfortable in their skin/ body size.",
      "created_utc": 1623098516.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0ym7wz",
      "author": "mr_clean5432",
      "body": "Yuppp this is the exact reason I didn’t take pics on vacation 😞",
      "created_utc": 1623103277.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0zxpvf",
      "author": "MelodicProfile2679",
      "body": "My friend wanted to put together a happy birthday video with clips of friends saying happy bday for someone .  I must have tried to record it over 15 times with different lighting and angles. Nothing worked . I became more and more discouraged every time I watched each video. I tried to cover my chin, or parts of my face with my hair or clothes. I couldn’t stand seeing my chin and nose and it disgusted me. I couldn’t bare watching myself and was in tears by the end. I eventually replaced myself with a turtle puppet . \nI’m no help. I’m sorry. I understand your pain though.",
      "created_utc": 1623128016.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0zrr1b",
      "author": "joesprocket16",
      "body": "Same",
      "created_utc": 1623124272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h13b65m",
      "author": "rainydase",
      "body": "a friend of mine who is a photographer keeps asking me to take engagement photos with my fiancé but I keep putting it off because I can’t bare to see myself in photos that I don’t take myself if that makes any sense",
      "created_utc": 1623196328.0,
      "score": 1,
      "context": []
    }
  ]
}