{
  "id": "nzh888",
  "subreddit": "bulimia",
  "author": "glitterhours",
  "created_utc": 1623655508.0,
  "title": "i am the biggest clown on earth: an autobiography",
  "selftext": "almost every single night for just about 6 months straight i have binged and purged. every single night i tell myself “i’ll never do it again.” and then, without fail, the next evening, i am making direct eye contact with my toilet bowl as my insides twist with shame. i want to break this cycle so badly but it’s like bulimia has dug its nasty little claws back into my brain all over again, and this time, i can’t get rid of it!!!!!\n\nthis disease is sickening and has taken away every shred of dignity i had left. there is nothing more degrading than sobbing, naked on your bathroom floor, surrounded by puddles of vomit and saliva and half empty packages of cakes and cookies.\n\nit is so humiliating to walk through my local grocery store carrying bags of sweets, knowing that i am going to go sulk in my car and consume every last morsel just so i can heave it back up. \n\nevery single day i tell myself it will be different but it is never different. every single day is just a repeat of yesterday’s shame.",
  "url": "https://www.reddit.com/r/bulimia/comments/nzh888/i_am_the_biggest_clown_on_earth_an_autobiography/",
  "score": 84,
  "num_comments": 12,
  "comments": [
    {
      "id": "h1pphu8",
      "author": "napolionnappe",
      "body": "My tip is to search for professional help ♥️ it helped me and it could assist in your recovery too",
      "created_utc": 1623663452.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h1pu8b3",
      "author": "AllOkJumpmaster",
      "body": "I was once you, there is hope, you can get better and beat the demon.",
      "created_utc": 1623667822.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1q1q5w",
      "author": "rrrachel_rocks",
      "body": "I was there as well. Take it one day-one hour, even-at a time. Break the cycle. Even if it’s one day. Even if it’s one purge less than normal. Hang in there 💜",
      "created_utc": 1623673391.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1qkuam",
      "author": "Organic_Goat",
      "body": "Hi, I think it is super brave of you to make this post. I feel like a lot of times eating disorders are romanticized and portrayed as a delicate dainty thing when in reality they're shitty and ruin everything. Your post shows the raw truth about bulimia and I really think that your post would be eye opening to people that do not understand the bulimia mindset.",
      "created_utc": 1623683411.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1qt0qr",
      "author": "Summer_lovin25",
      "body": "This is my life,",
      "created_utc": 1623687129.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1q2zxu",
      "author": "sapnu_puas_owo",
      "body": "I relate to this so much lol",
      "created_utc": 1623674203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1qnuon",
      "author": "None",
      "body": "I don't say this to be rude, but if what you are doing isn't working, why keep doing? You have proven to yourself over and over that simply deciding \"never again\" doesn't work. So do something different. Get actual help, study CBT, check in to a facility, anything you haven't tried. Don't keep doing the same thing and hope for a different result.\n\nWishing you all the best and I hope you can get some qualified help, you are worth it.",
      "created_utc": 1623684791.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h1r29zl",
      "author": "BrigittaBanana",
      "body": "I was in a relentless cycle pretty much the same and I would do anything to get out of it, even temporarily. I went to a doctor and they gave me topamax...it worked but only temporarily. But it helped get me to stop and so when the urges did finally come back they were a bit easier to fight. Talk to a doctor about that medication. I was suicidal from b/p so they gave it to me. It does cause brain fog tho pretty bad. Maybe do some research but if it's really this bad it might be worth it",
      "created_utc": 1623691196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1rgkrg",
      "author": "terrrruuu",
      "body": "I feel this in my soul and I can't stop..",
      "created_utc": 1623697640.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1s7a0m",
      "author": "esoterique87",
      "body": "I have been there and it is a horrible place. The shame, the self loathing, the pain both mental and physical. I used to not be able to go a day without binging and purging multiple times a day. It's much different for me now and it is possible to recover. Please seek help because you are much more likely to break the cycle with the guidance of a professional. I know it seems impossible and that you will never escape the cycle of bulimia. I promise you, if you are willing to make a change, you will be amazed at what you are capable of. Sending you lots of love and support ❤️",
      "created_utc": 1623709643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1rs13k",
      "author": "acoh97",
      "body": "She ends up doing the same things (ie. b/p), but that doesn't mean the methods she tries to stop it from happening aren't different. Sometimes this disease is so vicious that every method to thwart it fails.",
      "created_utc": 1623702837.0,
      "score": 2,
      "context": [
        {
          "id": "h1qnuon",
          "author": "None",
          "body": "I don't say this to be rude, but if what you are doing isn't working, why keep doing? You have proven to yourself over and over that simply deciding \"never again\" doesn't work. So do something different. Get actual help, study CBT, check in to a facility, anything you haven't tried. Don't keep doing the same thing and hope for a different result.\n\nWishing you all the best and I hope you can get some qualified help, you are worth it.",
          "created_utc": 1623684791.0
        }
      ]
    },
    {
      "id": "h1rud3l",
      "author": "None",
      "body": "Okay, that's a good point, and I am well aware that there are cases who doesn't succeed no matter what they do. But when it comes to behavioral diseases there are also a very large proportion of people who try to conquer them through willpower alone by simply making a decision to stop, and then keep failing over and over, because it is the nature of these diseases that this approach simply doesn't work. Obviously I don't know if OP is one of them, but it's never a bad idea to bring it up, in case he/she actually is trapped on that threadmill (someone pointing that out to me in the past actually saved my life).",
      "created_utc": 1623703922.0,
      "score": 2,
      "context": [
        {
          "id": "h1qnuon",
          "author": "None",
          "body": "I don't say this to be rude, but if what you are doing isn't working, why keep doing? You have proven to yourself over and over that simply deciding \"never again\" doesn't work. So do something different. Get actual help, study CBT, check in to a facility, anything you haven't tried. Don't keep doing the same thing and hope for a different result.\n\nWishing you all the best and I hope you can get some qualified help, you are worth it.",
          "created_utc": 1623684791.0
        },
        {
          "id": "h1rs13k",
          "author": "acoh97",
          "body": "She ends up doing the same things (ie. b/p), but that doesn't mean the methods she tries to stop it from happening aren't different. Sometimes this disease is so vicious that every method to thwart it fails.",
          "created_utc": 1623702837.0
        }
      ]
    }
  ]
}