{
  "id": "o217yc",
  "subreddit": "bulimia",
  "author": "kaitlyn-leeloo",
  "created_utc": 1623947082.0,
  "title": "I feel like im gonna be a \"for-lifer\" forever",
  "selftext": "What I mean is that I feel like no matter what I'm always gonna be in the clutches of my bulimia. Even if I'm not super focused on my weight or food, it's just my ingrained habits and unintended thoughts. \nI've been in recovery for about 3-4 months now, and I'm doing so much better mentally than I was at my lowest, and I domt wanna go back to the worst of my disorder.\nBut I won't lie and say that I don't completely miss the days where i was hyper focused on my ED , and every now and then still I'll have a planned binge/purge. \nMostly I do it randomly when I get stressed/overwhelmed, so I'll pull out a bowl of icecream or sweets and purge them all within an hour. \nIt hurts to do it but still it does give me that same relief feeling and high when I was actively puring almost everyday.  But I know that currently I'm \"recovering\" but honestly I feel like bulimia is never gonna fully leave my life. Just always subconsciously I feel like it's always gonna be there when food is present or not. I just had too vent this out, still recovering is challenge but I know it's possible.",
  "url": "https://www.reddit.com/r/bulimia/comments/o217yc/i_feel_like_im_gonna_be_a_forlifer_forever/",
  "score": 87,
  "num_comments": 7,
  "comments": [
    {
      "id": "h24ract",
      "author": "hallowmean",
      "body": "I pretty much feel the same way. I’m afraid that I’m resigning myself to it by expecting it, and I do believe that full recovery is possible, I’m just not sure if I’m capable of it tbh. Like, I just don’t have the drive. \n\nI don’t know. Maybe one day we’ll find ourselves without it, but I think as long as there’s meaning or purpose outside of it, that might be good enough.",
      "created_utc": 1623961499.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h25wmt4",
      "author": "Lumplebee",
      "body": "I feel the exact same way. Started therapy for it a year ago and I’m just…not making any progress with purging (I did make a ton of progress in other ways) and I could tell my therapist was starting to get annoyed so I started fudging my food logs :/. Been here for over 7 years now and just don’t have the motivation to stop the compulsion anymore. I’ve cut out other bad coping mechanisms but bulimia is still here.",
      "created_utc": 1623982128.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h24erul",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623956196.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h26hndt",
      "author": "elpintor91",
      "body": "I wish I didn’t feel like that as well. I’ve gotten a LOT better the past 3 ish months and by that I mean purging only 1-2 times a week when before it was daily or 2x a day (I got a lot of help from recovery books/reading about nutrition). My triggers are definitely drinking. When I drink I over eat and then it’s soooo easy to purge while drunk. The weeks I don’t drink I don’t over eat and avoid that shit but that’s another addiction I have to deal with. I’m getting better but that sweet relief is a high like no other. It doesn’t help that even though I work my ass off at the gym I still feel stuck despite being stronger.",
      "created_utc": 1623995276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2d3p8w",
      "author": "GroundbreakingCrow77",
      "body": "Same here. I've had a ED since I was 12. I am now almost 20 and still struggling.",
      "created_utc": 1624137976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h25ortx",
      "author": "kaitlyn-leeloo",
      "body": "Yeah I get what you mean, I hear from some older ED people online and they say they do \"recover\" but those bitter sweet memories, and subconscious habits are still gonna be there, but having things in your life that you truly love/make you happy keep you out off the constant relapsing and unintended ED behavior.",
      "created_utc": 1623977914.0,
      "score": 5,
      "context": [
        {
          "id": "h24ract",
          "author": "hallowmean",
          "body": "I pretty much feel the same way. I’m afraid that I’m resigning myself to it by expecting it, and I do believe that full recovery is possible, I’m just not sure if I’m capable of it tbh. Like, I just don’t have the drive. \n\nI don’t know. Maybe one day we’ll find ourselves without it, but I think as long as there’s meaning or purpose outside of it, that might be good enough.",
          "created_utc": 1623961499.0
        }
      ]
    },
    {
      "id": "h260zqt",
      "author": "kaitlyn-leeloo",
      "body": "Fr I'm the same way with my other unhealthy behaviors, like I've been self harming for almost 6 years now and I've been able to let it go and stop at will. Same with smoking or drinking I can let those things go when I want, I feel in control in that regard. But yeah the bulimia is something different, I feel like it controls me still. Its so difficult especially since food is always forever gonna be apart your life, but we can minimize the purging and unhealthy thoughts with time and motivation.",
      "created_utc": 1623984475.0,
      "score": 3,
      "context": [
        {
          "id": "h25wmt4",
          "author": "Lumplebee",
          "body": "I feel the exact same way. Started therapy for it a year ago and I’m just…not making any progress with purging (I did make a ton of progress in other ways) and I could tell my therapist was starting to get annoyed so I started fudging my food logs :/. Been here for over 7 years now and just don’t have the motivation to stop the compulsion anymore. I’ve cut out other bad coping mechanisms but bulimia is still here.",
          "created_utc": 1623982128.0
        }
      ]
    },
    {
      "id": "h25og8e",
      "author": "kaitlyn-leeloo",
      "body": "Dude im so sorry :( I was in a similar situation when I was at my lowest, I wish you nothing but the best. Your gonna fight through this, I really hope inpatient helps you <3",
      "created_utc": 1623977740.0,
      "score": 2,
      "context": [
        {
          "id": "h24erul",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623956196.0
        }
      ]
    }
  ]
}