{
  "id": "o2lf8g",
  "subreddit": "bulimia",
  "author": "lildragon934",
  "created_utc": 1624009854.0,
  "title": "all or nothing",
  "selftext": "i’m not sure if anyone else struggles with this but i just can’t seem to have a healthy relationship with food. if i eat, i binge and purge. when i try to control the binging, i end up not eating a thing for days. \n\ni just want to be able to have a “normal” life, be able to go out on dates without having to work around the times that people typically eat meals at. i’m not sure where this is going, i just needed to vent lol",
  "url": "https://www.reddit.com/r/bulimia/comments/o2lf8g/all_or_nothing/",
  "score": 80,
  "num_comments": 9,
  "comments": [
    {
      "id": "h270aiy",
      "author": "kianagunning",
      "body": "the only thing I’ve found that gets me out of the cycle is forcing myself to eat regularly and it mostly works. it sucks but when you try to control binging by restricting you will inevitably end up binging again so they only way to stop it is stopping the restriction first and eating 3+ meals a day and snacks, and not denying yourself anything. I’ve been working at it like that for about 6 months now and I’m down to 1-2 binges a month at most instead of once every few days, it takes a lot of time but it is possible to get out of the cycle ♥️",
      "created_utc": 1624011750.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h26yofl",
      "author": "Vicariouslylivin",
      "body": "It is inherently connected unfortunately. You know it’s illogical but it doesn’t make a difference.",
      "created_utc": 1624010327.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h27bg8j",
      "author": "Moist_Magician_6012",
      "body": "yeah same here, i was in recovery but i relapsed again.. it’s an on and off cycle tbh i kinda just accepted it now :/",
      "created_utc": 1624019777.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h27p66n",
      "author": "Narwhal_Songs",
      "body": "yup \n\nexactly \n\nthe same",
      "created_utc": 1624026646.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h28kwt9",
      "author": "starving-fairyy_222",
      "body": "I feel the same. It’s like you have to accept your relationship food will get better but it won’t fully be the same like how it was as a child. I still get excited to eat. The build up is great but after that first bite, the guilt is like I murderer someone.",
      "created_utc": 1624040860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h298l6i",
      "author": "Emotional-Boot-4492",
      "body": "I find for me the only way to be ‘normal’ is to eat whatever I want BUT in moderation. That’s the hard part. I have had periods of time in my life where I’ve done this and I lost weight and was mentally and physically healthy. The minute I start thinking I need to lose a few pounds and think about restrictions I can’t stop thinking about food and then I get depressed",
      "created_utc": 1624051675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2asb78",
      "author": "Existing-Race",
      "body": "Yeah, i have a degree in food science and about to finish my phd in nutrition, and guess what I'm doing here? I can definitely tell you that it's illogical",
      "created_utc": 1624084120.0,
      "score": 1,
      "context": [
        {
          "id": "h26yofl",
          "author": "Vicariouslylivin",
          "body": "It is inherently connected unfortunately. You know it’s illogical but it doesn’t make a difference.",
          "created_utc": 1624010327.0
        }
      ]
    },
    {
      "id": "h2asq7s",
      "author": "Vicariouslylivin",
      "body": "I was a pt and very much into health and nutrition before my ED developed. So unfortunately I knew EXACTLY how fucked up i was. I knew what I was doing would long term, lead to more weight gain etc. but I can’t explain besides comparing it to OCD?! You know it’s irrational but you are compulsively compelled to act out in these ways.\nAlso ED and OCD can be linked so I guess that makes sense?!\n\nWould love it if you posted some of your knowledge on a sub!! ….just sayin’",
      "created_utc": 1624084470.0,
      "score": 2,
      "context": [
        {
          "id": "h26yofl",
          "author": "Vicariouslylivin",
          "body": "It is inherently connected unfortunately. You know it’s illogical but it doesn’t make a difference.",
          "created_utc": 1624010327.0
        },
        {
          "id": "h2asb78",
          "author": "Existing-Race",
          "body": "Yeah, i have a degree in food science and about to finish my phd in nutrition, and guess what I'm doing here? I can definitely tell you that it's illogical",
          "created_utc": 1624084120.0
        }
      ]
    }
  ]
}