{
  "id": "o5tscd",
  "subreddit": "bulimia",
  "author": "KnownCherry8",
  "created_utc": 1624386520.0,
  "title": "i wish my friends who know about my eating disorder would stop telling me how they \"barely had anything to eat today! omg! i'm not even hungry!\" i'm in recovery and it makes it so hard. maybe i'm selfish but damn dude it really throws me off when i'm proud of myself for eating.",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/o5tscd/i_wish_my_friends_who_know_about_my_eating/",
  "score": 162,
  "num_comments": 14,
  "comments": [
    {
      "id": "h2okz0i",
      "author": "LocalBalance",
      "body": "Same like congrats on not eating all day sis that’s really healthy and appropriate to tell me",
      "created_utc": 1624388289.0,
      "score": 42,
      "context": []
    },
    {
      "id": "h2oxbu8",
      "author": "ladymcgonagall",
      "body": "This. Even better when they complain about how hungry they are but still not want to eat anything...",
      "created_utc": 1624393792.0,
      "score": 26,
      "context": []
    },
    {
      "id": "h2pjs5v",
      "author": "Tentaclesntea",
      "body": "Same with people going on and on about their new diet or how a specific diet would help me, or people doing those 14 day detoxes where they only drink juice.\n\nEdit: ALSO! People pointing out how fast I eat",
      "created_utc": 1624405005.0,
      "score": 19,
      "context": []
    },
    {
      "id": "h2pn7tr",
      "author": "esoterique87",
      "body": "That makes me sad for them and happy for you. Eat that food and enjoy it! You are amazing and you should be super proud! Also, it may be in your best interest to tell them that those comments are triggering. You have the power to establish boundaries with your friends and if they truly are your friends they will respect those boundaries.\n\nPetty side note....how sad and boring is it to brag about not eating? Like don't you have something more interesting to talk about?",
      "created_utc": 1624406877.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h2q79o3",
      "author": "yikes-crispies",
      "body": "My fucking boyfriend who I’ve been with for 5+ years like CAN YOU NOT TELL ME THIS SHIT",
      "created_utc": 1624417532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2rbduc",
      "author": "kkunaan",
      "body": "my friend used to say stuff like this but i confronted her about it and thankfully she stopped doing it. if it’s not someone you feel comfortable asking directly, I used to say stuff like “that’s not healthy at all, you need to eat, it’ll throw off your metabolism”. i’m so thankful my boyfriend is actually the one who tells me to eat more.",
      "created_utc": 1624449365.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h2r7b3c",
      "author": "None",
      "body": "i stopped hanging out with a friend who constantly do that. she also tries to way less whenever she's with me, and never finishes food. i relapsed bc of her and i stopped hanging out then tried recovering again so far so good tho 🥲",
      "created_utc": 1624446255.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2rugm4",
      "author": "Yourstrulymegladon",
      "body": "No so absolutely THIS. I have friends who have established that they ~do not~ have disordered eating but will jokingly say “omg you’ll feel so much better if you just vom, like I always do it when I’m nauseous”. And I’m like HELLO I KNOW but not trying to fall back into debilitating habits. Purging is so engrained in our society without people even realizing how spiraling it can be.",
      "created_utc": 1624459746.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2rzoev",
      "author": "None",
      "body": "“I haven’t eaten in two day’s”\nThat’s cool fam, I’m trying to grow a human being so please calm down.",
      "created_utc": 1624462118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2s189n",
      "author": "Ok-Statistician-3314",
      "body": "Ugh yes I deal with this too! People really don't understand the impact of their words, so stay strong and keep going with recovery!!!",
      "created_utc": 1624462810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2slp2n",
      "author": "Sleavee",
      "body": "No you are not selfish. Your ed will tell you that. You are so much more than your ed and you should not listen to those harmful things it says to you. You are beautiful and I am very proud of you for fighting!! My friends used to tell me stuff like that, and my best advice is to sit and have a serious conversation about it. Talk about what triggers you, and tell them not to bring those things up. Also if they want to know why those things trigger you, you can tell them that you don't have to further explain your triggers to them, because you are valid. \nReminder: grab a glass of water and stay hydrated!! You are loved <33",
      "created_utc": 1624471640.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2s14wd",
      "author": "Ok-Statistician-3314",
      "body": "Exactly they act like it's something to be proud of PLZ",
      "created_utc": 1624462769.0,
      "score": 2,
      "context": [
        {
          "id": "h2okz0i",
          "author": "LocalBalance",
          "body": "Same like congrats on not eating all day sis that’s really healthy and appropriate to tell me",
          "created_utc": 1624388289.0
        }
      ]
    },
    {
      "id": "h2pzvj5",
      "author": "KnownCherry8",
      "body": "YES! i eat so fast and i absolutely hate it because it makes me feel like no one else is gonna finish their meal, but i just have to give them time😅",
      "created_utc": 1624413548.0,
      "score": 2,
      "context": [
        {
          "id": "h2pjs5v",
          "author": "Tentaclesntea",
          "body": "Same with people going on and on about their new diet or how a specific diet would help me, or people doing those 14 day detoxes where they only drink juice.\n\nEdit: ALSO! People pointing out how fast I eat",
          "created_utc": 1624405005.0
        }
      ]
    },
    {
      "id": "h2pzstz",
      "author": "KnownCherry8",
      "body": "thank you, i absolutely will! and the most frustrating part is they’re like “i don’t struggle with body issues like you do, but i feel so fat and gross today and all i had to eat was a granola bar🥺🥺”",
      "created_utc": 1624413509.0,
      "score": 1,
      "context": [
        {
          "id": "h2pn7tr",
          "author": "esoterique87",
          "body": "That makes me sad for them and happy for you. Eat that food and enjoy it! You are amazing and you should be super proud! Also, it may be in your best interest to tell them that those comments are triggering. You have the power to establish boundaries with your friends and if they truly are your friends they will respect those boundaries.\n\nPetty side note....how sad and boring is it to brag about not eating? Like don't you have something more interesting to talk about?",
          "created_utc": 1624406877.0
        }
      ]
    }
  ]
}