{
  "id": "o6eurf",
  "subreddit": "bulimia",
  "author": "Goblin_at_heart",
  "created_utc": 1624461306.0,
  "title": "I know this is shitty, but I wish I could restrict hard like someone with ana",
  "selftext": "I know that ana isn't about motivation or self control and it's also a really shitty life threatening mental illness. \n\nBut I can't help but watch those what I eat in a day ana videos and Google ana tips and Google super thin models.\n\nIt makes me feel like a failure.\n\nAnd then I want to binge. And then I want to purge. And then I want to restrict.\n\nMy partner isn't letting me restrict after I told him it triggers binging, but it's really stressful. But tbh I was never good at that part anyways, I could make it half a day maximum, and then I'd binge.\n\nI can't believe I relapsed 8 months ago by convincing myself to just throw up large meals. I can't believe I went into this so willingly. I'm so annoyed with my self.\n\nI really wouldn't wish this or ana or any eating disorder on anyone else. Its pretty fucked up that I can wish for myself to get better and worse at the same time.",
  "url": "https://www.reddit.com/r/bulimia/comments/o6eurf/i_know_this_is_shitty_but_i_wish_i_could_restrict/",
  "score": 189,
  "num_comments": 22,
  "comments": [
    {
      "id": "h2s1z4w",
      "author": "Goblin_at_heart",
      "body": "I just want to be thin, basically. For some reason feel like this will solve everything",
      "created_utc": 1624463145.0,
      "score": 61,
      "context": []
    },
    {
      "id": "h2sjkjz",
      "author": "None",
      "body": "Try not to beat yourself up too much. Remember that this is the ED talking. You struggle from mental illness, and that doesn’t make you shitty or less of a person. There is help out there when you are ready to receive it. I mean you’re already here in the sub, and to me that is a stretch towards wanting to recover. Or it could simply be your safe space. Whatever it is, you are cared and supported here. 🤍",
      "created_utc": 1624470674.0,
      "score": 31,
      "context": []
    },
    {
      "id": "h2sk7ms",
      "author": "neverendinganger",
      "body": "I’ve never been too good at restricting and I feel so undisciplined and like I have no self control. I often wish I had typical AN so I could at least be skinny if I’m gonna suffer this much anyway, but I tend to cycle through phases of different disordered behaviours without my body changing too much",
      "created_utc": 1624470963.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h2skc6j",
      "author": "None",
      "body": "I could have written this.  You are not alone with this feeling!!",
      "created_utc": 1624471020.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h2tli86",
      "author": "foamcrestedbrine",
      "body": "This is one of the most common sentiments from people with non-ana EDs, and it makes sense theoretically. Remember though (and I say this unfortunately from experience) - you can’t enjoy any of the side effects you think you’ll get from being thin when you have Ana. Personality-wise it often makes people irritable and edgy, suspicious (because people are trying to get you to eat, so it’s not unfounded) and insanely jealous and has physical ramifications that are permanent like infertility and really fucking with your metabolism. You are in a state of such extreme hunger, even if it’s dulled, that you can never let your guard down. Your body is slowly shutting down its functions and adapting so it can survive. I know Mia has plenty of terrible side effects as well but just a little dose of reality check - Ana is horrendous in its own way, and the longer people with it go down that path the harder and longer their recovery is going to be. And it’s not sustainable so the pathways from there are transitioning to other EDs anyway or recovery or a slow and devastating death. Heavy, but that’s the reality and I wish every day I hadn’t had Ana because it has made my physical recovery so much harder. \nxo",
      "created_utc": 1624488110.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h2sxk9v",
      "author": "prdcroftme",
      "body": "same. i have an b/p diagnosis but lately ive been struggling w binging, and restricting is really hard for me lately so i understand where you're coming from. it sucks, but know you're not alone and your struggles are valid no matter what",
      "created_utc": 1624477123.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2shc34",
      "author": "Narwhal_Songs",
      "body": "oh yes this \n\nI had (sort of?) anorexia, but wasn't underweight before i became bulimic and although it was HELL there was a lot things I prefered with that. \n\nI actually got some results with restriction (although it was too much)\n\nI didn't spend ALL my money on food\n\nDidn't steal food\n\nand I was sort of proud of it???\n\nBulimia is just disgusting...",
      "created_utc": 1624469657.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h2srrsf",
      "author": "feiturdrengur",
      "body": "I was in a support group once. A guy who had debilitating anxiety quipped that he would much rather have crippling depression. It sounded kinda fucked up since I wouldn't wish depression on my worst enemy, but then I realized that I do the same, where I feel like I would rather have the ~*skinny*~ eating disorder rather than my \"fat\" eating disorder. I'm sure we all do this to a point - the grass is greener on the other side and all that.",
      "created_utc": 1624474480.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2ugke0",
      "author": "thr0waway_ithink",
      "body": "why r we literally on the same wavelength rn cuz i was gonna post THE SAME THING, wow we literally get each other",
      "created_utc": 1624504582.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h3d5z11",
      "author": "FlyLittleCrow123",
      "body": "I feel the exact same way. I’ll gorge myself with food then throw it all up and I get pissed off with myself because ohhhh those fries look good one bite won’t hurt. Why can’t I just not eat anything and get skinny?? Why do I have to be tempted by food it’s so irritating",
      "created_utc": 1624914178.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2tpn83",
      "author": "esoterique87",
      "body": "I understand what you mean because bulimia is horrendous and torturous. You think that anything must be better than living with bulimia. Anorexia is it's own hell, there are just slightly different demons to contend with. Wanting to trade in your bulimia for anorexia is a bit like wanting to swap one abusive partner for a different abusive partner. They both suck, they both make you miserable and you feel trapped. \n\nI totally know how it feels to want to recover but you're still holding on so tightly to your ED. Googling ana tips, looking at super thin models and what I eat in a day videos is not helping you. You are making things so much more difficult than you need to. Try broadening your interests outside of what you look like. Start exploring who you are, what you are interested in and your relationships to other people. Those are the things that truly matter in life.\n\nI hope you are able to continue in your recovery and not let this relapse get you down. Keep fighting because you are 100% deserving of a better life. ❤️",
      "created_utc": 1624490293.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2vym8w",
      "author": "Lemonsocks666",
      "body": "As someone with Ana and bulimia and binge I find that most anorexics are having just as a hard time. It’s not easy to deprive your body of something we need to survive. It’s taxing, physically and mentally and it’s very much a pressure. Some people use not eating to cope and I’m one of them but even then it’s a little hard to. We have bodies that want to eat so we survive and function. Don’t beat yourself up over it because even extreme anorexics have a hard time",
      "created_utc": 1624544367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2t67pm",
      "author": "dearryka",
      "body": "Felt",
      "created_utc": 1624480903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2taboq",
      "author": "Playful_Discipline_1",
      "body": "I feel this too so much.. I wrote about this in a journal entry the other day. I hate the cycle. Restrict. Binge. Purge. Repeat. I know it sounds terrible but I wish I had the self control to just not eat",
      "created_utc": 1624482728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2u0w1k",
      "author": "novabitch",
      "body": "I wish this ALL the time.",
      "created_utc": 1624496268.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2v56r8",
      "author": "None",
      "body": "I held this feeling for a long time. Sometimes, it still crosses my mind. Then I remember 18 months ago, when I restricted to 800 or less calories a day, exercised 2 hours+ every day, and wouldn't eat any carb. I felt so shitty the whole time. Yeah I lost and maintained a lower weight but everything about it was so bad. First, it made me obsessed with food and extremely stressed about food to the point of feeling nauseous every time I was confronted with food (let's say that didn't help with the bulimia). \n\nAlso, my sleep was so bad, and my tachycardia alternated with my bradycardia so much that I was pretty much always out of breath and my chest was in pain all the time. I would continue to lift weight and do cardio to the point of feeling lightheaded every single time. My cramps were awful, my skin had the texture of cardboard, and my nails were blue/gray almost all the time. \n\nI thought I was good at recovery because I didn't purge for 30+ days but the fact that I lost 10% of my body weight when I was already close to underweight, and couldn't even sleep properly because I was obsessing with food, and would compensate with exercise because it killed my desire to eat, clearly I was doing even worse than my binge-purge days. \n\nThat led me to having a huge bulimia relapse that lasted several months until I realised that I couldn't even drink cold water anymore because my teeth were so painful.  And that's when I decided I needed an actual recovery and worked on eating more regularly and better foods. It really helped and I feel so much better. \n\nThe grass isn't greener on the other side.",
      "created_utc": 1624523385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2u2usx",
      "author": "None",
      "body": "I've had both AN and BN before and I know how you feel",
      "created_utc": 1624497337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2sqjpn",
      "author": "Goblin_at_heart",
      "body": "Thank you ❤️",
      "created_utc": 1624473871.0,
      "score": 5,
      "context": [
        {
          "id": "h2sjkjz",
          "author": "None",
          "body": "Try not to beat yourself up too much. Remember that this is the ED talking. You struggle from mental illness, and that doesn’t make you shitty or less of a person. There is help out there when you are ready to receive it. I mean you’re already here in the sub, and to me that is a stretch towards wanting to recover. Or it could simply be your safe space. Whatever it is, you are cared and supported here. 🤍",
          "created_utc": 1624470674.0
        }
      ]
    },
    {
      "id": "h2sqlpa",
      "author": "Goblin_at_heart",
      "body": "This is exactly how I feel. ❤️",
      "created_utc": 1624473899.0,
      "score": 8,
      "context": [
        {
          "id": "h2sk7ms",
          "author": "neverendinganger",
          "body": "I’ve never been too good at restricting and I feel so undisciplined and like I have no self control. I often wish I had typical AN so I could at least be skinny if I’m gonna suffer this much anyway, but I tend to cycle through phases of different disordered behaviours without my body changing too much",
          "created_utc": 1624470963.0
        }
      ]
    },
    {
      "id": "h2tet6c",
      "author": "crybaby_jones",
      "body": "i do the exact same, it’s so tiring",
      "created_utc": 1624484815.0,
      "score": 7,
      "context": [
        {
          "id": "h2sk7ms",
          "author": "neverendinganger",
          "body": "I’ve never been too good at restricting and I feel so undisciplined and like I have no self control. I often wish I had typical AN so I could at least be skinny if I’m gonna suffer this much anyway, but I tend to cycle through phases of different disordered behaviours without my body changing too much",
          "created_utc": 1624470963.0
        }
      ]
    },
    {
      "id": "h2tzdmp",
      "author": "acoh97",
      "body": "Exactly the same. Ugh.",
      "created_utc": 1624495468.0,
      "score": 5,
      "context": [
        {
          "id": "h2shc34",
          "author": "Narwhal_Songs",
          "body": "oh yes this \n\nI had (sort of?) anorexia, but wasn't underweight before i became bulimic and although it was HELL there was a lot things I prefered with that. \n\nI actually got some results with restriction (although it was too much)\n\nI didn't spend ALL my money on food\n\nDidn't steal food\n\nand I was sort of proud of it???\n\nBulimia is just disgusting...",
          "created_utc": 1624469657.0
        }
      ]
    },
    {
      "id": "h2yjvfn",
      "author": "None",
      "body": "this is EXACTLY how i feel. it makes me feel like a failure.",
      "created_utc": 1624594134.0,
      "score": 3,
      "context": [
        {
          "id": "h2sk7ms",
          "author": "neverendinganger",
          "body": "I’ve never been too good at restricting and I feel so undisciplined and like I have no self control. I often wish I had typical AN so I could at least be skinny if I’m gonna suffer this much anyway, but I tend to cycle through phases of different disordered behaviours without my body changing too much",
          "created_utc": 1624470963.0
        },
        {
          "id": "h2tet6c",
          "author": "crybaby_jones",
          "body": "i do the exact same, it’s so tiring",
          "created_utc": 1624484815.0
        }
      ]
    }
  ]
}