{
  "id": "o8nfje",
  "subreddit": "bulimia",
  "author": "bitchwhorehannah",
  "created_utc": 1624757318.0,
  "title": "why",
  "selftext": "why can’t i just eat normally. why is it either 12 servings of food at once or nothing at all for days. why can’t i go to a restaurant or eat my friends cooking without running to the bathroom and vomiting. \n\ni literally swallowed a fake nail last night, my walmart press ons couldn’t take it i guess 😛 you’d think it would be a wake up call? no, i’m back at again tonight, inhaling everything in sight and destroying my bathroom right after. and for what? this doesn’t make me happy. i’m miserable. i don’t want to live like this. \n\nwhy can’t i just wake up and eat breakfast. then do some hobbies and eat lunch. then do some activities and eat dinner. then watch tv and go to sleep. why does this consume my life? i smell like vomit. my room, my bathroom. i just want to be normal. i hate the way the number on the scale goes down after an intense session. just makes me want to do it more.",
  "url": "https://www.reddit.com/r/bulimia/comments/o8nfje/why/",
  "score": 66,
  "num_comments": 3,
  "comments": [
    {
      "id": "h366a0i",
      "author": "juniormvarsity",
      "body": "You can my dear! Try eating smaller stuff throughout the day so you are not so hungry at night. I went to treatment for bulimia, maybe you need to reset in a place where you cannot binge and purge and where you’re taught how to eat again. It saved my life. You can be free",
      "created_utc": 1624760839.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h37h0bi",
      "author": "plzkthx71",
      "body": "Be gentler to yourself, you’re going through something fucking awful as we all know too well. It’s not your fault, things can get better❤️‍🩹",
      "created_utc": 1624798429.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3842c7",
      "author": "carolinawrenbestbird",
      "body": "yeah i'm dealing with the same thing, of not being able to eat outside of b/ping. like i cant even put into words how much i wish i could have like, a goddamn vegetable. my body needs that so bad. or like a nice hot well balanced meal that i could let sit in my stomach and feel comfortably full and okay. but irl in that situation when i try to make that happen it just ends in me b/ping unless it's some stupid bullshit like my no sugar added popsicles or a bodyarmor lyte drink or something. i'm trying to re introduce my other old safe foods but it's so hard, because anything that tastes like remotely actually good and/or is slightly solid or substantive is a bad trigger, but if i can't have anything tasty or nutritious then it's like why am i even trying idk. very frustrating <3",
      "created_utc": 1624811161.0,
      "score": 2,
      "context": []
    }
  ]
}