{
  "id": "o9n2b1",
  "subreddit": "bulimia",
  "author": "BaboGal",
  "created_utc": 1624895547.0,
  "title": "looking at myself in mirrors can be triggering",
  "selftext": "i don’t know if this is considered extreme, but does anyone else sometimes have their entire mood ruined from one look at your reflection? i’m simultaneously obsessed with how i look, but staring at myself too long can cause me to spiral. it’s so bad that every picture i take of myself is in a hidden folder on my phone so i don’t accidentally look at them while randomly scrolling through my photos. i have literally broken down crying in the past after standing in front of a mirror for a couple minutes just looking at myself. this is not living",
  "url": "https://www.reddit.com/r/bulimia/comments/o9n2b1/looking_at_myself_in_mirrors_can_be_triggering/",
  "score": 123,
  "num_comments": 11,
  "comments": [
    {
      "id": "h3c56yr",
      "author": "None",
      "body": "If it's any solace I feel similarly; I am obsessed with my own body, some days loving myself but most days hating myself. Anytime I look in the mirror I just constantly judge myself, for better or for worse.",
      "created_utc": 1624898304.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h3cd2gi",
      "author": "havehope2234",
      "body": "omg you are not alone. this is something I rlly struggle with which is why I intentionally avoid mirrors and looking at past photos and even taking pics of myself just so that I dont spiral down and get triggered. its really sad and frustrating though because I really do want to look in the mirror and be okay with how I look and take pictures without getting triggered but right now its still hard but its okay! Im constantly challenging myself by actually looking in the mirror and talking positively to myself and even taking pics of myself little by little so that one day I just wont be scared or\ntriggered by it.",
      "created_utc": 1624901744.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3czp2g",
      "author": "None",
      "body": "I feel similarly. Seeing myself absolutely ruins my day. Catching sight of my face brings on depression and seeing my body brings on ED thoughts and impulses. I try to limit how often I look at myself in the mirror, but I also feel the need to know exactly how I look at all times (so that I know how other people see me). It’s hellish, isn’t it?!",
      "created_utc": 1624911504.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3conlh",
      "author": "ftwillzzz",
      "body": "had a panic attack this morning after looking in the mirror actually",
      "created_utc": 1624906753.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3dgd1n",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1624918857.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3cst3a",
      "author": "None",
      "body": "you’re not alone at all. you know when you get undressed in the bathroom before getting in the shower? i have to close my eyes or look the other way bc it’ll send me into a spiral. i feel the same way and i know it’s hard❤️ little steps",
      "created_utc": 1624908534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3dc79e",
      "author": "spinthesound",
      "body": "You’re not alone.",
      "created_utc": 1624916954.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3cc3qv",
      "author": "esoterique87",
      "body": "I know how this feels and it's horrible. In these situations you get tunnel vision and all that matters is how you look or how dissatisfied you are with how you look. For those in recovery it is really helpful to limit mirror time. I have my full length mirror covered so that I'm not constantly looking at myself and I am working on not body checking in the mirror. Human beings were not meant to be looking at ourselves as much as we do now. Whether it's in mirrors, pictures, social media or zoom, all of this is way too much time spent looking at ourselves, and criticizing how we look. For your own mental health, be aware of how much time you spend in the mirror or taking photos. Try to limit that time so that you don't end up spiraling.\n\nThere's a great tool to reframe how you feel about your body/appearance. Even if you don't have children or want children, this can still be helpful.\n\nImagine you have a daughter and she is your exact age, she looks identical to you, she is exactly where you are in your life right now. She is struggling with her body image and how she looks. She feels bad about herself, she obsesses, she spirals and cries. What would you say to her? What advice would you give her? How would you comfort her? Would you try and help her see the bigger picture? Would you tell her that she is right and she should feel bad about herself?\n\nThis kind of exercise should help you realize that you are deserving of the same compassion, love and care that you would give to your hypothetical daughter. You are so much more than how you look. You are a complex human being with so many amazing traits and your body is just a vehicle. It helps you live your life and do all the things that you want to do. Focus on all that you do have and what your body allows you to do instead of tearing it down. I promise if you keep trying to change the way you talk to yourself, you will start to see yourself in a whole new light. ❤️",
      "created_utc": 1624901325.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3e3xra",
      "author": "ReynoldRaps",
      "body": "Yes. I barely raise my head to look when I pass a mirror for this reason.",
      "created_utc": 1624930960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3er9e4",
      "author": "None",
      "body": "I do the same thing, I hate mirrors :/ I mean it's fine if m just brushing my hair or something, but if I truly look in the mirror I get really upset",
      "created_utc": 1624944655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3dhlsr",
      "author": "BaboGal",
      "body": "i’m in this paradox where i like wearing makeup in an attempt to make myself look better and boost my self esteem a bit even if temporary, but that requires looking in the mirror the whole time i’m applying it 🥲",
      "created_utc": 1624919458.0,
      "score": 4,
      "context": [
        {
          "id": "h3czp2g",
          "author": "None",
          "body": "I feel similarly. Seeing myself absolutely ruins my day. Catching sight of my face brings on depression and seeing my body brings on ED thoughts and impulses. I try to limit how often I look at myself in the mirror, but I also feel the need to know exactly how I look at all times (so that I know how other people see me). It’s hellish, isn’t it?!",
          "created_utc": 1624911504.0
        }
      ]
    },
    {
      "id": "h3dhaue",
      "author": "BaboGal",
      "body": "it gets that bad for me sometimes also. luckily it’s not a common thing but i’ve had my anxiety spike at the thought of showering because that meant being naked. baggy clothes are my shield",
      "created_utc": 1624919310.0,
      "score": 2,
      "context": [
        {
          "id": "h3dgd1n",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1624918857.0
        }
      ]
    }
  ]
}