{
  "id": "obcsyo",
  "subreddit": "bulimia",
  "author": "mytrenchcoatisyellow",
  "created_utc": 1625108533.0,
  "title": "My husband told me my bulimia is because I wanted to cheat on losing weight",
  "selftext": "Not the first time someone told me this. But to hear this, every time I want to go on a strict restriction and waste away. I haven’t b/p for a while but now I’m triggered to start again. \n\nSometimes I wish I was anorexic instead. May be this time I’d succeed. Who knows.",
  "url": "https://www.reddit.com/r/bulimia/comments/obcsyo/my_husband_told_me_my_bulimia_is_because_i_wanted/",
  "score": 79,
  "num_comments": 16,
  "comments": [
    {
      "id": "h3nqvx7",
      "author": "00Starved00",
      "body": "Punch him in the fucking face",
      "created_utc": 1625125703.0,
      "score": 59,
      "context": []
    },
    {
      "id": "h3o5gbb",
      "author": "None",
      "body": "I will tell him to just fuck off. To describe this complex mental illness into mere simple words “cheating on weight loss” makes me want to lose my shit and start a rant conversation debate with ur so",
      "created_utc": 1625138405.0,
      "score": 24,
      "context": []
    },
    {
      "id": "h3nuwnl",
      "author": "Significant_Subject1",
      "body": "Wow. Statements like this from a person who loves you is so discouraging to hear. I’m so sorry he triggered you. Stay strong and tell him to do some research. ❤️",
      "created_utc": 1625129373.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h3o86rx",
      "author": "Goblin_at_heart",
      "body": "He's clearly got no understanding of bulimia at all.",
      "created_utc": 1625140305.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h3o8slj",
      "author": "ThRoWaWaYaFtErUse246",
      "body": "Clearly this dude has no understanding of bulimia or eating disorders in general, props to you for not lashing out because if my BF had said that to me I think I’d go ballistic. I’m also so sorry to hear that he’s being such a shithead.",
      "created_utc": 1625140703.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h3q92zx",
      "author": "None",
      "body": "Well his comment is because he’s too lazy to educate himself on the subject matter.",
      "created_utc": 1625173867.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h3pcrjy",
      "author": "LocalBalance",
      "body": "Interesting considering bulimia made me gain weight lol",
      "created_utc": 1625159927.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h3n7aul",
      "author": "ResistTheRabbitHole",
      "body": "I hate when people say shit like this. If they knew anything about bulimia, they'd know that the majority of people don't lose weight. Some even gain.\n\nBesides, purging fucking sucks. I hate how weak I feel afterwards and how I can't think straight. My heart is pounding and my hands are shaking. I hate that feeling of dread knowing I need to find a way to purge around my family after a big meal I couldn't avoid. I hate having to stare at the toilet and psych myself up as a punishment for binging or even just overeating a little. I haven't even been purging for long and it already sucks. \n\nI wish people would educate themselves a bit more, especially if a loved one has an eating disorder.\n\nI'm really sorry he told you that. I would tell him how that made you feel and how the things he says can push you to b/p. I'd also ask him to read a bit about it from medical sites, that way he can learn more about it without you having to dig through all of the really difficult emotional stuff.",
      "created_utc": 1625111596.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h3qtjz0",
      "author": "qazwsxedc000999",
      "body": "Why would anyone say something like that?",
      "created_utc": 1625183647.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3qdv2m",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1625176000.0,
      "score": -4,
      "context": []
    },
    {
      "id": "h3r7xcx",
      "author": "wolfspirit311",
      "body": "Honey it’s time for a ✨divorce✨",
      "created_utc": 1625191199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4sbi3j",
      "author": "UniCronn",
      "body": "Oh he's not being a husband, he's being a problem. That might sound fucked up but what he said is something that will probably stick with you for a long time, THAT'S fucked up.",
      "created_utc": 1625987270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3o59vo",
      "author": "None",
      "body": "Agreed",
      "created_utc": 1625138275.0,
      "score": 8,
      "context": [
        {
          "id": "h3nqvx7",
          "author": "00Starved00",
          "body": "Punch him in the fucking face",
          "created_utc": 1625125703.0
        }
      ]
    },
    {
      "id": "h3r69xp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1625190316.0,
      "score": 2,
      "context": [
        {
          "id": "h3qdv2m",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1625176000.0
        }
      ]
    }
  ]
}