{
  "id": "ocpyts",
  "subreddit": "bulimia",
  "author": "YungAids43",
  "created_utc": 1625282494.0,
  "title": "anyone else feel like they’re faking it?",
  "selftext": "i always get in my own head after i purge and think to myself “stop faking it” and “you’re just doing it for attention” and then i start thinking am i faking everything and i spiral from there. idk i just feel weird whenever i do it and start to overthink everything and i feel selfish and guilty but i can’t control it and i know i can’t control it but i always seem to second guess myself",
  "url": "https://www.reddit.com/r/bulimia/comments/ocpyts/anyone_else_feel_like_theyre_faking_it/",
  "score": 80,
  "num_comments": 11,
  "comments": [
    {
      "id": "h3wi4m5",
      "author": "hallowmean",
      "body": "Bulimia is a behaviour, not a state of being. If you perform the behaviour, you aren’t faking it.",
      "created_utc": 1625301810.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h3wc7f5",
      "author": "None",
      "body": "Yes I know what you mean. I don't do it every day. Maybe like 5-4 times in a week and I don't know if I can label it as an Ed. There are ppl who have it worse and for me it doesn't feel that extreme. For me it's more like a way to lose weight and not an excessive illness. Like I tell myself that it could be an illness but as long as I have it under control I have no right to say that I'm ill.",
      "created_utc": 1625296226.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h3wgibe",
      "author": "RedVelvet1108",
      "body": "I guess that's pretty normal. You will know how \"serious\" your addiction is from the second you decide that it's time to stop. Only if you try to face it, it will show its true face, so to speak.\nBesides that. ALL problematic ways to eat or loose weight can be considered eating disorders. People having it worse is not a reason to de-valuate your own feelings. There is a good reason for there being no actual \"bar\" for serious or not-serious eating disorder. I don't have a great way with words Today... but I hope it's clear what I mean.",
      "created_utc": 1625300237.0,
      "score": 22,
      "context": []
    },
    {
      "id": "h3wnh0u",
      "author": "cherryknotz",
      "body": "YES. I didn’t take it seriously until after 8 years of sometimes multiple daily binging and purging because I told myself I was faking it or doing it for attention (although I never told anybody lol).  It was just the ED trying to keep me sick and in denial. I also did the same in alcoholism, it’s just the immediate voice that makes me spiral and my brain knows it so uses it a lot.",
      "created_utc": 1625307010.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h3whtd0",
      "author": "None",
      "body": "Tbh not sure myself but to a different extent because I have not talked about eds to my psychologist or psychiatrist and I don't think I qualify for the criteria of bulimia despite purging. Does that make sense?",
      "created_utc": 1625301503.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3wttor",
      "author": "monsterhandholder",
      "body": "Yeah, after i start to binge i have brief moments of delusion where i'll think to myself that if i'm eating, i must be recovered. Usually goes downhill from there",
      "created_utc": 1625312792.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3wwaqn",
      "author": "Dietcoco",
      "body": "I think about it on these moments when I am going out to restaurants to eat and actually enjoy food or when I am snacking, or when I feel I am just eating more than anyone else. I think then “you just can’t lose weight and this is your excuse to complain to therapist about”.",
      "created_utc": 1625314734.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3xayh7",
      "author": "egglesswench",
      "body": "I just wanna say that just because someone may have it harder than you, it doesn't make your problems less valid!! It's good to give yourself some perspective, but that can become toxic if you use that perspective  disregard your own struggles. You matter! And you got this c: wish you all the best.",
      "created_utc": 1625323678.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3xwerm",
      "author": "PinkRaven1",
      "body": "I have those types of thoughts every day. It’s one of the reasons I never got help until 2020. I’m diagnosed and on medication and I still feel like I’m a faker.",
      "created_utc": 1625334844.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3xruld",
      "author": "plzkthx71",
      "body": "You’re just as valid. I relate so i get how you’re feeling, but just because people have it worse doesn’t mean you dont have one or shouldn’t complain etc",
      "created_utc": 1625332488.0,
      "score": 4,
      "context": [
        {
          "id": "h3wc7f5",
          "author": "None",
          "body": "Yes I know what you mean. I don't do it every day. Maybe like 5-4 times in a week and I don't know if I can label it as an Ed. There are ppl who have it worse and for me it doesn't feel that extreme. For me it's more like a way to lose weight and not an excessive illness. Like I tell myself that it could be an illness but as long as I have it under control I have no right to say that I'm ill.",
          "created_utc": 1625296226.0
        }
      ]
    },
    {
      "id": "h3xs5s1",
      "author": "plzkthx71",
      "body": "Yes, cause same. My diagnosis is OSFED- other specified feeding or eating disorder. Or it can be labeled a purging disorder or EDNOS- eating disorder not otherwise specified. It’s very hard to fit the cookie cutter diagnosis criteria, so dont feel invalidated (like me with everything (: )",
      "created_utc": 1625332650.0,
      "score": 3,
      "context": [
        {
          "id": "h3whtd0",
          "author": "None",
          "body": "Tbh not sure myself but to a different extent because I have not talked about eds to my psychologist or psychiatrist and I don't think I qualify for the criteria of bulimia despite purging. Does that make sense?",
          "created_utc": 1625301503.0
        }
      ]
    }
  ]
}