{
  "id": "od5yuo",
  "subreddit": "bulimia",
  "author": "bulimichoe",
  "created_utc": 1625344968.0,
  "title": "I don't want a normal diet",
  "selftext": "I want huge meals and food orgies that fill the void in my heart. Feeling full and having occasional snacks is not enough, I need to stuff myself like a pig to fully satisfy every craving and then purge it all.  I neeeed that gross pleasure I get from touching a stomach that is flat despite having eaten a whole ass cake an hour ago. Like I got away with it all. \n\nHaving a shitty day and knowing that when I finish my shift I can go buy out the entire grocery store. Feeling excited on the car ride home knowing I'm about to b/p. \n\nThis is literally all I have and the only thing I look forward to in my everyday life. I'm b/p free for 3 days but for what reason? I'm miserable. I just want that tiny pathetic little joy of watching my tv shows and eating. FUCK",
  "url": "https://www.reddit.com/r/bulimia/comments/od5yuo/i_dont_want_a_normal_diet/",
  "score": 194,
  "num_comments": 10,
  "comments": [
    {
      "id": "h3yu174",
      "author": "CokeNWhatNot",
      "body": "God I relate so fucking hard it hurts lol",
      "created_utc": 1625352963.0,
      "score": 30,
      "context": []
    },
    {
      "id": "h3yx5wu",
      "author": "NutelllaBellla",
      "body": "Same here. Like I'm too socially awkward to make friends so all I look forward to that distracts from my depression is bulimia. But I also have goals that my bulimia has been getting in the way of  ) :",
      "created_utc": 1625354811.0,
      "score": 21,
      "context": []
    },
    {
      "id": "h3z70my",
      "author": "None",
      "body": "My dietician and sports doctor called me out on this, they call it planned bingeing. I didn’t realize I even did it- that I’d plan all of the food I’d buy and what I’d do while eating it. It’s something I look forward to, and hopefully one day that will be past tense. A good b/p after a long day is, shamefully, one of my favorite things too :/ Long-term I know being healthy is more sustainable and better for me but fuuuuuck I don’t know if I could honestly say that I’ll never not have bulimia 😭🙃🙃🙃",
      "created_utc": 1625360832.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h40w311",
      "author": "medusamuser",
      "body": "I can’t imagine my life any differently than this! I don’t want one cookie as a treat - I want the whole fucking pack. And then I don’t want the consequences!!!",
      "created_utc": 1625407796.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h3zznfo",
      "author": "None",
      "body": "I was like that, but I promise it can change. The first couple of weeks is always horrible.",
      "created_utc": 1625380760.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h429gwy",
      "author": "esoterique87",
      "body": "Three days binge/purge free is amazing! That is really difficult and you should congratulate yourself. I totally know how you feel. For a long time one of my favorite things to do was buy binge food, binge and watch Netflix, then purge. Then that became the only thing I wanted to do, all day, every day. Those were some of the worst days that eventually lead me to my rock bottom.   \nI know what it feels like to want to escape your life, to feel good even just for a little while. It seems like it's all you have, and that is because you have made it your whole world. What is so bad in your life that you are seeking to numb or escape from? For me it was loneliness, feeling lost or without purpose, feeling left behind and feeling inadequate. I realized what I really wanted wasn't binging and purging. I wanted friends, I wanted to travel and experience things, I wanted a passion, I wanted connection and I wanted to let my creativity grow. When you look beyond the food and the temporary pleasure it gives, what do you really want out of your life? What is binging and purging taking the place of? I promise there is more to life than bulimia. The good news is that you get to decide what takes its place. ❤️",
      "created_utc": 1625432444.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h4bqbzg",
      "author": "eaklv",
      "body": "I feel this but after 5 days or resisting urges I gave in today and it was VERY underwhelming and I feel gross and sick. I kind of enjoy eating better and feeling good more than this. I'm going to be bloated and super swollen tomorrow now too, not worth it!\n\nEdit:\nEating 4x a day, 3 Meals with a snack between lunch and dinner was actually really nice and I looked forward to planning my meals each day. I think that really helped me. I tried not to give into restricting too low, so I felt pretty satisfied after 2-3 days. It felt Soo nice. I only slipped because of bloating/body image stuff.",
      "created_utc": 1625636840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3zw8p5",
      "author": "luca-nicoletti",
      "body": "I don't think you really do enjoy those things. You might enjoy that momentary pleasure, but what is the cost of it? Aren't there too many costs? Isn't it too dangerous, problematic, unhealthy and fucking up your life? Aren't you giving up on perhaps enjoyable (and even more enjoyable) moments with friends, family, and random people?",
      "created_utc": 1625377838.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h42cn4b",
      "author": "epitomeofsanity",
      "body": "i felt this in my soul\n\nhow is moderation every satisfying? all or nothing damnit",
      "created_utc": 1625434071.0,
      "score": 4,
      "context": [
        {
          "id": "h40w311",
          "author": "medusamuser",
          "body": "I can’t imagine my life any differently than this! I don’t want one cookie as a treat - I want the whole fucking pack. And then I don’t want the consequences!!!",
          "created_utc": 1625407796.0
        }
      ]
    },
    {
      "id": "h47rs95",
      "author": "wafflerain5",
      "body": "How did it change?\n\n\nLike I wake up and the first thing I think about is food and the only thing I look forward to is food. What do you look forward to now.",
      "created_utc": 1625557808.0,
      "score": 2,
      "context": [
        {
          "id": "h3zznfo",
          "author": "None",
          "body": "I was like that, but I promise it can change. The first couple of weeks is always horrible.",
          "created_utc": 1625380760.0
        }
      ]
    }
  ]
}