{
  "id": "oh000r",
  "subreddit": "bulimia",
  "author": "flight1411",
  "created_utc": 1625850580.0,
  "title": "Dentist wanting to help",
  "selftext": "Hi everyone! Yesterday a patient came in to my clinic for an exam. Very sweet young lady. I did notice some acid wear on her teeth that indicated bulimia but because there were others in the room with us I only let her know that I’m seeing acid wear and gave her general tips on how to protect her teeth from acid. Once the others left the room she did confide in me that she is suffering from bulimia. I am grateful that she felt comfortable enough to share this with me and I recognize how difficult it can be to admit it. I didn’t want her to feel like I was lecturing her but I also want her to be aware of how bulimia is going to severely effect her teeth.\n\nWhat I’m trying to figure out is from the people that you’ve opened up to about being bulimic, what do you wish they would have done for you? What would have been helpful?And any recommendations on what I can do to help without overstepping \n\nThank you!\n\nEdit: I’ve gotten a few people ask about what to do to protect your teeth I figured I’d answer here to make it easier to access. The main damage occurs from the stomach acid being in the mouth. It breaks down the enamel very quickly. Especially if brushing happens right after. Best thing to do is to swish with water/ get a mouthwash with fluoride and swish with that. Try not to eat or brush until a good 30 mins- 1 hour after. Drink lots and lots of water. Also, fluoride is going to be your greatest protector against sensitivity. You can have trays made so that way you can put prescription strength fluoride tooth paste in it to wear for 30 mins a day.",
  "url": "https://www.reddit.com/r/bulimia/comments/oh000r/dentist_wanting_to_help/",
  "score": 128,
  "num_comments": 18,
  "comments": [
    {
      "id": "h4ma0xi",
      "author": "shiju333",
      "body": "Definately don't shame if they have cavities or other dental issues due to the bulimia. I've avoided dentists because of this.\n\nYou do sound super caring and kind. That is appreciated.",
      "created_utc": 1625855162.0,
      "score": 55,
      "context": []
    },
    {
      "id": "h4m9isx",
      "author": "YeahNoYeahMaybeNo",
      "body": "That is super kind of you. I have the sweetest of dentist myself, she knows, and I pay a visit at least once every 4 months. Its difficult to help as a dentist anymore then just fixing teeth I guess. Its a mental thing and fcking up your teeth is just collateral damage. Im living in a country were you have insurance, one time I was already over the budget for that year and my dentist said we will fix these two for free. That is something I will never forget. But dont know your financial position, so dont feel obligated or anything. Props to you reaching out here trying to help a client more than just repairing teeth.",
      "created_utc": 1625854924.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h4mc5v3",
      "author": "None",
      "body": "Please don’t give diet and exercise advice or make comments about body shape or size, positive or negative. Empathy and compassion for the emotional and mental torment is what’s needed more. Maybe have a list of local treatment centers or therapists that specialize in eating disorders to offer patients. Sometimes we just need that acknowledgment that we are “sick enough” to “deserve” help.",
      "created_utc": 1625856148.0,
      "score": 26,
      "context": []
    },
    {
      "id": "h4mwdgr",
      "author": "Alternative_Slip_808",
      "body": "How do you protect your teeth if you don't mind me asking? Also, props to you for being kind and understanding towards your patient!",
      "created_utc": 1625865813.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h4mykwr",
      "author": "cpmatpas",
      "body": "With bulimia you literally hate your body, so you either find one who doesn't even care about their teeth or those who are super scared that their smile will make them look even uglier.\nIn either case, please know that bulimia is a very complex mechanism and most probably your patient already knows rationally what to do, but simply can't.\nPlease don't make any comment about body shape or aspect, and just be kind and comprehensive, that's all it takes.\nWish you and your patient all the best!",
      "created_utc": 1625866909.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h4o21gz",
      "author": "flight1411",
      "body": "I really appreciate everyone’s feedback! Thank you for taking the time to respond. Thank you for the awards as well!\n\nMy heart goes out to you all and it saddens me that there have been dentists who weren’t sensitive to you as a human. It is very easy to get lost in the guarding and protecting of teeth, as that is literally our job. Can get a little tunnel visioned sometimes! Thankfully we aren’t all the same so I encourage you to keep looking for a dentist that you’re comfortable with. Let us help protect your teeth so it’s one less worry on your mind.\nIn the mean time, if you have any questions or concerns feel free to reach out. I really don’t mind.",
      "created_utc": 1625889868.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h4nfxld",
      "author": "AnaDion94",
      "body": "My dentist was one of the first people I told as well. She didn’t tell me the risks (I’m an adult in recovery who came to her specifically because of my ED and mentioned it on my forms, so she probably assumed I was aware), but did reiterate the things I can do to minimize damage and the sensitivity due to acid erosion. That was great and helped me to feel understood and not shamed. Like I was in a safe space.",
      "created_utc": 1625876706.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h4ng9v8",
      "author": "hallowmean",
      "body": "In my experience, the most helpful thing you can do is your job, Of course be non-judgmental and open, but don't feel like you need to talk with them about why they have an eating disorder, or give them tips about recovery. I've had people do that with me before, and the information is never helpful and comes across as condescending. Information about protecting teeth is super helpful though. Also, I hear that there's special fluorite toothpastes available, so maybe carrying them in your practice could be helpful if that's an option? \n\nI do give this advice as an adult already in therapy though, younger people or others who seem open to it might benefit from a discussion about their options for seeking help etc.  Honestly so long as you treat us with respect and understand that you won't fix us in an appointment, you'll be ok.",
      "created_utc": 1625876903.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h4n2v5s",
      "author": "feiturdrengur",
      "body": "When my dentist was alone with me I told her about my bulimia and asked her not to put it on my record because it felt a bit too personal. She was very compassionate and understanding. For some reason I was scared she would say something about my weight but she didn't which was a relief. She asked how long I've struggled with bulimia, whether I was in recovery or if I was still actively purging. She also asked me if I knew what damage vomiting will do to my teeth, to which I answered that I knew very well so she didn't explain them to me. She encouraged me to seek help for my eating disorder, but I told her I wasn't ready. She didn't push the subject any further, except that she explained the benefits of *not* purging (instead of hammering in the damage that purging does).\n\nShe then gave me some very helpful advice on how to care for my teeth, both in general and immediately after purging. What I found especially helpful was that she asked if I had depression and if it made it hard for me to brush my teeth, which is something I do struggle with. She then offered me some advice on how to minimize harm when I'm too depressed to brush my teeth, like drinking water after eating/binging and swishing it around in my mouth before I swallow.\n\nMy overall experience was that I was very nervous and felt like a piece of shit before the appointment, but because she listened to me and showed me compassion I felt like things weren't all that hopeless. I truly didn't expect it to be this good to open up to my dentist and I am so happy that I did. It's had a big impact on my life.\n\nPeople like you who care about your patients are wonderful. Thank you!",
      "created_utc": 1625869075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h4papuw",
      "author": "None",
      "body": "The best thing my dentist did for me was recognize that I wouldn’t be leaving her office cured of my bulimia just because she told me it would negatively impact my teeth, so she gave me advice on how to protect my teeth as much as I could until I would have the strength and means to recover, which I appreciated. Things like you said in the edit of this post.",
      "created_utc": 1625925950.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hy0ndtr",
      "author": "None",
      "body": "Not once, not once, did any dentist comment on my teeth.  How I wish I had someone - back then.  I was bulimic before the word was a word!!\n\nNot once, and of course I am now replacing everything.  I would have been unable to talk about my \"shame\" then.  I think now - internet, support groups, things will be better.  Isn't it  your \"job\" to help your patient, with your gentle suggestions.  If you see a medical situation in your dental chair... isn't it your responsibility to address it?  You're in a delicate dance with a patient - if only to save their teeth!!  Any help is still help.  So thank you for asking.",
      "created_utc": 1645565808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h4o5wrt",
      "author": "CottonCandySunset108",
      "body": "Hi! Im actually a recovered compulsive eater myself, and happened to be looking for people to help as part of my 12 step work, and I just happened to read this post. I’m actually a recovered Overeaters Anonymous sponsor, and follow the same 12 step program the pioneers of AA followed. The Big Book of Alcoholics may be a great resource on this subject, particularly the chapters The Doctors opinion and To Employers, because it can give you insight on how to help others that are suffering with a chronic compulsive eating illness, and how to bring up the conversation in a helpful manner. Also, I’m apart of an OA fellowship that has weekly phone meetings, and I would love to pass on my information and our groups information so you can refer patients. I wish someone could have given me this information years before I ended up in OA. I totally agree with what others have said about being careful not to lecture the patient. There is such a misunderstanding about the illness, just like alcoholism. Chronic types are unable to stop on their own, and it actually has nothing to do with lack of willpower. They have actually lost the power of choice to stop and stay stopped. Just like the chronic alcoholic uses alcohol for ease and comfort, a chronic compulsive eater uses food for ease and comfort, or purges/restricts. Really the best thing you can say, is that you care, and tell the patient that if they are having a hard time controlling their behaviors with food on their own, that you know someone who could possibly help. I would love to help answer any questions you may have, you can PM me anytime. Here is the website to our fellowship. Feel free to pass this on as well!   www.oabigbooksolutiongroup.org",
      "created_utc": 1625892550.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h4n2q55",
      "author": "HilaBeee",
      "body": "I am so thankful for dentists like you, and glad to know there are dentists like you out there that are respectful to our histories. \nI am aware of what bulimia has done to my teeth and was open about it to my dentist recently, yet she still asked if I had done any meth as such tooth decay does not happen in such young people unless they have been using such drugs. She then handed me a toothbrush, floss, and chlorhexidine. I felt very insecure and ashamed and I don't want to see her again. \nI think what you did is the response I wished I would have gotten.",
      "created_utc": 1625869002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4n8ab8",
      "author": "turnipkitty112",
      "body": "I wish my dentist had been this supportive. After I told him about my purging he just said I didn’t have much acid damage and left it at that. Would you mind sharing the info you gave your patient about protecting teeth? I would really appreciate it",
      "created_utc": 1625871972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4ncc3z",
      "author": "sweet_ging",
      "body": "this is so sweet…",
      "created_utc": 1625874296.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4ncwl9",
      "author": "esoterique87",
      "body": "That is such a great story and you sound like such a kind person. It makes me feel good to know there are dentists out there who are not only seeking to help but also to understand. I have avoided the dentist for years because I was afraid of being judged or shamed. Ideally I would want my dentist to focus on addressing any current issues and how to take care of my teeth in the future. One thing that is helpful to know is after vomiting, teeth should not be brushed for at least an hour to allow the acid conditions created in the mouth to settle down. If the teeth are brushed immediately after vomiting, acid is brushed directly into the tooth surface causing further destruction. It's best to rinse your mouth with water, mouthwash or a water and baking soda solution immediately after vomiting. \n\nYou can't stop someone from purging but you can treat immediate issues and help the person protect their teeth moving forward. Thanks for being so compassionate! ❤️",
      "created_utc": 1625874684.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4nq16x",
      "author": "gcitt",
      "body": "Please be very careful not to express judgement. I will often go long stretches between appointments because I'm embarrassed and overwhelmed. If a dentist gives me shit for it, I start looking for a new office. Recovery is a long term process, and the damage can be extensive and expensive. \n\n\n\nAlso praise improvement and positive habits. The dental hygienist who made me feel proud of my shrinking gum pockets absolutely made my week.",
      "created_utc": 1625882516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4ojeft",
      "author": "Turtle_data",
      "body": "This is great, I've told a couple of dentists and it's always been so nerve-wracking. Non-judgemental advice on how to protect the teeth is always helpful :)",
      "created_utc": 1625903624.0,
      "score": 1,
      "context": []
    }
  ]
}