{
  "id": "oo5hdj",
  "subreddit": "bulimia",
  "author": "NotAveragebutAverage",
  "created_utc": 1626798434.0,
  "title": "5 days",
  "selftext": "5 days guys. 5 freaking days without bingeing or purging. I started to try to take initiative about 3 weeks ago. I’d make it about two days, and then give in, and then make it another two. There are a few things I’ve realized.. the bloating and cramping is still here, but it feels a little better with every day that passes. I’ve had one bowel movement, and it was small, but it’s progress. I’m taking a digestive supplement and drinking a glass of prune juice daily. I wake up every morning relieved that I didn’t give into the temptation the night before. It’s a bit like getting sober off of alcohol, really. Which is what it reminds me of at least. I eat two meals a day and I’m trying to eat foods that are easy on my gut and digestive friendly. When I have my meal around lunch time, I feel satiated, full, and finally energized. It’s the evening meal for me that has really been difficult. The fullness feeling in my stomach doesn’t feel satisfying and after finishing the healthy meal, I have an overwhelming desire to keep it going and head to a fast food joint or a gas station and eat until I’m ready to explode. Driving around while I battle these urges seems to help, or meeting up with my boyfriend and having a face to face distraction. I panic a little when he’s busy after my evening meal, because I’ve been relying on his company to help get me through the evening. I feel like shit after purging and I want to feel relaxed and comfortable while I’m with him. I had today off and I left his house around midnight last night. I very nearly drove to a fast food joint and pigged out, but I didn’t. I laid in my bed waiting for sleep to hit battling the desire to binge for about an hour. I’m proud of myself, but I’m finally able to see how truly hard this is going to be. Food still feels like my mortal enemy. If I could avoid it and still have energy for the day, I absolutely would. I know it’s only been a week, but it’s felt like a long one. I just know this is a battle I have to keep fighting.",
  "url": "https://www.reddit.com/r/bulimia/comments/oo5hdj/5_days/",
  "score": 92,
  "num_comments": 7,
  "comments": [
    {
      "id": "h5wdgb2",
      "author": "mitskiloves",
      "body": "i'm proud of you! 💗",
      "created_utc": 1626802450.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h5wjo95",
      "author": "inadaze319",
      "body": "I am so so proud of you for being able to find better ways to cope with your feelings besides b/ping. Something that has helped me out a lot on my journey through recovery is having a journal. It’s a good way to express your feelings and be able to change the way you speak with yourself. Be gentle and nice to yourself. You are trying so hard and you are doing such an amazing job!!!!",
      "created_utc": 1626805070.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h5xvpe6",
      "author": "efftheestablishment",
      "body": "So proud of you! You got this mate <3",
      "created_utc": 1626826443.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5ygxld",
      "author": "MonsterMamaLu",
      "body": "Been there myself, it gets easier!!!!  Just remember that if you slip up it DOES NOT negate the progress you’ve made.  Love and support xoxo",
      "created_utc": 1626836801.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5yicx0",
      "author": "Livid_Barber_8327",
      "body": "That’s amazing progress! Not only with the behavior change but the awareness of the urges as you experience them. \n\nSome days are easier and some are harder but over the long term it will get better. There’s only one way to find out.",
      "created_utc": 1626837515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h60ipnx",
      "author": "Catbug94",
      "body": "Very proud of you! Keep looking for more distractions too if you’re worried about attaching",
      "created_utc": 1626881943.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6371ot",
      "author": "phoenix061010",
      "body": "That is truly amazing I want to try but even the thought terrifies me between the urges n terrified of weight gain.",
      "created_utc": 1626925817.0,
      "score": 1,
      "context": []
    }
  ]
}