{
  "id": "oorsfg",
  "subreddit": "bulimia",
  "author": "KingDingSchlongDong",
  "created_utc": 1626880068.0,
  "title": "Can they just stop",
  "selftext": "My mum and dad were fat shaming my sister who is a chef and looooves food and always has. She is not overly obese but a little chubby. She has embraced her body and she has much more love for herself than i obviously do. She never compares herself to me and has been sooo patient wth my ED. I have told my parents on MULTIPLE occasions that fat shaming ppl and judging their appearances is not okay and they should learn to stop. This advice of course, goes over their heads.  Back to the story. Then my mum comments that since my sister drinks so much milk, she has grown(lit grew 3.5cm in height) and this way (elongating upward gestures wth both hands) and also this way(elongating width with both hands). Rude af. Then my dad adds on tht she should keep growing (copies height gesture) and stop growing (copies width gesture). Then he points to me and does the same. I blush and feel really embarrassed and angry. I am in the midst of recovery and have gained X pounds but nothing extreme.  Why do ppl push u to stop gaining weight but also dont want u to be anorexic?? Theyre like \"u look better! But pls stop growing xx\". They give me bullshit when i am too thin, they give me bullshit when im too fat. Pls stop ur causing so much fucking pain.",
  "url": "https://www.reddit.com/r/bulimia/comments/oorsfg/can_they_just_stop/",
  "score": 113,
  "num_comments": 11,
  "comments": [
    {
      "id": "h60iluo",
      "author": "Catbug94",
      "body": "That’s SO rude- please don’t listen to them even tho it’s really tough not to, your sister and you deserve WAY better than that kind of treatment",
      "created_utc": 1626881898.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h60k95p",
      "author": "None",
      "body": "Your parents are grossophobic as fuck ! Damn ! They need to understand that they are toxic and that they hurt you and your sister's feelings. \n\nAs a mum who struggles with ED since high school, i tried HARD to not be grossophobic with my daughters because i had an awful mum like that. \n\nI send you a wide hugs if you accept it. \n\nYou and your sister are GORGEOUS, you and your sister are QUEENS.",
      "created_utc": 1626882585.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h60jitb",
      "author": "LilacBloom32",
      "body": "Your parents are fcking horrible what the hell",
      "created_utc": 1626882279.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h62eu3f",
      "author": "kiwikgs",
      "body": "it took me a long time to start disregarding what my parents said. They tell me to lose weight but as an adult when I start losing weight they say I’m relapsing, when I’m just trying to do it in a healthy way?? Then I gain weight and they make even worse comments, which in turn makes me relapse!! It’s a horrible cycle I’m just starting to break, and I’ve been able to maintain and be content with food a lot more ever since. They make no sense, and I realized my mom is insecure and my dad is controlling, that parents aren’t always right and have their own issues to deal with, and to do what makes you happy and healthy. You are in recovery, please stay in recovery-Someone in recovery",
      "created_utc": 1626911566.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h60j4x1",
      "author": "StockReporter5",
      "body": "That fkn sucks, I’m glad u have each other",
      "created_utc": 1626882118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h61m1iw",
      "author": "suestions",
      "body": "YUP. its always jokes and comments about eating too much and them not wanting you to gain weight or become fat. but then they still give you shit when you don’t eat and make jokes about your body if you become really skinny. many of my family members do this, but i get especially offended when my parents act like this, when they KNOW i have an ED and that i have always struggled with low self esteem/body dysmorphia.",
      "created_utc": 1626898356.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h626yld",
      "author": "DoctorMojito",
      "body": "Your parents sound like they’re kinda comfortable being jerks, presumably because they think it’s for the greater good or something.\n\nBut for what it’s worth, many (if not most) people with overly critical or fat-shaming parents don’t have someone else in their family who will (A) stand up for them and (B) remind them that their parents’ opinions/comments aren’t OK. It sounds like you’re a really really great sibling and she’s lucky to have you. Even if you can’t control what your parents do, if you regularly talk supportively w/ your sister, that can counteract a lot of internalized shit (for both of you).",
      "created_utc": 1626907662.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h60jlzk",
      "author": "KingDingSchlongDong",
      "body": "Thanks. My sister and i havent saved up enough to move out but one day..",
      "created_utc": 1626882316.0,
      "score": 8,
      "context": [
        {
          "id": "h60iluo",
          "author": "Catbug94",
          "body": "That’s SO rude- please don’t listen to them even tho it’s really tough not to, your sister and you deserve WAY better than that kind of treatment",
          "created_utc": 1626881898.0
        }
      ]
    },
    {
      "id": "h60kqrk",
      "author": "KingDingSchlongDong",
      "body": "Thank you so much for the comforting words and the warmest hugs. They may mean well but i guess some ppl are meant for raising children and some ppl aren't",
      "created_utc": 1626882790.0,
      "score": 3,
      "context": [
        {
          "id": "h60k95p",
          "author": "None",
          "body": "Your parents are grossophobic as fuck ! Damn ! They need to understand that they are toxic and that they hurt you and your sister's feelings. \n\nAs a mum who struggles with ED since high school, i tried HARD to not be grossophobic with my daughters because i had an awful mum like that. \n\nI send you a wide hugs if you accept it. \n\nYou and your sister are GORGEOUS, you and your sister are QUEENS.",
          "created_utc": 1626882585.0
        }
      ]
    },
    {
      "id": "h60jq1x",
      "author": "Catbug94",
      "body": "You guys will get there I’m sure of it- I wish you both well",
      "created_utc": 1626882364.0,
      "score": 5,
      "context": [
        {
          "id": "h60iluo",
          "author": "Catbug94",
          "body": "That’s SO rude- please don’t listen to them even tho it’s really tough not to, your sister and you deserve WAY better than that kind of treatment",
          "created_utc": 1626881898.0
        },
        {
          "id": "h60jlzk",
          "author": "KingDingSchlongDong",
          "body": "Thanks. My sister and i havent saved up enough to move out but one day..",
          "created_utc": 1626882316.0
        }
      ]
    },
    {
      "id": "h60lngj",
      "author": "None",
      "body": "I don't think that they mean well, i really think that they were educated that way and they did not overcome their educations. \n\nBy example, i'm a shitty mother because i had a shitty childhood, BUT i try really hard to stop doing the same trauma i had, to my daughters. And it's not an easy road, it's way easier to just do the same shitty education that your parents gave you. \n\nAnd when you'll be older to leave, just go, don't feel guilty because they are your parents. You are allowed to not want to be part of your toxic parents's live. \n\nTry to be strong for yourself and start forgetting them.",
      "created_utc": 1626883175.0,
      "score": 3,
      "context": [
        {
          "id": "h60k95p",
          "author": "None",
          "body": "Your parents are grossophobic as fuck ! Damn ! They need to understand that they are toxic and that they hurt you and your sister's feelings. \n\nAs a mum who struggles with ED since high school, i tried HARD to not be grossophobic with my daughters because i had an awful mum like that. \n\nI send you a wide hugs if you accept it. \n\nYou and your sister are GORGEOUS, you and your sister are QUEENS.",
          "created_utc": 1626882585.0
        },
        {
          "id": "h60kqrk",
          "author": "KingDingSchlongDong",
          "body": "Thank you so much for the comforting words and the warmest hugs. They may mean well but i guess some ppl are meant for raising children and some ppl aren't",
          "created_utc": 1626882790.0
        }
      ]
    }
  ]
}