{
  "id": "osw4ho",
  "subreddit": "bulimia",
  "author": "Asnora",
  "created_utc": 1627422771.0,
  "title": "Bulimia & dating... lets share?",
  "selftext": "First boyfriend held my hair back and helped me throw up, he said that \"if this is how you wanna lose weight that's fine\" and encouraged it, enabled it, even forced it sometimes. \n\nSecond boyfriend hated it, avoided it, didn't let me talk about it, shamed me and called me disgusting.\n\nThird, and current boyfriend... he goes to the store every day so that we don't keep snacks or anything binge-y in the house, he knows the difference between me buying binge food and me buying healthy food. When I come out of the bathroom after throwing up he has my water bottle, my blanket, my phone, my favorite show playing, my mints, and the heater on full blast. I love him for knowing how to support me, *without* supporting my disorder. \n\nHow have you guys experienced bulimia in your relationships?",
  "url": "https://www.reddit.com/r/bulimia/comments/osw4ho/bulimia_dating_lets_share/",
  "score": 337,
  "num_comments": 56,
  "comments": [
    {
      "id": "h6rc6im",
      "author": "gouachedangit",
      "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
      "created_utc": 1627423741.0,
      "score": 90,
      "context": []
    },
    {
      "id": "h6romed",
      "author": "S-Wizzy",
      "body": "My then-boyfriend found out about my ED and was very supportive of me, and discouraged the disease. After a few weeks of him knowing, something finally clicked that I was more than my disease. The long 4 year struggle that I had desperately tried to stop many times, finally came to an end, and I never looked back. \n\nEven though that boyfriend did countless shitty things in our two years of dating, I’ve never been able to slightly hate him. For all the pain he caused, he most importantly saved my life, and I am eternally grateful. \n\nNot to sound cliche or condescending - but I hope that all of you struggling remember that you’re more that this, and even if you’re not ready for help yet, don’t give up hope that there is light at the end of this struggle you’re on, and you’re not alone.",
      "created_utc": 1627429608.0,
      "score": 22,
      "context": []
    },
    {
      "id": "h6s4xns",
      "author": "AllOkJumpmaster",
      "body": "It’s is my personal al opinion that one should not be in a relationship with someone when they are not at least in recovery. Even if you are in a loving relationship with someone who supports you but not the disordered behavior it is extremely hard on the relationship and it is selfish and will ultimately be too much of a strain on it. Before you @ me and get all pissed off, remember it is just my personal opinion based on years of my own and anecdotal experience. I just could not even fathom expecting another person to put up with all of the aspects of it, and especially the wilfully destroying ones own body component",
      "created_utc": 1627437684.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h6rulzg",
      "author": "rrrachel_rocks",
      "body": "My ex husband used my bulimia as an excuse or “pass” to continue his coke habit. His addiction fed off mine and vice versa. Toxicity on both ends, lies on both ends.\n\nCurrent partner knows about my past. Keeping myself accountable helps in my recovery. So, I will sometimes make comments like “oh I could never eat x food w/o puking” while being okay with x food now. I do joke that my blow job abilities should be in thanks to bulimia 🤪",
      "created_utc": 1627432555.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h6rf4z9",
      "author": "None",
      "body": "I wouldn’t say we are actually dating, more like taking, but this guy is like super special to me, right? Well, I opened up to him about how sometimes I “fast recreationally to reset my metabolism.” And ong, he was the sweetest, he’s not too aware of my ED but he was like “You don’t need to fast, you’re fine just as you are.” I mean that may not sound so lovey dovey, but it was the first recognition and kindness I had received from someone regarding my ED habits.",
      "created_utc": 1627425112.0,
      "score": 26,
      "context": []
    },
    {
      "id": "h6rglpe",
      "author": "HilaBeee",
      "body": "My bulimia started as a result of an affair of my second partner. My third didn't know. My current knows Im bulimic and discourages it. Sees it as \"wasteful\". Doesn't know I occasionally purge still. We make jokes about it though to make light of it. My girlfriend is also bulimic (though mostly recovered) and she understands me more.",
      "created_utc": 1627425794.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h6rh2au",
      "author": "FlowerGardenBee",
      "body": "One bf encouraged my fasting. Another encouraged my bingeing (people with fat fetishes are real and just as gross as people with malnourished fetishes). My husband now is very supportive of my recovery and doesn't shame me on my bad days <3",
      "created_utc": 1627426010.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h6rfpvl",
      "author": "bloomvicky",
      "body": "im extremely lonely so i cant answer",
      "created_utc": 1627425379.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h6rul5s",
      "author": "AnaDion94",
      "body": "My boyfriend knows. We’re long distance and he was unaware during my bad bout last year bit now I’m in recovery so I’m more willing to be open about it. He’s pretty good- gentle reminders to eat and take care of myself, but doesn’t mother. Sometimes I have to explain to him that certain things aren’t okay but he gets it pretty quickly (for instance, he texted his friends about how much I ate for lunch this weekend and I had to explain to him that allowing myself to eat a large meal without bingeing or triggering a purge is actually a huge win and not a punchline) and usually addresses his behavior.",
      "created_utc": 1627432544.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6s2j8f",
      "author": "howdyonedirection",
      "body": "I actually sorta talked about this in a post the other day lol. I told my boyfriend (and my mom) after having a breakdown about it because it hurts living like this and he was extremely worried / concerned which was nice. the next day we were over at his house going to the store to make homemade pasta and I said I wanted some cookie dough and he said as long as I don’t gag on it. lol ouch that one hurt. I broke down in the car and he actually had to pull over because I was seriously in shambles. safe to say he learned his lesson about making a joke about that lol. \n\nLuckily he’s also been supportive about it because I think he knows my problem really stems from being home alone and getting to purge in private, but I will not do it in front of him. So whenever I’m with him he let’s me eat good food with him because he knows I won’t be getting it out of me",
      "created_utc": 1627436489.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6sa0aq",
      "author": "blue-pixie-",
      "body": "Wow that first bf you had is wild to me! \nBut your current bf sounds like a dream come true 😢I’m happy for you :)\n\nMy first bf sat outside the bathroom and cried once like a puppy, that was kind of nice but he tried to stop me from doing it.\n\nSecond bf tried to stop me from doing it but in a mean way. Would sometimes get mad about me doing it “in his house” which was evil, I had to sneak it or go to a public place. He even put his sexual needs before it and in between binging and purging I had to please him. The only good thing is he would cuddle me when I was done.",
      "created_utc": 1627440250.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6swdb9",
      "author": "jesss_ie",
      "body": "The few that found out just yelled at me for it. Then it wasn’t spoken of again. I’m going to stay single and get more cats now.",
      "created_utc": 1627454248.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6sdf9b",
      "author": "None",
      "body": "None of my exes knew , didnt tell any of them\n\nCurrent boyfriend knows , he doesnt know how to help. Celebrates / is happy for me anytime i eat anything even if i restrict myself to 500 calories or less. I dont talk to him about it beyond that ; he doesnt bring it up.",
      "created_utc": 1627442064.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h6sgcgw",
      "author": "Reality_Rose",
      "body": "My husband is the first person told after my doctor and two therapists. I was good at hiding it and went through phases of being worse and better. Also men can be very oblivious.",
      "created_utc": 1627443650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h6t5aqn",
      "author": "fknlowlife",
      "body": "Most of the time, my bf is very sweet and supportive, for example by distracting me when I have a strong urge to purge or by reminding me that me thinking I'll gain weight from one meal isn't realistic, but since he has an ED himself (we often joke that together we're the perfect bulimiac since he has a problem with binge eating & I purge very often),  sometimes when he has had a bad he encourages me to do so & complains about how much he envies me because he cannot force himself to throw up.",
      "created_utc": 1627461914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h6rdx7c",
      "author": "NotAveragebutAverage",
      "body": "My boyfriend doesn’t even know about it 🤣",
      "created_utc": 1627424544.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6rnnl1",
      "author": "Puzzleheaded-Sleep33",
      "body": "i am happy he is able to provide that support for you! \n\nmy ex on the other hand would get mad at me when i told him i restricted all day 🤙",
      "created_utc": 1627429140.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h6rgncw",
      "author": "pastelrose7",
      "body": "First two bfs didn’t know about it, but the second one always made jokes abt me never eating. My current bf always checks in on me when I mention I’m ordering food because he’s worried i’ll binge, he checks in on me when we’re eating especially if I go to the bathroom, and brought me breakfast after a sleepover because he wanted me to eat.",
      "created_utc": 1627425816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6rkrov",
      "author": "victoriousbbyg",
      "body": "Some knew. Current knows I used to be unwell but not that I am now. Told a joke to my mum and I last christmas about bulimia seemingly forgetting he knew about my “past”. Kinda not keen to tell him given that. You’re mad lucky you got a keeper there my friend",
      "created_utc": 1627427766.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6s7h9s",
      "author": "YeahNoYeahMaybeNo",
      "body": "Im a dude, can I have the number of your first boy? Just kidding. I dont date a lot, always been kinda on my own. I feel not super comfortable in social things, I do them, but lots of meh. I swipe a bit on the tinder, but only met once with a girl, which was also meh. Yeah, happy for you that you have someone you love looking over you, really nice 💪",
      "created_utc": 1627438962.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6so9of",
      "author": "juniormvarsity",
      "body": "My ex knew but not about how severe it was until he caught on. It ended up completely breaking his heart (and mine) and ruined our relationship. It was traumatic and I regret staying in denial and blaming all of our issues on everything BUT my ed. He cried once and told me he wished I could see myself like he sees me. That line still has me thinking hes meant to be my husband-but there was a lot of other toxicity involved (we are both sober alcoholics with a lot of mental health issues). My current boyfriend was very aloof at first but I told him about it and he could tell it was get worse-not because he ever heard me-but because of how depressed, irritable, anxious I became. He supported me through residential. I told him if he needed to leave me I would understand but he stuck by my side. I did slip when I got out of res and he was angry. His anger was just masked sadness. Anyway, I personally don’t think being in a relationship will in active ED or early recovery is good, but here I am. I wish ED handed destroyed my relationship with my x. And I wished it hadn’t affected my currently relationship but all I can continue to do is stay in recovery one day at a time. After my slip I did make a decision to break up with him IF I slipped again because I don’t want to cause more harm. The added stressors of a relationship can trigger ED, and for me, the guilt and shame of not only failing myself but others as well is capitalized while in a relationship.",
      "created_utc": 1627448417.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6szfy4",
      "author": "cr7n9",
      "body": "this is the best relationship💕 i hope you stay together🥰",
      "created_utc": 1627456769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6t3kwh",
      "author": "sadgab_",
      "body": "me and my ex had become pretty codependent and both had anxiety (mine being the ed) and she would take on a lot of guilt whenever she would know I purged or did anything and then obviously the weight of that eventually became too much. but also when I was that sick I was manipulative to everyone close to me just so I could continue behaviors. at least my ex forced me in seeking help so I got into a program. I didn’t get better until after the break up but being already apart of a program is what actually got me to recover in the long run",
      "created_utc": 1627460353.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7b5nqu",
      "author": "Catbug94",
      "body": "Wow the evolution- I’m glad you have your current bf, I’ve never had an official partner but it’s cuz I’m afraid they will find me disgusting",
      "created_utc": 1627823318.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6tjakg",
      "author": "sichengdnog",
      "body": "My very first proper relationship was very much the same as yours. Hun and his whole family enabled my eating disorder. They would make me feel super shit about it at times, screaming in my face that I’m worthless and I’ll never go anywhere in life. Whilst I was at my lowest weight my ex actually told me he didn’t want me to gain weight and for me to not change.\n\n\nMy current relationship is a lot better. I told him about everything the first day we met (after talking for a few weeks on text) so he would know exactly what he was getting himself into. I was told that I’d be caught me throwing up around him, he would leave. Purely because he didn’t want me killing myself anymore, now I look back on it… probably wasn’t the best thing to tell me but three years down the line it worked!! He doesn’t really know how to help though. He’s never been with anybody or had friends who are recovering from an Ed and also have severe depression. It’s hard, I actually try not even speak about my eating disorder now. It’s just hassle to everybody",
      "created_utc": 1627473209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6tr67f",
      "author": "None",
      "body": "stay w the third guy please :)",
      "created_utc": 1627477769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6uj6dw",
      "author": "Ace_of_rainbows",
      "body": "For the only one I’ve been in, I was kinda in a recovery stage at the time, and it was something we just never really talked about, and when I was essentially just left behind with other mental health issues, it came back briefly",
      "created_utc": 1627490096.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6rfgz2",
      "author": "Asnora",
      "body": "Sounds like you had some shitty partners too, sorry. Hopefully you find someone who understands you better soon :) someone who actually tries to understand.",
      "created_utc": 1627425266.0,
      "score": 17,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        }
      ]
    },
    {
      "id": "h6sdjc4",
      "author": "None",
      "body": "Uhh there are trans women who struggle with eating disorders , esp because eds are super prevalent in the trans community",
      "created_utc": 1627442126.0,
      "score": 10,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        }
      ]
    },
    {
      "id": "h6rsca4",
      "author": "Asnora",
      "body": "This is so refreshing to read, a lot of people talk in a really black and white way about their relationships (past or current) like they're either the most wonderful person or they're the worst. It's refreshing to read about a guy who was shitty but did something good.",
      "created_utc": 1627431439.0,
      "score": 13,
      "context": [
        {
          "id": "h6romed",
          "author": "S-Wizzy",
          "body": "My then-boyfriend found out about my ED and was very supportive of me, and discouraged the disease. After a few weeks of him knowing, something finally clicked that I was more than my disease. The long 4 year struggle that I had desperately tried to stop many times, finally came to an end, and I never looked back. \n\nEven though that boyfriend did countless shitty things in our two years of dating, I’ve never been able to slightly hate him. For all the pain he caused, he most importantly saved my life, and I am eternally grateful. \n\nNot to sound cliche or condescending - but I hope that all of you struggling remember that you’re more that this, and even if you’re not ready for help yet, don’t give up hope that there is light at the end of this struggle you’re on, and you’re not alone.",
          "created_utc": 1627429608.0
        }
      ]
    },
    {
      "id": "h6s9exv",
      "author": "Asnora",
      "body": "I hope no one comes for you, because I completely agree with your opinion... every aspect of a person who is in the middle of a bulimic hell-storm is erratic, irrational, and filled with way too much emotion for there to be enough room for a *healthy* relationship.\n\nThere's definitely room for something, because everyone wants love even if it's a bad time, but it will never be healthy when your life is the equivalent of being stuck in a storm cycle that changes by the hour. No matter how healthy and nice you try to be, you'll always be dragging your partner out into the storm with you. It's the same as being with anyone who has an ongoing addiction.\n\nBeing in recovery means they are supporting you towards being better, which makes them a great partner. Not being in recovery puts them in some kind of limbo where they aren't okay with it, but they kind of have to be, and they don't know what to do, but even if you tell them what to do, is it morally right for them to accept and just enable the disorder? Nope, so you're putting them in a bad position, and they're putting themselves in a bad position too.",
      "created_utc": 1627439943.0,
      "score": 17,
      "context": [
        {
          "id": "h6s4xns",
          "author": "AllOkJumpmaster",
          "body": "It’s is my personal al opinion that one should not be in a relationship with someone when they are not at least in recovery. Even if you are in a loving relationship with someone who supports you but not the disordered behavior it is extremely hard on the relationship and it is selfish and will ultimately be too much of a strain on it. Before you @ me and get all pissed off, remember it is just my personal opinion based on years of my own and anecdotal experience. I just could not even fathom expecting another person to put up with all of the aspects of it, and especially the wilfully destroying ones own body component",
          "created_utc": 1627437684.0
        }
      ]
    },
    {
      "id": "h6rzm0j",
      "author": "phoenix061010",
      "body": "Wow that is similar to my current BF who is an alcoholic  but constantly  tells me about my bulimia and how I'm killing myself but idk how anyone can really have a healthy relationship if we are sick I know my current relationship is not healthy as I ranted in a post earlier. I've also heard and in my experience is true for me that \"sick people people are attracted to other sick people \". Again I'm only speaking from personal experience.",
      "created_utc": 1627435037.0,
      "score": 12,
      "context": [
        {
          "id": "h6rulzg",
          "author": "rrrachel_rocks",
          "body": "My ex husband used my bulimia as an excuse or “pass” to continue his coke habit. His addiction fed off mine and vice versa. Toxicity on both ends, lies on both ends.\n\nCurrent partner knows about my past. Keeping myself accountable helps in my recovery. So, I will sometimes make comments like “oh I could never eat x food w/o puking” while being okay with x food now. I do joke that my blow job abilities should be in thanks to bulimia 🤪",
          "created_utc": 1627432555.0
        }
      ]
    },
    {
      "id": "h6rz0j2",
      "author": "Shiroi_momo",
      "body": "That double toxicity really kills. Used to say if they smoked I would get to purge, but it just turned into hatred towards both addictions. They wouldn’t care if I purged and I didn’t care if they smoked anymore. \n\nI only really ask for help or talk to my partner about it when I’m at my low, but more so when I’ve had big wins! Focusing on the positives is much better than letting the negatives get to my head and begin another vicious cycle of b/p.\n\nBut those bj skills! Less gag reflex for sure haha! 😆",
      "created_utc": 1627434741.0,
      "score": 8,
      "context": [
        {
          "id": "h6rulzg",
          "author": "rrrachel_rocks",
          "body": "My ex husband used my bulimia as an excuse or “pass” to continue his coke habit. His addiction fed off mine and vice versa. Toxicity on both ends, lies on both ends.\n\nCurrent partner knows about my past. Keeping myself accountable helps in my recovery. So, I will sometimes make comments like “oh I could never eat x food w/o puking” while being okay with x food now. I do joke that my blow job abilities should be in thanks to bulimia 🤪",
          "created_utc": 1627432555.0
        }
      ]
    },
    {
      "id": "h6slojp",
      "author": "5noozeybabe",
      "body": "I make the same joke! It’s so bad but hilarious at the same time",
      "created_utc": 1627446769.0,
      "score": 3,
      "context": [
        {
          "id": "h6rulzg",
          "author": "rrrachel_rocks",
          "body": "My ex husband used my bulimia as an excuse or “pass” to continue his coke habit. His addiction fed off mine and vice versa. Toxicity on both ends, lies on both ends.\n\nCurrent partner knows about my past. Keeping myself accountable helps in my recovery. So, I will sometimes make comments like “oh I could never eat x food w/o puking” while being okay with x food now. I do joke that my blow job abilities should be in thanks to bulimia 🤪",
          "created_utc": 1627432555.0
        }
      ]
    },
    {
      "id": "h6tnb6i",
      "author": "Glenchables",
      "body": "hahahahaah",
      "created_utc": 1627475667.0,
      "score": 1,
      "context": [
        {
          "id": "h6rulzg",
          "author": "rrrachel_rocks",
          "body": "My ex husband used my bulimia as an excuse or “pass” to continue his coke habit. His addiction fed off mine and vice versa. Toxicity on both ends, lies on both ends.\n\nCurrent partner knows about my past. Keeping myself accountable helps in my recovery. So, I will sometimes make comments like “oh I could never eat x food w/o puking” while being okay with x food now. I do joke that my blow job abilities should be in thanks to bulimia 🤪",
          "created_utc": 1627432555.0
        }
      ]
    },
    {
      "id": "h6rfsn2",
      "author": "Asnora",
      "body": "Sweet :)",
      "created_utc": 1627425415.0,
      "score": 6,
      "context": [
        {
          "id": "h6rf4z9",
          "author": "None",
          "body": "I wouldn’t say we are actually dating, more like taking, but this guy is like super special to me, right? Well, I opened up to him about how sometimes I “fast recreationally to reset my metabolism.” And ong, he was the sweetest, he’s not too aware of my ED but he was like “You don’t need to fast, you’re fine just as you are.” I mean that may not sound so lovey dovey, but it was the first recognition and kindness I had received from someone regarding my ED habits.",
          "created_utc": 1627425112.0
        }
      ]
    },
    {
      "id": "h6rhcet",
      "author": "Asnora",
      "body": "Interesting that your girlfriend is bulimic, I've never had any friends with an ED, is it ever a bad influence or always good?",
      "created_utc": 1627426141.0,
      "score": 6,
      "context": [
        {
          "id": "h6rglpe",
          "author": "HilaBeee",
          "body": "My bulimia started as a result of an affair of my second partner. My third didn't know. My current knows Im bulimic and discourages it. Sees it as \"wasteful\". Doesn't know I occasionally purge still. We make jokes about it though to make light of it. My girlfriend is also bulimic (though mostly recovered) and she understands me more.",
          "created_utc": 1627425794.0
        }
      ]
    },
    {
      "id": "h6rk87a",
      "author": "Asnora",
      "body": "Happy that you found the right guy :)\n\nThat's exactly what I wanted too, someone that supports and actively helps in my recovery, but also isn't disappointed in me and doesn't shame me when I relapse. Like they understand that recovery is not a linear process. Being there for me on my bad days is essential to getting back on track to the good days :)",
      "created_utc": 1627427506.0,
      "score": 6,
      "context": [
        {
          "id": "h6rh2au",
          "author": "FlowerGardenBee",
          "body": "One bf encouraged my fasting. Another encouraged my bingeing (people with fat fetishes are real and just as gross as people with malnourished fetishes). My husband now is very supportive of my recovery and doesn't shame me on my bad days <3",
          "created_utc": 1627426010.0
        }
      ]
    },
    {
      "id": "h6rrbox",
      "author": "hallowmean",
      "body": " same :-D",
      "created_utc": 1627430938.0,
      "score": 8,
      "context": [
        {
          "id": "h6rfpvl",
          "author": "bloomvicky",
          "body": "im extremely lonely so i cant answer",
          "created_utc": 1627425379.0
        }
      ]
    },
    {
      "id": "h6u9zj5",
      "author": "phoenix061010",
      "body": "Ur post touched my heart DM me anytime I'm in a relationship for many years 10+ but very lonely he has mentally checked out.",
      "created_utc": 1627486320.0,
      "score": 2,
      "context": [
        {
          "id": "h6rfpvl",
          "author": "bloomvicky",
          "body": "im extremely lonely so i cant answer",
          "created_utc": 1627425379.0
        }
      ]
    },
    {
      "id": "h6tmffs",
      "author": "Ryuwu93",
      "body": "Ngl that sounds v toxic :/ You deserve someone who respects you and discourages the negative behavior in a loving way or at least not like that...",
      "created_utc": 1627475159.0,
      "score": 4,
      "context": [
        {
          "id": "h6sa0aq",
          "author": "blue-pixie-",
          "body": "Wow that first bf you had is wild to me! \nBut your current bf sounds like a dream come true 😢I’m happy for you :)\n\nMy first bf sat outside the bathroom and cried once like a puppy, that was kind of nice but he tried to stop me from doing it.\n\nSecond bf tried to stop me from doing it but in a mean way. Would sometimes get mad about me doing it “in his house” which was evil, I had to sneak it or go to a public place. He even put his sexual needs before it and in between binging and purging I had to please him. The only good thing is he would cuddle me when I was done.",
          "created_utc": 1627440250.0
        }
      ]
    },
    {
      "id": "h6rfj1g",
      "author": "Asnora",
      "body": "Yikes, that would be hard to hide living together, so do you guys live separate?",
      "created_utc": 1627425292.0,
      "score": 7,
      "context": [
        {
          "id": "h6rdx7c",
          "author": "NotAveragebutAverage",
          "body": "My boyfriend doesn’t even know about it 🤣",
          "created_utc": 1627424544.0
        }
      ]
    },
    {
      "id": "h6vb2gb",
      "author": "NotAveragebutAverage",
      "body": "We don’t live together… but if you’re desperate enough to hide it, you find a way. The apparent “well functioning” of my life is dependent upon the glossy image/facade I put out into the world.. to my family, colleagues, friends, boyfriend… etc. Is it healthy or beneficial to my own personally recovery in any way? Probably not, lol. But I refuse to appear messy.",
      "created_utc": 1627501698.0,
      "score": 2,
      "context": [
        {
          "id": "h6rdx7c",
          "author": "NotAveragebutAverage",
          "body": "My boyfriend doesn’t even know about it 🤣",
          "created_utc": 1627424544.0
        }
      ]
    },
    {
      "id": "h6rh27m",
      "author": "Asnora",
      "body": "ED jokes are so hit or miss... like sometimes it's funny and it's fine to say whatever they said, other times it can cause a massive spiral, yikes. Current bf sounds lovely tho :)",
      "created_utc": 1627426009.0,
      "score": 3,
      "context": [
        {
          "id": "h6rgncw",
          "author": "pastelrose7",
          "body": "First two bfs didn’t know about it, but the second one always made jokes abt me never eating. My current bf always checks in on me when I mention I’m ordering food because he’s worried i’ll binge, he checks in on me when we’re eating especially if I go to the bathroom, and brought me breakfast after a sleepover because he wanted me to eat.",
          "created_utc": 1627425816.0
        }
      ]
    },
    {
      "id": "h6s8n6j",
      "author": "Asnora",
      "body": "Haha, trust me you don't want to be around him :L\n\nKeep swiping and looking, you'll meet someone :)",
      "created_utc": 1627439548.0,
      "score": 3,
      "context": [
        {
          "id": "h6s7h9s",
          "author": "YeahNoYeahMaybeNo",
          "body": "Im a dude, can I have the number of your first boy? Just kidding. I dont date a lot, always been kinda on my own. I feel not super comfortable in social things, I do them, but lots of meh. I swipe a bit on the tinder, but only met once with a girl, which was also meh. Yeah, happy for you that you have someone you love looking over you, really nice 💪",
          "created_utc": 1627438962.0
        }
      ]
    },
    {
      "id": "h6sk4kw",
      "author": "gouachedangit",
      "body": "thank you <3 third time's the charm or smth. tbh, im kinda over dating men, currently looking for a fellow enby or a gf haha",
      "created_utc": 1627445827.0,
      "score": 8,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        },
        {
          "id": "h6rfgz2",
          "author": "Asnora",
          "body": "Sounds like you had some shitty partners too, sorry. Hopefully you find someone who understands you better soon :) someone who actually tries to understand.",
          "created_utc": 1627425266.0
        }
      ]
    },
    {
      "id": "h6sk0kt",
      "author": "gouachedangit",
      "body": "im sure! i'm a trans afab person and didn't mean to imply that cis women have it the worst or anything. but a lot of ppl who are socialized male (ESP cis men) just aren't great at dealing with ed stuff, idk",
      "created_utc": 1627445760.0,
      "score": 12,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        },
        {
          "id": "h6sdjc4",
          "author": "None",
          "body": "Uhh there are trans women who struggle with eating disorders , esp because eds are super prevalent in the trans community",
          "created_utc": 1627442126.0
        }
      ]
    },
    {
      "id": "h6tnl2l",
      "author": "Glenchables",
      "body": "right!",
      "created_utc": 1627475824.0,
      "score": 3,
      "context": [
        {
          "id": "h6romed",
          "author": "S-Wizzy",
          "body": "My then-boyfriend found out about my ED and was very supportive of me, and discouraged the disease. After a few weeks of him knowing, something finally clicked that I was more than my disease. The long 4 year struggle that I had desperately tried to stop many times, finally came to an end, and I never looked back. \n\nEven though that boyfriend did countless shitty things in our two years of dating, I’ve never been able to slightly hate him. For all the pain he caused, he most importantly saved my life, and I am eternally grateful. \n\nNot to sound cliche or condescending - but I hope that all of you struggling remember that you’re more that this, and even if you’re not ready for help yet, don’t give up hope that there is light at the end of this struggle you’re on, and you’re not alone.",
          "created_utc": 1627429608.0
        },
        {
          "id": "h6rsca4",
          "author": "Asnora",
          "body": "This is so refreshing to read, a lot of people talk in a really black and white way about their relationships (past or current) like they're either the most wonderful person or they're the worst. It's refreshing to read about a guy who was shitty but did something good.",
          "created_utc": 1627431439.0
        }
      ]
    },
    {
      "id": "h6stvz9",
      "author": "Dietcoco",
      "body": "So what will be your suggestion for those already in relationships? To dump their partners and fight more problems that will come with this on top of ED?\nOr to think that if ED got worse in these relationships then something is wrong with them?\nI understand where you are coming from but I am just not sure that break up will help person with bulimia (yes I am looking at that from egotistical point of view)",
      "created_utc": 1627452328.0,
      "score": 6,
      "context": [
        {
          "id": "h6s4xns",
          "author": "AllOkJumpmaster",
          "body": "It’s is my personal al opinion that one should not be in a relationship with someone when they are not at least in recovery. Even if you are in a loving relationship with someone who supports you but not the disordered behavior it is extremely hard on the relationship and it is selfish and will ultimately be too much of a strain on it. Before you @ me and get all pissed off, remember it is just my personal opinion based on years of my own and anecdotal experience. I just could not even fathom expecting another person to put up with all of the aspects of it, and especially the wilfully destroying ones own body component",
          "created_utc": 1627437684.0
        },
        {
          "id": "h6s9exv",
          "author": "Asnora",
          "body": "I hope no one comes for you, because I completely agree with your opinion... every aspect of a person who is in the middle of a bulimic hell-storm is erratic, irrational, and filled with way too much emotion for there to be enough room for a *healthy* relationship.\n\nThere's definitely room for something, because everyone wants love even if it's a bad time, but it will never be healthy when your life is the equivalent of being stuck in a storm cycle that changes by the hour. No matter how healthy and nice you try to be, you'll always be dragging your partner out into the storm with you. It's the same as being with anyone who has an ongoing addiction.\n\nBeing in recovery means they are supporting you towards being better, which makes them a great partner. Not being in recovery puts them in some kind of limbo where they aren't okay with it, but they kind of have to be, and they don't know what to do, but even if you tell them what to do, is it morally right for them to accept and just enable the disorder? Nope, so you're putting them in a bad position, and they're putting themselves in a bad position too.",
          "created_utc": 1627439943.0
        }
      ]
    },
    {
      "id": "h6rip5l",
      "author": "HilaBeee",
      "body": "I have two other friends with EDs. Sometimes I feel like I may be the bad influence or I may trigger her because I am never \"sick enough\" for treatment or therapy, whereas she spent months in residential. Before I talk to her about ED stuff, I always ask if it's ok, and tell her what it's about, kinda like a trigger warning. I remember talking to a psychiatrist about my ED before my relapse (I was still underweight at the time) and he said I wasn't \"skinny enough\" for even a diagnosis at the time. It wasn't long after that I relapsed and I was diagnosed by an ER doctor. I haven't been back to that psychiatrist since and I'm still waiting on a referral for a new one sent out in sept. She's the only one I can openly talk to about it without feeling like I am getting judged or criticized.",
      "created_utc": 1627426780.0,
      "score": 6,
      "context": [
        {
          "id": "h6rglpe",
          "author": "HilaBeee",
          "body": "My bulimia started as a result of an affair of my second partner. My third didn't know. My current knows Im bulimic and discourages it. Sees it as \"wasteful\". Doesn't know I occasionally purge still. We make jokes about it though to make light of it. My girlfriend is also bulimic (though mostly recovered) and she understands me more.",
          "created_utc": 1627425794.0
        },
        {
          "id": "h6rhcet",
          "author": "Asnora",
          "body": "Interesting that your girlfriend is bulimic, I've never had any friends with an ED, is it ever a bad influence or always good?",
          "created_utc": 1627426141.0
        }
      ]
    },
    {
      "id": "h6sb8va",
      "author": "My-GPA-is-bulimia",
      "body": "I don’t think it’s hard to hide at all. My boyfriend knows but I’ve actively hidden it from a very very nosy family for years.",
      "created_utc": 1627440893.0,
      "score": 7,
      "context": [
        {
          "id": "h6rdx7c",
          "author": "NotAveragebutAverage",
          "body": "My boyfriend doesn’t even know about it 🤣",
          "created_utc": 1627424544.0
        },
        {
          "id": "h6rfj1g",
          "author": "Asnora",
          "body": "Yikes, that would be hard to hide living together, so do you guys live separate?",
          "created_utc": 1627425292.0
        }
      ]
    },
    {
      "id": "h75cafu",
      "author": "None",
      "body": "some trans women weren’t socialized male as they transitioned young. weird to make a blanket statement based on one’s biological sex",
      "created_utc": 1627690691.0,
      "score": 2,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        },
        {
          "id": "h6sdjc4",
          "author": "None",
          "body": "Uhh there are trans women who struggle with eating disorders , esp because eds are super prevalent in the trans community",
          "created_utc": 1627442126.0
        },
        {
          "id": "h6sk0kt",
          "author": "gouachedangit",
          "body": "im sure! i'm a trans afab person and didn't mean to imply that cis women have it the worst or anything. but a lot of ppl who are socialized male (ESP cis men) just aren't great at dealing with ed stuff, idk",
          "created_utc": 1627445760.0
        }
      ]
    },
    {
      "id": "h6t7cew",
      "author": "Asnora",
      "body": "It's extremely different if you are already in a relationship and someone develops an ED. In that situation you have been together long enough to develop a strong foundation and it's a \"wait out the storm\" situation. Also if you already have a partner, the likelihood your ED will develop and then get to a really bad place is unlikely (if your relationship is good and healthy etc).\n\nIf it was a short term partner and they were not trying to improve/recover then yeah, it would be warranted to dump them, you did not sign up to be put in such an uncomfortable position where you have to ignore/support an ongoing addict. Same as if someone developed a drug/alcohol addiction during a relationship, you leave if it's not improving, because it affects you too, not just them.",
      "created_utc": 1627463751.0,
      "score": 5,
      "context": [
        {
          "id": "h6s4xns",
          "author": "AllOkJumpmaster",
          "body": "It’s is my personal al opinion that one should not be in a relationship with someone when they are not at least in recovery. Even if you are in a loving relationship with someone who supports you but not the disordered behavior it is extremely hard on the relationship and it is selfish and will ultimately be too much of a strain on it. Before you @ me and get all pissed off, remember it is just my personal opinion based on years of my own and anecdotal experience. I just could not even fathom expecting another person to put up with all of the aspects of it, and especially the wilfully destroying ones own body component",
          "created_utc": 1627437684.0
        },
        {
          "id": "h6s9exv",
          "author": "Asnora",
          "body": "I hope no one comes for you, because I completely agree with your opinion... every aspect of a person who is in the middle of a bulimic hell-storm is erratic, irrational, and filled with way too much emotion for there to be enough room for a *healthy* relationship.\n\nThere's definitely room for something, because everyone wants love even if it's a bad time, but it will never be healthy when your life is the equivalent of being stuck in a storm cycle that changes by the hour. No matter how healthy and nice you try to be, you'll always be dragging your partner out into the storm with you. It's the same as being with anyone who has an ongoing addiction.\n\nBeing in recovery means they are supporting you towards being better, which makes them a great partner. Not being in recovery puts them in some kind of limbo where they aren't okay with it, but they kind of have to be, and they don't know what to do, but even if you tell them what to do, is it morally right for them to accept and just enable the disorder? Nope, so you're putting them in a bad position, and they're putting themselves in a bad position too.",
          "created_utc": 1627439943.0
        },
        {
          "id": "h6stvz9",
          "author": "Dietcoco",
          "body": "So what will be your suggestion for those already in relationships? To dump their partners and fight more problems that will come with this on top of ED?\nOr to think that if ED got worse in these relationships then something is wrong with them?\nI understand where you are coming from but I am just not sure that break up will help person with bulimia (yes I am looking at that from egotistical point of view)",
          "created_utc": 1627452328.0
        }
      ]
    },
    {
      "id": "h6rk01w",
      "author": "Asnora",
      "body": "I hear that dumb phrase so much and I have no clue why any doctor would say that. Maybe it's just different in other countries that it is here (New Zealand). \n\nHere, being underweight is only *one* criteria point of diagnosing someone with an ED. There are other factors like if they have \"rituals\" (OCD related), if they fast, if they have \"good and bad foods,\" if they have a goal weight that's under, the list goes on.\n\nSame with hospital admittance. I feel like so many people in the US suffer because you mostly need to be underweight to be admitted. Again, that's only *one* criteria here. There's a list, and if you hit more than 3 of the checks, you get admitted. You don't have to meet them all, just 3. It makes sure people don't slip through the cracks.\n\nI don't know specifically what the list is, but it involves things like how much your heart rate/blood pressure changes when you sit stand, and how your blood tests come back, your temperature, etc, it's not just \"oh you're not thin enough to be sick.\" \n\nWhen I was first admitted I was severely underweight, but the second time I was not underweight I was bordering overweight, and both times I was treated with the same care and respect. I wish it was the same for everyone else.",
      "created_utc": 1627427398.0,
      "score": 6,
      "context": [
        {
          "id": "h6rglpe",
          "author": "HilaBeee",
          "body": "My bulimia started as a result of an affair of my second partner. My third didn't know. My current knows Im bulimic and discourages it. Sees it as \"wasteful\". Doesn't know I occasionally purge still. We make jokes about it though to make light of it. My girlfriend is also bulimic (though mostly recovered) and she understands me more.",
          "created_utc": 1627425794.0
        },
        {
          "id": "h6rhcet",
          "author": "Asnora",
          "body": "Interesting that your girlfriend is bulimic, I've never had any friends with an ED, is it ever a bad influence or always good?",
          "created_utc": 1627426141.0
        },
        {
          "id": "h6rip5l",
          "author": "HilaBeee",
          "body": "I have two other friends with EDs. Sometimes I feel like I may be the bad influence or I may trigger her because I am never \"sick enough\" for treatment or therapy, whereas she spent months in residential. Before I talk to her about ED stuff, I always ask if it's ok, and tell her what it's about, kinda like a trigger warning. I remember talking to a psychiatrist about my ED before my relapse (I was still underweight at the time) and he said I wasn't \"skinny enough\" for even a diagnosis at the time. It wasn't long after that I relapsed and I was diagnosed by an ER doctor. I haven't been back to that psychiatrist since and I'm still waiting on a referral for a new one sent out in sept. She's the only one I can openly talk to about it without feeling like I am getting judged or criticized.",
          "created_utc": 1627426780.0
        }
      ]
    },
    {
      "id": "h75fagd",
      "author": "gouachedangit",
      "body": "ur right dude. probably shoulda just said men :|",
      "created_utc": 1627692276.0,
      "score": 4,
      "context": [
        {
          "id": "h6rc6im",
          "author": "gouachedangit",
          "body": "your current bf sounds amazing, my first bf caused my ed and my second would always say i talked abt it too much.. a lot of AMAB people honestly dont get it at all.",
          "created_utc": 1627423741.0
        },
        {
          "id": "h6sdjc4",
          "author": "None",
          "body": "Uhh there are trans women who struggle with eating disorders , esp because eds are super prevalent in the trans community",
          "created_utc": 1627442126.0
        },
        {
          "id": "h6sk0kt",
          "author": "gouachedangit",
          "body": "im sure! i'm a trans afab person and didn't mean to imply that cis women have it the worst or anything. but a lot of ppl who are socialized male (ESP cis men) just aren't great at dealing with ed stuff, idk",
          "created_utc": 1627445760.0
        },
        {
          "id": "h75cafu",
          "author": "None",
          "body": "some trans women weren’t socialized male as they transitioned young. weird to make a blanket statement based on one’s biological sex",
          "created_utc": 1627690691.0
        }
      ]
    },
    {
      "id": "h6rljy5",
      "author": "HilaBeee",
      "body": "I'm glad to hear you were treated well during your hospital stays.\nHe invalidated so many of my mental illnesses (anxiety, depression, and ED). Turns out I do have GAD, bipolar depression, and anorexia nervosa with b/p subtype. My BMI was so ridiculously low oml. I'm quite aware of the criteria lol the DSM-V is my Bible. I'm in Canada. Ive lost track how many times I've been hospitalized, but they've all been for my migraines. What a shit show that can be in itself. I've been refused treatment a couple times there too, the doctor calling me \"drug seeking\" and only giving me fluids. I was wearing my scrubs and came there from work. \nAs someone who works in healthcare, it sucks being a patient too.",
      "created_utc": 1627428134.0,
      "score": 4,
      "context": [
        {
          "id": "h6rglpe",
          "author": "HilaBeee",
          "body": "My bulimia started as a result of an affair of my second partner. My third didn't know. My current knows Im bulimic and discourages it. Sees it as \"wasteful\". Doesn't know I occasionally purge still. We make jokes about it though to make light of it. My girlfriend is also bulimic (though mostly recovered) and she understands me more.",
          "created_utc": 1627425794.0
        },
        {
          "id": "h6rhcet",
          "author": "Asnora",
          "body": "Interesting that your girlfriend is bulimic, I've never had any friends with an ED, is it ever a bad influence or always good?",
          "created_utc": 1627426141.0
        },
        {
          "id": "h6rip5l",
          "author": "HilaBeee",
          "body": "I have two other friends with EDs. Sometimes I feel like I may be the bad influence or I may trigger her because I am never \"sick enough\" for treatment or therapy, whereas she spent months in residential. Before I talk to her about ED stuff, I always ask if it's ok, and tell her what it's about, kinda like a trigger warning. I remember talking to a psychiatrist about my ED before my relapse (I was still underweight at the time) and he said I wasn't \"skinny enough\" for even a diagnosis at the time. It wasn't long after that I relapsed and I was diagnosed by an ER doctor. I haven't been back to that psychiatrist since and I'm still waiting on a referral for a new one sent out in sept. She's the only one I can openly talk to about it without feeling like I am getting judged or criticized.",
          "created_utc": 1627426780.0
        },
        {
          "id": "h6rk01w",
          "author": "Asnora",
          "body": "I hear that dumb phrase so much and I have no clue why any doctor would say that. Maybe it's just different in other countries that it is here (New Zealand). \n\nHere, being underweight is only *one* criteria point of diagnosing someone with an ED. There are other factors like if they have \"rituals\" (OCD related), if they fast, if they have \"good and bad foods,\" if they have a goal weight that's under, the list goes on.\n\nSame with hospital admittance. I feel like so many people in the US suffer because you mostly need to be underweight to be admitted. Again, that's only *one* criteria here. There's a list, and if you hit more than 3 of the checks, you get admitted. You don't have to meet them all, just 3. It makes sure people don't slip through the cracks.\n\nI don't know specifically what the list is, but it involves things like how much your heart rate/blood pressure changes when you sit stand, and how your blood tests come back, your temperature, etc, it's not just \"oh you're not thin enough to be sick.\" \n\nWhen I was first admitted I was severely underweight, but the second time I was not underweight I was bordering overweight, and both times I was treated with the same care and respect. I wish it was the same for everyone else.",
          "created_utc": 1627427398.0
        }
      ]
    }
  ]
}