{
  "id": "ovg44r",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1627769354.0,
  "title": "Wish I had anorexia instead of this clusterfuck of a disorder.",
  "selftext": "I mean it sucks! I can never manage to restrict. Not even for a single day can I fast. I can’t even let myself keep down a sandwich because I’m so scared I’ll go back to the weight I was…\n\nMy hair falls out and my enamel is just barely starting to become translucent. My tongue and throat always hurt and I’m always scared I smell like vomit. And anything I eat, a bit of it will come back up, whether I want it to or not.\n\nAnd I don’t even lose weight.",
  "url": "https://www.reddit.com/r/bulimia/comments/ovg44r/wish_i_had_anorexia_instead_of_this_clusterfuck/",
  "score": 199,
  "num_comments": 44,
  "comments": [
    {
      "id": "h79ik7g",
      "author": "None",
      "body": "I’m sure there are some with anorexia who would say the same about bulimia: “at least you can eat even though you purge.” They’re both just different evils. Btw, I’m a 29/f who was bulimic from ages 17-23. If you’re reading: recovery is possible. You can do this. ❤️",
      "created_utc": 1627780028.0,
      "score": 40,
      "context": []
    },
    {
      "id": "h794n1h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1627772499.0,
      "score": 30,
      "context": []
    },
    {
      "id": "h79azzc",
      "author": "missdarbusisaqueen",
      "body": "I relate to this so hard, especially cause anorexia is glamorized/romanticized whereas bulimia and bingeing are seen as disgusting. I just wanna be skinny but I can never bring myself to restrict",
      "created_utc": 1627775914.0,
      "score": 25,
      "context": []
    },
    {
      "id": "h79f1vl",
      "author": "emzocops",
      "body": "To be completely honest I feel the same. I find myself envying anorexia, whilst realising how fucking horrendous it is. My cousin has been hospitalised for it recently. I would do absolutely anything to help her or make her better, it breaks my fucking heart. And yet a part of me envies her. I feel very guilty about that. But in a way it has given me some perspective, and help me come to actually awknowledge how hard it is to deal with this stuff. Eating Disorders are just such insidious, complicated things to battle. We are all so isolated, but actually I would do anything to help any of you. On some spiritual level I like to think we are all in this together. No one else can really fathom what it's like.",
      "created_utc": 1627778094.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h79mhs0",
      "author": "bitchwhorehannah",
      "body": "haha my anorexic friend wishes she could purge like me so she can eat what she wants. like girly you DONT want this 😭 but i told her i wished i was anorexic and could just not eat and she said i didn’t want that at all so it goes both ways",
      "created_utc": 1627782221.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h79rf0c",
      "author": "turnipkitty112",
      "body": "I’m really sorry. I had/have anorexia, it’s morphed to AN b/p though and it’s 1000% worse. I restrict all day and b/p at night. Thank god I’m still losing weight but I’m having serious side effects and I’m barely underweight.",
      "created_utc": 1627785024.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h79awyy",
      "author": "Electric-Anomaly",
      "body": "Anorexia is... socially isolating and all consuming. All I think about it food, I never go out to eat with people, I find excuses not to drink with friends, and I plan what and when I eat so people see it and don't ask questions. When I was b/p, I didn't stop seeing people, I just ate and drank and purged. I don't miss purging all the time, but I don't like this either. I still purge on days I have to eat more than I normally do. Both disorders are the worst, just for different reasons.",
      "created_utc": 1627775868.0,
      "score": 24,
      "context": []
    },
    {
      "id": "h78yrox",
      "author": "Clementinesunshine_",
      "body": "Exactly how I feel 🤦🏻‍♀️ had anorexia when I was younger",
      "created_utc": 1627769417.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h79rzn7",
      "author": "ShySchemingGorgon",
      "body": "Problem is that it's miserable to think only of food every second of every day and never be brave enough to actually put any in your mouth.",
      "created_utc": 1627785345.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h79y76c",
      "author": "waterweightwatchers",
      "body": "Uggh I feel this :/ I can’t starve anymore and I miss it SO much. With the binging I feel like a failure all the time and purging makes me feel repulsive, and I’m constantly fat between the food bloat and the purge bloat and the stress bloat from all the binging and purging. And I don’t even throw up (I use laxatives) so I can’t even imagine how much worse that is. This is a nightmare disorder. It just feels like pure chaos",
      "created_utc": 1627789057.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h79hnls",
      "author": "856850835",
      "body": "In the last couple of months, I've been restricting more than I've been binging and purging. Diagnosed with AN B/P subtype. It's nothing too bad - I don't fast, I don't exercise, I don't even skip meals.\n\nAnd I must say, I feel like pure shit. Be careful what you wish for.",
      "created_utc": 1627779531.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h7a1vpg",
      "author": "GrilledRaccoon",
      "body": "They're both awful and they both consume your life. They both take away your control. You may see anorexics as having such great self-control to not eat and to fast but actually they don't have the control to eat at all. They literally cannot make themselves consume foods and they black out in public because they spent 2 hours staring at oatmeal before deciding they couldn't eat a single bite. \n\nWhat I can say, having had both, is bulimia is so much lonelier. It's not glamorized. There's no big pro-mia community. Purging is \"gross\" and bingeing makes you feel like a failure or like a pig. At least that's how I felt. \n\nNeither situation is permanent or hopeless though. I went from freshman year, constantly blacking out and having to be carried to the nurse and revived with orange juice in saltines, to senior year, wasting literally 10 hours a day binging and purging and failing all my classes, and now in my 20s I don't really think about food much anymore and I'm a healthy weight.",
      "created_utc": 1627791410.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7b2gjf",
      "author": "None",
      "body": "fuzzy thumb practice door adjoining crush chief sophisticated correct unite\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1627821291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7a3g04",
      "author": "YeahNoYeahMaybeNo",
      "body": "Kinda surprised this has so many upvotes. Im all for freedom of speech but how can you wish to have a different eating disorder? Ive fcked with both, they have their pros and cons. Anorexia is cheaper, less bad for you teeth and throat. Bulimia still gives me energy enough to workout and function (with anorexia you live in constant fog), I can eat normal now with friends and family (so no purging).\n\nBulimia for me came after I disliked the weight gain after doctor and parents told me that I got to skinny. Its at this point sort of a hobby, which is bad. But as we say in Dutch, if you cant as it must, it must as you can - if that makes any sense ;). You can get some control of bulimia by planning your b/p. Dont stress about one sandwich, allow yourself to be normal on one day and be an idiot on the other. I wouldnt suggest going the other way.",
      "created_utc": 1627792450.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7akxfd",
      "author": "Catbug94",
      "body": "Something I found helpful was eating in little increments- even if it was super tiny eat in small increments throughout the day and you just might see some growth! It’s very hard to control it I know but you are beautiful and I also suggest taking some nice walks outside- can be very short so you feel like you’re moving and stay hydrated! Water is everything",
      "created_utc": 1627806444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7bpxls",
      "author": "lol1234558282",
      "body": "enough self hatred helps me restrict but then my food thoughts take over and i convince myself to eat like “i’ll only have one” and then i go crazy",
      "created_utc": 1627833370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7970sk",
      "author": "None",
      "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
      "created_utc": 1627773773.0,
      "score": -3,
      "context": []
    },
    {
      "id": "h7a2lyz",
      "author": "havehope2234",
      "body": "honestly… i look back when i struggled with anorexia and would much rather be struggling with that instead of bulimia and binge eating like i do now.",
      "created_utc": 1627791891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7cspt1",
      "author": "SinfullySinatra",
      "body": "I have what I think is EDNOS which is kinda like having both. I restrict them binge, food makes me anxious and I think about it all the time(obsessed with meal planning, going to the grocery store and staring at food). I purge rarely but exercise daily(aside from Saturday because that’s movie day for me) no matter what. It started with myfitnesspal and what I would do is eat barely anything throughout the day and blow all my alloyed calories(and sometimes more) at night. If I wanted to eat more I’d exercise to earn back calories. Purged for the first time a month ago and tried to again 2 weeks ago. Trying to become more comfortable with some foods and not binging as much these days, in therapy",
      "created_utc": 1627851685.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7h36mk",
      "author": "alexisseffy",
      "body": "Kind of late but I have OSFED. I basically have all the symptoms and my ED keeps shape shifting. I've been through many restricting, binge phases, overexercise, and clean eating phases which leaves my health absolutely fucked and my weight still normal. If I 'recover' from one behavior it's onto the next. I know all the EDs suck but I just wish I didn't keep switching symptoms so I could actually recover for good.",
      "created_utc": 1627938288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpgr0bf",
      "author": "None",
      "body": "someone who went from ana to bulimic tendencies here. i definitely wish my ed didn't switch like this :')",
      "created_utc": 1640116796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7g9ek3",
      "author": "None",
      "body": "Did you recover? How did you do it?",
      "created_utc": 1627925289.0,
      "score": 2,
      "context": [
        {
          "id": "h79ik7g",
          "author": "None",
          "body": "I’m sure there are some with anorexia who would say the same about bulimia: “at least you can eat even though you purge.” They’re both just different evils. Btw, I’m a 29/f who was bulimic from ages 17-23. If you’re reading: recovery is possible. You can do this. ❤️",
          "created_utc": 1627780028.0
        }
      ]
    },
    {
      "id": "h796v2a",
      "author": "None",
      "body": "Purging is so miserable. I have it easier because I’ve had a horrible nail biting addiction, so my nails can’t hurt my throat any worst.",
      "created_utc": 1627773688.0,
      "score": 16,
      "context": [
        {
          "id": "h794n1h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1627772499.0
        }
      ]
    },
    {
      "id": "h7bq1k3",
      "author": "lol1234558282",
      "body": "purging by fasting is something i always do after binging and i love the feeling because i feel in control and good but it doesn’t last long at all and i start getting irritated",
      "created_utc": 1627833422.0,
      "score": 3,
      "context": [
        {
          "id": "h794n1h",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1627772499.0
        }
      ]
    },
    {
      "id": "h7ac87w",
      "author": "Ok-Statistician-3314",
      "body": "Exactly! People who deal with other EDs struggle just as fucking much but anorexia is the only one we see as \"aw I feel so bad for her she so tiny and skinny 🥺\"",
      "created_utc": 1627798962.0,
      "score": 12,
      "context": [
        {
          "id": "h79azzc",
          "author": "missdarbusisaqueen",
          "body": "I relate to this so hard, especially cause anorexia is glamorized/romanticized whereas bulimia and bingeing are seen as disgusting. I just wanna be skinny but I can never bring myself to restrict",
          "created_utc": 1627775914.0
        }
      ]
    },
    {
      "id": "h79ffv6",
      "author": "None",
      "body": "I hate and love the fact that nobody in my life will ever understand the phrase “tastes like calories”\n\nI couldn’t understand you more rn",
      "created_utc": 1627778306.0,
      "score": 8,
      "context": [
        {
          "id": "h79f1vl",
          "author": "emzocops",
          "body": "To be completely honest I feel the same. I find myself envying anorexia, whilst realising how fucking horrendous it is. My cousin has been hospitalised for it recently. I would do absolutely anything to help her or make her better, it breaks my fucking heart. And yet a part of me envies her. I feel very guilty about that. But in a way it has given me some perspective, and help me come to actually awknowledge how hard it is to deal with this stuff. Eating Disorders are just such insidious, complicated things to battle. We are all so isolated, but actually I would do anything to help any of you. On some spiritual level I like to think we are all in this together. No one else can really fathom what it's like.",
          "created_utc": 1627778094.0
        }
      ]
    },
    {
      "id": "h79orek",
      "author": "None",
      "body": "Idk cuz I’m still scared of eating. I just end up snapping and I cry and purge and hate myself.\n\nit’s like I have the anorexic fear of food but the bulimic binge-habit",
      "created_utc": 1627783492.0,
      "score": 8,
      "context": [
        {
          "id": "h79mhs0",
          "author": "bitchwhorehannah",
          "body": "haha my anorexic friend wishes she could purge like me so she can eat what she wants. like girly you DONT want this 😭 but i told her i wished i was anorexic and could just not eat and she said i didn’t want that at all so it goes both ways",
          "created_utc": 1627782221.0
        }
      ]
    },
    {
      "id": "h7bhiun",
      "author": "Lyndseyannclemons",
      "body": "I’ve never related more to a comment. I feel like I have both. If I eat something I feel ill and my body pukes everything up. I restrict for so long my body can’t handle food, but my stomach feels so empty :(",
      "created_utc": 1627829514.0,
      "score": 1,
      "context": [
        {
          "id": "h79awyy",
          "author": "Electric-Anomaly",
          "body": "Anorexia is... socially isolating and all consuming. All I think about it food, I never go out to eat with people, I find excuses not to drink with friends, and I plan what and when I eat so people see it and don't ask questions. When I was b/p, I didn't stop seeing people, I just ate and drank and purged. I don't miss purging all the time, but I don't like this either. I still purge on days I have to eat more than I normally do. Both disorders are the worst, just for different reasons.",
          "created_utc": 1627775868.0
        }
      ]
    },
    {
      "id": "h78z448",
      "author": "None",
      "body": "I didn’t even get to have anorexia. I just didnt b/p until evening cuz of school and sports. Now that it’s summer, I eat large quantities of low-cal foods and then purge, then repeat the process time and time again.\n\nI need school back. I need the structure.",
      "created_utc": 1627769597.0,
      "score": 12,
      "context": [
        {
          "id": "h78yrox",
          "author": "Clementinesunshine_",
          "body": "Exactly how I feel 🤦🏻‍♀️ had anorexia when I was younger",
          "created_utc": 1627769417.0
        }
      ]
    },
    {
      "id": "h7a0yu9",
      "author": "None",
      "body": "I use laxatives too to deal with the constipation",
      "created_utc": 1627790811.0,
      "score": 2,
      "context": [
        {
          "id": "h79y76c",
          "author": "waterweightwatchers",
          "body": "Uggh I feel this :/ I can’t starve anymore and I miss it SO much. With the binging I feel like a failure all the time and purging makes me feel repulsive, and I’m constantly fat between the food bloat and the purge bloat and the stress bloat from all the binging and purging. And I don’t even throw up (I use laxatives) so I can’t even imagine how much worse that is. This is a nightmare disorder. It just feels like pure chaos",
          "created_utc": 1627789057.0
        }
      ]
    },
    {
      "id": "h7bqh6i",
      "author": "lol1234558282",
      "body": "it is chaos like i have 2 different personalities it’s literally binging for a week and then purging for a week feeling high off of it and then back to binging and depression",
      "created_utc": 1627833625.0,
      "score": 2,
      "context": [
        {
          "id": "h79y76c",
          "author": "waterweightwatchers",
          "body": "Uggh I feel this :/ I can’t starve anymore and I miss it SO much. With the binging I feel like a failure all the time and purging makes me feel repulsive, and I’m constantly fat between the food bloat and the purge bloat and the stress bloat from all the binging and purging. And I don’t even throw up (I use laxatives) so I can’t even imagine how much worse that is. This is a nightmare disorder. It just feels like pure chaos",
          "created_utc": 1627789057.0
        }
      ]
    },
    {
      "id": "h7b6zwq",
      "author": "None",
      "body": "When I was restricting I was losing. Then I started b/ping again and now I’m so afraid of binging that I avoid everything until I end up binging. I can’t break the cycle.",
      "created_utc": 1627824037.0,
      "score": 1,
      "context": [
        {
          "id": "h7b2gjf",
          "author": "None",
          "body": "fuzzy thumb practice door adjoining crush chief sophisticated correct unite\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1627821291.0
        }
      ]
    },
    {
      "id": "h7bqmvy",
      "author": "lol1234558282",
      "body": "yeah restricting is isolating but for me binging is isolating because people around me are “proud” that at least i’m eating but i’m dying inside and the guilt is so bad",
      "created_utc": 1627833699.0,
      "score": 1,
      "context": [
        {
          "id": "h7b2gjf",
          "author": "None",
          "body": "fuzzy thumb practice door adjoining crush chief sophisticated correct unite\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1627821291.0
        }
      ]
    },
    {
      "id": "h79c0ro",
      "author": "None",
      "body": "that’s not what I’m saying at all.\n\nI’m just ranting because I hate my habits and was hoping someone else related to it",
      "created_utc": 1627776469.0,
      "score": 11,
      "context": [
        {
          "id": "h7970sk",
          "author": "None",
          "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
          "created_utc": 1627773773.0
        }
      ]
    },
    {
      "id": "h7gdmjm",
      "author": "None",
      "body": "I had a really amazing support system: my mom. I credit her more than anything. I also did therapy for a year when I was 18, but sadly I was very young and didn’t take full advantage of it, so I didn’t really benefit there. I think I just hit rock bottom one day. I was in physical pain, afraid of doing damage to my teeth (I’ve always received compliments on them, so my body dysmorphia was in full force there - not a great reason to overcome an eating disorder, but just being honest. It was part of it), etc. I also worked out while being bulimic, but it wasn’t a lifestyle thing. Now I eat healthy during the week with some treats, do cardio + weight training 6-7 days a week and just fully embrace the healthy/active lifestyle. I still have days where my BD rules me and I’m tempted to backslide, but I can usually talk myself through those thoughts and get out of the mindset. The worst that has happened so far is me having a meltdown/beating myself up for a bit. Recovery is definitely not an overnight thing, but it’s possible. Just takes hard work. I’m still trying to master the mental aspect, but haven’t gotten it just yet. :)",
      "created_utc": 1627927106.0,
      "score": 2,
      "context": [
        {
          "id": "h79ik7g",
          "author": "None",
          "body": "I’m sure there are some with anorexia who would say the same about bulimia: “at least you can eat even though you purge.” They’re both just different evils. Btw, I’m a 29/f who was bulimic from ages 17-23. If you’re reading: recovery is possible. You can do this. ❤️",
          "created_utc": 1627780028.0
        },
        {
          "id": "h7g9ek3",
          "author": "None",
          "body": "Did you recover? How did you do it?",
          "created_utc": 1627925289.0
        }
      ]
    },
    {
      "id": "h7bq68r",
      "author": "lol1234558282",
      "body": "fr",
      "created_utc": 1627833482.0,
      "score": 2,
      "context": [
        {
          "id": "h79azzc",
          "author": "missdarbusisaqueen",
          "body": "I relate to this so hard, especially cause anorexia is glamorized/romanticized whereas bulimia and bingeing are seen as disgusting. I just wanna be skinny but I can never bring myself to restrict",
          "created_utc": 1627775914.0
        },
        {
          "id": "h7ac87w",
          "author": "Ok-Statistician-3314",
          "body": "Exactly! People who deal with other EDs struggle just as fucking much but anorexia is the only one we see as \"aw I feel so bad for her she so tiny and skinny 🥺\"",
          "created_utc": 1627798962.0
        }
      ]
    },
    {
      "id": "h7c72yy",
      "author": "Electric-Anomaly",
      "body": "I understand what you're feeling, please take care of yourself and stay safe. 🫂🖤",
      "created_utc": 1627841376.0,
      "score": 1,
      "context": [
        {
          "id": "h79awyy",
          "author": "Electric-Anomaly",
          "body": "Anorexia is... socially isolating and all consuming. All I think about it food, I never go out to eat with people, I find excuses not to drink with friends, and I plan what and when I eat so people see it and don't ask questions. When I was b/p, I didn't stop seeing people, I just ate and drank and purged. I don't miss purging all the time, but I don't like this either. I still purge on days I have to eat more than I normally do. Both disorders are the worst, just for different reasons.",
          "created_utc": 1627775868.0
        },
        {
          "id": "h7bhiun",
          "author": "Lyndseyannclemons",
          "body": "I’ve never related more to a comment. I feel like I have both. If I eat something I feel ill and my body pukes everything up. I restrict for so long my body can’t handle food, but my stomach feels so empty :(",
          "created_utc": 1627829514.0
        }
      ]
    },
    {
      "id": "h7bq4ss",
      "author": "lol1234558282",
      "body": "no fr school helped me get distracted but then i did it all again when i came home",
      "created_utc": 1627833463.0,
      "score": 1,
      "context": [
        {
          "id": "h78yrox",
          "author": "Clementinesunshine_",
          "body": "Exactly how I feel 🤦🏻‍♀️ had anorexia when I was younger",
          "created_utc": 1627769417.0
        },
        {
          "id": "h78z448",
          "author": "None",
          "body": "I didn’t even get to have anorexia. I just didnt b/p until evening cuz of school and sports. Now that it’s summer, I eat large quantities of low-cal foods and then purge, then repeat the process time and time again.\n\nI need school back. I need the structure.",
          "created_utc": 1627769597.0
        }
      ]
    },
    {
      "id": "h79fpuu",
      "author": "emzocops",
      "body": "I think it's natural to envy anorexia if you have bulimia. Those feelings and thoughts are pretty much at the heart of the disorder, ya know? The desire to be skinny, to not rely on food, to do away with it altogether, to have that control, to do away with purging and binging. But from someone who has experienced both, I remind myself that anorexia quickly becomes a void that sucks your life away.",
      "created_utc": 1627778459.0,
      "score": 10,
      "context": [
        {
          "id": "h7970sk",
          "author": "None",
          "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
          "created_utc": 1627773773.0
        },
        {
          "id": "h79c0ro",
          "author": "None",
          "body": "that’s not what I’m saying at all.\n\nI’m just ranting because I hate my habits and was hoping someone else related to it",
          "created_utc": 1627776469.0
        }
      ]
    },
    {
      "id": "h79jp57",
      "author": "None",
      "body": "i know logically that anorexia sucks just as much\n\nBut at the same time i’m so stupidly jealous",
      "created_utc": 1627780666.0,
      "score": 5,
      "context": [
        {
          "id": "h7970sk",
          "author": "None",
          "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
          "created_utc": 1627773773.0
        },
        {
          "id": "h79c0ro",
          "author": "None",
          "body": "that’s not what I’m saying at all.\n\nI’m just ranting because I hate my habits and was hoping someone else related to it",
          "created_utc": 1627776469.0
        },
        {
          "id": "h79fpuu",
          "author": "emzocops",
          "body": "I think it's natural to envy anorexia if you have bulimia. Those feelings and thoughts are pretty much at the heart of the disorder, ya know? The desire to be skinny, to not rely on food, to do away with it altogether, to have that control, to do away with purging and binging. But from someone who has experienced both, I remind myself that anorexia quickly becomes a void that sucks your life away.",
          "created_utc": 1627778459.0
        }
      ]
    },
    {
      "id": "h7bqrnb",
      "author": "lol1234558282",
      "body": "i hate that i “binge” like why do i always give in? i wish i could just restrict forever",
      "created_utc": 1627833761.0,
      "score": 2,
      "context": [
        {
          "id": "h7970sk",
          "author": "None",
          "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
          "created_utc": 1627773773.0
        },
        {
          "id": "h79c0ro",
          "author": "None",
          "body": "that’s not what I’m saying at all.\n\nI’m just ranting because I hate my habits and was hoping someone else related to it",
          "created_utc": 1627776469.0
        },
        {
          "id": "h79fpuu",
          "author": "emzocops",
          "body": "I think it's natural to envy anorexia if you have bulimia. Those feelings and thoughts are pretty much at the heart of the disorder, ya know? The desire to be skinny, to not rely on food, to do away with it altogether, to have that control, to do away with purging and binging. But from someone who has experienced both, I remind myself that anorexia quickly becomes a void that sucks your life away.",
          "created_utc": 1627778459.0
        }
      ]
    },
    {
      "id": "h7bjhdq",
      "author": "Electric-Anomaly",
      "body": "Feelings aren't always rational and that's okay! I think we always want something we don't have, even in cases like this.",
      "created_utc": 1627830440.0,
      "score": 3,
      "context": [
        {
          "id": "h7970sk",
          "author": "None",
          "body": "i get your intentions behind this- but anorexia isn’t “easy” or whatever you seem to think it is.",
          "created_utc": 1627773773.0
        },
        {
          "id": "h79c0ro",
          "author": "None",
          "body": "that’s not what I’m saying at all.\n\nI’m just ranting because I hate my habits and was hoping someone else related to it",
          "created_utc": 1627776469.0
        },
        {
          "id": "h79fpuu",
          "author": "emzocops",
          "body": "I think it's natural to envy anorexia if you have bulimia. Those feelings and thoughts are pretty much at the heart of the disorder, ya know? The desire to be skinny, to not rely on food, to do away with it altogether, to have that control, to do away with purging and binging. But from someone who has experienced both, I remind myself that anorexia quickly becomes a void that sucks your life away.",
          "created_utc": 1627778459.0
        },
        {
          "id": "h79jp57",
          "author": "None",
          "body": "i know logically that anorexia sucks just as much\n\nBut at the same time i’m so stupidly jealous",
          "created_utc": 1627780666.0
        }
      ]
    }
  ]
}