{
  "id": "ows57e",
  "subreddit": "bulimia",
  "author": "NutelllaBellla",
  "created_utc": 1627951798.0,
  "title": "I'm starting a 0 tolerance policy on purging",
  "selftext": "   I have been bulimic for about 7 years, with the last 4 years being the worst.\n\n  This summer I made a lot of progress and decreased how frequently I b/p by a lot.\n\n   Today i had a minor slip up but stopped myself  before it got worse.  \n\n  I made a lot of progress this summer and I think this could be it. I think today could be the day I start a 0 tolerance policy on purging. \n\n  And lord knowwws I'm sick of seeing these swollen chipmunk cheeks, as I don't tire of mentioning on this sub...lol. So long and farewell to bulimia.",
  "url": "https://www.reddit.com/r/bulimia/comments/ows57e/im_starting_a_0_tolerance_policy_on_purging/",
  "score": 82,
  "num_comments": 6,
  "comments": [
    {
      "id": "h7i6wdr",
      "author": "al3x_birch",
      "body": "Yes!! This is what kick started my recovery, although it led me into 5 years of heavy binging, I am now binge free and have a healthy relationship with food!\nWishing you all the best on your journey! Remember it is a journey and for most not an overnight cure ✌ (and I say this because it took me a lot of time to realize this, which caused me to be really hard on myself when I relapsed.. but little progress over time goes a loooiong way!)",
      "created_utc": 1627956919.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h7i6ujl",
      "author": "JuggernautMain6457",
      "body": "Good for you! I’ve been b/p free for 24 days. I’ve found it very helpful to track on an app (someone posted about it last month). I’m focusing on not purging at all but allow a binge if I feel compelled… but the thing is, if I can’t purge, my binges are much smaller and end much sooner (the physical discomfort wins) and I don’t count it as a binge if I eat a lot because I’m hungry/ unsatisfied (does that make sense)\n\nI’ve had to learn to sit in my fullness. I’ve been eating to satisfaction without depriving myself, and I’ve found myself become less and less anxious about food. Just let yourself eat and be full. That’s my advice, hope it helps!",
      "created_utc": 1627956893.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h7i34nw",
      "author": "Dianitawray",
      "body": "Yes! You got this OP! I made a list of things that encouraged me to stop— maybe try it. No puffy cheeks and red eyes was definitely on there for me!",
      "created_utc": 1627955099.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h7k5w66",
      "author": "International_Ad5498",
      "body": "Proud of you! ❤️",
      "created_utc": 1628003114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7i7o2l",
      "author": "NutelllaBellla",
      "body": "Thank you! One of my previous posts is actually that exact list of things!",
      "created_utc": 1627957299.0,
      "score": 2,
      "context": [
        {
          "id": "h7i34nw",
          "author": "Dianitawray",
          "body": "Yes! You got this OP! I made a list of things that encouraged me to stop— maybe try it. No puffy cheeks and red eyes was definitely on there for me!",
          "created_utc": 1627955099.0
        }
      ]
    },
    {
      "id": "h7ktvv6",
      "author": "NutelllaBellla",
      "body": "Thank you ❤❤❤",
      "created_utc": 1628013233.0,
      "score": 1,
      "context": [
        {
          "id": "h7k5w66",
          "author": "International_Ad5498",
          "body": "Proud of you! ❤️",
          "created_utc": 1628003114.0
        }
      ]
    }
  ]
}