{
  "id": "oycmd5",
  "subreddit": "bulimia",
  "author": "Mil000000",
  "created_utc": 1628148954.0,
  "title": "I am so tired of living like this",
  "selftext": "I hate the feeling I have after every. Single. Meal. The feeling that I want to shove an entire pint of ice cream down my fucking throat. I hate not knowing if my body needs more food or if I’m just going to binge. I want to seek help, but about 8 months ago I was released from anorexia treatment. My parents were so proud of me, they said that it was so mentally draining for them to see me like that. They are going to be so disappointed in me. Especially my mother since I promised not to purge again after she found me bent over the toilet three years ago. I hate how different you get treated for bulimia than anorexia. \n\nI wish I could just be a normal son, not with a shit ton of mental issues. 🥲🙌",
  "url": "https://www.reddit.com/r/bulimia/comments/oycmd5/i_am_so_tired_of_living_like_this/",
  "score": 74,
  "num_comments": 6,
  "comments": [
    {
      "id": "h7skoaa",
      "author": "Mil000000",
      "body": "Thank you all for the kind words I really appreciate it ❤️",
      "created_utc": 1628163204.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h7s4dad",
      "author": "Mexican-Salt",
      "body": "I get that it must be hard for parents but that’s what’s keeping me from reaching out",
      "created_utc": 1628150034.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h7sn16f",
      "author": "Boosey0910",
      "body": "Relapse is unfortunately common so please don't be disappointed in yourself.  You just need to get some more help under your belt.  Recovery like most difficult things isn't a one and done. YOU are worth it.  It's hard for parents and other loved ones to really understand the struggles of eating disorders.  They honestly can't.  You are a human being, there is no \"normal\".  So many are struggling with disorders of one sort or another.  So try not to label yourself.  A great life awaits you.  I promise.",
      "created_utc": 1628164705.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7u0i88",
      "author": "No-Pen-9213",
      "body": "First off, I want to say that I am so sorry that you feel that your parents will be disappointed in you. I can relate because I haven’t told my parents about my current eating issues because in the past I had serious issues with OCD/ restrictive eating and just feel like that was enough for them. However, you are a human being and you matter. Your problems do not define who you are; it absolutely sucks that you have to go through this but you should never feel bad for struggling. You didn’t choose this. \nA lot of what you wrote really resonates with me. I feel like sometimes I can eat normally, and then I always go back to a ravenous state, feeling like I can’t start eating out of fear that I won’t be able to stop. I know what it’s like to feel exhausted and ill after purging, I know what it’s like to wake up the morning after a binge, and I know what it feels like to feel completely alone because absolutely nobody understands this disorder and people’s comments just make it worse. Everybody’s story is different, so I won’t say that I understand completely how you feel, but there are some similarities that resonate with me. I’m so sorry you’re suffering through this too, and I hope you remember that you are SO important and you are more than your disorder.",
      "created_utc": 1628185453.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7sndky",
      "author": "litterboxdweller",
      "body": "I’m so sorry. I completely understand because I feel like this every minute too. My family doesn’t know I have an ED but seeing as your family knows of your past, they’re sure to support you through this too. Focus on healing and what it takes to get there, and if that means familial support then don’t worry about telling them.",
      "created_utc": 1628164917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7tl063",
      "author": "yungchias33d",
      "body": "Sending love, its so hard",
      "created_utc": 1628179078.0,
      "score": 1,
      "context": []
    }
  ]
}