{
  "id": "p1y5lc",
  "subreddit": "bulimia",
  "author": "angstandboredom",
  "created_utc": 1628629073.0,
  "title": "ED and alcoholism, now I've collected them all",
  "selftext": "There is such a big hole inside of me, y'all, now that my bf and I broke up, the hole is so big and Im trying to fill it with bulimia, restriction, now alcoholism and I feel engulfed by it all. I just want to feel complete. Everyday I feel like an apocalypse survivor, screaming for someone but nobody being there. \nNow that I'm single my dysmorphia is so much worse, its like \"you got lucky before, now nobody will look at you again, you monstruos deformed being\". And idk how to live. I will because Im not ready to be dead forever yet, but having your mouth either  in a toilet or on a bottle is not a way to go. I hope I will not feel so wrong one day.\nThat's it. Thats the post.",
  "url": "https://www.reddit.com/r/bulimia/comments/p1y5lc/ed_and_alcoholism_now_ive_collected_them_all/",
  "score": 72,
  "num_comments": 2,
  "comments": [
    {
      "id": "h8gplrz",
      "author": "YeahNoYeahMaybeNo",
      "body": "Dont try to end it all cold turkey. Start with one day, one day not drinking or b/p is a win. Going from every day to 6/5 days a week is also progress. Try talk to family or friends you trust, you dont have to this alone. Take it easy 💪",
      "created_utc": 1628633448.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h8nb9dg",
      "author": "Albatross0216001",
      "body": "There will be someone. Try to look in the mirror and emphasize the parts of your body that you love. It's hard and this disease is scary but that doesn't mean it won't go away. We can beat it, and we will. I have the same feeling, I want to feel complete, I know it's hard but try feeling the feelings you have, don't deny them. Grief is better than suppressing emotions. Celebrate the small wins, one meal you haven't purged-it's a win, one hour even. We can do it, you are beautiful in your own way and you have to appreciate that. <3",
      "created_utc": 1628771588.0,
      "score": 1,
      "context": []
    }
  ]
}