{
  "id": "p6h9fc",
  "subreddit": "bulimia",
  "author": "sugacube_68",
  "created_utc": 1629250302.0,
  "title": "TW: Does anyone else romanticize being sick?",
  "selftext": "Around January I had to go to the hospital because I couldn’t keep any food down. I remember being absolutely miserable at the time, but I can’t help but look back at it longingly. I miss being cold, freezing even with multiple sweaters on. The brain fog that dulled my senses and made life bearable. Hell, I even miss being hooked up to an IV and being so dehydrated I couldn’t even stand for very long (along with low blood pressure and heart rate). I miss it more than I’d like to admit, and that stubborn part of my brain wants to go back but I know I’m at a good place in my life and I can’t afford to do that to myself. I’m scared because I don’t want this to end in a relapse, but I can’t help the thoughts. I was just wondering whether I’m alone in that or not.",
  "url": "https://www.reddit.com/r/bulimia/comments/p6h9fc/tw_does_anyone_else_romanticize_being_sick/",
  "score": 136,
  "num_comments": 18,
  "comments": [
    {
      "id": "h9das33",
      "author": "DeathmetalFiretruck",
      "body": "We long for the moments where we don’t have to work to prove to everyone else how much we are hurting inside.",
      "created_utc": 1629256366.0,
      "score": 99,
      "context": []
    },
    {
      "id": "h9duz29",
      "author": "SquidneyClimbs",
      "body": "Yep. I haven't been seriously underweight for *12* years. And I still romanticize those days so much. It's the ED tricking us into thinking we were special and superior when we were sickest. Reality is that life is much more special and superior when you can enjoy it and focus on important things like your family, friends, career, hobbies!!",
      "created_utc": 1629270939.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h9dfgvn",
      "author": "sullen_g1rl",
      "body": "Yes when I came back from the recovery hospital I started to write about how I missed it even tho it made me feel bad and sick. It wasn't like I enjoyed being in that place, but I don't know how to explain, I simply felt some kind of nostalgia and I wanted to get bad again so I could come back there... Idk it's just so hard to explain",
      "created_utc": 1629259095.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h9e2qkr",
      "author": "streetnavyblue",
      "body": "Watch OfHerbsAndAltars' YouTube video \"Nostalgic.. For Your Eating Disorder?\", I recommend her",
      "created_utc": 1629278290.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h9dinvh",
      "author": "SinfullySinatra",
      "body": "I honestly kinda like being sick because I can sleep as much as I want",
      "created_utc": 1629261128.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h9dyvxs",
      "author": "lindspringfield",
      "body": "You are not alone. Many ED sufferers feel the same. The thoughts you are having are not your thoughts, they’re your eating disorder’s thoughts. You’re better off being out of that torture. Nothing good comes from being that sick. We glorify all the benefits of our EDs when we look back, but forget about the endless suffering. YOU don’t miss that suffering. Your eating disorder does. Talk to a therapist. Don’t slide back into the torture.",
      "created_utc": 1629274587.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h9dhbhi",
      "author": "EsperoNoEstarLoca",
      "body": "I imagine that I will get really sick and lose weight. Once I dream I got cancer and my first thought was good I might lose weight.",
      "created_utc": 1629260242.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h9ec02t",
      "author": "Boosey0910",
      "body": "I heard a woman once on a podcast saying she finally realized how f'd up she was in her ED thinking when she liked the way she looked while undergiong chemotherapy.",
      "created_utc": 1629286184.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h9eoxsl",
      "author": "dalexearnhardtsghost",
      "body": "I feel this heavily. Why is this a thing? Anyone know the science behind this?",
      "created_utc": 1629293951.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h9fdhr0",
      "author": "Diane9779",
      "body": "I guess it’s the same motivation for people who self injure. The physical discomfort is bad, but it’s still better than the emotional pain. And when you’ve lost the ability to feel good, the only option is feeling a different, more tolerable kind of bad",
      "created_utc": 1629305223.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h9fhye9",
      "author": "sugacube_68",
      "body": "Holy crap I did not expect this to blow up, thank you all for your comments! They are all deeply appreciated, I don’t think I can reply to all of them right but now because my social battery is low but I am reading and upvoting all of them. Thank you 😁",
      "created_utc": 1629307186.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h9fp20k",
      "author": "Queso_and_Molasses",
      "body": "I used to love being sick because it meant I could relax and not feel guilty about it. Now, I have to push through it all or else I’ll fall so behind in my life I’ll be unable to manage.",
      "created_utc": 1629310321.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h9dfy4k",
      "author": "ButtonyCakewalk",
      "body": "Holy crap, this makes so much sense.",
      "created_utc": 1629259386.0,
      "score": 13,
      "context": [
        {
          "id": "h9das33",
          "author": "DeathmetalFiretruck",
          "body": "We long for the moments where we don’t have to work to prove to everyone else how much we are hurting inside.",
          "created_utc": 1629256366.0
        }
      ]
    },
    {
      "id": "h9duhwo",
      "author": "A_Jumble_Of_Logic",
      "body": "Stop you called me out so bad",
      "created_utc": 1629270497.0,
      "score": 9,
      "context": [
        {
          "id": "h9das33",
          "author": "DeathmetalFiretruck",
          "body": "We long for the moments where we don’t have to work to prove to everyone else how much we are hurting inside.",
          "created_utc": 1629256366.0
        }
      ]
    },
    {
      "id": "h9ewmi1",
      "author": "Inkyana",
      "body": "I agree, I think it definitely has more to do with our pain being recognized and being validated. Cuz I’m gonna be real idk where y’all are in your ED, but for me the weightloss has become noticeable and people tell me how I look good and I fucking hate it like how can you not see how badly I’m hurting?! This doesn’t look good, no one should look like this and if they do you should be worried. When I tell people I’m not doing well, they just come back in with “well you look great so you must be doing something right” didn’t realize slowly killing myself was the right thing thanks fam…. If anyone has ever wondered why telling someone with an ED they look good doesn’t help, that’s why.",
      "created_utc": 1629297644.0,
      "score": 6,
      "context": [
        {
          "id": "h9das33",
          "author": "DeathmetalFiretruck",
          "body": "We long for the moments where we don’t have to work to prove to everyone else how much we are hurting inside.",
          "created_utc": 1629256366.0
        }
      ]
    },
    {
      "id": "h9ei2cw",
      "author": "FarrahKhan123",
      "body": "Ok woah. I never thought of it that way",
      "created_utc": 1629290193.0,
      "score": 5,
      "context": [
        {
          "id": "h9das33",
          "author": "DeathmetalFiretruck",
          "body": "We long for the moments where we don’t have to work to prove to everyone else how much we are hurting inside.",
          "created_utc": 1629256366.0
        }
      ]
    },
    {
      "id": "h9edoxg",
      "author": "Ryuwu93",
      "body": "Yesss, I love her videos",
      "created_utc": 1629287379.0,
      "score": 2,
      "context": [
        {
          "id": "h9e2qkr",
          "author": "streetnavyblue",
          "body": "Watch OfHerbsAndAltars' YouTube video \"Nostalgic.. For Your Eating Disorder?\", I recommend her",
          "created_utc": 1629278290.0
        }
      ]
    }
  ]
}