{
  "id": "pbnvqn",
  "subreddit": "bulimia",
  "author": "Last_Ad998",
  "created_utc": 1629936421.0,
  "title": "I (32F) had bulimia for 17 years - I’m on my 50th b/p free day for the first time ever! AMA",
  "selftext": "I have tried every recovery method under the sun, but I’m finally making real progress after about one year of serious work on myself to decrease episodes and change my life. This meant going one week between b/p for a long time, then two weeks, and continuously pushing the needle forward. And here I am, at over seven weeks out!Happy to offer support - if I can do it, anyone can! Ask me anything.",
  "url": "https://www.reddit.com/r/bulimia/comments/pbnvqn/i_32f_had_bulimia_for_17_years_im_on_my_50th_bp/",
  "score": 152,
  "num_comments": 23,
  "comments": [
    {
      "id": "hadgc1b",
      "author": "None",
      "body": "This is a HUGE triumph. You should be so so proud of yourself. I sure am. ❤️",
      "created_utc": 1629943560.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hadv0h6",
      "author": "sadlittlecacti",
      "body": "YOU ARE GOALS!!!\n\nHow long did it take to stop being bloated? I'm on my second day of recovery (for the millionth time) and I REALLY want this to stick. I don't really have the urge to binge (or purge) but I am so bloated. I drank a ton of coffee to get things moving (it worked) but then as soon as I ate a small salad for dinner BAM. Its like my meal inpregnated me lol\n\nI take pre and probiotics, drink loads of water, and eat lots of fiber (even when I was still b/p I'd always eat 1 meal a day) so idk why I'm like this",
      "created_utc": 1629951050.0,
      "score": 9,
      "context": []
    },
    {
      "id": "haei222",
      "author": "cetaceansituation",
      "body": "Ohhhh man, my age and time-line is right alongside yours and this hits really close to home.\n\nAll of the suggestions you've given have been really great and I'm so glad you're going so strong in your recovery journey- it's incredibly inspiring!\n\nB/p is my only coping mechanism. Left alone with my thoughts or with excess free time, I descend into crippling anxiety. For this, everyone's favorite thing to say is \"you just have to push through\" or \"toughen up!\" which is....not how it works for me. Even DBT and CBT were pretty useless, despite honest efforts. How did you replace your ED behaviors with healthy alternative coping mechanisms?",
      "created_utc": 1629968045.0,
      "score": 6,
      "context": []
    },
    {
      "id": "had5tzh",
      "author": "Even-Writing8789",
      "body": "I really wanna stop buts it’s so hard and feel like I’m stuck in this cycle of overeating and throwing up.I’ve even thrown up when eating normal just look skinny or something like that and also sometimes bought laxatives .I’ve been through since beginning of 2021 and hasn’t gotten better.What advice do you have on how stop doing this or like decrease basically anything would help !!! Thank you so much !",
      "created_utc": 1629938856.0,
      "score": 3,
      "context": []
    },
    {
      "id": "haf6uii",
      "author": "fairybee5642",
      "body": "Congrats to you on such a HUGE accomplishment! I'm 37 and have been in recovery for 5 years. Your body will forgive you and things will continue to get better/easier. Remember recovery is for YOU. Wishing you many happy days ahead!",
      "created_utc": 1629984402.0,
      "score": 3,
      "context": []
    },
    {
      "id": "had3zg6",
      "author": "ftwillzzz",
      "body": "how do you keep pushing when the urge comes?",
      "created_utc": 1629938018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmg7kro",
      "author": "Last_Ad998",
      "body": "Coming back to this post a few years later — in July, I celebrated three years bulimia free. My life still has its problems, but bulimia is not one of them. And every single day is better because of that. ❤️",
      "created_utc": 1725981492.0,
      "score": 2,
      "context": []
    },
    {
      "id": "had4zrk",
      "author": "cysticamnesia",
      "body": "what is your motivation to get better",
      "created_utc": 1629938476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "haevtpl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1629978619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "haf5qjx",
      "author": "ddonniedarko_",
      "body": "first of all - congrats!! \n\nq: did u notice any changes in ur face? my face got so freaking puffy from purging :(",
      "created_utc": 1629983881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hafz6hx",
      "author": "Less_Home8530",
      "body": "Congratulations!! I'm so proud of you!!",
      "created_utc": 1629996139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hagz3ii",
      "author": "kayle_selina",
      "body": "I am so proud of you and I hope you are 2... this is a huge win ❤",
      "created_utc": 1630010438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "haesa90",
      "author": "Last_Ad998",
      "body": "Tbh bloating stopped me sooo many times in the past, so I totally get it. This time around I just accepted that it was part of the process. Things that have helped: Spacing out my meals and snacks. I don’t eat anything too complicated or high fiber for dinner if I can help it (sometimes it happens anyway, like if I have a craving). But generally if I’m going to have salad, broccoli, beans, pizza with toppings, etc, I do that at lunch so I can get through the gas/bloat by moving around during the day. I go for a 30-60 min walk almost every day, that helps. I go alone so I can be gassy, lol. Buying some larger tops/loose dresses. The bloat is honestly still a thing for me some days. But it happens way less over time and it got easier after about 3 weeks. The intensity goes away-now it is like a mini bloat instead of feeling 7 months pregnant. It helps to remember that your digestive system is INJURED. If you’ve ever broken a bone or sprained something, it took 4-6 weeks or even months to heal, right? When you get bloated, reframe it as your body healing from all the damage. Just like swelling around an injury. It will pass, but not if you keep re-injuring it.",
      "created_utc": 1629976353.0,
      "score": 9,
      "context": [
        {
          "id": "hadv0h6",
          "author": "sadlittlecacti",
          "body": "YOU ARE GOALS!!!\n\nHow long did it take to stop being bloated? I'm on my second day of recovery (for the millionth time) and I REALLY want this to stick. I don't really have the urge to binge (or purge) but I am so bloated. I drank a ton of coffee to get things moving (it worked) but then as soon as I ate a small salad for dinner BAM. Its like my meal inpregnated me lol\n\nI take pre and probiotics, drink loads of water, and eat lots of fiber (even when I was still b/p I'd always eat 1 meal a day) so idk why I'm like this",
          "created_utc": 1629951050.0
        }
      ]
    },
    {
      "id": "haezy18",
      "author": "Last_Ad998",
      "body": "I understand, I’ve seen many therapists and tried like every book. I know how hard it is. As I mentioned above, eating 2000-2500 calories a day and giving up on controlling my weight got rid of 50-70% of my urges immediately. For the rest of them, I just realized that bulimia would literally never end on it’s own. I would get messages from my brain to keep binging and vomiting until I either 1. went to the ER or 2. woke up in another 17 years at age 49, having utterly wasted my life. Keeping those harsh and very real examples in my mind empowered me to   say “I’m not doing this tonight.” I went for walks, took drives, did whatever I had to if I felt I needed to leave the house. I accepted that being unhappy temporarily was unavoidable and so long as I waited for recovery to be fun or easy, I would never get better. I cried, sometimes I was angry. And before I got to now, it took me about 10 months of decreasing b/p episodes to get here at all. I made the most progress because of the times I binged but chose not to purge, and did not diet or starve the next day. It sucks. But for me I b/p not to cope with emotions, but to hit the escape button on them. Something I did early on 10 months ago was when an urge hit, I’d set a timer for 15 minutes and sit with myself. No phone, no tv, etc. Just listening to my own thoughts and feelings and asking myself questions about why or what was going on. If I wanted to binge after, I could. And sometimes I did. But sitting for those 15 minutes at first showed me that I could stand my own emotions. And over time I lengthened the timer. And eventually I got to a point where I felt like I could handle my feelings without food, because I saw that b/p made my emotions worse! The feelings never really go away, you’re just piling a problem on top of them. Once you start facing your emotions and problems that have been masked by your ED, you’ll gain confidence in yourself that you can address them in new and better ways. Think of it this way, by your late 20s or into your 30s, you’ve been through a lot of things that were awful. Losses, work stress, breakups, money problems, etc. When those things happened, they were horrible, and can drag out for years. But they were worse because of bulimia. Not better, not easier. But you got through those hard things—and I bet you didn’t have any clue how you would at first. But you did. Getting through the first stages of recovery is shitty and it takes a long time, but it is temporary, and you will improve every aspect of the rest of your life by doing it. I used to think bulimia helped me cope, but I eventually saw that that was a lie! Whatever happened in my life, I had to cope with, all while very sick. It’s easier when you’re not sick, not the other way around.",
      "created_utc": 1629980964.0,
      "score": 9,
      "context": [
        {
          "id": "haei222",
          "author": "cetaceansituation",
          "body": "Ohhhh man, my age and time-line is right alongside yours and this hits really close to home.\n\nAll of the suggestions you've given have been really great and I'm so glad you're going so strong in your recovery journey- it's incredibly inspiring!\n\nB/p is my only coping mechanism. Left alone with my thoughts or with excess free time, I descend into crippling anxiety. For this, everyone's favorite thing to say is \"you just have to push through\" or \"toughen up!\" which is....not how it works for me. Even DBT and CBT were pretty useless, despite honest efforts. How did you replace your ED behaviors with healthy alternative coping mechanisms?",
          "created_utc": 1629968045.0
        }
      ]
    },
    {
      "id": "hadam5f",
      "author": "Last_Ad998",
      "body": "Ugh, I know what it’s like, I’m sorry. Here are my tips. They are not easy, but I know they worked for me.\n1. Eat a minimum of 2000 calories a day. If you exercise or are under 25, bump that up to 2200-2500 or more. Eat regular meals and snacks every 3-4 hours. Do not diet, do not cut corners, do not intermittent fast. \n2. Throw out your scale. Let weight go. You cannot focus on weight and get better. Your body has a natural weight that makes sense for you. You will not endlessly gain weight. You might fluctuate a bit, but ultimately you have to decide that this does not matter. Going up one pant size is not worth being tortured 24/7, indefinitely. \n3. Stop compensating when you overeat. It’s going to happen and you have to learn how to chill when it does. If you want to go for a walk or something to ease discomfort, fine. But do not purge, skip meals, or exercise to make up for the calories. Every purge sets you up for another binge. You cannot recover from bulimia without learning how to make peace with occasional overeating.\n4. Here’s a fun one - stop taking it all so seriously!!! For real. A clothing size, a number, calories, a single big meal, whatever is you’re stressing about—trying laughing at it, or at least say, “really?”. In the grand scheme of things, the stress of an ED is not worth it. It gives you nothing in the end—weight comes back, and even if you “stay thin,” (basically impossible unless you’re hell bent on dying from the disorder, which is very possible with bulimia *shudder*) all other aspects of beauty will start to diminish because your health is trashed. You can’t win! What a joke! It’s honestly so ridiculous. Start laughing at the thoughts, or tell them to f*ck off.",
      "created_utc": 1629940997.0,
      "score": 12,
      "context": [
        {
          "id": "had5tzh",
          "author": "Even-Writing8789",
          "body": "I really wanna stop buts it’s so hard and feel like I’m stuck in this cycle of overeating and throwing up.I’ve even thrown up when eating normal just look skinny or something like that and also sometimes bought laxatives .I’ve been through since beginning of 2021 and hasn’t gotten better.What advice do you have on how stop doing this or like decrease basically anything would help !!! Thank you so much !",
          "created_utc": 1629938856.0
        }
      ]
    },
    {
      "id": "haf8kjd",
      "author": "Last_Ad998",
      "body": "Thank you! Congrats to you as well!! ❤️",
      "created_utc": 1629985194.0,
      "score": 1,
      "context": [
        {
          "id": "haf6uii",
          "author": "fairybee5642",
          "body": "Congrats to you on such a HUGE accomplishment! I'm 37 and have been in recovery for 5 years. Your body will forgive you and things will continue to get better/easier. Remember recovery is for YOU. Wishing you many happy days ahead!",
          "created_utc": 1629984402.0
        }
      ]
    },
    {
      "id": "had7ki0",
      "author": "Last_Ad998",
      "body": "Well, I realized, after 17 years, losing and gaining the same 20lbs about 8 times, vomiting approximately 5,000 times (a real estimate), and spending about $100k on food that I threw up, that the urges were endless. That there was never going to be a time when I wanted to stop. That in order to stop, I needed to accept being uncomfortable. In practical terms, this meant eating adequately, allowing myself to overeat if it happened without purging, letting go of dieting, and letting go of weight control. Just eating enough every day (and I mean really enough, like 2,000-2,500 calories - NOT a diet) cut half of the urges away. The rest was a matter of learning to accept the discomfort. This didn’t happen immediately. It took me about 10 months, every month b/p less and less (which again, meant that when I felt like overate or was unhappy with my weight, I just sucked it up did the next right thing: like eating my next meal anyway, or going to bed at night without purging).",
      "created_utc": 1629939633.0,
      "score": 20,
      "context": [
        {
          "id": "had3zg6",
          "author": "ftwillzzz",
          "body": "how do you keep pushing when the urge comes?",
          "created_utc": 1629938018.0
        }
      ]
    },
    {
      "id": "had8ir8",
      "author": "Last_Ad998",
      "body": "An eating disorder isn’t just an eating disorder—it touches every aspect of your life. I realized that being bulimic made me shitty at emotional regulation when it came to relationships, friendships, work, pursuing other goals, and that it was holding me back from growing as a person. Anytime life got hard, I focused on my weight instead of what really mattered. I was tired of watching myself fail in so many other areas of my life because I was putting my limited and precious energy into a fantasy world of being thin and obliterating all my emotions with food. The more time I’ve spent not b/ping, the more my motivation has grown, because I’ve started to see that life is much more interesting without an ED. An ED keeps your reality so small, repetitive, and boring. I will say though, that there are tough days. There are times when my motivation takes a dip and I feel very empty, alone, and uncomfortable, and I just have to get through it. Even if that means laying on the floor staring at the ceiling until my next meal. Eventually, the next day, or a few days later, it comes back, and overall the trend keeps going upward.",
      "created_utc": 1629940054.0,
      "score": 16,
      "context": [
        {
          "id": "had4zrk",
          "author": "cysticamnesia",
          "body": "what is your motivation to get better",
          "created_utc": 1629938476.0
        }
      ]
    },
    {
      "id": "haezfuy",
      "author": "Last_Ad998",
      "body": "Bulimia tricks you into thinking that there’s a quick fix for everything. That there even IS a switch. There isn’t. There will never be a day when you want to stop. You will die first. You have to accept that you will have to keep doing things you don’t want to do in order to get better. Eating regularly. Not dieting. Giving up on weight manipulation. Not purging when you binge. Not binging when you overeat. If you’ve ever gone to school or work, you can do this. I say that because we all have to do things we don’t want to do ALL the time. But bulimia tricks us into thinking it’s different. It’s not. You suck it up and do what you don’t want to do. You accept that doing it *your way* has never worked. If you keep at it, it gets easier, and it starts to feel natural and less like work. Most days, at this point, it’s not work at all. Occasionally I have urges to restrict, and I remind myself that’s setting myself up to binge. If I have an urge to binge, I take a time out and go for a drive/walk. Or lay on the floor until I don’t care anymore. If I’m actually hungry I just eat something. Even if it’s more than I think I need. If I really want food, I just have it. Body image is hard sometimes. But I remind myself that bulimia did not keep me thin, either. In fact I gained and lost weight randomly all the time during bulimia and I had no control over it. So basically, it’s not ONE big decision. It’s a commitment, and an attitude, and you make many many little decisions all the time. You just keep asking, what would a healthy person do? What’s freedom in this scenario? What do I want my life to be like? And then you do those things, even if they feel scary or gross or weird. Eventually everything loses its big electrical charge. You eat half an ice cream cone and throw it away. Or you eat a whole container of Chinese food and let it go. Little decisions, like that, over and over.",
      "created_utc": 1629980691.0,
      "score": 3,
      "context": [
        {
          "id": "haevtpl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1629978619.0
        }
      ]
    },
    {
      "id": "haf8i9t",
      "author": "Last_Ad998",
      "body": "Yes! After about three weeks the swelling in my face has gone down. It’s subtle, nothing too dramatic, but I definitely have slightly visible cheekbones now and I think it will continue to change.",
      "created_utc": 1629985166.0,
      "score": 1,
      "context": [
        {
          "id": "haf5qjx",
          "author": "ddonniedarko_",
          "body": "first of all - congrats!! \n\nq: did u notice any changes in ur face? my face got so freaking puffy from purging :(",
          "created_utc": 1629983881.0
        }
      ]
    },
    {
      "id": "hcwn1ro",
      "author": "zikaflikaflame",
      "body": "Saving this post. Thank you for this detailed info. Been fighting for 10+ years now, and the bloat always wrecks me if I string together a few weeks",
      "created_utc": 1631675360.0,
      "score": 1,
      "context": [
        {
          "id": "haei222",
          "author": "cetaceansituation",
          "body": "Ohhhh man, my age and time-line is right alongside yours and this hits really close to home.\n\nAll of the suggestions you've given have been really great and I'm so glad you're going so strong in your recovery journey- it's incredibly inspiring!\n\nB/p is my only coping mechanism. Left alone with my thoughts or with excess free time, I descend into crippling anxiety. For this, everyone's favorite thing to say is \"you just have to push through\" or \"toughen up!\" which is....not how it works for me. Even DBT and CBT were pretty useless, despite honest efforts. How did you replace your ED behaviors with healthy alternative coping mechanisms?",
          "created_utc": 1629968045.0
        },
        {
          "id": "haezy18",
          "author": "Last_Ad998",
          "body": "I understand, I’ve seen many therapists and tried like every book. I know how hard it is. As I mentioned above, eating 2000-2500 calories a day and giving up on controlling my weight got rid of 50-70% of my urges immediately. For the rest of them, I just realized that bulimia would literally never end on it’s own. I would get messages from my brain to keep binging and vomiting until I either 1. went to the ER or 2. woke up in another 17 years at age 49, having utterly wasted my life. Keeping those harsh and very real examples in my mind empowered me to   say “I’m not doing this tonight.” I went for walks, took drives, did whatever I had to if I felt I needed to leave the house. I accepted that being unhappy temporarily was unavoidable and so long as I waited for recovery to be fun or easy, I would never get better. I cried, sometimes I was angry. And before I got to now, it took me about 10 months of decreasing b/p episodes to get here at all. I made the most progress because of the times I binged but chose not to purge, and did not diet or starve the next day. It sucks. But for me I b/p not to cope with emotions, but to hit the escape button on them. Something I did early on 10 months ago was when an urge hit, I’d set a timer for 15 minutes and sit with myself. No phone, no tv, etc. Just listening to my own thoughts and feelings and asking myself questions about why or what was going on. If I wanted to binge after, I could. And sometimes I did. But sitting for those 15 minutes at first showed me that I could stand my own emotions. And over time I lengthened the timer. And eventually I got to a point where I felt like I could handle my feelings without food, because I saw that b/p made my emotions worse! The feelings never really go away, you’re just piling a problem on top of them. Once you start facing your emotions and problems that have been masked by your ED, you’ll gain confidence in yourself that you can address them in new and better ways. Think of it this way, by your late 20s or into your 30s, you’ve been through a lot of things that were awful. Losses, work stress, breakups, money problems, etc. When those things happened, they were horrible, and can drag out for years. But they were worse because of bulimia. Not better, not easier. But you got through those hard things—and I bet you didn’t have any clue how you would at first. But you did. Getting through the first stages of recovery is shitty and it takes a long time, but it is temporary, and you will improve every aspect of the rest of your life by doing it. I used to think bulimia helped me cope, but I eventually saw that that was a lie! Whatever happened in my life, I had to cope with, all while very sick. It’s easier when you’re not sick, not the other way around.",
          "created_utc": 1629980964.0
        }
      ]
    },
    {
      "id": "had8yho",
      "author": "cysticamnesia",
      "body": "I really like what you said and i never thought of my motivation being looking at how much better your life can be. I find myself allowing the disorder to get in the way of everything and i need to think that way more. I appreciate your answer it meant a lot to me tonight.",
      "created_utc": 1629940248.0,
      "score": 3,
      "context": [
        {
          "id": "had4zrk",
          "author": "cysticamnesia",
          "body": "what is your motivation to get better",
          "created_utc": 1629938476.0
        },
        {
          "id": "had8ir8",
          "author": "Last_Ad998",
          "body": "An eating disorder isn’t just an eating disorder—it touches every aspect of your life. I realized that being bulimic made me shitty at emotional regulation when it came to relationships, friendships, work, pursuing other goals, and that it was holding me back from growing as a person. Anytime life got hard, I focused on my weight instead of what really mattered. I was tired of watching myself fail in so many other areas of my life because I was putting my limited and precious energy into a fantasy world of being thin and obliterating all my emotions with food. The more time I’ve spent not b/ping, the more my motivation has grown, because I’ve started to see that life is much more interesting without an ED. An ED keeps your reality so small, repetitive, and boring. I will say though, that there are tough days. There are times when my motivation takes a dip and I feel very empty, alone, and uncomfortable, and I just have to get through it. Even if that means laying on the floor staring at the ceiling until my next meal. Eventually, the next day, or a few days later, it comes back, and overall the trend keeps going upward.",
          "created_utc": 1629940054.0
        }
      ]
    },
    {
      "id": "hafdppx",
      "author": "ddonniedarko_",
      "body": "ahh that's great, also kind of a motivation to keep going (': thank u for the quick reply",
      "created_utc": 1629987450.0,
      "score": 1,
      "context": [
        {
          "id": "haf5qjx",
          "author": "ddonniedarko_",
          "body": "first of all - congrats!! \n\nq: did u notice any changes in ur face? my face got so freaking puffy from purging :(",
          "created_utc": 1629983881.0
        },
        {
          "id": "haf8i9t",
          "author": "Last_Ad998",
          "body": "Yes! After about three weeks the swelling in my face has gone down. It’s subtle, nothing too dramatic, but I definitely have slightly visible cheekbones now and I think it will continue to change.",
          "created_utc": 1629985166.0
        }
      ]
    },
    {
      "id": "hadcuyu",
      "author": "Last_Ad998",
      "body": "Good luck! I wish you all the best. You will find that as you move away from bulimia, even if it’s just b/p less often, you’ll have more time. And with that time, you can reflect on what else it is that you might want for your life. What else is around you to notice in the world. And the world gets richer. Here’s an example. I used to not be able to go in the grocery store at night because if I was there, I would buy binge foods and binge. Every time. Since I started eating adequately, gave up dieting, and am now no longer purging, I no longer have such strong urges to dismiss. So I can go in the store and either not have an urge, or it is like a small thought that I can dismiss pretty quickly (“I’m not doing that. If I’m hungry when I get home, I can eat something”). What I mean about the world being richer is that going to the store at night is NEW. I can be in there and notice all the people around me. I can read packages of foods I’ve never even noticed before, just out of curiosity. I can look at flowers, and magazines. When I get home I can watch a movie and focus on the whole movie, because I am not thinking about food. If I am thinking about food, I make a meal or a snack and then it is OVER. I can go for a long walk and simply notice nature, or listen to a podcast, and I am not thinking about how I need to lose weight or what diet to try next. I am not afraid at restaurants because I know that whatever I eat, it’s okay. It’s okay because I decide that it is. And every day I feel better and more clear-minded because I don’t have a purge hangover. Anyway, those are just some small examples of how your life gets better.",
      "created_utc": 1629942005.0,
      "score": 7,
      "context": [
        {
          "id": "had4zrk",
          "author": "cysticamnesia",
          "body": "what is your motivation to get better",
          "created_utc": 1629938476.0
        },
        {
          "id": "had8ir8",
          "author": "Last_Ad998",
          "body": "An eating disorder isn’t just an eating disorder—it touches every aspect of your life. I realized that being bulimic made me shitty at emotional regulation when it came to relationships, friendships, work, pursuing other goals, and that it was holding me back from growing as a person. Anytime life got hard, I focused on my weight instead of what really mattered. I was tired of watching myself fail in so many other areas of my life because I was putting my limited and precious energy into a fantasy world of being thin and obliterating all my emotions with food. The more time I’ve spent not b/ping, the more my motivation has grown, because I’ve started to see that life is much more interesting without an ED. An ED keeps your reality so small, repetitive, and boring. I will say though, that there are tough days. There are times when my motivation takes a dip and I feel very empty, alone, and uncomfortable, and I just have to get through it. Even if that means laying on the floor staring at the ceiling until my next meal. Eventually, the next day, or a few days later, it comes back, and overall the trend keeps going upward.",
          "created_utc": 1629940054.0
        },
        {
          "id": "had8yho",
          "author": "cysticamnesia",
          "body": "I really like what you said and i never thought of my motivation being looking at how much better your life can be. I find myself allowing the disorder to get in the way of everything and i need to think that way more. I appreciate your answer it meant a lot to me tonight.",
          "created_utc": 1629940248.0
        }
      ]
    }
  ]
}