{
  "id": "pc7xue",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1630010024.0,
  "title": "I prioritize bulimia over friendships",
  "selftext": "So often I cancel plans / outings to purge instead. I could have an active life but for some reason as if I compare hang ing with friends vs binging and purging, binging purging always wins. Its so pathetic. Tonight I'm  supposed to be going to a party but now I'm consumed by the thought of ordering food. I know i have a good time if I go but im probably not going to.",
  "url": "https://www.reddit.com/r/bulimia/comments/pc7xue/i_prioritize_bulimia_over_friendships/",
  "score": 92,
  "num_comments": 9,
  "comments": [
    {
      "id": "hagzubo",
      "author": "spicybutterflywings",
      "body": "This. Lost all my friends bc of this and blamed them for ditching me even tho I was the one who was choosing puking my guts out over going out. Then used the guilt to punish myself, haha good times",
      "created_utc": 1630010737.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hah5znz",
      "author": "lesbian_canadian",
      "body": "I do the same. Except with family. Cuz I have no friends",
      "created_utc": 1630013284.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hai9r0p",
      "author": "tenshi0o",
      "body": "The one thing that really helped me was thinking: when I’m on my death bed will I look back and say “oh my god that night I spent in vomming my guts out was so fun, I’m so glad it did that instead of spending valuable time with the people I love” if the answer is no, then go to the party",
      "created_utc": 1630031600.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hah99uu",
      "author": "YeahNoYeahMaybeNo",
      "body": "I hope you went to the party, always time to b/p, an occasional night out should be taken ^^",
      "created_utc": 1630014677.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hai3dx1",
      "author": "Elllliiiizzzaabeth",
      "body": "I used to struggle with this a lot, but eventually I made some rules for myself. Unless I force myself not to bail on school, friends, & other obligations, my ed becomes my entire life. You can always find time to b/p, I think you might be happier than you realize if you took some time to see your friends",
      "created_utc": 1630028614.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hahz6no",
      "author": "invader_zimothy",
      "body": "If I knew food would be involved I would make extravagant lies as to why I couldn't hang out with them.   \nI crave friendships/relationships, but I can't do them because I'm so fucked up.",
      "created_utc": 1630026605.0,
      "score": 5,
      "context": []
    },
    {
      "id": "haht9v4",
      "author": "thr0waway_ithink",
      "body": "when i go to outings i purge cuz i have to fuck up everything \\*sigh\\* i know how you feel.",
      "created_utc": 1630023817.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hak7g4l",
      "author": "None",
      "body": "Yeah. I moved into my college dorm and am getting close to my roommates. It’s been a few days max and I already isolated myself from them one night to binge(couldn’t purge though).\nI’ve also had myself dropped off back home early from an event just to binge/purge. \nIt’s so addictive that it becomes more of a high then social interaction.",
      "created_utc": 1630074828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "haq3c4s",
      "author": "honeycakies",
      "body": "I force myself to do the same. I’ve been so depressed I can’t get up or just otherwise feel too shitty for plans, but I still force myself to get out of the house because it’s RARE that going out makes me feel even worse than how I’d feel after b/p.",
      "created_utc": 1630182882.0,
      "score": 2,
      "context": [
        {
          "id": "hai3dx1",
          "author": "Elllliiiizzzaabeth",
          "body": "I used to struggle with this a lot, but eventually I made some rules for myself. Unless I force myself not to bail on school, friends, & other obligations, my ed becomes my entire life. You can always find time to b/p, I think you might be happier than you realize if you took some time to see your friends",
          "created_utc": 1630028614.0
        }
      ]
    }
  ]
}