{
  "id": "pdtz51",
  "subreddit": "bulimia",
  "author": "cpmatpas",
  "created_utc": 1630238414.0,
  "title": "Purging improves mood?",
  "selftext": "Does anybody else feel like if purging improves their mood?\n\nI'm realizing that negative thoughts make me depressed but as soon as I purge I get some sort of relief and feel better/happier (at least momentarily).\n\nThis is a bit scary because this makes purging a liberating way to cope with negative thoughts, and if I'm in a situation where I can't purge I just feel much worse.",
  "url": "https://www.reddit.com/r/bulimia/comments/pdtz51/purging_improves_mood/",
  "score": 87,
  "num_comments": 17,
  "comments": [
    {
      "id": "hasvzgi",
      "author": "shiju333",
      "body": "Yes. Its the endorphins. Your body is trying to make you feel better because your body just went through something traumatic.\n\nI purge at work on stressful nights for that high.",
      "created_utc": 1630244722.0,
      "score": 36,
      "context": []
    },
    {
      "id": "hasnj40",
      "author": "boba_andmilktea",
      "body": "It’s an addiction. You do it because you feel bad, you feel a rush so you keep on doing it and doing it over and over again. It’s a horrible cycle. I really wish you the best with everything",
      "created_utc": 1630240102.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hasy3ap",
      "author": "Stillapearl",
      "body": "I feel that.. it also takes my mind off anything when theres a storm inside my head. It takes away the weight of this world and only for a minute I can feel peace and breathe again. It's so highly addictive and my deadly drung of choice.. :( \nDoes anyone has healthy coping skills for me?",
      "created_utc": 1630245721.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hasx1qm",
      "author": "enhtie",
      "body": "absolutely. i put on some banger songs during my purges and when i’m done i feel so happy.",
      "created_utc": 1630245230.0,
      "score": 11,
      "context": []
    },
    {
      "id": "haumphj",
      "author": "Narwhal_Songs",
      "body": "Aaah the purge high\n... I can live off that for hrs",
      "created_utc": 1630271539.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hauusj3",
      "author": "None",
      "body": "Yes, I can 100% relate to this.\n\nSometimes it's like riding a wave. If you know that if you are feeling in a bad mood and purging makes it better for a while, but doesn't last explore other things to do instead of purging that make you feel better and are kind to your body and soul.\n\nPurging provides a temporary relief from anxiety, depression, sadness etc... When you can't do it, all that pain is still there. So what are some things you could try instead that will give a similar result?\n\nMaybe try going on a walk and moving your body, listen to an encouraging podcast or music that makes you feel good, move your body through stretching and relieve some tension, practice deep breathing and breath work, pray, draw, journal , snuggle with your pet. Allow yourself to cry and feel your feelings, they won't kill you but bulimia can.\n\nFor myself I typically HAVE to move my body by going outside on a walk or doing some type of physical stuff. Sometimes I just need to lay on my bed and have a good cry. It is not easy to change behavior, but even one success is a start <3",
      "created_utc": 1630275149.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hav9l7f",
      "author": "dalexearnhardtsghost",
      "body": "Yep!!!",
      "created_utc": 1630282181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "havmjaj",
      "author": "DarvinDave",
      "body": "Its the serotonin hit. I restrict for days and days and than order enough food for a month. cause if I eat I may as well binge. After words when my bodies shaking and I come to grips with the money spent that I don't have, I at least have the success of going through a purge like no other and it gives me a hit you cant find anywhere else. Wouldnt wish this shit on my worst enemy.",
      "created_utc": 1630288524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "havp6b4",
      "author": "flamingtrashmonster",
      "body": "They’ve done brain scans of bulimics, the ones where the brain lights up. They found that bulimics had food and purging to process negative emotions. They can literally see the difference in our brains. \n\nIt’s changeable though",
      "created_utc": 1630289814.0,
      "score": 3,
      "context": []
    },
    {
      "id": "havryvb",
      "author": "Spitefullyginger",
      "body": "I’ve done it before just for the endorphins. Especially when I was depressed. It’s super unhealthy but I’d sit on the floor and enjoy it. Happy to say it’s been a while though.",
      "created_utc": 1630291201.0,
      "score": 3,
      "context": []
    },
    {
      "id": "havhm22",
      "author": "Qhloey",
      "body": "Yes I always feel happy after purging",
      "created_utc": 1630286099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hax1wu1",
      "author": "kortsok",
      "body": "Total. \nScientifically it sends a signal of reward to your brain.. which is why it’s addictive.. makes me feel better as well..\nIt’s was the same with selfharming for me when i did that.. i could be feeling like shit, panicking, crying and crying, but the moment I harm; I stopped, felt relief and could get on with my day.",
      "created_utc": 1630323872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hba3u7k",
      "author": "LifeisHard2257",
      "body": "It makes me feel more relaxed when my stomach is empty after a purge",
      "created_utc": 1630558997.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hatsz5y",
      "author": "tiredgurl",
      "body": "It's actually the hormone vasopressin. It's released when throwing up to help retain fluid and help with potential dehydration from vomiting. In some people it can be felt as a good feeling which reinforces purging. It's a hard cycle to break, but with the right healthy coping skills it is possible",
      "created_utc": 1630258799.0,
      "score": 23,
      "context": [
        {
          "id": "hasvzgi",
          "author": "shiju333",
          "body": "Yes. Its the endorphins. Your body is trying to make you feel better because your body just went through something traumatic.\n\nI purge at work on stressful nights for that high.",
          "created_utc": 1630244722.0
        }
      ]
    },
    {
      "id": "hax01j2",
      "author": "plzkthx71",
      "body": "FOR REAL I feel so guilty for like jamming or dancing to my music like, how can I do that with what I’m doing?",
      "created_utc": 1630322650.0,
      "score": 5,
      "context": [
        {
          "id": "hasx1qm",
          "author": "enhtie",
          "body": "absolutely. i put on some banger songs during my purges and when i’m done i feel so happy.",
          "created_utc": 1630245230.0
        }
      ]
    },
    {
      "id": "hax2yj4",
      "author": "enhtie",
      "body": "ikr i always end up in fits of laughter like wtf am i doing with my life-\n\nbut fr a vibe",
      "created_utc": 1630324538.0,
      "score": 3,
      "context": [
        {
          "id": "hasx1qm",
          "author": "enhtie",
          "body": "absolutely. i put on some banger songs during my purges and when i’m done i feel so happy.",
          "created_utc": 1630245230.0
        },
        {
          "id": "hax01j2",
          "author": "plzkthx71",
          "body": "FOR REAL I feel so guilty for like jamming or dancing to my music like, how can I do that with what I’m doing?",
          "created_utc": 1630322650.0
        }
      ]
    }
  ]
}