{
  "id": "phht1w",
  "subreddit": "bulimia",
  "author": "acoh97",
  "created_utc": 1630717309.0,
  "title": "I'm still not doing too well :)",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/phht1w",
  "score": 91,
  "num_comments": 5,
  "comments": [
    {
      "id": "hbkchc8",
      "author": "Boosey0910",
      "body": "One of the things I did in recovery was journal.  About everything. How i felt before a binge and after etc.  It didn't stop the behavior but it did help me identify the feelings that may have triggered the episodes.\n\nMy therapist had me do an exercise called  \"The worst day with my ED\".  I wrote about a day that I felt was one of my worst.  For some reason it helped to write it down and then share it with my therapist.   I felt such shame but as I read it aloud I also felt this overwhelming compassion towards myself.  If a friend or someone had shared this kind of entry with me I would have felt that compassion to them so why not also apply it to myself.  \n\nHang in there.",
      "created_utc": 1630761101.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hbjq9mu",
      "author": "send-help-im-dying",
      "body": "You aren't alone, anyone who doesn't admit to at least one of these is either lying or hasn't been bulimic for long enough. I hope you start to feel better soon.",
      "created_utc": 1630743904.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hbjo0i3",
      "author": "Difficult-Echidna-32",
      "body": "Hi, may i show these to my therapist?",
      "created_utc": 1630741927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hbm20c8",
      "author": "MelanieSenpai",
      "body": "I once dig out my the laxatives I accidentally threw up during a purge, rinsed them off and took them again. Not even talking about shitting my bed in sleep because of laxatives. The things we are willing to do: / ow and also, to avoid shitting my bed, I made a diaper out of pads. I don’t know...:T",
      "created_utc": 1630789299.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hbkhzpo",
      "author": "acoh97",
      "body": "Go for it lol 👍",
      "created_utc": 1630763970.0,
      "score": 2,
      "context": [
        {
          "id": "hbjo0i3",
          "author": "Difficult-Echidna-32",
          "body": "Hi, may i show these to my therapist?",
          "created_utc": 1630741927.0
        }
      ]
    }
  ]
}