{
  "id": "q2tdtp",
  "subreddit": "bulimia",
  "author": "psychicglade",
  "created_utc": 1633553975.0,
  "title": "Today I am one year bulimia-free",
  "selftext": "I've tried and failed so many times to communicate the depth of despair my eating disorder caused me over the 12 years I spent binging and purging multiple times per day. I know I don't have to say much to convey that despair to people here, because you've experienced it yourselves. I'm sharing today because a year ago, I truly could not imagine a future for myself that didn't include bulimia, some other side to the constant secrecy, turmoil, physical destruction, and hopelessness.\n\nA year later, I'm realizing that being in recovery is not a binary between having an eating disorder and not--what we do with our bodies is the beginning, but our minds need to heal too. The same perfectionism that fed my ED for a decade is the enemy of my recovery, and I still struggle with urges, thoughts, and my relationship with food and my body. But I am proud that my tangible behaviors are different. I am bulimia-free, and free of so much that comes with it. I'm not sure if I'll ever pass all the way through \"recovering\" to \"recovered,\" some true other side, but this way of life is so much more free than the one I had a year ago. I still feel very connected to all of you posting here and I believe you can find your way through too.",
  "url": "https://www.reddit.com/r/bulimia/comments/q2tdtp/today_i_am_one_year_bulimiafree/",
  "score": 69,
  "num_comments": 8,
  "comments": [
    {
      "id": "hfnhy6n",
      "author": "vancelk",
      "body": "Thank you for posting this, I know the strength and courage it took to write this. I am currently struggling (was 9 -10 months into recovery and recently relapsed hard). This gives me hope that there’s a light at the end of the tunnel.",
      "created_utc": 1633554957.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hfnyoyx",
      "author": "LuceDeep",
      "body": "Proud of you lovely! <3",
      "created_utc": 1633562745.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hfo9f6y",
      "author": "Boosey0910",
      "body": "If you keep trying to recover you will eventually recover. I truly believe this,",
      "created_utc": 1633567912.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hfonuxx",
      "author": "CesareIs",
      "body": "Thank you for posting. It gave me relief and courage to know that there is a way out of the dark pit I’ve been in for the last 10+ yrs. I am so glad you are where you are rn. I hope I can get there too.",
      "created_utc": 1633574988.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hfpqwsz",
      "author": "Icy-Argument-2558",
      "body": "Very encouraging! Thank you",
      "created_utc": 1633604769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hfprfdf",
      "author": "foodgod101",
      "body": "Did you recover yourself or how did you do it? Youre amazing!!! I rly want to recover too thats why im asking",
      "created_utc": 1633605142.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hfr43op",
      "author": "esoterique87",
      "body": "What an incredible accomplishment! I am so happy for you and thank you for sharing. Recovery is a long and winding road. As long as we keep putting one foot in front of the other, we can get to a much better place. Keep up the amazing work! 💗",
      "created_utc": 1633627989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hh098gu",
      "author": "psychicglade",
      "body": "The big things for me this year were 1. Getting into trauma therapy for the first time in my life and understanding what was going on with my nervous system which led to my compulsive self harm, and 2. Slowly letting go of the secrecy of my eating disorder and telling the people in my life. This is so difficult for numerous reasons, but EDs cannot live in daylight. Creating accountability with the people who care about me has been instrumental to preventing relapses. Trusting that they care is SO hard, and trusting that they won't just think I'm attention-seeking even harder, but it's improving my life in ways beyond ED stuff.",
      "created_utc": 1634491695.0,
      "score": 1,
      "context": [
        {
          "id": "hfprfdf",
          "author": "foodgod101",
          "body": "Did you recover yourself or how did you do it? Youre amazing!!! I rly want to recover too thats why im asking",
          "created_utc": 1633605142.0
        }
      ]
    }
  ]
}