{
  "id": "qa8mja",
  "subreddit": "bulimia",
  "author": "edye99",
  "created_utc": 1634507632.0,
  "title": "Public bathroom.",
  "selftext": "Kinda embarrassing moment. Went out to dinner with my family, ordered/ate too much, and purged in the restaurant/bar bathroom. Two people came in the bathroom and although I tried to be quiet, they asked if I was ok and if I needed crackers or sprite. I said no and waited until they left, but was so ashamed. I’ve never been caught purging in public before. I’m sure they just thought I had too much to drink, but I’m still embarrassed. What do you say to people? Has this ever happened to anyone? I feel so alone.",
  "url": "https://www.reddit.com/r/bulimia/comments/qa8mja/public_bathroom/",
  "score": 68,
  "num_comments": 14,
  "comments": [
    {
      "id": "hh24tyc",
      "author": "kstocc",
      "body": "had this happen in a cvs one time. one of the sweet workers handed me a ginger thing to help my stomach and i heard her talking to someone as she was checking out saying she hopes i was okay. i literally ran out. i was in the middle of a b/p too so that was awful",
      "created_utc": 1634521820.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hh2yvbl",
      "author": "AdiposeQueen",
      "body": "I've been there. Once during a bachelorette party, I excused myself to the bathroom. Some of the other wedding party came in and heard me before I quit to stay quiet. They asked if whoever was in the next stall was okay, and then they realized it was me. Some of them knew I had \"food issues\" so it was obvious I was purging. Super embarrassing to walk back out to the party afterward and see them.",
      "created_utc": 1634540497.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hh2ebvy",
      "author": "queencowboy",
      "body": "the most cold yet comforting thought: nobody cares. there are so many reasons to puke: food/alcohol poisoning, motion sickness, pregnancy.. the people who checked on you did so out of extreme kindness but they could give a shit how or why you got there. everyone is busy thinking about themselves and their own lives. once they figured you weren’t going to die, they were off to the races with their own thoughts and feelings. you’re good <33",
      "created_utc": 1634526755.0,
      "score": 29,
      "context": []
    },
    {
      "id": "hh32xfq",
      "author": "One_Economist_1562",
      "body": "I had my first public purge two days ago and it was such an awful, isolating experience. Thinking of you!",
      "created_utc": 1634544068.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hh1j7xp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1634511202.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hh3n3zc",
      "author": "JellyCharacter1653",
      "body": "I did this once at school n the nurse came in and I was so scared n I told her I was fine then after that she came to my classroom n asked me if I was ok n stuff n I said yes I’m fine but I think she knew what I was doing but idk",
      "created_utc": 1634560112.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hh2fa4e",
      "author": "imlost_n_ilikeithere",
      "body": "I was having lunch in a Restaurant in South Beach and had to go purge. Well I clogged the toilet and the water kept running and made a mess all over the floor with vomit mix with all that water. Never went back there. I was awful but off course I acted like I didn’t know what happened.",
      "created_utc": 1634527274.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hh1nzvy",
      "author": "Underachieving_",
      "body": "Idk then you’re kinda shifting blame to the restaurant. You don’t wanna give them a bad reputation just because of that lie.",
      "created_utc": 1634513486.0,
      "score": 36,
      "context": [
        {
          "id": "hh1j7xp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1634511202.0
        }
      ]
    },
    {
      "id": "hh1vh0y",
      "author": "graciously13",
      "body": "I like this response. Thank you for thinking of others.",
      "created_utc": 1634517151.0,
      "score": 24,
      "context": [
        {
          "id": "hh1j7xp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1634511202.0
        },
        {
          "id": "hh1nzvy",
          "author": "Underachieving_",
          "body": "Idk then you’re kinda shifting blame to the restaurant. You don’t wanna give them a bad reputation just because of that lie.",
          "created_utc": 1634513486.0
        }
      ]
    }
  ]
}