{
  "id": "qn28gf",
  "subreddit": "bulimia",
  "author": "BunnyBon09",
  "created_utc": 1636082796.0,
  "title": "How I beat 12 years of Severe Bulimia and What Recovery is Like",
  "selftext": "As the title says, I've finally beat Bulimia on my own and have been purge free for months. It hasn't been an easy journey, but I'm glad I'm here and I feel obligated to share with everyone else in this community my journey and how I beat it so that everyone can feel a little less alone with this isolating disorder, and in hopes that my story will inspire someone else to recover. I only discovered this subreddit recently, and tbh I wish I had discovered this earlier because I went a decade thinking I was completely alone in this battle.\n\n**History**\n\nI started when I was 16 when I found out I can throw up at will. I never needed to poke my throat which made throwing up that much easier. I'd tell myself it wasn't \"really\" throwing up because I could naturally do it and I could throw my food up almost instantly. Once I found out I could do it, I was throwing up everyday.\n\nI prided myself in being a \"good\" bulimic. I would research a lot on how to minimize the effects of the disease--throwing up immediately after to reduce the acid, gargling and drinking water right after, trying not to let it hit my teeth, eating a bit of healthy food after throwing up a binge so that I'm not actually malnourished, eating foods that were easy to throw up, etc. Do not do what I did because you are essentially lying to yourself--no amount of risk mitigation will actually prevent the damage, which I will get into later.\n\nIt wasn't too long until my family found out I was throwing up because I was careless with the vomit. They would smell it in the bathroom, and there was one time I clogged up all the sinks and even the shower drain from throwing up. It was mortifying and obviously strained my relationship with my family. Eventually they tried to get me help when I was 19. Unfortunately, as most of you probably know, when you're *just not ready* to let go of the disease, any form of help or therapy won't actually be able to help you. At the time, I was ecstatic to be skinny and still be able to eat what I wanted. I was prescribed Prozac and instead of it helping me with the binges, it ended up becoming something I found that made it easier for me to throw up. (Serotonin loosens your lower esophageal sphincter so, go figure). Eventually I stopped going to therapy and my family thought I was recovered but I was anything but that.\n\nThe bingeing and purging continued for years to the point that it just became a part of my life. It was so second nature to me that I'd instantly go to the bathroom and throw up whenever I ate and never thought twice about it. When I was particularly stressed, I'd buy a lot of binge food with the intent of just throwing it up. I'd spend almost all my money just buying food which I would never digest. I would weigh myself before eating, then weigh myself again after throwing up to see if I had kept any of the food in. There were times I really tried to stop on my own, I'd keep telling myself \"Tomorrow I'll stop, I promise,\" but it ended up being a never-ending cycle which just made me binge and purge more. I felt really trapped. On the outside I was this successful, attractive, bubbly, and happy girl, but in secret I was throwing up every chance I could get.\n\nI've had to do some of the most disgusting things because of the disease. There were times I'd throw up in the woods when I hiked, I'd throw up in disgusting bar bathrooms, times when I threw up into a straw of a plastic cup when I couldn't get to a bathroom in time... I've literally done everything to get away with it. Some of the worst experiences were when the flush at a restaurant wouldn't work; there were times I'd empty a trash bin and fill it with water from the sink just so I can pour it over the toilet. Yes, it was that bad. I'd do anything so that I wouldn't get caught.\n\n**Health Effects**\n\nIt wasn't long until I started getting complications from the disease. Despite being careful and doing the best to try and \"mitigate\" the effects, there really is just so much you can do to prevent damage from years of bingeing and purging. This is TMI but a few years ago, I ended up developing a really itchy butt. Yes. My butt would literally itch all the time and it ruined my life because I had to sneakily scratch it when it was really bad. I had my butt checked, I got dewormed and everything and it wouldn't resolve. Honestly until today I'm not sure what it is, I can only speculate low acid in the stomach but since I've recovered, the itchy butt has gone. On top of that, I was always constipated and pooping only a little (which I used to rejoice in because hey, little poop means I didn't process a lot of food! Yes it's fucked up.) I also started getting a LOT of food bits stuck in my nose cavity and my throat and they would smell really bad to the point that I got conscious making out with my then partner. I always felt like my breath smelled because I couldn't get the dry food bits/tonsil stones out of my mouth. I had my nose checked by an ENT around last year and he said one of my glands inside were inflamed. As for my teeth, I had to have 5 of them root canal-ed and I now have jackets over them. I'd say I'm actually pretty lucky to have gotten away without losing any teeth, but let me tell you, root canals are NOT pleasant. It took months of work to patch everything up in my teeth and had to spend so much money on it. I also frequently had a hoarse voice and sore throat, and a pain in the middle of my chest. Over the last 2 years all of these got worse, which is why when the pandemic hit I told myself that it had to end or that I was eventually going to lose my health and succumb to the disease. I had to take charge of my life and not let the disease take over my life and completely ruin it as I have already let it.\n\n**Start of Recovery**\n\nThe reason I developed the disease was my vanity, so I thought to myself, the only way I could beat this was to anchor its reason on precisely that--my vanity. Throughout the years I had always been around 105-115 pounds for my 158cm height, which is low-normal but I never actually looked \"fit.\" Despite throwing up everything I ate and doing loads of cardio, I was flabby and looked pudgy. I didn't have any nice curves and I'd always wanted a big butt. I mean, yeah I looked good in clothes but I didn't actually look to good out of them, you know what I mean? This was when I started looking to the internet for solutions and found what has helped me the most through all of this: **weight lifting.** I shifted from doing cardio all the time to doing mostly lifting weights to build muscle. I got a coach which cost pretty much as much as the food I would usually buy to binge and purge. Now, lifting weights requires that you get enough nutrients, especially protein in your system in order to build muscle. I wasn't going to be able to do that if I kept throwing everything up since I wouldn't able to track how much I'd actually thrown up. This helped immensely in keeping myself from throwing up. I would tell myself that my butt wouldn't grow and my workouts would be useless if I just threw my food up, so instead I focused on eating what I think would fuel me and my muscles.\n\nLet me tell you though, it was NOT easy. I would still slip up from time to time whenever I ate \"Bad\" foods and would rationalize it as me throwing up food that would hinder my progress. But eventually, I would remind myself of all the health problems I would be putting myself through if I keep throwing up (my butt would start itching immediately after any single purge session) so I just powered through it and let myself absorb the calories when I slipped up.\n\nFrom 108 pounds at the start of the pandemic, I went to 120 in a matter of three months. The best thing about starting my recovery when the pandemic started was the fact that I didn't have to go out, I didn't have to see anyone and I could just focus my efforts on the recovery itself. Luckily, because of weightlifting I didn't actually look like I gained too much weight, in fact, I would say that I look **much better** then, and especially now than when I was throwing everything up and just doing cardio. So LISTEN TO ME. If you're doing this to look good, I'm telling you now that it won't. You'll look so much better if you actually fuel your body and work out. I now have abs and a butt which I never had in my years of the disorder and people comment on how healthy and fit I look. Yes, I no longer fit into my size 2 clothes but now I'm working towards cutting down in a healthy way whilst maintaining my muscle mass.\n\n**What Recovery Is Like**\n\nI won't sugar coat it. Recovery is a bitch. For the first few weeks, I was bloated as fuck. Literally--I looked like I was pregnant and my stomach would just swell every time I let it digest anything. I would constantly have to stop myself from throwing it up as I was scared that eating would make me fat instantly. Sometimes I would throw up even when I didn't want to because my stomach was so used to throwing everything up.\n\nAfter a few weeks, the bloating went down though and I stopped being constipated. My itchy butt disappeared, too. I stopped having food bits stuck in my throat and nose cavity and the swelling in my nostril went down. The last time I went to the dentist, I only had one tiny cavity compared to having so much discovered before when I was throwing up all the time. My cheeks are also a lot less swollen.\n\nThe only real symptoms that remain with me now that I'm months recovered is acid reflux pains and a sore throat most of the time. I will be having myself scoped at the end of the year, and honestly, it scares me to know what kind of damage I've done to my esophagus and my throat. I am scared that I've developed esophagitis or Barrett's esophagus and it keeps me up at night. Sometimes I drink coffee and my throat just closes up and I cough all the time. But I just tell myself, it's good I've recovered now and that I am taking steps to heal myself and make sure this doesn't happen again, and there's no use regretting something that's already been done. I am constantly riddled with anxiety over it, and I guess that's another lingering effect of the disorder. Honestly, it's the worst. If you're experiencing health anxiety now, it won't get any better unless you actually do something to stop it.\n\nAnyway, that's it. I just wanted to get this off my chest, and hopefully show you guys that recovery is possible even for the most severe of cases. I am just here if you want someone to talk to or need an accountability buddy; tbh none of my friends irl even have an inkling about it so it's been a very isolating thing. The only person who knows is my partner (who has been very understanding and supportive about my past) and my family.\n\nFeel free to comment if any of you have gone through any of the stuff I have because I have really believed I'm the only one who's had it this bad!",
  "url": "https://www.reddit.com/r/bulimia/comments/qn28gf/how_i_beat_12_years_of_severe_bulimia_and_what/",
  "score": 122,
  "num_comments": 34,
  "comments": [
    {
      "id": "hjdp86t",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636088392.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hjmcogq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636247081.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hjg280o",
      "author": "None",
      "body": "This is so awesome and thank you so much for sharing! it's always so encouraging to hear from people who are making it out. I had a brief recovery of about six months, and I also did that  through weightlifting. It is a pretty amazing thing. I've fallen off the wagon lately due to some life things that I wish I hadn't let affect me, but hoping soon to get back to it. Thank you for being so honest and open- I think many of us have had the butt thing, but it's so hard to talk about these things. I've lost half  my hearing in my ear due to bulimia (tmj related) and there are just so many side effects that we don't talk about. One of the hardest for me is not being able to digest anything- people think it's as easy as just eating, and it's just not. But thank you, reading this is so encouraging!",
      "created_utc": 1636136149.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hjghk4t",
      "author": "esoterique87",
      "body": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗",
      "created_utc": 1636141939.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hjphnn6",
      "author": "Cheerio520",
      "body": "Our story is so similar.  I'm weirded out. \n\nSame amount of time, same age,   same height, a lot of the same sneaky tactics although mine were instinctive not researched, \n\nEven the issues with my butt although i actually caused a huge rip down there and hemarroids at the grand age of 26. It's actually recently return as I'm slowly starting recovery.  I'll actually need surgery in due course. Luckily my teeth have always been in surpringly good condition though. \n\nI think the only difference is i took the bulimarexic route to have the fit body for 7 years.\n\n\nAnd the fact i need significant trauma based psychotherapy. So it's not really doing it on my own. \n\n\nI found the biggest regrets **weren't** body wise as i was so crazy in my disorder i had the body i wanted for quite a while.  It was more the money i spent on binge purge food,  and the chronic exhaustion and always feeling like shot and the refusal to let it go as a stress management vice. \n\nI've also been caught in some incredibly embarrassing situations,  being busted at work, having my car searched by police because i looked suss as i had binged and was ready to use to the public toilet,  clogging a toilet in my parents house and costing them a plumber,  looks of pity from supermarket staff even though i would rotate to 7 different supermarkets to try to cover it up,  throwing up in a bag in my car before work. Being caught multiple times nicking other people's food. \nAnd the simple crazy amount of time i spent each day doing it. \n\n.",
      "created_utc": 1636311608.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkhifgs",
      "author": "SheaShortcake",
      "body": "This amazing, you should be incredibly proud of yourself. I feel like I’m so close to recovery and this post showed me there is hope. Please can I ask what you would recommend to do when the urges to b/p arise? They feel so overwhelming like I have to respond to them.",
      "created_utc": 1636829030.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hjfwc2l",
      "author": "bitter_sweet_potato",
      "body": "Amazing, thank you for posting.",
      "created_utc": 1636133880.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hnvzcbv",
      "author": "devsalebmarak",
      "body": "Hi there, congratulations on your recovery! Re: your reflux symptoms, have those improved at all? And if you don't mind me asking, were you ever scoped and if so, did your doctor find any evidence of BE? I'm in recovery and the GERD/LPR symptoms are the worst. I'm getting an endoscopy later in December and very anxious about what we might find :(",
      "created_utc": 1639077442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jxzh0hn",
      "author": "lc1138",
      "body": "Curious how you’re doing? This post gave me hope. Anything to share about the results of the endoscopy?",
      "created_utc": 1693158477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktwb47x",
      "author": "PlayfulTower1093",
      "body": "I feel like I messed up my throat 5years of doing it daily I feel like I might have something wrong did you ever get swallowen lymph nodes?",
      "created_utc": 1709891506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgf53mr",
      "author": "Time-Caramel-6510",
      "body": "I am on year 12. My situation is extremely similar and I don’t know what to do. I disassociate so much day to day and just spend a lot of the time purging. I hate it. I have nightmares. I’ve wasted so much time and energy and money and food and my body to amount to nothing and I don’t know a way forward.",
      "created_utc": 1722755819.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhp9rix",
      "author": "Willing_Explorer198",
      "body": "Hi! 20yrs (female) and been bulimic for 6 years BP everyday multiple times, wondering if a full PHYSICAL recovery is possible, did your body ever heal completely after that?",
      "created_utc": 1723439390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lm5vz38",
      "author": "Salty_Midnight8514",
      "body": "I feel this! I’m also trying to recover from b1limia. I’m 18 and B/ping over a year now, it’s been horrible, I’m constantly broke and dis bad things. But a few weeks ago I started going to church it really helps. Now I do my best to just get better. I need to recover  for my future, family etc. Unfortunately I haven’t been purge free over a year..I can’t even get a day w/o pk:( \nLast year it really was horrible, couldn’t learn for school because I had to b/p.. right after that I went to clinic but released myself after short time. ",
      "created_utc": 1725823659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "honehy8",
      "author": "None",
      "body": "Congratulations!! Could you share what the doctor says at the end of your visit? I’ve been having horrible reflux but too scared to go to the doctor myself",
      "created_utc": 1639579922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hoyoqsc",
      "author": "slayerjay14",
      "body": "Hey sorry I’ve been in recovery for what seems like forever now and nothing is working. Did you happy to get an ED nutritionist? How did you figure out what to eat and such. For me the bloat is the biggest issue. I want to throw up after every meal literally just due to the bloating I get and can’t find a way to remedy it.",
      "created_utc": 1639772658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j4o6zm8",
      "author": "None",
      "body": "How did your endoscopy go? I hope you're still doing well. I am newly in recovery, and I'm planning to see my GI doctor about getting one soon. Very nervous.",
      "created_utc": 1673922239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hjfwora",
      "author": "BunnyBon09",
      "body": "Thank you for your kind words. I appreciate the comment! As for the butt issues, I just put two and two together because I was otherwise healthy and undoubtedly, throwing up was not healthy for my gut at all. I was able to confirm it when I was finally able to stop for weeks and the itch went away, and when I relapsed even for a day it would go back. How long have you tried not bingeing and purging? Are you still doing it now? Try to stop b/p for at least a month and see what happens. You really need to commit to it for your gut to rebalance yourself. As  for my digestion, it's actually fine aside from acid reflux problems. I will be getting an endoscopy/gastroscopy at the end of the year, though, just to make sure. Have you tried getting scoped before? Maybe it could also give clues as to why it's happening, but really, it only stopped for me when I consistently stopped the b/p.",
      "created_utc": 1636134015.0,
      "score": 3,
      "context": [
        {
          "id": "hjdp86t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636088392.0
        }
      ]
    },
    {
      "id": "hjvuk9v",
      "author": "BunnyBon09",
      "body": "Congratulations on being able to beat it after having it for so long! It must've taken so much dedication and focus to break out of something you've been so used to. But yeah haha it took me a while to realize the butt thing was because of the Bulimia. I mean, I knew for a fact that I wasn't doing my body favors by throwing up all the time, plus getting treated for worms didn't work and so did going to a dermatologist which meant that I was doing something that caused me to itch from the inside. I also stole food from my family members and they'd be so disappointed. Honestly, this disease is the worst. I'm so glad we're both recovered, and I'm hoping for a smooth recovery for the both of us from now on. \n\nHow did you start your recovery? What made you decide to recover? Thank you so much for putting my mind at ease. I've been having really bad throat pains from the reflux and I guess it's just been making me worry. Did you have any symptoms when you were first recovering?\n\nThank you so much for reaching out and sharing this with me. It fills me with hope that indeed, longer term recovery is possible.",
      "created_utc": 1636423917.0,
      "score": 2,
      "context": [
        {
          "id": "hjmcogq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636247081.0
        }
      ]
    },
    {
      "id": "hji9dfs",
      "author": "BunnyBon09",
      "body": "Congratulations on being able to break out of it even for that period of time! It's still incredible, knowing how hard it is to break free from. Now that you've seen that you have it in you to get out, I'm sure you can do it again. I used to use issues I go through as an excuse to do it a lot (telling myself \"I deserve this\" or \"This is how I cope\"), what really helped me with it was thinking about how I would eventually cope with the possible damage I'm doing myself. Bad things happening to us will be even worse when our health is poor. It does take a really controlled and good environment, however. Honestly, if the pandemic hadn't happened and I wasn't forced not to see people I don't think I would've made it out. I'm sure you can do it! I'm rooting for you.",
      "created_utc": 1636169070.0,
      "score": 2,
      "context": [
        {
          "id": "hjg280o",
          "author": "None",
          "body": "This is so awesome and thank you so much for sharing! it's always so encouraging to hear from people who are making it out. I had a brief recovery of about six months, and I also did that  through weightlifting. It is a pretty amazing thing. I've fallen off the wagon lately due to some life things that I wish I hadn't let affect me, but hoping soon to get back to it. Thank you for being so honest and open- I think many of us have had the butt thing, but it's so hard to talk about these things. I've lost half  my hearing in my ear due to bulimia (tmj related) and there are just so many side effects that we don't talk about. One of the hardest for me is not being able to digest anything- people think it's as easy as just eating, and it's just not. But thank you, reading this is so encouraging!",
          "created_utc": 1636136149.0
        }
      ]
    },
    {
      "id": "hji9t2u",
      "author": "BunnyBon09",
      "body": "Congratulations on being able to recover for 4 years! What have your symptoms been like while recovering? Do you still have lingering issues after 4 years without purging? \n\nI really appreciate the concern! Tbh I did have those relapse issues at the start; but I think at this point I'm never going to purge again because I've been starting to be afraid of the consequences. The acid reflux and LPR are no joke, as well as the root canals so I'm a bit traumatized out of the habit. At my highest after recovery I was at 128 lbs, slowly but surely, 3 months later at the moment I'm at 123 lbs. I have no plans on getting as low as I used to, but still I'll make sure to be vigilant and not to get complacent. Again, congrats for making it out as well! Thank you for sharing with me your experiences. :)",
      "created_utc": 1636169299.0,
      "score": 2,
      "context": [
        {
          "id": "hjghk4t",
          "author": "esoterique87",
          "body": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗",
          "created_utc": 1636141939.0
        }
      ]
    },
    {
      "id": "hjvvkg7",
      "author": "BunnyBon09",
      "body": "I honestly regret the amount of money I spent, too. I was getting a big allowance from my parents and literally it all went out the drain when I'd order multiple food items at a time and buy food to binge on. It's such a waste. I'm glad we realized that and it's a good deterrent not to do it again since there's so much better things we can be spending it on!\n\nI've also gone through all of those embarrassing situations! I've been caught throwing up a couple of times, too, and I've had to pretend I was just sick. Honestly, it is the worst. \n\nI'm wishing you the best for your recovery. Honestly, I didn't think I could do it on my own and was almost at the point where I wanted to go inpatient or do something extreme since years of trying to break free really didn't work. But I guess I linked my obsession to it to being seen by other people as \"fat\", and the only thing that finally made me stop is being forced not to see people for a while due to the lockdowns. Tbh I'm still planning to get help to iron my issues out, since it might also be trauma-based. I was bullied and shunned a lot growing up for being fat (as I think a lot of people who have EDs were,) and now I'm just deathly afraid to be called fat again. \n\nWe can do this! It's not too late for us.",
      "created_utc": 1636424362.0,
      "score": 1,
      "context": [
        {
          "id": "hjphnn6",
          "author": "Cheerio520",
          "body": "Our story is so similar.  I'm weirded out. \n\nSame amount of time, same age,   same height, a lot of the same sneaky tactics although mine were instinctive not researched, \n\nEven the issues with my butt although i actually caused a huge rip down there and hemarroids at the grand age of 26. It's actually recently return as I'm slowly starting recovery.  I'll actually need surgery in due course. Luckily my teeth have always been in surpringly good condition though. \n\nI think the only difference is i took the bulimarexic route to have the fit body for 7 years.\n\n\nAnd the fact i need significant trauma based psychotherapy. So it's not really doing it on my own. \n\n\nI found the biggest regrets **weren't** body wise as i was so crazy in my disorder i had the body i wanted for quite a while.  It was more the money i spent on binge purge food,  and the chronic exhaustion and always feeling like shot and the refusal to let it go as a stress management vice. \n\nI've also been caught in some incredibly embarrassing situations,  being busted at work, having my car searched by police because i looked suss as i had binged and was ready to use to the public toilet,  clogging a toilet in my parents house and costing them a plumber,  looks of pity from supermarket staff even though i would rotate to 7 different supermarkets to try to cover it up,  throwing up in a bag in my car before work. Being caught multiple times nicking other people's food. \nAnd the simple crazy amount of time i spent each day doing it. \n\n.",
          "created_utc": 1636311608.0
        }
      ]
    },
    {
      "id": "hkti4ks",
      "author": "BunnyBon09",
      "body": "Hello there! There is hope, and I'm sure you'll be able to overcome it, too. What I will recommend depends on what stage of recovery you're in and how much you've been doing it and how long. Because, if you're still stuck in the daily b/p cycle, nothing will be able to help you stop it unless you take the external pressure off you to do b/p. For me, the external pressure was going out and being seen by people. I needed to take the time not to be seen, and used weightlifting as a \"healthy\" way to gain weight while I was recovering. But now, when the urge arises I just think about all the health effects it has given me. The painful root canals, the heartburn, the fact that I might not be able to enjoy life later on because of all the health effects I'd be suffering. I also look at GERD and bulimia posts online to see posts written by those who've had it for decades and tell myself I'd be living with the same amount of suffering and regret if I don't stop it now.",
      "created_utc": 1637040085.0,
      "score": 2,
      "context": [
        {
          "id": "hkhifgs",
          "author": "SheaShortcake",
          "body": "This amazing, you should be incredibly proud of yourself. I feel like I’m so close to recovery and this post showed me there is hope. Please can I ask what you would recommend to do when the urges to b/p arise? They feel so overwhelming like I have to respond to them.",
          "created_utc": 1636829030.0
        }
      ]
    },
    {
      "id": "hji7h3b",
      "author": "BunnyBon09",
      "body": "No problem. Here's to a smooth recovery for both of us! <3",
      "created_utc": 1636168074.0,
      "score": 2,
      "context": [
        {
          "id": "hjfwc2l",
          "author": "bitter_sweet_potato",
          "body": "Amazing, thank you for posting.",
          "created_utc": 1636133880.0
        }
      ]
    },
    {
      "id": "ljubstl",
      "author": "itstanyaxx",
      "body": "How did it go for you?",
      "created_utc": 1724584997.0,
      "score": 1,
      "context": [
        {
          "id": "hnvzcbv",
          "author": "devsalebmarak",
          "body": "Hi there, congratulations on your recovery! Re: your reflux symptoms, have those improved at all? And if you don't mind me asking, were you ever scoped and if so, did your doctor find any evidence of BE? I'm in recovery and the GERD/LPR symptoms are the worst. I'm getting an endoscopy later in December and very anxious about what we might find :(",
          "created_utc": 1639077442.0
        }
      ]
    },
    {
      "id": "ljagbqa",
      "author": "Downtown_Job_8154",
      "body": "Bonjour, c’est la première fois que je publie sur Reddit (35 ans, je suis bien vieille pour ici j’ai l’impression moi. Avant c’était doctissimo qu’on utilisait pour ça). \n\nJ’ai été boulimique vomitive (avec quelques phases de semies anorexies toujours terminées par un festival comme on les déteste) de mes seize à vingt-sept ans (avec une très brève rechute d’un mois suite à un décès en 2019), mais on peut dire que je suis guérie parce que c’est presque quelque chose que j’ai oublié et dont je ne me souviens que lorsque quelqu’un parle de TOC ou en ce moment parce que j’ai de gros reflux et que je dois prendre de l’inexium (après une visite chez un gastro entérologue y’a huit ans, on a vu des ulcères et détecté un clapet qui n’était plus capable de se fermer - d’où les rejets). \n\nBref, dans mon cas je sais que les ulcères sont surtout liés à une ultra consommation d’ibuprofene et d’aspirine quand j’étais ado et au début de ma vie d’adulte (j’avais littéralement envie d’avoir toujours un médoc dans le corps à l’époque. Ma mère était pharmacienne, et j’avais d’énormes soucis avec elle, le lien se fait assez rapidement). \n\nPhysiquement aujourd’hui il ne me reste plus que 1) ce clapet ouvert constamment et qui me donne donc parfois de gros reflux mais qui sont très bien soignés par la prise d’inexium sur quelques mois. \n2) Et quatre dents que j’ai carrément dû faire raser pour mettre un bridge (de fausses dents permanentes quoi. Je le précise parce qu’on pense que les bridges sont une espèce de truc bizarre réservés aux vieux, mais en fait non. Et même si ça coûte bien cher, genre 600 balles par dents, ensuite c’est pour la vie), parce que l’acidité due aux vomissements quotidiens les avaient complètement « limées » et que ça ne faisait carrément pas propre. \nJ’ai toujours eu de très belles dents ainsi qu’un très beau sourire en plus, donc ça me faisait passablement chier d’avoir tout abîmé comme ça et d’avoir l’air d’une camée au niveau buccal. \nEt c’est tout ! \n\nEt pourtant à l’époque c’était catastrophique. \nPlusieurs fois par jour comme toi (jusqu’à dix fois par jour). Tous les jours. Avec que ça dans la tête. J’ai passé le bac à moitié dans les chiottes à faire semblant d’être malade. \nJ’avais tous les vaisseaux sanguins autour des yeux en permanence éclatés (des points rouges partout) à force de forcer sur le visage tête en bas. \nMal à la gorge tout le temps, ultra ballonnée (envie de peter très souvent hein, autant dire vraiment les choses), mal à la mâchoire, les yeux gonflés, les ganglions de la gorge enflés, des pointes au cœur très bizarres, l’impression d’être physiquement épuisée. \nAlors même si un témoignage n’est jamais une preuve et ne vaut jamais comme ultime vérité, il est possible de s’en sortir sans trop de séquelles. \nJ’ai appris récemment que ma belle-sœur avait eu le même souci que nous. Elle a eu la chance de n’avoir aucune séquelle physique. \n\nJe voudrais te dire, et dire à tous ceux qui me liront, que c’est possible d’arrêter. \nÇa ne se fait pas du jour au lendemain, mais c’est possible même quand on est au pire stade de la maladie (à ne vivre plus qu’à travers et pour ça. Dépenser tout son argent là-dedans, faire son emploi du temps en fonction de ça, etc.) \n\nChacun aura sa façon (ses façons même) d’y parvenir, et malheureusement je crois qu’aucun conseil spécifique n’est applicable à tout.e.s mais je vous promets que même quand on croit que c’est impossible et qu’on a envie d’en finir : on peut y arriver. \nPerso, je n’ai pas essayé d’arrêter la boulimie je crois. J’ai finalement réussi à me détacher des emprises extérieures et à faire ce que j’avais vraiment envie de faire en envoyant chier les personnes à qui ça ne plaisait pas. \nJ’adorais le cinéma, l’écriture, la photo, les trucs bizarres : j’étais bizarre et je le suis toujours, et en fait c’est en rencontrant des gens qui m’aimaient sincèrement avec ma bizarrerie (et le sincèrement fait toute la différence, parce que d’autres n’aimaient que ma bizarrerie parce que c’était « cool d’avoir une amie aussi barrée ») et en me lançant du coup moi aussi sincèrement dans des activités qui me plaisaient que ça a finalement disparu (sans que je n’y pense vraiment). \nPar ex: Progressivement, je me suis aperçue que j’avais envie d’écrire ce scénario, je l’écrivais, je ne voyais pas le temps passer, le soir arrivait et je m’apercevais que j’avais carrément oublié de manger ! Le soir je vomissais une ou deux fois, par « principe », et voilà comme ça a commencé. \nJe crois que le truc similaire chez tous ceux qui sont guéris, c’est une forme d’émancipation face à un juge interne qui s’est fabriqué à cause de pressions extérieures. Ce juge interne finit par disparaître quand on se découvre vraiment à travers de nouveaux regards, de nouvelles appréciations. \n\nOn aura toujours un rapport à la nourriture différent (moi maintenant parfois je saute des repas quand je suis très investie dans un tâche, mais je ne compense pas après. Mais je sais qu’il est assez inhabituel d’oublier de manger). \nJe mange seulement quand j’en ai envie moi. \nDu coup je déjeune à 15h, je prends un goûter bien gourmand à 19h, et ensuite je remange vers 23h, et généralement je me fais un yaourt avant d’aller dormir vers 2h. Et je ne change absolument rien par devoir social. Les autres savent que mes horaires de repas sont les miens, et je pense que ça m’a bien aidée aussi qu’on accepte cette part un peu socialement inadaptée de moi. \n\nBeaucoup de courage à tout le monde. La guérison est possible et même souvent très probable après le début de la vie « d’adulte » (bon moi faudra qu’on m’explique à quel moment j’ai oublié de signer le papier « je suis adulte » parce que clairement je ne le suis pas, mais vous avez compris).",
      "created_utc": 1724281131.0,
      "score": 1,
      "context": [
        {
          "id": "lhp9rix",
          "author": "Willing_Explorer198",
          "body": "Hi! 20yrs (female) and been bulimic for 6 years BP everyday multiple times, wondering if a full PHYSICAL recovery is possible, did your body ever heal completely after that?",
          "created_utc": 1723439390.0
        }
      ]
    },
    {
      "id": "l8eenbp",
      "author": "Electronic-Ad774",
      "body": "I Hope youre doing well and recovered:)",
      "created_utc": 1718269778.0,
      "score": 1,
      "context": [
        {
          "id": "hoyoqsc",
          "author": "slayerjay14",
          "body": "Hey sorry I’ve been in recovery for what seems like forever now and nothing is working. Did you happy to get an ED nutritionist? How did you figure out what to eat and such. For me the bloat is the biggest issue. I want to throw up after every meal literally just due to the bloating I get and can’t find a way to remedy it.",
          "created_utc": 1639772658.0
        }
      ]
    },
    {
      "id": "hjgum5b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636146858.0,
      "score": 1,
      "context": [
        {
          "id": "hjdp86t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636088392.0
        },
        {
          "id": "hjfwora",
          "author": "BunnyBon09",
          "body": "Thank you for your kind words. I appreciate the comment! As for the butt issues, I just put two and two together because I was otherwise healthy and undoubtedly, throwing up was not healthy for my gut at all. I was able to confirm it when I was finally able to stop for weeks and the itch went away, and when I relapsed even for a day it would go back. How long have you tried not bingeing and purging? Are you still doing it now? Try to stop b/p for at least a month and see what happens. You really need to commit to it for your gut to rebalance yourself. As  for my digestion, it's actually fine aside from acid reflux problems. I will be getting an endoscopy/gastroscopy at the end of the year, though, just to make sure. Have you tried getting scoped before? Maybe it could also give clues as to why it's happening, but really, it only stopped for me when I consistently stopped the b/p.",
          "created_utc": 1636134015.0
        }
      ]
    },
    {
      "id": "hjkrwao",
      "author": "esoterique87",
      "body": "My pleasure! It's always helpful to have others to cheer us on, no matter what stage we are at. Connecting with people who have been there has been so great for my recovery. We are all in this together. \n\nJust to clarify, I'm 4 years in recovery but not 4 years without purging. I'm more like 1 year without purging. Recovery has been quite a journey for me and definitely not linear.\n\nAt the beginning of recovery my digestion was really bad and I would get severe bloating/pain. Luckily that didn't last for more than a few weeks and it drastically improved. I was extremely emotional during recovery and my moods were all over the place. After having numbed myself for so many years, suddenly I was no longer numb and I was feeling everything. This was actually good even though it was difficult. Tolerating difficult emotions is a life skill and I'm forever grateful that I have this ability. \n\nI have a bit of acid reflux but its getting better all the time. I need to make a dental appointment which I've been putting off. I'm not experiencing any tooth pain or issues but I know it's a good idea to get checked out. The body is amazing at healing itself and I've been very lucky that my physical health is good.\n\nI'm glad to know you are aware of the risks around losing weight and that you are being careful. You sound like you're in a really good place and you have a lot of self awareness.  \n\nCheers to us and to recovery! 💜",
      "created_utc": 1636221532.0,
      "score": 2,
      "context": [
        {
          "id": "hjghk4t",
          "author": "esoterique87",
          "body": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗",
          "created_utc": 1636141939.0
        },
        {
          "id": "hji9t2u",
          "author": "BunnyBon09",
          "body": "Congratulations on being able to recover for 4 years! What have your symptoms been like while recovering? Do you still have lingering issues after 4 years without purging? \n\nI really appreciate the concern! Tbh I did have those relapse issues at the start; but I think at this point I'm never going to purge again because I've been starting to be afraid of the consequences. The acid reflux and LPR are no joke, as well as the root canals so I'm a bit traumatized out of the habit. At my highest after recovery I was at 128 lbs, slowly but surely, 3 months later at the moment I'm at 123 lbs. I have no plans on getting as low as I used to, but still I'll make sure to be vigilant and not to get complacent. Again, congrats for making it out as well! Thank you for sharing with me your experiences. :)",
          "created_utc": 1636169299.0
        }
      ]
    },
    {
      "id": "hjyyuzp",
      "author": "Cheerio520",
      "body": "The most extreme thing I did was go to an ayahuasca camp in Peru in the naiive hope it would fully cure me.\n\nThe camp was therapy based so really helped me understand some stuff but it definitely didn't cure me.",
      "created_utc": 1636485179.0,
      "score": 1,
      "context": [
        {
          "id": "hjphnn6",
          "author": "Cheerio520",
          "body": "Our story is so similar.  I'm weirded out. \n\nSame amount of time, same age,   same height, a lot of the same sneaky tactics although mine were instinctive not researched, \n\nEven the issues with my butt although i actually caused a huge rip down there and hemarroids at the grand age of 26. It's actually recently return as I'm slowly starting recovery.  I'll actually need surgery in due course. Luckily my teeth have always been in surpringly good condition though. \n\nI think the only difference is i took the bulimarexic route to have the fit body for 7 years.\n\n\nAnd the fact i need significant trauma based psychotherapy. So it's not really doing it on my own. \n\n\nI found the biggest regrets **weren't** body wise as i was so crazy in my disorder i had the body i wanted for quite a while.  It was more the money i spent on binge purge food,  and the chronic exhaustion and always feeling like shot and the refusal to let it go as a stress management vice. \n\nI've also been caught in some incredibly embarrassing situations,  being busted at work, having my car searched by police because i looked suss as i had binged and was ready to use to the public toilet,  clogging a toilet in my parents house and costing them a plumber,  looks of pity from supermarket staff even though i would rotate to 7 different supermarkets to try to cover it up,  throwing up in a bag in my car before work. Being caught multiple times nicking other people's food. \nAnd the simple crazy amount of time i spent each day doing it. \n\n.",
          "created_utc": 1636311608.0
        },
        {
          "id": "hjvvkg7",
          "author": "BunnyBon09",
          "body": "I honestly regret the amount of money I spent, too. I was getting a big allowance from my parents and literally it all went out the drain when I'd order multiple food items at a time and buy food to binge on. It's such a waste. I'm glad we realized that and it's a good deterrent not to do it again since there's so much better things we can be spending it on!\n\nI've also gone through all of those embarrassing situations! I've been caught throwing up a couple of times, too, and I've had to pretend I was just sick. Honestly, it is the worst. \n\nI'm wishing you the best for your recovery. Honestly, I didn't think I could do it on my own and was almost at the point where I wanted to go inpatient or do something extreme since years of trying to break free really didn't work. But I guess I linked my obsession to it to being seen by other people as \"fat\", and the only thing that finally made me stop is being forced not to see people for a while due to the lockdowns. Tbh I'm still planning to get help to iron my issues out, since it might also be trauma-based. I was bullied and shunned a lot growing up for being fat (as I think a lot of people who have EDs were,) and now I'm just deathly afraid to be called fat again. \n\nWe can do this! It's not too late for us.",
          "created_utc": 1636424362.0
        }
      ]
    },
    {
      "id": "hku2knu",
      "author": "SheaShortcake",
      "body": "Thankyou for the advice, I’ve managed to reduce from daily to 2 times a week which is something I guess.",
      "created_utc": 1637055106.0,
      "score": 2,
      "context": [
        {
          "id": "hkhifgs",
          "author": "SheaShortcake",
          "body": "This amazing, you should be incredibly proud of yourself. I feel like I’m so close to recovery and this post showed me there is hope. Please can I ask what you would recommend to do when the urges to b/p arise? They feel so overwhelming like I have to respond to them.",
          "created_utc": 1636829030.0
        },
        {
          "id": "hkti4ks",
          "author": "BunnyBon09",
          "body": "Hello there! There is hope, and I'm sure you'll be able to overcome it, too. What I will recommend depends on what stage of recovery you're in and how much you've been doing it and how long. Because, if you're still stuck in the daily b/p cycle, nothing will be able to help you stop it unless you take the external pressure off you to do b/p. For me, the external pressure was going out and being seen by people. I needed to take the time not to be seen, and used weightlifting as a \"healthy\" way to gain weight while I was recovering. But now, when the urge arises I just think about all the health effects it has given me. The painful root canals, the heartburn, the fact that I might not be able to enjoy life later on because of all the health effects I'd be suffering. I also look at GERD and bulimia posts online to see posts written by those who've had it for decades and tell myself I'd be living with the same amount of suffering and regret if I don't stop it now.",
          "created_utc": 1637040085.0
        }
      ]
    },
    {
      "id": "ljale9q",
      "author": "Downtown_Job_8154",
      "body": "Et je me sens obligée d’ajouter quand même : \nIl se trouve qu’après de multiples hospitalisations en HP (souvent courtes), je suis bipolaire. \nQuinze ans d’errance médicale avant un vrai diagnostic (quand j’avais quinze ans cette maladie était très mal connue). \nJ’ai essayé une quinzaine de psychiatres différents avant de trouver la pépite absolue (huit ans que je le vois : il a changé ma vie et m’a sauvée après une énième tentative de suicide mais qui risquait bien d’être la dernière…)\nEt je prends un traitement, qui s’est allégé d’années en années. \nJe ne vais pas mentir, j’ai toujours un rapport compliqué au monde et aux autres, ainsi qu’à mon corps (sexualité compliquée, acné hormonale toujours un présente à 35 ans, je souffre de dermatillopatite, et je sais bien que je ne suis pas l’abri d’une petite rechute, mais bon, en huit ans comme je n’en ai fait qu’une d’un mois, je suis plutôt confiante à ce sujet. D’ailleurs dernier truc quand même : évitez à tout prix d’avoir des amis qui peuvent souffrir de la même maladie et d’en parler avec eux. Parler des vrais causes, de la vie, des états d’âmes : oui. Partager vos frasques alimentaires : non !!! Parler de troubles alimentaires : non plus !!! Faut pas oublier qu’on est comme des addicts qui seront toujours addicts mais abstinents. Faut pas trop parler des problèmes liés directement à la drogue du coup)",
      "created_utc": 1724282917.0,
      "score": 1,
      "context": [
        {
          "id": "lhp9rix",
          "author": "Willing_Explorer198",
          "body": "Hi! 20yrs (female) and been bulimic for 6 years BP everyday multiple times, wondering if a full PHYSICAL recovery is possible, did your body ever heal completely after that?",
          "created_utc": 1723439390.0
        },
        {
          "id": "ljagbqa",
          "author": "Downtown_Job_8154",
          "body": "Bonjour, c’est la première fois que je publie sur Reddit (35 ans, je suis bien vieille pour ici j’ai l’impression moi. Avant c’était doctissimo qu’on utilisait pour ça). \n\nJ’ai été boulimique vomitive (avec quelques phases de semies anorexies toujours terminées par un festival comme on les déteste) de mes seize à vingt-sept ans (avec une très brève rechute d’un mois suite à un décès en 2019), mais on peut dire que je suis guérie parce que c’est presque quelque chose que j’ai oublié et dont je ne me souviens que lorsque quelqu’un parle de TOC ou en ce moment parce que j’ai de gros reflux et que je dois prendre de l’inexium (après une visite chez un gastro entérologue y’a huit ans, on a vu des ulcères et détecté un clapet qui n’était plus capable de se fermer - d’où les rejets). \n\nBref, dans mon cas je sais que les ulcères sont surtout liés à une ultra consommation d’ibuprofene et d’aspirine quand j’étais ado et au début de ma vie d’adulte (j’avais littéralement envie d’avoir toujours un médoc dans le corps à l’époque. Ma mère était pharmacienne, et j’avais d’énormes soucis avec elle, le lien se fait assez rapidement). \n\nPhysiquement aujourd’hui il ne me reste plus que 1) ce clapet ouvert constamment et qui me donne donc parfois de gros reflux mais qui sont très bien soignés par la prise d’inexium sur quelques mois. \n2) Et quatre dents que j’ai carrément dû faire raser pour mettre un bridge (de fausses dents permanentes quoi. Je le précise parce qu’on pense que les bridges sont une espèce de truc bizarre réservés aux vieux, mais en fait non. Et même si ça coûte bien cher, genre 600 balles par dents, ensuite c’est pour la vie), parce que l’acidité due aux vomissements quotidiens les avaient complètement « limées » et que ça ne faisait carrément pas propre. \nJ’ai toujours eu de très belles dents ainsi qu’un très beau sourire en plus, donc ça me faisait passablement chier d’avoir tout abîmé comme ça et d’avoir l’air d’une camée au niveau buccal. \nEt c’est tout ! \n\nEt pourtant à l’époque c’était catastrophique. \nPlusieurs fois par jour comme toi (jusqu’à dix fois par jour). Tous les jours. Avec que ça dans la tête. J’ai passé le bac à moitié dans les chiottes à faire semblant d’être malade. \nJ’avais tous les vaisseaux sanguins autour des yeux en permanence éclatés (des points rouges partout) à force de forcer sur le visage tête en bas. \nMal à la gorge tout le temps, ultra ballonnée (envie de peter très souvent hein, autant dire vraiment les choses), mal à la mâchoire, les yeux gonflés, les ganglions de la gorge enflés, des pointes au cœur très bizarres, l’impression d’être physiquement épuisée. \nAlors même si un témoignage n’est jamais une preuve et ne vaut jamais comme ultime vérité, il est possible de s’en sortir sans trop de séquelles. \nJ’ai appris récemment que ma belle-sœur avait eu le même souci que nous. Elle a eu la chance de n’avoir aucune séquelle physique. \n\nJe voudrais te dire, et dire à tous ceux qui me liront, que c’est possible d’arrêter. \nÇa ne se fait pas du jour au lendemain, mais c’est possible même quand on est au pire stade de la maladie (à ne vivre plus qu’à travers et pour ça. Dépenser tout son argent là-dedans, faire son emploi du temps en fonction de ça, etc.) \n\nChacun aura sa façon (ses façons même) d’y parvenir, et malheureusement je crois qu’aucun conseil spécifique n’est applicable à tout.e.s mais je vous promets que même quand on croit que c’est impossible et qu’on a envie d’en finir : on peut y arriver. \nPerso, je n’ai pas essayé d’arrêter la boulimie je crois. J’ai finalement réussi à me détacher des emprises extérieures et à faire ce que j’avais vraiment envie de faire en envoyant chier les personnes à qui ça ne plaisait pas. \nJ’adorais le cinéma, l’écriture, la photo, les trucs bizarres : j’étais bizarre et je le suis toujours, et en fait c’est en rencontrant des gens qui m’aimaient sincèrement avec ma bizarrerie (et le sincèrement fait toute la différence, parce que d’autres n’aimaient que ma bizarrerie parce que c’était « cool d’avoir une amie aussi barrée ») et en me lançant du coup moi aussi sincèrement dans des activités qui me plaisaient que ça a finalement disparu (sans que je n’y pense vraiment). \nPar ex: Progressivement, je me suis aperçue que j’avais envie d’écrire ce scénario, je l’écrivais, je ne voyais pas le temps passer, le soir arrivait et je m’apercevais que j’avais carrément oublié de manger ! Le soir je vomissais une ou deux fois, par « principe », et voilà comme ça a commencé. \nJe crois que le truc similaire chez tous ceux qui sont guéris, c’est une forme d’émancipation face à un juge interne qui s’est fabriqué à cause de pressions extérieures. Ce juge interne finit par disparaître quand on se découvre vraiment à travers de nouveaux regards, de nouvelles appréciations. \n\nOn aura toujours un rapport à la nourriture différent (moi maintenant parfois je saute des repas quand je suis très investie dans un tâche, mais je ne compense pas après. Mais je sais qu’il est assez inhabituel d’oublier de manger). \nJe mange seulement quand j’en ai envie moi. \nDu coup je déjeune à 15h, je prends un goûter bien gourmand à 19h, et ensuite je remange vers 23h, et généralement je me fais un yaourt avant d’aller dormir vers 2h. Et je ne change absolument rien par devoir social. Les autres savent que mes horaires de repas sont les miens, et je pense que ça m’a bien aidée aussi qu’on accepte cette part un peu socialement inadaptée de moi. \n\nBeaucoup de courage à tout le monde. La guérison est possible et même souvent très probable après le début de la vie « d’adulte » (bon moi faudra qu’on m’explique à quel moment j’ai oublié de signer le papier « je suis adulte » parce que clairement je ne le suis pas, mais vous avez compris).",
          "created_utc": 1724281131.0
        }
      ]
    },
    {
      "id": "hji7doy",
      "author": "BunnyBon09",
      "body": "That's great! Only doing it 3 times in months is a feat! Well, I did have digestion issues at the start. My tummy would bloat really badly and it would hurt when I tried digesting things that were hard to digest (like medium rare red meat.) Try sticking to fast-track, easily digestible foods for at least a month to see if it will help. If not, maybe it's time to go to the doctor because I do think that's a legit medical concern. The good thing is, now that you're recovering you'd be giving your digestive system a chance to heal.",
      "created_utc": 1636168025.0,
      "score": 2,
      "context": [
        {
          "id": "hjdp86t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636088392.0
        },
        {
          "id": "hjfwora",
          "author": "BunnyBon09",
          "body": "Thank you for your kind words. I appreciate the comment! As for the butt issues, I just put two and two together because I was otherwise healthy and undoubtedly, throwing up was not healthy for my gut at all. I was able to confirm it when I was finally able to stop for weeks and the itch went away, and when I relapsed even for a day it would go back. How long have you tried not bingeing and purging? Are you still doing it now? Try to stop b/p for at least a month and see what happens. You really need to commit to it for your gut to rebalance yourself. As  for my digestion, it's actually fine aside from acid reflux problems. I will be getting an endoscopy/gastroscopy at the end of the year, though, just to make sure. Have you tried getting scoped before? Maybe it could also give clues as to why it's happening, but really, it only stopped for me when I consistently stopped the b/p.",
          "created_utc": 1636134015.0
        },
        {
          "id": "hjgum5b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636146858.0
        }
      ]
    },
    {
      "id": "j07oywf",
      "author": "random_hero23",
      "body": "I know this was a year ago but you have inspired me and I have to reach out because I feel so stuck!im trying to recover but finding it so hard, did you experience extreme hunger? Did you go all in or a meal plan? Sorry to bombard you haha",
      "created_utc": 1671040181.0,
      "score": 1,
      "context": [
        {
          "id": "hjghk4t",
          "author": "esoterique87",
          "body": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗",
          "created_utc": 1636141939.0
        },
        {
          "id": "hji9t2u",
          "author": "BunnyBon09",
          "body": "Congratulations on being able to recover for 4 years! What have your symptoms been like while recovering? Do you still have lingering issues after 4 years without purging? \n\nI really appreciate the concern! Tbh I did have those relapse issues at the start; but I think at this point I'm never going to purge again because I've been starting to be afraid of the consequences. The acid reflux and LPR are no joke, as well as the root canals so I'm a bit traumatized out of the habit. At my highest after recovery I was at 128 lbs, slowly but surely, 3 months later at the moment I'm at 123 lbs. I have no plans on getting as low as I used to, but still I'll make sure to be vigilant and not to get complacent. Again, congrats for making it out as well! Thank you for sharing with me your experiences. :)",
          "created_utc": 1636169299.0
        },
        {
          "id": "hjkrwao",
          "author": "esoterique87",
          "body": "My pleasure! It's always helpful to have others to cheer us on, no matter what stage we are at. Connecting with people who have been there has been so great for my recovery. We are all in this together. \n\nJust to clarify, I'm 4 years in recovery but not 4 years without purging. I'm more like 1 year without purging. Recovery has been quite a journey for me and definitely not linear.\n\nAt the beginning of recovery my digestion was really bad and I would get severe bloating/pain. Luckily that didn't last for more than a few weeks and it drastically improved. I was extremely emotional during recovery and my moods were all over the place. After having numbed myself for so many years, suddenly I was no longer numb and I was feeling everything. This was actually good even though it was difficult. Tolerating difficult emotions is a life skill and I'm forever grateful that I have this ability. \n\nI have a bit of acid reflux but its getting better all the time. I need to make a dental appointment which I've been putting off. I'm not experiencing any tooth pain or issues but I know it's a good idea to get checked out. The body is amazing at healing itself and I've been very lucky that my physical health is good.\n\nI'm glad to know you are aware of the risks around losing weight and that you are being careful. You sound like you're in a really good place and you have a lot of self awareness.  \n\nCheers to us and to recovery! 💜",
          "created_utc": 1636221532.0
        }
      ]
    },
    {
      "id": "hku8e86",
      "author": "BunnyBon09",
      "body": "The fact that you were able to break out of the daily cycle means you're more than halfway there. That's the worst and hardest part (at least for me). You just need to take it easy on yourself and remember that progress is not linear. You've already come so far! If you've been able to reduce it to that frequency, you can also get those habit tracker apps which tell you how long you've been able to do/break a habit. It might be easier to stop when you can see how many days you've gone through without b/p.",
      "created_utc": 1637060019.0,
      "score": 1,
      "context": [
        {
          "id": "hkhifgs",
          "author": "SheaShortcake",
          "body": "This amazing, you should be incredibly proud of yourself. I feel like I’m so close to recovery and this post showed me there is hope. Please can I ask what you would recommend to do when the urges to b/p arise? They feel so overwhelming like I have to respond to them.",
          "created_utc": 1636829030.0
        },
        {
          "id": "hkti4ks",
          "author": "BunnyBon09",
          "body": "Hello there! There is hope, and I'm sure you'll be able to overcome it, too. What I will recommend depends on what stage of recovery you're in and how much you've been doing it and how long. Because, if you're still stuck in the daily b/p cycle, nothing will be able to help you stop it unless you take the external pressure off you to do b/p. For me, the external pressure was going out and being seen by people. I needed to take the time not to be seen, and used weightlifting as a \"healthy\" way to gain weight while I was recovering. But now, when the urge arises I just think about all the health effects it has given me. The painful root canals, the heartburn, the fact that I might not be able to enjoy life later on because of all the health effects I'd be suffering. I also look at GERD and bulimia posts online to see posts written by those who've had it for decades and tell myself I'd be living with the same amount of suffering and regret if I don't stop it now.",
          "created_utc": 1637040085.0
        },
        {
          "id": "hku2knu",
          "author": "SheaShortcake",
          "body": "Thankyou for the advice, I’ve managed to reduce from daily to 2 times a week which is something I guess.",
          "created_utc": 1637055106.0
        }
      ]
    },
    {
      "id": "j0c6fkz",
      "author": "esoterique87",
      "body": "No apologies necessary! Even though it's hard, I am so happy to hear you are in your recovery process. It is completely normal to feel stuck and if you are recovering on your own, the process can seem even more challenging.\n\nI definitely experienced extreme hunger and mine lasted for several months. I'm currently working with a recovery coach who is an incredible resource and knows a lot about recovery and eating disorders. Here is a link to a video of hers where she discusses extreme hunger.\n\n[Dealing with Extreme Hunger in Recovery](https://www.youtube.com/watch?v=zh5PnDS0xsI&t=3s)\n\nI tried \"all in recovery\" but I ended up relapsing after a year and that method did not work for me. When I started working with my coach we used a meal plan which included 3 meals and 2-3 snacks a day, eating every 3 hours. I still follow this structure of eating just to ensure that I am getting enough food and keep my blood sugar levels stable.\n\nRemember there is no \"right way to recover\" there is only what works for you. If you have any more questions feel free to message me. I am more than happy to help. ❤️",
      "created_utc": 1671120835.0,
      "score": 1,
      "context": [
        {
          "id": "hjghk4t",
          "author": "esoterique87",
          "body": "Thank you so much for sharing your story. It is wonderful that you have reclaimed your life from such an all consuming illness. You should be so proud of all your efforts and hard work. \n\nI had an eating disorder for over 15 years and it can be incredibly difficult for long time sufferers to recover. I can relate to a lot of your story and you are definitely not the only one who has gone through this. I've been in recovery for 4 years and it's been a journey. Recovery is incredibly difficult but infinitely worth it. I feel like I recovered my true self, the person I was before I ever got sick, the little girl who was always on her own side.\n\nYou mentioned \"cutting down in a healthy way\" which is a bit concerning. When I first went into recovery, after about six months, I had gained weight. The weight gain was torturous to my eating disorder, which was still present in my thoughts even though my behaviors were gone. I went on a diet in order to lose it the weight and I told myself I was doing it in a \"healthy way.\" I ended up relapsing and it took me over a year to climb out of that relapse. I urge you to be careful because this kind of thinking can be a very slippery slope. I'm not saying this will happen to you, I just want you to be aware that your eating disorder can still be active in your thoughts and use the guise of \"getting healthy\" in order to weasel its way back into your life.\n\nYou are amazing, strong and you have your whole life ahead of you. Take good care and keep up the fantastic work. Lots of love! 💗",
          "created_utc": 1636141939.0
        },
        {
          "id": "hji9t2u",
          "author": "BunnyBon09",
          "body": "Congratulations on being able to recover for 4 years! What have your symptoms been like while recovering? Do you still have lingering issues after 4 years without purging? \n\nI really appreciate the concern! Tbh I did have those relapse issues at the start; but I think at this point I'm never going to purge again because I've been starting to be afraid of the consequences. The acid reflux and LPR are no joke, as well as the root canals so I'm a bit traumatized out of the habit. At my highest after recovery I was at 128 lbs, slowly but surely, 3 months later at the moment I'm at 123 lbs. I have no plans on getting as low as I used to, but still I'll make sure to be vigilant and not to get complacent. Again, congrats for making it out as well! Thank you for sharing with me your experiences. :)",
          "created_utc": 1636169299.0
        },
        {
          "id": "hjkrwao",
          "author": "esoterique87",
          "body": "My pleasure! It's always helpful to have others to cheer us on, no matter what stage we are at. Connecting with people who have been there has been so great for my recovery. We are all in this together. \n\nJust to clarify, I'm 4 years in recovery but not 4 years without purging. I'm more like 1 year without purging. Recovery has been quite a journey for me and definitely not linear.\n\nAt the beginning of recovery my digestion was really bad and I would get severe bloating/pain. Luckily that didn't last for more than a few weeks and it drastically improved. I was extremely emotional during recovery and my moods were all over the place. After having numbed myself for so many years, suddenly I was no longer numb and I was feeling everything. This was actually good even though it was difficult. Tolerating difficult emotions is a life skill and I'm forever grateful that I have this ability. \n\nI have a bit of acid reflux but its getting better all the time. I need to make a dental appointment which I've been putting off. I'm not experiencing any tooth pain or issues but I know it's a good idea to get checked out. The body is amazing at healing itself and I've been very lucky that my physical health is good.\n\nI'm glad to know you are aware of the risks around losing weight and that you are being careful. You sound like you're in a really good place and you have a lot of self awareness.  \n\nCheers to us and to recovery! 💜",
          "created_utc": 1636221532.0
        },
        {
          "id": "j07oywf",
          "author": "random_hero23",
          "body": "I know this was a year ago but you have inspired me and I have to reach out because I feel so stuck!im trying to recover but finding it so hard, did you experience extreme hunger? Did you go all in or a meal plan? Sorry to bombard you haha",
          "created_utc": 1671040181.0
        }
      ]
    },
    {
      "id": "hkwbgku",
      "author": "SheaShortcake",
      "body": "Thankyou so much! I will definitely download an app to keep track of my progress. You’ve come so far too, well done :)",
      "created_utc": 1637094252.0,
      "score": 1,
      "context": [
        {
          "id": "hkhifgs",
          "author": "SheaShortcake",
          "body": "This amazing, you should be incredibly proud of yourself. I feel like I’m so close to recovery and this post showed me there is hope. Please can I ask what you would recommend to do when the urges to b/p arise? They feel so overwhelming like I have to respond to them.",
          "created_utc": 1636829030.0
        },
        {
          "id": "hkti4ks",
          "author": "BunnyBon09",
          "body": "Hello there! There is hope, and I'm sure you'll be able to overcome it, too. What I will recommend depends on what stage of recovery you're in and how much you've been doing it and how long. Because, if you're still stuck in the daily b/p cycle, nothing will be able to help you stop it unless you take the external pressure off you to do b/p. For me, the external pressure was going out and being seen by people. I needed to take the time not to be seen, and used weightlifting as a \"healthy\" way to gain weight while I was recovering. But now, when the urge arises I just think about all the health effects it has given me. The painful root canals, the heartburn, the fact that I might not be able to enjoy life later on because of all the health effects I'd be suffering. I also look at GERD and bulimia posts online to see posts written by those who've had it for decades and tell myself I'd be living with the same amount of suffering and regret if I don't stop it now.",
          "created_utc": 1637040085.0
        },
        {
          "id": "hku2knu",
          "author": "SheaShortcake",
          "body": "Thankyou for the advice, I’ve managed to reduce from daily to 2 times a week which is something I guess.",
          "created_utc": 1637055106.0
        },
        {
          "id": "hku8e86",
          "author": "BunnyBon09",
          "body": "The fact that you were able to break out of the daily cycle means you're more than halfway there. That's the worst and hardest part (at least for me). You just need to take it easy on yourself and remember that progress is not linear. You've already come so far! If you've been able to reduce it to that frequency, you can also get those habit tracker apps which tell you how long you've been able to do/break a habit. It might be easier to stop when you can see how many days you've gone through without b/p.",
          "created_utc": 1637060019.0
        }
      ]
    }
  ]
}