{
  "id": "qrks1i",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1636635607.0,
  "title": "Have you ever swallowed the toothbrush? I did",
  "selftext": "If you need one more reason to recover, here it is. \nI have been purging routinely for about 3 years. Usually there has been no issues. But then this time I had pasta, and it struggled alot to get it all out. Panic intensifies. And I start breathing heavily. While inhaling inbetween pauses the toothbrush disappears..? It took me a moment, and i desperatly try to fish it back up, but is is GONE. Anxiety is through the roof. I search on here, and Google, but can’t find anything helpful. I rush out of the bathroom, crying for my boyfriends help. He doesn’t understand at first, but calls 911. They were concerned, but relieved that I can breath. I was told to drink a little water, and get to the hospital. The SHAME I felt walking in to the hospital with a toothbrush in my stomach… I got questions like «Do you usually do this? Swallow objects». But almost no concern for the ED aspect of it. Anyways, I had to get an endoscopy to get it removed. Mind you, I’m the biggest wimp when it comes to needles, and everthing in a hospital really.\nI survived, but was told that I was quite lucky it all worked out like it did. \n\nPlease be careful, people. \n\nWanted to share the X-rays, but not sure how to. I’m a numb here, that only made this user to share this scary experience.",
  "url": "https://www.reddit.com/r/bulimia/comments/qrks1i/have_you_ever_swallowed_the_toothbrush_i_did/",
  "score": 68,
  "num_comments": 8,
  "comments": [
    {
      "id": "hk8r3sj",
      "author": "shiju333",
      "body": "I knew of someone who swallowed a spoon. It was doubly worse because the hospital didn't believe her and discharged her.",
      "created_utc": 1636660831.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hk7jamo",
      "author": "esoterique87",
      "body": "I'm so sorry that this happened and that you are ok. This happened to me about 10 years ago and it was incredibly traumatic. I also had to go to the hospital and get an endoscopy. Most doctors aren't trained in the area of eating disorders and I received very few questions about my ED.\n\nI'm so glad you are ok. We are both very, very lucky. \n\nGet some good rest. Be kind to yourself. Sending you lots of love and support. ❤️",
      "created_utc": 1636643020.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hk8hws7",
      "author": "theycutoffmywings",
      "body": "nearly chocked on a spoon once, it wasn't as bad as your story. Can't remember what exactly I did, probably franticly shoving it back and forth when I lost grip on it, felt the spoon way to deep down my throat, could hardly breath and paniced but managed to pull it out somehow. Although I actually thought that I will die while I had it down my throat I still used the same spoon once or twice...\n\n&#x200B;\n\nI hope you are better now, I wish you the very best. Thank you for sharing your story and reminding me of my own expirience. I hope it stops at last one person from making the same mistakes as us",
      "created_utc": 1636657068.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hk7ligj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636643998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkamah4",
      "author": "Alyss_in_wonderland6",
      "body": "I didn’t think it was possible. Glad you are okay. Please dont use object. There are other way less dangerous than that",
      "created_utc": 1636691314.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hkbddma",
      "author": "None",
      "body": "Thank you! I’m happy you were as lucky as me in this nightmare situation. Sending you lots of love and support aswell ❤️",
      "created_utc": 1636710748.0,
      "score": 1,
      "context": [
        {
          "id": "hk7jamo",
          "author": "esoterique87",
          "body": "I'm so sorry that this happened and that you are ok. This happened to me about 10 years ago and it was incredibly traumatic. I also had to go to the hospital and get an endoscopy. Most doctors aren't trained in the area of eating disorders and I received very few questions about my ED.\n\nI'm so glad you are ok. We are both very, very lucky. \n\nGet some good rest. Be kind to yourself. Sending you lots of love and support. ❤️",
          "created_utc": 1636643020.0
        }
      ]
    },
    {
      "id": "hkbdlfg",
      "author": "None",
      "body": "I’m sorry you had to go though this too… I is very traumatising. I have also used the same object for purging a couple of times after, but with A LOT of caution.",
      "created_utc": 1636710946.0,
      "score": 1,
      "context": [
        {
          "id": "hk8hws7",
          "author": "theycutoffmywings",
          "body": "nearly chocked on a spoon once, it wasn't as bad as your story. Can't remember what exactly I did, probably franticly shoving it back and forth when I lost grip on it, felt the spoon way to deep down my throat, could hardly breath and paniced but managed to pull it out somehow. Although I actually thought that I will die while I had it down my throat I still used the same spoon once or twice...\n\n&#x200B;\n\nI hope you are better now, I wish you the very best. Thank you for sharing your story and reminding me of my own expirience. I hope it stops at last one person from making the same mistakes as us",
          "created_utc": 1636657068.0
        }
      ]
    },
    {
      "id": "hkbdrfh",
      "author": "None",
      "body": "Yes, it felt like I had to involuntary admit my problem, and it was all very stressful. I’m happy I had a supportive boyfriend beside me..!",
      "created_utc": 1636711095.0,
      "score": 2,
      "context": [
        {
          "id": "hk7ligj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636643998.0
        }
      ]
    },
    {
      "id": "hkbdxx7",
      "author": "None",
      "body": "I didn’t think it was possible either… I felt like I was so good at what I was doing, and how it was working out for so long. I got cocky. And my only hope is that this can warn someone to not do the same mistake, at least be cautious.",
      "created_utc": 1636711256.0,
      "score": 1,
      "context": [
        {
          "id": "hkamah4",
          "author": "Alyss_in_wonderland6",
          "body": "I didn’t think it was possible. Glad you are okay. Please dont use object. There are other way less dangerous than that",
          "created_utc": 1636691314.0
        }
      ]
    }
  ]
}