{
  "id": "qstsfx",
  "subreddit": "bulimia",
  "author": "chognogg",
  "created_utc": 1636779533.0,
  "title": "\"plus sized\" bulimics, where y'all at?",
  "selftext": "sometimes i feel super alone anywhere in the ED community... anyone here overweight and bulimic as well? \n\nwe're just as valid. love you all. (this time of the year is particularly hard for me - are you guys faring well?)",
  "url": "https://www.reddit.com/r/bulimia/comments/qstsfx/plus_sized_bulimics_where_yall_at/",
  "score": 291,
  "num_comments": 71,
  "comments": [
    {
      "id": "hkfh07y",
      "author": "PreservativeAloe",
      "body": "I started my ED with binge eating (in a fat body) ,which led to atypical anorexia and extreme weight loss and then bulimia and weight gain right back to where I began. Now I’m plus sized and bulimic with a side of restriction and it’s super duper fun! Jk it’s hell and I’m sorry you understand.",
      "created_utc": 1636783810.0,
      "score": 97,
      "context": []
    },
    {
      "id": "hkgcg4s",
      "author": "Icy-Argument-2558",
      "body": "Honestly this is why I’ve avoided treatment. Too embarrassed to be around the skinnier people with an ED. Messed up I know",
      "created_utc": 1636809352.0,
      "score": 56,
      "context": []
    },
    {
      "id": "hkfdfc3",
      "author": "Kat-and-mouse",
      "body": "Eyo, but seriously why is late fall/early winter so hard lol",
      "created_utc": 1636781421.0,
      "score": 46,
      "context": []
    },
    {
      "id": "hkfntad",
      "author": "Asleep-Cycle3788",
      "body": "Was put on heavy depression meds. I was brave enough to step on the scale and realized I'd put on 40 pounds in the past year and a half since I started them. I've been so unhappy with my body image that I've been purging twice a day for the last few weeks. I've always been larger and fought hard to lose weight in a healthy way. Seeing most of my hard work undone has broken me. But nobody seems to take my struggle seriously because I'm heavier. I feel ya.",
      "created_utc": 1636789010.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hkfbwct",
      "author": "None",
      "body": "Me I'm thick and suffer from bulimia. Not alone",
      "created_utc": 1636780465.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hkfhc75",
      "author": "x0mbigrl",
      "body": "Heyyy, it's me, ya girl.. fat bulimic checking in. I totally feel you about loneliness in the community. But hey, I'm here, you're here, others are here too! There are dozens of us! For real though.. we are just as valid and we all have the same demons in our head. It is particularly difficult this time of year with the holidays (I'm not American but I still consider this holiday season now). Ugh.",
      "created_utc": 1636784049.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hkftc5u",
      "author": "Doomalicious",
      "body": "I’m fat af and bulimic. I gotchu fam.",
      "created_utc": 1636793771.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hkg02su",
      "author": "WDJ418",
      "body": "I’m here! And definitely not okay right now. I truly believe that all issues with food run along the same spectrum. But I do have a really hard time with the fact that others have the same “problems” that I do, but get to walk around in thin bodies. It’s ridiculous, but my mind just screams, “So I get to shoulder the burden of all of these damaging behaviors AND still be fat?!” \n\nAll of the struggle, and we don’t even get to struggle in a socially accepted body.",
      "created_utc": 1636799826.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hkg1va6",
      "author": "qiaozhina",
      "body": "hello yes, I am a fat bulimic. I just got insanely embarrassed because i had to go outside and be perceived by people",
      "created_utc": 1636801415.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hkfstfy",
      "author": "pattycakt",
      "body": "Me. The worse it’s getting the more weight I’m gaining. Im convinced my years of crash dieting and on/off bulimia has messed my body up. \n\nI also don’t work out because I get even hungrier when I do work out.",
      "created_utc": 1636793314.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hkfc82s",
      "author": "nina_2004",
      "body": "I'm here and ready to start a binge cause i went to the grocery store and bought a shit ton of things",
      "created_utc": 1636780671.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hkfqrzb",
      "author": "Iliketomod",
      "body": "Don’t stress honey. Only 7% of people with eating disorders are underweight",
      "created_utc": 1636791535.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hkg6l1p",
      "author": "Csd267",
      "body": "Hi there. I don't even binge anymore, I just purge whatever I've eaten and I'm still fat so, I'm pretty bitter about it. I look up my BMI and guilt myself over it every few days, and sprinkle in some anorexia, too. I'm probably going to really regret all of it when I'm older and it starts to cause health problems but it's so hard to stop.",
      "created_utc": 1636805261.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hkgluv7",
      "author": "None",
      "body": "I'm a fat bulimic (actually fat, not one some of the ED people think is fat...) My Ed started as BED. Then bulimia, then anorexia, then bulimia, then BED, the cycle never ends. Doctors don't take me seriously. A few months ago I lost (large number of weight) by purging and starving and even my THERAPIST congratulated me. Of course I gained it all back. Some bodies are meant to carry more weight than others. We are just as valid",
      "created_utc": 1636814613.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hkfwxd8",
      "author": "Admirable-Cupcake751",
      "body": "HERE I’m just overweight tho",
      "created_utc": 1636796985.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hkg9xbo",
      "author": "None",
      "body": "✋ right here sista! Yesss and its frusterating even trying to reach out to anyone because it's almost as if he doesn't believe me..i mean stereotype ED is super skinny - and i am not that. But this is a very real problem and its to a point idk what to do anymore",
      "created_utc": 1636807716.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hkgy7be",
      "author": "Even-Pilot266",
      "body": "When I started getting help finally I would make the joke “I’m obviously very bad at this” every time I would speak to a new provider or check into an office. Solely because I was embarrassed and assumed it’s what they were thinking. \n\nTurns out in my case it’s “binge eating bulimia” binge eating is an ED on its own that people don’t realize. Binge eating bulimia means I binge out then purge to get control back. TLDR it’s actually super common, but yes unfortunately does not get a lot of attention because when we lost weight it’s a celebration.",
      "created_utc": 1636820386.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkfvux4",
      "author": "queen_squish",
      "body": "Me",
      "created_utc": 1636796022.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hkg6ywx",
      "author": "L-emma",
      "body": "Same here. I started off a little chubby and got very skinny. I was forced to recover and i got over weight so now I'm back to square one :/ oh well. Doesn't feel great haha.",
      "created_utc": 1636805557.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hkgaj2u",
      "author": "CutieLuna",
      "body": "Right here 😅\nI was underweight for years from purging and then the pandemic hit and it made it harder to purge around my family so i gained a ton of weight super quick. It's been so hard",
      "created_utc": 1636808123.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkiiwm7",
      "author": "NeedleworkerWise9683",
      "body": "I thank you for your post because it helped me feel visible today. I struggle with bulimia and I'm overweight as well. I still feel I'm looked at as a moral failing for being fat, and even when I restrict it's basically what I should do. Tess Holiday is a plus size model recently diagnosed with an ED disorder, it still logically was hard for me to accept you can be fat and anorexic and end up malnourished and fat. Regardless it's one day at a time for me, wishing you strength and empathy, as they're my main pillars in my recovery.",
      "created_utc": 1636844621.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkgbzw2",
      "author": "Ok-Effect3327",
      "body": "Hey 🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️💜",
      "created_utc": 1636809064.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkgoh1a",
      "author": "fried_lobsters",
      "body": "Edit for clarity: I'm American and have been bulimic/had  disorder eating for about 9 years\n\nYeah I only looked \"sick\" when I was in High School and even then so, I got praise for looking smaller, which definitely didn't help. I lost weight again when I went through being houseless situation for a few months in 2019, but gained the weight back in 2020 and then some due to the pandemic and just bad habits. Being bulimic and overweight is a mindfuck.\n\n I still restrict, still have an ED, but my body is f*t and sluggish and it has been for years. It's like a fucking battle to lose weight now and it's super triggering especially during this time of year around family and food.  I hope you and everyone here have a community of friends who can support you through the holidays. \n\nSending my love to all of y'all who are in the same boat, up shit's creek with no paddle lmao xx",
      "created_utc": 1636815925.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkgx00j",
      "author": "LifeisHard2257",
      "body": "Fat bulimic here also!",
      "created_utc": 1636819860.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkgyjv6",
      "author": "Even-Pilot266",
      "body": "Thank you for posting this. I’m sure a lot of us are feeling the same in how much we can relate to these comments and are not alone. You are not alone. <3",
      "created_utc": 1636820538.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkhu2lt",
      "author": "girlnamedgypsy",
      "body": "Right here! Been dealing with my ed for 15 years this year.",
      "created_utc": 1636834036.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hki0al5",
      "author": "oldmanjakecat",
      "body": "I’m not plus sized but overweight. Struggling with this disease for 14 years now. The worst part is that because I’m not underweight it makes it so much harder to get treatment because I don’t look sick.",
      "created_utc": 1636836658.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm6y1al",
      "author": "dishoeciate",
      "body": "i’m right here! being bigger feels like it invalidates my eating disorder too, people don’t believe u unless you’re skinny. standing next to a skinny person always hurts and feels so awkward. my mom also mocks me for eating (then yells at me when i don’t eat) and makes me check my weight, like especially after thanksgiving yesterday. i wanted to go to my bfs for thanksgiving so she said in front of everyone that i don’t deserve to because i have an ed so i’m ungrateful. she laughs and says she has an ed too because she’s not always hungry😁",
      "created_utc": 1637958105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hkgnet4",
      "author": "None",
      "body": "I didn’t read all of the comments, so I don’t know if anyone said this already, but I don’t think you’re as alone as you feel. Many people who suffer from bulimia are a normal weight, a steady weight, or overweight. Honestly I put on a bit of weight since suffering. I hope you feel less alone after seeing so many responses!",
      "created_utc": 1636815406.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkh89id",
      "author": "hapineens",
      "body": "🥳🥳🥳 here n thicc!! 🤡",
      "created_utc": 1636824696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkhaost",
      "author": "danisnessie",
      "body": "right hereeeee",
      "created_utc": 1636825712.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkhj8aq",
      "author": "None",
      "body": "Represent!",
      "created_utc": 1636829375.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkhlvxb",
      "author": "elpintor91",
      "body": "Size 10 checking In. I always say if I stopped drinking maybe I could actually lose weight. Sick I know",
      "created_utc": 1636830537.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hki9nzf",
      "author": "big-boy-86",
      "body": "Here... my body has changed a lot since it started, but it doesn’t go away",
      "created_utc": 1636840697.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hknr5xj",
      "author": "Foundation_Fresh",
      "body": "Here. 39. I went to treatment and the others there for bulimia shunned me for being fat and bulimic. Not a safe space when trying to get help.",
      "created_utc": 1636936529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hlmx6wn",
      "author": "MysteryIsHistory",
      "body": "I am currently 45 lbs overweight. I have a baby and I didn’t purge during pregnancy and gained 90 lbs. Even normally, I’m exactly at 25% BMI. I exercise for 3 hours a day and then binge on 5,000 calories. I’m so tired.",
      "created_utc": 1637588066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hm60yqk",
      "author": "bybecs",
      "body": "I don't look 'sick', that's why noone noticed..",
      "created_utc": 1637943125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hntpklt",
      "author": "OkTrain1917",
      "body": "Hey, I've been in and out of ED since I was 12 unconsciously and consciously since I was 14. I was always a chubby kid but it just kept adding on and no one ever seemed to notice that I was suffering from an eating disorder. Now I'm 22 and I have anorexia and orthorexia and I go to the gym and I just consume like 400 cal a day. Eating is v difficult for me. But no one just no one is there to help just because I'm fat. And don't look anorexic.",
      "created_utc": 1639032811.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkgb807",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1636808570.0,
      "score": -6,
      "context": []
    },
    {
      "id": "hm5vhdj",
      "author": "spentundies",
      "body": "This might be a bad things to post, maybe people don’t want to hear this kind of thing. I have put on a bit of weight as I have been winning the fight against purging. I am a 42 year old cis hetero male, and I’ve always been really into weight training and just being a big strong guy. I’ve also been bulimic since 1995. Purging was my way of controlling my caloric intake without exercising any self control regarding eating. For the last couple years I’ve been slowly winning the fight against my ED and I’ve also been gaining weight, about 30 pounds at this point. I’m up to 245 lbs and 215 would be a healthy weight for me. For me, it’s worth it, because my mental health needs to be better before my physical health can recover and I feel like that is finally happening. But it also sucks getting fat.",
      "created_utc": 1637940607.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkqp9tn",
      "author": "None",
      "body": "Okay yes, thank you for asking about this. I feel so alone in it 😔",
      "created_utc": 1636996789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlucmsp",
      "author": "None",
      "body": "Me",
      "created_utc": 1637716159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlv1dij",
      "author": "shyguyyoshi",
      "body": "Here! 😞",
      "created_utc": 1637728119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm2pou0",
      "author": "Vegetable_Race_8237",
      "body": "Fat bulimic/anorexic here, but I did manage to loose 35 lbs in a month… I definitely don’t want to eat anything at this point makes me anxious to think about I’m have to eat soon it’s been a few days",
      "created_utc": 1637872115.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmslg1v",
      "author": "pastelrose7",
      "body": "yep!. started in a fat body, had anorexic tendencies, lost a ton of weight. tried to recover by myself w no doctors or therapists, gained lots of weight but still gave the bulimic and anorexic behaviors",
      "created_utc": 1638365825.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hmtrbiy",
      "author": "None",
      "body": "Ayyyy!!! 😍",
      "created_utc": 1638383348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ho7lytw",
      "author": "Ok_Kaleidoscope_7820",
      "body": "I just got diagnosed with bulimia and I am plus sized. I still don’t believe that I have bulimia tbh. Still trying to process.",
      "created_utc": 1639284733.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hkgvz0f",
      "author": "eggshaustedegg",
      "body": "We’re living the same exact life 😭😭",
      "created_utc": 1636819410.0,
      "score": 15,
      "context": [
        {
          "id": "hkfh07y",
          "author": "PreservativeAloe",
          "body": "I started my ED with binge eating (in a fat body) ,which led to atypical anorexia and extreme weight loss and then bulimia and weight gain right back to where I began. Now I’m plus sized and bulimic with a side of restriction and it’s super duper fun! Jk it’s hell and I’m sorry you understand.",
          "created_utc": 1636783810.0
        }
      ]
    },
    {
      "id": "hmi9xpi",
      "author": "amethystupmyass",
      "body": "We really aren’t alone",
      "created_utc": 1638171404.0,
      "score": 2,
      "context": [
        {
          "id": "hkfh07y",
          "author": "PreservativeAloe",
          "body": "I started my ED with binge eating (in a fat body) ,which led to atypical anorexia and extreme weight loss and then bulimia and weight gain right back to where I began. Now I’m plus sized and bulimic with a side of restriction and it’s super duper fun! Jk it’s hell and I’m sorry you understand.",
          "created_utc": 1636783810.0
        }
      ]
    },
    {
      "id": "l1pmh78",
      "author": "cumdropslut",
      "body": "wait so did u gain weight bc u became bulimic? Or did bevoming bulimic also involved a binge ED? I'm srry I'm just confused",
      "created_utc": 1714346600.0,
      "score": 2,
      "context": [
        {
          "id": "hkfh07y",
          "author": "PreservativeAloe",
          "body": "I started my ED with binge eating (in a fat body) ,which led to atypical anorexia and extreme weight loss and then bulimia and weight gain right back to where I began. Now I’m plus sized and bulimic with a side of restriction and it’s super duper fun! Jk it’s hell and I’m sorry you understand.",
          "created_utc": 1636783810.0
        }
      ]
    },
    {
      "id": "hkgyh8w",
      "author": "Even-Pilot266",
      "body": "This was me for so long…",
      "created_utc": 1636820506.0,
      "score": 9,
      "context": [
        {
          "id": "hkgcg4s",
          "author": "Icy-Argument-2558",
          "body": "Honestly this is why I’ve avoided treatment. Too embarrassed to be around the skinnier people with an ED. Messed up I know",
          "created_utc": 1636809352.0
        }
      ]
    },
    {
      "id": "hkr1w69",
      "author": "ricola303",
      "body": "This",
      "created_utc": 1637001758.0,
      "score": 1,
      "context": [
        {
          "id": "hkgcg4s",
          "author": "Icy-Argument-2558",
          "body": "Honestly this is why I’ve avoided treatment. Too embarrassed to be around the skinnier people with an ED. Messed up I know",
          "created_utc": 1636809352.0
        }
      ]
    },
    {
      "id": "hmtrfrf",
      "author": "None",
      "body": "YES!!!",
      "created_utc": 1638383392.0,
      "score": 1,
      "context": [
        {
          "id": "hkgcg4s",
          "author": "Icy-Argument-2558",
          "body": "Honestly this is why I’ve avoided treatment. Too embarrassed to be around the skinnier people with an ED. Messed up I know",
          "created_utc": 1636809352.0
        }
      ]
    },
    {
      "id": "hkfew9s",
      "author": "chognogg",
      "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
      "created_utc": 1636782363.0,
      "score": 16,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        }
      ]
    },
    {
      "id": "hkh1h87",
      "author": "alexisseffy",
      "body": "Not plus sized but late fall/early winter is the WORST I can't stand holiday food and b/p-ing and having to eat out while traveling",
      "created_utc": 1636821812.0,
      "score": 7,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        }
      ]
    },
    {
      "id": "hkia25q",
      "author": "pinksugarxoxo",
      "body": "For me it’s the holidays + seasonal depression + wanting to eat out of boredom",
      "created_utc": 1636840865.0,
      "score": 4,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        }
      ]
    },
    {
      "id": "hkfr6cw",
      "author": "chognogg",
      "body": "I absolutely feel you on this. I regained 40 lbs as well, following the discharge of a hospital and botched recovery. It's hard, frustrating, and depressing to me. I hope you can find peace with food soon, and I'll hold out hope for myself as well. Take care of yourself <3",
      "created_utc": 1636791874.0,
      "score": 11,
      "context": [
        {
          "id": "hkfntad",
          "author": "Asleep-Cycle3788",
          "body": "Was put on heavy depression meds. I was brave enough to step on the scale and realized I'd put on 40 pounds in the past year and a half since I started them. I've been so unhappy with my body image that I've been purging twice a day for the last few weeks. I've always been larger and fought hard to lose weight in a healthy way. Seeing most of my hard work undone has broken me. But nobody seems to take my struggle seriously because I'm heavier. I feel ya.",
          "created_utc": 1636789010.0
        }
      ]
    },
    {
      "id": "hknncx2",
      "author": "JustCallMeAnxious_",
      "body": "Really?  I never knew this!  Is this like perceived in the “beginning of eating disorders or the “recovery” stage or what?",
      "created_utc": 1636934820.0,
      "score": 6,
      "context": [
        {
          "id": "hkfqrzb",
          "author": "Iliketomod",
          "body": "Don’t stress honey. Only 7% of people with eating disorders are underweight",
          "created_utc": 1636791535.0
        }
      ]
    },
    {
      "id": "hkh8ihz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1636824801.0,
      "score": 3,
      "context": [
        {
          "id": "hkgb807",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1636808570.0
        }
      ]
    },
    {
      "id": "hkgybma",
      "author": "Even-Pilot266",
      "body": "I hate Thanksgiving. So much.",
      "created_utc": 1636820438.0,
      "score": 10,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkfew9s",
          "author": "chognogg",
          "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
          "created_utc": 1636782363.0
        }
      ]
    },
    {
      "id": "hkqkt24",
      "author": "Even-Pilot266",
      "body": "Yes! Therapy has taught me how much of this disease is about control even more so than body image. Holidays I think take away our sense of control in our environment. \n\n“You can only control to your fingertips”. We can’t control the environment or stop the holidays from coming but we have to keep control of our own being. For road trips I started packing a cooler of fruit and also journaling. It’s helped me but everyone has their own methods that they will find.",
      "created_utc": 1636995013.0,
      "score": 2,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkh1h87",
          "author": "alexisseffy",
          "body": "Not plus sized but late fall/early winter is the WORST I can't stand holiday food and b/p-ing and having to eat out while traveling",
          "created_utc": 1636821812.0
        }
      ]
    },
    {
      "id": "hkgte1h",
      "author": "Asleep-Cycle3788",
      "body": "Thank you for your kind reply. I hope you're doing alright and continuing to heal every day :)",
      "created_utc": 1636818250.0,
      "score": 4,
      "context": [
        {
          "id": "hkfntad",
          "author": "Asleep-Cycle3788",
          "body": "Was put on heavy depression meds. I was brave enough to step on the scale and realized I'd put on 40 pounds in the past year and a half since I started them. I've been so unhappy with my body image that I've been purging twice a day for the last few weeks. I've always been larger and fought hard to lose weight in a healthy way. Seeing most of my hard work undone has broken me. But nobody seems to take my struggle seriously because I'm heavier. I feel ya.",
          "created_utc": 1636789010.0
        },
        {
          "id": "hkfr6cw",
          "author": "chognogg",
          "body": "I absolutely feel you on this. I regained 40 lbs as well, following the discharge of a hospital and botched recovery. It's hard, frustrating, and depressing to me. I hope you can find peace with food soon, and I'll hold out hope for myself as well. Take care of yourself <3",
          "created_utc": 1636791874.0
        }
      ]
    },
    {
      "id": "hknnhny",
      "author": "Iliketomod",
      "body": "Just overall of diagnosed people",
      "created_utc": 1636934880.0,
      "score": 2,
      "context": [
        {
          "id": "hkfqrzb",
          "author": "Iliketomod",
          "body": "Don’t stress honey. Only 7% of people with eating disorders are underweight",
          "created_utc": 1636791535.0
        },
        {
          "id": "hknncx2",
          "author": "JustCallMeAnxious_",
          "body": "Really?  I never knew this!  Is this like perceived in the “beginning of eating disorders or the “recovery” stage or what?",
          "created_utc": 1636934820.0
        }
      ]
    },
    {
      "id": "hm1hd1k",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1637853005.0,
      "score": 0,
      "context": [
        {
          "id": "hkgb807",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1636808570.0
        },
        {
          "id": "hkh8ihz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1636824801.0
        }
      ]
    },
    {
      "id": "hknmyo1",
      "author": "JustCallMeAnxious_",
      "body": "Me too!  How do you tend to “deal” with it?  I come from a southern family that practically shoves food in your face and gets butthurt if you don’t pile food on your plate",
      "created_utc": 1636934647.0,
      "score": 2,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkfew9s",
          "author": "chognogg",
          "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
          "created_utc": 1636782363.0
        },
        {
          "id": "hkgybma",
          "author": "Even-Pilot266",
          "body": "I hate Thanksgiving. So much.",
          "created_utc": 1636820438.0
        }
      ]
    },
    {
      "id": "hkqipk3",
      "author": "None",
      "body": "ugh, thanksgiving and Xmas are the worst.",
      "created_utc": 1636994171.0,
      "score": 1,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkfew9s",
          "author": "chognogg",
          "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
          "created_utc": 1636782363.0
        },
        {
          "id": "hkgybma",
          "author": "Even-Pilot266",
          "body": "I hate Thanksgiving. So much.",
          "created_utc": 1636820438.0
        }
      ]
    },
    {
      "id": "hkno01e",
      "author": "JustCallMeAnxious_",
      "body": "Wow, thanks for this info.  I honestly never knew that.  I guess it makes sense though",
      "created_utc": 1636935109.0,
      "score": 3,
      "context": [
        {
          "id": "hkfqrzb",
          "author": "Iliketomod",
          "body": "Don’t stress honey. Only 7% of people with eating disorders are underweight",
          "created_utc": 1636791535.0
        },
        {
          "id": "hknncx2",
          "author": "JustCallMeAnxious_",
          "body": "Really?  I never knew this!  Is this like perceived in the “beginning of eating disorders or the “recovery” stage or what?",
          "created_utc": 1636934820.0
        },
        {
          "id": "hknnhny",
          "author": "Iliketomod",
          "body": "Just overall of diagnosed people",
          "created_utc": 1636934880.0
        }
      ]
    },
    {
      "id": "hkqk7sb",
      "author": "Even-Pilot266",
      "body": "I have been seeing a therapist for many years and he taught me the power of saying no. My parents would constantly make me feel guilty for not wanting to eat with them any day of the week not just thanksgiving. They knew about my ED but still found a way to take it personally when I didn’t want to go into a triggering situation. \n\nI’ve actually started skipping the cooking, day grazing, and big meal part of Thanksgiving. I show up towards the end and have a normal amount of food and play card games. \n\nI know it’s easier said than done but since I’ve started being open with the people who need to know (and reminded them many times) then I’ve started receiving the support and acceptance to skip out or arrive late. \n\nYou can always DM me if you have any questions or need support. It is VERY difficult at first and you will be misunderstood, people will be upset, people will push. You just have to learn that your well being depends on you pushing back.",
      "created_utc": 1636994779.0,
      "score": 3,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkfew9s",
          "author": "chognogg",
          "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
          "created_utc": 1636782363.0
        },
        {
          "id": "hkgybma",
          "author": "Even-Pilot266",
          "body": "I hate Thanksgiving. So much.",
          "created_utc": 1636820438.0
        },
        {
          "id": "hknmyo1",
          "author": "JustCallMeAnxious_",
          "body": "Me too!  How do you tend to “deal” with it?  I come from a southern family that practically shoves food in your face and gets butthurt if you don’t pile food on your plate",
          "created_utc": 1636934647.0
        }
      ]
    },
    {
      "id": "hkqmgf2",
      "author": "JustCallMeAnxious_",
      "body": "Thank you I really appreciate that.  I’m trying to work on the power of no.  My therapist and mom both say I’m kinda a pushover",
      "created_utc": 1636995659.0,
      "score": 1,
      "context": [
        {
          "id": "hkfdfc3",
          "author": "Kat-and-mouse",
          "body": "Eyo, but seriously why is late fall/early winter so hard lol",
          "created_utc": 1636781421.0
        },
        {
          "id": "hkfew9s",
          "author": "chognogg",
          "body": "i assume the approaching holidays? although, i be struggling way before they come so idk, lol...",
          "created_utc": 1636782363.0
        },
        {
          "id": "hkgybma",
          "author": "Even-Pilot266",
          "body": "I hate Thanksgiving. So much.",
          "created_utc": 1636820438.0
        },
        {
          "id": "hknmyo1",
          "author": "JustCallMeAnxious_",
          "body": "Me too!  How do you tend to “deal” with it?  I come from a southern family that practically shoves food in your face and gets butthurt if you don’t pile food on your plate",
          "created_utc": 1636934647.0
        },
        {
          "id": "hkqk7sb",
          "author": "Even-Pilot266",
          "body": "I have been seeing a therapist for many years and he taught me the power of saying no. My parents would constantly make me feel guilty for not wanting to eat with them any day of the week not just thanksgiving. They knew about my ED but still found a way to take it personally when I didn’t want to go into a triggering situation. \n\nI’ve actually started skipping the cooking, day grazing, and big meal part of Thanksgiving. I show up towards the end and have a normal amount of food and play card games. \n\nI know it’s easier said than done but since I’ve started being open with the people who need to know (and reminded them many times) then I’ve started receiving the support and acceptance to skip out or arrive late. \n\nYou can always DM me if you have any questions or need support. It is VERY difficult at first and you will be misunderstood, people will be upset, people will push. You just have to learn that your well being depends on you pushing back.",
          "created_utc": 1636994779.0
        }
      ]
    }
  ]
}