{
  "id": "qylyel",
  "subreddit": "bulimia",
  "author": "bauanafish",
  "created_utc": 1637465140.0,
  "title": "i wish i was anorexic instead of bulimic :/",
  "selftext": "it sounds so stupid but i think this every day. i hate feeling so out of control all the time. i hate my ed. i just want to go back to the summer time when res was easier. whyyyy do i have these stupid thoughts urghhhhh",
  "url": "https://www.reddit.com/r/bulimia/comments/qylyel/i_wish_i_was_anorexic_instead_of_bulimic/",
  "score": 172,
  "num_comments": 19,
  "comments": [
    {
      "id": "hlhcfvt",
      "author": "whyamilikethis75",
      "body": "I used to be anorexic then I got forced into recovery. Turned bulimic and I think this everyday. I’ve gained so much and I know it’s horrible but I miss being anorexic.",
      "created_utc": 1637476839.0,
      "score": 60,
      "context": []
    },
    {
      "id": "hlij4z2",
      "author": "None",
      "body": "as someone who has suffered from both (diagnosed anorexia 3 years, diagnosed bulimia 12 years, undiagnosed ednos) i can honestly say that while they are both their own form of hell, I would choose anorexia over bulimia any day, in a heart beat. when i was anorexic, i was numb and absent mostly. the bulimic years were the most catastrophic, volatile, destructive, gruesome, violent years of my life. i felt everything and i felt it so intensely. the burning throat, the blown out asshole (sorry, tmi) from too much laxatives, the constant bloating and discomfort and feelings of shame from a binge.... jesus christ, bulimia was the most horrific ED i've ever had",
      "created_utc": 1637506335.0,
      "score": 36,
      "context": []
    },
    {
      "id": "hli6y1c",
      "author": "None",
      "body": "It's funny cause when I was restrictive anorexic and terrified of binging I was wishing I could go back to purging (I had stopped after a scary incident) because bulimia \"was fun\" and \"at least I could eat whatever I wanted and not gain, now I'm miserable\"..\n\n\nNow I'm on the other side again and find myself wishing I could go back to anorexia because I had \"discipline\". Basically, the grass is greener on the other side",
      "created_utc": 1637499726.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hlj5e0l",
      "author": "None",
      "body": "Completely the same. I’ve had a mix of bulimia and BED for over half my life and to sum it up in three words: “out of control”. I’d absolutely adore to feel in control of my eating. I dream of restricting but still binge every day.",
      "created_utc": 1637515677.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hlkgvlq",
      "author": "havehope2234",
      "body": "I used to feel that way so so much when I struggled with bulimia. for some reason, when i struggled with anorexia, i could somewhat separate it from ruining other parts of my life. Though I still hated my body, I still had the joy of being “smaller”. personally bulimia did something much more severe and intense to my emotional and mental state- i was on the edge of a cliff like 24/7 it was rougher than id ever imagine. \nbut i realized that if I went back to anorexia, it would just be this whole big cycle and id eventually be back to struggling with bulimia bc my body wouldnt last forever with the restriction. i know its hard to live with the struggle of bulimia but dont stop fighting to move forward!! its not worth it to move back to where you started… you are worth so much more than to continue living with an ED!! Theres always a way out, i believe in you!! I thought it was impossible but actually after finally recovering i saw that it was more than possible❤️",
      "created_utc": 1637534918.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hliw5sb",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1637511886.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hlikey7",
      "author": "UrAveragePlayer",
      "body": "I have both",
      "created_utc": 1637506918.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hlko35p",
      "author": "thenaanprophet",
      "body": "I think about this everyday. I'm glad I'm not the only one.",
      "created_utc": 1637538130.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hlkydsj",
      "author": "None",
      "body": "I’ve heard this soooo many times. I struggle with BED and I’ve heard so many people say that got “the wrong eating disorder”",
      "created_utc": 1637542851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ho26q6x",
      "author": "Sweet_Chemical_654",
      "body": "i miss anorexia so much, i was wayy happier then. bulimia is so exhausting and not in the good way that anorexia is where you feel fragile weak and empty, its like a disgusting feeling with bulimia",
      "created_utc": 1639183962.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hlmaj0m",
      "author": "Then-Air-3771",
      "body": "bruh i seriously need some tips to turn this shit around. i’ve been struggling with bulimia for about two years now (and i know that it isn’t a lot comparing to most of yall) but i put on the weight i lost all summer and i think that i will go insane. i honestly feel jealous for the ones that can be disciplined enough to restrict and not binge purge. i need to lose back the weight and i need some advice.",
      "created_utc": 1637570793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hljunja",
      "author": "ShySchemingGorgon",
      "body": "I've been both.  Wish for health.",
      "created_utc": 1637525692.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hljvtx8",
      "author": "Nuppual",
      "body": "This sounds familiar... Did l made almost same post earlier this week... Yes l did!😅😂 But yeah, l wosh that too.😔",
      "created_utc": 1637526167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m33rn74",
      "author": "Technical_Raise1715",
      "body": "Anorexia is a glorified ED unfortunately, due to side effects of extreme weight loss. It’s completely vile that people admire it or want it. People often are ashamed of bulimia as it’s not as talked about or understood. People think it’s gross. But I get you. \n\nWhen I was little I would wish I was anorexic so I could be super skinny (foolish young me) and later developed bulimia- destroyed my body and mind and didn’t even lose any weight!! Annoying- all that effort for nothing!",
      "created_utc": 1734764780.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hlqb7sp",
      "author": "dalexearnhardtsghost",
      "body": "I have both, started with bulimia and got afraid to eat because I was wasting money and my body is so destroyed from bulimia I also stopped eating. I feel horrible all the time . It’s awful. I lost 10 pounds in February and lost 52 more since July because it got really bad. I’m exhausted, but I’m so scared to eat",
      "created_utc": 1637641523.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hliju22",
      "author": "AgentWitneyWiggleton",
      "body": "I am going through the same exact thing. The persistent guilt, shame, and  regret is so fucking loud--I even dream about it!",
      "created_utc": 1637506651.0,
      "score": 8,
      "context": [
        {
          "id": "hlhcfvt",
          "author": "whyamilikethis75",
          "body": "I used to be anorexic then I got forced into recovery. Turned bulimic and I think this everyday. I’ve gained so much and I know it’s horrible but I miss being anorexic.",
          "created_utc": 1637476839.0
        }
      ]
    },
    {
      "id": "hlho9hb",
      "author": "yoykri",
      "body": "Same!!",
      "created_utc": 1637485697.0,
      "score": 6,
      "context": [
        {
          "id": "hlhcfvt",
          "author": "whyamilikethis75",
          "body": "I used to be anorexic then I got forced into recovery. Turned bulimic and I think this everyday. I’ve gained so much and I know it’s horrible but I miss being anorexic.",
          "created_utc": 1637476839.0
        }
      ]
    },
    {
      "id": "hljuq9i",
      "author": "ShySchemingGorgon",
      "body": "I hate to admit it, but yeah.",
      "created_utc": 1637525723.0,
      "score": 2,
      "context": [
        {
          "id": "hlhcfvt",
          "author": "whyamilikethis75",
          "body": "I used to be anorexic then I got forced into recovery. Turned bulimic and I think this everyday. I’ve gained so much and I know it’s horrible but I miss being anorexic.",
          "created_utc": 1637476839.0
        }
      ]
    },
    {
      "id": "hlqx43e",
      "author": "dumbbulimicthrowaway",
      "body": "literally the same thing..  i got diagnosed with AN at the start of forced recovery but by the time i actually got treatment I'd developed a whole different ED :/",
      "created_utc": 1637656711.0,
      "score": 1,
      "context": [
        {
          "id": "hlhcfvt",
          "author": "whyamilikethis75",
          "body": "I used to be anorexic then I got forced into recovery. Turned bulimic and I think this everyday. I’ve gained so much and I know it’s horrible but I miss being anorexic.",
          "created_utc": 1637476839.0
        }
      ]
    },
    {
      "id": "l15s58g",
      "author": "Wild-Student-9033",
      "body": "Why?",
      "created_utc": 1714022763.0,
      "score": 1,
      "context": [
        {
          "id": "hliw5sb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1637511886.0
        }
      ]
    }
  ]
}