{
  "id": "r7qmi0",
  "subreddit": "bulimia",
  "author": "Affectionate-Oven306",
  "created_utc": 1638506366.0,
  "title": "Does anybody else resent their friends?",
  "selftext": "I had my whole day planned out, what I could eat for a reasonable calorie deficit while eating frequently, feeling satiated (in order to not binge) but never to full (to prevent purge triggers). I had it planned. My friends/coworkers wanted to spontaneously go out for beers and pizza at a brewery and I went but it threw off everything. I feel like I got sabotaged. Social situations make me feel like I'm not in control, restaurant food is so hard to track and the uncertainty of what I ate is stressing me out. I want everyone to leave me alone so I can do what I need to do in peace. I find myself resenting my friends and backing out of more social events and I hate it but i also hate how these events, which always center around food, make me feel.",
  "url": "https://www.reddit.com/r/bulimia/comments/r7qmi0/does_anybody_else_resent_their_friends/",
  "score": 80,
  "num_comments": 17,
  "comments": [
    {
      "id": "hn13aii",
      "author": "pineappleonmypizzas",
      "body": "Yes, I completely empathize with this and I hate that I do. I hate that I can easily lie to them and that I want to avoid them. I feel like a shitty friend for it",
      "created_utc": 1638506469.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hn2ej6g",
      "author": "gugeyu",
      "body": "I’ve had this happen several times recently and I try not to resent my friends. My best friend was definitely picking up on my behaviors. One thing that I’ve started doing is still going to the gatherings but getting a soda water instead of alcohol. Especially if it’s frequent (I had two friend hang outs this week). And going for coffee instead of drinks. It’s weird at first, but honestly it gets more comfortable throughout the night as your friends accept that you’re not drinking. Drinking makes me feel so out of control with my b/p, but I can still hang out with my friends and not miss out. I don’t want my ED to completely take my life away and missing social events is a big red flag that it’s taking over your life. It’s ok to miss a few of course. I just tell my friends I have a busy day tomorrow but still want to hang out. It’s mostly true and I don’t want to feel like trash from a late b/p mostly. The food part is still hard and trying to figure that out slowly.",
      "created_utc": 1638539387.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hn1wxai",
      "author": "avocadosnumber7",
      "body": "You are not alone!! I SO relate to this. I was planning my life around food and this illness, and resenting anyone who I felt got in my way. \nI found OA through a friend of mine and I am grateful every day, because I can honestly say I am free from the insanity around food that has plagued me most of my life. Working the 12 steps with a recovered sponsor not only saved my life, but it has helped me reach a level of recovery that allows me to go anywhere and do anything without fear, without needing to control my environment, and without having to restrict any foods. Here is a link to the website, and to a FB page for newcomers if you are interested:\n\nhttps://www.oabigbooksolutiongroup.org/home\n\nhttps://m.facebook.com/groups/1343637915818851/permalink/1951415331707770/?fs=0&focus_composer=0&m_entstream_source=contextual_profile_feed#!/groups/1343637915818851/\n\nI Was skeptical of this approach - I have tried so many things without success. But this truly has changed my life forever. I hope this helps <3 good luck in Your recovery.",
      "created_utc": 1638527718.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hn4fbo8",
      "author": "None",
      "body": "I get invited but never go. Especially now around Christmas. I genuinely hope to get really sick around Christmas eve so I won't have to eat any of the food.",
      "created_utc": 1638569915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hn16njd",
      "author": "wiltedguts",
      "body": "why not , just not go? i understand where ur coming from but u could just say u can’t go so u can stick to whatever eating habits u are doing",
      "created_utc": 1638508277.0,
      "score": -2,
      "context": []
    },
    {
      "id": "hn23qsu",
      "author": "addblocc",
      "body": "I absolutely relate to this. I have avoided hanging out with friends for ED related reasons an embarrassing amount of times. The guilt manifests as anger/resentment towards whoever invited you out, I think.\n\nAnd oh man, I was not prepared for the anger/panic I felt when I realized one of my friends was picking up on my ED behaviors. It's like, the resentment you feel towards your oblivious friends amplified by 10. \n\nI'm so sorry you're going through this, and know that you're not alone in how you feel.",
      "created_utc": 1638533004.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hn27vsr",
      "author": "ugwugwugw",
      "body": "Me. I can’t even date because dates involved food and I’m here being a pathetic singles for years. I lost a lot of friends too because I keep rejecting my friends when they ask me out to eat, and we just stopped contacting after awhile…..",
      "created_utc": 1638535723.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hn3rrr5",
      "author": "None",
      "body": "absolutely. it's impeding my life. the thought of eating when im not ready and in front of people. it's expected though and i force myself to do it. such as dates or meeting with family for dinner. ive told them before i dont like to eat in front of others but they say things like \"dont worry you dont have anything to worry about it's okay\". which should be comforting coming from the ones i love. i genuinely dont know how to eat right. what to eat, what ammout is okay, then you have to balance social interaction at the same time and people loudly questioning why dont you just eat. its even worse for me because i have allergies that greatly restrict my diet, so people will go out of their way to get something for me. the act of kindness is so indescribably meaningful. but god damn, people just don't listen or fully understand.",
      "created_utc": 1638559664.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hn44cvh",
      "author": "Even-Pilot266",
      "body": "Completely understand this, you are not alone at all. We all have tricks we do that help sometimes and sometimes don’t. Truly though, fuck this shit. I’m sorry for your struggle.",
      "created_utc": 1638564767.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hn6re7a",
      "author": "szndrrr",
      "body": "I broke up with my first and only boyfriend in 34 years yesterday... my ED makes me aggressively fighting for time being alone aka with my eating disorder... I hate it so much!",
      "created_utc": 1638620085.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hn13zvr",
      "author": "Affectionate-Oven306",
      "body": "It's funny how we understand our behavior and do it anyway. Like, I know that shutting people out is an eating disorder behavior and will make me worse. I know that the desire for control over everything is both an eating disorder behavior and incompatible with long term health and happiness. Knowing doesn't change it. It just all feels shitty. It's not their fault but I'm resentful still, like they ruined my day on purpose by being good friends and having fun.",
      "created_utc": 1638506838.0,
      "score": 9,
      "context": [
        {
          "id": "hn13aii",
          "author": "pineappleonmypizzas",
          "body": "Yes, I completely empathize with this and I hate that I do. I hate that I can easily lie to them and that I want to avoid them. I feel like a shitty friend for it",
          "created_utc": 1638506469.0
        }
      ]
    },
    {
      "id": "hn19ghc",
      "author": "Affectionate-Oven306",
      "body": "It's not just this one occurrence, its lunches at the office, work functions, holidays, birthdays, weddings, movie nights, dates, dinners at my moms. So many social interactions revolve around food and it's really frustrating and isolating to feel conflicted constantly by these things we should enjoy. You could shut people out and not go, but that's depressing and you end up feeling worse. You could go and spend the whole time obsessing over what you can eat and stay \"on track\", never in the moment and not enjoying the event, or you can say \"fuck it\" for the night and then hit the inevitable shame and regret crash later. There's no right choice, no choice where I magically don't have an eating disorder. Eating disorders are isolating and they rob us of experiences we should enjoy. That's what I resent.",
      "created_utc": 1638509901.0,
      "score": 9,
      "context": [
        {
          "id": "hn16njd",
          "author": "wiltedguts",
          "body": "why not , just not go? i understand where ur coming from but u could just say u can’t go so u can stick to whatever eating habits u are doing",
          "created_utc": 1638508277.0
        }
      ]
    },
    {
      "id": "hn370li",
      "author": "Affectionate-Oven306",
      "body": "I literally broke up with an ex because he knew about my ED and was determined to fix me. There were a lot of other reasons, but that was a big one.",
      "created_utc": 1638551430.0,
      "score": 3,
      "context": [
        {
          "id": "hn27vsr",
          "author": "ugwugwugw",
          "body": "Me. I can’t even date because dates involved food and I’m here being a pathetic singles for years. I lost a lot of friends too because I keep rejecting my friends when they ask me out to eat, and we just stopped contacting after awhile…..",
          "created_utc": 1638535723.0
        }
      ]
    },
    {
      "id": "hn14fs4",
      "author": "pineappleonmypizzas",
      "body": "There’s an aspect of undeniable compulsion to it too, like I HAVE to do x or else",
      "created_utc": 1638507075.0,
      "score": 2,
      "context": [
        {
          "id": "hn13aii",
          "author": "pineappleonmypizzas",
          "body": "Yes, I completely empathize with this and I hate that I do. I hate that I can easily lie to them and that I want to avoid them. I feel like a shitty friend for it",
          "created_utc": 1638506469.0
        },
        {
          "id": "hn13zvr",
          "author": "Affectionate-Oven306",
          "body": "It's funny how we understand our behavior and do it anyway. Like, I know that shutting people out is an eating disorder behavior and will make me worse. I know that the desire for control over everything is both an eating disorder behavior and incompatible with long term health and happiness. Knowing doesn't change it. It just all feels shitty. It's not their fault but I'm resentful still, like they ruined my day on purpose by being good friends and having fun.",
          "created_utc": 1638506838.0
        }
      ]
    },
    {
      "id": "hn1atvu",
      "author": "wiltedguts",
      "body": "i totally feel that. it really is sad we can’t enjoy simple things bc we’re so worried about calories or appearance. like eating out with family and friends and the whole time i’m worried about how imma work it off or starve bc i ate. so yeah i totally understand where ur coming from and i wish u the best",
      "created_utc": 1638510730.0,
      "score": 2,
      "context": [
        {
          "id": "hn16njd",
          "author": "wiltedguts",
          "body": "why not , just not go? i understand where ur coming from but u could just say u can’t go so u can stick to whatever eating habits u are doing",
          "created_utc": 1638508277.0
        },
        {
          "id": "hn19ghc",
          "author": "Affectionate-Oven306",
          "body": "It's not just this one occurrence, its lunches at the office, work functions, holidays, birthdays, weddings, movie nights, dates, dinners at my moms. So many social interactions revolve around food and it's really frustrating and isolating to feel conflicted constantly by these things we should enjoy. You could shut people out and not go, but that's depressing and you end up feeling worse. You could go and spend the whole time obsessing over what you can eat and stay \"on track\", never in the moment and not enjoying the event, or you can say \"fuck it\" for the night and then hit the inevitable shame and regret crash later. There's no right choice, no choice where I magically don't have an eating disorder. Eating disorders are isolating and they rob us of experiences we should enjoy. That's what I resent.",
          "created_utc": 1638509901.0
        }
      ]
    },
    {
      "id": "hn1l9yp",
      "author": "edlonerwe",
      "body": "Omg this. I feel the exact same way and I hate it. I feel so isolated. And unplanned meals are the worst. I started having a very small breakfast on the day we have our staff meeting, just in case one of my coworkers decides to bring pastries, or biscuits or whatever, so that it doesn't throw me off my total so much. But in the end, it's not a solution either, because if no one brings anything for example, I end up feeling hungry, and having urges to binge later in the day. And social gatherings always revolve around food like you said. My friends are always like \"wanna come chill and watch a movie with fun food? It's the best remedy to being a little down/depressed!\", well... if only it were that simple. This sucks. I don't have a lot of advice unfortunately, I just wanted to let you know you're not alone feeling like this, and I wish you the best.",
      "created_utc": 1638518026.0,
      "score": 1,
      "context": [
        {
          "id": "hn16njd",
          "author": "wiltedguts",
          "body": "why not , just not go? i understand where ur coming from but u could just say u can’t go so u can stick to whatever eating habits u are doing",
          "created_utc": 1638508277.0
        },
        {
          "id": "hn19ghc",
          "author": "Affectionate-Oven306",
          "body": "It's not just this one occurrence, its lunches at the office, work functions, holidays, birthdays, weddings, movie nights, dates, dinners at my moms. So many social interactions revolve around food and it's really frustrating and isolating to feel conflicted constantly by these things we should enjoy. You could shut people out and not go, but that's depressing and you end up feeling worse. You could go and spend the whole time obsessing over what you can eat and stay \"on track\", never in the moment and not enjoying the event, or you can say \"fuck it\" for the night and then hit the inevitable shame and regret crash later. There's no right choice, no choice where I magically don't have an eating disorder. Eating disorders are isolating and they rob us of experiences we should enjoy. That's what I resent.",
          "created_utc": 1638509901.0
        }
      ]
    },
    {
      "id": "hn14wb0",
      "author": "Affectionate-Oven306",
      "body": "It's so irrational, too, because I KNOW that I don't actually have to, that my behavior isn't normal, and it scares me, but I still have to and I do. I'll be halfway through a purge thinking \"this is fucked up\" or I'll ghost my friends thinking \"this isn't fair to them\" but the urge is overpowering that rational part. Fuck ED's man, this is bullshit.",
      "created_utc": 1638507320.0,
      "score": 1,
      "context": [
        {
          "id": "hn13aii",
          "author": "pineappleonmypizzas",
          "body": "Yes, I completely empathize with this and I hate that I do. I hate that I can easily lie to them and that I want to avoid them. I feel like a shitty friend for it",
          "created_utc": 1638506469.0
        },
        {
          "id": "hn13zvr",
          "author": "Affectionate-Oven306",
          "body": "It's funny how we understand our behavior and do it anyway. Like, I know that shutting people out is an eating disorder behavior and will make me worse. I know that the desire for control over everything is both an eating disorder behavior and incompatible with long term health and happiness. Knowing doesn't change it. It just all feels shitty. It's not their fault but I'm resentful still, like they ruined my day on purpose by being good friends and having fun.",
          "created_utc": 1638506838.0
        },
        {
          "id": "hn14fs4",
          "author": "pineappleonmypizzas",
          "body": "There’s an aspect of undeniable compulsion to it too, like I HAVE to do x or else",
          "created_utc": 1638507075.0
        }
      ]
    }
  ]
}