{
  "id": "razct7",
  "subreddit": "bulimia",
  "author": "buglady-",
  "created_utc": 1638884136.0,
  "title": "I haven't purged for two days!",
  "selftext": "I have been struggling with a purging disorder with an anorexic subtype (I restrict so that I don't trigger my purging) for a couple months, and it's been two days since I've purged! Every day there is some point where I feel full enough to do so, but I'm literally already feeling more resilient (I haven't had a huge meal in a while but this is a big deal for me)! I rarely purge full meals anyway (I usually don't even have that much in my system when I do) but this feels like a huge accomplishment",
  "url": "https://www.reddit.com/r/bulimia/comments/razct7/i_havent_purged_for_two_days/",
  "score": 110,
  "num_comments": 5,
  "comments": [
    {
      "id": "hnnbt5r",
      "author": "None",
      "body": "Hey Good Job!! Thats amazing!!",
      "created_utc": 1638916105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnobiky",
      "author": "wwwdotWeirdperson",
      "body": "That’s amazing luv, I’m so proud of you:) I remember when I first began slowing down on purging. it was difficult, but it was a relief. You’re doing great!",
      "created_utc": 1638933426.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnocmp6",
      "author": "None",
      "body": "Great job mate! Super proud. This gives me more motivation to quit purging as well (I also have purging disorder with some restriction). Keep it up :)",
      "created_utc": 1638934005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnotsp1",
      "author": "InfamousDifficulty16",
      "body": "hey, no matter if it's two days or two years, this is an accomplishment!!! you absolutely deserve to feel proud and like you're doing good things, because you are! I'm proud of you. sending best wishes 🖤",
      "created_utc": 1638944576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqze5h0",
      "author": "Catbug94",
      "body": "Proud of you!",
      "created_utc": 1641157217.0,
      "score": 1,
      "context": []
    }
  ]
}