{
  "id": "rmh976",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1640214312.0,
  "title": "As a Recovered Bulimic: what I wish someone would have told me",
  "selftext": "Hey there,\n\nI've thought about writing something like this for a long time. I've struggled with a heavy eating disorder since I was about 17 until I think about 24, to then be fully recovered at 28. I tried to stop eating, which didn't work for me, and then developed severe bulimia. I have thrown up so many times I can't even remember. I have missed so much in my life because I was completely wrapped up in this vicious cycle and I thought it was impossible to get out of it. I thought I was incapable of ever getting over the feeling of eating attached to some sort of guilt or negative emotion.\n\nIt started out as a thing to lose weight. But to be very honest - it was never about weight. What I have learned over the years is that an eating disorder actually masks something else hidden inside of us. It was not my weight - it was me being so incredibly insecure and unhappy with myself that bulimia was actually a slow way to try to kill myself. I was too scared to kill myself so I tried to do it this way.\n\nGradually it took over. From morning to evening there was only one thing on my mind. I would start out okay - promised myself I would be good this day. And then one little thing would push me over the edge - I wanted to be healthy today but had to go eat at someone else's place. So I'd binge cause it was all or nothing and I'd throw up. I can't tell you how much money I have spent on buying food. It go to a point where the cashier of my local super market in my student town laughed when I wouldn't buy a litre of ice cream that day - 'No ice cream today, huh'. I obviously never visited that store again :) It felt like I constantly was carrying this heavy burden, this secret. I hated it. I hated how I never was at ease - like I always had a job to do. After two years I confided in my mom that I had this problem. She was relieved it was 'just that' because she thought I had a drug problem. She asked our doc about it who told her that if I didn't lose any weight there wasn't any problem. I'm from a small village so whatever the doc said was the truth, so my mother didn't really bother. And then I was sent off to college - with a credit card that'd be recharged whenever I'd reached my limit. I bought so much food. The amount of food I ate and threw up. Litres of ice cream, an entire bread, cookies, chips, ... At certain moments I thought I was going to explode.\n\nAt the age of 22-23 I wrote a goodbye letter every night because I felt like I might die that night. I felt like my heart might give up. So I would write a letter in which I told my family I loved them and I was sorry. Whenever I'd wake up I'd tear them up and throw them in the bin.\n\nI hated myself. No one would have ever thought. I was what society considers 'beautiful', in shape but I was so miserable. After a few years I just turned into a full addiction. I tried to go to therapy, but my parents made me feel guilty about it. They'd pay someone 8k to repaint their windows, but they'd make me feel guilty to waste 40 euros on therapy. My mom would get tons of snacks in the house cause I would have to learn to not touch them and resist temptation. So I had to deal with it myself. But there was no reason to stop - there were no obvious side effects so why would I? I once almost chocked on a pencil I tried to put in my throat to throw up. I have scars on my fingers from throwing up.\n\nBut then it happened. I was I think 22-23 and I had developed a habit of throwing up at least 3 times a day. The hurt. It was indescribable. But then it got worse and I started throwing up blood. The more I threw up, the more blood there was in the toilet. Until this one night where I threw up so much blood. The entire toilet seat was covered in blood. There was blood everywhere. And then it struck me: I am going to die if I continue doing this. All of this had always been such a far-away intangible thing. And then I realized - maybe I didn't want to die. The consequences had become apparent. I did not want to die. Strangely enough, this was the ONLY thing that scared me enough to not do it again.\n\nFrom that night on I was so scared to ever throw up again because I had been hit in the face with the consequences. I would write a goodbye note which would actually be my goodbye note if I didn't stop. I was so scared to throw up but the urges to binge eat where still there. So I had to deal with it. I binged and there I was lying on the couch, struggling, so nauseous. I learned chewing gum helps a lot to digest. Every time I binged, I took some chewing gums and tried to deal with the consequences of binge eating, but I didn't throw up anymore. Funnily enough this obviously caused some weight gain. My parents both knew I had struggled with bulimia but pretended it was not there. When I finally had managed to stop this monster but had gained some weight they started critiquing me how I had gained weight. I explained why this happened but the critiquing didn't stop. My mom initially refused to let me go to a therapist when I still had bulimia, but was more than happy to pay an expensive weight treatment where I would lose my weight. Up to my 30th birthday I have had fights with my parents to stop critiquing my weight.\n\nAt 26-27 I moved abroad. I was in a different environment and wasn't interested in food for a few months. I wasn't hungry. It was the weirdest thing. For the first time I wasn't interested in eating - not from a toxic point of view but just - I wasn't that hungry. So I just started eating healthy, big portions, but just healthy foods. After a few weeks something happened: I was eating when I was hungry - and I didn't binge anymore. The emotional eating still stuck with me for a few years but I hardly ever threw up. And here we are, I am 31 writing to you and I feel happier than I've ever feel before.\n\nI wish someone would have told me that you CAN get over it. It is never too late, no matter what age you are. I started doing therapy (without my parents knowing) but the truth is, my bulimia only got better when I actually decided I wanted something to change. I figured it wasn't about food- it wasn't about being thin. It was about me being so unhappy with myself and the consequences of what happened to me while growing up. I wasn't confident, I wasn't happy. It took me years and years to conquer the bulimia, work on myself and discover what was actually wrong. I had very, I mean very confrontational talks with my parents. I threatened to break off all contact with them if they would not change their ways - and they finally did (sort of). I decided that I was worth living for. I discovered I had add and got help for that.\n\nThe reason why I am writing this is because I thought it was impossible to ever feel like this. I am more in shape than I ever was, and the funny thing is I don't do anything for it - I stopped caring about the way people perceive me. I tried to be at peace with myself. It has been a hell of a journey, and a long one, but you can get over this. It took me a long time to see what was really bothering me.I actually enjoy food now. It has become a necessity like sleep or going to the toilet. If I see what I eat for dinner now - my 21-year old self would have lost her mind. A gigantic bowl of pasta. But because I don't binge anymore I can do that.\n\nWhen I was in my early twenties, the consequences of what I was doing were so far removed from me. Now I am struggling with arthritis, a weak stomach and a possible thyroid disease that has developed. I wish I would have taken care of myself a bit better. When I look back at pictures now I see a girl that was desperately looking for some love and wanted to be in control. I have lost so much time. I'm 31 and I feel I am still figuring out life. I sometimes feel I'm in the phase of life any 25-year old is usually in, but I tell people I lost 5 years of my life battling this monster.\n\nI hope that whatever age you are, whatever you are struggling with - there is a light at the end of the tunnel. There ALWAYS is someone who cares, someone who wants you to get better. It is possible to get better. And boy, when you get there ... it feels so good.\n\nI am rooting for you. I am rooting for everyone of you like I would be rooting for my 21-year old self. Life is beautiful and you are too. And you are deserve the world.",
  "url": "https://www.reddit.com/r/bulimia/comments/rmh976/as_a_recovered_bulimic_what_i_wish_someone_would/",
  "score": 168,
  "num_comments": 20,
  "comments": [
    {
      "id": "hpmdid9",
      "author": "None",
      "body": "This was a fantastic read. Thank you for posting it.",
      "created_utc": 1640216854.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hpnrzcv",
      "author": "acoh97",
      "body": "\"When I look back at pictures now I see a girl that was desperately looking for some love and wanted to be in control. I have lost so much time. I'm 31 and I feel I am still figuring out life. I sometimes feel I'm in the phase of life any 25-year old is usually in, but I tell people I lost 5 years of my life battling this monster.\" Hits hard",
      "created_utc": 1640246562.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hpo1d4x",
      "author": "None",
      "body": "Thank you for the comments. Also, so many grammar and spelling mistakes in there now that I read it again. Ah well, wrote it in the middle of the night. My only intention for it is for someone to have a little bit of hope - that recovery is possible. I didn't go through any program or properly saw a therapist for it but had to learn how to develop my own coping / recovery techniques.\n\nSome things that really helped me on my road to recovery:- change my environment. Moving abroad was the number one thing that helped speed up my recovery. When I moved abroad, away from my family, my ED pretty much ended. I know not everyone can move abroad, but I think the point here is trying to get yourself out of an environment that is triggering your ED\n\n\\- cook for myself and bring my own food. I could have a perfect week but then be triggered whenever I had to go eat at a friend's place or at my parents where they would serve me foods I would try to avoid that day. Like if I had a good day, and suddenly had to eat at someone else's place where there was pizza or pasta on the menu I'd switch and pig out and throw up. Tell people you appreciate them cooking for you but you're trying to recover and it triggers you and you'd love to attend but bring your own food. If you think they'll make a fuss about it, just tell them you have an allergy for certain foods and that's the reason you'll bring your own.\n\n\\- if you've binged and don't want to throw up, chew a lot of chewing gums for an hour or two. For me this was the only thing that would help me digest.\n\n\\- Read about the consequences of what you're doing. One of the only things that immediately helped reducing the number of times I threw up was being confronted with what I was doing to my body.\n\n\\- Go talk to a therapist and see if you are suffering from any other issues. Usually an eating disorder is also a symptom of something else. I discovered I had severe ADD, which made me have low self-esteem and more prone to get into this kind of behavior\n\n\\- try hypnosis. I've visited tons of different therapists and after a few sessions I always felt annoyed to again and again talk about the same thing. I knew where my issues stemmed from - I just needed to really get in touch with my subconscious and reset my thoughts. To me one 3-hour hypnosis session did more than 100 therapy sessions altogether.\n\n\\- Kayla Itsines BBG program helped me a lot to be more at ease with my body shape after I stopped throwing up. I hate working out and going to a gym feels like a job. Kayla's program is literally a 30 minute workout you do 3 days a week - but it has immediate results (I'm impatient lol). I bought it and can send it to anyone who wants it. I struggled a lot with my weight immediately after and this made me get back in shape and feel better about myself.  \n\n\n\\- Stay busy. Whenever I had a lot going on, I was distracted from my ED. I'd also always make sure I didn't have anything tempting at home. Sometimes I'd wanna binge and purge but I'd be too lazy to go to the supermarket. If you wanna pig out, make sure you have something at home that is healthy but feels like a good replacement. I'd pig out on oatmeat will stevia or seaweed chips, which to me didn't feel bad enough to throw up.\n\n\\- tell people about your struggle. There's people who are gonna care. They will help you. If they don't care, they're not your friends. Some friends however will feel awkward about it and are afraid to ask anything and will pretend it's not there. Just be open with them.\n\n\\- set boundaries! A lot of my struggles stemmed from things that had happened during my chidhood and teenage years. A lot of self-esteem issues came from my relationship with my parents. As I was left alone with my struggle and I was the one who had to fix this without any help, I had to set strict boundaries. Even if it's your family, sometimes their actions don't benefit you. If you need to take a break from them, that is allowed. Tell people what you expect from them and what your boundaries are.\n\n\\- try a vegetarian diet. As soon as I became a vegetarian, it was a lot easier to keep my weight stable, which helped me cope a lot. Even in the stage where I was still binging but not purging, I would try to binge on healthy food (or healthier). It helped a lot in the transition phase. Like I feel I would have a trigger to binge, then I'd go to the supermarket and get a shit load of mangos, rice waffles with a bit of chocolate, huge salad, ... and I'd tell myself that if I finished all of this I was allowed to binge on more 'bad food'. Usually after eating all the healthy food I'd be so full I wasn't interested in the bad food anymore. In my head it also didn't make sense to throw up the healthy food cause there was nothing in it.\n\n\\- keep your own routines. A lot of bulimia was about control. Even though I am entirely recovered I started feeling gradually uncomfortable with food again during my new relationship. My partner is wonderful but comes from an Italian family and is obsessed with food (she eats so much but never gains weight). So in our little honeymoon phase she'd constantly make us huge plates of pasta. I didn't care that much because I was in love but gradually I noticed I was losing control over my food intake and gaining a lot of weight and not comfortable in my skin anymore. I told her about how I felt and how I loved that she made us food but I needed to have control over this to not slip up. Whenever she now wants to eat her huge pastas, I. make my own dish. Or I make our pasta's which consist of sweet potato pasta and veggies. I love her but I have to have control over what I do. Luckily she understands.\n\nHope this helps.",
      "created_utc": 1640254235.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hpnpsor",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640244875.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hpo60je",
      "author": "kenzo_1988",
      "body": "Thank you for your post. A very moving read. It’s very interesting how impactful a change of environment, atmosphere and perspective on life can have on B. \n\nCan I ask - how did the more consistent intake of food (and potential weight gain) impact on your self body image?",
      "created_utc": 1640258038.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpodxwp",
      "author": "piticlown98",
      "body": "thank you for this. \n\ni really wish to get over it. i really do. \n\ni want to say that i will but this monster called \" eating disorder \" is the strongest one i ever seen.",
      "created_utc": 1640263664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hporneg",
      "author": "Basic_tomatillo4444",
      "body": "Just want you to know I could related so much to your story! That’s so amazing you recovered. I did too and I hope this gives hope to others",
      "created_utc": 1640270963.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpovdme",
      "author": "None",
      "body": "This is so inspirational. Thank you for sharing your story. It matters so much ❤️",
      "created_utc": 1640272666.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hppidx4",
      "author": "Nuitella",
      "body": "Thanks for sharing. I might be tired but crying so much right now",
      "created_utc": 1640282392.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpq7r9o",
      "author": "Mackultra",
      "body": "Thank you so much for sharing your story. It's a very brave thing to do and I'm glad you were able to beat this. Much love to you internet stranger. <3",
      "created_utc": 1640293228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpobdip",
      "author": "None",
      "body": "Thank you so much for this, im 17 and i was just b/p because holidays trigger me to lose control. I will read this everyday, so i can stick to recovery (on my own, because my parents dont understand me, i relate to that part of your story).",
      "created_utc": 1640261983.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpp8s5i",
      "author": "Looey22",
      "body": "Congratulations! That’s amazing. \n\nThis video might be interesting to you 🙂\n\nhttps://youtu.be/ZWrMhU577SY",
      "created_utc": 1640278414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpohf08",
      "author": "None",
      "body": "Hey there!  \n\n\nExactly! I also always felt perfectly fine on holidays cause I had complete control over everything I did. I'm sorry that you're currently unable to get out of the situation you're in. You don't have to move abroad but maybe get your own place? Not sure what your situation is though. I listed a bunch of 'tips' that helped me during my transition period. Hopefully some of that could help you a bit too :)",
      "created_utc": 1640265736.0,
      "score": 1,
      "context": [
        {
          "id": "hpnpsor",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640244875.0
        }
      ]
    },
    {
      "id": "hpoenw9",
      "author": "None",
      "body": "The period after I stopped throwing up was very difficult. I was able to not purge but the binging still stuck with me for a few years (the frequency of it decreased though). In the beginning it had a very bad impact on my self-body image since I gained quite a bit of weight. I would just gain a lot and lose a lot in period. Me being sad would still result in me binging on food - which obviously made me gain weight. I worked out a lot but my weight was still constantly something I was preoccupied with. The worst thing ever was my parents constantly critiquing my weight. The most ridiculous thing is that I never really was overweight because I don't have the genes for it. I cut off my mother for three months because she couldn't stop making remarks about how I had gained weight. We're talking about me weighing 75 kilos for 1.74 metres of height. (Ridiculous I know). But I moved abroad and my relationship with weight changed in a way that it didn't think about it anymore. I never weighed myself again, which helps. Gradually food became almost like mathematics - 'I need these vitamins so I eat these foods'. I still enjoy a nice ice cream with chocolate but after two scoops I'm like okay I'm bored now.   \nI also developed Hashimotos disease and it really helps for me to be vegan (except for fish cause I get vitamin deficiencies if I don't) and eat gluten free. The funny thing of it all is that now that I don't think about what I eat, hardly work out, I am toned as fuck.   \n\n\nIn high school I got bullied for being 'ugly' and that also contributed to my eating disorder. Funnily enough, that changed in high school and then I suddenly was considered 'beautiful' by society's standards. I've been lucky enough to been blessed with a D-cup and a tiny waste and long, thin legs. My girlfriend always calls me her 'swimsuit model'. The irony of it all was that even though I was struggling with an eating disorder and whether I gained or lost weight, men would always tell my my body looked fantastic, even though they were douches. That helped a lot.  \n\n\nI think it's quite interesting to have seen both sides of the story. The teenager that was called a 'monster' on her way back home, to suddenly people being super nice to you because they think you are attractive. It made me realize what a dumb and unfair society we live in. I'm thankful for my body now, even though I am struggling with the consequences of what I did to it. The feeling of freedom - the not being held captive anymore by what society thinks of you physically is the most amazing thing. Even though it's easy to say when you do check a lot of its boxes.",
      "created_utc": 1640264109.0,
      "score": 3,
      "context": [
        {
          "id": "hpo60je",
          "author": "kenzo_1988",
          "body": "Thank you for your post. A very moving read. It’s very interesting how impactful a change of environment, atmosphere and perspective on life can have on B. \n\nCan I ask - how did the more consistent intake of food (and potential weight gain) impact on your self body image?",
          "created_utc": 1640258038.0
        }
      ]
    },
    {
      "id": "hpqbcby",
      "author": "None",
      "body": "Hope you get better!",
      "created_utc": 1640294774.0,
      "score": 2,
      "context": [
        {
          "id": "hpodxwp",
          "author": "piticlown98",
          "body": "thank you for this. \n\ni really wish to get over it. i really do. \n\ni want to say that i will but this monster called \" eating disorder \" is the strongest one i ever seen.",
          "created_utc": 1640263664.0
        }
      ]
    },
    {
      "id": "hpqbe42",
      "author": "None",
      "body": "Things can get better :) Wishing you well",
      "created_utc": 1640294796.0,
      "score": 2,
      "context": [
        {
          "id": "hppidx4",
          "author": "Nuitella",
          "body": "Thanks for sharing. I might be tired but crying so much right now",
          "created_utc": 1640282392.0
        }
      ]
    },
    {
      "id": "hpog3wq",
      "author": "None",
      "body": "Hey there, sorry to hear you're going through this.  \n\n\nI know the holidays can be extremely challenging. I always promised myself before they started that this year I would keep myself in check. But that obviously never worked. I'm sorry your parents are not being understanding - that is such a hard thing. To me it felt incomprehensible that the people who put you on this earth would not 'care' about it. I felt abandoned by my parents in my struggle. What I learned in hindsight, after having had a lot of conversations with them about it, they did not WANT to see what was going on. They did not read anything about it because they didn't want to see or acknowledge what was going on.   \n\n\nOne thing that made them realize a bit was when I finally was able to go to a therapist and he invited my parents over to talk with all of us. He told them what was going on and how serious this was. He also got quite upset with them that this is not a thing where you turn your head around and it's not there. At that time it helped a bit but later they just continued doing what they had done before.  \n\n\nTell them what is going on and how serious it is and that you need help. If they don't give you that help, ask to see a therapist about it - so there's at least someone who's checking up on you. Most older people don't know that much about ED and they honestly don't understand it. Be honest to them about it and let them know that the holidays are stressing you out. Ask them if you or they can make you a separate dish so you feel like you have control of what is happening. I am now struggling with Hashimotos and only eat certain things and me having a disease finally made them just let me do my thing when it comes to eating (whenever I'm visiting I mean).  \n\n\nI posted a list with things that helped me stop binging and purging - it's in the comments. Hopefully that can help you a bit. Please look for help so you don't have to deal with this for another decade like I did. Life is actually really short and kinda cool if you are nice to yourself. Now that I'm 31 and look back on how I looked then - my body was perfect! I wish I just appreciated it then. I hope you find a way to get better. You can always write me a message if you're struggling or have questions. Wishing you wel!",
      "created_utc": 1640264976.0,
      "score": 2,
      "context": [
        {
          "id": "hpobdip",
          "author": "None",
          "body": "Thank you so much for this, im 17 and i was just b/p because holidays trigger me to lose control. I will read this everyday, so i can stick to recovery (on my own, because my parents dont understand me, i relate to that part of your story).",
          "created_utc": 1640261983.0
        }
      ]
    },
    {
      "id": "hpqb2ns",
      "author": "None",
      "body": "Oh amazing. Thank you! I'll look into that",
      "created_utc": 1640294657.0,
      "score": 2,
      "context": [
        {
          "id": "hpp8s5i",
          "author": "Looey22",
          "body": "Congratulations! That’s amazing. \n\nThis video might be interesting to you 🙂\n\nhttps://youtu.be/ZWrMhU577SY",
          "created_utc": 1640278414.0
        }
      ]
    },
    {
      "id": "hpptov7",
      "author": "None",
      "body": "Thank you so much, i'll check that out!\n\nMy parents new about my ed, when it was just binge eating at 15 but currently it has developed into bulimia, and as i lost weight they think im doing better now but im actually worse. I'll get help in a couple of months once im 18 bc in my country you need your parents permission/signature to get a therapist (they're against telling other people your problems).",
      "created_utc": 1640287160.0,
      "score": 1,
      "context": [
        {
          "id": "hpobdip",
          "author": "None",
          "body": "Thank you so much for this, im 17 and i was just b/p because holidays trigger me to lose control. I will read this everyday, so i can stick to recovery (on my own, because my parents dont understand me, i relate to that part of your story).",
          "created_utc": 1640261983.0
        },
        {
          "id": "hpog3wq",
          "author": "None",
          "body": "Hey there, sorry to hear you're going through this.  \n\n\nI know the holidays can be extremely challenging. I always promised myself before they started that this year I would keep myself in check. But that obviously never worked. I'm sorry your parents are not being understanding - that is such a hard thing. To me it felt incomprehensible that the people who put you on this earth would not 'care' about it. I felt abandoned by my parents in my struggle. What I learned in hindsight, after having had a lot of conversations with them about it, they did not WANT to see what was going on. They did not read anything about it because they didn't want to see or acknowledge what was going on.   \n\n\nOne thing that made them realize a bit was when I finally was able to go to a therapist and he invited my parents over to talk with all of us. He told them what was going on and how serious this was. He also got quite upset with them that this is not a thing where you turn your head around and it's not there. At that time it helped a bit but later they just continued doing what they had done before.  \n\n\nTell them what is going on and how serious it is and that you need help. If they don't give you that help, ask to see a therapist about it - so there's at least someone who's checking up on you. Most older people don't know that much about ED and they honestly don't understand it. Be honest to them about it and let them know that the holidays are stressing you out. Ask them if you or they can make you a separate dish so you feel like you have control of what is happening. I am now struggling with Hashimotos and only eat certain things and me having a disease finally made them just let me do my thing when it comes to eating (whenever I'm visiting I mean).  \n\n\nI posted a list with things that helped me stop binging and purging - it's in the comments. Hopefully that can help you a bit. Please look for help so you don't have to deal with this for another decade like I did. Life is actually really short and kinda cool if you are nice to yourself. Now that I'm 31 and look back on how I looked then - my body was perfect! I wish I just appreciated it then. I hope you find a way to get better. You can always write me a message if you're struggling or have questions. Wishing you wel!",
          "created_utc": 1640264976.0
        }
      ]
    },
    {
      "id": "hpqfjf5",
      "author": "Looey22",
      "body": "No problem 😃  I know it may or may not be useful but literally everything dr berg has said that I’ve tried out was accurate and helped me a TON. God bless 🙏🏻",
      "created_utc": 1640296615.0,
      "score": 2,
      "context": [
        {
          "id": "hpp8s5i",
          "author": "Looey22",
          "body": "Congratulations! That’s amazing. \n\nThis video might be interesting to you 🙂\n\nhttps://youtu.be/ZWrMhU577SY",
          "created_utc": 1640278414.0
        },
        {
          "id": "hpqb2ns",
          "author": "None",
          "body": "Oh amazing. Thank you! I'll look into that",
          "created_utc": 1640294657.0
        }
      ]
    },
    {
      "id": "hpqcj8c",
      "author": "None",
      "body": "Mine were too initially. I was throwing up three times a day and my mom didn't want me to see a therapist because if they would drive me to his place someone might recognize them and judge them for having a daughter that's crazy. Can you imagine.   \nThe problem with bulimia is that outsiders often don't see what's going on. Maybe try to tell them how bad it is getting. If you had severe pains in your arm, they'd drive you to a doc or a hospital too, no? If you have a disease like that your parents should be there to help you. I would just get in constant fights with my parents over food and them not caring that my dad got extremely angry and decided it was enough and I could go see a therapist. I would probably also be easier if they help you pay for it since these things are expensive. Remember, they are your parents - their duty as a parent is to help you - whether it's comfortable for them or not.",
      "created_utc": 1640295294.0,
      "score": 2,
      "context": [
        {
          "id": "hpobdip",
          "author": "None",
          "body": "Thank you so much for this, im 17 and i was just b/p because holidays trigger me to lose control. I will read this everyday, so i can stick to recovery (on my own, because my parents dont understand me, i relate to that part of your story).",
          "created_utc": 1640261983.0
        },
        {
          "id": "hpog3wq",
          "author": "None",
          "body": "Hey there, sorry to hear you're going through this.  \n\n\nI know the holidays can be extremely challenging. I always promised myself before they started that this year I would keep myself in check. But that obviously never worked. I'm sorry your parents are not being understanding - that is such a hard thing. To me it felt incomprehensible that the people who put you on this earth would not 'care' about it. I felt abandoned by my parents in my struggle. What I learned in hindsight, after having had a lot of conversations with them about it, they did not WANT to see what was going on. They did not read anything about it because they didn't want to see or acknowledge what was going on.   \n\n\nOne thing that made them realize a bit was when I finally was able to go to a therapist and he invited my parents over to talk with all of us. He told them what was going on and how serious this was. He also got quite upset with them that this is not a thing where you turn your head around and it's not there. At that time it helped a bit but later they just continued doing what they had done before.  \n\n\nTell them what is going on and how serious it is and that you need help. If they don't give you that help, ask to see a therapist about it - so there's at least someone who's checking up on you. Most older people don't know that much about ED and they honestly don't understand it. Be honest to them about it and let them know that the holidays are stressing you out. Ask them if you or they can make you a separate dish so you feel like you have control of what is happening. I am now struggling with Hashimotos and only eat certain things and me having a disease finally made them just let me do my thing when it comes to eating (whenever I'm visiting I mean).  \n\n\nI posted a list with things that helped me stop binging and purging - it's in the comments. Hopefully that can help you a bit. Please look for help so you don't have to deal with this for another decade like I did. Life is actually really short and kinda cool if you are nice to yourself. Now that I'm 31 and look back on how I looked then - my body was perfect! I wish I just appreciated it then. I hope you find a way to get better. You can always write me a message if you're struggling or have questions. Wishing you wel!",
          "created_utc": 1640264976.0
        },
        {
          "id": "hpptov7",
          "author": "None",
          "body": "Thank you so much, i'll check that out!\n\nMy parents new about my ed, when it was just binge eating at 15 but currently it has developed into bulimia, and as i lost weight they think im doing better now but im actually worse. I'll get help in a couple of months once im 18 bc in my country you need your parents permission/signature to get a therapist (they're against telling other people your problems).",
          "created_utc": 1640287160.0
        }
      ]
    }
  ]
}