{
  "id": "rohg2z",
  "subreddit": "bulimia",
  "author": "YeahNoYeahMaybeNo",
  "created_utc": 1640466292.0,
  "title": "Everyone surviving christmas?",
  "selftext": "Take it easy folks, hope you are all good 🙏",
  "url": "https://www.reddit.com/r/bulimia/comments/rohg2z/everyone_surviving_christmas/",
  "score": 110,
  "num_comments": 134,
  "comments": [
    {
      "id": "hpycv3b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640466946.0,
      "score": 45,
      "context": []
    },
    {
      "id": "hpyjpsk",
      "author": "fivefootfeed",
      "body": "i’ve managed to keep my food down so far, not felt great but i haven’t purged yet. more dinners tonight. wishing you all good luck and the best of wishes",
      "created_utc": 1640470407.0,
      "score": 36,
      "context": []
    },
    {
      "id": "hpykug8",
      "author": "mysocksareitchy",
      "body": "I can’t stop purging everything today and I’m really scared of the calories I’ve absorbed and I feel like a failure to my family because I think they know what I’m doing and they’re too nervous to break the Christmas spirit and I’m sure they’re all mad uncomfortable about it. I hope I didn’t ruin Christmas for everybody 😭",
      "created_utc": 1640470964.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hpyg6ya",
      "author": "mystic-goose",
      "body": "No not really but I’m getting through it :)",
      "created_utc": 1640468652.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hpyhkoj",
      "author": "rtky1265",
      "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
      "created_utc": 1640469353.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hpyr2gc",
      "author": "Musicknowsnobounds",
      "body": "I feel like I've been eating too much and now I feel guilty. My restriction habits are coming back.",
      "created_utc": 1640474082.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hpysyyt",
      "author": "potatoihateyou",
      "body": "haven’t purged today!! like really proud of myself i haven’t purged in about 14 days now and i really thought i would mess of the streak today but i didn’t!",
      "created_utc": 1640475061.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hpyr85a",
      "author": "jadeeeeeeeeeeeeeee",
      "body": "purged only once today. every other day it's at least 5+ times so i'm pretty pleased",
      "created_utc": 1640474162.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hpykbtk",
      "author": "Agrimny",
      "body": "Mad suffering in regards to food but that aside the holiday itself has been good ❤️",
      "created_utc": 1640470705.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hpyl94x",
      "author": "None",
      "body": "No",
      "created_utc": 1640471166.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hpyrezu",
      "author": "alexisseffy",
      "body": "No I'm c/s-ing left and right bc holiday food is so triggering. and we're traveling and my mom wants to eat out so much despite knowing I have an ED so cannot cope with restaurant food bc scary so I've been having the Urge to Purge™️. Can't relapse if you never recovered ✌️",
      "created_utc": 1640474260.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hpyfpwr",
      "author": "_I_Love_Pizza_",
      "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
      "created_utc": 1640468408.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpz5ya4",
      "author": "Wtfisthis66",
      "body": "Lucky me, I am home with the flu and am missing all of the craziness.",
      "created_utc": 1640481747.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpz73v9",
      "author": "veronicatandy",
      "body": "actually yes! even through my relapse 💕💕",
      "created_utc": 1640482376.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hpyuwpk",
      "author": "Sweetpea987",
      "body": "today has been horrible for me my throat is sore and i’m so bloated but i can’t stop",
      "created_utc": 1640476060.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpyxymo",
      "author": "None",
      "body": "Fighting the urge",
      "created_utc": 1640477613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpz4q5q",
      "author": "ketamineprincess86",
      "body": "help my daily routine involves going shopping for food and tomorrow will be the last of THREE days where i havent went 😭 this is hell and im running out of binge AND safe foods",
      "created_utc": 1640481078.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpyry6x",
      "author": "kynthewallflower",
      "body": "i’m about to go to my grandparents house where they’re going to be having christmas dinner wish me luck",
      "created_utc": 1640474533.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpys4nw",
      "author": "SugarMaddy_",
      "body": "I'm strugglin ngl :\")",
      "created_utc": 1640474625.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpyumwz",
      "author": "None",
      "body": "Unfortunately, today was my worst day yet",
      "created_utc": 1640475920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz0o6y",
      "author": "desciples",
      "body": "i wish :(",
      "created_utc": 1640478937.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz2o54",
      "author": "chlorineforhands",
      "body": "I'm struggling a lot. Had another dinner. I've purged everything I ate today, my grandma kept commenting on my plate and telling me that I should watch my diet (I told everyone that to avoid questions with less food and exercising) and that trigged me so much... they don't know what I'm going through my head aches and I'm feeling very lonely",
      "created_utc": 1640479976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz2t6k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640480049.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz3r69",
      "author": "None",
      "body": "don’t even celebrate christmas but wasn’t a good day either way :’/ i scratched my throat by accident n it’s bleeding",
      "created_utc": 1640480554.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz4294",
      "author": "Lillysland",
      "body": "✨no✨ :/",
      "created_utc": 1640480717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz65xo",
      "author": "mrszmiawallace",
      "body": "Stayed away from family and friends. Can’t purge if there’s no meal 😛",
      "created_utc": 1640481862.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz7pi2",
      "author": "G0TH4NG3LSINN3R-",
      "body": "nah i purged for the first time in.. a while. thought i was finally over it. feeling pretty horrific. i did have a nice time seeing my family tho",
      "created_utc": 1640482704.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz89yg",
      "author": "withextracheesepls",
      "body": "spent christmas eve in the hospital, but i’m alive so…\n\nhowever, not super happy about the whole being alive thing, because mentally i feel like shit.",
      "created_utc": 1640483010.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz8idr",
      "author": "universallyround",
      "body": "fought the urge all day by only having small amounts of food (being full is one of my triggers to purge). buuuut then i got a bit drunk in the evening, ate a huge amount of leftovers and purged lol. \n\nwoke up today and gained heaps from what i did keep down so not thriving 😩 urge to binge remaining leftovers is HIGH but my mother wont shut up about “how fat i’ve gotten” from christmas day 🥴",
      "created_utc": 1640483139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz8pow",
      "author": "haybails720",
      "body": "More challenging than thanksgiving so far because of something that happened this morning \n\nI’m 115 days clean as of like, and hour ago and I rlly want to make it to 150 or 182(half a year) so that’s keeping me going",
      "created_utc": 1640483250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz8zna",
      "author": "NoOutlandishness420",
      "body": "no!!!😆",
      "created_utc": 1640483402.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpz9ry2",
      "author": "Retrostir",
      "body": "Binged for the first time in two weeks today so yeah going great 👍",
      "created_utc": 1640483835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpza4ig",
      "author": "Intelligent_Laugh794",
      "body": "Nope just relapsed after trying soooo hard. Told my partner I had urges and he walked around the house with me for a while and I brushed my teeth but still did it the minute he went outside. Too many triggers tonight, oh well I hope everyone else faired better than me",
      "created_utc": 1640484032.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzal2e",
      "author": "Correct_Combination1",
      "body": "Sigh. I broke my 3 week streak this past Thursday and was hoping it was just a stumble. Today I ate way too much and ended up calculating the extra calories and I purged because I just couldn’t handle the numbers :/. On the bright side I am home for break and it’s harder for me to control myself here because my mother buys so much food (I’ve literally eaten 8 packs of gummy worms in the past week) so I am kinda proud that it’s only been two times and I hope that I can get back on the wagon. Hopefully the new year is better",
      "created_utc": 1640484277.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzar9j",
      "author": "Emotional_Relation38",
      "body": "barely, my entire family got a cold but me and they think i have one because my throat is so sore and swollen from how much i’ve been purging",
      "created_utc": 1640484371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzcc4e",
      "author": "Tushkah0mma",
      "body": "Brother made a comment about my body and how much I’m eating and I’m fighting the purge urge so strongly right now. Feeling like shit",
      "created_utc": 1640485230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzd50h",
      "author": "daisyelisabee",
      "body": "I’m half and half, been trying to stay good on account of my body not feeling great recently and feeling depressed about my tooth damage, I’m bloated up a bit but I think it’s because my periods coming so I’m trying to keep that in mind, but the nausea of trying to retrain my body to handle food is really hard, which wasn’t so helpful. I couldn’t drink a lot because of it but I guess that’s for the best. I haven’t done yoga in almost a month which is freaking me out but I do plan to jump back in when ywa starts her new 30 day challenge which helps me. It wasn’t perfect but I did some good today and I like to look at the little strides while still acknowledging I need to keep improving. Happy holidays my friends, lots of love to you all tonight❤️",
      "created_utc": 1640485665.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzi11u",
      "author": "bloomvicky",
      "body": "yeah, wish i wasnt binging but... cant help it",
      "created_utc": 1640488372.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzihh7",
      "author": "chognogg",
      "body": "My sister gave me a mini fridge for Yule - I'm super flattered, those things cost crazy prices. But a part of me can't help but think it's because all she thinks I do is eat. (Which, in all honesty, is true, but it still hurts.)\n\nHow was your holiday?",
      "created_utc": 1640488624.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzivvm",
      "author": "None",
      "body": "I had a piece of cheesecake that i didn't purge!",
      "created_utc": 1640488841.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzjkcw",
      "author": "ShySchemingGorgon",
      "body": "I hate every holiday associated with food.  I've been struggling so hard.",
      "created_utc": 1640489225.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzjvkl",
      "author": "Biscotti_Antique",
      "body": "Barely",
      "created_utc": 1640489405.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzopa4",
      "author": "None",
      "body": "purged yesterday but not today, i ate bad but haven’t gotten the chance to purge since my house is full w family. I already know i’m not getting a bit of food tom",
      "created_utc": 1640492112.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzpxaf",
      "author": "Melodic-Lilypad-371",
      "body": "It’s rough, literally came here for a post like this. Needed to know I’m not alone ❤️",
      "created_utc": 1640492825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzu0zy",
      "author": "Candid-Strawberry-33",
      "body": "Honestly the holiday season makes everything so much worse for me. I end up bingeing so much I always gain so many pounds. And then I end up feeling guilty and purge for the next few months",
      "created_utc": 1640495387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpzubwq",
      "author": "neroney76",
      "body": "Ugh.  I’ve been recovered for years but coming on here for a little support.  Just binged major big time and in front of my family and just couldn’t stop eating all the candy cookies chocolate custard etc.  WHY DO THEY PUT ALL that out!!!  I should be mad at myself but I’m mad at them and me having to endure it every time.  Just got home and lifted weights like crazy and I’m not going to purge.  Really beating myself up and feeling so physically horrible and really not wanting to start down this path again.",
      "created_utc": 1640495588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq037ic",
      "author": "U_got_no_jams",
      "body": "I’m relapsing and I promised myself I wouldn’t start purging again and I haven’t done it but it’s so hard just knowing I’ve eaten and literally feeling it. I feel really anxious and disappointed, and the worst part was looking at the scale and seeing I gained. But yeah, it’s going so well 🥲",
      "created_utc": 1640501866.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0blaa",
      "author": "Renmeya",
      "body": "Finally over. \nMy throat is red raw I've spent my day over the loo blood dripping from nose, throat bleeding and now I just feel dead.  Can't wait for the boxing day meal...yeah...",
      "created_utc": 1640509246.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0d13w",
      "author": "obsessedpunk",
      "body": "i actually managed to eat 3 meals a day for the past 2 days. i don’t think i’ll be able to keep that up after today but yay",
      "created_utc": 1640510586.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0e8mb",
      "author": "Zofcu",
      "body": "Purged only once so far which more than I could’ve hoped for. I mean I’m bloated af but still",
      "created_utc": 1640511731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0iys1",
      "author": "LifeisHard2257",
      "body": "Haha noooo I wish. I’m hiding in the bathroom eating Christmas candy at 5 am",
      "created_utc": 1640516122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0l4q8",
      "author": "MallowHober",
      "body": "Help",
      "created_utc": 1640518106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0ljbf",
      "author": "smoothbitch420",
      "body": "for whatever reason the voice that tells me to pull trig after every meal quiets down during the holidays",
      "created_utc": 1640518469.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0qd6q",
      "author": "reverseboob7841",
      "body": "jesus christ, no",
      "created_utc": 1640522561.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0s5n3",
      "author": "sjupiter92",
      "body": "Nah binged and purged throughout friday and saturday on top of getting my period today. I'm out of my mind scared of stepping on the scale and seeing the damage I've done",
      "created_utc": 1640523904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0t9p2",
      "author": "Far-Boysenberry-8691",
      "body": "I feel so fat!!! Haven't purged which I'm really happy about. But ate sooo much food... I can see my cellulite and my arms are jiggly. This is the biggest I've been in my life. But quite happy not to have purged for 5 days 🙌",
      "created_utc": 1640524702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq0z3oj",
      "author": "CocoaButterNice",
      "body": "Made a vow to my girlfriend I wouldn’t purge over Christmas. I feel pregnant, constantly.",
      "created_utc": 1640528389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq18pz5",
      "author": "Timeforbed807",
      "body": "Learning just how small my social battery is",
      "created_utc": 1640533496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq1be0k",
      "author": "Select-Excitement179",
      "body": "As a person who literally knows on themselves what's about - just wanted to leave a bit of support here ❣️\nJust want you to know that recovery is possible and recovery is amazing. Eating healthy is a kaif. You can also write me if you need someone to be by your side.",
      "created_utc": 1640534760.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq1jexk",
      "author": "tarynjo2",
      "body": "This is my 4th Christmas being bulimic but I managed to actually keep it all down and genuinely enjoyed myself 👍🏼",
      "created_utc": 1640538385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq1ojen",
      "author": "napolionnappe",
      "body": "Went from not having bulimia for months til getting triggered and had bulimia 3 days in a row",
      "created_utc": 1640540683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq1z403",
      "author": "killermichi",
      "body": "I tried doing good Christmas Eve.  My family had a nice get together with my cousins but I eventually had to sneak away and purge.  I felt terrible for it.",
      "created_utc": 1640545216.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq26zew",
      "author": "None",
      "body": "We had our Christmas dinner on Friday. Did great!\n\nRelapsed yesterday on leftovers, though. I worked all day without eating and then got home and, well, you know. \n\nI made myself eat a protein bar today and had a iced coffee (had calories), so I hope I don’t b/p tonight. I feel less “ravished” already so 🤞",
      "created_utc": 1640548555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hq1c11m",
      "author": "None",
      "body": "My state is legal, so I managed with lots and lots of pot. I know I’ll purge when I go home or get left alone, but for now I’m surviving.  \n\nWishing good luck to everyone",
      "created_utc": 1640535057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpyr7w3",
      "author": "alexisseffy",
      "body": "Haha the \"eating\" like I don't get rid of what I ate right after 🤡",
      "created_utc": 1640474158.0,
      "score": 22,
      "context": [
        {
          "id": "hpycv3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640466946.0
        }
      ]
    },
    {
      "id": "hpz76sw",
      "author": "veronicatandy",
      "body": "you got this!! 😊💕💜",
      "created_utc": 1640482420.0,
      "score": 6,
      "context": [
        {
          "id": "hpyjpsk",
          "author": "fivefootfeed",
          "body": "i’ve managed to keep my food down so far, not felt great but i haven’t purged yet. more dinners tonight. wishing you all good luck and the best of wishes",
          "created_utc": 1640470407.0
        }
      ]
    },
    {
      "id": "hpylhxe",
      "author": "YeahNoYeahMaybeNo",
      "body": "Sad to hear. Maybe its a good resolution for 2022 and come clean with your ED to your parents. It does make life more comfortable with people you love in your corner. Good luck ❤️",
      "created_utc": 1640471290.0,
      "score": 6,
      "context": [
        {
          "id": "hpykug8",
          "author": "mysocksareitchy",
          "body": "I can’t stop purging everything today and I’m really scared of the calories I’ve absorbed and I feel like a failure to my family because I think they know what I’m doing and they’re too nervous to break the Christmas spirit and I’m sure they’re all mad uncomfortable about it. I hope I didn’t ruin Christmas for everybody 😭",
          "created_utc": 1640470964.0
        }
      ]
    },
    {
      "id": "hpys6xm",
      "author": "alexisseffy",
      "body": "Same all the holiday food freaks me out and my parents knows I have an ED but my relatives don't so it's awkward trying to hide this mess and not ruin the trip",
      "created_utc": 1640474658.0,
      "score": 2,
      "context": [
        {
          "id": "hpykug8",
          "author": "mysocksareitchy",
          "body": "I can’t stop purging everything today and I’m really scared of the calories I’ve absorbed and I feel like a failure to my family because I think they know what I’m doing and they’re too nervous to break the Christmas spirit and I’m sure they’re all mad uncomfortable about it. I hope I didn’t ruin Christmas for everybody 😭",
          "created_utc": 1640470964.0
        }
      ]
    },
    {
      "id": "hpz7gyd",
      "author": "veronicatandy",
      "body": "Try to stay hydrated and have something small. i send you all my love 💕",
      "created_utc": 1640482571.0,
      "score": 2,
      "context": [
        {
          "id": "hpykug8",
          "author": "mysocksareitchy",
          "body": "I can’t stop purging everything today and I’m really scared of the calories I’ve absorbed and I feel like a failure to my family because I think they know what I’m doing and they’re too nervous to break the Christmas spirit and I’m sure they’re all mad uncomfortable about it. I hope I didn’t ruin Christmas for everybody 😭",
          "created_utc": 1640470964.0
        }
      ]
    },
    {
      "id": "hpyjk7j",
      "author": "YeahNoYeahMaybeNo",
      "body": "Stay strong brother 💪",
      "created_utc": 1640470334.0,
      "score": 7,
      "context": [
        {
          "id": "hpyg6ya",
          "author": "mystic-goose",
          "body": "No not really but I’m getting through it :)",
          "created_utc": 1640468652.0
        }
      ]
    },
    {
      "id": "hpyox0i",
      "author": "Strong_Coyote7402",
      "body": "Normally I don’t endorse burning books, but…\n\nSending ❤️",
      "created_utc": 1640472989.0,
      "score": 16,
      "context": [
        {
          "id": "hpyhkoj",
          "author": "rtky1265",
          "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
          "created_utc": 1640469353.0
        }
      ]
    },
    {
      "id": "hpyjj43",
      "author": "YeahNoYeahMaybeNo",
      "body": "Aaai does your mother know about your troubles?",
      "created_utc": 1640470320.0,
      "score": 3,
      "context": [
        {
          "id": "hpyhkoj",
          "author": "rtky1265",
          "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
          "created_utc": 1640469353.0
        }
      ]
    },
    {
      "id": "hpyro5t",
      "author": "alexisseffy",
      "body": "Same eating makes me cry and  self harm 💀",
      "created_utc": 1640474391.0,
      "score": 3,
      "context": [
        {
          "id": "hpyr2gc",
          "author": "Musicknowsnobounds",
          "body": "I feel like I've been eating too much and now I feel guilty. My restriction habits are coming back.",
          "created_utc": 1640474082.0
        }
      ]
    },
    {
      "id": "hpytm4j",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thats a great achievement, has been years since the last time I skipped two weeks of bulimia",
      "created_utc": 1640475395.0,
      "score": 2,
      "context": [
        {
          "id": "hpysyyt",
          "author": "potatoihateyou",
          "body": "haven’t purged today!! like really proud of myself i haven’t purged in about 14 days now and i really thought i would mess of the streak today but i didn’t!",
          "created_utc": 1640475061.0
        }
      ]
    },
    {
      "id": "hpyrgue",
      "author": "YeahNoYeahMaybeNo",
      "body": "That is progress, well done, hope you survive tomorrow aswell",
      "created_utc": 1640474287.0,
      "score": 2,
      "context": [
        {
          "id": "hpyr85a",
          "author": "jadeeeeeeeeeeeeeee",
          "body": "purged only once today. every other day it's at least 5+ times so i'm pretty pleased",
          "created_utc": 1640474162.0
        }
      ]
    },
    {
      "id": "hpyrpkv",
      "author": "alexisseffy",
      "body": "Same lol",
      "created_utc": 1640474412.0,
      "score": 2,
      "context": [
        {
          "id": "hpyl94x",
          "author": "None",
          "body": "No",
          "created_utc": 1640471166.0
        }
      ]
    },
    {
      "id": "hpyllhh",
      "author": "YeahNoYeahMaybeNo",
      "body": "What happend? :(",
      "created_utc": 1640471340.0,
      "score": 1,
      "context": [
        {
          "id": "hpyl94x",
          "author": "None",
          "body": "No",
          "created_utc": 1640471166.0
        }
      ]
    },
    {
      "id": "hpyjgod",
      "author": "YeahNoYeahMaybeNo",
      "body": "Aah sad to hear, it happens, I behaved and ate like a ‘normal’ person with family :)",
      "created_utc": 1640470287.0,
      "score": 3,
      "context": [
        {
          "id": "hpyfpwr",
          "author": "_I_Love_Pizza_",
          "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
          "created_utc": 1640468408.0
        }
      ]
    },
    {
      "id": "hpyjhpr",
      "author": "JellyCharacter1653",
      "body": "Same my tongue hurts",
      "created_utc": 1640470301.0,
      "score": 2,
      "context": [
        {
          "id": "hpyfpwr",
          "author": "_I_Love_Pizza_",
          "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
          "created_utc": 1640468408.0
        }
      ]
    },
    {
      "id": "hpywq5u",
      "author": "YeahNoYeahMaybeNo",
      "body": "What helps me when I feel im totally out of control is tell myself just not anymore today, tomorrow I can do whatever. Convince yourself you are, in fact, just feeling pain and do not even taste the food anymore. If you survived today you can see and make it a sort of challenge to delay the b/p a bit longer. Speak to people you love and trust, Im sure they want to be there for you. Good luck ❤️",
      "created_utc": 1640476981.0,
      "score": 5,
      "context": [
        {
          "id": "hpyuwpk",
          "author": "Sweetpea987",
          "body": "today has been horrible for me my throat is sore and i’m so bloated but i can’t stop",
          "created_utc": 1640476060.0
        }
      ]
    },
    {
      "id": "hpyth0v",
      "author": "YeahNoYeahMaybeNo",
      "body": "Goodluck miss flower 🙏",
      "created_utc": 1640475321.0,
      "score": 1,
      "context": [
        {
          "id": "hpyry6x",
          "author": "kynthewallflower",
          "body": "i’m about to go to my grandparents house where they’re going to be having christmas dinner wish me luck",
          "created_utc": 1640474533.0
        }
      ]
    },
    {
      "id": "hpytiu8",
      "author": "YeahNoYeahMaybeNo",
      "body": "How you been till now?",
      "created_utc": 1640475347.0,
      "score": 1,
      "context": [
        {
          "id": "hpys4nw",
          "author": "SugarMaddy_",
          "body": "I'm strugglin ngl :\")",
          "created_utc": 1640474625.0
        }
      ]
    },
    {
      "id": "hpywcyx",
      "author": "YeahNoYeahMaybeNo",
      "body": "Dammit, feel like sharing how it went? Dont need to at all, only if you feel like. Wishing you good luck, sometimes shit is what it is ❤️",
      "created_utc": 1640476791.0,
      "score": 2,
      "context": [
        {
          "id": "hpyumwz",
          "author": "None",
          "body": "Unfortunately, today was my worst day yet",
          "created_utc": 1640475920.0
        }
      ]
    },
    {
      "id": "hpzvxjt",
      "author": "RevolutionarySea2349",
      "body": "Yeah this has been my worst week in a long time😪",
      "created_utc": 1640496629.0,
      "score": 2,
      "context": [
        {
          "id": "hpyumwz",
          "author": "None",
          "body": "Unfortunately, today was my worst day yet",
          "created_utc": 1640475920.0
        }
      ]
    },
    {
      "id": "hpz319i",
      "author": "YeahNoYeahMaybeNo",
      "body": "Hold on brother, you have plenty of time to fuck up later, try enjoy the time with your family",
      "created_utc": 1640480169.0,
      "score": 1,
      "context": [
        {
          "id": "hpz2t6k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640480049.0
        }
      ]
    },
    {
      "id": "hq0uvgg",
      "author": "YeahNoYeahMaybeNo",
      "body": "Haha hope you still have a good Christmas time even without family around 🙏",
      "created_utc": 1640525776.0,
      "score": 1,
      "context": [
        {
          "id": "hpz65xo",
          "author": "mrszmiawallace",
          "body": "Stayed away from family and friends. Can’t purge if there’s no meal 😛",
          "created_utc": 1640481862.0
        }
      ]
    },
    {
      "id": "hpz9e3t",
      "author": "YeahNoYeahMaybeNo",
      "body": "Small misstep happens, good that you did have a good time with your family",
      "created_utc": 1640483621.0,
      "score": 2,
      "context": [
        {
          "id": "hpz7pi2",
          "author": "G0TH4NG3LSINN3R-",
          "body": "nah i purged for the first time in.. a while. thought i was finally over it. feeling pretty horrific. i did have a nice time seeing my family tho",
          "created_utc": 1640482704.0
        }
      ]
    },
    {
      "id": "hpz9h34",
      "author": "YeahNoYeahMaybeNo",
      "body": "Dammit, what happend?",
      "created_utc": 1640483666.0,
      "score": 1,
      "context": [
        {
          "id": "hpz89yg",
          "author": "withextracheesepls",
          "body": "spent christmas eve in the hospital, but i’m alive so…\n\nhowever, not super happy about the whole being alive thing, because mentally i feel like shit.",
          "created_utc": 1640483010.0
        }
      ]
    },
    {
      "id": "hpza28v",
      "author": "YeahNoYeahMaybeNo",
      "body": "Throw your scale away, I did that years ago. It says so little about your actual weight, it is 95% water fluctuations, in couple of days your weight will go down again. Google what a UFC fighter weighs on weigh in day, one day before they fight. They easily “gain” 20 pounds in 24 hours, just because they dehydrated themself until they step on the scale. Good luck for the rest of the weekend 💪",
      "created_utc": 1640483997.0,
      "score": 5,
      "context": [
        {
          "id": "hpz8idr",
          "author": "universallyround",
          "body": "fought the urge all day by only having small amounts of food (being full is one of my triggers to purge). buuuut then i got a bit drunk in the evening, ate a huge amount of leftovers and purged lol. \n\nwoke up today and gained heaps from what i did keep down so not thriving 😩 urge to binge remaining leftovers is HIGH but my mother wont shut up about “how fat i’ve gotten” from christmas day 🥴",
          "created_utc": 1640483139.0
        }
      ]
    },
    {
      "id": "hpzusvz",
      "author": "riseaboveitx",
      "body": "Some of the moms I hear about in the ED subs are fucking brutal. I would share mine with everyone if I could, sorry you have to hear that from her",
      "created_utc": 1640495891.0,
      "score": 1,
      "context": [
        {
          "id": "hpz8idr",
          "author": "universallyround",
          "body": "fought the urge all day by only having small amounts of food (being full is one of my triggers to purge). buuuut then i got a bit drunk in the evening, ate a huge amount of leftovers and purged lol. \n\nwoke up today and gained heaps from what i did keep down so not thriving 😩 urge to binge remaining leftovers is HIGH but my mother wont shut up about “how fat i’ve gotten” from christmas day 🥴",
          "created_utc": 1640483139.0
        }
      ]
    },
    {
      "id": "hpza74j",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thats already a great achievement, stay strong 🙏",
      "created_utc": 1640484072.0,
      "score": 1,
      "context": [
        {
          "id": "hpz8pow",
          "author": "haybails720",
          "body": "More challenging than thanksgiving so far because of something that happened this morning \n\nI’m 115 days clean as of like, and hour ago and I rlly want to make it to 150 or 182(half a year) so that’s keeping me going",
          "created_utc": 1640483250.0
        }
      ]
    },
    {
      "id": "hpzvbx7",
      "author": "InevitableHospital38",
      "body": "Same !",
      "created_utc": 1640496234.0,
      "score": 1,
      "context": [
        {
          "id": "hpz8zna",
          "author": "NoOutlandishness420",
          "body": "no!!!😆",
          "created_utc": 1640483402.0
        }
      ]
    },
    {
      "id": "hpzaj5r",
      "author": "YeahNoYeahMaybeNo",
      "body": "Small misstep does not undo the two weeks b/p free. I have not managed such a long period in years. Get back on track tomorrow :)",
      "created_utc": 1640484249.0,
      "score": 4,
      "context": [
        {
          "id": "hpz9ry2",
          "author": "Retrostir",
          "body": "Binged for the first time in two weeks today so yeah going great 👍",
          "created_utc": 1640483835.0
        }
      ]
    },
    {
      "id": "hpzawwp",
      "author": "YeahNoYeahMaybeNo",
      "body": ":,) it is what it is, take it easy",
      "created_utc": 1640484461.0,
      "score": 2,
      "context": [
        {
          "id": "hpzar9j",
          "author": "Emotional_Relation38",
          "body": "barely, my entire family got a cold but me and they think i have one because my throat is so sore and swollen from how much i’ve been purging",
          "created_utc": 1640484371.0
        }
      ]
    },
    {
      "id": "hpzdyjl",
      "author": "YeahNoYeahMaybeNo",
      "body": "Sad to hear. Does your family know about your constant fight with bulimia?",
      "created_utc": 1640486113.0,
      "score": 1,
      "context": [
        {
          "id": "hpzcc4e",
          "author": "Tushkah0mma",
          "body": "Brother made a comment about my body and how much I’m eating and I’m fighting the purge urge so strongly right now. Feeling like shit",
          "created_utc": 1640485230.0
        }
      ]
    },
    {
      "id": "hpze7lr",
      "author": "YeahNoYeahMaybeNo",
      "body": "Good of you to look at the positive things in life, I also try to do this and im very thankful for my family, they are always there for me, no matter what. Enjoy the weekend :)",
      "created_utc": 1640486251.0,
      "score": 2,
      "context": [
        {
          "id": "hpzd50h",
          "author": "daisyelisabee",
          "body": "I’m half and half, been trying to stay good on account of my body not feeling great recently and feeling depressed about my tooth damage, I’m bloated up a bit but I think it’s because my periods coming so I’m trying to keep that in mind, but the nausea of trying to retrain my body to handle food is really hard, which wasn’t so helpful. I couldn’t drink a lot because of it but I guess that’s for the best. I haven’t done yoga in almost a month which is freaking me out but I do plan to jump back in when ywa starts her new 30 day challenge which helps me. It wasn’t perfect but I did some good today and I like to look at the little strides while still acknowledging I need to keep improving. Happy holidays my friends, lots of love to you all tonight❤️",
          "created_utc": 1640485665.0
        }
      ]
    },
    {
      "id": "hpzj3pq",
      "author": "YeahNoYeahMaybeNo",
      "body": "Haha thats maybe a bit ironical but done with love from your sister. My day was good, had dinner with my family and did not throw up, thank you for asking",
      "created_utc": 1640488964.0,
      "score": 2,
      "context": [
        {
          "id": "hpzihh7",
          "author": "chognogg",
          "body": "My sister gave me a mini fridge for Yule - I'm super flattered, those things cost crazy prices. But a part of me can't help but think it's because all she thinks I do is eat. (Which, in all honesty, is true, but it still hurts.)\n\nHow was your holiday?",
          "created_utc": 1640488624.0
        }
      ]
    },
    {
      "id": "hpzj81o",
      "author": "YeahNoYeahMaybeNo",
      "body": "Haha well done 💪",
      "created_utc": 1640489031.0,
      "score": 1,
      "context": [
        {
          "id": "hpzivvm",
          "author": "None",
          "body": "I had a piece of cheesecake that i didn't purge!",
          "created_utc": 1640488841.0
        }
      ]
    },
    {
      "id": "hq0o1td",
      "author": "YeahNoYeahMaybeNo",
      "body": "What happend? :(",
      "created_utc": 1640520683.0,
      "score": 1,
      "context": [
        {
          "id": "hq0l4q8",
          "author": "MallowHober",
          "body": "Help",
          "created_utc": 1640518106.0
        }
      ]
    },
    {
      "id": "hq0okpy",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thats good to hear, hope you are surviving today aswell 💪",
      "created_utc": 1640521124.0,
      "score": 2,
      "context": [
        {
          "id": "hq0ljbf",
          "author": "smoothbitch420",
          "body": "for whatever reason the voice that tells me to pull trig after every meal quiets down during the holidays",
          "created_utc": 1640518469.0
        }
      ]
    },
    {
      "id": "hq0soqf",
      "author": "YeahNoYeahMaybeNo",
      "body": "Whaddup? Funny name btw ^^",
      "created_utc": 1640524285.0,
      "score": 1,
      "context": [
        {
          "id": "hq0qd6q",
          "author": "reverseboob7841",
          "body": "jesus christ, no",
          "created_utc": 1640522561.0
        }
      ]
    },
    {
      "id": "hq0t2of",
      "author": "YeahNoYeahMaybeNo",
      "body": "Get rid of your scale, it says nothing about weight gain short term, just water fluctuations. I have not weight myself in like 5 years, I just look in the mirror when I feel confident, much less stressful than focusing on the number on the scale. Google what a UFC fighter weighs on weigh in day, a day before they fight. They come back easily 20 pounds heavier. That doesnt mean that that is 20 pounds of fat, its 99% water. Good luck today 💪",
      "created_utc": 1640524563.0,
      "score": 2,
      "context": [
        {
          "id": "hq0s5n3",
          "author": "sjupiter92",
          "body": "Nah binged and purged throughout friday and saturday on top of getting my period today. I'm out of my mind scared of stepping on the scale and seeing the damage I've done",
          "created_utc": 1640523904.0
        }
      ]
    },
    {
      "id": "hq0u11z",
      "author": "YeahNoYeahMaybeNo",
      "body": "Well done, 5 day streak is definitely something to be proud of, lets hope you cam extend that a bit longer. Wishing you all the best :)",
      "created_utc": 1640525212.0,
      "score": 1,
      "context": [
        {
          "id": "hq0t9p2",
          "author": "Far-Boysenberry-8691",
          "body": "I feel so fat!!! Haven't purged which I'm really happy about. But ate sooo much food... I can see my cellulite and my arms are jiggly. This is the biggest I've been in my life. But quite happy not to have purged for 5 days 🙌",
          "created_utc": 1640524702.0
        }
      ]
    },
    {
      "id": "hq1v5w9",
      "author": "YeahNoYeahMaybeNo",
      "body": "Awesome to hear, well done 💪",
      "created_utc": 1640543557.0,
      "score": 1,
      "context": [
        {
          "id": "hq1jexk",
          "author": "tarynjo2",
          "body": "This is my 4th Christmas being bulimic but I managed to actually keep it all down and genuinely enjoyed myself 👍🏼",
          "created_utc": 1640538385.0
        }
      ]
    },
    {
      "id": "hq1vcyj",
      "author": "YeahNoYeahMaybeNo",
      "body": "Fuck. Yeah that sucks, but is did not undo the months free of being a bulimic. Try picking it up again after the weekend. Best of luck",
      "created_utc": 1640543638.0,
      "score": 3,
      "context": [
        {
          "id": "hq1ojen",
          "author": "napolionnappe",
          "body": "Went from not having bulimia for months til getting triggered and had bulimia 3 days in a row",
          "created_utc": 1640540683.0
        }
      ]
    },
    {
      "id": "hq2031w",
      "author": "YeahNoYeahMaybeNo",
      "body": "No need to be mad, it happens, tomorrow is a new day. Hope you can enjoy your holidays despite the bulimia stuff. Good luck",
      "created_utc": 1640545624.0,
      "score": 1,
      "context": [
        {
          "id": "hq1z403",
          "author": "killermichi",
          "body": "I tried doing good Christmas Eve.  My family had a nice get together with my cousins but I eventually had to sneak away and purge.  I felt terrible for it.",
          "created_utc": 1640545216.0
        }
      ]
    },
    {
      "id": "hq2ea38",
      "author": "YeahNoYeahMaybeNo",
      "body": "Take some rest, there is plenty of time to fck up on another day",
      "created_utc": 1640552477.0,
      "score": 2,
      "context": [
        {
          "id": "hq26zew",
          "author": "None",
          "body": "We had our Christmas dinner on Friday. Did great!\n\nRelapsed yesterday on leftovers, though. I worked all day without eating and then got home and, well, you know. \n\nI made myself eat a protein bar today and had a iced coffee (had calories), so I hope I don’t b/p tonight. I feel less “ravished” already so 🤞",
          "created_utc": 1640548555.0
        }
      ]
    },
    {
      "id": "hpymmti",
      "author": "mysocksareitchy",
      "body": "I appreciate you and hope you’re pulling through as well! Thanks for the support, this community really means everything to me right now.",
      "created_utc": 1640471864.0,
      "score": 4,
      "context": [
        {
          "id": "hpykug8",
          "author": "mysocksareitchy",
          "body": "I can’t stop purging everything today and I’m really scared of the calories I’ve absorbed and I feel like a failure to my family because I think they know what I’m doing and they’re too nervous to break the Christmas spirit and I’m sure they’re all mad uncomfortable about it. I hope I didn’t ruin Christmas for everybody 😭",
          "created_utc": 1640470964.0
        },
        {
          "id": "hpylhxe",
          "author": "YeahNoYeahMaybeNo",
          "body": "Sad to hear. Maybe its a good resolution for 2022 and come clean with your ED to your parents. It does make life more comfortable with people you love in your corner. Good luck ❤️",
          "created_utc": 1640471290.0
        }
      ]
    },
    {
      "id": "hpynx87",
      "author": "mystic-goose",
      "body": "Thanks. It’s my resolution next year to kick it for good. I came so close this year :)",
      "created_utc": 1640472498.0,
      "score": 10,
      "context": [
        {
          "id": "hpyg6ya",
          "author": "mystic-goose",
          "body": "No not really but I’m getting through it :)",
          "created_utc": 1640468652.0
        },
        {
          "id": "hpyjk7j",
          "author": "YeahNoYeahMaybeNo",
          "body": "Stay strong brother 💪",
          "created_utc": 1640470334.0
        }
      ]
    },
    {
      "id": "hq1j4jc",
      "author": "rtky1265",
      "body": "Thank you ❤️",
      "created_utc": 1640538254.0,
      "score": 1,
      "context": [
        {
          "id": "hpyhkoj",
          "author": "rtky1265",
          "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
          "created_utc": 1640469353.0
        },
        {
          "id": "hpyox0i",
          "author": "Strong_Coyote7402",
          "body": "Normally I don’t endorse burning books, but…\n\nSending ❤️",
          "created_utc": 1640472989.0
        }
      ]
    },
    {
      "id": "hq1j39d",
      "author": "rtky1265",
      "body": "Yeah she does, no clue what went through her head but hey",
      "created_utc": 1640538239.0,
      "score": 4,
      "context": [
        {
          "id": "hpyhkoj",
          "author": "rtky1265",
          "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
          "created_utc": 1640469353.0
        },
        {
          "id": "hpyjj43",
          "author": "YeahNoYeahMaybeNo",
          "body": "Aaai does your mother know about your troubles?",
          "created_utc": 1640470320.0
        }
      ]
    },
    {
      "id": "hpyrpqs",
      "author": "Musicknowsnobounds",
      "body": "Sending love your way",
      "created_utc": 1640474414.0,
      "score": 6,
      "context": [
        {
          "id": "hpyr2gc",
          "author": "Musicknowsnobounds",
          "body": "I feel like I've been eating too much and now I feel guilty. My restriction habits are coming back.",
          "created_utc": 1640474082.0
        },
        {
          "id": "hpyro5t",
          "author": "alexisseffy",
          "body": "Same eating makes me cry and  self harm 💀",
          "created_utc": 1640474391.0
        }
      ]
    },
    {
      "id": "hpyp6sn",
      "author": "_I_Love_Pizza_",
      "body": "Yeah ik :(. Well that’s good then right I’m very proud of you for getting thru today <3",
      "created_utc": 1640473124.0,
      "score": 2,
      "context": [
        {
          "id": "hpyfpwr",
          "author": "_I_Love_Pizza_",
          "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
          "created_utc": 1640468408.0
        },
        {
          "id": "hpyjgod",
          "author": "YeahNoYeahMaybeNo",
          "body": "Aah sad to hear, it happens, I behaved and ate like a ‘normal’ person with family :)",
          "created_utc": 1640470287.0
        }
      ]
    },
    {
      "id": "hpyyr4n",
      "author": "Sweetpea987",
      "body": "i just saw this comment after i finished and i started to cry i’m going to take your advice and just stop for the day i’m going to make myself oatmeal in a bit to help me feel better and just relax. thank you and good luck to you as well 🤍",
      "created_utc": 1640478015.0,
      "score": 3,
      "context": [
        {
          "id": "hpyuwpk",
          "author": "Sweetpea987",
          "body": "today has been horrible for me my throat is sore and i’m so bloated but i can’t stop",
          "created_utc": 1640476060.0
        },
        {
          "id": "hpywq5u",
          "author": "YeahNoYeahMaybeNo",
          "body": "What helps me when I feel im totally out of control is tell myself just not anymore today, tomorrow I can do whatever. Convince yourself you are, in fact, just feeling pain and do not even taste the food anymore. If you survived today you can see and make it a sort of challenge to delay the b/p a bit longer. Speak to people you love and trust, Im sure they want to be there for you. Good luck ❤️",
          "created_utc": 1640476981.0
        }
      ]
    },
    {
      "id": "hpytnjf",
      "author": "SugarMaddy_",
      "body": "Pretty much purged most of what I've eaten today, couldn't get it all so I forced myself to exercise for an hour and we haven't even had the big dinner yet HHHHHG. Wanna cry, my throat hurts",
      "created_utc": 1640475416.0,
      "score": 3,
      "context": [
        {
          "id": "hpys4nw",
          "author": "SugarMaddy_",
          "body": "I'm strugglin ngl :\")",
          "created_utc": 1640474625.0
        },
        {
          "id": "hpytiu8",
          "author": "YeahNoYeahMaybeNo",
          "body": "How you been till now?",
          "created_utc": 1640475347.0
        }
      ]
    },
    {
      "id": "hpyya4d",
      "author": "None",
      "body": "Thank you. it’s just that I’ve been really stressed lately and today I just let myself go. How was your day ? Hopefully better than mine",
      "created_utc": 1640477774.0,
      "score": 2,
      "context": [
        {
          "id": "hpyumwz",
          "author": "None",
          "body": "Unfortunately, today was my worst day yet",
          "created_utc": 1640475920.0
        },
        {
          "id": "hpywcyx",
          "author": "YeahNoYeahMaybeNo",
          "body": "Dammit, feel like sharing how it went? Dont need to at all, only if you feel like. Wishing you good luck, sometimes shit is what it is ❤️",
          "created_utc": 1640476791.0
        }
      ]
    },
    {
      "id": "hpz9qum",
      "author": "withextracheesepls",
      "body": "my stomach was spasming, apparently, it was mad painful (worse than when i had a kidney stone). they gave me painkillers and a really strong muscle relaxant and it cleared up. still dunno what caused it, probably my ed but i didn’t mention i was bulimic due to a bad track record of mistreatment when doctors are informed of it… they also acted very indifferent to me crying from pain and sent me home immediately after medicating me so, lol.\n\ni asked if i should see a gastro (not during my er visit, just if i should set up an appt) and the nurse shrugged and said “idk, maybe if it happens again”. like ma’am, don’t you think this warrants me getting checked out? if i’m crying from pain and decided to go to the er, which is full of covid cases, as an immunocompromised person, on fucking christmas eve??",
      "created_utc": 1640483816.0,
      "score": 2,
      "context": [
        {
          "id": "hpz89yg",
          "author": "withextracheesepls",
          "body": "spent christmas eve in the hospital, but i’m alive so…\n\nhowever, not super happy about the whole being alive thing, because mentally i feel like shit.",
          "created_utc": 1640483010.0
        },
        {
          "id": "hpz9h34",
          "author": "YeahNoYeahMaybeNo",
          "body": "Dammit, what happend?",
          "created_utc": 1640483666.0
        }
      ]
    },
    {
      "id": "hpzk0vl",
      "author": "universallyround",
      "body": "there was a time a few months ago when i literally did get rid of my scale and it was like my eating disorder just suddenly didnt exist anymore? if i didnt know my weight i didnt care anymore and could eat what i wanted without purging. \n\nso i know i gotta get rid of it again but its so so hard to do",
      "created_utc": 1640489491.0,
      "score": 2,
      "context": [
        {
          "id": "hpz8idr",
          "author": "universallyround",
          "body": "fought the urge all day by only having small amounts of food (being full is one of my triggers to purge). buuuut then i got a bit drunk in the evening, ate a huge amount of leftovers and purged lol. \n\nwoke up today and gained heaps from what i did keep down so not thriving 😩 urge to binge remaining leftovers is HIGH but my mother wont shut up about “how fat i’ve gotten” from christmas day 🥴",
          "created_utc": 1640483139.0
        },
        {
          "id": "hpza28v",
          "author": "YeahNoYeahMaybeNo",
          "body": "Throw your scale away, I did that years ago. It says so little about your actual weight, it is 95% water fluctuations, in couple of days your weight will go down again. Google what a UFC fighter weighs on weigh in day, one day before they fight. They easily “gain” 20 pounds in 24 hours, just because they dehydrated themself until they step on the scale. Good luck for the rest of the weekend 💪",
          "created_utc": 1640483997.0
        }
      ]
    },
    {
      "id": "hpzb4ej",
      "author": "Retrostir",
      "body": "It just feels so bad after staying strong for so long, this was my longest purge free time period this year but I’m aiming to beat it next year",
      "created_utc": 1640484576.0,
      "score": 2,
      "context": [
        {
          "id": "hpz9ry2",
          "author": "Retrostir",
          "body": "Binged for the first time in two weeks today so yeah going great 👍",
          "created_utc": 1640483835.0
        },
        {
          "id": "hpzaj5r",
          "author": "YeahNoYeahMaybeNo",
          "body": "Small misstep does not undo the two weeks b/p free. I have not managed such a long period in years. Get back on track tomorrow :)",
          "created_utc": 1640484249.0
        }
      ]
    },
    {
      "id": "hpzi4o5",
      "author": "Tushkah0mma",
      "body": "Nope. It’s not the kind of family where mental health is a very safe space. I was kind of taught to hide all of those things from a young age and that’s a behavior I’m slowly unlearning with my friends",
      "created_utc": 1640488429.0,
      "score": 2,
      "context": [
        {
          "id": "hpzcc4e",
          "author": "Tushkah0mma",
          "body": "Brother made a comment about my body and how much I’m eating and I’m fighting the purge urge so strongly right now. Feeling like shit",
          "created_utc": 1640485230.0
        },
        {
          "id": "hpzdyjl",
          "author": "YeahNoYeahMaybeNo",
          "body": "Sad to hear. Does your family know about your constant fight with bulimia?",
          "created_utc": 1640486113.0
        }
      ]
    },
    {
      "id": "hq8cg5d",
      "author": "daisyelisabee",
      "body": "Thank you:) I hope you had an easy one as well, as easy as possible ❤️",
      "created_utc": 1640661089.0,
      "score": 2,
      "context": [
        {
          "id": "hpzd50h",
          "author": "daisyelisabee",
          "body": "I’m half and half, been trying to stay good on account of my body not feeling great recently and feeling depressed about my tooth damage, I’m bloated up a bit but I think it’s because my periods coming so I’m trying to keep that in mind, but the nausea of trying to retrain my body to handle food is really hard, which wasn’t so helpful. I couldn’t drink a lot because of it but I guess that’s for the best. I haven’t done yoga in almost a month which is freaking me out but I do plan to jump back in when ywa starts her new 30 day challenge which helps me. It wasn’t perfect but I did some good today and I like to look at the little strides while still acknowledging I need to keep improving. Happy holidays my friends, lots of love to you all tonight❤️",
          "created_utc": 1640485665.0
        },
        {
          "id": "hpze7lr",
          "author": "YeahNoYeahMaybeNo",
          "body": "Good of you to look at the positive things in life, I also try to do this and im very thankful for my family, they are always there for me, no matter what. Enjoy the weekend :)",
          "created_utc": 1640486251.0
        }
      ]
    },
    {
      "id": "hq0un9d",
      "author": "sjupiter92",
      "body": "Unfortunately, can't get rid of it permanently but I'm trying really hard not to weigh myself today and hopefully for the next couple of days because I know it will just cause me more harm. 😔 Thank you tho, good luck to you too and hope you're doing well! 🤞",
      "created_utc": 1640525626.0,
      "score": 2,
      "context": [
        {
          "id": "hq0s5n3",
          "author": "sjupiter92",
          "body": "Nah binged and purged throughout friday and saturday on top of getting my period today. I'm out of my mind scared of stepping on the scale and seeing the damage I've done",
          "created_utc": 1640523904.0
        },
        {
          "id": "hq0t2of",
          "author": "YeahNoYeahMaybeNo",
          "body": "Get rid of your scale, it says nothing about weight gain short term, just water fluctuations. I have not weight myself in like 5 years, I just look in the mirror when I feel confident, much less stressful than focusing on the number on the scale. Google what a UFC fighter weighs on weigh in day, a day before they fight. They come back easily 20 pounds heavier. That doesnt mean that that is 20 pounds of fat, its 99% water. Good luck today 💪",
          "created_utc": 1640524563.0
        }
      ]
    },
    {
      "id": "hq6xh0f",
      "author": "None",
      "body": "Wiser words never been spoken HAHA",
      "created_utc": 1640638801.0,
      "score": 2,
      "context": [
        {
          "id": "hq26zew",
          "author": "None",
          "body": "We had our Christmas dinner on Friday. Did great!\n\nRelapsed yesterday on leftovers, though. I worked all day without eating and then got home and, well, you know. \n\nI made myself eat a protein bar today and had a iced coffee (had calories), so I hope I don’t b/p tonight. I feel less “ravished” already so 🤞",
          "created_utc": 1640548555.0
        },
        {
          "id": "hq2ea38",
          "author": "YeahNoYeahMaybeNo",
          "body": "Take some rest, there is plenty of time to fck up on another day",
          "created_utc": 1640552477.0
        }
      ]
    },
    {
      "id": "hq1x7cj",
      "author": "YeahNoYeahMaybeNo",
      "body": "Maybe she thought if you want to lose weight you can do it in a healthy way. Im sure she loves you and had no bad intentions, just tell her how you feel about it",
      "created_utc": 1640544416.0,
      "score": 1,
      "context": [
        {
          "id": "hpyhkoj",
          "author": "rtky1265",
          "body": "Well my mum gave me a dieting book so yeah... Can't wait for Christmas to be over!",
          "created_utc": 1640469353.0
        },
        {
          "id": "hpyjj43",
          "author": "YeahNoYeahMaybeNo",
          "body": "Aaai does your mother know about your troubles?",
          "created_utc": 1640470320.0
        },
        {
          "id": "hq1j39d",
          "author": "rtky1265",
          "body": "Yeah she does, no clue what went through her head but hey",
          "created_utc": 1640538239.0
        }
      ]
    },
    {
      "id": "hpyrrx4",
      "author": "alexisseffy",
      "body": "You too <3",
      "created_utc": 1640474444.0,
      "score": 4,
      "context": [
        {
          "id": "hpyr2gc",
          "author": "Musicknowsnobounds",
          "body": "I feel like I've been eating too much and now I feel guilty. My restriction habits are coming back.",
          "created_utc": 1640474082.0
        },
        {
          "id": "hpyro5t",
          "author": "alexisseffy",
          "body": "Same eating makes me cry and  self harm 💀",
          "created_utc": 1640474391.0
        },
        {
          "id": "hpyrpqs",
          "author": "Musicknowsnobounds",
          "body": "Sending love your way",
          "created_utc": 1640474414.0
        }
      ]
    },
    {
      "id": "hpyptvt",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thank you. Tomorrow is new day, give it a good try again.",
      "created_utc": 1640473451.0,
      "score": 2,
      "context": [
        {
          "id": "hpyfpwr",
          "author": "_I_Love_Pizza_",
          "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
          "created_utc": 1640468408.0
        },
        {
          "id": "hpyjgod",
          "author": "YeahNoYeahMaybeNo",
          "body": "Aah sad to hear, it happens, I behaved and ate like a ‘normal’ person with family :)",
          "created_utc": 1640470287.0
        },
        {
          "id": "hpyp6sn",
          "author": "_I_Love_Pizza_",
          "body": "Yeah ik :(. Well that’s good then right I’m very proud of you for getting thru today <3",
          "created_utc": 1640473124.0
        }
      ]
    },
    {
      "id": "hpyz4y6",
      "author": "YeahNoYeahMaybeNo",
      "body": "Have faith, stopping it now, even when you feel like continuing is a W. Get some rest, maybe call a friend/family. Take it easy",
      "created_utc": 1640478205.0,
      "score": 1,
      "context": [
        {
          "id": "hpyuwpk",
          "author": "Sweetpea987",
          "body": "today has been horrible for me my throat is sore and i’m so bloated but i can’t stop",
          "created_utc": 1640476060.0
        },
        {
          "id": "hpywq5u",
          "author": "YeahNoYeahMaybeNo",
          "body": "What helps me when I feel im totally out of control is tell myself just not anymore today, tomorrow I can do whatever. Convince yourself you are, in fact, just feeling pain and do not even taste the food anymore. If you survived today you can see and make it a sort of challenge to delay the b/p a bit longer. Speak to people you love and trust, Im sure they want to be there for you. Good luck ❤️",
          "created_utc": 1640476981.0
        },
        {
          "id": "hpyyr4n",
          "author": "Sweetpea987",
          "body": "i just saw this comment after i finished and i started to cry i’m going to take your advice and just stop for the day i’m going to make myself oatmeal in a bit to help me feel better and just relax. thank you and good luck to you as well 🤍",
          "created_utc": 1640478015.0
        }
      ]
    },
    {
      "id": "hpyw6tj",
      "author": "YeahNoYeahMaybeNo",
      "body": "Try to give your throat some rest, chew well and lay your fork and knive away every couple of bites. Stop eating before you feel like you must throw up. When I eat to quick the bulimia reflex kicks in, so I hope it might help. Good luck",
      "created_utc": 1640476704.0,
      "score": 2,
      "context": [
        {
          "id": "hpys4nw",
          "author": "SugarMaddy_",
          "body": "I'm strugglin ngl :\")",
          "created_utc": 1640474625.0
        },
        {
          "id": "hpytiu8",
          "author": "YeahNoYeahMaybeNo",
          "body": "How you been till now?",
          "created_utc": 1640475347.0
        },
        {
          "id": "hpytnjf",
          "author": "SugarMaddy_",
          "body": "Pretty much purged most of what I've eaten today, couldn't get it all so I forced myself to exercise for an hour and we haven't even had the big dinner yet HHHHHG. Wanna cry, my throat hurts",
          "created_utc": 1640475416.0
        }
      ]
    },
    {
      "id": "hpyyty0",
      "author": "YeahNoYeahMaybeNo",
      "body": "Thanks for asking. Yeah it went kinda well, had like a ‘regular’ person food with family, no throwing up, small W.",
      "created_utc": 1640478055.0,
      "score": 2,
      "context": [
        {
          "id": "hpyumwz",
          "author": "None",
          "body": "Unfortunately, today was my worst day yet",
          "created_utc": 1640475920.0
        },
        {
          "id": "hpywcyx",
          "author": "YeahNoYeahMaybeNo",
          "body": "Dammit, feel like sharing how it went? Dont need to at all, only if you feel like. Wishing you good luck, sometimes shit is what it is ❤️",
          "created_utc": 1640476791.0
        },
        {
          "id": "hpyya4d",
          "author": "None",
          "body": "Thank you. it’s just that I’ve been really stressed lately and today I just let myself go. How was your day ? Hopefully better than mine",
          "created_utc": 1640477774.0
        }
      ]
    },
    {
      "id": "hpzafd4",
      "author": "YeahNoYeahMaybeNo",
      "body": "Aaai feeling, not that I really can, with you. Try look at the positive side, you are still alive. And maybe its enough motivation to finally say goodbye to the bulimia shit",
      "created_utc": 1640484193.0,
      "score": 1,
      "context": [
        {
          "id": "hpz89yg",
          "author": "withextracheesepls",
          "body": "spent christmas eve in the hospital, but i’m alive so…\n\nhowever, not super happy about the whole being alive thing, because mentally i feel like shit.",
          "created_utc": 1640483010.0
        },
        {
          "id": "hpz9h34",
          "author": "YeahNoYeahMaybeNo",
          "body": "Dammit, what happend?",
          "created_utc": 1640483666.0
        },
        {
          "id": "hpz9qum",
          "author": "withextracheesepls",
          "body": "my stomach was spasming, apparently, it was mad painful (worse than when i had a kidney stone). they gave me painkillers and a really strong muscle relaxant and it cleared up. still dunno what caused it, probably my ed but i didn’t mention i was bulimic due to a bad track record of mistreatment when doctors are informed of it… they also acted very indifferent to me crying from pain and sent me home immediately after medicating me so, lol.\n\ni asked if i should see a gastro (not during my er visit, just if i should set up an appt) and the nurse shrugged and said “idk, maybe if it happens again”. like ma’am, don’t you think this warrants me getting checked out? if i’m crying from pain and decided to go to the er, which is full of covid cases, as an immunocompromised person, on fucking christmas eve??",
          "created_utc": 1640483816.0
        }
      ]
    },
    {
      "id": "hpzkkg1",
      "author": "YeahNoYeahMaybeNo",
      "body": "Break it in half and toss it in the bin now 🤝",
      "created_utc": 1640489791.0,
      "score": 1,
      "context": [
        {
          "id": "hpz8idr",
          "author": "universallyround",
          "body": "fought the urge all day by only having small amounts of food (being full is one of my triggers to purge). buuuut then i got a bit drunk in the evening, ate a huge amount of leftovers and purged lol. \n\nwoke up today and gained heaps from what i did keep down so not thriving 😩 urge to binge remaining leftovers is HIGH but my mother wont shut up about “how fat i’ve gotten” from christmas day 🥴",
          "created_utc": 1640483139.0
        },
        {
          "id": "hpza28v",
          "author": "YeahNoYeahMaybeNo",
          "body": "Throw your scale away, I did that years ago. It says so little about your actual weight, it is 95% water fluctuations, in couple of days your weight will go down again. Google what a UFC fighter weighs on weigh in day, one day before they fight. They easily “gain” 20 pounds in 24 hours, just because they dehydrated themself until they step on the scale. Good luck for the rest of the weekend 💪",
          "created_utc": 1640483997.0
        },
        {
          "id": "hpzk0vl",
          "author": "universallyround",
          "body": "there was a time a few months ago when i literally did get rid of my scale and it was like my eating disorder just suddenly didnt exist anymore? if i didnt know my weight i didnt care anymore and could eat what i wanted without purging. \n\nso i know i gotta get rid of it again but its so so hard to do",
          "created_utc": 1640489491.0
        }
      ]
    },
    {
      "id": "hpziw1r",
      "author": "YeahNoYeahMaybeNo",
      "body": "Maybe start with one family member, a sibling perhaps. Nice to see that despite bulimia you are growing mentally with the help of your friends. Good luck for the rest of the weekend and 2022",
      "created_utc": 1640488844.0,
      "score": 1,
      "context": [
        {
          "id": "hpzcc4e",
          "author": "Tushkah0mma",
          "body": "Brother made a comment about my body and how much I’m eating and I’m fighting the purge urge so strongly right now. Feeling like shit",
          "created_utc": 1640485230.0
        },
        {
          "id": "hpzdyjl",
          "author": "YeahNoYeahMaybeNo",
          "body": "Sad to hear. Does your family know about your constant fight with bulimia?",
          "created_utc": 1640486113.0
        },
        {
          "id": "hpzi4o5",
          "author": "Tushkah0mma",
          "body": "Nope. It’s not the kind of family where mental health is a very safe space. I was kind of taught to hide all of those things from a young age and that’s a behavior I’m slowly unlearning with my friends",
          "created_utc": 1640488429.0
        }
      ]
    },
    {
      "id": "hpyq3oi",
      "author": "_I_Love_Pizza_",
      "body": "Ofc. Yeah I’m trying to cut down on binging and stuff bc I hate my bulimia more than I ever could my anorexia I hate losing control and love the control so I hope to not b&p for a while now",
      "created_utc": 1640473588.0,
      "score": 2,
      "context": [
        {
          "id": "hpyfpwr",
          "author": "_I_Love_Pizza_",
          "body": "Barely, my mouth hurts so much from the binging purging I’ve been doing :/ wbu",
          "created_utc": 1640468408.0
        },
        {
          "id": "hpyjgod",
          "author": "YeahNoYeahMaybeNo",
          "body": "Aah sad to hear, it happens, I behaved and ate like a ‘normal’ person with family :)",
          "created_utc": 1640470287.0
        },
        {
          "id": "hpyp6sn",
          "author": "_I_Love_Pizza_",
          "body": "Yeah ik :(. Well that’s good then right I’m very proud of you for getting thru today <3",
          "created_utc": 1640473124.0
        },
        {
          "id": "hpyptvt",
          "author": "YeahNoYeahMaybeNo",
          "body": "Thank you. Tomorrow is new day, give it a good try again.",
          "created_utc": 1640473451.0
        }
      ]
    },
    {
      "id": "hpywxvm",
      "author": "SugarMaddy_",
      "body": "Thank you I'll try that!",
      "created_utc": 1640477091.0,
      "score": 2,
      "context": [
        {
          "id": "hpys4nw",
          "author": "SugarMaddy_",
          "body": "I'm strugglin ngl :\")",
          "created_utc": 1640474625.0
        },
        {
          "id": "hpytiu8",
          "author": "YeahNoYeahMaybeNo",
          "body": "How you been till now?",
          "created_utc": 1640475347.0
        },
        {
          "id": "hpytnjf",
          "author": "SugarMaddy_",
          "body": "Pretty much purged most of what I've eaten today, couldn't get it all so I forced myself to exercise for an hour and we haven't even had the big dinner yet HHHHHG. Wanna cry, my throat hurts",
          "created_utc": 1640475416.0
        },
        {
          "id": "hpyw6tj",
          "author": "YeahNoYeahMaybeNo",
          "body": "Try to give your throat some rest, chew well and lay your fork and knive away every couple of bites. Stop eating before you feel like you must throw up. When I eat to quick the bulimia reflex kicks in, so I hope it might help. Good luck",
          "created_utc": 1640476704.0
        }
      ]
    },
    {
      "id": "hpzoma4",
      "author": "Tushkah0mma",
      "body": "Thank you. I might, but honestly I’m fine with my support system. My partner and my best friend are aware and they’re both amazing. Thank you for your post and for caring about complete strangers struggling with the same thing. Good luck to you as well",
      "created_utc": 1640492063.0,
      "score": 1,
      "context": [
        {
          "id": "hpzcc4e",
          "author": "Tushkah0mma",
          "body": "Brother made a comment about my body and how much I’m eating and I’m fighting the purge urge so strongly right now. Feeling like shit",
          "created_utc": 1640485230.0
        },
        {
          "id": "hpzdyjl",
          "author": "YeahNoYeahMaybeNo",
          "body": "Sad to hear. Does your family know about your constant fight with bulimia?",
          "created_utc": 1640486113.0
        },
        {
          "id": "hpzi4o5",
          "author": "Tushkah0mma",
          "body": "Nope. It’s not the kind of family where mental health is a very safe space. I was kind of taught to hide all of those things from a young age and that’s a behavior I’m slowly unlearning with my friends",
          "created_utc": 1640488429.0
        },
        {
          "id": "hpziw1r",
          "author": "YeahNoYeahMaybeNo",
          "body": "Maybe start with one family member, a sibling perhaps. Nice to see that despite bulimia you are growing mentally with the help of your friends. Good luck for the rest of the weekend and 2022",
          "created_utc": 1640488844.0
        }
      ]
    }
  ]
}