{
  "id": "rx9vgs",
  "subreddit": "bulimia",
  "author": "RevolutionarySea2349",
  "created_utc": 1641458739.0,
  "title": "I think a lot of the time i think i’m full on binging, but i’m actually just overeating a little. Anybody relate?",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/rx9vgs/i_think_a_lot_of_the_time_i_think_im_full_on/",
  "score": 73,
  "num_comments": 15,
  "comments": [
    {
      "id": "hrgxkbi",
      "author": "scumm_bar",
      "body": "Yeah, but I think \"binge\" is a bit subjective, maybe more about the feeling of loss of control than the actual amount of food",
      "created_utc": 1641459796.0,
      "score": 26,
      "context": []
    },
    {
      "id": "hrh48pg",
      "author": "JunjinNito",
      "body": "absolutely,, i usually have omad and i try to keep it under 1500 but sometimes i get fast food and even though technically it’s not like-an egregious amount of cals it feels like it and i feel bad. i don’t know it feels like i’m a crazy animal that hasn’t eaten for days and i call it a binge bc it feels like it. i completely get what u mean",
      "created_utc": 1641465011.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hrjhwe9",
      "author": "Loctusofsmorgasbord",
      "body": "YES!  My husband does this..  he never eats (one big meal at 7pm, lives off cigarettes and coffee) so me having healthy habits makes me look like a glutton. He’s the center of the universe and always right and expects everyone to have the same habits as him. 🙄. And he can’t keep his opinions to himself. \nEvery time I eat he says something. I refuse to eat in front of him. I’ve gone back to starving myself and restricting after I have been a healthy weight for almost a year. \nI’m leaving his ass. \nIt’s extremely triggering and leaves me feeling ashamed and disgusting.",
      "created_utc": 1641502029.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hrgxtzx",
      "author": "Professional-Goat-2",
      "body": "That post would be more relatable in the anorexia community , my personal experience was being underweight and I was more easily full that ever now eating normally just creates more hunger",
      "created_utc": 1641460009.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hrjlybt",
      "author": "dont-go-to-bed",
      "body": "yes. i think i should be eating less than 600 calories a day so if i eat a full meal, i punish myself and call it a binge. \n\ni also do however, eat irresponsibly. like an entire bag of chips in one sitting. i'm not stuffed by the end but i'd consider that a binge because aint nobody supposed to eat the whole bag in one sitting.",
      "created_utc": 1641503528.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hrgxrzb",
      "author": "None",
      "body": "This is a dangerous one. It's good to have tabs on what you're eating but I remember I used to think \"my binges aren't bad!\" but then...they got bad. I would lose control and feel like I was possessed before I realised my stomach was straining from food, because they \"weren't that bad before\". So just remember a binge is loss of control and habitual, it can't be determined by the food itself.",
      "created_utc": 1641459965.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hrj9lyk",
      "author": "Asleep-Cycle3788",
      "body": "Totally. Im 4'11 and I struggle to lose weight even on a 1200 cal diet. My medication makes me gain and retain weight VERY easily so I'm always conscious of what I eat. A \"binge\" to me personally is an extra serving at dinner, dessert, and maybe an extra snack in a day, all of which I purge. There are rare nights where I full on gorge myself at 2 am and eat everything in sight until I feel sick. These are more true \"binges\" but I totally understand what you mean. It's a nasty habit of categorizing every extra bite of food over my calorie limit as \"binging\" And I think this extreme attitude is what led to me purging. Super frustrating. I wish you the best!",
      "created_utc": 1641498973.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrjl44m",
      "author": "livingiseasy4",
      "body": "it’s the opposite for me lol. I think I’m just overeating and think that I’m overrating. I then realize that I actually ate a couple pounds of food.",
      "created_utc": 1641503212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrkdzk3",
      "author": "Trick-Pin1883",
      "body": "Story of my life. It’s so hard bc I can’t tell what is truly a “normal” amount of food, what is overeating and what is binging. Like it’s hard for me to define which is which with food quantities. So I end up feeling like almost everything is a binge. :( anyone have any tips on how to deal with this ?",
      "created_utc": 1641514102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrl59fx",
      "author": "hallowmean",
      "body": "Does overeating a little end up triggering a binge because you’ve already framed it as one? Bc same, black and white thinking gang 😎",
      "created_utc": 1641525420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrm147r",
      "author": "None",
      "body": "Can’t relate :(",
      "created_utc": 1641542727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrh5yrp",
      "author": "Aware--28",
      "body": "I used to think like this then I just started counting the Calories of the fast food and almost every meal is well under that if you don’t get a calorie drink \nIt’s become my fav omad bc It’s easy and tastes good and I’ve lost",
      "created_utc": 1641466322.0,
      "score": 5,
      "context": [
        {
          "id": "hrh48pg",
          "author": "JunjinNito",
          "body": "absolutely,, i usually have omad and i try to keep it under 1500 but sometimes i get fast food and even though technically it’s not like-an egregious amount of cals it feels like it and i feel bad. i don’t know it feels like i’m a crazy animal that hasn’t eaten for days and i call it a binge bc it feels like it. i completely get what u mean",
          "created_utc": 1641465011.0
        }
      ]
    },
    {
      "id": "hsa2ubx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641945415.0,
      "score": 3,
      "context": [
        {
          "id": "hrjhwe9",
          "author": "Loctusofsmorgasbord",
          "body": "YES!  My husband does this..  he never eats (one big meal at 7pm, lives off cigarettes and coffee) so me having healthy habits makes me look like a glutton. He’s the center of the universe and always right and expects everyone to have the same habits as him. 🙄. And he can’t keep his opinions to himself. \nEvery time I eat he says something. I refuse to eat in front of him. I’ve gone back to starving myself and restricting after I have been a healthy weight for almost a year. \nI’m leaving his ass. \nIt’s extremely triggering and leaves me feeling ashamed and disgusting.",
          "created_utc": 1641502029.0
        }
      ]
    },
    {
      "id": "hsa3wey",
      "author": "Loctusofsmorgasbord",
      "body": "Thank you. He got more and more obsessed with my habits and trying to ‘fix’ me. It’s a living nightmare. Stress makes it worse.  My last partner knew by the second date and never said anything. He figured I knew what I was doing/dealing with, it’s not out of control, I’m not trying to get thinner and thinner, and that I’m a smart woman who can handle herself. He said he didn’t wanna interject because he doesn’t know anything about it and it would be rude. I did great during that time period. Was going to the gym, built some shape..  now I’m a frazzled wreck and I’m ashamed of myself.",
      "created_utc": 1641945863.0,
      "score": 2,
      "context": [
        {
          "id": "hrjhwe9",
          "author": "Loctusofsmorgasbord",
          "body": "YES!  My husband does this..  he never eats (one big meal at 7pm, lives off cigarettes and coffee) so me having healthy habits makes me look like a glutton. He’s the center of the universe and always right and expects everyone to have the same habits as him. 🙄. And he can’t keep his opinions to himself. \nEvery time I eat he says something. I refuse to eat in front of him. I’ve gone back to starving myself and restricting after I have been a healthy weight for almost a year. \nI’m leaving his ass. \nIt’s extremely triggering and leaves me feeling ashamed and disgusting.",
          "created_utc": 1641502029.0
        },
        {
          "id": "hsa2ubx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641945415.0
        }
      ]
    }
  ]
}