{
  "id": "s7vibl",
  "subreddit": "bulimia",
  "author": "Many-Effective-14",
  "created_utc": 1642613605.0,
  "title": "Waste",
  "selftext": "Does anyone else feel hella guilty for spending so much money on food and then purging it all. I feel like it just adds another level of guilt to an already horrible process...",
  "url": "https://www.reddit.com/r/bulimia/comments/s7vibl/waste/",
  "score": 87,
  "num_comments": 12,
  "comments": [
    {
      "id": "htdi1op",
      "author": "Professional-Goat-2",
      "body": "Yes but then I remember that my parents are smoking and that others buy 1000 € wines and stuff so I feel better",
      "created_utc": 1642628829.0,
      "score": 12,
      "context": []
    },
    {
      "id": "htf08rw",
      "author": "icewater-nolemon",
      "body": "Yes. One thing that’s helped in my recovery journey is documenting how much money I save and what I did with the money. It really puts it in prospective. Money I would have spent in a month b/ping in the worst part of my eating disorder was enough to pay for 2 months worth of gas for my car.",
      "created_utc": 1642652250.0,
      "score": 6,
      "context": []
    },
    {
      "id": "htdqoaf",
      "author": "None",
      "body": "Fucking hell yes. Especially with all the packaging and everything that goes into making the food",
      "created_utc": 1642632168.0,
      "score": 4,
      "context": []
    },
    {
      "id": "htd8exj",
      "author": "Musicknowsnobounds",
      "body": "Yes my dude. The guilt is real",
      "created_utc": 1642625348.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htdts57",
      "author": "RatEnabler",
      "body": "Yeah. I have a budget of spending no more than £15 a day on food but I often go over and feel completely at mercy of the thrill of buying food. I justify this by telling myself plenty of people spend this amount of cigarettes or weed daily and at least I'm not addicted to cocaine, I would be so broke lol.\nWhen I buy binge foods I usually get all the discounted crap for like 50p that is going to be thrown away. It's extremely tempting to order £100 of Uber eats though, but I've never crossed that line. I feel and behave like an actual addict.",
      "created_utc": 1642633424.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hte4spt",
      "author": "Freeflover",
      "body": "Yeah, BUT - people also spend a lot of money on drugs, alcohol, clothes, and other \"addictions\". This is YOUR addiction, you can't help it and it isn't your fault. This is what it takes right now to keep you alive, and someday you don't need it - when you are ready for it.",
      "created_utc": 1642638122.0,
      "score": 3,
      "context": []
    },
    {
      "id": "htg00vk",
      "author": "mizerybiscuits",
      "body": "So much money on takeout that just gets purged. I spend more money on food than I do anything else and most of it goes to waste I fucking hate it",
      "created_utc": 1642676128.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htgxn1x",
      "author": "ihatemyselflolxox",
      "body": "i feel guilt but not all that much like i think of it like this, i would have eaten that food anyways it just came physically out of my body sooner rather then later…",
      "created_utc": 1642693494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htgzz74",
      "author": "acoh97",
      "body": "I've financially fucked myself over. I've drained my savings. If I were to be fired, I couldn't even cover rent for a month. My credit card debt is now as high as one of my student loans. I wish I had blown my money instead on hard drugs and booze as that is way less embarrassing.",
      "created_utc": 1642694376.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htivjpy",
      "author": "rileyyj001",
      "body": "In addition to the financial waste, I feel like the amount of physical garbage that comes with binge eating is rarely talked about. The amount of cardboard, plastic, even metal that must be tossed can be astronomical. \n\nFor example: say a binge you have frozen pizza, ice cream, and a package of cookies. You now have the cardboard pizza box, the plastic the pizza was wrapped in, the cardboard tray the pizza sits on inside of the plastic, the ice cream container and its plastic top, the plastic wrap you peel off the top of the ice cream, the plastic cover for the cookies and the tray the cookies sit in. Just with those three foods alone you now have to discard all of that waste. It piles up *so* quickly! \n\nI’m certainly no eco activist, but when I was living with my parents while struggling with bingeing, I had to hide SO much fucking trash and find ways to get rid of it. It was a job in and of itself.",
      "created_utc": 1642720583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "htdu2my",
      "author": "RatEnabler",
      "body": "I do this. It makes me feel a little better. Food isn't bank breaking, there are much more financially draining bad habits",
      "created_utc": 1642633543.0,
      "score": 4,
      "context": [
        {
          "id": "htdi1op",
          "author": "Professional-Goat-2",
          "body": "Yes but then I remember that my parents are smoking and that others buy 1000 € wines and stuff so I feel better",
          "created_utc": 1642628829.0
        }
      ]
    },
    {
      "id": "htffgl0",
      "author": "Professional-Goat-2",
      "body": "Yeah you get it , there are greater reasons for recovery than the money we spend",
      "created_utc": 1642660499.0,
      "score": 1,
      "context": [
        {
          "id": "htdi1op",
          "author": "Professional-Goat-2",
          "body": "Yes but then I remember that my parents are smoking and that others buy 1000 € wines and stuff so I feel better",
          "created_utc": 1642628829.0
        },
        {
          "id": "htdu2my",
          "author": "RatEnabler",
          "body": "I do this. It makes me feel a little better. Food isn't bank breaking, there are much more financially draining bad habits",
          "created_utc": 1642633543.0
        }
      ]
    }
  ]
}