{
  "id": "skpcbh",
  "subreddit": "bulimia",
  "author": "addblocc",
  "created_utc": 1644011309.0,
  "title": "a trick i use to avoid binging",
  "selftext": "i know a lot of people probably know this trick, same with my trick to avoid purging, but i thought i'd share for those who haven't heard of it before, as it's been such a huge help in preventing me from binging. \n\nessentially, instead of telling yourself \"i won't binge\", you tell yourself \"i won't binge YET/i won't binge right now.\" sometimes i'll set a 15 minute timer. i don't know why, but \"i absolutely won't binge\" puts me in more of a panic/frenzy, while \"i won't binge right this second, i'll wait to see how i feel in 15 minutes/30 minutes/an hour etc\" helps to calm me down, until the urge to binge passes. \n\ni know this is also a coping skill that therapists teach to people who struggle with self harm/suicidal thoughts. \n\ni have a long way to go with repairing my relationship to food/body image, but i'm hoping that having these small tricks to disrupt the disordered behaviors is a good first step to recovery (:",
  "url": "https://www.reddit.com/r/bulimia/comments/skpcbh/a_trick_i_use_to_avoid_binging/",
  "score": 95,
  "num_comments": 6,
  "comments": [
    {
      "id": "hvna3pc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1644026936.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hvmue5q",
      "author": "unclegoddess",
      "body": "thanks for sharing! <3",
      "created_utc": 1644019805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hvnrlf6",
      "author": "None",
      "body": "This is fantastic!!!! I’m going to try.",
      "created_utc": 1644035410.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hvorum2",
      "author": "rileyyj001",
      "body": "This was a common technique used in the IOP I went to. They called them “Delay Goals,” and while it worked for some, it was definitely a way for others to sneakily use it as a restriction tactic. Be careful how you look at using this method.",
      "created_utc": 1644061085.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hvq3ol3",
      "author": "None",
      "body": "Thank you so much for sharing this!",
      "created_utc": 1644084174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hvo0zxm",
      "author": "Trip_the_light3020",
      "body": "If you've had the urge for days without engaging in it that's incredible strength. That is HUGE and deserving of some credit\n\n\nItll eventually become less intense. Hang in there.",
      "created_utc": 1644040813.0,
      "score": 6,
      "context": [
        {
          "id": "hvna3pc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1644026936.0
        }
      ]
    },
    {
      "id": "hvncb03",
      "author": "addblocc",
      "body": "that's ok, you will find something that works for you eventually.  i still am not perfect, as this method only prevents unplanned binges for me. i am currently in a planned binge -> restrict cycle. but baby steps, right?",
      "created_utc": 1644027938.0,
      "score": 2,
      "context": [
        {
          "id": "hvna3pc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1644026936.0
        }
      ]
    }
  ]
}