{
  "id": "t65q9c",
  "subreddit": "bulimia",
  "author": "addblocc",
  "created_utc": 1646352902.0,
  "title": "how many of you had diet obsessed parents/parents with EDs?",
  "selftext": "i was thinking about how much my mom's food rules she learned from years and years of fad diets and insecurities about her own weight played a role in me developing an ED. i practically hear her voice yelling at me in my head any time i'm about to eat a carb. i've had \"nothing tastes as good as skinny feels\" drilled into my head. \n\nshe also had a purging disorder in the past. she has said things like how she never had the \"nerves of steel\" to be anorexic. she scolded me heavily when i opened up to her about b/p, because to her that's a shameful ED, vs anorexia which she seems to find impressive in some sick way. she encouraged both me and my brother to continue restricting when we were losing a ton of weight super fast, because i guess neither of us ever got skinny enough for it to be concerning to her. \n\nanyway, how did your parents impact your ED?",
  "url": "https://www.reddit.com/r/bulimia/comments/t65q9c/how_many_of_you_had_diet_obsessed_parentsparents/",
  "score": 98,
  "num_comments": 31,
  "comments": [
    {
      "id": "hz9656i",
      "author": "pettybat",
      "body": "Yup. Ever since I was like 8 years old my mom would get some sick satisfaction from watching me struggle with diets and still fail to be as skinny as her. After I lost weight, she suddenly became a fat acceptance ally and would do everything in her power to make me gain. I don’t blame her for having an illness, but that’s not an excuse for contributing to mine.",
      "created_utc": 1646353648.0,
      "score": 28,
      "context": []
    },
    {
      "id": "hz9952m",
      "author": "beepbopboopbop69",
      "body": "oh, yes...from the age of 8+, my mother would take me to Weight Watchers/weight loss stuff, explaining how \"\\[I'd\\] be pretty if I lost weight\"...she really wanted me to be a child model because she always wanted to as a child, but she grew up without much money.\n\nLong story, but basically my mother lived vicariously through me & was upset I didn't meet her demands of being underweight (\"since you're short, you need to be below normal weight\"), socially popular, and extremely extroverted. She hoped her harsh words would inspire me, but they instead lowered my self-esteem.\n\nMy father had a strong dislike of larger people, and he did not like me being a \"chubby blonde\" because it apparently makes the family (aka him) look bad. \n\nHonestly, I think high expectations to meet physical standards and societal influences create a perfect storm for a lot of ED sufferers, both male and female.",
      "created_utc": 1646354995.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hz9v82l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1646365741.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hz97pd4",
      "author": "cburnard",
      "body": "yep, my mom had BED and was **extremely** obese. i still remember her telling me \"i eat because it's the only thing your grandmother can't control.\" \n\ni'll never forget that, and i do think the whole thing contributed to my own issues with food intake. genetics and modeling.",
      "created_utc": 1646354344.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hz9xkba",
      "author": "shanaina",
      "body": "That part about anorexia being the “good disorder” really hit home. When I didn’t have an appetite and almost became underweight I felt on top of the world. People would always ask if I was okay or if I had a disease. I really felt like I was fine. Then I started binging and purging and gaining the weight back and it’s like no one thought to ask if I was okay. I had bloody knuckles on my dominant hand and no one batted an eye. I know it’s not others responsibility to know what’s going on but it feels like Ed’s are romanticized when it’s about a delicate person. I even went to a dr bc I lost my period for six months, told him I had recently lost and gained weight, he pointed out my bloody knuckles and just told me to take of my clothes and he would be back in the room. I was 15. He was disappointed when he came back and I still had my clothes on. I just wanted someone to ask if I was okay or notice like they did when I was almost underweight. On the car ride home my dad told me I need to get over “that shit” - having a male doctor unnecessarily look at me undressed without giving any explanation or warning. Just “take off your clothes”",
      "created_utc": 1646366909.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hz9jt2r",
      "author": "Mysterious_School_98",
      "body": "Omg it me. I can’t even verbalize the impact it’s had on me because I think we all get it. I truly believe that I 200% feel unlovable because of how my mom made me feel, so I don’t put myself out there. It’s sad but it’s completely ruined dating and a lot of other things for me. I’m 27F and never been in a relationship. Even at my skinniest (120 lbs and 5’1), I felt sick looking at the ‘fat’ on my body and never ever gained any confidence to pursue anyone I was interested in or build something with the people interested in me, thinking they can do way better. And I’ve seen how this lack of confidence has penetrated all aspects of my life, especially professionally. Sigh, je feel my friend and I’m sorry you’ve gone through something similar <3",
      "created_utc": 1646359989.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hz9bwzg",
      "author": "None",
      "body": "My mom always had terrible body image and I had a binge eating problem stemming from being bullied. Those worlds collided and now I’m dying to be skinny and I use food for comfort. Lovely.\n\nIt’s weird. She’s always commented about how she wishes she had my body and she’d always tell me that I’ve gained weight and it looks bad. She would involve me on whatever crash diets she went on even though I was a kid. A fat kid, yes. But still a kid with different nutritional needs than an adult. No wonder I don’t have a normal relationship with food.",
      "created_utc": 1646356347.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hz9vly1",
      "author": "lostinth3Abyss",
      "body": "I don’t think my mom has an ED but she won’t stop talking about diet/food stuff and she knows I don’t like hearing about but every time I see her she’s always has to say something about her diet or that she’s lost weight 🙃",
      "created_utc": 1646365929.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hz9wer5",
      "author": "shanaina",
      "body": "My mom was constantly dieting and telling me what clothes I should wear to look thinner. My sister was naturally thin and when we would go to my aunts house she was showered with compliments about how thin she was and how she could be a model. I felt invisible. I didn’t feel like a person until I started losing weight and getting good grades and my dad started to actually notice me. That just led to me becoming a failing perfectionist lol. My mom and I talk about how much that stuff affected me now. It still hurts to think about. I feel like I lost all of my high school years because of bulimia and trying to be perfect so my dad would love me. Sorry, just felt like venting.\n\nETA: my mom was also bulimic when she was younger. When I told her what I was going through and confessed that that’s why my knuckles were so scarred she kind of laughed and bragged about not having to use her fingers to make herself throw up. Idk I know she was trying to lighten up the mood",
      "created_utc": 1646366326.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hzatle1",
      "author": "The_Conscious_Saffa",
      "body": "Yep, this is all my mother.... My earliest memories were of her saying don't forget this or that will make you fat....",
      "created_utc": 1646388827.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hz96lbb",
      "author": "ObviousInspector9223",
      "body": "I’m pretty sure my father struggles with body image I’ve heard him purge in the bathroom so many times so I think that enabled me to do the same thinking it’s not so bad if my father does it but it’s so destructive",
      "created_utc": 1646353848.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hz9y10v",
      "author": "johnnydeppisdeaf",
      "body": "When I was 13 my mom owned a beauty salon and had a weightloss consultant and made a special appointment for me to get a weightless consultation and I went home with diet pills that day. 4 years later I fainted in front of her and hit my face on a table from restricting and she got mad at me for inconveniencing her day. Maybe 5 years ago I tried telling her about my ED and she said \"you're not very good at it I guess\"....\n\nShe always had these sayings \"pizza hut equals pizza butt\" or \"donuts equal dough butts\" and I didn't realize how shitty those sayings were until I said them to a group of friends who all said wtf",
      "created_utc": 1646367144.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hzap1yi",
      "author": "Amandakay95",
      "body": "My mom use to compare her rib cage to mine :)",
      "created_utc": 1646385048.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hza80ow",
      "author": "Negative_Ad_971",
      "body": "My mom has the absolute worst impact on my body image and ED and once she was driving my best friend to her house and my best friend tried to subtly tell my mom to be careful around me when it comes to talking about weight and food because it can be sensible. Apparently my mom totally agreed and told my friend that she was super body positive and encouraging about food or whatever. None of them told me about that talk until a few weeks ago when I texted my friends crying because my mom made me feel so bad everytime I ate and it was driving me crazy and my friend told me it was just a misunderstanding \"because my mom was totally the contrary of that\"",
      "created_utc": 1646372714.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hzavv9y",
      "author": "ResilientRunner",
      "body": "My mother was in pseudo recovery from\nAnorexia for much of my childhood.",
      "created_utc": 1646390715.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hzb4wn0",
      "author": "JellyCharacter1653",
      "body": "For me it was my grandparents",
      "created_utc": 1646397122.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hzce0b8",
      "author": "ButtonyCakewalk",
      "body": "My mom has never not been diet obsessed, and has never been quiet about it. Some of my earliest memories are of her showing me her Atkins diet shit (mostly so I wouldn't eat it, i guess), Nutrisystem, WW, all that stuff. She used to buy diet pills like they were candy. \n\nMy mom would always, and still does, comment at stores and public events, \"Who's fatter, me or her?\" When she sees an obese or plus size woman. She used to say, if it was a larger man, \"[ButtonyCakewalk], that's your husband.\" And she still calls herself Jaba the Hutt all of the time, but also when we were kids. Now my brother (who is in his 30s) talks disparagingly about her weight to me (i tell him not to) like she's an awful person on that factor alone.\n\nShe thought I was chubby from like ages 8-12 and would constantly say I needed to lose weight, but she also kept our home stocked with soda and never cooked for us, we just ate frozen meals or fast food, and never with any structure. Even if she brought us Taco Bell or KFC, she'd give my brother and I the food then go to her room to eat her portion alone, eventually my brother started doing that too. I think having no quality time around food with my family made me feel a lot of anxiety around eating with groups of people. I stopped eating lunch at school (and at all) when I hit puberty, I'd wait till i got home and could have some fatty or sugary foods that they wouldn't serve at school.\n\nWhen I was 8, I started stealing her diet pills and taking them because she wouldn't stop talking about my weight. Spoiler alert, it did not change anything. Most of the times in my life where I've lost a lot of weight, it's been due to a serious illness. And everyone, but especially her, compliments me on my weight loss. My mom virtually ignored my brother and I for our whole childhoods, partially because she was a single, working mom, but she sent us to our grandparents' house most weekends and spent her evenings with friends or locked in her room. When I started getting thinner in high school, she suddenly was very interested in spending time with me, but never my brother. I know she lives vicariously through me. And that's not intuition, she used to tell me that constantly.\n\n I started purging when I was 13, I'll be 29 in four months and this is a continual and constant, painful struggle. I'm in therapy specific to bulimia, but I am still constantly gaslighting myself on so many different levels. I've gained weight because i purge so little now and still binge every now and then, more often than purging. My mom is so disappointed. I'm scared to visit home because I'm afraid of her comments, I decided to just tell her I went up a few dress sizes recently and she lectured me, telling me that my partner would be upset (nope nope nope, he is incredibly body positive) and that i should wait until i have kids (nope) to gain weight. She knows I have bulimia and am in treatment.\n\n\n\n\nAlso, some fuck is downvoting everyone's stories. I came here and the latest comments had 1 vote and I upvoted them all, and now all of them have 1 and some of them have 0. If you're gonna come on an eating disorder sub and be petty, fucking use your words so we can judge you, too, coward.",
      "created_utc": 1646416762.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hzbi9jy",
      "author": "Charming_Pipe6370",
      "body": "My parents are doctors they use to shame me for my weight until I got ana and lost 60 pounds in 2(/1/2) months and I just got bulimia after that",
      "created_utc": 1646403909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzbp74w",
      "author": "elpintor91",
      "body": "I grew up in the age of slimfast, tai bo, dr Phil books, biggest loser and fat free everything. My mom was big but was always try fad things like I remember she ordered that ab lounge cause of an infomercial. But she didn’t lose any weight that way. My sisters were all older than me and did slim fast diets and tai bo and a few of them were taking weight loss pills and doing weight loss competitions amongst themselves. I was around 8-11 during all this so a very crucial time in my development. By the time I was 12-13 I felt disgusting and by 13 I started purging and at 5”4 got down to 94 pounds and loved when everyone called me skinny. Now I’m 30 and fighting the urge weekly to just say NO",
      "created_utc": 1646406910.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzc1wog",
      "author": "Honey-Nut-Queerio",
      "body": "My mom was actually really good in terms of letting my older sibling and I eat when we were hungry, telling us to listen to our bodies, and letting us know that all bodies are built differently. \n\nMy stepmom, on the other hand, made a lot of desperate attempts to lose weight and hoisted a lot of those expectations onto me because I was always the \"chubby kid.\" She would say things like,\"Your stomach is the size of your fist, so that's how much you should eat.\" Each diet she did ended up crashing and burning, but for awhile she seemed so desperate to lose weight. I don't know I'd she struggles as much with this anymore, but she definitely still shows off disordered habits.",
      "created_utc": 1646412004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzcs5md",
      "author": "callme_trashii",
      "body": "Got bullied in elementary school due to my weight. I used to be the chubby kid. Told my mom. She recommended to me that I should switch to eating an apple a day for half a year and the bullying will stop 🤡",
      "created_utc": 1646422262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzboy9z",
      "author": "PiperWyatt",
      "body": "I am afraid I will become this. I have been overweight my entire life, have been bullied a lot. I am on and off diets. I have somewhat accepted that I will be fat until i die. But if I ever become a mom, and I really want to, I don’t want my child to be obese and I will do everything in my power for my kids to not be fat. I won’t say things like don’t eat that but I will restrict candy and sugar drinks (even though I am heavily addicted to Coca Cola). I know life is easier skinny. I will never make my kids feel bad but I will feel bad myself if I would fail. (I would not love them less! I would feel bad for them having a harder life. )",
      "created_utc": 1646406805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzcrgm4",
      "author": "floralwhoral",
      "body": "My mum is extremely morbidly obese and when we were kids she fed my sister and I carbs on carbs with nothing else, we were both very chubby children who then developed eating disorders when we got to high school. I can’t comment on my sister but I definitely know that a big part of my eating disorder is being terrified of ending up like mum.",
      "created_utc": 1646421991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hzcw6pa",
      "author": "annaeatk",
      "body": "My mom never said anything but my grandma is very health conscious and always dieting. My mom also gets really severe depression and just doesn’t eat when she’s depressed like that, hasn’t been in almost 10 years thankfully though. She used to be really skinny because of that too which made it painfully obvious that I wasn’t.",
      "created_utc": 1646423794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hzijs40",
      "author": "None",
      "body": "Yes my mum has always been on a diet told me to lose weight. Now she's lost a lot and is complaining about her loose skin, she just never happy with herself and projects it on to me",
      "created_utc": 1646525466.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idqrbal",
      "author": "Agreeable_Ad6417",
      "body": "One of my main reasons for trying to develop a healthy relationship with food is for my future kids. I never want them to experience what i did. I never want them to see food as criminal or “bad”. I want them to live life. My father & I bond over losing weight & eating healthy. He was insecure & obsessed. It affected me greatly, and most likely contributed to my issues now.",
      "created_utc": 1656198663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hz9y96w",
      "author": "shanaina",
      "body": "If you’re open with your daughter about it then it probably helps her knowing she has someone to talk to about it that understands. My mom was also bulimic when she was younger but she was not very empathetic towards me when I told her I was struggling. I remember what I wanted most was for someone to listen to me without judging- which is hard when you’re in high school and no one really understands and thinks you’re weird when you tell them. That is the most alone I’ve ever felt in my life. I hope you two were able to lend the other a shoulder to cry on. Having someone listen without judgement makes a bug difference",
      "created_utc": 1646367260.0,
      "score": 6,
      "context": [
        {
          "id": "hz9v82l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1646365741.0
        }
      ]
    },
    {
      "id": "hzik6j8",
      "author": "None",
      "body": "That's awful! That doctor is a prick!",
      "created_utc": 1646525657.0,
      "score": 2,
      "context": [
        {
          "id": "hz9xkba",
          "author": "shanaina",
          "body": "That part about anorexia being the “good disorder” really hit home. When I didn’t have an appetite and almost became underweight I felt on top of the world. People would always ask if I was okay or if I had a disease. I really felt like I was fine. Then I started binging and purging and gaining the weight back and it’s like no one thought to ask if I was okay. I had bloody knuckles on my dominant hand and no one batted an eye. I know it’s not others responsibility to know what’s going on but it feels like Ed’s are romanticized when it’s about a delicate person. I even went to a dr bc I lost my period for six months, told him I had recently lost and gained weight, he pointed out my bloody knuckles and just told me to take of my clothes and he would be back in the room. I was 15. He was disappointed when he came back and I still had my clothes on. I just wanted someone to ask if I was okay or notice like they did when I was almost underweight. On the car ride home my dad told me I need to get over “that shit” - having a male doctor unnecessarily look at me undressed without giving any explanation or warning. Just “take off your clothes”",
          "created_utc": 1646366909.0
        }
      ]
    },
    {
      "id": "hzb1tsp",
      "author": "SuperSonicSP",
      "body": "omg that is literally petrifying, i cannot imagine the horror of hearing a parent purging, im so sorry :(",
      "created_utc": 1646395172.0,
      "score": 3,
      "context": [
        {
          "id": "hz96lbb",
          "author": "ObviousInspector9223",
          "body": "I’m pretty sure my father struggles with body image I’ve heard him purge in the bathroom so many times so I think that enabled me to do the same thinking it’s not so bad if my father does it but it’s so destructive",
          "created_utc": 1646353848.0
        }
      ]
    },
    {
      "id": "hzcabr8",
      "author": "ButtonyCakewalk",
      "body": "I'll never forget a friend of mine in elementary and middle school's stepmother. She made her stepdaughter (that was my friend) measure out all of her food meticulously, but the younger sister (also a stepdaughter) didn't have to. My friend had to go to the doctor because she was underweight when we were in the 6th grade. Friend told me that her dad and stepmom were with her. Doctor says she needs to gain weight, gives her parents tips on getting her more food healthily, and then her stepmom \"jokes,\" \"we'll make sure you can lose the weight after!\" My friend was horrified. I don't think it was a joke.",
      "created_utc": 1646415317.0,
      "score": 2,
      "context": [
        {
          "id": "hzc1wog",
          "author": "Honey-Nut-Queerio",
          "body": "My mom was actually really good in terms of letting my older sibling and I eat when we were hungry, telling us to listen to our bodies, and letting us know that all bodies are built differently. \n\nMy stepmom, on the other hand, made a lot of desperate attempts to lose weight and hoisted a lot of those expectations onto me because I was always the \"chubby kid.\" She would say things like,\"Your stomach is the size of your fist, so that's how much you should eat.\" Each diet she did ended up crashing and burning, but for awhile she seemed so desperate to lose weight. I don't know I'd she struggles as much with this anymore, but she definitely still shows off disordered habits.",
          "created_utc": 1646412004.0
        }
      ]
    },
    {
      "id": "hzcyqf2",
      "author": "addblocc",
      "body": "i am so sorry ): this hits close to home, as when my brother was restricting, he was eating a couple apples per day, and went from chubby to a low weight for his height. my mom told me (still chubby at the time) \"you should do what your brother is doing! he only eats apples and he's lost so much weight!\"",
      "created_utc": 1646424775.0,
      "score": 1,
      "context": [
        {
          "id": "hzcs5md",
          "author": "callme_trashii",
          "body": "Got bullied in elementary school due to my weight. I used to be the chubby kid. Told my mom. She recommended to me that I should switch to eating an apple a day for half a year and the bullying will stop 🤡",
          "created_utc": 1646422262.0
        }
      ]
    },
    {
      "id": "hzdb4an",
      "author": "ObviousInspector9223",
      "body": "I used to cry because I know he has his own issues he doesn’t open up about but It’s okay I don’t hear it anymore I’m not around as much I try to get out the house by working out, going to work, school or being with my bf",
      "created_utc": 1646429504.0,
      "score": 1,
      "context": [
        {
          "id": "hz96lbb",
          "author": "ObviousInspector9223",
          "body": "I’m pretty sure my father struggles with body image I’ve heard him purge in the bathroom so many times so I think that enabled me to do the same thinking it’s not so bad if my father does it but it’s so destructive",
          "created_utc": 1646353848.0
        },
        {
          "id": "hzb1tsp",
          "author": "SuperSonicSP",
          "body": "omg that is literally petrifying, i cannot imagine the horror of hearing a parent purging, im so sorry :(",
          "created_utc": 1646395172.0
        }
      ]
    }
  ]
}