{
  "id": "uht1yr",
  "subreddit": "bulimia",
  "author": "Difficult-Skill-9232",
  "created_utc": 1651620552.0,
  "title": "Bf caught me purging I want to die",
  "selftext": "I’m so embarrassed I tried to lie but he wasn’t buying it so I tried to give him 200$ and beg for him to pretend it didn’t happen and now I think he’s mad at me but also says he’s very sad for me and doesn’t want me to hurt myself. I don’t know why I try to gave him money  and cry and lie I’m. Not a liar but bulimia makes me do all these things I don’t even want to do",
  "url": "https://www.reddit.com/r/bulimia/comments/uht1yr/bf_caught_me_purging_i_want_to_die/",
  "score": 70,
  "num_comments": 8,
  "comments": [
    {
      "id": "i78v9za",
      "author": "Jessiejz2",
      "body": "If your boyfriend truly loves you he wont judge you so dont feel embarrassed, try to talk to him about how it all started and the emotions the disorder causes you to have so he can have an understanding of what you are going through & if you feel like purging you can tell your boyfriend and he can distract you from doing it. Having bulimia myself i know its hard to stop but it is possible and if your boyfriend really cares about you he will help you get through recovery, sending you lots of positive energy ❤️",
      "created_utc": 1651633303.0,
      "score": 29,
      "context": []
    },
    {
      "id": "i78vx9a",
      "author": "icanhasnoodlez",
      "body": "This is your wake up call. If you want to fix this, you must get professional help now. Don't wait. Your life depends on it.",
      "created_utc": 1651633613.0,
      "score": 28,
      "context": []
    },
    {
      "id": "i7b6js5",
      "author": "Flowermoundd",
      "body": "I have been caught by my sister and her husband TWICE. even at work I got caught by my boss and his wife too. I literally wanted to die, couldn’t even look at their eyes. Even quit that job. thank god i’m 3 months clean and life hasn’t changed a lot but my health is definitely BETTER and I feel so different! purging is an addiction, it is very hard to quit but it IS possible. i know getting help is not for everyone but there a lot of resources online. facebook groups and youtube videos and tiktok people too. that’s how i started recovery. please let this situation stop you from doing it. it is very embarrassing. just like you said, it makes us people we are not. i’m here with you and understand you",
      "created_utc": 1651682039.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i78u8oz",
      "author": "None",
      "body": "It's gonna be fine. I understand completely, this is the one thing I hate people finding out. Sending love (:",
      "created_utc": 1651632805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i79l5hl",
      "author": "sonic2cool",
      "body": "oh no ): i’m so sorry. i don’t know what i would do in this situation… i think you should if you can try and talk to him about triggers and just more about ur ed. he should understand, sending love <3",
      "created_utc": 1651649665.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7a7uib",
      "author": "MobileMaleficent1009",
      "body": "I’m sorry this happened to you :(",
      "created_utc": 1651666975.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i78f5wk",
      "author": "ameliaakarp",
      "body": "Sending love. This must feel like hell right now but tomorrows a new day. If being around him makes u more uncomfortable start distancing yourself if you can’t interact w him knowing he knows this about you",
      "created_utc": 1651626071.0,
      "score": -18,
      "context": []
    },
    {
      "id": "i78mg0k",
      "author": "tafffiee",
      "body": "Strong disagree. I don’t think they should distance themselves from them just because it makes them uncomfortable. I know its easier said then done and it’s weird at first, but they’re bf knowing isn’t necessarily a bad thing and pushing him away may just contribute to issues. They should talk first before just cutting ties",
      "created_utc": 1651629286.0,
      "score": 26,
      "context": [
        {
          "id": "i78f5wk",
          "author": "ameliaakarp",
          "body": "Sending love. This must feel like hell right now but tomorrows a new day. If being around him makes u more uncomfortable start distancing yourself if you can’t interact w him knowing he knows this about you",
          "created_utc": 1651626071.0
        }
      ]
    }
  ]
}