{
  "id": "v6frsx",
  "subreddit": "bulimia",
  "author": "Cycler_",
  "created_utc": 1654555248.0,
  "title": "My boyfriend keeps asking me “did you go to the gym today”",
  "selftext": "Seriously fuck off. I’m in the middle of finals week. I don’t need to go everyday. \n\nI get it 🙄 you hate my body and want me to lose weight. BUT at least be subtle or understanding that it’s finals. STFU I can’t stand you. \n\nI’m on the verge of just breaking up with him.\n\nMy Ed mind also exaggerated every comment he makes but still. Don’t tell me what to do.",
  "url": "https://www.reddit.com/r/bulimia/comments/v6frsx/my_boyfriend_keeps_asking_me_did_you_go_to_the/",
  "score": 89,
  "num_comments": 17,
  "comments": [
    {
      "id": "ibfg9h6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1654559954.0,
      "score": 64,
      "context": []
    },
    {
      "id": "ibfoui7",
      "author": "dizziestbaby",
      "body": "go ahead and break up with him, he should except and love you as you are not for what he wants you to be",
      "created_utc": 1654564260.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ibg1185",
      "author": "sunshinesparkle95",
      "body": "No man should be commenting on your body ever unless it’s to tell you you’re amazing and perfect. Gooooooo!",
      "created_utc": 1654570509.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ibh8lf6",
      "author": "None",
      "body": "Get rid of him. Life is stressful enough without having a partner making things worse. You deserve much, much better. I don’t care if he’s doing it because he cares about you. You don’t need someone fueling your ed right now, or ever.",
      "created_utc": 1654603694.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ibf8e2g",
      "author": "None",
      "body": "Ooh. Girl, I feel you. \n\nIt is hard when you are stressed and it feels like he is harping on that issue. But recognize that you are stressed. Take that deep breath. Maybe he doesn’t hate you body, but it trying to be supportive.",
      "created_utc": 1654555986.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ibhcgwa",
      "author": "None",
      "body": "I know how you can lose 160+ lbs mid finals in just 30 seconds! Pick up the phone and dump his sorry ass.",
      "created_utc": 1654606003.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibg97za",
      "author": "None",
      "body": "Leave that asshole.  There are so many guys out there who would never pressure you into maintaining their ideal level of \"fitness\".  Your body and your routine is your business alone.",
      "created_utc": 1654575164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibhcrst",
      "author": "mandanic",
      "body": "He can go ahead and walk his ass out the door today. That’s not okay. Unless you’ve made it clear that going to the gym is a priority for you and you’re looking for accountability. Support is one thing, this sounds like another. My partner has told me I am beautiful when I was at my lowest weight and now still at my highest. Never treated me differently. That’s what you deserve! This would be sooo triggering to me.",
      "created_utc": 1654606173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibgb3r2",
      "author": "IndependentGrocery52",
      "body": "I mean idk exactly how ur guys relationship is but me and my girl be asking each other if we went to the gym cuz we like to push each other with our goals. Give each other space during ur finals week or be upfront wit him cuz bottling it up bouta drive u crazy and if he still don’t understand then now there’s the problem.",
      "created_utc": 1654576360.0,
      "score": -4,
      "context": []
    },
    {
      "id": "ibhiwyc",
      "author": "vampyr_lover",
      "body": "You may not want to hear this or maybe it sounds harsh, but your bf is acting like a piece of shit and not the kind of guy you or any other woman should tolerate. You can do and deserve so much better. There’s no chance of recovery or any kind of self improvement in any way really if this guy remains in your life. Don’t be afraid to start over.. I know it’s scary but being single doesn’t necessarily mean being alone and it’s better to be alone than with a partner who treats you like shit. And a new partner will enter your life sooner than you realize.. if you allow the space for it, the universe will send the right person your way.",
      "created_utc": 1654609419.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibhzot4",
      "author": "None",
      "body": "Do you both go to the gym together or something or is he just telling you that you should go to the gym? Also if he’s ur bf shouldn’t he know better than to say stuff that would upset you?",
      "created_utc": 1654617051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibjefhy",
      "author": "mizerybiscuits",
      "body": "No man that wants you to change your body is a man worth wasting your time over",
      "created_utc": 1654639356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ic0r632",
      "author": "None",
      "body": "if he’s not saying that in a sweet, encouraging way, and he’s saying it to try to get you to lose weight so you can be more attractive to him, he can fuck right off.",
      "created_utc": 1654984827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibfhq8f",
      "author": "Cycler_",
      "body": "Are you my sister cause I just talked to her about this and she said the same. Bruh.",
      "created_utc": 1654560683.0,
      "score": 24,
      "context": [
        {
          "id": "ibfg9h6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654559954.0
        }
      ]
    },
    {
      "id": "ibfhrxr",
      "author": "Cycler_",
      "body": "The fear of her knowing I’m in this subreddit lmaoo",
      "created_utc": 1654560706.0,
      "score": 11,
      "context": [
        {
          "id": "ibfg9h6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654559954.0
        }
      ]
    },
    {
      "id": "ibgbfu2",
      "author": "Cycler_",
      "body": "Yeah. It’s my ED brain that’s dramatizing it… but I can’t help but be angry. He’s made comments before about my body though and I told him that it makes me super upset. Since then the body comments have disappeared, but instead have been replaced with “did you go to the gym today” “what did you eat today” and I can’t help but think….\n\nOh and did I mention I have an eating disorder🤭🙃\n\nIt’s so hard to discern reality from my head… I feel like my suspicions aren’t too far off though… I appreciate the insight though. Thank you.",
      "created_utc": 1654576581.0,
      "score": 1,
      "context": [
        {
          "id": "ibgb3r2",
          "author": "IndependentGrocery52",
          "body": "I mean idk exactly how ur guys relationship is but me and my girl be asking each other if we went to the gym cuz we like to push each other with our goals. Give each other space during ur finals week or be upfront wit him cuz bottling it up bouta drive u crazy and if he still don’t understand then now there’s the problem.",
          "created_utc": 1654576360.0
        }
      ]
    },
    {
      "id": "ibg0ane",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1654570115.0,
      "score": 15,
      "context": [
        {
          "id": "ibfg9h6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654559954.0
        },
        {
          "id": "ibfhq8f",
          "author": "Cycler_",
          "body": "Are you my sister cause I just talked to her about this and she said the same. Bruh.",
          "created_utc": 1654560683.0
        }
      ]
    },
    {
      "id": "ibg0e6d",
      "author": "Cycler_",
      "body": "Oh lolz…😅",
      "created_utc": 1654570168.0,
      "score": 9,
      "context": [
        {
          "id": "ibfg9h6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654559954.0
        },
        {
          "id": "ibfhq8f",
          "author": "Cycler_",
          "body": "Are you my sister cause I just talked to her about this and she said the same. Bruh.",
          "created_utc": 1654560683.0
        },
        {
          "id": "ibg0ane",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654570115.0
        }
      ]
    }
  ]
}