{
  "id": "vgawvi",
  "subreddit": "bulimia",
  "author": "Trip_the_light3020",
  "created_utc": 1655692448.0,
  "title": "One of my worst fears is being in be a car accident post binge/pre-purge.",
  "selftext": "This crosses my mind a lot. Im so afraid of being stuck with thousands of calories whether from being injured and in the hospital and not being able to purge... or the time lapsing having to wait around for the police report/insurance swap with the other driver. \n\nAnd it's sad. \n\n\nOn the other hand, I fantasize about being hurt enough or sick with an illness to be in the hospital so I don't have the option of binging.  And then I can fully restrict and  let myself lose weight and feel my bones in new ways...\n\n\nIm not doing well tonight. In that space of post binge/pre binge where dread, shame, fear and disappointment is playing on repeat. Why havent I died already. This is an awful life.",
  "url": "https://www.reddit.com/r/bulimia/comments/vgawvi/one_of_my_worst_fears_is_being_in_be_a_car/",
  "score": 86,
  "num_comments": 11,
  "comments": [
    {
      "id": "id0nhcd",
      "author": "4giatorims",
      "body": "Hate to say this has crossed my mind too. The way I see it, I’d be so sick I’d end up losing more weight naturally anyway🤷‍♀️",
      "created_utc": 1655694100.0,
      "score": 21,
      "context": []
    },
    {
      "id": "id1f0bk",
      "author": "5star-my-notebook",
      "body": "I secretly hope I’ll get a horrible illness and waste away into nothing. Living with bulimia isn’t really living for me at this point and I can’t do it anymore. You’re not alone",
      "created_utc": 1655714676.0,
      "score": 12,
      "context": []
    },
    {
      "id": "id2me1w",
      "author": "ReasonableChipmunk79",
      "body": "This actually happened to me. When I was 17, I got into a head on car crash (I was front passenger) after a binge and the pressure from the crash/seatbelt combined with my stomach from being so dilated after binging caused it rupture. I had several surgeries and spent almost 2 months in the hospital. I'm extremely lucky that I didn't develop sepsis and my stomach and intestines still function normally. That was almost 10 years ago. I relapsed back into binging and purging behaviors later that year.  Thankfully, I sought ED treatment last year and I'm doing a little better. The car accident was the most horrific thing I've ever experienced but recovering from bulimia is still so hard:(",
      "created_utc": 1655741055.0,
      "score": 12,
      "context": []
    },
    {
      "id": "id0vjbr",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1655699030.0,
      "score": 11,
      "context": []
    },
    {
      "id": "id2br46",
      "author": "None",
      "body": "Same or like die mid purge surrounded by wrappers and throw up",
      "created_utc": 1655736356.0,
      "score": 7,
      "context": []
    },
    {
      "id": "id3ofyu",
      "author": "None",
      "body": "I haven’t binged and/or purged in nearly 3 years and I still have nightmares of being in situations where I’ve binged, am physically miserable, and cannot purge for whatever reason. Thankfully the dreams have become fewer and far between😅🤦🏻‍♀️",
      "created_utc": 1655757529.0,
      "score": 5,
      "context": []
    },
    {
      "id": "id3q0wn",
      "author": "chronaloid",
      "body": "I’m actually shocked this never crossed my mind during the height of my bulimic benders, but I did get a red light camera ticket while I was in a rush to get home and purge…jfc that’s insane now to think about, can’t believe the whole time I was like “I’m not that sick!1!1!” bro your $160 ticket would beg to differ 💀",
      "created_utc": 1655758217.0,
      "score": 3,
      "context": []
    },
    {
      "id": "id3iad4",
      "author": "leytourmaline",
      "body": "Omg this is me. Like I think about getting in near death experiences a lot post binge and…hell ill rather die then have to live with the aftermath of that.",
      "created_utc": 1655754853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "id263d2",
      "author": "some_gibberish42",
      "body": "Ugh this is my shameful day dream. My best friend had cancer and I was disgusted at the jealousy I felt seeing their weight loss. 😢",
      "created_utc": 1655733677.0,
      "score": 7,
      "context": [
        {
          "id": "id1f0bk",
          "author": "5star-my-notebook",
          "body": "I secretly hope I’ll get a horrible illness and waste away into nothing. Living with bulimia isn’t really living for me at this point and I can’t do it anymore. You’re not alone",
          "created_utc": 1655714676.0
        }
      ]
    },
    {
      "id": "id14ihb",
      "author": "Trip_the_light3020",
      "body": "Sick minds think alike 😔",
      "created_utc": 1655705541.0,
      "score": 6,
      "context": [
        {
          "id": "id0vjbr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655699030.0
        }
      ]
    },
    {
      "id": "id3iy71",
      "author": "OliveRyder",
      "body": "Oh shit I think about this a lot too",
      "created_utc": 1655755148.0,
      "score": 2,
      "context": [
        {
          "id": "id2br46",
          "author": "None",
          "body": "Same or like die mid purge surrounded by wrappers and throw up",
          "created_utc": 1655736356.0
        }
      ]
    }
  ]
}