{
  "id": "vh4mrs",
  "subreddit": "bulimia",
  "author": "SignificantAdagio11",
  "created_utc": 1655785395.0,
  "title": "Why is there never any space or treatment for bulimics ONLY",
  "selftext": "The number one thing that has stopped me from getting professional inpatient and outpatient treatment  for my eating disorder is that every single facility caters to anorexia first. It’s „more dangerous“ so why even quit being bulimic? It’s not going to kill me, so what’s the reason to even stop? I need to keep going until I look anorexic, or no one will even care. There is never any space online or in person for bulimia  and bulimia  treatment solely- it is always  coupled with anorexia. I have no interest sitting in group therapy with anorexics who’s literal  worst fear is my body. I seriously can’t stress enough how this makes it impossible to get help for bulimia.",
  "url": "https://www.reddit.com/r/bulimia/comments/vh4mrs/why_is_there_never_any_space_or_treatment_for/",
  "score": 106,
  "num_comments": 12,
  "comments": [
    {
      "id": "id5yq6s",
      "author": "rileyyj001",
      "body": "It still shocks me that more people don’t know that only 5-6% of the 30+ million people who are diagnosed with an ED, are *actually* underweight. (US statistic)",
      "created_utc": 1655806144.0,
      "score": 38,
      "context": []
    },
    {
      "id": "id6halq",
      "author": "AliveCommunity4627",
      "body": "I agree, it’s so hard to listen to the girls there talk about how they never eat and how easy it is to starve themselves while I’m so hungry all the time and dream about eating and throwing up. \nI’m just a little bit under weight and not considered as sick as them so the treatment they gave me wasn’t affective… I felt awful \nI truly believe bulimia is much worst physical than anorexia even tho I shouldn’t compare. Teeth, heart, mental pain which is unbelievable and the way people react when they hear you starve yourself vs purge. So fucking depressing.",
      "created_utc": 1655818164.0,
      "score": 34,
      "context": []
    },
    {
      "id": "id5j6nk",
      "author": "bonusbobcat",
      "body": "Or the other thing that ps me off is when I've been at a lower weight all the treatment people talk about how I must be restricting - I'm doing the opposite to restricting lol",
      "created_utc": 1655792783.0,
      "score": 25,
      "context": []
    },
    {
      "id": "id6i1ki",
      "author": "None",
      "body": "This was partly my experience being in residential treatment (laureate in OK), but I realized about halfway through that I was gonna have to take it upon myself to change the narrative or I was gonna return home still sick. Like every single group was focused on weight restoration, restriction, and fears around that but I wasn’t restoring weight so I finally just bit the bullet and starting talking about binging/purging in groups. Some peers thanked me for talking about it bc they never talked about it in tx bc of the silence, some didn’t know how to respond, and some people stuck in their Ed’s looked down on me for not having anorexia- BUT, I got the help I needed and was able to recover plus get rid of some of the shame of having the “lesser” disorder🫠🫠🫠\nBUT, I DEFINITELY get your frustration and it’s a real problem, but rarely recognized bc the whole treatment world is hyper fixated on restriction.",
      "created_utc": 1655818537.0,
      "score": 10,
      "context": []
    },
    {
      "id": "id6voor",
      "author": "None",
      "body": "Same with BED and OSFED. We get treated like we are jus pathetic and can't get our shit together or are making it up.",
      "created_utc": 1655824676.0,
      "score": 10,
      "context": []
    },
    {
      "id": "id5bxy5",
      "author": "5star-my-notebook",
      "body": "I hate that bulimia isn’t taken as seriously and that treatment is so focused on weight restoration when many people with EDs have either gained or maintained while being ill. Some programs are better than others with treating non-anorexic patients, and I can assure you that you can die from bulimia, and that it is very dangerous. Treatment programs with HAES approaches might be a better route for you to go if you decide to seek help, as they’re less focused on weight and more on overall health and quality of life",
      "created_utc": 1655787497.0,
      "score": 21,
      "context": []
    },
    {
      "id": "id5c8io",
      "author": "According_Cellist_17",
      "body": "Your logic is that you don’t look like how you think they would want you to look before they cared, therefore there’s no reason to seek treatment until you look anorexic? First off you’re probably just incorrect to assume their state of mind and they likely will care regardless of how you look. Second, any professional worth their hourly rate does their job whether they care or not. Third, who cares what the anorexics think in this hypothetical scenario? You were smart enough to get treatment before your life got into danger and they weren’t.",
      "created_utc": 1655787695.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iho83jp",
      "author": "strawberrywitch143",
      "body": "if ur still looking for a treatment center, i’d maybe try Eating Recovery Center. I went there when i was struggling with bulimia, i feel like they cater to a few types of EDs not just anorexia",
      "created_utc": 1658807838.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idsutyv",
      "author": "lisa6547",
      "body": "I agree. 🙁",
      "created_utc": 1656248179.0,
      "score": 1,
      "context": [
        {
          "id": "id6halq",
          "author": "AliveCommunity4627",
          "body": "I agree, it’s so hard to listen to the girls there talk about how they never eat and how easy it is to starve themselves while I’m so hungry all the time and dream about eating and throwing up. \nI’m just a little bit under weight and not considered as sick as them so the treatment they gave me wasn’t affective… I felt awful \nI truly believe bulimia is much worst physical than anorexia even tho I shouldn’t compare. Teeth, heart, mental pain which is unbelievable and the way people react when they hear you starve yourself vs purge. So fucking depressing.",
          "created_utc": 1655818164.0
        }
      ]
    },
    {
      "id": "id6f4wi",
      "author": "notthezodiackiller71",
      "body": "Same, I feel awful when my friends or family try to convince me to \"eat at least something\" but that isn't the problem. I eat, and it's a lot. I'm just scared to lose control in front of other people",
      "created_utc": 1655817063.0,
      "score": 19,
      "context": [
        {
          "id": "id5j6nk",
          "author": "bonusbobcat",
          "body": "Or the other thing that ps me off is when I've been at a lower weight all the treatment people talk about how I must be restricting - I'm doing the opposite to restricting lol",
          "created_utc": 1655792783.0
        }
      ]
    },
    {
      "id": "id6idm6",
      "author": "None",
      "body": "just the fact that I was the only person with a primary complaint of bulimia behaviors while being in treatment with probably 30+ women over the course of months is a representation that residential tx centers are catering to anorexia. It was undoubtedly isolating but also made me resilient and stubbornly spoken about bulimia.",
      "created_utc": 1655818700.0,
      "score": 10,
      "context": [
        {
          "id": "id6i1ki",
          "author": "None",
          "body": "This was partly my experience being in residential treatment (laureate in OK), but I realized about halfway through that I was gonna have to take it upon myself to change the narrative or I was gonna return home still sick. Like every single group was focused on weight restoration, restriction, and fears around that but I wasn’t restoring weight so I finally just bit the bullet and starting talking about binging/purging in groups. Some peers thanked me for talking about it bc they never talked about it in tx bc of the silence, some didn’t know how to respond, and some people stuck in their Ed’s looked down on me for not having anorexia- BUT, I got the help I needed and was able to recover plus get rid of some of the shame of having the “lesser” disorder🫠🫠🫠\nBUT, I DEFINITELY get your frustration and it’s a real problem, but rarely recognized bc the whole treatment world is hyper fixated on restriction.",
          "created_utc": 1655818537.0
        }
      ]
    },
    {
      "id": "id5g66v",
      "author": "SignificantAdagio11",
      "body": "I was in treatment at a clinic and honestly will never seek treatment again. I left because the staff spent every single session talking about refeeding.  I never spoke up in group because I was surrounded by anorexics 24/7 so what the hell would I even say, i could not relate to what the counselors spoke about at all. I just spent the entire time wishing I was strong enough to be anorexic and it made my ED 10x worse.",
      "created_utc": 1655790488.0,
      "score": 10,
      "context": [
        {
          "id": "id5c8io",
          "author": "According_Cellist_17",
          "body": "Your logic is that you don’t look like how you think they would want you to look before they cared, therefore there’s no reason to seek treatment until you look anorexic? First off you’re probably just incorrect to assume their state of mind and they likely will care regardless of how you look. Second, any professional worth their hourly rate does their job whether they care or not. Third, who cares what the anorexics think in this hypothetical scenario? You were smart enough to get treatment before your life got into danger and they weren’t.",
          "created_utc": 1655787695.0
        }
      ]
    }
  ]
}