{
  "id": "vyyjyx",
  "subreddit": "bulimia",
  "author": "Financial-Stand-5907",
  "created_utc": 1657812410.0,
  "title": "Why is it so satisfying!?",
  "selftext": "Does anyone else just get so incredibly satisfied when you have an amazing purge? When you just keep pushing yourself and then it all seems to come out and maybe even more. \nI get this sense of “wow I did it” and I feel so much better after. \nThis is why this disease is so hard to beat :(",
  "url": "https://www.reddit.com/r/bulimia/comments/vyyjyx/why_is_it_so_satisfying/",
  "score": 122,
  "num_comments": 22,
  "comments": [
    {
      "id": "ig5717l",
      "author": "Branch-Much",
      "body": "Yep. I haven’t purged for a while, bc I’ve been trying to recover. I have been overeating every single day for weeks though, and today I woke up feeling so sick. I know I’d just feel so much better if I could just effectively throw up my insides. \n\nI know logically that even if it tried to throw up now I’d still be retaining all the calories I’ve eaten over the weeks, so it’s pointless from a weight management standpoint. But I might feel so much better, assuming it comes up and doesn’t get stuck or anything. I think if I’d just been purging instead of holding it in, I might not feel so horrid right now. It really is so hard to beat.",
      "created_utc": 1657815172.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ig69dm6",
      "author": "TranZeitgeist",
      "body": "There are actually a pretty complex series of chemicals released in the body and brain around both binging and purging; including some \"feel good chemicals\" like opioids and dopamine that are similar to street drugs, and can be similarly addicting.\n\nIf someone wants an in depth piece of research - [Dysregulation of Brain Reward Systems in Eating Disorders](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3366171/)",
      "created_utc": 1657829777.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ig6fg7g",
      "author": "Mclaire91232",
      "body": "I used to, but honestly after 11 years of this (I’m 23) it’s just tiring. I just feel exhausted after I purge these days lol",
      "created_utc": 1657832117.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ig7bibd",
      "author": "chronaloid",
      "body": "Yes. \n\nIn residential I got very frustrated with the fact that there is not a single other (“healthy”) coping skill out there that gives me the same relief+accomplishment feeling as purging. I spent a lot of time really angry about it, that I “had” to give it up (which, to be fair, it WAS killing me) when there was nothing else out there that works as well for me. And that was really fucking hard for me to accept and to be honest I still don’t know if I’ve accepted it, almost a year later. Deep down I feel like I’d go back to it if all these other silly little coping skills stop getting me by. Even the last time I purged, which was in res and was a complete disaster in every way, when I look back on it I still savor that gleam of satisfaction I felt. It’s horrible. \n\nThank you for speaking about this because it’s not something I’ve heard about very much from other people, and I’ve been too ashamed to say anything about it on my own.",
      "created_utc": 1657845832.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ig5mo40",
      "author": "Narwhal_Songs",
      "body": "I get a high from it, apparently its s hormone called vasopressin that is released to compliment us if we purge because of poison etc, but ifc us huamns have made ways to get addicted to it 🤪",
      "created_utc": 1657821090.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ig7ndxz",
      "author": "elpintor91",
      "body": "For me it’s the “relief” of all those calories. Like yes I indulged in the bad stuff now it’s all gone mwahahaha I’m a master mind. Of course it feels like shit when you’re in the act and it feels shameful and gross. Then when I’m done and cleaned up I feel good again. I do have anxiety when the next person goes to the bathroom cause I’m always paranoid I left something I didn’t see a splatter or something but when they don’t see anything I feel good again. \n\nI have read there’s science to this similar to heroin addicts the highs and lows",
      "created_utc": 1657851334.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ig7ip0z",
      "author": "SleepingBlackberry",
      "body": "Your body gives you some dopamine when you throw up, also pooping. I was told it's a small like biological response to enforce the healthy normal ways of getting rid of waste",
      "created_utc": 1657849162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ig5i6xf",
      "author": "None",
      "body": "Honestly yeah, purged hard today and it was basically like one of those satisfying slime compilations and honestly it's almost comforting to me. Like I know I would feel better to simply not eat it but the I guess relief I get from purging after a binge is ridiculous",
      "created_utc": 1657819360.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ig8q2gh",
      "author": "Dry_Bug2022",
      "body": "Those first couple mins in the binge feel like this to me. Like the sudden rush of dopamine, satisfying my hunger and the momentary relief from all my troubles. But after that everything just makes me feel like dookie cause the guilt of wasting so much damn food, time and money. Like bro I can’t keep doing this. I think the relief of all the calories being out is cool but those moments during the actual purge make me incredibly anxious cause I worry I’ll get caught or won’t be able to get all the calories out. It’s honestly very stressful for me 😕",
      "created_utc": 1657875876.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igahabx",
      "author": "dexterdrag",
      "body": "So accurate. The bigger the purge, the better it feels. That skip in your heartbeat and clench of your chest feel weirdly tight and satisfying. I am so aware of how screwed up that is but this is what i feel. At the end of the day, i hate myself for being weak and fat yet zero resolve to actually lose weight healthily. However, that calm after a purge is addictive. As if i hit a reset button and everything is now ok. I can start afresh. The thing is I'm gaining weight, so i know it doesn't work, obviously, but knowing is not the same as feeling. It doesn't help that i perceive purging as an emotional reset button for other issues even non-food related ones. I know it is extremely damaging to your physical body, it is just that i don't feel like i have a solution to my real issues so i purge just to feel a sense of control and peace in that moment. I hate it but it is what it is",
      "created_utc": 1657907119.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igznzt9",
      "author": "Queasy-Possession129",
      "body": "yeah, especially when your gag reflex is extremely desensitized to the point of being almost nonexistent. it feels like a massive accomplishment to finally get rid of all that food after sitting in front ofthe toilet for what feels like ages, desperately shoving fingers and whatever other items you can down your throat until it’s sore and hurting and you’re just drooling all over. it feels like a weight has been lifted from your shoulders and like you’re safe and in control again.",
      "created_utc": 1658365239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ih0ijxu",
      "author": "None",
      "body": "I’ve read somewhere before that it stimulates the vagus nerve which helps relieve stress and also apparently people susceptible to eating disorders and OCD are found to have insensitive or irregular vagus nerve function, which in turn makes it particularly addicting for certain people like us. There is theories that stimulating that vagus nerve in other ways can bring the same relief, and I’ve tried some out and think there’s definitely some truth to it! If you’ve ever brushed your teeth/tongue to the point of gagging or coughed really really hard and felt weirdly good or energized after, that’s likely you stimulating your vagus nerve! \n\nIt’s super interesting if you wanna Google about it.. may be the reason why some faint during purging too and also can be the cause of heart rate issues.\n\nHere’s an article on ways to stimulate your vagus nerve at home (besides purging lol)\n\nhttps://www.allied-services.org/news/2020/june/the-vagus-nerve-your-secret-weapon-in-fighting-s/",
      "created_utc": 1658380816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igzlhd4",
      "author": "None",
      "body": "I used to \"love\" to purge. And if toward the end of a purge I got more out, I would whisper, \"Thank you, God.\" because I would be so grateful. If I could have emptied my entire digestive track of food(digested and undigested), it would have been a dream come true of sorts.\n\nBut I paid a price for my daily purging. And for some of the relapses I have had over the years that I have been in recovery.\n\nFirst, as someone else said, purging was exhausting. I stopped going for walks at a certain point because I just got so tired from purging.\n\nIt was an alienating activity for me, too. For example, I had roommates when I was at my worst. I would disappear in the bathroom for like an hour every night. I used to wonder what they thought I was doing in there. And who knows what it smelled like in there when I was done.\n\nAnother thing is when I would encounter a friend and they asked me what I had been up to. I was spending a lot of my time off purging. So, I would have make something up. I hated that. I was also going to fewer 12 step meetings(I am a recovering alcoholic). I hadn't had a drink in 3 years, but I missed the recovery and social aspect of the meetings.\n\nBulimia made my world smaller, full of lonliness, and I was feeling more and more isolated. But I continued to be VERY strongly drawn to purging.\n\nOften I purged until I started to see blood or experienced some type of pain that scared me.\n\nOne time I had a seizure. This was during a relapse that lasted several weeks. Mind you, I had been purge free for a couple of years prior to that.\n\nI was unable to get up off the floor for 15-20 minutes and my wife had to call 911. I was in the hospital for 2 nights during which time I couldn't speak properly because my brain wasn't quite right yet. I had been purging by using water in a certain way. I won't describe it here because it can literally kill you. My sodium became dangerously low. Also, I hit my head on the way to the floor.\n\nThe puffy face- I love having a puffy face! Of course I didn't like having a puffy face. But with all the straining and bending over, it happens. It's embarrassing, to say the least. I am overweight now, to some extent. So, I don't know how much my puffy face is due to being overweight and how much is leftover from active bulimia.\n\nBottom line- Yeah, sometimes I miss purging, a lot. But when I think of everything that goes along with the purging lifestyle, it turns out to be a very painful and self-destructive way of living.",
      "created_utc": 1658364086.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ig5n4dc",
      "author": "Narwhal_Songs",
      "body": "I feel you, I honestly had no weight issues when bulimia started it was more health anxiety and stress relief but after years of this disease and how much weight i gained from it i struggling a lot with weight phobia as well \n\nIts soo hard not purging and just sittning with the discomfort.",
      "created_utc": 1657821262.0,
      "score": 8,
      "context": [
        {
          "id": "ig5717l",
          "author": "Branch-Much",
          "body": "Yep. I haven’t purged for a while, bc I’ve been trying to recover. I have been overeating every single day for weeks though, and today I woke up feeling so sick. I know I’d just feel so much better if I could just effectively throw up my insides. \n\nI know logically that even if it tried to throw up now I’d still be retaining all the calories I’ve eaten over the weeks, so it’s pointless from a weight management standpoint. But I might feel so much better, assuming it comes up and doesn’t get stuck or anything. I think if I’d just been purging instead of holding it in, I might not feel so horrid right now. It really is so hard to beat.",
          "created_utc": 1657815172.0
        }
      ]
    },
    {
      "id": "ig5npzj",
      "author": "Financial-Stand-5907",
      "body": "It’s so hard 😩 I’m sorry you’re struggling too.. I know it’s hard but you’re doing great not purging..",
      "created_utc": 1657821492.0,
      "score": 5,
      "context": [
        {
          "id": "ig5717l",
          "author": "Branch-Much",
          "body": "Yep. I haven’t purged for a while, bc I’ve been trying to recover. I have been overeating every single day for weeks though, and today I woke up feeling so sick. I know I’d just feel so much better if I could just effectively throw up my insides. \n\nI know logically that even if it tried to throw up now I’d still be retaining all the calories I’ve eaten over the weeks, so it’s pointless from a weight management standpoint. But I might feel so much better, assuming it comes up and doesn’t get stuck or anything. I think if I’d just been purging instead of holding it in, I might not feel so horrid right now. It really is so hard to beat.",
          "created_utc": 1657815172.0
        }
      ]
    },
    {
      "id": "ig9rjbv",
      "author": "Long-Bread-9329",
      "body": "omg i feel you!!! been gaining weight and feeling gross and bloated every day, i think i even feel worse than when i purged every day, what the hell mannnnn……",
      "created_utc": 1657896941.0,
      "score": 2,
      "context": [
        {
          "id": "ig5717l",
          "author": "Branch-Much",
          "body": "Yep. I haven’t purged for a while, bc I’ve been trying to recover. I have been overeating every single day for weeks though, and today I woke up feeling so sick. I know I’d just feel so much better if I could just effectively throw up my insides. \n\nI know logically that even if it tried to throw up now I’d still be retaining all the calories I’ve eaten over the weeks, so it’s pointless from a weight management standpoint. But I might feel so much better, assuming it comes up and doesn’t get stuck or anything. I think if I’d just been purging instead of holding it in, I might not feel so horrid right now. It really is so hard to beat.",
          "created_utc": 1657815172.0
        }
      ]
    },
    {
      "id": "ig7n047",
      "author": "elpintor91",
      "body": "You just made me realize I’ve been living with this longer than When I started. (I’m 30 started at 13)😳",
      "created_utc": 1657851153.0,
      "score": 3,
      "context": [
        {
          "id": "ig6fg7g",
          "author": "Mclaire91232",
          "body": "I used to, but honestly after 11 years of this (I’m 23) it’s just tiring. I just feel exhausted after I purge these days lol",
          "created_utc": 1657832117.0
        }
      ]
    },
    {
      "id": "ih05aex",
      "author": "None",
      "body": "I think you summed it up nicely. No matter how much I may crave it at times, and think about how \"good\" it made me feel (a big lie, IMO). In the end, the whole thing was  \n\n\nHorrible!!!",
      "created_utc": 1658373269.0,
      "score": 2,
      "context": [
        {
          "id": "ig7bibd",
          "author": "chronaloid",
          "body": "Yes. \n\nIn residential I got very frustrated with the fact that there is not a single other (“healthy”) coping skill out there that gives me the same relief+accomplishment feeling as purging. I spent a lot of time really angry about it, that I “had” to give it up (which, to be fair, it WAS killing me) when there was nothing else out there that works as well for me. And that was really fucking hard for me to accept and to be honest I still don’t know if I’ve accepted it, almost a year later. Deep down I feel like I’d go back to it if all these other silly little coping skills stop getting me by. Even the last time I purged, which was in res and was a complete disaster in every way, when I look back on it I still savor that gleam of satisfaction I felt. It’s horrible. \n\nThank you for speaking about this because it’s not something I’ve heard about very much from other people, and I’ve been too ashamed to say anything about it on my own.",
          "created_utc": 1657845832.0
        }
      ]
    },
    {
      "id": "ig5nh2v",
      "author": "Financial-Stand-5907",
      "body": "Of course haha",
      "created_utc": 1657821397.0,
      "score": 2,
      "context": [
        {
          "id": "ig5mo40",
          "author": "Narwhal_Songs",
          "body": "I get a high from it, apparently its s hormone called vasopressin that is released to compliment us if we purge because of poison etc, but ifc us huamns have made ways to get addicted to it 🤪",
          "created_utc": 1657821090.0
        }
      ]
    },
    {
      "id": "ig5nk25",
      "author": "Financial-Stand-5907",
      "body": "Yes it’s so satisfying when you get it all out, it honestly makes it so addicting because when you binge you know if you get a good purge sesh you’ll feel amazing after",
      "created_utc": 1657821429.0,
      "score": 2,
      "context": [
        {
          "id": "ig5i6xf",
          "author": "None",
          "body": "Honestly yeah, purged hard today and it was basically like one of those satisfying slime compilations and honestly it's almost comforting to me. Like I know I would feel better to simply not eat it but the I guess relief I get from purging after a binge is ridiculous",
          "created_utc": 1657819360.0
        }
      ]
    },
    {
      "id": "iha19kr",
      "author": "Financial-Stand-5907",
      "body": "Thank you for being so honest \nIt has been very alienating for me too.. sometimes I plan my weekends around B/P it’s really very sad",
      "created_utc": 1658546280.0,
      "score": 2,
      "context": [
        {
          "id": "igzlhd4",
          "author": "None",
          "body": "I used to \"love\" to purge. And if toward the end of a purge I got more out, I would whisper, \"Thank you, God.\" because I would be so grateful. If I could have emptied my entire digestive track of food(digested and undigested), it would have been a dream come true of sorts.\n\nBut I paid a price for my daily purging. And for some of the relapses I have had over the years that I have been in recovery.\n\nFirst, as someone else said, purging was exhausting. I stopped going for walks at a certain point because I just got so tired from purging.\n\nIt was an alienating activity for me, too. For example, I had roommates when I was at my worst. I would disappear in the bathroom for like an hour every night. I used to wonder what they thought I was doing in there. And who knows what it smelled like in there when I was done.\n\nAnother thing is when I would encounter a friend and they asked me what I had been up to. I was spending a lot of my time off purging. So, I would have make something up. I hated that. I was also going to fewer 12 step meetings(I am a recovering alcoholic). I hadn't had a drink in 3 years, but I missed the recovery and social aspect of the meetings.\n\nBulimia made my world smaller, full of lonliness, and I was feeling more and more isolated. But I continued to be VERY strongly drawn to purging.\n\nOften I purged until I started to see blood or experienced some type of pain that scared me.\n\nOne time I had a seizure. This was during a relapse that lasted several weeks. Mind you, I had been purge free for a couple of years prior to that.\n\nI was unable to get up off the floor for 15-20 minutes and my wife had to call 911. I was in the hospital for 2 nights during which time I couldn't speak properly because my brain wasn't quite right yet. I had been purging by using water in a certain way. I won't describe it here because it can literally kill you. My sodium became dangerously low. Also, I hit my head on the way to the floor.\n\nThe puffy face- I love having a puffy face! Of course I didn't like having a puffy face. But with all the straining and bending over, it happens. It's embarrassing, to say the least. I am overweight now, to some extent. So, I don't know how much my puffy face is due to being overweight and how much is leftover from active bulimia.\n\nBottom line- Yeah, sometimes I miss purging, a lot. But when I think of everything that goes along with the purging lifestyle, it turns out to be a very painful and self-destructive way of living.",
          "created_utc": 1658364086.0
        }
      ]
    },
    {
      "id": "iga9f25",
      "author": "Branch-Much",
      "body": "Ugh it’s so hard but purging is so harmful!! I hope we’ll reach a place where we can just eat a normal amount and leave it there 😩",
      "created_utc": 1657904021.0,
      "score": 3,
      "context": [
        {
          "id": "ig5717l",
          "author": "Branch-Much",
          "body": "Yep. I haven’t purged for a while, bc I’ve been trying to recover. I have been overeating every single day for weeks though, and today I woke up feeling so sick. I know I’d just feel so much better if I could just effectively throw up my insides. \n\nI know logically that even if it tried to throw up now I’d still be retaining all the calories I’ve eaten over the weeks, so it’s pointless from a weight management standpoint. But I might feel so much better, assuming it comes up and doesn’t get stuck or anything. I think if I’d just been purging instead of holding it in, I might not feel so horrid right now. It really is so hard to beat.",
          "created_utc": 1657815172.0
        },
        {
          "id": "ig9rjbv",
          "author": "Long-Bread-9329",
          "body": "omg i feel you!!! been gaining weight and feeling gross and bloated every day, i think i even feel worse than when i purged every day, what the hell mannnnn……",
          "created_utc": 1657896941.0
        }
      ]
    }
  ]
}