{
  "id": "w2dr3h",
  "subreddit": "bulimia",
  "author": "RepulsiveApartment20",
  "created_utc": 1658187533.0,
  "title": "Today I am one year b/p free",
  "selftext": "It has been a long, hard road. I never thought that I would have the strength to come this far. Literally never, I remember times when I would sit by the toilet covered in my own puke sobbing and wishing it would all just end because I just couldn’t do it anymore. I was so deep in the hole I thought that I would never climb my way out. \n\nThrowing up 3-7 times a day or not eating at all. Isolating myself, pushing everyone away. Not living, just surviving until the next meal. Dropping out of college. Severe anxiety and depression. Celibacy for seven years because the thought of someone seeing me naked or touching me gave me panic attacks. Getting close or letting someone know my secret. No period for nearly a decade, still unaware if there are consequences from that and I’m still too scared to go to the doctor and find out. Uncontrolled type one diabetes as a result from uncontrolled binging and not taking insulin. Having my left pinky toe amputated bc of complications from the uncontrolled diabetes. Having several teeth pulled and several chipped. Going into cardiac arrest twice and being in a coma for a week. \nLiterally all a result from my eating disorder. \n\nPlease for the love of God get help. I am only 24 years old, I don’t know how many years I’ve taken off my life, I don’t know the full extent of damage I’ve already done, I don’t know if I can have children. The long term effects are real. I know it’s hard, believe me I know. It is literally the hardest thing I’ve had to over come in my life and I’m still struggling. Some days are easier than others, there have been moments when I almost gave in. But let me tell you, on the other side, it’s fucking rainbows and sunshine. Not having to spend two hours in the bathroom after meals is glorious. Opening up, letting people in, having support, it’s amazing. Maybe you think you can’t tell anyone, maybe you feel like you have to carry this burden all alone. Don’t. Ask for help, save your own life. You deserve a life without b/p, you deserve to feel beautiful in your own skin, you deserve to grow old and experience life, not just survive it.",
  "url": "https://www.reddit.com/r/bulimia/comments/w2dr3h/today_i_am_one_year_bp_free/",
  "score": 100,
  "num_comments": 15,
  "comments": [
    {
      "id": "igptme6",
      "author": "Sierra1208",
      "body": "Congratulations!! I am so proud of you. You are so strong and amazing!! Keep going on this good track, I believe in you! 😊",
      "created_utc": 1658191968.0,
      "score": 7,
      "context": []
    },
    {
      "id": "igpw4gw",
      "author": "pinkskittle09",
      "body": "Literally cried reading this bc I can relate so deeply. Congratulations and amazing motivation to recover!",
      "created_utc": 1658193094.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igpwe8m",
      "author": "bynxl",
      "body": "congratulations!! genuinely that's so amazing to hear. I'm around the same age and sometimes feel bad I'm still struggling. It's easy to give up and feel hopeless, but hearing stories like this help me stay on the road to recovery. I hope you keep doing well.",
      "created_utc": 1658193219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igq0ptp",
      "author": "Cryophoenix_Killer",
      "body": "Congrats dude, everyone deserves to live with dignity and care for themselves. Even after rough times its great to pull yourself back. Keep up the work and gl on the journey ahead",
      "created_utc": 1658195141.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igqagit",
      "author": "vbgirl24",
      "body": "This made me tear up. I’m so in awe of your resilience to have faced such hardship and put in the work to overcome. I want this for me too. Life with bulimia isn’t really living. I want to be free",
      "created_utc": 1658199577.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igqnm4l",
      "author": "clumsycouture",
      "body": "Congrats that is an amazing accomplishment! I felt exactly the same way as you when I finally decided to stop. It’ll be 11 years since I last purged in January. I remember crying thinking I would never be at a place I am today. The biggest I’ve ever been and I love my little belly. I used to stare at my thighs and wish I could cut them off and now I love my big thighs and butt! \n\nThe first year is the hardest, it gets easier from here. If your reading this you can stop too and life is so much better on the other side! If I was you I would see a therapist. I wish I did when I quit because the mental aspect is the hardest to get rid of. I still have days where my body dysmorphia is bad and I feel “fat” but I don’t let that destroy my day. \n\nI’ve had 5 teeth pulled and 10 fillings. Basically my teeth are so disintegrated I’ll need dentures/implants in a couple years. Every single tooth has a chip in it as well. Luckily my period came back right always and I wasn’t sure if I could get pregnant but I did(I had an abortion). One of my friends was hospitalized many times as a teen and she just had a baby at 35! Don’t be scared if you can go to the doctor and get checked out! Honestly if I would have gone to the dentist sooner I probably could have saved some teeth. \n\nI am so so proud of you! If I can make it ten years you can too! I was 23 when I quit you have an amazing life ahead of you!",
      "created_utc": 1658206660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igrrf8i",
      "author": "Sam_Muscle_115",
      "body": "Congratulations! Thank you for sharing this here. I’m sure many of us can relate to you on a very personal level. I might have also shed a teeny tiny bit of a tear after reading this. You’re strong and you deserve every bit of happiness. I’m on the recovery myself and this really inspires me to keep going.\nTake care \nSending lots of love your way ❤️",
      "created_utc": 1658234517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igsdqxf",
      "author": "Narwhal_Songs",
      "body": "Congrats 💗",
      "created_utc": 1658244072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ij468q2",
      "author": "Ace-Pokemon-Master",
      "body": "Congrats thats amazing!!!! What are some things that really helped you and things that continue to help?",
      "created_utc": 1659739226.0,
      "score": 2,
      "context": []
    },
    {
      "id": "igq14vu",
      "author": "RepulsiveApartment20",
      "body": "Thank you so much !! I will try my best !",
      "created_utc": 1658195326.0,
      "score": 1,
      "context": [
        {
          "id": "igptme6",
          "author": "Sierra1208",
          "body": "Congratulations!! I am so proud of you. You are so strong and amazing!! Keep going on this good track, I believe in you! 😊",
          "created_utc": 1658191968.0
        }
      ]
    },
    {
      "id": "igq1bo0",
      "author": "RepulsiveApartment20",
      "body": "I’m glad I could spread a little motivation with my journey. Thank you for your words and I wish you luck in your journey ! Stay strong 💪🏽",
      "created_utc": 1658195409.0,
      "score": 2,
      "context": [
        {
          "id": "igpw4gw",
          "author": "pinkskittle09",
          "body": "Literally cried reading this bc I can relate so deeply. Congratulations and amazing motivation to recover!",
          "created_utc": 1658193094.0
        }
      ]
    },
    {
      "id": "igq21pl",
      "author": "RepulsiveApartment20",
      "body": "Thank you ! And there is no age limit, everyone is on their own timeline. Remember it’s okay to let yourself feel that way but not to allow yourself to live that way. I always have to remind myself it’s a bad day not a bad life and to just be gentle to myself. Tomorrow is always a new day. Recovery is not a straight line. But I believe in you, stay strong and good luck you got this !✊🏽",
      "created_utc": 1658195736.0,
      "score": 2,
      "context": [
        {
          "id": "igpwe8m",
          "author": "bynxl",
          "body": "congratulations!! genuinely that's so amazing to hear. I'm around the same age and sometimes feel bad I'm still struggling. It's easy to give up and feel hopeless, but hearing stories like this help me stay on the road to recovery. I hope you keep doing well.",
          "created_utc": 1658193219.0
        }
      ]
    },
    {
      "id": "igq11fe",
      "author": "RepulsiveApartment20",
      "body": "Thank you so much I really appreciate that ✊🏽",
      "created_utc": 1658195283.0,
      "score": 1,
      "context": [
        {
          "id": "igq0ptp",
          "author": "Cryophoenix_Killer",
          "body": "Congrats dude, everyone deserves to live with dignity and care for themselves. Even after rough times its great to pull yourself back. Keep up the work and gl on the journey ahead",
          "created_utc": 1658195141.0
        }
      ]
    },
    {
      "id": "igrxofn",
      "author": "RepulsiveApartment20",
      "body": "Well thank you. And I promise you that it’s possible. Trust me I was one of those people would said that I would never be able to overcome it, I thought that I would be trapped my whole life. You are stronger than you think and you deserve to have your life back. You got this✊🏽 I believe in you and if you ever need anything or wanna talk (I know I’m a stranger) but I’m here for ya. Sending love and strength your way ❤️",
      "created_utc": 1658237496.0,
      "score": 1,
      "context": [
        {
          "id": "igqagit",
          "author": "vbgirl24",
          "body": "This made me tear up. I’m so in awe of your resilience to have faced such hardship and put in the work to overcome. I want this for me too. Life with bulimia isn’t really living. I want to be free",
          "created_utc": 1658199577.0
        }
      ]
    },
    {
      "id": "igs0jdt",
      "author": "RepulsiveApartment20",
      "body": "Thank you so much for your kind words 🥺 it means a lot that I could help or inspire someone. Recovery is a bitch but you have an incredible amount of strength to be doing it. You got this ✊🏽 sending love right back at ya ❤️",
      "created_utc": 1658238748.0,
      "score": 1,
      "context": [
        {
          "id": "igrrf8i",
          "author": "Sam_Muscle_115",
          "body": "Congratulations! Thank you for sharing this here. I’m sure many of us can relate to you on a very personal level. I might have also shed a teeny tiny bit of a tear after reading this. You’re strong and you deserve every bit of happiness. I’m on the recovery myself and this really inspires me to keep going.\nTake care \nSending lots of love your way ❤️",
          "created_utc": 1658234517.0
        }
      ]
    }
  ]
}