{
  "id": "w2q55i",
  "subreddit": "bulimia",
  "author": "Rhubarbby",
  "created_utc": 1658229121.0,
  "title": "I gave myself gastroparesis after puking every meal for six years",
  "selftext": "Idk, I guess this is a warning post.\n\nI had an endoscopy about a month ago and got the results about a week after. They confirmed my stomach is paralyzed, with moderate gastritis throughout my entire stomach/colon.\n\nI’ve been purging since 19, and I’m 25 now. I would puke after every meal and b/p for hours on the weekends, sometimes up to 20+ times a day.\n\nI am prescribed ensures, reglan, and enough zofran for a cancer patient. My life is constant stomach pain and bloating. It’s on the foreground of my mind all day how much my stomach hurts. I have since drastically reduced the amount I purge, but the damage has been done. The docs told me taking reglan (gut motility stimulator) will eventually lead to tremors, so I have that to look forward to as well.\n\nI’m just sharing this because I want everyone to be careful. There CAN be lasting damage from this disease. I almost wish I would’ve lost my teeth instead, at least I could get veneers. You can’t get a new stomach.\n\nStay safe. I’m open to questions.",
  "url": "https://www.reddit.com/r/bulimia/comments/w2q55i/i_gave_myself_gastroparesis_after_puking_every/",
  "score": 155,
  "num_comments": 14,
  "comments": [
    {
      "id": "igs047l",
      "author": "ir2yun0",
      "body": "I feel like this kind of long term effects aren't talked about enough. Everyone only talks about the short(er)-term ones like bad teeth, puffy face, needing to eat more, gaining weight etc..\n\nI've also developed stomach issues after 3 years of purging. I assume what fucked it up the most is that I learned how to do it hands-free. Now I haven't done it in months and I'm still unable to process food normally. Any time I get too full I involuntarily throw up, or at least start regurgitating it which feels gross. My stomach also often hurts for no reason and pills like Nexium don't help. I've been to doctors before and got a gastroscopy done but they said everything looks fine. And I also get nauseated easily which means I can't enjoy many of the foods I used to like before.\n\nThis went off the trail but I just wanted to share my own experience I've never seen anyone warn others about before. To people reading this, please don't assume you will get away from this with no health consequences.",
      "created_utc": 1658238565.0,
      "score": 43,
      "context": []
    },
    {
      "id": "igsdvlz",
      "author": "Aria2628",
      "body": "Maybe I have this. After not being bulimic for a few days I feel so full I cave in and purge. Binging stimulates nbr 2 as well. Afterward I feel pissed at myself but way better physically. I'm starting myself on colace to see if that can help me. How did u get diagnosed with gastroparesis?",
      "created_utc": 1658244121.0,
      "score": 8,
      "context": []
    },
    {
      "id": "igrvzw0",
      "author": "esoterique87",
      "body": "I'm sending so much love your way and I am so sorry you are going through this. Thank you for sharing your experience even though it is a painful one. There are so many young people on here who have only just started with binging and purging and I hope they see this post. This is a serious illness with very real consequences, not just a \"neat trick for weight loss.\" I'm just sorry you are dealing with this right now and I hope the treatment you receive is able to manage your symptoms and the pain.❤️",
      "created_utc": 1658236737.0,
      "score": 7,
      "context": []
    },
    {
      "id": "igum3z9",
      "author": "LuxeLady100",
      "body": "I never purged by vomiting but by severely abusing laxatives which has caused severe damage to my organs and has resulted in surgery and medications I will have to take the rest of my life.  At the height of my disorder I never thought of the long lasting consequences - all I could hear was the voices of those around me telling me how good I looked in an outfit;  that I looked the best I ever had.  I told myself I had to do whatever possible to stay that way including injure my body to the point of no return.  My greatest hope is that there are those who will read your post, mine, and those of others on this forum and realize they need help and get it before the scars are too far to be fixed.",
      "created_utc": 1658275106.0,
      "score": 6,
      "context": []
    },
    {
      "id": "igui46c",
      "author": "birdseedforall",
      "body": "This is definitely an eye opener I’ve been feeling some stomach pain. Hopefully it’s more of a short term symptom",
      "created_utc": 1658273350.0,
      "score": 7,
      "context": []
    },
    {
      "id": "igso1i9",
      "author": "Entire-Pin-1196",
      "body": "I only did it for a year and now I have celiac, and I’m at risk of greater autoimmune disorders. All for something that is ment to keep us alive",
      "created_utc": 1658247981.0,
      "score": 5,
      "context": []
    },
    {
      "id": "igt9jun",
      "author": "Working_Nectarine_52",
      "body": "I feel you. I have had severe gastritis for 4 years now from 20 years of bulimia. I dont know how i got away with it for so long but my life has been MISERABLE at times. I wish I knew then what I know now. Wasn’t worth it.",
      "created_utc": 1658255965.0,
      "score": 5,
      "context": []
    },
    {
      "id": "igt3gqx",
      "author": "UglyPuke",
      "body": "i’m so sorry :( i already have a pretty fucky stomach and i can’t imagine what you’re going through. i can’t thank you enough for posting, this was a wake up call and definitely something people need to read",
      "created_utc": 1658253706.0,
      "score": 5,
      "context": []
    },
    {
      "id": "igvgvkg",
      "author": "avadamaris",
      "body": "im sorry this is how it’s unfolded..thank you for making this post  , i’ve never thought about gastroparesis being so crippling",
      "created_utc": 1658289178.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ihsfhzk",
      "author": "Muted_Bookkeeper9127",
      "body": "I gave myself gastroparesis too when I was only 13. Almost needed a J Tube. Hit a liquid diet for 8 months and no meat for 2 years. I evened out. Best of luck.",
      "created_utc": 1658882166.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iguj5sv",
      "author": "Rhubarbby",
      "body": "This is my diagnoses in a nutshell. I learned hands-free after my wisdom teeth were removed and it got so much worse from there. I started purging meals I had the day prior, with tons of bloating, random vomiting, and bathroom issues. I just wasn’t digesting anything anymore.\n\nIt took me a few years of tests and different doctors to take me seriously because of my age, and when they did, they took it SERIOUSLY. I highly recommend seeking a decent GI doctor and suggesting you may have gastroparesis. The zofran alone is life-changing. The reglan helps, but its also been giving me bathroom issues and the high risk of tremors scares me. But it’s either that or throwing up dinner in the middle of the night every night.\nI’m so sorry you’re going through this as well. I hope you don’t have gastroparesis but I’d really recommend seeing different docs.",
      "created_utc": 1658273809.0,
      "score": 6,
      "context": [
        {
          "id": "igs047l",
          "author": "ir2yun0",
          "body": "I feel like this kind of long term effects aren't talked about enough. Everyone only talks about the short(er)-term ones like bad teeth, puffy face, needing to eat more, gaining weight etc..\n\nI've also developed stomach issues after 3 years of purging. I assume what fucked it up the most is that I learned how to do it hands-free. Now I haven't done it in months and I'm still unable to process food normally. Any time I get too full I involuntarily throw up, or at least start regurgitating it which feels gross. My stomach also often hurts for no reason and pills like Nexium don't help. I've been to doctors before and got a gastroscopy done but they said everything looks fine. And I also get nauseated easily which means I can't enjoy many of the foods I used to like before.\n\nThis went off the trail but I just wanted to share my own experience I've never seen anyone warn others about before. To people reading this, please don't assume you will get away from this with no health consequences.",
          "created_utc": 1658238565.0
        }
      ]
    },
    {
      "id": "igujw7f",
      "author": "Rhubarbby",
      "body": "I got diagnosed after a few years of bad stomach pain and bloating that wouldn’t go away. I’ve been to rehab for weight restoration multiple times, so they knew I had eating disorders, but everyone thought it wasn’t that bad or I was too young for any actual repercussions. I had insisted on more invasive tests where the docs finally were like “wow, she wasn’t lying”.\nTBF I go to the VA, so they have medical documents from multiple years ago of continuous stomach pain complaints.",
      "created_utc": 1658274131.0,
      "score": 5,
      "context": [
        {
          "id": "igsdvlz",
          "author": "Aria2628",
          "body": "Maybe I have this. After not being bulimic for a few days I feel so full I cave in and purge. Binging stimulates nbr 2 as well. Afterward I feel pissed at myself but way better physically. I'm starting myself on colace to see if that can help me. How did u get diagnosed with gastroparesis?",
          "created_utc": 1658244121.0
        }
      ]
    },
    {
      "id": "igujdd0",
      "author": "Rhubarbby",
      "body": "Thank you. I remember being young and naive, and tbh I probably would’ve scrolled past this post at that age but I hope someone can take something. There’s a reason bulimia is one of the highest mortality mental illnesses.",
      "created_utc": 1658273903.0,
      "score": 5,
      "context": [
        {
          "id": "igrvzw0",
          "author": "esoterique87",
          "body": "I'm sending so much love your way and I am so sorry you are going through this. Thank you for sharing your experience even though it is a painful one. There are so many young people on here who have only just started with binging and purging and I hope they see this post. This is a serious illness with very real consequences, not just a \"neat trick for weight loss.\" I'm just sorry you are dealing with this right now and I hope the treatment you receive is able to manage your symptoms and the pain.❤️",
          "created_utc": 1658236737.0
        }
      ]
    },
    {
      "id": "igukhkc",
      "author": "Rhubarbby",
      "body": "I personally have a friend in her 30’s that has gastroparesis as well, and she has a pacemaker in her stomach. That knowledge scares me more than anything. Be safe and careful.",
      "created_utc": 1658274390.0,
      "score": 2,
      "context": [
        {
          "id": "igui46c",
          "author": "birdseedforall",
          "body": "This is definitely an eye opener I’ve been feeling some stomach pain. Hopefully it’s more of a short term symptom",
          "created_utc": 1658273350.0
        }
      ]
    }
  ]
}