{
  "id": "w3s9qf",
  "subreddit": "bulimia",
  "author": "TheRapistIsComing",
  "created_utc": 1658338281.0,
  "title": "this may sound bad but I honestly wish I had Anorexia instead of Bulimia",
  "selftext": "Yeah, I know, poor mindset, but I had Atypical Anorexia (Diagnosed) and honestly life was so much easier. I wasnt at an underweight bmi, but I did lose weight and i only had to restrict. No frequent binges. Now, after recovery, I overgained and Im now at an overweight bmi. Im losing some weight on this disorder (I started frequently purging not too long ago) and it is so exhausting. I have to make sure the door is locked, make sure no one is standing near the door, and make sure my fingers dont smell like puke once im done. I also have to spend 10+ minutes near the toilet. This disorder is messing me up so badly..",
  "url": "https://www.reddit.com/r/bulimia/comments/w3s9qf/this_may_sound_bad_but_i_honestly_wish_i_had/",
  "score": 291,
  "num_comments": 46,
  "comments": [
    {
      "id": "igy1k7b",
      "author": "None",
      "body": "I went from severe BN to AN-b/p subtype a few years ago with mostly restriction and the rare b/p once or twice a week (versus the 5+ daily b/p I had before with BN) I know it's controversial but I agree that bulimia is way worse and I was a lot less miserable with more restriction and less b/p",
      "created_utc": 1658339603.0,
      "score": 77,
      "context": []
    },
    {
      "id": "igy2sem",
      "author": "None",
      "body": "Nah I totally get how you feel. I started off with atypical AN with no purging whatsoever and then shifted to binging and purging. This is so much worse. I have no energy, feel like shit all the time, look like shit, and I’m not even losing weight.",
      "created_utc": 1658340088.0,
      "score": 58,
      "context": []
    },
    {
      "id": "igyb7op",
      "author": "turnipkitty112",
      "body": "As someone who used to have AN-R and switched over to AN-BP (basically BN but I’m slightly underweight) I totally agree. Yes, having restrictive anorexia was hell, I was miserable, for sure. All EDs fucking suck. But b/p is a whole other hell. Despite being 15lbs over my lowest weight I feel just as physically bad as I did then, I have no energy, all my time is spent b/ping or planning it. The mental and physical energy it takes up is ridiculous. And the health effects have fucked me up so fast. And I don’t even get the sick sense of pride and control that comes with restriction bc I feel so guilty for b/ping.",
      "created_utc": 1658343527.0,
      "score": 30,
      "context": []
    },
    {
      "id": "igy3kye",
      "author": "None",
      "body": "Even in recovery it's very hard to feel like my digestion will ever be normal after years of b/p. It's almost been helpful to feel like I maintain my weight better if I just sit with the consequences of a binge instead of falsely convincing myself that purging will fix anything. Purging it will just make me binge again and purge again and still gain weight.",
      "created_utc": 1658340406.0,
      "score": 27,
      "context": []
    },
    {
      "id": "igy5l4f",
      "author": "None",
      "body": "I feel the same. In a sick way I’m so much happier when I can consistently restrict and don’t b/p. Like a superior feeling that I’m in control enough not to eat. Then eventually I lose control and b/p.",
      "created_utc": 1658341222.0,
      "score": 16,
      "context": []
    },
    {
      "id": "igycp1w",
      "author": "asoftyam",
      "body": "Relatable for sure. I’m AN-B/P and theres a strange sense of clarity and accomplishment that comes with restriction, while the b/p cycle just feels like failure in my experience. I’ve also gotten more judgement for b/p than pure restriction, and people seem to glorify restricting while thinking b/p is disgusting and wasteful. Although people have asked me for tips on both restricting and b/ping lmao. Both sides are hell in their own ways, but b/ping sure does take a fucking huge toll on you very quickly.",
      "created_utc": 1658344142.0,
      "score": 18,
      "context": []
    },
    {
      "id": "igyu133",
      "author": "HellIsReal95",
      "body": "I'm with you on this. I went from AN to BN when I started giving in to the urges to eat.\n\nHonestly I'm happier now than when I was restricting, but the health issues have been so much worse. My front teeth are visibly wearing down, I've wasted so much money on food, and my energy levels have completely tanked.",
      "created_utc": 1658351413.0,
      "score": 12,
      "context": []
    },
    {
      "id": "igy7ctr",
      "author": "deanhipchester",
      "body": "Honestly really relatable. Bulimic stages feel so much more time consuming than my an stages.",
      "created_utc": 1658341948.0,
      "score": 10,
      "context": []
    },
    {
      "id": "igyrfwx",
      "author": "candyvalentines",
      "body": "Important to remember BMI makes no sense/has no real merit. Throw the scale away and take a break from full body mirrors! I’m bulimic and always wished I was anorexic too, its okay to feel your feelings ♥️ I am sorry you feel that way, I promise purging is not worth it & eating what you want when you want without having to throw it up, not waste money, not RUIN your teeth is so worth it.",
      "created_utc": 1658350307.0,
      "score": 10,
      "context": []
    },
    {
      "id": "igy899p",
      "author": "None",
      "body": "I know how you feel :( I went from AN-BP to BN and it’s so, so much worse. Even at my lowest I wasn’t as exhausted and just drained as I feel now.",
      "created_utc": 1658342317.0,
      "score": 8,
      "context": []
    },
    {
      "id": "igy8x0o",
      "author": "glitterhours",
      "body": "I understand. Every ED is hell, but the effects of B/P are felt harder and faster than the effects of restriction (in my experience). When I restrict, at least I’m keeping something in me and not screwing up my electrolytes. But when I B/P, all I can think about is how shitty it feels",
      "created_utc": 1658342587.0,
      "score": 8,
      "context": []
    },
    {
      "id": "igyere6",
      "author": "smoothbitch420",
      "body": "YES it’s embarrassing!!! On one hand, I’m in love with the process of gathering my binge food, setting up in the bathroom, the *relief*… but then I have saliva smeared everywhere and vomit chunks in my bangs… and I wash and repeat… for what????",
      "created_utc": 1658345006.0,
      "score": 8,
      "context": []
    },
    {
      "id": "igyy90x",
      "author": "None",
      "body": "i was diagnosed with atypical anorexia and bulimia at two separate points of my life, and truthfully speaking, both of them were immensely painful. when i was restricting to the point it was more towards consistent fasting than restriction, i was fainting, was cold all the time, had chest pains, migraines, and lost my period. with bulimia i don’t feel *as* awful but obviously i’ve had stomach ulcers and acid reflux issues, not to mention heart damage. i just had a more difficult time with the fainting and migraines.",
      "created_utc": 1658353270.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ikva1re",
      "author": "stephaniecbdj",
      "body": "bulimia feels like a failed anorexia",
      "created_utc": 1660867989.0,
      "score": 8,
      "context": []
    },
    {
      "id": "igyddm8",
      "author": "5star-my-notebook",
      "body": "I started with AN-r and after forced recovery it turned into BN. I miss being anorexic even though it almost killed me. It was easier, I was thinner, I didn’t feel like a disgusting puke monster all the time, and people were concerned in a caring way instead of a repulsed and angry way. I’ve had a fair share of health issues from both restricting and b/ping and if I had the choice to go back to AN-R I would choose it in a heartbeat.",
      "created_utc": 1658344430.0,
      "score": 12,
      "context": []
    },
    {
      "id": "igzjp3w",
      "author": "LocaKai",
      "body": "Comparing death by starvation and death by gastric rupture. They both suck and no AN is NOT better in any way , shape, or form. It's glamorized heavily, it's more painful than you could ever imagine.",
      "created_utc": 1658363252.0,
      "score": 6,
      "context": []
    },
    {
      "id": "igzr45t",
      "author": "mizerybiscuits",
      "body": "I’ve always been diagnosed as bulimic but I’ve gone through long restriction periods where I dropped tons of weight and I physically felt like shit but mentally I felt so in control. Now I’m fatter and feel so shitty all the time still, spending more money than I can afford on binge food.",
      "created_utc": 1658366655.0,
      "score": 6,
      "context": []
    },
    {
      "id": "igz3tp2",
      "author": "persimmons___",
      "body": "I've never been diagnosed but I went from constant restriction to constant b/p I know exactly what you mean",
      "created_utc": 1658355780.0,
      "score": 5,
      "context": []
    },
    {
      "id": "igyk2o8",
      "author": "None",
      "body": "My Bulima developed to Anorexia. It wasn’t great honestly. Half the time I was depressed and literally thought nothing of life. Everything was pointless to me",
      "created_utc": 1658347222.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ih0g964",
      "author": "Emmybug12",
      "body": "I've had both, and honestly I miss Anorexia... it sounds awful but I spend so much money binging and purging, and waste so much time. Anorexia I could get on with my day, but now all I think about is food, what I want, and how I'm going to get rid of it.\n\nHaven't even lose any weight since mu diagnosis changed, just gained it.",
      "created_utc": 1658379374.0,
      "score": 4,
      "context": []
    },
    {
      "id": "igz6x70",
      "author": "C4tL0v33r",
      "body": "SAMEE!! I was anorexic a year and a half ago and recently recovered December (I also had a average bmi).  I started gaining weight which is normal but I can’t help but get upset by it. Then I started binging and and feeling like shit. That’s when I started b/p. I remember always feeling mentally down when I was anorexic but it was so much easier and less work and I thought I looked great. Purging all the time is so much work and so tiring to think about but like I feel I have too. My weight keeps on yo-yoing too which is really irritating. But the cravings to binge is just too strong",
      "created_utc": 1658357213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igzbxem",
      "author": "Hungry_Bookkeeper191",
      "body": "idk i was definitely… happier before i started to purge, with only plain restriction, but also that was just before my ed got too bad so idk",
      "created_utc": 1658359585.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igzgy5u",
      "author": "None",
      "body": "finally someone said this. only people who have been through both anorexia and bulimia understand fr. i too miss when i was purely anorexic with no binge or purge just only restrict and i was at my lw too. and tbh i know this is an illusion but i was happier lowkey i felt productive and achieving even tho i was dying. now i have bulimia/an-bp im dying AND miserable and failing in everything and life and i literally wanna kms bye",
      "created_utc": 1658361970.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih08cr1",
      "author": "domb_bish",
      "body": "This post makes me feel so understood- you just explained exactly how I feel! I miss when I had anorexia and wish I could go back to it so bad, but now that I’ve gotten a taste of how good food is after restriction, I just can’t stop myself. At least with anorexia I had control over my eating😣",
      "created_utc": 1658374843.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih0v538",
      "author": "Narwhal_Songs",
      "body": "I can relate.\n\nIn 2019 my health anxiety around food (orthorexia?) got so bad that I started fasting more and more and eating less and less and started to loose a lot of weight by it.\nI was never underweight, but almost, my BMI was exactly  above the limit between \"underweight\" and \"normal\" .\n\nThere was something about this that I liked.\nI felt like I was in control somehow.\nWhich is the total opposite from bulimia where I felt i had NO control. I cant control binge eating, I cant control purging, im scared for my teeth, im dizzy, im shaky, I guilty, I gain weight, I just feel like shit all the time.\n\nAnd when you eat less you save money, binge eat and wow your wallet is not happy. I am actually in debt because of it. And I have been thrown out by friends that I have stayed with more than once for binge eating.\nIts not treated like a serious disorder, like anorexia.",
      "created_utc": 1658389950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihb804z",
      "author": "Educational-Fold-298",
      "body": "Thing is, many of you mention how restricting makes you feel better, but this is also dangerous. Speaking for myself, when I restrict, I reach a point then we’re I’m so hungry I don’t think about the expenses and time I’m gona waste cause I’m just overwhelmed by this sudden hunger that needs to be satisfied, then b/p. How can I possibly recover from this when it feels like a lifestyle now??",
      "created_utc": 1658576232.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ik3pfbq",
      "author": "sopunch",
      "body": "your concern is addressed in jennette mccurdys new memoir, you should check it out. \n\npersonally, i agree much with the “i wish i had this one instead of that”, solely because one feels like you have more control than the other. \n\nmy period of bulimia arose from me purging upwards of 5 times a day and i always felt like if i just hadn’t ate, i wouldn’t feel the need to purge and ruin my body. your urge to want to be anorexic comes from the fact that bulimia is concerningly avoidable, yet the willpower to not is so hard once it turns to addiction.",
      "created_utc": 1660375581.0,
      "score": 3,
      "context": []
    },
    {
      "id": "igz3yrn",
      "author": "Brittni318",
      "body": "i used to have anorexia then went to bulimia. everyday i wish i could restrict again.  i try then i end up in the same place. feel like it was just easier with ana",
      "created_utc": 1658355844.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ih1jiav",
      "author": "tearsunderskin",
      "body": "I have somewhat similar experience. Only that I’m not overweight because I started bulimia immediately. And now, when having bulimia, my gyn diagnosed me with anorexia, haha, earlier i probably only had atypical ana and/or unspecified ED.",
      "created_utc": 1658406849.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iotjt7j",
      "author": "butterflyLepidoptera",
      "body": "No I get you! \nI was always overweight and lost a lot of weight very quickly when I moved out. I wasn't officially diagnosed with atypical anorexia but my gp said that I'd fit the criteria (heavy resticting, overexercising, huge fear of \"unhealthy\" foods and being overweight).\nNow I gained all the weight back cuz I began to overeat a lot. I thought I was recovering on my own and that I was just relearing how to enjoy all foods. And suddenly all the weight is back, my clothes don't fit anymore, I steal food, can't stop eating even when I dislike the taste or feel sick already and I often end up with my fingers down my throat to make up for it...\nEven if it sounds horribly offensive to those struggeling with anorexia, I would love to have that fear of food again. The willpower to restrict. The motivation to exercise. And most of all, to lose weight again! I felt so much better when I was restricting heavily. Light and clean and happy...\nI wouldn't care at all if I starved myself to death! I just wanna be skinny for once. That's the only reason I haven't offed myself yet. I don't want everyone to remember me as big as I am now...",
      "created_utc": 1663435853.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ih0hd5y",
      "author": "lostinth3Abyss",
      "body": "Why do I feel like a lot of bulimics are like this :/",
      "created_utc": 1658380056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ih0k4d5",
      "author": "Becchoy",
      "body": "I totally get this, they call it Wannarexia",
      "created_utc": 1658381836.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihx82xe",
      "author": "None",
      "body": "Bulimia has been much harder for me. The way it’s impacting my teeth and my body is hard. My heart hurts, my body is weak. I was in recovery and recently relapsed and I’m already hurting again",
      "created_utc": 1658965504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijo7asl",
      "author": "Jgolf899",
      "body": "Same",
      "created_utc": 1660101470.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijq2am9",
      "author": "Dapper-Ad8945",
      "body": "Same ever since I started binging and purging i don’t feel like myself i always live in misery and food takes over my mind it’s actually insane",
      "created_utc": 1660142321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iq1r3sm",
      "author": "breathinglivingrae",
      "body": "I relate. I have the unfortunate mental loop of wishing I could be anorexic (and am bulimic).  But-- both are deadly, and both can very much kill you. In my experience, both are mental insanity that is focused on self-obsession, and trying so hard to be okay and acceptable, but using a very unhealthy means and very unhealthy rubrics of perfectionism and letting societal standards, instead of following my own path, rule  life. I wasn't ever religious, but I'm praying to become less self-obsessed so I can focus on whatever stuff I am here to do in this life, and pray that I have a body that is healthy and strong and that can enable to me to do the work I am here to do (however it may end up looking). Wishing you luck and healing on your journey <3",
      "created_utc": 1664241516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9lm708",
      "author": "None",
      "body": "Currently atyp an and honestly miss food so fucking much it makes me miss the “freedom” of bulimia, I miss eating and tasting flavours even if I had to purge, but bulimia was such a fucked roundabout that just sucked me in deeper with no “pay off, or exit”",
      "created_utc": 1700195930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "igznc6p",
      "author": "peanut-butter-blood",
      "body": "You truly can say that again. These last 2 1/2 years of intense B/P is the worst my ED has ever been, and the most miserable I’ve ever been with the disorder. I will take restriction and picky eating any day over this hell. I feel so much worse, I look worse, I’m always exhausted, I’m depressed over how much weight I’ve gained, my teeth suck, and I just wanna cry all the time because I can’t stop. It’s so frustrating feeling like I fell into something ill never get out of now that I’ve experienced what it’s like to binge and then have the option of purging to “undo” it, even while knowing it doesn’t undo it. 😞",
      "created_utc": 1658364939.0,
      "score": 17,
      "context": [
        {
          "id": "igy2sem",
          "author": "None",
          "body": "Nah I totally get how you feel. I started off with atypical AN with no purging whatsoever and then shifted to binging and purging. This is so much worse. I have no energy, feel like shit all the time, look like shit, and I’m not even losing weight.",
          "created_utc": 1658340088.0
        }
      ]
    },
    {
      "id": "igyrlru",
      "author": "candyvalentines",
      "body": "That is honestly so nice to see someone feels that way, not that I’m glad you also have digestion issues. I’m hard on myself for being bloated or having tummy issues, but always have to remember my organs are recovering!",
      "created_utc": 1658350377.0,
      "score": 14,
      "context": [
        {
          "id": "igy3kye",
          "author": "None",
          "body": "Even in recovery it's very hard to feel like my digestion will ever be normal after years of b/p. It's almost been helpful to feel like I maintain my weight better if I just sit with the consequences of a binge instead of falsely convincing myself that purging will fix anything. Purging it will just make me binge again and purge again and still gain weight.",
          "created_utc": 1658340406.0
        }
      ]
    },
    {
      "id": "ikxe2ca",
      "author": "textbookroadmapnot",
      "body": "yep! for me, I just got fatter which was completely counter intuitive and only made me worse.  I learned that I probably only brought back up a third of what I’d stuffed down, which might have been over 2000 calories, god knows. And once I knew that it made me feel more desperate and I’d be starting all over again within hours.",
      "created_utc": 1660913166.0,
      "score": 3,
      "context": [
        {
          "id": "ikva1re",
          "author": "stephaniecbdj",
          "body": "bulimia feels like a failed anorexia",
          "created_utc": 1660867989.0
        }
      ]
    },
    {
      "id": "ma63gj8",
      "author": "braindamagecore",
      "body": "I know this is old but bruh, I ALWAYS feel like this and I repeat that exact phrase when I’m purging",
      "created_utc": 1738315479.0,
      "score": 1,
      "context": [
        {
          "id": "ikva1re",
          "author": "stephaniecbdj",
          "body": "bulimia feels like a failed anorexia",
          "created_utc": 1660867989.0
        }
      ]
    },
    {
      "id": "igye3mb",
      "author": "TheRapistIsComing",
      "body": "My mom once caught me purging and was pissed at me, lecturing at me and all. Like why do people treat us with Bulimia or BED worse than Anorexics? We are all mentally ill around food in our own ways.... And both experience negative physical and mental effects from it.",
      "created_utc": 1658344734.0,
      "score": 19,
      "context": [
        {
          "id": "igyddm8",
          "author": "5star-my-notebook",
          "body": "I started with AN-r and after forced recovery it turned into BN. I miss being anorexic even though it almost killed me. It was easier, I was thinner, I didn’t feel like a disgusting puke monster all the time, and people were concerned in a caring way instead of a repulsed and angry way. I’ve had a fair share of health issues from both restricting and b/ping and if I had the choice to go back to AN-R I would choose it in a heartbeat.",
          "created_utc": 1658344430.0
        }
      ]
    },
    {
      "id": "igz3yq8",
      "author": "persimmons___",
      "body": "Also probably not the most important factor but still quite horrible bulimia is so much worst for your wallet I blew so much money on binges 😭",
      "created_utc": 1658355844.0,
      "score": 9,
      "context": [
        {
          "id": "igz3tp2",
          "author": "persimmons___",
          "body": "I've never been diagnosed but I went from constant restriction to constant b/p I know exactly what you mean",
          "created_utc": 1658355780.0
        }
      ]
    },
    {
      "id": "k9lnl7o",
      "author": "None",
      "body": "The best thing about when I was stuck in bulimia is I wanted to stop alot more desperately than I do with atyp an",
      "created_utc": 1700196717.0,
      "score": 1,
      "context": [
        {
          "id": "iq1r3sm",
          "author": "breathinglivingrae",
          "body": "I relate. I have the unfortunate mental loop of wishing I could be anorexic (and am bulimic).  But-- both are deadly, and both can very much kill you. In my experience, both are mental insanity that is focused on self-obsession, and trying so hard to be okay and acceptable, but using a very unhealthy means and very unhealthy rubrics of perfectionism and letting societal standards, instead of following my own path, rule  life. I wasn't ever religious, but I'm praying to become less self-obsessed so I can focus on whatever stuff I am here to do in this life, and pray that I have a body that is healthy and strong and that can enable to me to do the work I am here to do (however it may end up looking). Wishing you luck and healing on your journey <3",
          "created_utc": 1664241516.0
        }
      ]
    },
    {
      "id": "igznuz8",
      "author": "peanut-butter-blood",
      "body": "Bulimia is also just so damn time consuming and expensive! Yeah, my safe foods were pricy, but I ate less of them. Now I power through weeks worth of food in a day or so. Factor in all the binge time, and then all the time spent purging. Sometimes I fall into a late night binge and I’m up til like 2:30 in the bathroom. Restriction was never like this.",
      "created_utc": 1658365180.0,
      "score": 17,
      "context": [
        {
          "id": "igy2sem",
          "author": "None",
          "body": "Nah I totally get how you feel. I started off with atypical AN with no purging whatsoever and then shifted to binging and purging. This is so much worse. I have no energy, feel like shit all the time, look like shit, and I’m not even losing weight.",
          "created_utc": 1658340088.0
        },
        {
          "id": "igznc6p",
          "author": "peanut-butter-blood",
          "body": "You truly can say that again. These last 2 1/2 years of intense B/P is the worst my ED has ever been, and the most miserable I’ve ever been with the disorder. I will take restriction and picky eating any day over this hell. I feel so much worse, I look worse, I’m always exhausted, I’m depressed over how much weight I’ve gained, my teeth suck, and I just wanna cry all the time because I can’t stop. It’s so frustrating feeling like I fell into something ill never get out of now that I’ve experienced what it’s like to binge and then have the option of purging to “undo” it, even while knowing it doesn’t undo it. 😞",
          "created_utc": 1658364939.0
        }
      ]
    },
    {
      "id": "ih0udtg",
      "author": "Narwhal_Songs",
      "body": "I was actually thrown out by roomates for binge eating...\n\nPeople truly do not understand it \n\nThey do not understand that its often a loss of control and you cant just tell a binge eater to not do it",
      "created_utc": 1658389352.0,
      "score": 4,
      "context": [
        {
          "id": "igyddm8",
          "author": "5star-my-notebook",
          "body": "I started with AN-r and after forced recovery it turned into BN. I miss being anorexic even though it almost killed me. It was easier, I was thinner, I didn’t feel like a disgusting puke monster all the time, and people were concerned in a caring way instead of a repulsed and angry way. I’ve had a fair share of health issues from both restricting and b/ping and if I had the choice to go back to AN-R I would choose it in a heartbeat.",
          "created_utc": 1658344430.0
        },
        {
          "id": "igye3mb",
          "author": "TheRapistIsComing",
          "body": "My mom once caught me purging and was pissed at me, lecturing at me and all. Like why do people treat us with Bulimia or BED worse than Anorexics? We are all mentally ill around food in our own ways.... And both experience negative physical and mental effects from it.",
          "created_utc": 1658344734.0
        }
      ]
    }
  ]
}