{
  "id": "w7037m",
  "subreddit": "bulimia",
  "author": "ThrowawayAcct7868",
  "created_utc": 1658681547.0,
  "title": "I’m purging to relieve stress",
  "selftext": "I noticed that whenever I’m stressed out, I feel like purging even when I haven’t eaten much/anything. I just ate a couple of slices of pineapple, and I feel like purging because I’m nervous (not related to losing weight). I’m scared that this is like a coping mechanism now, how do I break it?",
  "url": "https://www.reddit.com/r/bulimia/comments/w7037m/im_purging_to_relieve_stress/",
  "score": 71,
  "num_comments": 12,
  "comments": [
    {
      "id": "ihh3new",
      "author": "midaugust-blues",
      "body": "i do this too, especially as a form of self harm. i wish i had more helpful advice for you, but just distracting yourself and/or doing calming activities can help a lot",
      "created_utc": 1658685479.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ihh55wu",
      "author": "Over-Application1502",
      "body": "i 100% do this too. ive even convinced myself and my bf/friends/whoever i’m with that “i know if i vomit i’ll feel better.” but i’ve been working rly hard to not do that bc ik thats not always the case. when im feeling this way i try to drink water, slowly. if i chug it or drink it too quickly it could trigger me. i also like to put cold rags on my neck and forehead (helps sooo much) and lay down and try to distract myself with tv, mostly cartoons. just even telling someone that im feeling anxious helps me also. music could possibly help as well!",
      "created_utc": 1658686108.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ihj14ph",
      "author": "Foureyedlemon",
      "body": "It is a coping mechanism! Purging is something youve done to get rid of negative feelings. Once your body realizes it has a shortcut to relieving anxiety, its going to keep pushing that button. Our monkey brains love that stuff haha. I dont have advice just completely understandable and its advantagous that you can recognize it as such!",
      "created_utc": 1658716229.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ihh19u8",
      "author": "Gazorpazorpfnfieldbi",
      "body": "Acknowledging it helps! I realized I do the same thing. When I feel the desire, I drink water and try to distract myself.",
      "created_utc": 1658684498.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ihjsi26",
      "author": "Division-41",
      "body": "Vomiting happens when people get anxious too, so this is not abnormal. However, I do think you should talk to somebody about this because this isn’t a habit that is very good. Look after yourself <3",
      "created_utc": 1658732884.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihhro1m",
      "author": "Various-List",
      "body": "You’re not crazy. Vomiting releases endorphins which is why it’s so hard to stop once it becomes habitual. Connecting your urge to times of stress is great because you may be able to ward it off with other activities that give a rush such as quick vigorous exercise, (safe) sexual activity, or something else.",
      "created_utc": 1658695593.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ihkjdwq",
      "author": "BlankDoe",
      "body": "I do the same thing, i tell myself it's better than cutting. But sh is sh at the end of the day i suppose",
      "created_utc": 1658752444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihkr2xp",
      "author": "Material-Bat-44",
      "body": "My history of bulimia was because of anxiety and stress, I would purge for no reason with little or nothing in my tummy just because I thought purging would help relieve my anxiety or nervousness.  \nI took therapy to relieve my stress and anxiety and realised that purging is so bad for me, I would recommend trying therapy if you can.",
      "created_utc": 1658756236.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihm498v",
      "author": "MarieCaymus",
      "body": "For me I realized it was because it made me so tired I didn’t have the energy to be as anxious. I’m certainly not perfect at it but I have noticed that exercise definitely serves a similar function.\n\nThe feeling after you puke and the feeling after a 15 minute run are pretty similar",
      "created_utc": 1658775603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihh6ur6",
      "author": "None",
      "body": "I can totally relate to this. When I’m stressed sometimes I’ll just drink water and purge that. I’ve been trying healthier coping skills lately like writing and it’s been helping me.",
      "created_utc": 1658686826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iykbo4i",
      "author": "Bluebelle0325",
      "body": "Me 🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️ My issue seems to be that I will eat a bunch of candy/ice cream or other trigger foods and then feel so guilty for using the binge to cope that I purge",
      "created_utc": 1669942550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ihk73u8",
      "author": "SweetPotat03",
      "body": "Was not aware of that it released endorphins. This explains so much.",
      "created_utc": 1658744750.0,
      "score": 2,
      "context": [
        {
          "id": "ihhro1m",
          "author": "Various-List",
          "body": "You’re not crazy. Vomiting releases endorphins which is why it’s so hard to stop once it becomes habitual. Connecting your urge to times of stress is great because you may be able to ward it off with other activities that give a rush such as quick vigorous exercise, (safe) sexual activity, or something else.",
          "created_utc": 1658695593.0
        }
      ]
    }
  ]
}