{
  "id": "w7mq57",
  "subreddit": "bulimia",
  "author": "Zealousideal-Light99",
  "created_utc": 1658749256.0,
  "title": "What are the Bad side effects of bullimia?",
  "selftext": "I’ve noticed the only thing that remotely stops me from purging are the potential side effects . I’m aware of the malnutrition as well as damaged teeth and sore throat , are there any others? I need more reasons to recover :/",
  "url": "https://www.reddit.com/r/bulimia/comments/w7mq57/what_are_the_bad_side_effects_of_bullimia/",
  "score": 66,
  "num_comments": 63,
  "comments": [
    {
      "id": "ihkep24",
      "author": "onryos",
      "body": "Electrolyte imbalances are pretty much guaranteed, which ends with a heart attack, or seizures",
      "created_utc": 1658749814.0,
      "score": 62,
      "context": []
    },
    {
      "id": "ihkkjd0",
      "author": "kittyoats",
      "body": "\nFrom my experience I’ve experienced dehydration, chest pain, jaw pain, diminished gag reflex, almost blacking out, chocking on food/vomit, bloating, cramping, constipation, sores around my mouth, bloated face, sores along my knuckles, nose bleeds, bursted vessels in my eye, acid reflux, and it’s gotten to the point where I sometimes just have vomit come up.\nPlease stop if you can! I know it’s hard and addictive but it’s not worth it and if I had the willpower and if life was better I’d stop.",
      "created_utc": 1658753058.0,
      "score": 57,
      "context": []
    },
    {
      "id": "ihl8vfz",
      "author": "lemon--wedges",
      "body": "I’ve got some lesser known ones for you. Bulimic of 17 years.\n\n1) [hiatal hernia](https://www.mayoclinic.org/diseases-conditions/hiatal-hernia/symptoms-causes/syc-20373379?utm_source=Google&utm_medium=abstract&utm_content=Hiatal-hernia&utm_campaign=Knowledge-panel), which is where your stomach pushes through the diaphragm, can cause food and stomach acid to push back into your esophagus. Severe ones require surgery.\n\n2) my digestive system is FUCKED. It takes way too long to digest my food now- like, food will stay in my stomach for hours longer than it’s supposed to. Every. Single. Time. I eat, I get gas and stomach cramps. Literally every time. It’s uncomfortable and embarrassing af in public, so I always try to be alone after I eat. \n\n3) I have a permanent bump on the hand I use to purge with. Like, under my skin, on my bone. I had a scar there for years until I learned to purge without hitting it, but the bump has remained.\n\n4) sometimes I’ll hiccup and just like.. slightly vomit into my mouth a bit. I carry gum for this reason. Nothing like surprise puke breath.\n\n5) random constipation and bloating. Even if I’m eating enough that I should be going regularly (like, a massive salad), my body will sometimes decide to just.. not go for a few days. It’s really uncomfortable.\n\n6) heart arrhythmia, which scares the shit out of me. For no apparent reason (like, I’m taking vitamin supplements, electrolytes, drinking a shot ton of water), my heart will start messing up. It will suddenly race (~130 bpm), or I’ll have double beats (normal heart rate, but every other beat will be double), or it will skip beats or have random super weak, fluttery beats. It’s super scary when it happens, and everything feels intensely wrong.\n\n7) vitamin deficiencies. I have to keep really on top of my vitamins, and I’m aware of all the specific symptoms for particular vitamins. For instance: I recently developed cracks in the corners of my mouth, which was from a lack of B-vitamins. \n\n8) edema. You want sudden swelling of your ankles, toes, and fingers? You got it. Let’s go, body dysmorphia. \n\n9) you know what’s not fun? Insomnia. You know what bulimia can cause? Insomnia.\n\n10) I know people have said enamel erosion, but with this comes cavities and putting of your teeth, which are super scary.\n\n11) not a physical side effect, but MONEY. Bulimia is fucking expensive, especially with the price of food now. I’ve recently mostly recovered from bulimia (straight into mild restriction, good job brain), and I calculated it out. I was spending about $800+ every month on food. \n\n12) weight gain. If you binge eat, you’re not going to get it all out. You can’t estimate how much you’ve kept down. Just by fixing my bulimia, I’ve gone from overweight back to a normal weight.\n\n13) you’re constantly hungry. Your stomach is stretched out. I was preoccupied with food, so all I could think about was eating ALL THE TIME. I was so, so hungry.\n\n14) this might be just me, but binging made me have a complete lack of control in other areas. I binge drank (a handle of vodka about every week). I didn’t study or work (which is very unlike me. I lived for when I could binge.\n\n15) depression. I felt out of control of my life. I felt disgusting. I was tired all the time, and had no motivation or care to do anything. \n\nBulimia is so, so horrible.",
      "created_utc": 1658763658.0,
      "score": 51,
      "context": []
    },
    {
      "id": "ihl4idg",
      "author": "None",
      "body": "I can’t digest food like normal people because I have been purging almost every day for years. I also have water retention, constipation, heartburn, low blood pressure. \n\nI also can’t save money because I use my money to buy binging food and purge it \n\nMy family think I am odd and a problem because I keep wasting money and avoid dinner \n\nI lose friends, because I avoided any gatherings, my brain had occupied by the thoughts of binging and buying food and purging. I can’t join conversation because my life is mainly binging and binging\n\nYou will also feel an extreme emptiness from b/p, physically and mentally.",
      "created_utc": 1658761932.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ihkhvhz",
      "author": "None",
      "body": "Death is a pretty bad side effect. EDs' have the highest mortality rate of all mental illnesses.",
      "created_utc": 1658751624.0,
      "score": 57,
      "context": []
    },
    {
      "id": "ihkei2s",
      "author": "cow__lick",
      "body": "When i purge my chest hurts (possibly heartburn?) and i often get belly pains… the thought that this will eventually exacerbate keeps me from b/ping sometimes.",
      "created_utc": 1658749702.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ihks922",
      "author": "GrimReaperScythe",
      "body": "On top of what everyone else mentioned, my TEETH!! They are in such poor condition. My gums are sometimes swollen and aches while my teeth sometimes feel like they might fall apart. \n\nMy nails and hair are brittle too I can’t even make an effort to look nice anymore because my hair falls if I try doing anything to it and my nails break if I pain them or grow them. I’ve cried myself to sleep cuz of teeth/gum health tho.",
      "created_utc": 1658756766.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ihm4vz2",
      "author": "jnseel",
      "body": "Hi, I’m a nurse with a personal history of both anorexia and bulimia. I knew it was bad when my ED was active (before becoming a nurse as an adult), but I didn’t realize how bad: \n\n1. Stomach acid will rot your teeth. Doesn’t matter if you brush right away, stomach acid is SO acidic that even a minute of contact between purging and brushing is enough to do damage. This becomes painful and EXPENSIVE to combat and recover from. I’ve known several bulimic or recovering bulimic patients who have to have major jaw surgeries, dental implants, and even dentures, as young as their 20s. \n\n2. Constant exposure to hydrochloric acid (stomach acid) causes sores and chemical burns to your esophagus and mouth. Long, long term exposure has been linked to mouth, jaw, and esophageal cancers. Let me put it to you this way: if you put a dead body in a vat of hydrochloric acid, it would dissolve completely. The same is true for a live body. \n\n3. Binging is not an issue of portion control. It’s a mental response of overcompensation for something else in your life. Doing so can disregulate your brain. \n\n4. Electrolyte imbalance. This seems like NBD at face value, but electrolytes (sodium, potassium, magnesium, calcium) are important for body function such as: nerve conduction (allowing your brain to talk to your body), muscle contraction (keep your heart/lungs pumping), maintaining fluid balance (keeping you 70% water or whatever), regulate blood pressure (so you don’t damage important organs like brain and kidneys), allow intracellular transfer…the list goes on and on. It’s super duper important to keep electrolytes in check. \n\n5. Your GI tract gets fucked when it doesn’t get used regularly and appropriately - meaning you can lose the ability to poop without intervention (like an ostomy pouch or shitload of laxatives), too much forced vomiting can make it difficult to keep food down *even when you want to*. It has a rhythm all its own, and messing with that rhythm can have permanent effects. \n\nEating disorders are the **most fatal of all mental health disorders**,* with the vast majority of its victims being under the age of 40. EDs are no small matter. I hope OP has access to support and can develop the skills to recover. Please find some help. \n\n*most fatal mental health disorder without external forces (ie, suicide and substance abuse disorder)\n\n[National Eating Disorder Association](https://www.nationaleatingdisorders.org)\n\n[ED Help Guide](https://www.helpguide.org/articles/eating-disorders/eating-disorder-treatment-and-recovery.htm)",
      "created_utc": 1658775848.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ihm8yrq",
      "author": "ConferenceTraining19",
      "body": "I’m gonna read this thread everyday.",
      "created_utc": 1658777410.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ihkuykc",
      "author": "sixteenhounds",
      "body": "puffy face, electrolyte imbalance, scary chest pain, headaches, weakness, burst blood vessels in eyes and face, mouth sores, the driest skin i’ve ever had in my fucking life, and a bathroom that feels disgusting no matter how much you clean it.",
      "created_utc": 1658757960.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ihl5etl",
      "author": "MatterImpressive9811",
      "body": "It really screws up you metabolism and hunger signals, which obviously is not as serious as electrolyte imbalance and risk of heart attacks but as someone who (presumably) has a preoccupation with your body, it’s a good reminder that it probably won’t help you lose weight in the long run",
      "created_utc": 1658762299.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ihkw9od",
      "author": "turnipkitty112",
      "body": "Oh boy there are a lot of potential side effects… damaged knuckles, nosebleeds or even sinus infections, GERD (chronic acid reflux), other stomach issues such as gastritis, ulcers, gastroparesis, Barrett’s esophagus, esophageal cancer, Mallory-Weiss tears (tears in your esophagus), stomach or esophageal rupture (this is often fatal), in addition to tooth damage there could also be sores in your mouth or damage to the gums, dehydration, electrolyte imbalances leading to heart attacks, chest pain, arrhythmias, type 2 diabetes, high or low blood pressure, dizziness and fainting, hair loss, brittle nails, nutrient deficiencies such as iron deficiency anemia, and seizures (I’ve had a seizure from purging and it was TERRIFYING). Some of these are relatively mild but a lot of them are very serious - you can end up with lifelong chronic health problems or you can die suddenly.",
      "created_utc": 1658758528.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ihkkrs0",
      "author": "AgreeableMoose",
      "body": "Divorce, losing friends, trust, poor exchanges on top of all the physical issues.",
      "created_utc": 1658753179.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ihmfo4h",
      "author": "blkpepr",
      "body": "All the physical things previously mentioned, plus the impact on your loved ones/friends. If it's still a secret, know that someone will find out. \n\nFor me, the paranoia was huge. Always fearing if the bathroom smelled. If I flushed all the way, if my eyes were red, my fingers scarred or I choked, or my stomach burst.\n\nThe toilet bowl was always getting moldy if I didn't clean with bleach after purging. \n\nNot to mention, clogged and eroded pipes! If you own your own home, this will be hella expensive and mortifying! Imagine your sewer line breaking spilling tears of cached in puke and poop.",
      "created_utc": 1658779961.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ihkjzxg",
      "author": "user_112233445",
      "body": "seizures, brain fog, messed up digestion, falling hair",
      "created_utc": 1658752773.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ihkup5c",
      "author": "junkkoftheheart",
      "body": "I don’t have the best understanding of this but when you purge you lose a lot of electrolytes which are crucial for maintaining the electrical conduction system in your heart. If you have an imbalance of these electrolytes it can screw with your heart beating. Pretty scary.",
      "created_utc": 1658757845.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ihmqv73",
      "author": "zingydingy",
      "body": "i have had bulimia for 4 years and i cant bend down and tie my shoes without having bile flood up my eosphagus into my mouth because my sphincter function is so diminished from regular purging. i stopped having periods from the hormonal imbalance and have heart palpitations regularly.",
      "created_utc": 1658784199.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ihox2kt",
      "author": "CallMeSwissMiss",
      "body": "I fucked up my stomach forever.Have a bad acid reflux because of it. Somehow developed migraine in my bulemic time as well. My stomach can't process stuff right anymore, so I have to get monthly shots. Low blood pressure and still passing out occasionaly.\n\n&#x200B;\n\nFor the love of god, try to stop while you dont have all this damage. I wish I could go back in time and save myself.",
      "created_utc": 1658825240.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ihl7u21",
      "author": "Lumplebee",
      "body": "I have to get my gallbladder removed because it’s rotting away inside my body from losing too much weight too fast too many times. Hurts like hell and so many doctors will refuse to take it out until youve suffered with it for years.",
      "created_utc": 1658763254.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ihlesb2",
      "author": "0hwelll",
      "body": "Acid burns on your mouth and throat, gum disease, haemorrhoids, bruises and bite marks on my hands and rists, horrible acne/rashes around my mouth, the passing out, just to make a few",
      "created_utc": 1658765926.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ihlg1ig",
      "author": "Working_Nectarine_52",
      "body": "Gastritis, derealisation, vision issues and migraines. All of them directly related to my bulimia.",
      "created_utc": 1658766402.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ihmeu8h",
      "author": "FancyLikeNancy",
      "body": "I feel like it destroyed my life. If you are doing binge eating and then purge believe me is like a carousel that swings around In hell very fast and you can’t get off of it. You binge that fuck out of food some nights and because your body is so tired you are sleeping forgetting to vomit and you wake up the next day feeling 100 kilos more and then it brings you much more depression than before. Your bathroom is a mess and you don’t care. Your teeth are getting worse and worse, chest pains, headaches, the worst for me was insomnia.Your body is really getting tired, you don’t have energy to wake up from the bed. For me it’s like a drug that you are addicted to it and it ruins your life. I was off my balance then on my balance for only 1 day and then back again to purging. Also it makes you spending all of your money almost on cravings. Everytime you say ok I am gonna buy this purge it and is gonna be the last time. But everyday is the same sentence. Last time I purged was on last Tuesday and today is Monday is gonna be almost a week without it. I am doing a challenge where I won’t do anything and keep continue having a healthy lifestyle and weight my self on 15th of august to see what happens. I never done it so far without purging. It’s really a dark place bulimia. Because you have eating disorders, problems with how you look and you say ok food makes me feel better but I won’t gain weight because it will go away. But sometimes you lose weight but if you are a bulimic person you can’t lose weight in healthy way and never gain them back. I am not that super obese, I fit very comfortably in size L and I am about to enter M now if you see me you won’t realize it I do it but I think I lost and put 100 kilos cause everyday you lose a kilo later you put another 2 back is a nightmare. \nI didn’t see anybody write the thing I had. At some point my body doesn’t “answer” to my bulimic acts. I tried as hard as possible to make food come out but it’s like my body is blocking and I can’t do anything and I am really panicking. I really want to stay away from it as much as possible and I am really sending my love to anybody who is going through it. Is really difficult disorder and you are a hero if you are coming out of it just like that. And if you are reading that and you are still purging please believe in yourself. The line between the healthy lifestyle and bulimia/purging is very thin. Is very hard to do the step but please put all your power in. You don’t deserve to live like that.\nI love you a lot all of you who are going through this. My dms are open if someone needs to talk ❤️🙏🏻",
      "created_utc": 1658779644.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ihnvczf",
      "author": "ifwewerekids",
      "body": "Everything already listed, also I’m a singer and I lost my singing voice from it on and off which was awful.",
      "created_utc": 1658801641.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kfuch8b",
      "author": "sk8_the_infinity",
      "body": "-Little to no stamina. I can't do anything without feeling like I'll collapse the next minute. \n\n--When you start recovering (I am now) you will gain back all the weight and your digestive system won't work well. Your metabolism will be 3x slower. You'll often get constipated and bloated.\n\n-High or low blood pressure.\n\n-Acid reflux. The stomach cramps you'll have will be as a result of acid reflux. And you'll get tired easily.\n\n-Insomnia\n\n-Iron deficiency and nutrient deficiency.\n\n-Pale and dry skin\n\n-sore throat. You won't be able to eat certain things because of it. I can't eat yoghurt cause it burns my throat so bad.\n\nI regret the damage I did to my body. The long time damage is not worth it. Take care of your body. I would do anything to have my healthier fat body back.",
      "created_utc": 1704123915.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ihmjcef",
      "author": "lonelyc0rpse",
      "body": "swelling (if u purge regularly, u are surely swollen), electrolyte imbalances which cause heart problems, dry skin, brittle hair and nails if u don't take vitamins, heartburn, low blood pressure. also u can die due to ur stomach rupturing. mood swings due to hormonal imbalances. \n\nif u purge enough, u can stretch ur esophageal sphincter, which means that anything in ur stomach will fall out whenever u bend over (this will also cause bad heart burn when u lay down). this can only be fixed with surgery. u can also develop esophageal cancer :/",
      "created_utc": 1658781340.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ihl04wh",
      "author": "None",
      "body": "G I issues \nTeeth with no enamel \nNo nutrients \nNo glowing skin \nYou actually end up bigger because you think you can eat more without gaining when really not all come up \nLow white blood cells high red blood cells \nSwollen chipmunk cheeks \nHeart arythmia\nStretching out your gut \nDeath",
      "created_utc": 1658760145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihlhi91",
      "author": "Tiny_emile_2",
      "body": "I always get super painful heart palpitations and my voice is scratchy not to mention all the mucus and blood a cough up",
      "created_utc": 1658766960.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihltt1b",
      "author": "birdseedforall",
      "body": "organ failure. purging causes a lot of heart strain, mostly while heaving. Your vocal chords probably won’t be the same so if you’re a singer or at least proud of your voice then be cautious about that.",
      "created_utc": 1658771605.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihmekti",
      "author": "mizerybiscuits",
      "body": "Digestive problems, trying to recover, haven’t purged in a couple weeks. Still can’t keep food down sometimes cause my stomach just sends it back up",
      "created_utc": 1658779544.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihmpf9z",
      "author": "vbgirl24",
      "body": "Face super bloated and round + jaw hurts + yellow teeth",
      "created_utc": 1658783635.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihnyi2a",
      "author": "Ok-Message9359",
      "body": "The worst in my experience are choking on my vomit (felt like I was going to die), blood vessels popping in my face (I looked like I had ugly red freckles for about a week), awful enamel erosion (so many food sensibilities and transparent teeth now), and bloated lymph nodes and face (really did look like a chipmunk)",
      "created_utc": 1658803071.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lw0d813",
      "author": "Frequent_Company3868",
      "body": "I am experiencing mouth sores constantly. My whole tongue burns when I try and eat anything.",
      "created_utc": 1731032046.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihkq6no",
      "author": "The_Conscious_Saffa",
      "body": "Moonface\nElectrolyte imbalances\nVery obvious weight fluctuations for me",
      "created_utc": 1658755824.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihle5ub",
      "author": "_typhoid_mary",
      "body": "Puffy face babey",
      "created_utc": 1658765687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihmp02g",
      "author": "fakesk8r",
      "body": "My teeth/gums are fucked. Also I have lasting health conditions like acid reflux and possibly a hernia ? The one I’m most terrified of happening is a “Mallory-weiss tear” \nAlso terrified heart attacks",
      "created_utc": 1658783466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihn3ojd",
      "author": "SativaSunChild",
      "body": "My teeth are fucked. They hurt everyday, they are broken and I can’t afford to fix them. My stomach issues/acid bother me every day. I’m only 20 years old and pretty much recovered now, and I have these issues I never would have imagined.",
      "created_utc": 1658789412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ihnwz6l",
      "author": "Musicknowsnobounds",
      "body": "Your digestive system gets really fucked up. It's not fun",
      "created_utc": 1658802369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ii5zwtx",
      "author": "None",
      "body": "Well somehow my teeth are fine. I also rarely need to use my fingers. I think it's because I ate so much during binges that I felt sick anyway and rarely purged to the point of acidity.\n\nSo,  exhaustion, so much chronic exhaustion, vitamin deficiencies, being scared my stomach would explode, dry eyes, constant dehydration, puffy cheeks, even puffy checks in recovery, excessive stomach acidity when I slowed down, my body was ready for all that food.\n\nAlso not body related but, the amount of money you waste, the amount of social activities you have to simply avoid, being to exhausted to put your time to better use, filthy car, so many dishes, pity looks from regular supermarket staff, being told you smell like vomit, possible toilet blockage once in a while. Plumbers aren't cheap.",
      "created_utc": 1659122511.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krmcak3",
      "author": "Logical-Western149",
      "body": "Yellowed teeth, constipation up to a week, BLOATED 24/7 UGH and also probably gastritis :))) Heartburn, rib ache , low self esteem and probably everything bad. Sounded like a great idea for one month, after that became an addiction",
      "created_utc": 1708616546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kweyytj",
      "author": "Lexasreddit",
      "body": "Dying",
      "created_utc": 1711325141.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lojz75f",
      "author": "Strain-Defiant",
      "body": "is puking once or twice a month bad?",
      "created_utc": 1727111973.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz79wkj",
      "author": "Salt___77",
      "body": "anyone else got acne on top of the side effects?????? cuz i swear i did when it got really bad and i started doing it everyday",
      "created_utc": 1732686484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ihkewb4",
      "author": "onryos",
      "body": "+ if you purge for long enough and a lot of things, your stomach will stop digesting things properly. I know I quite a few bulimics who have developed gastroparisis from purging too frequently, for long enough periods",
      "created_utc": 1658749930.0,
      "score": 30,
      "context": [
        {
          "id": "ihkep24",
          "author": "onryos",
          "body": "Electrolyte imbalances are pretty much guaranteed, which ends with a heart attack, or seizures",
          "created_utc": 1658749814.0
        }
      ]
    },
    {
      "id": "iho2bpt",
      "author": "dropshotftw",
      "body": "the reflux has been an unwelcome surprise now. especially when eating anything even kinda spicy. also alcohol hurts like hell to go on",
      "created_utc": 1658804881.0,
      "score": 6,
      "context": [
        {
          "id": "ihkkjd0",
          "author": "kittyoats",
          "body": "\nFrom my experience I’ve experienced dehydration, chest pain, jaw pain, diminished gag reflex, almost blacking out, chocking on food/vomit, bloating, cramping, constipation, sores around my mouth, bloated face, sores along my knuckles, nose bleeds, bursted vessels in my eye, acid reflux, and it’s gotten to the point where I sometimes just have vomit come up.\nPlease stop if you can! I know it’s hard and addictive but it’s not worth it and if I had the willpower and if life was better I’d stop.",
          "created_utc": 1658753058.0
        }
      ]
    },
    {
      "id": "ihnafv5",
      "author": "Whatthedarknessdoes",
      "body": "Yep all these things",
      "created_utc": 1658792335.0,
      "score": 1,
      "context": [
        {
          "id": "ihkkjd0",
          "author": "kittyoats",
          "body": "\nFrom my experience I’ve experienced dehydration, chest pain, jaw pain, diminished gag reflex, almost blacking out, chocking on food/vomit, bloating, cramping, constipation, sores around my mouth, bloated face, sores along my knuckles, nose bleeds, bursted vessels in my eye, acid reflux, and it’s gotten to the point where I sometimes just have vomit come up.\nPlease stop if you can! I know it’s hard and addictive but it’s not worth it and if I had the willpower and if life was better I’d stop.",
          "created_utc": 1658753058.0
        }
      ]
    },
    {
      "id": "lwu5jba",
      "author": "Desperate_Fault3506",
      "body": "bro number 4 is so......I hate it omg",
      "created_utc": 1731457042.0,
      "score": 1,
      "context": [
        {
          "id": "ihl8vfz",
          "author": "lemon--wedges",
          "body": "I’ve got some lesser known ones for you. Bulimic of 17 years.\n\n1) [hiatal hernia](https://www.mayoclinic.org/diseases-conditions/hiatal-hernia/symptoms-causes/syc-20373379?utm_source=Google&utm_medium=abstract&utm_content=Hiatal-hernia&utm_campaign=Knowledge-panel), which is where your stomach pushes through the diaphragm, can cause food and stomach acid to push back into your esophagus. Severe ones require surgery.\n\n2) my digestive system is FUCKED. It takes way too long to digest my food now- like, food will stay in my stomach for hours longer than it’s supposed to. Every. Single. Time. I eat, I get gas and stomach cramps. Literally every time. It’s uncomfortable and embarrassing af in public, so I always try to be alone after I eat. \n\n3) I have a permanent bump on the hand I use to purge with. Like, under my skin, on my bone. I had a scar there for years until I learned to purge without hitting it, but the bump has remained.\n\n4) sometimes I’ll hiccup and just like.. slightly vomit into my mouth a bit. I carry gum for this reason. Nothing like surprise puke breath.\n\n5) random constipation and bloating. Even if I’m eating enough that I should be going regularly (like, a massive salad), my body will sometimes decide to just.. not go for a few days. It’s really uncomfortable.\n\n6) heart arrhythmia, which scares the shit out of me. For no apparent reason (like, I’m taking vitamin supplements, electrolytes, drinking a shot ton of water), my heart will start messing up. It will suddenly race (~130 bpm), or I’ll have double beats (normal heart rate, but every other beat will be double), or it will skip beats or have random super weak, fluttery beats. It’s super scary when it happens, and everything feels intensely wrong.\n\n7) vitamin deficiencies. I have to keep really on top of my vitamins, and I’m aware of all the specific symptoms for particular vitamins. For instance: I recently developed cracks in the corners of my mouth, which was from a lack of B-vitamins. \n\n8) edema. You want sudden swelling of your ankles, toes, and fingers? You got it. Let’s go, body dysmorphia. \n\n9) you know what’s not fun? Insomnia. You know what bulimia can cause? Insomnia.\n\n10) I know people have said enamel erosion, but with this comes cavities and putting of your teeth, which are super scary.\n\n11) not a physical side effect, but MONEY. Bulimia is fucking expensive, especially with the price of food now. I’ve recently mostly recovered from bulimia (straight into mild restriction, good job brain), and I calculated it out. I was spending about $800+ every month on food. \n\n12) weight gain. If you binge eat, you’re not going to get it all out. You can’t estimate how much you’ve kept down. Just by fixing my bulimia, I’ve gone from overweight back to a normal weight.\n\n13) you’re constantly hungry. Your stomach is stretched out. I was preoccupied with food, so all I could think about was eating ALL THE TIME. I was so, so hungry.\n\n14) this might be just me, but binging made me have a complete lack of control in other areas. I binge drank (a handle of vodka about every week). I didn’t study or work (which is very unlike me. I lived for when I could binge.\n\n15) depression. I felt out of control of my life. I felt disgusting. I was tired all the time, and had no motivation or care to do anything. \n\nBulimia is so, so horrible.",
          "created_utc": 1658763658.0
        }
      ]
    },
    {
      "id": "ihnwzqj",
      "author": "Loopyloolauren",
      "body": "You’re valued and you deserve to love yourself, and you deserve to take good care of yourself.",
      "created_utc": 1658802376.0,
      "score": 13,
      "context": [
        {
          "id": "ihl4idg",
          "author": "None",
          "body": "I can’t digest food like normal people because I have been purging almost every day for years. I also have water retention, constipation, heartburn, low blood pressure. \n\nI also can’t save money because I use my money to buy binging food and purge it \n\nMy family think I am odd and a problem because I keep wasting money and avoid dinner \n\nI lose friends, because I avoided any gatherings, my brain had occupied by the thoughts of binging and buying food and purging. I can’t join conversation because my life is mainly binging and binging\n\nYou will also feel an extreme emptiness from b/p, physically and mentally.",
          "created_utc": 1658761932.0
        }
      ]
    },
    {
      "id": "ihnj4uu",
      "author": "JellyCharacter1653",
      "body": "Bulimia not so much like yes ppl have died from bulimia but no so much as anorexia",
      "created_utc": 1658796202.0,
      "score": -6,
      "context": [
        {
          "id": "ihkhvhz",
          "author": "None",
          "body": "Death is a pretty bad side effect. EDs' have the highest mortality rate of all mental illnesses.",
          "created_utc": 1658751624.0
        }
      ]
    },
    {
      "id": "ihklbg2",
      "author": "kasialis721",
      "body": "if its leftish side GO SEE A DOCTOR thats your heart and heart pains usually mean something wrong",
      "created_utc": 1658753457.0,
      "score": 8,
      "context": [
        {
          "id": "ihkei2s",
          "author": "cow__lick",
          "body": "When i purge my chest hurts (possibly heartburn?) and i often get belly pains… the thought that this will eventually exacerbate keeps me from b/ping sometimes.",
          "created_utc": 1658749702.0
        }
      ]
    },
    {
      "id": "ii609my",
      "author": "None",
      "body": "Where did you learn point three I feel like sending it to my estranged for good reason mother",
      "created_utc": 1659122653.0,
      "score": 1,
      "context": [
        {
          "id": "ihm4vz2",
          "author": "jnseel",
          "body": "Hi, I’m a nurse with a personal history of both anorexia and bulimia. I knew it was bad when my ED was active (before becoming a nurse as an adult), but I didn’t realize how bad: \n\n1. Stomach acid will rot your teeth. Doesn’t matter if you brush right away, stomach acid is SO acidic that even a minute of contact between purging and brushing is enough to do damage. This becomes painful and EXPENSIVE to combat and recover from. I’ve known several bulimic or recovering bulimic patients who have to have major jaw surgeries, dental implants, and even dentures, as young as their 20s. \n\n2. Constant exposure to hydrochloric acid (stomach acid) causes sores and chemical burns to your esophagus and mouth. Long, long term exposure has been linked to mouth, jaw, and esophageal cancers. Let me put it to you this way: if you put a dead body in a vat of hydrochloric acid, it would dissolve completely. The same is true for a live body. \n\n3. Binging is not an issue of portion control. It’s a mental response of overcompensation for something else in your life. Doing so can disregulate your brain. \n\n4. Electrolyte imbalance. This seems like NBD at face value, but electrolytes (sodium, potassium, magnesium, calcium) are important for body function such as: nerve conduction (allowing your brain to talk to your body), muscle contraction (keep your heart/lungs pumping), maintaining fluid balance (keeping you 70% water or whatever), regulate blood pressure (so you don’t damage important organs like brain and kidneys), allow intracellular transfer…the list goes on and on. It’s super duper important to keep electrolytes in check. \n\n5. Your GI tract gets fucked when it doesn’t get used regularly and appropriately - meaning you can lose the ability to poop without intervention (like an ostomy pouch or shitload of laxatives), too much forced vomiting can make it difficult to keep food down *even when you want to*. It has a rhythm all its own, and messing with that rhythm can have permanent effects. \n\nEating disorders are the **most fatal of all mental health disorders**,* with the vast majority of its victims being under the age of 40. EDs are no small matter. I hope OP has access to support and can develop the skills to recover. Please find some help. \n\n*most fatal mental health disorder without external forces (ie, suicide and substance abuse disorder)\n\n[National Eating Disorder Association](https://www.nationaleatingdisorders.org)\n\n[ED Help Guide](https://www.helpguide.org/articles/eating-disorders/eating-disorder-treatment-and-recovery.htm)",
          "created_utc": 1658775848.0
        }
      ]
    },
    {
      "id": "ihnnq8j",
      "author": "Elllliiiizzzaabeth",
      "body": "The mold thing is so real! I suspected it was from purging but I’d never heard/read anything confirming it until now",
      "created_utc": 1658798251.0,
      "score": 2,
      "context": [
        {
          "id": "ihmfo4h",
          "author": "blkpepr",
          "body": "All the physical things previously mentioned, plus the impact on your loved ones/friends. If it's still a secret, know that someone will find out. \n\nFor me, the paranoia was huge. Always fearing if the bathroom smelled. If I flushed all the way, if my eyes were red, my fingers scarred or I choked, or my stomach burst.\n\nThe toilet bowl was always getting moldy if I didn't clean with bleach after purging. \n\nNot to mention, clogged and eroded pipes! If you own your own home, this will be hella expensive and mortifying! Imagine your sewer line breaking spilling tears of cached in puke and poop.",
          "created_utc": 1658779961.0
        }
      ]
    },
    {
      "id": "ihkuwc5",
      "author": "junkkoftheheart",
      "body": "Also I’ve thrown up blood a couple times which freaks me out",
      "created_utc": 1658757933.0,
      "score": 7,
      "context": [
        {
          "id": "ihkup5c",
          "author": "junkkoftheheart",
          "body": "I don’t have the best understanding of this but when you purge you lose a lot of electrolytes which are crucial for maintaining the electrical conduction system in your heart. If you have an imbalance of these electrolytes it can screw with your heart beating. Pretty scary.",
          "created_utc": 1658757845.0
        }
      ]
    },
    {
      "id": "kqb0tc0",
      "author": "Desperate_Fault3506",
      "body": "I thought this was just me omfg",
      "created_utc": 1707865644.0,
      "score": 1,
      "context": [
        {
          "id": "ihmqv73",
          "author": "zingydingy",
          "body": "i have had bulimia for 4 years and i cant bend down and tie my shoes without having bile flood up my eosphagus into my mouth because my sphincter function is so diminished from regular purging. i stopped having periods from the hormonal imbalance and have heart palpitations regularly.",
          "created_utc": 1658784199.0
        }
      ]
    },
    {
      "id": "ktomtjh",
      "author": "cnobilininuca",
      "body": "💯💯💯💯💯💯💯💯💯",
      "created_utc": 1709766502.0,
      "score": 2,
      "context": [
        {
          "id": "ihmeu8h",
          "author": "FancyLikeNancy",
          "body": "I feel like it destroyed my life. If you are doing binge eating and then purge believe me is like a carousel that swings around In hell very fast and you can’t get off of it. You binge that fuck out of food some nights and because your body is so tired you are sleeping forgetting to vomit and you wake up the next day feeling 100 kilos more and then it brings you much more depression than before. Your bathroom is a mess and you don’t care. Your teeth are getting worse and worse, chest pains, headaches, the worst for me was insomnia.Your body is really getting tired, you don’t have energy to wake up from the bed. For me it’s like a drug that you are addicted to it and it ruins your life. I was off my balance then on my balance for only 1 day and then back again to purging. Also it makes you spending all of your money almost on cravings. Everytime you say ok I am gonna buy this purge it and is gonna be the last time. But everyday is the same sentence. Last time I purged was on last Tuesday and today is Monday is gonna be almost a week without it. I am doing a challenge where I won’t do anything and keep continue having a healthy lifestyle and weight my self on 15th of august to see what happens. I never done it so far without purging. It’s really a dark place bulimia. Because you have eating disorders, problems with how you look and you say ok food makes me feel better but I won’t gain weight because it will go away. But sometimes you lose weight but if you are a bulimic person you can’t lose weight in healthy way and never gain them back. I am not that super obese, I fit very comfortably in size L and I am about to enter M now if you see me you won’t realize it I do it but I think I lost and put 100 kilos cause everyday you lose a kilo later you put another 2 back is a nightmare. \nI didn’t see anybody write the thing I had. At some point my body doesn’t “answer” to my bulimic acts. I tried as hard as possible to make food come out but it’s like my body is blocking and I can’t do anything and I am really panicking. I really want to stay away from it as much as possible and I am really sending my love to anybody who is going through it. Is really difficult disorder and you are a hero if you are coming out of it just like that. And if you are reading that and you are still purging please believe in yourself. The line between the healthy lifestyle and bulimia/purging is very thin. Is very hard to do the step but please put all your power in. You don’t deserve to live like that.\nI love you a lot all of you who are going through this. My dms are open if someone needs to talk ❤️🙏🏻",
          "created_utc": 1658779644.0
        }
      ]
    },
    {
      "id": "ihn3wcr",
      "author": "SativaSunChild",
      "body": "Never mind the issues I had as an active bulimic (I still throw up sometimes). That’s a whole other story. These are just the chronic/persisting problems even after I am mostly recovered.",
      "created_utc": 1658789503.0,
      "score": 3,
      "context": [
        {
          "id": "ihn3ojd",
          "author": "SativaSunChild",
          "body": "My teeth are fucked. They hurt everyday, they are broken and I can’t afford to fix them. My stomach issues/acid bother me every day. I’m only 20 years old and pretty much recovered now, and I have these issues I never would have imagined.",
          "created_utc": 1658789412.0
        }
      ]
    },
    {
      "id": "ihp4szp",
      "author": "Fer_xz",
      "body": "same lol i had a cocktail the other day and tried to not purge in general and after like 20 minutes of extreme pain i couldn’t bare it and just had to throw up ….so painful",
      "created_utc": 1658831410.0,
      "score": 2,
      "context": [
        {
          "id": "ihkkjd0",
          "author": "kittyoats",
          "body": "\nFrom my experience I’ve experienced dehydration, chest pain, jaw pain, diminished gag reflex, almost blacking out, chocking on food/vomit, bloating, cramping, constipation, sores around my mouth, bloated face, sores along my knuckles, nose bleeds, bursted vessels in my eye, acid reflux, and it’s gotten to the point where I sometimes just have vomit come up.\nPlease stop if you can! I know it’s hard and addictive but it’s not worth it and if I had the willpower and if life was better I’d stop.",
          "created_utc": 1658753058.0
        },
        {
          "id": "iho2bpt",
          "author": "dropshotftw",
          "body": "the reflux has been an unwelcome surprise now. especially when eating anything even kinda spicy. also alcohol hurts like hell to go on",
          "created_utc": 1658804881.0
        }
      ]
    },
    {
      "id": "ihp5gf9",
      "author": "aliciaprivas",
      "body": "I'm.Um. Mortality rate of anorexia is 4.0%, bulimia is 3.9% (and EDNOS is 5.2%)...That's only 0.1% difference.",
      "created_utc": 1658831884.0,
      "score": 7,
      "context": [
        {
          "id": "ihkhvhz",
          "author": "None",
          "body": "Death is a pretty bad side effect. EDs' have the highest mortality rate of all mental illnesses.",
          "created_utc": 1658751624.0
        },
        {
          "id": "ihnj4uu",
          "author": "JellyCharacter1653",
          "body": "Bulimia not so much like yes ppl have died from bulimia but no so much as anorexia",
          "created_utc": 1658796202.0
        }
      ]
    },
    {
      "id": "iho47r0",
      "author": "RuthMaudeJameison",
      "body": "Is that really true? Any cites? I’m curious.",
      "created_utc": 1658805815.0,
      "score": 2,
      "context": [
        {
          "id": "ihkhvhz",
          "author": "None",
          "body": "Death is a pretty bad side effect. EDs' have the highest mortality rate of all mental illnesses.",
          "created_utc": 1658751624.0
        },
        {
          "id": "ihnj4uu",
          "author": "JellyCharacter1653",
          "body": "Bulimia not so much like yes ppl have died from bulimia but no so much as anorexia",
          "created_utc": 1658796202.0
        }
      ]
    },
    {
      "id": "ii6y5gl",
      "author": "jnseel",
      "body": "Therapy! Therapy TikTok! Personal experience! \n\nEating disorders are not eating problems, they are brain problems. It’s about compulsion and trying to take control of one thing when it feels like you aren’t in control of everything in your life.",
      "created_utc": 1659136979.0,
      "score": 1,
      "context": [
        {
          "id": "ihm4vz2",
          "author": "jnseel",
          "body": "Hi, I’m a nurse with a personal history of both anorexia and bulimia. I knew it was bad when my ED was active (before becoming a nurse as an adult), but I didn’t realize how bad: \n\n1. Stomach acid will rot your teeth. Doesn’t matter if you brush right away, stomach acid is SO acidic that even a minute of contact between purging and brushing is enough to do damage. This becomes painful and EXPENSIVE to combat and recover from. I’ve known several bulimic or recovering bulimic patients who have to have major jaw surgeries, dental implants, and even dentures, as young as their 20s. \n\n2. Constant exposure to hydrochloric acid (stomach acid) causes sores and chemical burns to your esophagus and mouth. Long, long term exposure has been linked to mouth, jaw, and esophageal cancers. Let me put it to you this way: if you put a dead body in a vat of hydrochloric acid, it would dissolve completely. The same is true for a live body. \n\n3. Binging is not an issue of portion control. It’s a mental response of overcompensation for something else in your life. Doing so can disregulate your brain. \n\n4. Electrolyte imbalance. This seems like NBD at face value, but electrolytes (sodium, potassium, magnesium, calcium) are important for body function such as: nerve conduction (allowing your brain to talk to your body), muscle contraction (keep your heart/lungs pumping), maintaining fluid balance (keeping you 70% water or whatever), regulate blood pressure (so you don’t damage important organs like brain and kidneys), allow intracellular transfer…the list goes on and on. It’s super duper important to keep electrolytes in check. \n\n5. Your GI tract gets fucked when it doesn’t get used regularly and appropriately - meaning you can lose the ability to poop without intervention (like an ostomy pouch or shitload of laxatives), too much forced vomiting can make it difficult to keep food down *even when you want to*. It has a rhythm all its own, and messing with that rhythm can have permanent effects. \n\nEating disorders are the **most fatal of all mental health disorders**,* with the vast majority of its victims being under the age of 40. EDs are no small matter. I hope OP has access to support and can develop the skills to recover. Please find some help. \n\n*most fatal mental health disorder without external forces (ie, suicide and substance abuse disorder)\n\n[National Eating Disorder Association](https://www.nationaleatingdisorders.org)\n\n[ED Help Guide](https://www.helpguide.org/articles/eating-disorders/eating-disorder-treatment-and-recovery.htm)",
          "created_utc": 1658775848.0
        },
        {
          "id": "ii609my",
          "author": "None",
          "body": "Where did you learn point three I feel like sending it to my estranged for good reason mother",
          "created_utc": 1659122653.0
        }
      ]
    },
    {
      "id": "ihn456l",
      "author": "SativaSunChild",
      "body": "Believe me, it catches up to you, and fast. I thought I was okay, but these permanent issues started after only 3-4 years of 2-3x daily purging/bp-ing.",
      "created_utc": 1658789608.0,
      "score": 2,
      "context": [
        {
          "id": "ihn3ojd",
          "author": "SativaSunChild",
          "body": "My teeth are fucked. They hurt everyday, they are broken and I can’t afford to fix them. My stomach issues/acid bother me every day. I’m only 20 years old and pretty much recovered now, and I have these issues I never would have imagined.",
          "created_utc": 1658789412.0
        },
        {
          "id": "ihn3wcr",
          "author": "SativaSunChild",
          "body": "Never mind the issues I had as an active bulimic (I still throw up sometimes). That’s a whole other story. These are just the chronic/persisting problems even after I am mostly recovered.",
          "created_utc": 1658789503.0
        }
      ]
    },
    {
      "id": "iho58gv",
      "author": "JellyCharacter1653",
      "body": "You can google it but yeh pretty much like there are serious side affects but death not so much",
      "created_utc": 1658806333.0,
      "score": 2,
      "context": [
        {
          "id": "ihkhvhz",
          "author": "None",
          "body": "Death is a pretty bad side effect. EDs' have the highest mortality rate of all mental illnesses.",
          "created_utc": 1658751624.0
        },
        {
          "id": "ihnj4uu",
          "author": "JellyCharacter1653",
          "body": "Bulimia not so much like yes ppl have died from bulimia but no so much as anorexia",
          "created_utc": 1658796202.0
        },
        {
          "id": "iho47r0",
          "author": "RuthMaudeJameison",
          "body": "Is that really true? Any cites? I’m curious.",
          "created_utc": 1658805815.0
        }
      ]
    },
    {
      "id": "ii8z95b",
      "author": "None",
      "body": "I found that also from personal experience, some wacky overseas alternative therapy was the time I finally saw it as what it was, a coping mechanism.\n\nIt seems to be totally ignored in the medical sphere though. All they care about is not throwing up, not why I was doing it.\n\n And I don't think I've ever seen it mentioned in academia. Even these stupid universities surveys in here all the time are saying \"do you try to control what you eat?\"\n\nIn recovery from bulimia yeah you kind of have to because your used to binging often exorbitantly and purging all day every day. I don't see how aiming for some target like 2000-2500 calories is *Controlling*  and dangerous.",
      "created_utc": 1659182798.0,
      "score": 1,
      "context": [
        {
          "id": "ihm4vz2",
          "author": "jnseel",
          "body": "Hi, I’m a nurse with a personal history of both anorexia and bulimia. I knew it was bad when my ED was active (before becoming a nurse as an adult), but I didn’t realize how bad: \n\n1. Stomach acid will rot your teeth. Doesn’t matter if you brush right away, stomach acid is SO acidic that even a minute of contact between purging and brushing is enough to do damage. This becomes painful and EXPENSIVE to combat and recover from. I’ve known several bulimic or recovering bulimic patients who have to have major jaw surgeries, dental implants, and even dentures, as young as their 20s. \n\n2. Constant exposure to hydrochloric acid (stomach acid) causes sores and chemical burns to your esophagus and mouth. Long, long term exposure has been linked to mouth, jaw, and esophageal cancers. Let me put it to you this way: if you put a dead body in a vat of hydrochloric acid, it would dissolve completely. The same is true for a live body. \n\n3. Binging is not an issue of portion control. It’s a mental response of overcompensation for something else in your life. Doing so can disregulate your brain. \n\n4. Electrolyte imbalance. This seems like NBD at face value, but electrolytes (sodium, potassium, magnesium, calcium) are important for body function such as: nerve conduction (allowing your brain to talk to your body), muscle contraction (keep your heart/lungs pumping), maintaining fluid balance (keeping you 70% water or whatever), regulate blood pressure (so you don’t damage important organs like brain and kidneys), allow intracellular transfer…the list goes on and on. It’s super duper important to keep electrolytes in check. \n\n5. Your GI tract gets fucked when it doesn’t get used regularly and appropriately - meaning you can lose the ability to poop without intervention (like an ostomy pouch or shitload of laxatives), too much forced vomiting can make it difficult to keep food down *even when you want to*. It has a rhythm all its own, and messing with that rhythm can have permanent effects. \n\nEating disorders are the **most fatal of all mental health disorders**,* with the vast majority of its victims being under the age of 40. EDs are no small matter. I hope OP has access to support and can develop the skills to recover. Please find some help. \n\n*most fatal mental health disorder without external forces (ie, suicide and substance abuse disorder)\n\n[National Eating Disorder Association](https://www.nationaleatingdisorders.org)\n\n[ED Help Guide](https://www.helpguide.org/articles/eating-disorders/eating-disorder-treatment-and-recovery.htm)",
          "created_utc": 1658775848.0
        },
        {
          "id": "ii609my",
          "author": "None",
          "body": "Where did you learn point three I feel like sending it to my estranged for good reason mother",
          "created_utc": 1659122653.0
        },
        {
          "id": "ii6y5gl",
          "author": "jnseel",
          "body": "Therapy! Therapy TikTok! Personal experience! \n\nEating disorders are not eating problems, they are brain problems. It’s about compulsion and trying to take control of one thing when it feels like you aren’t in control of everything in your life.",
          "created_utc": 1659136979.0
        }
      ]
    }
  ]
}