{
  "id": "wbjro8",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1659139944.0,
  "title": "my ED has made me a bad person",
  "selftext": "I just need to share this & get it off my chest because no one knows & I am too ashamed to tell anyone. I’ve been stealing food from stores (probably about $30 worth of food/day) so I can binge & purge. I can hardly afford rent so there is no way I can afford to be symptomatic at the same time. I’m scared I’m going to be caught & arrested. I’m scared I’m going to be homeless. I’m scared my family & friends will cut me out of their lives. I’m at a complete loss & I’m only 21. I’m scared of myself & who I have become.",
  "url": "https://www.reddit.com/r/bulimia/comments/wbjro8/my_ed_has_made_me_a_bad_person/",
  "score": 77,
  "num_comments": 10,
  "comments": [
    {
      "id": "ii77w6j",
      "author": "babychurro98",
      "body": "Hey OP, I will just say that more b/p sufferers steal than you know. There’s actually a few studies linking EDs and kleptomania. I think it’s important to remember that b/p ED is an addiction and like most addicts you will do almost anything to get what you are addicted to, in this case food. However, the risk of getting caught is high and you could potentially ruin your future by stealing from stores. It’s important that you figure out a way to either cut the binging, or binge food that you can afford in your budget if you have to binge. If you want to chat more feel free to send me a message. I’m wishing I lots of luck, don’t hate yourself, the fact that you are aware of this is huge. You need to make a change with the stealing because it’s something that could ruin your future, it’s hard but I have faith you can do it.",
      "created_utc": 1659141583.0,
      "score": 49,
      "context": []
    },
    {
      "id": "ii87snx",
      "author": "Sorry_Wonder_3863",
      "body": "honestly everything you told me doesn’t really make you a bad person. \n\nur sick lovely, and the only one ur hurting is yourself. try talking to other kleptomaniacs, pretty sure there’s a reddit for it. if you can afford it, go to therapy and get help love. xx",
      "created_utc": 1659161289.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ii8a73n",
      "author": "testfreak377",
      "body": "You’re not a bad person you just make bad choices. Find out which of your basic needs aren’t being met and come up with a plan on how to meet them. People resort to criminal, antisocial behavior as a way to cope with their basic needs not being met. Doesn’t mean they are bad people necessarily. Of course addiction (which I consider EDs addiction) is caused by this state of lack.",
      "created_utc": 1659163057.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ii8fk7p",
      "author": "kittyoats",
      "body": "It’s a terrible thing but please know this is a mental illness and you probably wouldn’t be like this if you didn’t suffer. I’ve stolen food and money from family members, I’ve spent over $40 on binge food and laxatives combined, I’ve allowed my ed to consume my life and change me as a person. I think try reaching out for help or speak to someone, and while you’re ashamed of yourself and I’m not dismissing your behaviour just know that it’s not completely your fault",
      "created_utc": 1659167262.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iia54a5",
      "author": "ouid69",
      "body": "You’re sick. PERIOD. Not an excuse, but a fukn fact. Do what you need to survive, but try your best to prioritize your living sitch so you can get some proper help(if you want it). You’re not alone. Been there done that. Lmk if you need anyone to lean on. I’m not the best for it, but I’m down to have your back. <3 good luck with everything. Sending positive vibes your way.",
      "created_utc": 1659202990.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iib5vgy",
      "author": "Procedure-Other",
      "body": "Hi OP. \nToday, I was caught stealing for exactly this reason. I'm in my late twenties. \nIt's not the first time I've done it, and I hate doing it, but I can't stop. It really is an addiction. \nI am so ashamed and even been suicidal bc of it. I know what you're going through. \nMessage me anytime if you want.",
      "created_utc": 1659219213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iiahicr",
      "author": "reney11poe",
      "body": "Honestly I get it",
      "created_utc": 1659208340.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iibbvul",
      "author": "None",
      "body": "i thought about stealing yesterday :( from a store that trusts me & i regularly go to. waaaay too anxious of a person to actually steal, however. i hope u can stop sometime soon, and find some peace ♥️",
      "created_utc": 1659222026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iivigj8",
      "author": "IntoTh3Moonlight",
      "body": "Wow. This is really honest. I haven’t seen anything this real since I stopped going to 12 step meetings.\n\nYou remind me of my old sponsor. She was originally supposed to help me cut down on alcohol. But naturally, we ended up touching on some of my other compulsions and the ED stuff was bound to come up eventually. \n\nShe shared a bit of her story with me and she actually was arrested for shoplifting. She was stealing food since she too couldn’t really afford it at the time. It’s crazy because looking at her, no one would expect her to struggle with such a thing. She looked like she belonged on TV, not behind bars. But that’s where the craziness lies. No one really gets what goes on inside our minds.\n\nI wish I had a practical solution for you. It’s hardest when entering a binge cycle while not being able to afford it. Like any other addict, you will do whatever it takes to get your fix.\n\nI try to surround myself with people who I know will get me. It’s enough effort to be fighting back thoughts I’ve had since I was literally a child. So i try to give my self a pat on the back whenever I get the chance to as a reminder that I’m doing the best I can. It may be hard to do this for yourself right now. But you’re doing the best you can, and we’re proud of you. We’re here for you, and we’ve got your back",
      "created_utc": 1659586602.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ii9uy70",
      "author": "Glenchables",
      "body": "This was a good response. It makes sense if you look at maslows higherarchy of needs, food is the base of the pyramid and if u have a disorder in which food is never satiated, you will likely pick that over anything else. Seeking treatment for this disorder should be priority, in my opinion.",
      "created_utc": 1659198496.0,
      "score": 3,
      "context": [
        {
          "id": "ii8a73n",
          "author": "testfreak377",
          "body": "You’re not a bad person you just make bad choices. Find out which of your basic needs aren’t being met and come up with a plan on how to meet them. People resort to criminal, antisocial behavior as a way to cope with their basic needs not being met. Doesn’t mean they are bad people necessarily. Of course addiction (which I consider EDs addiction) is caused by this state of lack.",
          "created_utc": 1659163057.0
        }
      ]
    }
  ]
}