{
  "id": "wlsxkz",
  "subreddit": "bulimia",
  "author": "weliveandlearn_",
  "created_utc": 1660228547.0,
  "title": "unpopular opinion: you don't recover from a ED",
  "selftext": "But you learn to manage the symptoms. Much like other mental health illnesses. I'm tired of everyone saying I \"should have grown out of anorexia\". It started at age 13 and I'm now 30. Still anorexic. It's not a teen phase. It's a lifelong illness. I don't know why mostly teens have it or had it and tell me it magically disappeared. It's manageable but not curable and you cannot recover from a mental condition. Mental health is for life. Much like my OCD and BPD and other illnesses. But as I said, it's manageable with alot of hard work on a daily to keep it at bay to a lessor degree, depending on the person.  But it is not something you recover from. You may gain weight as a external symptom perspective, but your mind will always have this disorders irrational pattern of how you see food and your body etc. I'm not trying to be a downer, I just think we need to cut ourselves some slack and realize that completely diminishing something is not possible. But that's okay! Self acceptance is far more powerful because most things in this world we cannot change and we need to start focusing our enegry on accepting that it won't be perfect instead of making ourselves feel bad for our mistakes during \"recovery\" and false hope that one day this will all just magically go away",
  "url": "https://www.reddit.com/r/bulimia/comments/wlsxkz/unpopular_opinion_you_dont_recover_from_a_ed/",
  "score": 90,
  "num_comments": 14,
  "comments": [
    {
      "id": "ijv577h",
      "author": "None",
      "body": "After 20 days of not purging (longest I went in a while) I truly thought I was completely recovered and am not bulimic anymore. I was so sure that I cured myself of my eating disorder and am a new person with a new life ahead of me. Boy was I naive. It came back with vengeance and was so much harder to stop. Everything got worse. I wasn’t losing weight because I was extremely hungry even after binging and purging multiple times a day (massive amounts of food), my face and stomach were bloated so bad it made me look like I gained weight even if I stayed the same, my energy levels were non-existent and I almost passed out in the shower once, my depression got worse and etc… thank you for this post because black and white thinking is gonna do us more harm than good. I’m back to seriously recovering again so even tho I really hope and pray that I will never go back to the binge/purge cycle or using bulimia to cope with my other issues (depression, BPD), I know that I will be more kind to myself if I did slip up instead of letting things get out of hand because “oh well I messed up so let’s just ruin my life again”. It’s a life-long thing to tackle, not a phase.",
      "created_utc": 1660230074.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ijw32cp",
      "author": "judging-with-flags",
      "body": "This was a hard realisation during recovery for me. In a similar boat to you at 31 suffering from bulimia since my teen years, I always think of it as being in recovery but not recovered. I haven’t purged in about 7 years at this point, but I still struggle with disordered thinking around food, and the urges to b/p. Sometimes it feels overwhelming, but accepting it as a chronic illness that will flair up occasionally makes it easier to ride out those urges, rather than give in to them. And accepting relapse may happen if I don’t manage it is a pretty good motivator to stay on top of it.",
      "created_utc": 1660242910.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ijx1vws",
      "author": "dido_and-zdenka",
      "body": "I think this is one of those things which is quite person -specific. For some people EDs are lifelong (even if well managed) and for others they can make a full recovery, just like some people have lifelong chronic depression and others have an episode or two and recover. For me personally I consider myself pretty recovered at four and a half years in recovery, I don't think about it or food or my body much day to day at all, although some thoughts can flare up when I'm anxious. I'm not actively managing it every day any more. That said I absolutely still have a vulnerability to it and probably going on a diet would trigger it again. \n\nWhat's important though is that there is no _wrong_ way to recover, if you're moving in a healthy direction. Nobody should feel bad that they aren't recovered enough, or are too old to have an ED, or are recovering 'wrong' because all those standards and expectations are nonsense.",
      "created_utc": 1660256363.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ijvn10e",
      "author": "Throw-Away4-Me",
      "body": "I think it's sadly true, I've gone one year without binging and purging before, and thought I was completely cured. I was so happy that I felt normal again and that I've fixed myself, but nope, it came back recently, worse than before. Just gotta learn to cope ig",
      "created_utc": 1660236839.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ijwbmlz",
      "author": "stupidthrowaway1314",
      "body": "i agree 100%. it's something you have to manage for the rest of your life, and sometimes the symptoms shift/disappear/morph for even years at a time. i've known people who restricted for years, then went on to binging, then b/ping, then eating normally and being okay until something happens and they fall back into old habits. i always feel hesitant to say this because i don't want to sound morbid and discourage people from attempting recovery. it's absolutely possible to improve and diminish your symptoms, it's just something you have to be mindful of all the time so you don't risk slipping up (which isn't a bad thing in my opinion, lots of other disorders require you to deal with them everyday too). like how recovering addicts call themselves 'recovering' no matter how long they've been clean, because it's something they manage and deal with everyday.",
      "created_utc": 1660246140.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijwiy72",
      "author": "sugar_tit5",
      "body": "Completely agree. It fucking sucks",
      "created_utc": 1660248915.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijy2v8f",
      "author": "lostinth3Abyss",
      "body": "i feel anxiety about my future marriage (even though i could not be more single), cus im just sorry for whoever has to watch me starve myself like this and then waste our hard earned money on a binge. damn. hope he understands-or is a millionaire :/",
      "created_utc": 1660272793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijxaw54",
      "author": "esoterique87",
      "body": "I'm sorry you have people in your life who are not supportive. Whoever is telling you to \"grow out of it\" is ignorant about what eating disorders actually are. Some people are lucky enough to have early intervention and recover not long after their eating disorder develops. Statistically, early intervention has a high success rate in terms of making a full recovery. People don't realize that in those instances, it doesn't mean it was just a phase, it just means they caught it early and recovered sooner.\n\nI know people who have fully recovered from their eating disorder so I disagree that you can't fully recover. There are many people who have fully recovered, some people partially recover, and some people don't recover. It's very individual and there is a broad range of where you might fall on the recovery spectrum. \n\nI agree that you need to have self compassion in recovery and that nobody should expect themselves to have a \"perfect\" recovery. Beating yourself up for not being \"recovered\" yet isn't going to help.\n\nYou don't know that you won't fully recover! You are assuming things cannot change but what if they do? Your experience now might not be your experience in a few years. Nobody who makes a full recovery does it overnight. Some people need 10 years to recover but they still do it. For some, it takes time.\n\nDon't lose hope. Recovery is possible.💜",
      "created_utc": 1660260178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijxh0e4",
      "author": "None",
      "body": "This is true, every day is a struggle and if something bad happens like bereavement that’s it I’ll purge, for me nearly every meal everyday is a mental battle, I feel myself slipping again now. My partner has my best interest at heart always checking if I’ve eaten and making sure I eat and I’ve put on so much weight since being with him. Just feel like screaming sometimes. ED’s don’t leave ever you just try and cope. Feel myself slipping all the time especially when I’m on my own, it’s cruel really.",
      "created_utc": 1660262871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijyykfj",
      "author": "Ghost_the_Enby",
      "body": "I’d agree with this. Both my doctor and my dietitian said it’s something most people live with for the rest of their life. Which is why they even said to get yearly check ups throughout my life cause you can have long term effects",
      "created_utc": 1660293355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijzup0a",
      "author": "IGottaPeeConstantly",
      "body": "I agree with you. Also unlike other addictions you can't \"quit\" food. It is something we need to survive. So everyday we have to face our demons and manage our response to eating. It can be exhausting. I don't know how we would ever fully recover when we have to eat everyday.",
      "created_utc": 1660312773.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijv43s5",
      "author": "Forevermanicx",
      "body": "I feel like people who say it just disappears are either lying that it disappeared or might have struggled with food but didn’t have a full blown ED. Which I think is something people mistake for one another sometimes, as someone who’s had their ED for over ten years now I totally get where your coming from, I definitely don’t believe in full recovery I think the older you get you just learn to manage or cope with it in a healthier way. For me that was leaning more towards orthorexia as the years went by, it let me restrict/cal count and have safe foods while also not having to be hospitalized or losing my hair. I think it’s just a bandaid over the wound but I can’t even begin to imagine how it could just possibly just magically go away one day. I think the stereotype that it’s a teen disorder is so odd and random, I’m not even really sure where it came from because ED’s have been around for the longest and it’s usually the older people passing down these “tips” so ?? Idk never made sense to me. It’s also sad how once you hit a certain age the community and even society just kind of shun you and instead of supporting you they kind of just ridicule you cause your “too old”. The older I got the more I realized how many adults actually have ED’s and how most people engage in ED tendency’s or behaviors but as we get older it almost becomes taboo to speak about shit and everything becomes hush hush",
      "created_utc": 1660229640.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikd0lzp",
      "author": "generalpsych",
      "body": "I've been bulimic since age 12 (now 23) and in recovery for five years. I've made a LOT of progress in those five years but I do still binge and purge most days (I probably get about 3-5 binge/purge free days a month). I feel like I'm probably about half way through my recovery and whilst I have hope that I'll be fully recovered at some point in the future I don't necessarily know if that's a realistic goal. I've never had body image/weight issues or food issues (in the sense that I eat normally and don't actually struggle with food), my eating disorder started as and has always been essentially a coping mechanism, and I think that even when I am \"fully recovered\" and not bingeing and purging at all anymore I'll probably still have the urges to do so come up here and there. I guess I would personally still consider that \"recovered\" even though the thoughts would sort of still be there. I think I'll probably have to manage and control that urge to some extent for the rest of my life. I don't ever think I'll be completely cured in the sense that I don't ever think the urge will go away, but I've gotten to a point where I'm almost okay with that.",
      "created_utc": 1660554590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijywhuw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1660291664.0,
      "score": 1,
      "context": [
        {
          "id": "ijv43s5",
          "author": "Forevermanicx",
          "body": "I feel like people who say it just disappears are either lying that it disappeared or might have struggled with food but didn’t have a full blown ED. Which I think is something people mistake for one another sometimes, as someone who’s had their ED for over ten years now I totally get where your coming from, I definitely don’t believe in full recovery I think the older you get you just learn to manage or cope with it in a healthier way. For me that was leaning more towards orthorexia as the years went by, it let me restrict/cal count and have safe foods while also not having to be hospitalized or losing my hair. I think it’s just a bandaid over the wound but I can’t even begin to imagine how it could just possibly just magically go away one day. I think the stereotype that it’s a teen disorder is so odd and random, I’m not even really sure where it came from because ED’s have been around for the longest and it’s usually the older people passing down these “tips” so ?? Idk never made sense to me. It’s also sad how once you hit a certain age the community and even society just kind of shun you and instead of supporting you they kind of just ridicule you cause your “too old”. The older I got the more I realized how many adults actually have ED’s and how most people engage in ED tendency’s or behaviors but as we get older it almost becomes taboo to speak about shit and everything becomes hush hush",
          "created_utc": 1660229640.0
        }
      ]
    },
    {
      "id": "ijzbu3v",
      "author": "Forevermanicx",
      "body": "So then you wouldn’t make it seem like it just went away and you recovered, which is what op was talking about",
      "created_utc": 1660303288.0,
      "score": 2,
      "context": [
        {
          "id": "ijv43s5",
          "author": "Forevermanicx",
          "body": "I feel like people who say it just disappears are either lying that it disappeared or might have struggled with food but didn’t have a full blown ED. Which I think is something people mistake for one another sometimes, as someone who’s had their ED for over ten years now I totally get where your coming from, I definitely don’t believe in full recovery I think the older you get you just learn to manage or cope with it in a healthier way. For me that was leaning more towards orthorexia as the years went by, it let me restrict/cal count and have safe foods while also not having to be hospitalized or losing my hair. I think it’s just a bandaid over the wound but I can’t even begin to imagine how it could just possibly just magically go away one day. I think the stereotype that it’s a teen disorder is so odd and random, I’m not even really sure where it came from because ED’s have been around for the longest and it’s usually the older people passing down these “tips” so ?? Idk never made sense to me. It’s also sad how once you hit a certain age the community and even society just kind of shun you and instead of supporting you they kind of just ridicule you cause your “too old”. The older I got the more I realized how many adults actually have ED’s and how most people engage in ED tendency’s or behaviors but as we get older it almost becomes taboo to speak about shit and everything becomes hush hush",
          "created_utc": 1660229640.0
        },
        {
          "id": "ijywhuw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1660291664.0
        }
      ]
    }
  ]
}