{
  "id": "wyzz8f",
  "subreddit": "bulimia",
  "author": "ShizukuAmasawa",
  "created_utc": 1661597730.0,
  "title": "I ate too much food today. Regret it all. But I’m not going to throw it up, even though I desperately want to.",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/wyzz8f/i_ate_too_much_food_today_regret_it_all_but_im/",
  "score": 73,
  "num_comments": 9,
  "comments": [
    {
      "id": "im05r1n",
      "author": "mandanic",
      "body": "Proud of you!!! The purging stops before the binging does. That’s the hard part. But the more you challenge it and stick with it, the more you’ll rewire your brain out of the scarcity mindset and regulate hunger/fullness signals. You got this.",
      "created_utc": 1661609497.0,
      "score": 11,
      "context": []
    },
    {
      "id": "im1p5v7",
      "author": "CocoaButterNice",
      "body": "I fucking love you for this. Please continue to  keep food down.",
      "created_utc": 1661632676.0,
      "score": 3,
      "context": []
    },
    {
      "id": "im0p8sx",
      "author": "TimeCharacter3137",
      "body": "Sending lots of love and hugs to you! Be proud of yourself, distract yourself and love yourself 💕",
      "created_utc": 1661617621.0,
      "score": 3,
      "context": []
    },
    {
      "id": "im0xqdm",
      "author": "None",
      "body": "Hey! Don’t purge. You’ve got this. Purging will make it worse. It doesn’t help. Keep the food, you need it!",
      "created_utc": 1661621122.0,
      "score": 3,
      "context": []
    },
    {
      "id": "im1hb9b",
      "author": "None",
      "body": "Proud of you! I said the same thing but I still purged and I regret it, I hope I can get to where you are !!",
      "created_utc": 1661629300.0,
      "score": 2,
      "context": []
    },
    {
      "id": "im3ylac",
      "author": "ShizukuAmasawa",
      "body": "Thank you all for the support! I went to sleep and woke up and made healthier eating choices for myself so the portions were better and the heaviness of the food. I feel much better today. Thank you all. I don’t have support for this outside of Reddit. (I’m working with my therapist with other issues but not someone that specializes in EDs, maybe one day.)",
      "created_utc": 1661679422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "im36cm1",
      "author": "Longjumping_Pace4057",
      "body": "Hey. Same. But we got this and gonna be fine :)",
      "created_utc": 1661658547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "im3842v",
      "author": "None",
      "body": "*Random rant* (19y female) So I haven’t eaten carbs in like 40-60 days and I just got so fuckin hungry out the blue (maybe cuz I’m about to get my period?) and I ate a thick slice of bread w eggs on it and a packet of 3 in 1 Nescafé. I am so fucking disgusted right now this is going to haunt me for the next few weeks until I starve again or drop another 10lb. I literally want to throw up thinking about it. I looked beautiful a few hours ago and now I look like a fucking beached whale and I feel bloated. I’m so damn sick of my appearance and weight controlling my life. And I’m so sick of my family/people in general commenting on how I look. Like fuck y’all whoever was bullying me for being a fucking fat ass a few months ago and now I’m starving to the point of passing out every day literally and my bones are showing. NOW THEY WANNA TELL ME TO PLEASE EAT??! fuck off with that shit like you weren’t just fuckin bullying me for being chubby!!! People don’t realize one single comment or “joke” will heavily impact someone for weeks/months/years. I don’t even want to look in the mirror I’m just over here about to have a breakdown. And I love how I look with the lost weight but I’ve been to the ER more than 10x in the past month or 2 & I feel like I’m dying. I don’t wanna die. Not this young and incomplete anyways😭 But to me being overweight is the worst thing on earth. I cannot help my weight and food obsession it’s literally a disease/OCD in my brain. I wish I was naturally skinny and didn’t have a thick body type/bust my life would be so much fuckin easier. 😭😭😭😭Maybe this all wouldn’t have happened if everyone didn’t fucking comment every time I lose or gain weight. Also some people know I’ve been in the ER multiple times and I’m sick and depressed starving not healthily losing weight and they say I look so good now? What the fuck? Like how can anyone promote this. Omg. I just can’t rn🤦🏻‍♀️ & I don’t want to kill myself or anything at all but I feel like this is maybe killing me and it’s definitely taking a big chunk of my health. But I just. Cannot. Fucking. Stop.",
      "created_utc": 1661659558.0,
      "score": 1,
      "context": []
    }
  ]
}