{
  "id": "x49vvt",
  "subreddit": "bulimia",
  "author": "donttalktome1002",
  "created_utc": 1662146056.0,
  "title": "Today when purging after a huge binge, I just had the huge urge to stop. I just don’t want to do it anymore. Could this be the last time? Has anyone else felt like that?",
  "selftext": "",
  "url": "https://www.reddit.com/r/bulimia/comments/x49vvt/today_when_purging_after_a_huge_binge_i_just_had/",
  "score": 69,
  "num_comments": 16,
  "comments": [
    {
      "id": "imu5y3j",
      "author": "kasialis721",
      "body": "honestly, yes.\nfor me it has taken a third hospital admission and a pending assessment for an inpatient unit for me to realise, never the less i have come to a breaking point where i dont want to do it anymore.\nalthough you might think this is the best thing ever after hitting a rock bottom (not invalidating that) diving into the deep end of recovery really isnt that easy. due to the fact that your body will have to adjust to acting normally again you will at first experience extreme bloat and this may trigger you to want to purge. your face may slightly swell as your body will be retaining water (hoarding any water it gets because it doesnt know if it has a reliable source). this will pass over time but it will be very uncomfortable.\nyou can do this i believe in you 💗",
      "created_utc": 1662147709.0,
      "score": 21,
      "context": []
    },
    {
      "id": "imu80cv",
      "author": "GirlWitDaBoi",
      "body": "Yeah this could litterally be the last time. Dont beat yourself up if it's not, but it still could be.",
      "created_utc": 1662148539.0,
      "score": 14,
      "context": []
    },
    {
      "id": "imu9ft4",
      "author": "None",
      "body": "I stopped in February of this year (aside from the occasional slip) and I think I just realized that it wasn't changing anything. Like if I eat something I shouldn't have, nothing will change about that if I purge and purging will lead me to have more binges. I find it a lot easier not to binge if I just don't purge. Just the feeling that I could be where I want to be physically more easily if I stop. Which makes total sense because the purging came long before I ever started binging.",
      "created_utc": 1662149117.0,
      "score": 8,
      "context": []
    },
    {
      "id": "imusytr",
      "author": "cfitesp",
      "body": "Yep, it happened to me too. I realised I was making myself miserable just for what? Being 3-4kg lighter? All the pain, all the missed opportunities, all the physical and mental energy I put towards being skinny… for what? I had already been skinny and I was just as miserable. Why do it again? I’d rather be healthy and enjoy my life with my extra 3kg thanks 😂",
      "created_utc": 1662157376.0,
      "score": 6,
      "context": []
    },
    {
      "id": "imw17zs",
      "author": "livv3ss",
      "body": "Yes, I was eating multiple huge meals a day n throwing them all up. It became not only physically exhausting but mentally. I was also getting sinus problems due to it coming out my nose I was choking and having throat issues all the time. And it was getting to a point whre I’d be trying my hardest to throw up and nothing would come out I’d be gagging for like an hour. I got so done with it I stopped compeltely. My body could no longer keep up plus not to mention the fact I was dying. I am currently in recovery n still have issues w restricting sometimes but for the most part I am trying my hardest and you’ll find recovery to be challenging but also a weight lifted off your shoulder due to no more mental and physical exhaustion from purging.",
      "created_utc": 1662179534.0,
      "score": 5,
      "context": []
    },
    {
      "id": "imvcmjv",
      "author": "nina1404",
      "body": "Ive felt it before and i am 100% convinced i will not do it again and i'll be healthy n shit but then eventually i do it again :(",
      "created_utc": 1662166612.0,
      "score": 4,
      "context": []
    },
    {
      "id": "imx9omw",
      "author": "None",
      "body": "ive thought too many times “i cant do this any more” “what am i doing with my life” “why am i doing this to myself” “this is the last time” & it hasnt been… i’m actually sick with a sore throat rn so i havent purged in 3 days, which makes me hopeful :D",
      "created_utc": 1662211633.0,
      "score": 3,
      "context": []
    },
    {
      "id": "imxnqym",
      "author": "arrythemenace",
      "body": "Yea I do this I fell like or at least I hope the more I just stop it mid purge the less I will binge n the less I will purge also hopefully eventually leading to a stop in all of that I does help to just stop mid purge whenever im clean for a bit that's usually how I ease into it",
      "created_utc": 1662217951.0,
      "score": 3,
      "context": []
    },
    {
      "id": "imy5zfi",
      "author": "None",
      "body": "I’m not going to lie to you, I’ve felt this a few times.  It’s always when I look in the mirror afterwards.  When my face is all bloated and my eyes are watery and I hate myself for what I’m doing to myself and I hate the secret life I’ve forced myself to live.  It’s true what they say, most people really do have to hit rock bottom before they get better.",
      "created_utc": 1662225328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "imwwvan",
      "author": "Narwhal_Songs",
      "body": "I have felt it a few times but then I always fall back :(",
      "created_utc": 1662204234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "imyd2ft",
      "author": "Ok_Coffee1701",
      "body": "Not really, but it might be time to slow down, take it easy ... tomorrow is another day. Learn how to make a casserole,  or a cake.",
      "created_utc": 1662228228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "imyfs94",
      "author": "None",
      "body": "yeah, i feel the same. yesterday was the first time i'd purged in over a week, and i realized how shitty it felt throwing up food, and how wasteful it was. the only person that's been hyperfixed on my image is myself, so i decided to stop caring about my appearance and weight as much. i hope you're able to find peace within yourself.",
      "created_utc": 1662229356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "imzco1u",
      "author": "wormpoop_",
      "body": "I always say this the last time but then I keep doing it lol",
      "created_utc": 1662243221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in36dw4",
      "author": "okaysweaty167",
      "body": "I’ve had this experience after my last relapse. They put the hugest tube in and it was so painful and I could barely breathe or swallow. I convinced them to take it out if I ate and after that I told my bf at the time that there would never be a fucking tube in my nose unless I’m 80 years old and can’t eat anymore. During that admission I kept telling people that I was tired of fighting my ED voice so I was just going to fully submit and do whatever it said. But then a few days after I just got home I realized that it was just as exhausting to fight my recovery voice, so I might as well just submit to recovery. I was an adult but told my parents to make all my meals and not let me\nHave a say in what they were making. This helped so much.",
      "created_utc": 1662317155.0,
      "score": 1,
      "context": []
    },
    {
      "id": "imu6whh",
      "author": "donttalktome1002",
      "body": "Happy for you, I hope your recovery goes well🤍 thank you for your words",
      "created_utc": 1662148093.0,
      "score": 6,
      "context": [
        {
          "id": "imu5y3j",
          "author": "kasialis721",
          "body": "honestly, yes.\nfor me it has taken a third hospital admission and a pending assessment for an inpatient unit for me to realise, never the less i have come to a breaking point where i dont want to do it anymore.\nalthough you might think this is the best thing ever after hitting a rock bottom (not invalidating that) diving into the deep end of recovery really isnt that easy. due to the fact that your body will have to adjust to acting normally again you will at first experience extreme bloat and this may trigger you to want to purge. your face may slightly swell as your body will be retaining water (hoarding any water it gets because it doesnt know if it has a reliable source). this will pass over time but it will be very uncomfortable.\nyou can do this i believe in you 💗",
          "created_utc": 1662147709.0
        }
      ]
    },
    {
      "id": "imu921z",
      "author": "donttalktome1002",
      "body": "The urge to stop hit me so hard, no urge to binge has ever been so strong. I’m not setting my hope to high though",
      "created_utc": 1662148963.0,
      "score": 5,
      "context": [
        {
          "id": "imu80cv",
          "author": "GirlWitDaBoi",
          "body": "Yeah this could litterally be the last time. Dont beat yourself up if it's not, but it still could be.",
          "created_utc": 1662148539.0
        }
      ]
    }
  ]
}