{
  "id": "x64isu",
  "subreddit": "bulimia",
  "author": "oohyeahgetitiguess",
  "created_utc": 1662344768.0,
  "title": "Does anyone else feel the urge to binge after slightly over eating?",
  "selftext": "Like if I plan out a meal, eat it, then eat one extra bite of something my brain goes into an all or nothing mentality and I figure, I’m gonna throw this up anyways since I overate, so why not binge and then purge?",
  "url": "https://www.reddit.com/r/bulimia/comments/x64isu/does_anyone_else_feel_the_urge_to_binge_after/",
  "score": 99,
  "num_comments": 15,
  "comments": [
    {
      "id": "in5772e",
      "author": "Zia_8",
      "body": "Yeh I get the same feeling of “it’s already too much, might as well just binge”.. but honestly I feel horrible after binging, even if I purge it.. if I slightly overeat without binging I’ll still feel that guilt, but it’s much better than the terrible feeling after I binge, and the guilt of consuming all of that to just purge it.. plus the physical damage I’m causing my body when purging— so I keep that extra bite inside and do my best not to binge afterwards. I just keep on repeating affirmations of how what I’ve eaten over what I planned won’t do any harm and that it’s okay.. yk",
      "created_utc": 1662350617.0,
      "score": 19,
      "context": []
    },
    {
      "id": "in5uwj6",
      "author": "cfitesp",
      "body": "I used to get the same feeling - it all stems from that all or nothing mentality as you said. What I did is try to question that belief. Everyone overeats sometimes and most don't get fat, so why would I? Then I actually tried it and saw for myself how an extra few bites here and there didn't affect my weight at all (maybe from one day to the next, I'd gain weight but it would all even out eventually) :)",
      "created_utc": 1662367218.0,
      "score": 14,
      "context": []
    },
    {
      "id": "in58x92",
      "author": "Yup_OK_Whatever",
      "body": "Yes. It’s exhausting 😞",
      "created_utc": 1662351603.0,
      "score": 6,
      "context": []
    },
    {
      "id": "in75mb7",
      "author": "Musicknowsnobounds",
      "body": "I feel you. It's that black and white thinking that sucks.",
      "created_utc": 1662393985.0,
      "score": 3,
      "context": []
    },
    {
      "id": "in79bfi",
      "author": "GenericWoman12345",
      "body": "I totally relate. It's such a ugly struggle. I'm sorry you have to experience it as well",
      "created_utc": 1662395457.0,
      "score": 2,
      "context": []
    },
    {
      "id": "in82pt3",
      "author": "simply-dead",
      "body": "same! as soon as i eat a bite more than i intended to my brain imstantly goes to \"fuck it, might as well consume extra 4k calories now\" mode",
      "created_utc": 1662407458.0,
      "score": 2,
      "context": []
    },
    {
      "id": "in6f6ze",
      "author": "JustAGirl_1111",
      "body": "ALWAYS",
      "created_utc": 1662382204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in6z5k2",
      "author": "poopoopeepoopoee",
      "body": "YES!!!",
      "created_utc": 1662391358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in7ayfg",
      "author": "you_dont_know_me_2",
      "body": "Every time, it's like my brain can't process it and I am like now that I overeat by a little bit I must binge.",
      "created_utc": 1662396106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in7sdek",
      "author": "coffeeandascone",
      "body": "Yes I often do. It either leads me into a full on binge, or I ride it out. Sometimes if I can put into a calorie counter it let's me see I haven't really eaten that much and I'm totally ok with what I ate.",
      "created_utc": 1662403111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in83q3n",
      "author": "clairebearruns",
      "body": "Yes. If I eat dairy products it sends me into a binge too :(",
      "created_utc": 1662407883.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in8eyiz",
      "author": "burntbroccoliass",
      "body": "Yes! This is 100% how I think",
      "created_utc": 1662412705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "in8ob2o",
      "author": "kathja71",
      "body": "A helpful tip might be to eat more or less the same thing and in the same quantities every day whilst your body and mind recover. Same breakfast, same lunch and same dinner. A bit boring but better than getting too full and going into all or nothing mode perhaps? I am many years past my last binge but I still eat the same breakfast and lunch whenever possible, as I know I feel good afterwards.",
      "created_utc": 1662416883.0,
      "score": 1,
      "context": []
    },
    {
      "id": "injcslc",
      "author": "WaterMyMelonnn",
      "body": "Yes, I feel like I wrote this.",
      "created_utc": 1662603555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix5usa1",
      "author": "maple_dick",
      "body": "Seriously. Im a huge fuck up. Only one thing I consider a mistake I throw it all out and fucking sabotage all my effort and can go months fucking binging. \n\nI don't know why. Huge self-punishment/sabotage? Idk. Im sick of myself.",
      "created_utc": 1668988080.0,
      "score": 1,
      "context": []
    }
  ]
}