{
  "id": "x793ov",
  "subreddit": "bulimia",
  "author": "vbgirl24",
  "created_utc": 1662466641.0,
  "title": "Being anorexic felt easier on my body than bulimia",
  "selftext": "I know many of us are in the same boat: restrictive eating disorder that eventually turned into binging and purging. \n\nI miss being anorexic, which may be horrible to say. Obviously I was miserable then too, and I’m not saying restricting was good for my body at all! But y’all know what I mean-bulimia is torture. I physically feel like I’m dying sometimes after a violent purge or painful binge. The next day, my body feels utterly exhausted. My throat is sore. My face is painfully swollen. My neck aches from the angle of bending over the toilet. My hands look ugly and scarred (not hands free). Occasionally, I’ll even come down with a fever and chills after a horrible BP session.  It just sucks. And I have nothing to show for it. I don’t have the body I want and my mental state is worse than ever. \n\nAt least with anorexia, I didn’t have to torture myself in such a violent way-it was more the choice to NOT do something (eat) than to actively choose harm behaviors (binge/purge). With anorexia, I had the body I wanted. I miss it. \n\nI hope this post doesn’t diminish the struggles of people suffering with anorexia. I empathize and know it’s not easy, I just needed to vent",
  "url": "https://www.reddit.com/r/bulimia/comments/x793ov/being_anorexic_felt_easier_on_my_body_than_bulimia/",
  "score": 232,
  "num_comments": 20,
  "comments": [
    {
      "id": "inbi85w",
      "author": "blarbiegorl",
      "body": "Nope, fully agree with you and I don't think it diminishes anything. I am more tired and wilty when restricting, but I feel inhuman and unable to function in totality when I'm binge eating and/or purging. Restriction and anorexia wreak awful havoc on the body but the violence of bulimia and bed definitely feel quite a bit different.\nI hope you're able to fight through it and come out the other end. 💛",
      "created_utc": 1662475406.0,
      "score": 61,
      "context": []
    },
    {
      "id": "incaslu",
      "author": "Branch-Much",
      "body": "I felt so in *control* with anorexia. Even though I looked alarming to other people, I always felt so healthy and light on my feet. I know if it lasted longer than it did (about four years) there might have been long term damage, but I didn’t feel nearly as ill and out of control as I do with bulimia 😕.\n\nI completely relate to every single thing you said about bulimia’s effect on the body. The exhaustion, the throat pain, the swollen face, the neck and jaw pain. It’s also made me worry about heart failure (after enormous, fatty binges) way more than I ever did with anorexia. \n\nDon’t get me wrong- I would never ever want to be anorexic again. I had zero sex drive, hardly ever thought about anything but food, thinning hair, was freezing all the time, bones hurt when lying down, people gave me weird stares, struggled to find clothes that fit, family harassing me to gain weight etc. Still, I have to agree that it felt easier on my body.",
      "created_utc": 1662486655.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ind0q4u",
      "author": "chronaloid",
      "body": "Have suffered from both and I agree…I know exactly what you mean. For me, anorexia was more or less sustainable for a longer period of time. Bulimia grabbed the steering wheel out of my hands and before I knew it I was upside down in a ditch. \n\nI also got fever/chills after bad b/p sessions but could never find much info on it and figured I was just overtaxing my body, which, yeah, but it’s interesting you mention it too. I’m truly sorry - EDs are awful, all of them, and I hope you can find yourself on the road to recovery soon. <3",
      "created_utc": 1662496512.0,
      "score": 24,
      "context": []
    },
    {
      "id": "incgk7u",
      "author": "None",
      "body": "100% agree with you, i miss just not eating stuff, bulimia hurts alot :(",
      "created_utc": 1662488870.0,
      "score": 14,
      "context": []
    },
    {
      "id": "indytsh",
      "author": "sadfaeries",
      "body": "totally get this, restricting was miserable but b/p-ing is 1000x worse imo",
      "created_utc": 1662510971.0,
      "score": 13,
      "context": []
    },
    {
      "id": "inezg4s",
      "author": "BrowncoatIona",
      "body": "I don't like comparing EDs, but IIRC, anorexia is more likely to kill you in the long-term. Bulimia is more likely to kill you in the short-term. \nAnd this is anecdotal - I don't have the energy to add citations rn. \nBut bulimia is so rough in terms of rapid damage to the heart, risk of severe electorlyte/nutriet imbalances, extreme degydration, risk of rupturing your stomach or esophagus, etc... \nAnorexia results in weakining/wasting of vital organs (including heart), bones, and can result in some certainly scary outcomes. \nObviously there can be crossover in physical consequences of both disorders, but as it's been said, BN tends to be more immediately violent, while AN-R results in a quiet deterioration of vital body parts and functions.  \nAnd then there's AN-BP with its own set of horrific consequences. \n\nEDs are fucking hell. \n\nAnd follow me if you will. Eating disorders are the most deadly of mental disorders. But contrary to popular belief, most ED sufferers do not die of malnutrition/heart attack/other bodily malfunctions. \n\nMost die of suicide. \n\nOne hypothesis for this is that we put ourselves through so much pain, mentally and physically, that we become partially desensitized to it, making it easier to... go too far. Additionally, EDs have an exceptionally high rate of comorbidities. PTSD, substance use disorders, OCD, depression, anxiety, BPD, autism spectrum disorder, etc. And those who are already in disenfranchised/vulnerable groups are often more likely to develop EDs. \n\nEDs are incredibly isolating, devestating, misunderstood disorders. Despite EDs having the highest mortality rate of mental illnesses, it still doesn't seem to be taken that seriously by the majority of the population. \n\nSorry, I started rambling (way off of the short thing I meant to comment). Just... be as kind and understanding to yourself as often as you are able. You have dealt with and are dealing with some horrible shit. Shit most people really can't even begin to grasp. \n\nSolidarity, homie ✌\n\nEdit: typos",
      "created_utc": 1662529367.0,
      "score": 14,
      "context": []
    },
    {
      "id": "indbfel",
      "author": "5star-my-notebook",
      "body": "I had AN for the first 2 years of my ED (been nearly 5 years now), and I have to say I feel the same way. I liked myself more and was a lot more confident when I was restricting. I stopped being hungry and food became something I used to stay alive rather than to fulfill a need. Stepping on the scale was euphoric every time I saw the number go down. I feel so disgusting and out of control now, but I’m luckily in a more sustainable place with my ED. I’m trying to maintain in a weight range that’s uncomfortable for me so I can have a life outside of bulimia, but I’m still b/ping multiple times a day. Mostly, I miss how my parents treated me when I was anorexic. I’m constantly getting complaints about how wasteful I am, how I have no self control, how much money I flush down the toilet. Before, it was concern and begging me to eat. Everywhere I go I make sure to map out the nearest toilet and bring hair ties and a water bottle with me. People notice that I disappear into the bathroom for a long time at parties or family events. I’m always worried that my breath smells like puke. I’m constantly exhausted no matter how much sleep I get, but I have nothing to show for it.",
      "created_utc": 1662500672.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ind0n6d",
      "author": "allfishrevil",
      "body": "i totally get it, and i hate it’s probably never going to be the way it was when it all started again",
      "created_utc": 1662496482.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ineafkc",
      "author": "okaysweaty167",
      "body": "I promise you that you didn’t have the body you wanted when you were anorexic people with ED are never satisfied. I’ve heard many anorexics say they wish they could purge them they could just eat whatever they want and then bulimics say that anorexia is easy you just don’t eat. It’s always a lose lose situation and you’ll never be happy in your ED",
      "created_utc": 1662516118.0,
      "score": 6,
      "context": []
    },
    {
      "id": "inehn12",
      "author": "rusty_tutu",
      "body": "I'm sadly agreeing with you all.. I'm  in high restriction rn because of an injured sciatic nerve.. seeing a new doctor on Friday and am hoping for some pain relief and help..",
      "created_utc": 1662519419.0,
      "score": 3,
      "context": []
    },
    {
      "id": "inf5akm",
      "author": "invaderBre",
      "body": "I just binged (for real this time, yesterday I made a post on another sub about a binge but that was actually just normal eating lol) and my stomach hurts. I really regret it and I feel so gross. Bulimia sucks. I wish I could just restrict forever and never have urges to stuff my face with junk.",
      "created_utc": 1662533547.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m33ru16",
      "author": "Technical_Raise1715",
      "body": "Agreed! Anorexia is controlling and obsessive, but weight loss occurs and i didn’t find it too be as destructive to my mind and body as bulimia was. \n\nAll that pain with bulimia and no weight loss? Awful side effects like u mentioned, and mentally I thought it was way more exhausting and painful",
      "created_utc": 1734764897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "io2tjsh",
      "author": "Charlieisme89",
      "body": "Ik what you mean, obviously it’s best to have no eating disorder, but physically and emotionally anorexia is so much easier to live with. With anorexia my stomach constantly felt empty, but with bulimia it’s in constant agonizing pain, that’s just 1 example.",
      "created_utc": 1662951751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iplbktd",
      "author": "MutedProfit",
      "body": "Yup. I felt this for years and still feel it now. Bulimia is the hardest thing to survive and the hardest thing to stay recovered from it’s just awful.",
      "created_utc": 1663937993.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipmjllw",
      "author": "EfficientCapital2372",
      "body": "i totally feel this. bulimia is so fucking painful. i started off as anorexic and didn’t end up in the hospital at all. as soon as bulimia took over i’ve been passing out and i’m in the hospital for fluids, electrolytes and a bunch of other shit. constant migraines and swelling. i’ve been maintaining my weight from anorexia which probably makes it worse. i feel dead",
      "created_utc": 1663958135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "indl5u2",
      "author": "Internal_Mountain725",
      "body": "100000% agree with this, especially the control part",
      "created_utc": 1662504796.0,
      "score": 5,
      "context": [
        {
          "id": "incaslu",
          "author": "Branch-Much",
          "body": "I felt so in *control* with anorexia. Even though I looked alarming to other people, I always felt so healthy and light on my feet. I know if it lasted longer than it did (about four years) there might have been long term damage, but I didn’t feel nearly as ill and out of control as I do with bulimia 😕.\n\nI completely relate to every single thing you said about bulimia’s effect on the body. The exhaustion, the throat pain, the swollen face, the neck and jaw pain. It’s also made me worry about heart failure (after enormous, fatty binges) way more than I ever did with anorexia. \n\nDon’t get me wrong- I would never ever want to be anorexic again. I had zero sex drive, hardly ever thought about anything but food, thinning hair, was freezing all the time, bones hurt when lying down, people gave me weird stares, struggled to find clothes that fit, family harassing me to gain weight etc. Still, I have to agree that it felt easier on my body.",
          "created_utc": 1662486655.0
        }
      ]
    },
    {
      "id": "ine5d92",
      "author": "9miumiu9",
      "body": "same I just start overheating after a b/p when I'm dehtdrated/low on electrolytes I always wondered what caused that and when I drink juice when bingeing bc of how cold it is my nails turn blue and I start shaking really badly☠ can't win",
      "created_utc": 1662513901.0,
      "score": 3,
      "context": [
        {
          "id": "ind0q4u",
          "author": "chronaloid",
          "body": "Have suffered from both and I agree…I know exactly what you mean. For me, anorexia was more or less sustainable for a longer period of time. Bulimia grabbed the steering wheel out of my hands and before I knew it I was upside down in a ditch. \n\nI also got fever/chills after bad b/p sessions but could never find much info on it and figured I was just overtaxing my body, which, yeah, but it’s interesting you mention it too. I’m truly sorry - EDs are awful, all of them, and I hope you can find yourself on the road to recovery soon. <3",
          "created_utc": 1662496512.0
        }
      ]
    },
    {
      "id": "infsptu",
      "author": "Infinite-Ad-6447",
      "body": "This was very helpful. Also made me cry lol",
      "created_utc": 1662551173.0,
      "score": 5,
      "context": [
        {
          "id": "inezg4s",
          "author": "BrowncoatIona",
          "body": "I don't like comparing EDs, but IIRC, anorexia is more likely to kill you in the long-term. Bulimia is more likely to kill you in the short-term. \nAnd this is anecdotal - I don't have the energy to add citations rn. \nBut bulimia is so rough in terms of rapid damage to the heart, risk of severe electorlyte/nutriet imbalances, extreme degydration, risk of rupturing your stomach or esophagus, etc... \nAnorexia results in weakining/wasting of vital organs (including heart), bones, and can result in some certainly scary outcomes. \nObviously there can be crossover in physical consequences of both disorders, but as it's been said, BN tends to be more immediately violent, while AN-R results in a quiet deterioration of vital body parts and functions.  \nAnd then there's AN-BP with its own set of horrific consequences. \n\nEDs are fucking hell. \n\nAnd follow me if you will. Eating disorders are the most deadly of mental disorders. But contrary to popular belief, most ED sufferers do not die of malnutrition/heart attack/other bodily malfunctions. \n\nMost die of suicide. \n\nOne hypothesis for this is that we put ourselves through so much pain, mentally and physically, that we become partially desensitized to it, making it easier to... go too far. Additionally, EDs have an exceptionally high rate of comorbidities. PTSD, substance use disorders, OCD, depression, anxiety, BPD, autism spectrum disorder, etc. And those who are already in disenfranchised/vulnerable groups are often more likely to develop EDs. \n\nEDs are incredibly isolating, devestating, misunderstood disorders. Despite EDs having the highest mortality rate of mental illnesses, it still doesn't seem to be taken that seriously by the majority of the population. \n\nSorry, I started rambling (way off of the short thing I meant to comment). Just... be as kind and understanding to yourself as often as you are able. You have dealt with and are dealing with some horrible shit. Shit most people really can't even begin to grasp. \n\nSolidarity, homie ✌\n\nEdit: typos",
          "created_utc": 1662529367.0
        }
      ]
    },
    {
      "id": "ingo7ci",
      "author": "BrowncoatIona",
      "body": "Well, I'm glad you found it helpful, but sorry it made you cry :C. \nSometimes it's okay to grieve for yourself. For what you've been through, what you've lost. That doesn't mean that there aren't also things to celebrate, but denying grief doesn't tend to be all that helpful for anyone. \n\nOnce I find some of the studies and whatnot, I'd be happy to share them. Some of them were enlightening, though distressing to read. Something about it being scientific research following proper methods and procedure, rather than the total opinion pieces people frequently share (not that those never have their place, just that they more greatly vary in quality). \"Knowledge is power\", but sometimes knowledge is so painful...\n\nSafety and peace, comrade.",
      "created_utc": 1662565144.0,
      "score": 5,
      "context": [
        {
          "id": "inezg4s",
          "author": "BrowncoatIona",
          "body": "I don't like comparing EDs, but IIRC, anorexia is more likely to kill you in the long-term. Bulimia is more likely to kill you in the short-term. \nAnd this is anecdotal - I don't have the energy to add citations rn. \nBut bulimia is so rough in terms of rapid damage to the heart, risk of severe electorlyte/nutriet imbalances, extreme degydration, risk of rupturing your stomach or esophagus, etc... \nAnorexia results in weakining/wasting of vital organs (including heart), bones, and can result in some certainly scary outcomes. \nObviously there can be crossover in physical consequences of both disorders, but as it's been said, BN tends to be more immediately violent, while AN-R results in a quiet deterioration of vital body parts and functions.  \nAnd then there's AN-BP with its own set of horrific consequences. \n\nEDs are fucking hell. \n\nAnd follow me if you will. Eating disorders are the most deadly of mental disorders. But contrary to popular belief, most ED sufferers do not die of malnutrition/heart attack/other bodily malfunctions. \n\nMost die of suicide. \n\nOne hypothesis for this is that we put ourselves through so much pain, mentally and physically, that we become partially desensitized to it, making it easier to... go too far. Additionally, EDs have an exceptionally high rate of comorbidities. PTSD, substance use disorders, OCD, depression, anxiety, BPD, autism spectrum disorder, etc. And those who are already in disenfranchised/vulnerable groups are often more likely to develop EDs. \n\nEDs are incredibly isolating, devestating, misunderstood disorders. Despite EDs having the highest mortality rate of mental illnesses, it still doesn't seem to be taken that seriously by the majority of the population. \n\nSorry, I started rambling (way off of the short thing I meant to comment). Just... be as kind and understanding to yourself as often as you are able. You have dealt with and are dealing with some horrible shit. Shit most people really can't even begin to grasp. \n\nSolidarity, homie ✌\n\nEdit: typos",
          "created_utc": 1662529367.0
        },
        {
          "id": "infsptu",
          "author": "Infinite-Ad-6447",
          "body": "This was very helpful. Also made me cry lol",
          "created_utc": 1662551173.0
        }
      ]
    }
  ]
}