{
  "id": "xrl1un",
  "subreddit": "bulimia",
  "author": "Mrsstradlin",
  "created_utc": 1664490832.0,
  "title": "Question... Is it difficult for some of you to leave the house because you don't like how you look and feel that when you go out everyone will see you and judge you?",
  "selftext": "I haven't leave my house for almost two weeks ... If someone have any adviceeeee I would appreciate it",
  "url": "https://www.reddit.com/r/bulimia/comments/xrl1un/question_is_it_difficult_for_some_of_you_to_leave/",
  "score": 87,
  "num_comments": 17,
  "comments": [
    {
      "id": "iqfi0e8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1664493037.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iqhlnqo",
      "author": "joellezucker",
      "body": "I cancel on friends a lot because I’m bloated from the night before’s b/p. Bulimia sucks. I’m sorry you’re going through this <3",
      "created_utc": 1664539203.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iqfwa9p",
      "author": "9miumiu9",
      "body": "I had really bad agoraphobia too but what helped me was setting a task to do outside like going grocery shopping or taking transport where possible if walking is too much time outside for my anxiety or meeting a friend outside so I have to leave the house alone or going out with someone and I just remember no one cares and I exist for like 3 seconds in every stranger I meet's life and they aren't going to be focusing on my perceived flaws like I do because we are only really harsh on ourselves",
      "created_utc": 1664499694.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iqgjaz3",
      "author": "JHRChrist",
      "body": "Definitely it made life really hard. I would go to the grocery store and my eyes would always start watering because I felt like everyone was staring at me and judging me and I was so close to crying. It SUCKED and I’m sorry you’re dealing with this anxiety. Ultimately what helped was better medication for my anxiety, ketamine treatments and emdr therapy but in the short term, baggy clothes I felt comfortable/hidden in, and going somewhere that wouldn’t have people I know and just reminding myself that I didn’t exist to these people any more than they did to me. And if I had to be around people I know/working etc I would wear clothes I was reasonably comfortable, not make eye contact, and basically disassociate tbh. Good luck my friend",
      "created_utc": 1664510580.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqh9aqc",
      "author": "D10SMessi",
      "body": "Yeah many times. Altough weirdly enough i don't really care that much about others anymore, im the one that judges myself harshly. In fact i cancelled my plans for tonight. Idk it’s hard to give advice for this because i think all of us on here are very judgemental to ourselves and it’s hard to just get over that feeling. Maybe for short term fixes you may feel more comfortable going out wearing baggier clothes for example? I know i myself feel more comfortable during the fall and winter because i can wear more clothes and feel more hidden.",
      "created_utc": 1664530333.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iqi0uq6",
      "author": "None",
      "body": "I’ve been like this for as long as I can remember! Usually I just put on a hat and sunglasses and leave them on so I don’t feel as weird about people looking at me/they can’t see my face as much. That and just wearing really oversized clothing and accessories so I look and feel more confident\n\nEDIT: also, not sure if you can drive, but when I really can’t be around people but need to get out i just drive. Sometimes after some music I feel a little bit less in my head and end up stopping inside the store or something while I’m out.",
      "created_utc": 1664546637.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iqj0ou4",
      "author": "eatmysaucylasagna",
      "body": "OH MY GOD YES…. Especially if I step on the scale and it’s even an ounce heavier. Destroys any ability I have to be seen in public. I also think my BIGGEST fear is someone recognizing me, and in my head they’re seeing how “gross I’ve become” even if there are no outward changes haha. It’s absolutely ridiculous, and honestly hilarious how stupid my brain is.",
      "created_utc": 1664561094.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iqj3owq",
      "author": "Whatthedarknessdoes",
      "body": "Very difficult to be around anyone right now...I'm trying really hard to get mental health help but it seems pointless honestly. I'm actually homeless but if I'm around people I cover up and wear a mask.",
      "created_utc": 1664562303.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iqjd8s8",
      "author": "beepbeepsadfuck",
      "body": "I just dgaf anymore. Do I love the way I look? No. But I'm not going to let my poor self image take away my life. I have two younger siblings that are my entire world and they LOVE swimming so we go every weekend. I even go shirtless sometimes. Or we'll go out to the park or Dave and busters, I still feel hella self conscious but life is too short to care what strangers think of you",
      "created_utc": 1664566166.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqferue",
      "author": "sry_for_the_edge_lol",
      "body": "Yes",
      "created_utc": 1664491524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqgfw4l",
      "author": "userredactedx",
      "body": "Yes. I never go out anymore unless i have to and then i am wearing sweat pants and hoodies regardless of the weather.",
      "created_utc": 1664508728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqhqbqu",
      "author": "Caramel_whore_",
      "body": "Yes.. I try to stay inside as much as possible and get break downs when I have to go outside",
      "created_utc": 1664541738.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqni0ix",
      "author": "Mrsstradlin",
      "body": "Yesterday I went outside. Actually I am still outside hahaha I don't feel very good but I feel better tan before and of course there are moments when I what to just ripped my skin off if you know what I mean. I am going to try to do hike or that kinda stuff. Thanks :)",
      "created_utc": 1664648132.0,
      "score": 2,
      "context": [
        {
          "id": "iqfi0e8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1664493037.0
        }
      ]
    },
    {
      "id": "iqni6ov",
      "author": "Mrsstradlin",
      "body": "I did that a lot of times. I just feel bloated and feel like a look awful so in ended not going out bcs the discomfort...",
      "created_utc": 1664648206.0,
      "score": 1,
      "context": [
        {
          "id": "iqhlnqo",
          "author": "joellezucker",
          "body": "I cancel on friends a lot because I’m bloated from the night before’s b/p. Bulimia sucks. I’m sorry you’re going through this <3",
          "created_utc": 1664539203.0
        }
      ]
    },
    {
      "id": "iqnilla",
      "author": "Mrsstradlin",
      "body": "Oversized clothes help me a lot I just put them and feel like nobody can actually sees me ... And it's just perfect",
      "created_utc": 1664648383.0,
      "score": 1,
      "context": [
        {
          "id": "iqi0uq6",
          "author": "None",
          "body": "I’ve been like this for as long as I can remember! Usually I just put on a hat and sunglasses and leave them on so I don’t feel as weird about people looking at me/they can’t see my face as much. That and just wearing really oversized clothing and accessories so I look and feel more confident\n\nEDIT: also, not sure if you can drive, but when I really can’t be around people but need to get out i just drive. Sometimes after some music I feel a little bit less in my head and end up stopping inside the store or something while I’m out.",
          "created_utc": 1664546637.0
        }
      ]
    },
    {
      "id": "iqnis9g",
      "author": "None",
      "body": "Right. I think it’s the visual of not being able to see my body shaper but I also HATE feeling my clothes touching my skin… loose clothes make me feel smaller and shapeless underneath bc there’s no contact against my skin",
      "created_utc": 1664648460.0,
      "score": 1,
      "context": [
        {
          "id": "iqi0uq6",
          "author": "None",
          "body": "I’ve been like this for as long as I can remember! Usually I just put on a hat and sunglasses and leave them on so I don’t feel as weird about people looking at me/they can’t see my face as much. That and just wearing really oversized clothing and accessories so I look and feel more confident\n\nEDIT: also, not sure if you can drive, but when I really can’t be around people but need to get out i just drive. Sometimes after some music I feel a little bit less in my head and end up stopping inside the store or something while I’m out.",
          "created_utc": 1664546637.0
        },
        {
          "id": "iqnilla",
          "author": "Mrsstradlin",
          "body": "Oversized clothes help me a lot I just put them and feel like nobody can actually sees me ... And it's just perfect",
          "created_utc": 1664648383.0
        }
      ]
    }
  ]
}