{
  "id": "xu6g38",
  "subreddit": "bulimia",
  "author": "bonusbobcat",
  "created_utc": 1664762521.0,
  "title": "just because I've gained doesn't mean I'm recovered",
  "selftext": "For some reason, my eating disorder is now causing me to gain weight. Everyone keeps thinking I've recovered because of this. I'm so far from recovered that it's laughable. I wish people didn't make assumptions based on my weight. My electrolytes are all a mess and I'm very unwell despite my weight being restored I'm actually more unwell than I was when I was underweight.",
  "url": "https://www.reddit.com/r/bulimia/comments/xu6g38/just_because_ive_gained_doesnt_mean_im_recovered/",
  "score": 67,
  "num_comments": 2,
  "comments": [
    {
      "id": "iqug1f1",
      "author": "mystarinthesky",
      "body": "the concept of an ED being based in thoughts and behaviors, not body weight, is so impossible for the average person to grasp.\n\nbut even a well intended, educated person falls into that trap. for me, my mom asked me how \"my eating\" was going for months after i moved out, until i gained 20 pounds and she no longer acts concerned. and things are worse than ever.\n\nit's a crushing feeling, like even if i may not have been accepting of support before its so invalidating for the concern to be gone when my distress is ever so present.\n\nsorry to ramble on your post. all's to say, i relate and im sorry you're going through this ❤️",
      "created_utc": 1664770545.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iqupmf7",
      "author": "None",
      "body": "People, family actually still shame me for (\"obviously not\")eating because my BMI now barely hits 20. At my worst my BMI probably sat around 16-17 and I was probably a 00. It's like they are pissed I'm not suddenly obese.\n\nThere's no point in saying to them well actually I am a healthy weight and eat 2000 calories a day i engage in that behaviour (binge+purge) 3 times a week, which is external from the 2000 calories now rather than 20 times a week and I'm no longer striving to maintain an anorexic body.\n\nIt's like they want me to be extremely unfit and overweight and feel gross and unhealthy to be normal. I haven't picked up a phonecall from that family member in 10 months.",
      "created_utc": 1664777169.0,
      "score": 7,
      "context": []
    }
  ]
}