{
  "id": "y0xc57",
  "subreddit": "bulimia",
  "author": "Insomnialover101",
  "created_utc": 1665455627.0,
  "title": "If I COULD TURN BACK TIME",
  "selftext": "I am 43 yrs old. I have been bulimic since I was 12. The physical damage I have done to myself is irreversible. I used to have perfect teeth and now I have both a full set of top and bottom dentures. I started menopause at 40. I am a qualified scientist specialising in cancer research and forensic science. Because of bulimia I can't hold down a job for more than three months. I was married once and it lasted for 3 years and it was as a direct result of my eating disorder that it ended in divorce. Now I am living with my elderly parents and to be brutally honest I feel like a total failure/loser and a waste of space. If this post reaches just 1 person then I am happy I found the courage to write it. \nGet help. Live your life. Don't end up like me xx",
  "url": "https://www.reddit.com/r/bulimia/comments/y0xc57/if_i_could_turn_back_time/",
  "score": 178,
  "num_comments": 12,
  "comments": [
    {
      "id": "irusvx4",
      "author": "Realistic-Shallot288",
      "body": "I’m so sorry… it makes me want to cry and hug you. And at the same time it terrifies me. How to we get out of this shit? This is pure insanity every night I’m telling myself that tomorrow I’ll try harder and every morning I fall short of expectations… at this point I just feel hopeless, scared and hopeless.",
      "created_utc": 1665464534.0,
      "score": 39,
      "context": []
    },
    {
      "id": "irumb95",
      "author": "9miumiu9",
      "body": "first of all I want to say thank you for writing this and you aren't a failure at all many of us fall victim to mental illnesses that isn't a reflection on our worth as an individual and you mention that you're a scientist you're clearly academic intelligent and caring and so much more that I probably don't know yet it sucks that eating disorders have such an effect on family friends social lives jobs etc but once again none of that is your fault but there are many people who are willing to support their partners with mental illnesses and you still have time to find one if you want a partner in the future\n\nI feel like one thing that capitalism has ingrained in us is that we have to be doing something and we have to constantly prove ourselves in order to have any worth but existing is enough focusing on yourself and your health and happiness is enough whether you live at your parents' house or struggle with employment none of those make you a loser you're clearly a talented qualified individual and just need support and treatment for your bulimia we all need support as humans and relying on your support network in times of need is completely fine \n\nI'm 17 and developed bulimia 2 years ago but I've struggled with binge ed my entire life so this was emotional to read I really resonate with the feeling of isolation and just wanting to blame yourself for letting it get bad and letting it affect so much of your life I missed my end of year exams this year and just lost a lot of faith in myself to carry on even though my school were going to apply for me to go to oxbridge but I'm starting ed treatment now and it's going to be full time monday to friday so I won't give up on myself I know I'm capable of recovery and I'm grateful for people like you who share their stories and I hope you know you aren't alone and no one has given up on you either you deserve recovery and can do it! :)",
      "created_utc": 1665460433.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iruv5na",
      "author": "JustAGirl_1111",
      "body": "It is not too late yet to do anything that makes you happy!! You're alive and your maybe able to live another 43 years. Your eating disorder didn't kill you - even if I'm sure it caused a lot of damage. See this as a sign. You're so strong for surviving all of this! That doesn't make you a failure at all, it makes you so strong!! Don't waste another 20 years with your ed. You can overcome this!!\nThink about what you want in life. I'm sure you have plans yet. Where would you like to go? What would you like to do? What do you need to be happy? There is so much more to life than making it depended by a single number! Come on get up, don't pity yourself!! I believe in you!! Sending love <3",
      "created_utc": 1665466132.0,
      "score": 11,
      "context": []
    },
    {
      "id": "irxs4pp",
      "author": "coffeeandascone",
      "body": "I'm 39 and wasted 16 years on this. I've been able to hide it or cope better, but it's still the worst burden of my life. I'm just sending you gentle hugs.",
      "created_utc": 1665521154.0,
      "score": 8,
      "context": []
    },
    {
      "id": "irx16tq",
      "author": "mandanic",
      "body": "You’re not a waste bc this IS helping someone. The what ifs and wasted time and regrets are some of the worst part of this illness. It robs us of life. It robs us of health. It takes, takes, takes. One more day in bulimia is one too many. I hope you and anyone else struggling starts to take back, bc it’s never too late ❤️",
      "created_utc": 1665510835.0,
      "score": 6,
      "context": []
    },
    {
      "id": "irv8ien",
      "author": "iqinfinity",
      "body": "This is terrifying. I'm so sorry 💜",
      "created_utc": 1665477404.0,
      "score": 3,
      "context": []
    },
    {
      "id": "irvvd84",
      "author": "o0SinnQueen0o",
      "body": "Honestly You're very similar to a person I know but she ruined everything completely and she ruined me. But there's something  different about You. I know this type of words are throwaway and won't help You but that's something I need to tell You. You have inner Good, something that she lacked. I've been places and I've seen complete failures. You're not a failure to me. You have inner worth. You don't blame others for what's going on with You now, You're self-aware, You worked hard for Your education. Most people lack this.",
      "created_utc": 1665493609.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isjmwma",
      "author": "Informal-Ad-7356",
      "body": "There is Hope!  I'm 50 and my 2nd try at Recovery.   This time it seems to be sticking. But took Surrender and Acceptance. Societal expectations/definitions of Beauty can kill.  35 years with ED.  Recovery is incredibly hard, but Freedom is so Sweet!  And honestly. When I look around in the real world with my new body?   I fit right in.",
      "created_utc": 1665930060.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iryzzgr",
      "author": "No-Way-1195",
      "body": "I’m so sorry, OP. I still believe there’s hope for you, too! You’re not a failure, or a waste! You’re a scientist, and an absolutely bloody brilliant one at that, maybe you could find a way to share your story to help others!",
      "created_utc": 1665540779.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irv1bfv",
      "author": "personal__hell",
      "body": "🤍",
      "created_utc": 1665470975.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jdxif29",
      "author": "None",
      "body": "I’m 20. I’m considering ending my life. It’s been 4 years of daily purging.",
      "created_utc": 1679956024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivmfftj",
      "author": "None",
      "body": "It’s funny I always hear “your feelings are valid” “explore your emotions” but I do my best when I shove that shit deep down… I start slipping back into old habits if I ever think about my feelings too much.\n\nMy advice to you: Shove it down. Move on. Avoid your feelings at all costs. Eventually you will gaslight yourself into believing you’re ok",
      "created_utc": 1667955014.0,
      "score": 1,
      "context": [
        {
          "id": "irusvx4",
          "author": "Realistic-Shallot288",
          "body": "I’m so sorry… it makes me want to cry and hug you. And at the same time it terrifies me. How to we get out of this shit? This is pure insanity every night I’m telling myself that tomorrow I’ll try harder and every morning I fall short of expectations… at this point I just feel hopeless, scared and hopeless.",
          "created_utc": 1665464534.0
        }
      ]
    }
  ]
}