{
  "id": "y22jkd",
  "subreddit": "bulimia",
  "author": "poisonedminds",
  "created_utc": 1665577497.0,
  "title": "dentist appointment: if you need a sign not to purge today, let this be it",
  "selftext": "So I was at the dentist yesterday for the first time in two years (appointments got delayed due to covid). These have been my worst two years ed-wise. \nI am only 20 years old and my teeth are completely fucked. My dentist was shocked to see how such a young person could have such disgusting teeth. \n\nThe dentist says my teeth are completely flat from erosion, especially in the back. There's no enamel left at all. This explains why my teeth feel rough and not smooth. I also have gum recession and a lot of cavities, some of which are visible and painful, and three of which will need immediate repairing (i already got an appointment). \n\nThey kinda took me aside to talk about what the causes of this mess could be and straight up asked if i had a problem with nausea or regurgitation. I just admitted to having food issues and the lady was like \"oh. Bulimia.\" and I wanted to sink into the ground. She was sweet though, she told me the usual aftercare (not brushing immediately after, etc) and I got a prescription for a special toothpaste with extra fluoride.  \n\nBut instead of going to buy toothpaste, my dumbass immediately went to buy binge food after the appointment because I do. Not. Know. How. To. Cope. With. Stress. \nI'm so fucked.",
  "url": "https://www.reddit.com/r/bulimia/comments/y22jkd/dentist_appointment_if_you_need_a_sign_not_to/",
  "score": 80,
  "num_comments": 7,
  "comments": [
    {
      "id": "is13rgj",
      "author": "AnaDion94",
      "body": "Ngl not wanting to have to tell my dentist I relapsed is like… 20% of my recovery motivation. They’re so proud of me and I crave validation 😭",
      "created_utc": 1665587883.0,
      "score": 27,
      "context": []
    },
    {
      "id": "is1gn07",
      "author": "sonic2cool",
      "body": "oh no. my last appointment was 3 years ago just before the lockdown. they usually send a letter through the door reminding you to book an appointment. this is so embarassing and disgusting but on top of bulimia ive struggled to brush my teeth twice a day like especially in the evenings so i dread to hear what my teeth are like. \n\nive been bulimic since 14 and only a year in they told me the enamel is bad, i never understood until now why that was & you'd think that would be motivation to stop and look after myself but the ed and feelings of depression always wins",
      "created_utc": 1665592982.0,
      "score": 16,
      "context": []
    },
    {
      "id": "is25gxd",
      "author": "brittycent13",
      "body": "I have been in recovery for about 10 years. My main and primary reason for entering and maintaining recovery was my teeth. Obviously I had many reasons to pursue recovery, but that was and is still the main reason to this day.",
      "created_utc": 1665602664.0,
      "score": 9,
      "context": []
    },
    {
      "id": "is0yurl",
      "author": "chronaloid",
      "body": "Oh no oh no oh no. I’m close to your age, 21, and have my first dentist appointment in 2-3 years this week. Will probably end up the same. I’m so sorry, but I’m really glad they treated you with kindness and special toothpaste. Take care as best you can, and thank you for sharing your experience :)",
      "created_utc": 1665585859.0,
      "score": 9,
      "context": []
    },
    {
      "id": "is3a9p0",
      "author": "None",
      "body": "That rx toothpaste is the bees knees! I've been using it on and off for about 10 years and I don't get cavities often",
      "created_utc": 1665619296.0,
      "score": 4,
      "context": []
    },
    {
      "id": "is4qeap",
      "author": "insomniac_queen1",
      "body": "Me too I haven't had an appointment since before lockdown and I'm so scared to go now",
      "created_utc": 1665649437.0,
      "score": 3,
      "context": [
        {
          "id": "is1gn07",
          "author": "sonic2cool",
          "body": "oh no. my last appointment was 3 years ago just before the lockdown. they usually send a letter through the door reminding you to book an appointment. this is so embarassing and disgusting but on top of bulimia ive struggled to brush my teeth twice a day like especially in the evenings so i dread to hear what my teeth are like. \n\nive been bulimic since 14 and only a year in they told me the enamel is bad, i never understood until now why that was & you'd think that would be motivation to stop and look after myself but the ed and feelings of depression always wins",
          "created_utc": 1665592982.0
        }
      ]
    },
    {
      "id": "is4s8pc",
      "author": "sonic2cool",
      "body": "so glad i’m not alone. i doubt they’ll ever send a letter through for me anyway as it’s been so long",
      "created_utc": 1665651127.0,
      "score": 2,
      "context": [
        {
          "id": "is1gn07",
          "author": "sonic2cool",
          "body": "oh no. my last appointment was 3 years ago just before the lockdown. they usually send a letter through the door reminding you to book an appointment. this is so embarassing and disgusting but on top of bulimia ive struggled to brush my teeth twice a day like especially in the evenings so i dread to hear what my teeth are like. \n\nive been bulimic since 14 and only a year in they told me the enamel is bad, i never understood until now why that was & you'd think that would be motivation to stop and look after myself but the ed and feelings of depression always wins",
          "created_utc": 1665592982.0
        },
        {
          "id": "is4qeap",
          "author": "insomniac_queen1",
          "body": "Me too I haven't had an appointment since before lockdown and I'm so scared to go now",
          "created_utc": 1665649437.0
        }
      ]
    }
  ]
}