{
  "id": "y4f7xv",
  "subreddit": "bulimia",
  "author": "nicksgavemeruns",
  "created_utc": 1665810628.0,
  "title": "I am 36 days clean today.",
  "selftext": "If you look at my post history, you’ll find a post from last month about the most terrifying night of my life. This is the update. I am still going strong. 36 days purge free. The longest I’ve ever gone in years. I still have the occasional “binge” but the magnitude is multiple orders of severity better than when I was still purging. My binges now aren’t me eating the entire contents of the pantry and fridge in the span of an hour. Or eating a tub of PB in 20 minutes only to make myself violently sick. Now a “bad day” is me eating 5 TBSPs of PB over the course of a day. It’s eating two frozen dinners instead of the 6 I bought. It’s getting a double scoop of ice cream with friends instead of emptying a half gallon tub that I picked up impulsively from the grocery store while hiding in my room. \n\nI’ve gained a good 10 lbs but I’m not gaining anymore. This weight is temporary. It’s a small price to pay for the time and money I’ve saved and the mental peace that has come with stopping. I can already feel my urges to eat more than I need subsiding, so I’m sure I can lose it eventually in a healthy way but right now my recovery comes first. If you’re thinking about recovery, I really do wish you the absolute best of luck. This is such a horrific disease and I wouldn’t wish it upon my worst enemy. Take care <3",
  "url": "https://www.reddit.com/r/bulimia/comments/y4f7xv/i_am_36_days_clean_today/",
  "score": 77,
  "num_comments": 5,
  "comments": [
    {
      "id": "ise36k7",
      "author": "PinkyOutYo",
      "body": "Hi, friend. This is absolutely amazing, and I'm pretty sure I speak for everyone when I say we are so, SO proud of you. It's such a brave and strong thing you're doing, and I'm sure you're an inspiration to people thinking about recovery. \n\nGive yourself a high five from me; you are awesome.",
      "created_utc": 1665818325.0,
      "score": 6,
      "context": []
    },
    {
      "id": "isdul3t",
      "author": "True-Ad4667",
      "body": "That’s absolutely amazing!! Go you! ❤️ May I ask you if you feel any different (mentally and physically) now you’re free from it for so long?",
      "created_utc": 1665811492.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ise0s1h",
      "author": "kathja71",
      "body": "It is an amazing response and thank you for it! Wow, it is so cool to hear of progress. You are deserving of every bit of your efforts.\nYou sound like you have been kind to yourself along the way. So important!",
      "created_utc": 1665816321.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isdw51i",
      "author": "nicksgavemeruns",
      "body": "Thank you <3\n\nPhysically? I’m not freezing all the time anymore.  I used to think only underweight people get cold from EDs. Totally untrue. Even at the worst of it, I have always been a normal weight, yet my hands and feet felt like icicles all the time and I would have two layers on while everyone else was in shorts. I don’t get dizzy when I stand up too fast. I don’t wake up with a throat ripped to shreds every few days. \n\nI will say it’s not all good things though. I do feel sluggish from the weight I’ve gained. I can feel my clothes getting tighter which makes me very uncomfortable, yet somehow the panic that I used to feel is gone. \n\nMentally? The amount of time and money that bulimia robs you of is enough to make the most sane person spiral into a pit of stress and depression. And for yours truly who was already far from sane? Go figure. I don’t overanalyze what I’m eating nearly as much, even though I do make a best-effort attempt to not go off the rails everyday. It’s a positive feedback cycle because the more I keep myself in check, the less worried I am about what I eat. I’m not sure how to describe what I’ve been feeling lately, to be honest, but calm is probably the closest word for it. This isn’t my first attempt at recovery and I’m not sure why this feels so different from all the other times. It’s like a switch flipped, which I hate to say because it’s useless for anyone reading who’s trying to recover but I’m not sure what it is.\n\nThis was a long-winded response but I hope it helps :)",
      "created_utc": 1665812635.0,
      "score": 6,
      "context": [
        {
          "id": "isdul3t",
          "author": "True-Ad4667",
          "body": "That’s absolutely amazing!! Go you! ❤️ May I ask you if you feel any different (mentally and physically) now you’re free from it for so long?",
          "created_utc": 1665811492.0
        }
      ]
    },
    {
      "id": "isfictc",
      "author": "clumsycouture",
      "body": "Congrats! I quit on my 5th year of being bulimic and anorexic. I’m going on my 11th year anniversary this January. If your can see a therapist I would recommend it. The mental aspects of it are the hardest part. I no longer have urges to binge eat or restrict but I’ve never ate breakfast even as a child so I have a tendency to fast accidentally. I used to always be cold, and always constipated. I love pooping. I will poop anywhere I do not care. I hate being constipated. \n\nI just had 6k worth of dental work done bc of problems stemming from purging. My teeth didn’t start rotting until after I stopped.",
      "created_utc": 1665850397.0,
      "score": 2,
      "context": [
        {
          "id": "isdul3t",
          "author": "True-Ad4667",
          "body": "That’s absolutely amazing!! Go you! ❤️ May I ask you if you feel any different (mentally and physically) now you’re free from it for so long?",
          "created_utc": 1665811492.0
        },
        {
          "id": "isdw51i",
          "author": "nicksgavemeruns",
          "body": "Thank you <3\n\nPhysically? I’m not freezing all the time anymore.  I used to think only underweight people get cold from EDs. Totally untrue. Even at the worst of it, I have always been a normal weight, yet my hands and feet felt like icicles all the time and I would have two layers on while everyone else was in shorts. I don’t get dizzy when I stand up too fast. I don’t wake up with a throat ripped to shreds every few days. \n\nI will say it’s not all good things though. I do feel sluggish from the weight I’ve gained. I can feel my clothes getting tighter which makes me very uncomfortable, yet somehow the panic that I used to feel is gone. \n\nMentally? The amount of time and money that bulimia robs you of is enough to make the most sane person spiral into a pit of stress and depression. And for yours truly who was already far from sane? Go figure. I don’t overanalyze what I’m eating nearly as much, even though I do make a best-effort attempt to not go off the rails everyday. It’s a positive feedback cycle because the more I keep myself in check, the less worried I am about what I eat. I’m not sure how to describe what I’ve been feeling lately, to be honest, but calm is probably the closest word for it. This isn’t my first attempt at recovery and I’m not sure why this feels so different from all the other times. It’s like a switch flipped, which I hate to say because it’s useless for anyone reading who’s trying to recover but I’m not sure what it is.\n\nThis was a long-winded response but I hope it helps :)",
          "created_utc": 1665812635.0
        }
      ]
    }
  ]
}