{
  "id": "z03p3g",
  "subreddit": "bulimia",
  "author": "xStingx",
  "created_utc": 1668949655.0,
  "title": "I haven't purged in weeks and lost weight.",
  "selftext": "So. I decided to give up bulimia. Well, to be honest,  I didn't have a choice. I moved in with my mother due to financial hardship and at first, I tried to purge but it was too complicated seeing as her room is right next to the bathroom. I stopped cold turkey and decided that this was a way out. \n\nI've also not binged. It's surprising that it was that easy but all I had to do was really trust myself. I gave myself certain foods that I could eat that made me feel comfortable enough not to purge and that really helped. I still eat things I really like but I have to remind myself that If I binge, I will want to purge and I'm so tired of feeling bloated, dry, dizzy, depressed, and ashamed from purging. Also, my teeth were really shrinking it seemed. \n\nI also preoccupied myself with a sport/hobbies. I've started running and I'm using the time I spent binging and purging to put more time into learning a language I've been working on advancing in this year.\n\nI know what you're thinking! ”You're running, that's why you lost weight.\" Wrong. I've only just started running about a week ago and it's only been one mile which only burns about 100 calories. Also, I injured myself running so I haven't run in four days now and I got on the scale this morning and I lost weight. \n\nIf you're scared to stop purging. Don't be. I don't really have uncomfortable bloat and with purging, I just lost and gained the same three pounds all year! Who TF wants to go through this disorder and only \"seemingly\" lose three pounds? \n\nI realized purging was just a way for me to get out the anger, dread, and hurt that I felt within myself and whilst I still have those feelings, now I get them out productively.",
  "url": "https://www.reddit.com/r/bulimia/comments/z03p3g/i_havent_purged_in_weeks_and_lost_weight/",
  "score": 98,
  "num_comments": 15,
  "comments": [
    {
      "id": "ix5fkkn",
      "author": "meowawwa",
      "body": "Congratulations!!! ❤️❤️\nThis has really inspired me to try to start recovery again thank you :')",
      "created_utc": 1668981454.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ix3wbl4",
      "author": "Key_Researcher_1634",
      "body": "🤍🤍",
      "created_utc": 1668959210.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ix4mv1g",
      "author": "Leaffan99forlife",
      "body": "Congratulations on your recovery ❤️‍🩹",
      "created_utc": 1668970023.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ix6cjqz",
      "author": "None",
      "body": "Needed to read this. Thanks.❤️",
      "created_utc": 1668996398.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ix5myvv",
      "author": "burntbroccoliass",
      "body": "This is awesome! Congratulations on your recovery! ❤️",
      "created_utc": 1668984657.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ix8gjee",
      "author": "Weary_Entrepreneur49",
      "body": "This is amazing!!!! go you!!! I felt hopeless for so many years too but there IS a light at the end of the tunnel and you’re never too far gone. And I know exactly what you’re saying about the weight thing bc it’s been the same for me. I’m actually thinner than I ever was while bulimic. I view my food now more like a checks and balances system (but trust me, I still have freak out moments!) but now instead of eating a “bad” food just bc I deemed it a no-no, I’ll decide what I really want to splurge my calories on and then I enjoy it more. I’ve also learned to stop and eat more slowly and savor my food",
      "created_utc": 1669045082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix6tqmd",
      "author": "Candid-Classic5839",
      "body": "I have not completely given up purging but also have more energy to do things I have planned to do when I purge less. I started weight training again which alleviates those chronic back and neck pain a lot. I hope I can get rid of this completely like you.",
      "created_utc": 1669005182.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix8628o",
      "author": "ouid69",
      "body": "This is so freakin awesome! Congrats. Hopefully I’ll be on the same page soon.",
      "created_utc": 1669040414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixdxgi2",
      "author": "None",
      "body": "Congrats! I have the experience, literally i gain weight whenever im in a heavy b&p phase",
      "created_utc": 1669142413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0kuj4b",
      "author": "Express_Possibility5",
      "body": "The last paragraph is really powerful. Thank you and huge congratulations - I hope it's still going well.",
      "created_utc": 1671279859.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix6qd5u",
      "author": "xStingx",
      "body": "I believe in you! Even if you mess up through trial and error, giving up part of the self you 'think' you are will allow you to replace it with who you truly are.",
      "created_utc": 1669003345.0,
      "score": 3,
      "context": [
        {
          "id": "ix5fkkn",
          "author": "meowawwa",
          "body": "Congratulations!!! ❤️❤️\nThis has really inspired me to try to start recovery again thank you :')",
          "created_utc": 1668981454.0
        }
      ]
    },
    {
      "id": "ix6q2wo",
      "author": "xStingx",
      "body": "💙",
      "created_utc": 1669003192.0,
      "score": 1,
      "context": [
        {
          "id": "ix3wbl4",
          "author": "Key_Researcher_1634",
          "body": "🤍🤍",
          "created_utc": 1668959210.0
        }
      ]
    },
    {
      "id": "ix6q5nt",
      "author": "xStingx",
      "body": "<3",
      "created_utc": 1669003234.0,
      "score": 1,
      "context": [
        {
          "id": "ix4mv1g",
          "author": "Leaffan99forlife",
          "body": "Congratulations on your recovery ❤️‍🩹",
          "created_utc": 1668970023.0
        }
      ]
    },
    {
      "id": "ix6qest",
      "author": "xStingx",
      "body": "Thank you as well. 💚💚",
      "created_utc": 1669003370.0,
      "score": 1,
      "context": [
        {
          "id": "ix6cjqz",
          "author": "None",
          "body": "Needed to read this. Thanks.❤️",
          "created_utc": 1668996398.0
        }
      ]
    },
    {
      "id": "ix6qdq5",
      "author": "xStingx",
      "body": "Thank you so much.",
      "created_utc": 1669003354.0,
      "score": 2,
      "context": [
        {
          "id": "ix5myvv",
          "author": "burntbroccoliass",
          "body": "This is awesome! Congratulations on your recovery! ❤️",
          "created_utc": 1668984657.0
        }
      ]
    }
  ]
}