{
  "id": "z6gs9l",
  "subreddit": "bulimia",
  "author": "None",
  "created_utc": 1669593089.0,
  "title": "My child binged and purged on thanksgiving",
  "selftext": "I have a child who is 15. To my knowledge, she just began purging by forcing vomiting. I have had bulimia for 20 years. She has been living with her dad and stepmom (uh) since 2017. They are not bulimic. The stepmom encourages restricting and has used food as a control and shaming mechanism I’ve grown to realize. Her stepmom is very thin without a curvy figure. My child grew more self conscious about having hips and a more full lower body. She is average weight, 130lbs at 5’3, athletic. I did not know she started purging until i saw it. Because im very familiar with the misery of the disease, I went to the bathroom. I should have hugged her and held her immediately. I was in shock and said the word purging to her. I did not want her to have that inner secret world about it (but i also know this is impossible because of fear and shame). \n\nI believe starting wrestling at school triggered the purging. She just joined and just started purging… and subsequent binging. \n\nI remember myself at her age. \n\nShe does not want me to talk to her dad. Not about this. Not really at all. \n\nMy mother is dramatizing it more and making it difficult to think this through rationally. \n\nI need helpful wisdom. Words to say, how to reach her, how to talk to the wrestlers and coach and school. I will even give a formal speech at the school about the disease, my experiences, emphasizing the importance of committing to recovery ASAP. \n\nShe is beautiful and bright and strong. She has social barriers that are partially in her mind and partially due to her fathers controlling nature. Her dad and stepmom revere and celebrate the biological child they had together who is now 6. They are neglecting my daughter and son. \n\nI am calling legal aid this week. I’m not financially able to not work and focus solely on this but it’s been all i can think about. \n\nHow do I talk with her? How does one find social support? \n\nShe spent $10 of her money on junk food and purged it. This is how the cycle with money and junk food starts. I need to become a stronger safety net. \n\nThe only reason my own ED has slowed is because my appetite and metabolism have slowed with age. I am 37. I remember high school feeling like a prison because of how public school is, and social dynamics such as other children and parents, and especially… pressure.\n\nShe needs a new counselor/therapist, but she needs healthy friends and attachments and to not be in the middle of custody “battle”. She has been growing more ocd and perfectionistic. I think instagram is a trigger. Are there tools to teach a child how to navigate social media without being sucked in? \n\nI need to apply for grad school. I don’t think treatment is the only way out because it didn’t help me stop. I think being in nature or a new environment could help but am unsure. \n\nMy mom triggers me, because my mom was the first person in my life who was controlling about food and weight. I have never criticized my child’s body. My mom criticized mine. So the hurt has to be from the stepmom and my ex (her dad). How do i protect her from these forces that seem overwhelming and all-powerful?",
  "url": "https://www.reddit.com/r/bulimia/comments/z6gs9l/my_child_binged_and_purged_on_thanksgiving/",
  "score": 86,
  "num_comments": 11,
  "comments": [
    {
      "id": "iy1zxno",
      "author": "dalexearnhardtsghost",
      "body": "I just want to say, you sound like an awesome mom. This made me cry to know that a parent cares so so so much and actually wants to help in a way that is not harmful and doesn’t instigate episodes. \nThankyou so much for being a good mom",
      "created_utc": 1669605759.0,
      "score": 43,
      "context": []
    },
    {
      "id": "iy1jxfk",
      "author": "TranZeitgeist",
      "body": "Just want to applaud you for caring and noticing her. I think hearing some of your experience ( not like, \"gory details\" lol, but what you shared here) could help her - no scare tactics, but you seem to have a lot of insight about how other people influence body image and self esteem and eating habits. Don't make anyone look like an enemy or bad guy, but help her recognize that outside influences can maybe make someone do stuff that isn't really them, or doesn't fit their values.\n\nWrestling seems to trigger a lot of people, I've read other histories here from wrestlers. Possibly she even learned it from that environment, it almost seems like \"common knowledge\" in some groups, including wrestlers. Social media probably is a trigger, would be surprised if it's not. And that's if she's avoiding the \"pro-ED\" and other body-focused influences.\n\n>She does not want me to talk to her dad. Not about this. Not really at all.\n\nYeah, and if that brings up some memories for you, or past anxieties, it makes sense that it could be hard to think straight about what to do. At the same time, she is a child, and your partner's child. He probably is owed a conversation. And unfortunately, there is a real risk of enabling when we agree to help someone hide or lie or avoid possible consequences of their actions. It can also send the message that she can kind of take control, control who knows, what they know - it all fits with a very, very common ED habit of \"Deny and conceal\". Like sure, a weekly therapy meeting might not solve the issue, and still the right thing to do doesn't involve lying and hiding, nor assuming the role of fixer/ caretaker/ therapist yourself. Your instinct is right probably that she needs more support, more positive social connection and options - it's too easy for someone to find an enabler and close off more and more, in which case you probably feel more and more helpless and enmeshed over time. I think you can be a unique and positive part of the support system though.\n\n[https://www.cci.health.wa.gov.au/-/media/CCI/Mental-Health-Professionals/Eating-Disorders/Eating-Disorders---Information-Sheets/Eating-Disorders-Information-Sheet---13---Information-for-Carers.pdf](https://www.cci.health.wa.gov.au/-/media/CCI/Mental-Health-Professionals/Eating-Disorders/Eating-Disorders---Information-Sheets/Eating-Disorders-Information-Sheet---13---Information-for-Carers.pdf)\n\n[http://www.maudsleyparents.org/bulimianervosa.html](http://www.maudsleyparents.org/bulimianervosa.html)\n\n[https://www.feast-ed.org/family-guide-series/](https://www.feast-ed.org/family-guide-series/)\n\n[https://eatingdisordersreview.com/denying-and-concealing-eating-disorders/](https://eatingdisordersreview.com/denying-and-concealing-eating-disorders/)",
      "created_utc": 1669598040.0,
      "score": 21,
      "context": []
    },
    {
      "id": "iy2o6aa",
      "author": "treyj88",
      "body": "i’ll be the devils advocate here and say a couple things. eating disorders are heritable. this is not an uncommon occurrence when a child ends up with the same ED as their mother, although i noticed that you put it all on the step mother. due to not knowing the relationship dynamics here, i’m not saying it isn’t her fault or that she ideologically does not have some part to play. just mentioning the fact that EDs are heritable.\n\nspeaking of your relationships, you mention that she’s been living with dad and step mom. how is your relationship with her? are you being honest with yourself that the way you’ve raised her to this point has not played any role? do you still have a good enough relationship with her that she actually wants you to be a part of this aspect of her life? not accusing you of anything, i’m just asking questions.\n\ndoes she know that YOU have an ED? you didn’t mention. you haven’t been able to stop after 20 years. how do you think you’re going to be able to help her? by talking to her coaches and teachers? you of all people should realize how terrible of an idea that is. \n\n“hey guys this is my daughter and she has this habit of vomiting her food because she’s self conscious. not like it’s embarrassing or a private issue or nothing i just want to tell everyone”\n\non a surface level, attempting to give a speech at her school about the dangers of bulimia sound great. but would your daughter really want her mom on stage in front of the school talking about eating disorders? talk about all eyes on her. that’s probably the last thing she wants. \n\ndo you really think that’s the best idea? would you want your mother to go to your job and tell all of your managers, friends, and co workers the same thing about you? probably not right?\n\nonce again, is she aware that you struggle with the same thing? if not, you should tell her. the first step in helping someone and gaining their trust is to be relatable. maybe you can both go to counseling together. this will be a delicate issue. you shouldn’t force your way into this topic. if it were me, i would start the conversation anecdotally using a story about my own struggles and make sure she is in a talking mood. if you want her to open up you have to be vulnerable too. \n\na final note, social media and instagram is destroying the youth. eating disorders, depression, suicides are all on the rise in the age of social media(and highest in teen girls). i’m not sure what the best course of action is there. you could of course try to talk to dad and come to an agreement that social media is bad and forbid it, but that will of course cause resentment. that’s a parenting decision i’m not qualified to help with.",
      "created_utc": 1669621095.0,
      "score": 16,
      "context": []
    },
    {
      "id": "iy325t5",
      "author": "EverydayYay",
      "body": "I would definitely talk to her coaches or see if you can sit in on practices. I was a wrestler and they fudged my height so I could wrestle lower weights. They taught us how to cut water weight day of. There was regular discussions from my team of nightmares about drinking water and being over on weigh in, guys passed out while wearing garbage bags under sweats, they’d blast the heat while make us do drills non stop for a couple hours. You’d get so much shit if you were over your weight, and the heavy weights always had mean names thrown at them. I went from disordered eating to anorexia with some b/p for 9 years. I’ve been in recovery for a year now but sometimes I still hear little voices over certain foods/eating at certain times\n\nCoaches are supposed to be aware of EDs and work around it for a weight centric sport, but some are so caught up in success they almost seem to push for it.",
      "created_utc": 1669633428.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iy4yq4i",
      "author": "supermarket_Ba",
      "body": "Wrestling is a really hard sport for people with ED because of the weigh ins and need to maintain or lose for a lowest possible weight class. If I were you I’d maybe encourage her to try a sport that has less of a focus on weight?",
      "created_utc": 1669665805.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iy56uqd",
      "author": "recoverybitches",
      "body": "My mom fully ignored it when she found out so I applaud you for this noticing her seeing her",
      "created_utc": 1669668945.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iy5bqxh",
      "author": "Auddio",
      "body": "I second wrestling being a trigger. \n\nI'm married to a former wrestler, and my step-son is a varsity wrestler this year. I worry about him adopting more ED behaviors to help him 'make weight,' as I've heard MANY stories about 'tricks' that my husband (and several others over my lifetime) said were pretty pervasive in wrestling culture, many of which are ED behaviors.",
      "created_utc": 1669670856.0,
      "score": 3,
      "context": [
        {
          "id": "iy1jxfk",
          "author": "TranZeitgeist",
          "body": "Just want to applaud you for caring and noticing her. I think hearing some of your experience ( not like, \"gory details\" lol, but what you shared here) could help her - no scare tactics, but you seem to have a lot of insight about how other people influence body image and self esteem and eating habits. Don't make anyone look like an enemy or bad guy, but help her recognize that outside influences can maybe make someone do stuff that isn't really them, or doesn't fit their values.\n\nWrestling seems to trigger a lot of people, I've read other histories here from wrestlers. Possibly she even learned it from that environment, it almost seems like \"common knowledge\" in some groups, including wrestlers. Social media probably is a trigger, would be surprised if it's not. And that's if she's avoiding the \"pro-ED\" and other body-focused influences.\n\n>She does not want me to talk to her dad. Not about this. Not really at all.\n\nYeah, and if that brings up some memories for you, or past anxieties, it makes sense that it could be hard to think straight about what to do. At the same time, she is a child, and your partner's child. He probably is owed a conversation. And unfortunately, there is a real risk of enabling when we agree to help someone hide or lie or avoid possible consequences of their actions. It can also send the message that she can kind of take control, control who knows, what they know - it all fits with a very, very common ED habit of \"Deny and conceal\". Like sure, a weekly therapy meeting might not solve the issue, and still the right thing to do doesn't involve lying and hiding, nor assuming the role of fixer/ caretaker/ therapist yourself. Your instinct is right probably that she needs more support, more positive social connection and options - it's too easy for someone to find an enabler and close off more and more, in which case you probably feel more and more helpless and enmeshed over time. I think you can be a unique and positive part of the support system though.\n\n[https://www.cci.health.wa.gov.au/-/media/CCI/Mental-Health-Professionals/Eating-Disorders/Eating-Disorders---Information-Sheets/Eating-Disorders-Information-Sheet---13---Information-for-Carers.pdf](https://www.cci.health.wa.gov.au/-/media/CCI/Mental-Health-Professionals/Eating-Disorders/Eating-Disorders---Information-Sheets/Eating-Disorders-Information-Sheet---13---Information-for-Carers.pdf)\n\n[http://www.maudsleyparents.org/bulimianervosa.html](http://www.maudsleyparents.org/bulimianervosa.html)\n\n[https://www.feast-ed.org/family-guide-series/](https://www.feast-ed.org/family-guide-series/)\n\n[https://eatingdisordersreview.com/denying-and-concealing-eating-disorders/](https://eatingdisordersreview.com/denying-and-concealing-eating-disorders/)",
          "created_utc": 1669598040.0
        }
      ]
    },
    {
      "id": "iy4mwoq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1669661076.0,
      "score": 5,
      "context": [
        {
          "id": "iy2o6aa",
          "author": "treyj88",
          "body": "i’ll be the devils advocate here and say a couple things. eating disorders are heritable. this is not an uncommon occurrence when a child ends up with the same ED as their mother, although i noticed that you put it all on the step mother. due to not knowing the relationship dynamics here, i’m not saying it isn’t her fault or that she ideologically does not have some part to play. just mentioning the fact that EDs are heritable.\n\nspeaking of your relationships, you mention that she’s been living with dad and step mom. how is your relationship with her? are you being honest with yourself that the way you’ve raised her to this point has not played any role? do you still have a good enough relationship with her that she actually wants you to be a part of this aspect of her life? not accusing you of anything, i’m just asking questions.\n\ndoes she know that YOU have an ED? you didn’t mention. you haven’t been able to stop after 20 years. how do you think you’re going to be able to help her? by talking to her coaches and teachers? you of all people should realize how terrible of an idea that is. \n\n“hey guys this is my daughter and she has this habit of vomiting her food because she’s self conscious. not like it’s embarrassing or a private issue or nothing i just want to tell everyone”\n\non a surface level, attempting to give a speech at her school about the dangers of bulimia sound great. but would your daughter really want her mom on stage in front of the school talking about eating disorders? talk about all eyes on her. that’s probably the last thing she wants. \n\ndo you really think that’s the best idea? would you want your mother to go to your job and tell all of your managers, friends, and co workers the same thing about you? probably not right?\n\nonce again, is she aware that you struggle with the same thing? if not, you should tell her. the first step in helping someone and gaining their trust is to be relatable. maybe you can both go to counseling together. this will be a delicate issue. you shouldn’t force your way into this topic. if it were me, i would start the conversation anecdotally using a story about my own struggles and make sure she is in a talking mood. if you want her to open up you have to be vulnerable too. \n\na final note, social media and instagram is destroying the youth. eating disorders, depression, suicides are all on the rise in the age of social media(and highest in teen girls). i’m not sure what the best course of action is there. you could of course try to talk to dad and come to an agreement that social media is bad and forbid it, but that will of course cause resentment. that’s a parenting decision i’m not qualified to help with.",
          "created_utc": 1669621095.0
        }
      ]
    },
    {
      "id": "iy6czp4",
      "author": "None",
      "body": "And it is a solo sport without real education and encouraging teamwork. This is what I find frightening",
      "created_utc": 1669687255.0,
      "score": 1,
      "context": [
        {
          "id": "iy4yq4i",
          "author": "supermarket_Ba",
          "body": "Wrestling is a really hard sport for people with ED because of the weigh ins and need to maintain or lose for a lowest possible weight class. If I were you I’d maybe encourage her to try a sport that has less of a focus on weight?",
          "created_utc": 1669665805.0
        }
      ]
    },
    {
      "id": "iy5gnao",
      "author": "None",
      "body": "How do you believe that impacted you?",
      "created_utc": 1669672809.0,
      "score": 2,
      "context": [
        {
          "id": "iy56uqd",
          "author": "recoverybitches",
          "body": "My mom fully ignored it when she found out so I applaud you for this noticing her seeing her",
          "created_utc": 1669668945.0
        }
      ]
    },
    {
      "id": "iy5gni2",
      "author": "treyj88",
      "body": "trust me friend, i understand most of the struggles you’ve listed here. life has not been daisies and roses for me by any stretch of the imagination. that’s just to say that i am not trying to bash you or throw hate to downcast you more as you say. i was homeless and living on the streets for an entire year. i too have struggled with bulimia and drug addiction, the latter is the reason i became homeless to begin with. \n\ni am simply trying to understand the situation and, more importantly, offering points of reflection for you to better understand yours. i wanted you to really think about the situation, not just your daughters bulimia, all of it. all of your life, all of your relationship with her, all of the good and the bad. \n\nyou do sound like you have been a wonderful mom, i don’t doubt that. we all have our moments of hardship and those periods of life where it seems the walls are closing in on us. at the end of the day, you are still her mother, and you still love her. only being 15, she may not be consciously aware of all of those efforts or your struggles, and probably won’t realize the way that you loved her until she is much older. \n\nyou mentioned you did not know how to tell her. well, that is precisely why i asked all of these questions to begin with. much of what you just wrote here would be a perfect way to tell her. i’ll reiterate again; if you want her to open up, and if you really want her to understand, you have to be vulnerable first. even if that means you break down and cry while you’re talking to her about it, about all of it. not just her bulimia, everything. i think that this is a perfect time to strengthen your relationship with her and to open up.",
      "created_utc": 1669672811.0,
      "score": 2,
      "context": [
        {
          "id": "iy2o6aa",
          "author": "treyj88",
          "body": "i’ll be the devils advocate here and say a couple things. eating disorders are heritable. this is not an uncommon occurrence when a child ends up with the same ED as their mother, although i noticed that you put it all on the step mother. due to not knowing the relationship dynamics here, i’m not saying it isn’t her fault or that she ideologically does not have some part to play. just mentioning the fact that EDs are heritable.\n\nspeaking of your relationships, you mention that she’s been living with dad and step mom. how is your relationship with her? are you being honest with yourself that the way you’ve raised her to this point has not played any role? do you still have a good enough relationship with her that she actually wants you to be a part of this aspect of her life? not accusing you of anything, i’m just asking questions.\n\ndoes she know that YOU have an ED? you didn’t mention. you haven’t been able to stop after 20 years. how do you think you’re going to be able to help her? by talking to her coaches and teachers? you of all people should realize how terrible of an idea that is. \n\n“hey guys this is my daughter and she has this habit of vomiting her food because she’s self conscious. not like it’s embarrassing or a private issue or nothing i just want to tell everyone”\n\non a surface level, attempting to give a speech at her school about the dangers of bulimia sound great. but would your daughter really want her mom on stage in front of the school talking about eating disorders? talk about all eyes on her. that’s probably the last thing she wants. \n\ndo you really think that’s the best idea? would you want your mother to go to your job and tell all of your managers, friends, and co workers the same thing about you? probably not right?\n\nonce again, is she aware that you struggle with the same thing? if not, you should tell her. the first step in helping someone and gaining their trust is to be relatable. maybe you can both go to counseling together. this will be a delicate issue. you shouldn’t force your way into this topic. if it were me, i would start the conversation anecdotally using a story about my own struggles and make sure she is in a talking mood. if you want her to open up you have to be vulnerable too. \n\na final note, social media and instagram is destroying the youth. eating disorders, depression, suicides are all on the rise in the age of social media(and highest in teen girls). i’m not sure what the best course of action is there. you could of course try to talk to dad and come to an agreement that social media is bad and forbid it, but that will of course cause resentment. that’s a parenting decision i’m not qualified to help with.",
          "created_utc": 1669621095.0
        },
        {
          "id": "iy4mwoq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1669661076.0
        }
      ]
    },
    {
      "id": "iy6h17f",
      "author": "recoverybitches",
      "body": "Horrible bc now I have anorexia",
      "created_utc": 1669689117.0,
      "score": 3,
      "context": [
        {
          "id": "iy56uqd",
          "author": "recoverybitches",
          "body": "My mom fully ignored it when she found out so I applaud you for this noticing her seeing her",
          "created_utc": 1669668945.0
        },
        {
          "id": "iy5gnao",
          "author": "None",
          "body": "How do you believe that impacted you?",
          "created_utc": 1669672809.0
        }
      ]
    }
  ]
}