{
  "id": "zdhhya",
  "subreddit": "bulimia",
  "author": "Kaitron5000",
  "created_utc": 1670269956.0,
  "title": "Can we talk about the embarrassing stuff?",
  "selftext": "I'm going to admit something I have never told anyone, maybe it will make me want to quit or just make me feel better for telling someone else. \n\nI work in a hotel and sometimes when the guests check out I will have to go into their rooms. I always go straight to the fridge to see if they left anything, straight to the room service containers to see if there is an uneaten dessert, sometimes I go through the trash and eat food that has sat out all night and has bites out of it. I am so ashamed of myself for it, but I can't stop doing it, sometimes I look forward to it. \n\nAnyone else do things they would never tell those who don't understand?",
  "url": "https://www.reddit.com/r/bulimia/comments/zdhhya/can_we_talk_about_the_embarrassing_stuff/",
  "score": 175,
  "num_comments": 48,
  "comments": [
    {
      "id": "iz2291h",
      "author": "three_d0wn",
      "body": "Scraping vomit off the shower floor with my hands and carrying it across the room to the toilet so I didn’t clog the shower drain isn’t a particularly proud memory (and has happened more times than I’d like to admit). \n\nAlso my brother once baked a batch of oatmeal chocolate chip cookies to contribute to a potluck he was attending (he made them like a week in advance and froze them) I ate the entire bag the night before… 30+ cookies and he was so panicked when he realised he had nothing to bring and all that effort was wasted (he never suspected me he just thought he’d misplaced them or something and I never owned up). Such shame. Such guilt.",
      "created_utc": 1670277799.0,
      "score": 108,
      "context": []
    },
    {
      "id": "iz2opi3",
      "author": "Normal-Society-5325",
      "body": "I was horribly bulimic in college. I would eat in the dining hall, binge, and then run to the bathroom to purge everything. It got so bad that one of the employees of the dining hall taped a sign on the stall I would go into \"to stop throwing up please!\" I would skip class to sit in my bed and gorge myself on thousands of calories if I ran out I would try to steal the stuff my roommate had. Poor girl, I feel terrible for what I put her through, I was an awful roommate. I would fill myself to the brim and then take the painful walk to the bathroom after to get rid of it. I dropped out of college and got an apartment and just started working. Bulimia got so bad and I was living in complete filth for years. My apartment floor was completely covered in garbage and take-out containers or fast food bags. My bathroom was disgusting and the toilet was always clogged or covered in vomit. My kitchen was unrecognizable, I couldn't see my sink for months. The garbage just piled up. This went on for years. I am grateful every day that I am 3 years clean now. Those were some of my darkest times.",
      "created_utc": 1670287562.0,
      "score": 91,
      "context": []
    },
    {
      "id": "iz2c7s7",
      "author": "NyanNyanKawaii",
      "body": "Pissing my pants on accident while vomiting because i had a full bladder and throwing away perfectly fine food so that i wouldn't binge on it are things i'm not proud of",
      "created_utc": 1670282015.0,
      "score": 42,
      "context": []
    },
    {
      "id": "iz2k4cj",
      "author": "Wepo_",
      "body": "Eating a puke covered pill that I'd forgottent I'd taken.",
      "created_utc": 1670285494.0,
      "score": 40,
      "context": []
    },
    {
      "id": "iz1lj0b",
      "author": "Siobhan_110103",
      "body": "Yes absolutely, I always wait to wash up until my family has gone to bed in hopes they didn't scrape their plates and I can eat the leftovers. God that feels embarrassing.",
      "created_utc": 1670271229.0,
      "score": 39,
      "context": []
    },
    {
      "id": "iz3dy7b",
      "author": "sunshinesparkle95",
      "body": "I worked at an eating disorder inpatient center and would binge on leftovers and throw up in the bathroom while they were in post-meal therapy sessions so they couldn’t hear me/walk in on me.\n\nGot a new house with my now ex across town and I got the keys weeks early and used it to go throw up in secret so I wouldn’t start a fight. Often. \n\nI used to buy a crazy amount of drain freshener because I’d throw up in my kitchen sink and use the disposal so I wouldn’t clog anything. \n\nOne time I was purging hot Cheetos and a small piece went up my nose and got stuck and burned for literally days and made everything smell like puke.",
      "created_utc": 1670299405.0,
      "score": 36,
      "context": []
    },
    {
      "id": "iz1ragu",
      "author": "None",
      "body": "Ugh I wrote out my version of this but deleted it because I have a fear of being doxxed for work related comments. But I did want to say that I am right there with you on this level OP",
      "created_utc": 1670273442.0,
      "score": 29,
      "context": []
    },
    {
      "id": "iz23l2n",
      "author": "diequesomorphine",
      "body": "I’ve also eaten out of the trash, even stuff that’s touched used pads and food I’ve made “inedible”. Also off the floor at school during lunch break and I was definitely seen by at least several dozen people. And I once threw up a plan B pill and when I woke up the next morning I had to shovel it into the toilet out of the sink by hand before the cleaning staff got there..",
      "created_utc": 1670278354.0,
      "score": 26,
      "context": []
    },
    {
      "id": "iz21lsz",
      "author": "None",
      "body": "I’ve gone through the trash to find food then made myself sick afterwards",
      "created_utc": 1670277533.0,
      "score": 20,
      "context": []
    },
    {
      "id": "iz2f1qu",
      "author": "None",
      "body": "yup, today I waited for a receptionist to leave the room so I could take more free candies cause I had already have 2 of them\n\nSometimes I have a normal dinner with my mum and when she leaves the kitchen I wait till she goes to sleep so I can binge \n\nSometimes I pick up food from the kitchen's floor and eat it\n\nI ate dog treats once lol\n\nand the list keeps going",
      "created_utc": 1670283250.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iz3dm38",
      "author": "oohyeahgetitiguess",
      "body": "I think my lowest was binging on ketchup packets 🤮absolutely repulsive",
      "created_utc": 1670299234.0,
      "score": 19,
      "context": []
    },
    {
      "id": "iz4nkau",
      "author": "Beach_Bliss",
      "body": "Oh my god this thread makes me feel so much less alone. I’ve thrown up in my Flatmates cat’s litter tray then panicked and scraped it all into the bin( the toilet was clogged) binged and purged on my Flatmates ice cream and denied it was me when he asked where it had gone - it was just the two of us. I was so ashamed but couldn’t say I was bulimic. I’ve purposely drank wine so I feel sick enough to vomit dinners out with friends. Chewed and spat food whilst babysitting. Thrown up out my window on the third floor - the neighbours saw me. Purposely played around with my ssri dosage to be so nauseous I don’t eat.",
      "created_utc": 1670333073.0,
      "score": 24,
      "context": []
    },
    {
      "id": "iz5m77i",
      "author": "DifficultyQuick6684",
      "body": "im surprised i haven't gotten pink eye from how much toilet water has splashed in my eye",
      "created_utc": 1670348063.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iz3qbjl",
      "author": "Certain-Coconut-2276",
      "body": "I have a bad habit of binging fast food on my way home, but immediately feel so bad about that I will puke it all back up into the take out bag while I drive the 30 mins home... I always get stressed that someone will drive by me and see me sticking my fingers down my throat and puking into a bag or cup :/",
      "created_utc": 1670306793.0,
      "score": 19,
      "context": []
    },
    {
      "id": "iz1yhr4",
      "author": "TATrashpanda",
      "body": "Don’t worry, you’re not alone",
      "created_utc": 1670276280.0,
      "score": 14,
      "context": []
    },
    {
      "id": "iz34by0",
      "author": "cprimeau108",
      "body": "one time i was puking at school and someone walked into the bathroom and said \"why you crying little kid\" and i've never puked at school ever again 💀",
      "created_utc": 1670294709.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iz2nqr4",
      "author": "burntbroccoliass",
      "body": "I’ll catch vomit in my hands so the toilet water and vomit doesn’t splash me in the face when I’m vomiting in the toilet.",
      "created_utc": 1670287124.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iz3eqvm",
      "author": "Theabsoluteworst1289",
      "body": "Puking in the kitchen sink so I could get rid of the evidence via garbage disposal. Yes I sanitize the sink after, and really am largely in recovery now so it’s not often but when I do have relapses I use the sink.",
      "created_utc": 1670299809.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j0o4ox7",
      "author": "None",
      "body": "Puking into old grocery bags and keeping them in a black garbage bag in my bedroom until I could throw them out discreetly. Sometimes I would keep them for weeks and they would ferment so my whole room would smell like puke and alcohol. So classy 👌",
      "created_utc": 1671334671.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iz2qjx7",
      "author": "okaysweaty167",
      "body": "I shit myself in a barber shop. I used all the toilet paper, threw my underwear in a trash can that was already over flowing, and had to wipe myself the rest of the way with grapefruit face wipes I had in my purse.",
      "created_utc": 1670288406.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iz66ocj",
      "author": "None",
      "body": "-My gran died suddenly and my dad was too sad to deal with her house so I said I would and instead of sorting all her stuff out I used to binge on all of her food and throw up in the toilet still with my Grans blood on the step where she banged her head and died. \n\n-work in a kitchen and used to (to save money) clear all of the customers left over food into a bag instead of throw it away and eat it",
      "created_utc": 1670355857.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iz2u4bt",
      "author": "None",
      "body": "One time I purged during a friend's birthday party in her bathroom and the toilet wouldn't flush so I had to use my hands to scoop out puke and dirty toilet water and absorb as much of it as possible in toilet paper and put it in her trash can and cover it with clean toilet paper and then wipe the bowl with more toilet paper and use my hands to scoop clean water from the sink into the bowl. One of the worst situations I've been in.",
      "created_utc": 1670290060.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iz44scv",
      "author": "redditistoo_leftwing",
      "body": "i've eaten leftover chocolate and junk food that others dumped in the streets even from the trash. \n\nfuck telling those who don't understand, i wouldn't even dare tell you that, if i was getting to know you in person and you told me you were bulimic. No way i'm saying that face to face with anyone",
      "created_utc": 1670318973.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iz87xny",
      "author": "rissamm",
      "body": "I’d say throwing soap and windex on some cookies that I baked to b/p on but threw them out and I knew that I would eat them out of the garbage. Welp I was a little too desperate and lightly scraped off the soap and just had soapy and windexy oatmeal cookies. \nOh yeah another one is taking lax the night before and then the next day I’m purging. Well the lax started working then sooo mid freaking out I decide to keep throwing up because I felt that would get it out better instead of just sitting my ass on the toilet. Now that is one of my worst times ever, but not enough to ever make me stop",
      "created_utc": 1670387891.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iz2e1sh",
      "author": "Great-Shoulder-996",
      "body": "wow this makes me feel much better. I thot I was alone tbh\nEdit: I just saw a half full cup of Starbucks. In the lobby of the bathroom. I drank it. It was so good lol",
      "created_utc": 1670282809.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iz240dk",
      "author": "Sensitive_Willow2357",
      "body": "I don't think I've been as happy as when I worked as a cleaner and knew people had take-out for lunch and I could take out the trash/hide in the cleaning store and eat their leftovers",
      "created_utc": 1670278533.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iz4ophv",
      "author": "privateschoolgirl111",
      "body": "Yes absolutely, I have done horrid shit like this before, stuff that I can’t even bring myself to type out anonymously online because it brings me so much shame. so much love and understanding for u 🤍 we do recover lol x",
      "created_utc": 1670333708.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iz67bcl",
      "author": "None",
      "body": "Thrown up in the middle of the day out of a vulux style window it was one of those terrible pizza/bread/doughnut ones where there’s barely any liquid I was too scared to open the window for days hoping it would rain (I’m in uk) IT DIDNT checked it a week later and it was all festering and still there going all the way down the roof",
      "created_utc": 1670356100.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iz1o72b",
      "author": "lunarocksbfffrr",
      "body": "Lol I’d be the same",
      "created_utc": 1670272253.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j11jik0",
      "author": "New_Engineer7065",
      "body": "Came back home after two weeks of not being there, alongside with two of my friends, only to realize that there was mold in the toilet bowl and had to clean asap before they understood",
      "created_utc": 1671581073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iz2mzxj",
      "author": "Altruistic-Tutor5807",
      "body": "thats so dope",
      "created_utc": 1670286787.0,
      "score": -20,
      "context": []
    },
    {
      "id": "iz2bbib",
      "author": "ooofx1000",
      "body": "did the shower thing so much in high school when I lived with my parents that I started to use my old hair clip bin as a \"puke bucket\" so I could turn around and then dump it into the toilet. \n\nthe things we will resort to when we don't have privacy man...and that's probably not even the weirdest/grossest thing I've done when I've needed to purge in a house/room/restaurant where other people are there",
      "created_utc": 1670281621.0,
      "score": 44,
      "context": [
        {
          "id": "iz2291h",
          "author": "three_d0wn",
          "body": "Scraping vomit off the shower floor with my hands and carrying it across the room to the toilet so I didn’t clog the shower drain isn’t a particularly proud memory (and has happened more times than I’d like to admit). \n\nAlso my brother once baked a batch of oatmeal chocolate chip cookies to contribute to a potluck he was attending (he made them like a week in advance and froze them) I ate the entire bag the night before… 30+ cookies and he was so panicked when he realised he had nothing to bring and all that effort was wasted (he never suspected me he just thought he’d misplaced them or something and I never owned up). Such shame. Such guilt.",
          "created_utc": 1670277799.0
        }
      ]
    },
    {
      "id": "iz2q5an",
      "author": "okaysweaty167",
      "body": "my dad had to reach in the puke water to unclog the drain 😭😭😭 good thing they knew about my ed so it wasn’t too much of a wtf moment",
      "created_utc": 1670288218.0,
      "score": 27,
      "context": [
        {
          "id": "iz2291h",
          "author": "three_d0wn",
          "body": "Scraping vomit off the shower floor with my hands and carrying it across the room to the toilet so I didn’t clog the shower drain isn’t a particularly proud memory (and has happened more times than I’d like to admit). \n\nAlso my brother once baked a batch of oatmeal chocolate chip cookies to contribute to a potluck he was attending (he made them like a week in advance and froze them) I ate the entire bag the night before… 30+ cookies and he was so panicked when he realised he had nothing to bring and all that effort was wasted (he never suspected me he just thought he’d misplaced them or something and I never owned up). Such shame. Such guilt.",
          "created_utc": 1670277799.0
        }
      ]
    },
    {
      "id": "iz3dd63",
      "author": "oohyeahgetitiguess",
      "body": "You’re college self sounds a lot like me🤦‍♀️the custodian for my dorm asked me to stop throwing up if possible",
      "created_utc": 1670299109.0,
      "score": 29,
      "context": [
        {
          "id": "iz2opi3",
          "author": "Normal-Society-5325",
          "body": "I was horribly bulimic in college. I would eat in the dining hall, binge, and then run to the bathroom to purge everything. It got so bad that one of the employees of the dining hall taped a sign on the stall I would go into \"to stop throwing up please!\" I would skip class to sit in my bed and gorge myself on thousands of calories if I ran out I would try to steal the stuff my roommate had. Poor girl, I feel terrible for what I put her through, I was an awful roommate. I would fill myself to the brim and then take the painful walk to the bathroom after to get rid of it. I dropped out of college and got an apartment and just started working. Bulimia got so bad and I was living in complete filth for years. My apartment floor was completely covered in garbage and take-out containers or fast food bags. My bathroom was disgusting and the toilet was always clogged or covered in vomit. My kitchen was unrecognizable, I couldn't see my sink for months. The garbage just piled up. This went on for years. I am grateful every day that I am 3 years clean now. Those were some of my darkest times.",
          "created_utc": 1670287562.0
        }
      ]
    },
    {
      "id": "iztgp18",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1670785024.0,
      "score": 1,
      "context": [
        {
          "id": "iz2opi3",
          "author": "Normal-Society-5325",
          "body": "I was horribly bulimic in college. I would eat in the dining hall, binge, and then run to the bathroom to purge everything. It got so bad that one of the employees of the dining hall taped a sign on the stall I would go into \"to stop throwing up please!\" I would skip class to sit in my bed and gorge myself on thousands of calories if I ran out I would try to steal the stuff my roommate had. Poor girl, I feel terrible for what I put her through, I was an awful roommate. I would fill myself to the brim and then take the painful walk to the bathroom after to get rid of it. I dropped out of college and got an apartment and just started working. Bulimia got so bad and I was living in complete filth for years. My apartment floor was completely covered in garbage and take-out containers or fast food bags. My bathroom was disgusting and the toilet was always clogged or covered in vomit. My kitchen was unrecognizable, I couldn't see my sink for months. The garbage just piled up. This went on for years. I am grateful every day that I am 3 years clean now. Those were some of my darkest times.",
          "created_utc": 1670287562.0
        }
      ]
    },
    {
      "id": "iz5uwpa",
      "author": "CSB103",
      "body": "the pissing your pants thing just happened to me recently. even though no one was obviously around, i was humiliated.",
      "created_utc": 1670351318.0,
      "score": 11,
      "context": [
        {
          "id": "iz2c7s7",
          "author": "NyanNyanKawaii",
          "body": "Pissing my pants on accident while vomiting because i had a full bladder and throwing away perfectly fine food so that i wouldn't binge on it are things i'm not proud of",
          "created_utc": 1670282015.0
        }
      ]
    },
    {
      "id": "izh8ro5",
      "author": "Certain-Coconut-2276",
      "body": "Definitely done this more times then I care to admit :/",
      "created_utc": 1670552320.0,
      "score": 6,
      "context": [
        {
          "id": "iz2c7s7",
          "author": "NyanNyanKawaii",
          "body": "Pissing my pants on accident while vomiting because i had a full bladder and throwing away perfectly fine food so that i wouldn't binge on it are things i'm not proud of",
          "created_utc": 1670282015.0
        }
      ]
    },
    {
      "id": "iz63t8t",
      "author": "Lonelybut_notalone",
      "body": "Forgot I took an oxy for pain day 2 post-op. Wailed in pain for hours and my mom was so confused as to why the pain meds “weren’t working” that time:////",
      "created_utc": 1670354760.0,
      "score": 11,
      "context": [
        {
          "id": "iz2k4cj",
          "author": "Wepo_",
          "body": "Eating a puke covered pill that I'd forgottent I'd taken.",
          "created_utc": 1670285494.0
        }
      ]
    },
    {
      "id": "j26wtyf",
      "author": "PsychologicalDog4685",
      "body": "How did u “play around” with the dosage? I only ever used Zoloft and I don’t think it ever made me nauseous no matter how much I took",
      "created_utc": 1672366484.0,
      "score": 2,
      "context": [
        {
          "id": "iz4nkau",
          "author": "Beach_Bliss",
          "body": "Oh my god this thread makes me feel so much less alone. I’ve thrown up in my Flatmates cat’s litter tray then panicked and scraped it all into the bin( the toilet was clogged) binged and purged on my Flatmates ice cream and denied it was me when he asked where it had gone - it was just the two of us. I was so ashamed but couldn’t say I was bulimic. I’ve purposely drank wine so I feel sick enough to vomit dinners out with friends. Chewed and spat food whilst babysitting. Thrown up out my window on the third floor - the neighbours saw me. Purposely played around with my ssri dosage to be so nauseous I don’t eat.",
          "created_utc": 1670333073.0
        }
      ]
    },
    {
      "id": "iz5moej",
      "author": "DifficultyQuick6684",
      "body": "also something imreally really ashamed of is playing w/ my vomit?!? like if its especially mushy i'd stare at it and smush it if i purge in the shower. honestly gross.",
      "created_utc": 1670348242.0,
      "score": 8,
      "context": [
        {
          "id": "iz5m77i",
          "author": "DifficultyQuick6684",
          "body": "im surprised i haven't gotten pink eye from how much toilet water has splashed in my eye",
          "created_utc": 1670348063.0
        }
      ]
    },
    {
      "id": "j2zsl2x",
      "author": "None",
      "body": "SAME BRO",
      "created_utc": 1672883940.0,
      "score": 1,
      "context": [
        {
          "id": "iz5m77i",
          "author": "DifficultyQuick6684",
          "body": "im surprised i haven't gotten pink eye from how much toilet water has splashed in my eye",
          "created_utc": 1670348063.0
        }
      ]
    },
    {
      "id": "j0touex",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1671442832.0,
      "score": 2,
      "context": [
        {
          "id": "iz2nqr4",
          "author": "burntbroccoliass",
          "body": "I’ll catch vomit in my hands so the toilet water and vomit doesn’t splash me in the face when I’m vomiting in the toilet.",
          "created_utc": 1670287124.0
        }
      ]
    },
    {
      "id": "iz55spj",
      "author": "blkpepr",
      "body": "I did this in my apartment and am pretty confident it was me that fucked up the plumbing in the building. The downstairs neighbor said that whatever work they were doing on the pipes \"smelled so bad\" !",
      "created_utc": 1670341560.0,
      "score": 8,
      "context": [
        {
          "id": "iz3eqvm",
          "author": "Theabsoluteworst1289",
          "body": "Puking in the kitchen sink so I could get rid of the evidence via garbage disposal. Yes I sanitize the sink after, and really am largely in recovery now so it’s not often but when I do have relapses I use the sink.",
          "created_utc": 1670299809.0
        }
      ]
    },
    {
      "id": "iz55dgp",
      "author": "blkpepr",
      "body": "Omg forgot all about doing this in hs!",
      "created_utc": 1670341388.0,
      "score": 7,
      "context": [
        {
          "id": "iz2291h",
          "author": "three_d0wn",
          "body": "Scraping vomit off the shower floor with my hands and carrying it across the room to the toilet so I didn’t clog the shower drain isn’t a particularly proud memory (and has happened more times than I’d like to admit). \n\nAlso my brother once baked a batch of oatmeal chocolate chip cookies to contribute to a potluck he was attending (he made them like a week in advance and froze them) I ate the entire bag the night before… 30+ cookies and he was so panicked when he realised he had nothing to bring and all that effort was wasted (he never suspected me he just thought he’d misplaced them or something and I never owned up). Such shame. Such guilt.",
          "created_utc": 1670277799.0
        },
        {
          "id": "iz2bbib",
          "author": "ooofx1000",
          "body": "did the shower thing so much in high school when I lived with my parents that I started to use my old hair clip bin as a \"puke bucket\" so I could turn around and then dump it into the toilet. \n\nthe things we will resort to when we don't have privacy man...and that's probably not even the weirdest/grossest thing I've done when I've needed to purge in a house/room/restaurant where other people are there",
          "created_utc": 1670281621.0
        }
      ]
    },
    {
      "id": "iz3dduc",
      "author": "oohyeahgetitiguess",
      "body": "Your*",
      "created_utc": 1670299119.0,
      "score": 10,
      "context": [
        {
          "id": "iz2opi3",
          "author": "Normal-Society-5325",
          "body": "I was horribly bulimic in college. I would eat in the dining hall, binge, and then run to the bathroom to purge everything. It got so bad that one of the employees of the dining hall taped a sign on the stall I would go into \"to stop throwing up please!\" I would skip class to sit in my bed and gorge myself on thousands of calories if I ran out I would try to steal the stuff my roommate had. Poor girl, I feel terrible for what I put her through, I was an awful roommate. I would fill myself to the brim and then take the painful walk to the bathroom after to get rid of it. I dropped out of college and got an apartment and just started working. Bulimia got so bad and I was living in complete filth for years. My apartment floor was completely covered in garbage and take-out containers or fast food bags. My bathroom was disgusting and the toilet was always clogged or covered in vomit. My kitchen was unrecognizable, I couldn't see my sink for months. The garbage just piled up. This went on for years. I am grateful every day that I am 3 years clean now. Those were some of my darkest times.",
          "created_utc": 1670287562.0
        },
        {
          "id": "iz3dd63",
          "author": "oohyeahgetitiguess",
          "body": "You’re college self sounds a lot like me🤦‍♀️the custodian for my dorm asked me to stop throwing up if possible",
          "created_utc": 1670299109.0
        }
      ]
    },
    {
      "id": "iztx5rs",
      "author": "Normal-Society-5325",
      "body": "of course",
      "created_utc": 1670791308.0,
      "score": 2,
      "context": [
        {
          "id": "iz2opi3",
          "author": "Normal-Society-5325",
          "body": "I was horribly bulimic in college. I would eat in the dining hall, binge, and then run to the bathroom to purge everything. It got so bad that one of the employees of the dining hall taped a sign on the stall I would go into \"to stop throwing up please!\" I would skip class to sit in my bed and gorge myself on thousands of calories if I ran out I would try to steal the stuff my roommate had. Poor girl, I feel terrible for what I put her through, I was an awful roommate. I would fill myself to the brim and then take the painful walk to the bathroom after to get rid of it. I dropped out of college and got an apartment and just started working. Bulimia got so bad and I was living in complete filth for years. My apartment floor was completely covered in garbage and take-out containers or fast food bags. My bathroom was disgusting and the toilet was always clogged or covered in vomit. My kitchen was unrecognizable, I couldn't see my sink for months. The garbage just piled up. This went on for years. I am grateful every day that I am 3 years clean now. Those were some of my darkest times.",
          "created_utc": 1670287562.0
        },
        {
          "id": "iztgp18",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1670785024.0
        }
      ]
    },
    {
      "id": "miiqz1y",
      "author": "Both-Income1522",
      "body": "i just laughed out loud because i literally do the same thing. it is so squishy sometimes.",
      "created_utc": 1742337375.0,
      "score": 1,
      "context": [
        {
          "id": "iz5m77i",
          "author": "DifficultyQuick6684",
          "body": "im surprised i haven't gotten pink eye from how much toilet water has splashed in my eye",
          "created_utc": 1670348063.0
        },
        {
          "id": "iz5moej",
          "author": "DifficultyQuick6684",
          "body": "also something imreally really ashamed of is playing w/ my vomit?!? like if its especially mushy i'd stare at it and smush it if i purge in the shower. honestly gross.",
          "created_utc": 1670348242.0
        }
      ]
    }
  ]
}