{
  "id": "zmkh8c",
  "subreddit": "bulimia",
  "author": "Bananapopana88",
  "created_utc": 1671109121.0,
  "title": "Why are boyfriends so ubiquitously terrible at dealing with this",
  "selftext": "I wake up this morning. He rolls over and asks me if I b/p’d all the snack food. After a moment if awkward silence I say yes. He proceeds to say the toliet is clogged then rolls over. \n\nYup thanks for the check-in, a hug is all I needed for sure. \n\nHe also said yesterday he thought I had stopped doing that. I didn’t tell him he handles it so poorly that he just doesn’t know about it coming back. All I get out of talking to him is more triggered.",
  "url": "https://www.reddit.com/r/bulimia/comments/zmkh8c/why_are_boyfriends_so_ubiquitously_terrible_at/",
  "score": 77,
  "num_comments": 26,
  "comments": [
    {
      "id": "j0c15tl",
      "author": "meowawwa",
      "body": "When I first started recovery when I was 16 my (ex)boyfriend was telling stuff he liked abt me and he was like yess u r chubby 🥰 I was absolutely mortified bc I told him I had previously had an eating disorder and when I showed my discomfort he made me seem in the wrong he was like what. Its true u r chubby 🙄🙄🙄 (I was 130lbs) I think a lot of guys have trouble with empathy tbh",
      "created_utc": 1671118770.0,
      "score": 41,
      "context": []
    },
    {
      "id": "j0bqy0y",
      "author": "Kaitron5000",
      "body": "My boyfriend has been making me feel so guilty. Or he will be really passive aggressive and refuse to talk to me about it. He doesn't understand, or try to hear me out. I get that what I'm doing also affects him, but I wish he would be a bit more compassionate.",
      "created_utc": 1671114522.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j0bk2wv",
      "author": "None",
      "body": "He seems nice /s",
      "created_utc": 1671111341.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j0cl99s",
      "author": "ketamineprincess86",
      "body": "literally girl u deserve better- if i were you i would think hard about how much this relationship is really worth if he just can’t give a fuck about this big part of your life.\nthere are better men out there, and they are willing to learn and understand. my bf started out telling me how heavy i was and that i was thick and stuff like that, and ive told him how id like to be treated. since then he has started to join me eating since i feel unsafe eating alone and has embraced the parts of my body that i thought of as flaws. \nyou got this.💓",
      "created_utc": 1671126491.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j0dc6ce",
      "author": "None",
      "body": "Girlie get out of this relationship. You deserve so much better, I've been in recovery for 3 years now and I wouldn't have come this far without the support of my man. Before him I had boyfriends who would tell me I was fat at 45kg with a bmi of 16. Because of my man now I am at a bmi of 23 and look much healthier. He supports me and has never judged me. You need a MAN not a BOY or MAN-CHILD. There is better out there for you and you DO deserve it. I promise you it gets better",
      "created_utc": 1671136832.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j0c6bxw",
      "author": "wasabi-sabeth",
      "body": "wth is wrong with those guys - this behavior makes me so angry - wish I could give everyone of you a hug :( \n\n I understand that seeing your loved ones hurting themselves is painful, and you feel helpless  and angry, but that's not a reason to act like an idiot. people have mouthes why don't they use it?",
      "created_utc": 1671120794.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j0e1jq0",
      "author": "LessNeck2254",
      "body": "Living together w/ someone and a ED is tough...\n\nFirst of all, buy your snacks and he buys his.\n\n2nd, pay attention and check if the toilet is clogged. He lives w/ u and he needs to use it as well. I suppose u have bulimic episodes quite often daily, otherwise you would not get upset with the clogging conversation.\n\nI lived with 3 other ppl during University and I had to make sure common living spaces were all functional, after all, I might have an ED but that is not an excuse.\n\nI live w/ my husband now. I sometimes forget to clean the toilet and I know he feels unconfortable when he raises the seat and notices smth appears to have happened that does not fit in number 1 and 2 categories lol... He sometimes asks how am I doing but mostly we pretend nothing is happening. I prefere talking to my therapist about It.\n\nBut I had an ex that had the courage to say smth like: u r sick coz u want to stay sick. If you had more willpower u would be better by now, so clearly u r in this messed up place because u chose to stay in It.\n\nThat is some guilty trip sh*t, if any of ur partners does dat, get away from that person asap, for real.",
      "created_utc": 1671146995.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j0etkz0",
      "author": "Sad_Committee_4876",
      "body": "Dump his ass",
      "created_utc": 1671159535.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j0biesj",
      "author": "redditistoo_leftwing",
      "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
      "created_utc": 1671110487.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j0ds87t",
      "author": "YeahNoYeahMaybeNo",
      "body": "I imagine I wouldnt be easy to live with, not that it came close to anything in the past years :,)",
      "created_utc": 1671143118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j0ff6l6",
      "author": "Longjumping_Gas6207",
      "body": "So tough… Obviously you feel bad about what he is/isn’t giving you—maybe you should communicate that to him? Like tell him that you really needed a hug instead of the (perceived) annoyance from him. People aren’t naturally equipped to deal with this sort of thing, and relationships are a two-way street. Our trauma/ED doesn’t excuse our obligations in that regard imo. Not trying to pass judgment on you, you’re obviously hurting, just kind of what I’ve concluded after years of being ED’d and finally being in a supportive and loving relationship during it. I realize after having someone who loves me, that it hurts to see me hurt myself. And that can manifest in weird ways for ppl who have no idea how EDs work or why we do the things we do. \n\nOrrrr he’s an asshole that doesn’t give a shit. Not saying he loves you and he just doesn’t know how to express it, just suggesting you do your part and express your feelings and needs first, to give him a fair chance to meet them better. And if he can’t, bye. Good luck ❤️",
      "created_utc": 1671171222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnu3akf",
      "author": "AnonBF123",
      "body": "GFs please explain what your man can do to help? I really want to know because I don't know what to do myself I wanna get it right now before it drives a wedge between us.",
      "created_utc": 1686522962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j0e4y9a",
      "author": "Bananapopana88",
      "body": "See I’m a 200 pound chub (like people openly will tell me you aren’t fat but aren’t skinny. A chub lol) and I usually get “oh you can’t actually have an ED you aren’t skinny” or get told that it’s dumb getting upset about weight comments because I’m chubby. \n\nLike nah man I’m upset because why are you, a stranger, telling me you think I would be pretty if I lost 50lbs?",
      "created_utc": 1671148456.0,
      "score": 13,
      "context": [
        {
          "id": "j0c15tl",
          "author": "meowawwa",
          "body": "When I first started recovery when I was 16 my (ex)boyfriend was telling stuff he liked abt me and he was like yess u r chubby 🥰 I was absolutely mortified bc I told him I had previously had an eating disorder and when I showed my discomfort he made me seem in the wrong he was like what. Its true u r chubby 🙄🙄🙄 (I was 130lbs) I think a lot of guys have trouble with empathy tbh",
          "created_utc": 1671118770.0
        }
      ]
    },
    {
      "id": "j0e4nek",
      "author": "Bananapopana88",
      "body": "They were my snacks. I paid for them lol, I asked if he was gonna eat them when I got home because I was otherwise gonna throw them away to prevent a binge. \n\nThe toilet flushed when I purged. I didn’t know.",
      "created_utc": 1671148328.0,
      "score": 4,
      "context": [
        {
          "id": "j0e1jq0",
          "author": "LessNeck2254",
          "body": "Living together w/ someone and a ED is tough...\n\nFirst of all, buy your snacks and he buys his.\n\n2nd, pay attention and check if the toilet is clogged. He lives w/ u and he needs to use it as well. I suppose u have bulimic episodes quite often daily, otherwise you would not get upset with the clogging conversation.\n\nI lived with 3 other ppl during University and I had to make sure common living spaces were all functional, after all, I might have an ED but that is not an excuse.\n\nI live w/ my husband now. I sometimes forget to clean the toilet and I know he feels unconfortable when he raises the seat and notices smth appears to have happened that does not fit in number 1 and 2 categories lol... He sometimes asks how am I doing but mostly we pretend nothing is happening. I prefere talking to my therapist about It.\n\nBut I had an ex that had the courage to say smth like: u r sick coz u want to stay sick. If you had more willpower u would be better by now, so clearly u r in this messed up place because u chose to stay in It.\n\nThat is some guilty trip sh*t, if any of ur partners does dat, get away from that person asap, for real.",
          "created_utc": 1671146995.0
        }
      ]
    },
    {
      "id": "j0cbztu",
      "author": "FlorDeLunaa",
      "body": "I have to dissagree with somethings and agree with others. \n\nI agree that as we grow weaker our need for validation becomes much more apparent and our partners are NOT the messiah youre right.\n\nThat being said the more sources of support the better- a friend group is indeed suitable and INCREDIBLY helpful - my friend group which I SPECIFICALLY sought out because I wanted to have support from people WITH Ed’s is my rock … but my boyfriend… \n\nMy boyfriend is my reason for recovery. \nSure I am my own reason - but the love I have for this person allows me to SEE what my disorder does to those who love me. He supports me, let’s me make dark jokes, listens and try’s to understand but when he can’t simply hears me out and hands out the hugs i need. \n\nHe shows me a side beyond myself of this disorder … on my own it’s easy to get cynical about recovery. It’s not easy to let my Ed third wheel my relationship- the truth is even when my ED get sneaky and makes me care less about myself enough to relapse … HIM EXISTING makes me MORE afraid of loosing him than IT. \n\nIf you have the right partner \nAnd if you WANT to recover (even just some day)\nIf you CARE \n\nHaving a relationship CAN BE AN UNIMAGINABLE SOURCE OF SUPPORT. \n\nYou saying you expect to be treated like you are Disgusting is self loathing and self harm . self depreciating behavior- it’s your ED not YOU. \n\nDespite not being able to see past it (I understand the feeling) hopefully you’ll believe me. \n\nAnyone who treats you like that or calls you those things is a bigger POS than our Ed’s would have us believe we are. \n\nYOURE NOT LESS THAN OR DISGUSTING \nWE ARE SICK AND WE DESERVE HELP NOT HELL. \n\nYou deserve to be supported not depreciated \n\nPlease PLEASE don’t let anyone convince YOU the reader either . DONT LET ANYONE. CONVINCE YOU YOU ARENT WORTH LOVE AND BELONGING. VALIDATION.  Don’t let anyone convince you you aren’t worth anything for that matter … YOU decide what you are worth and I recommend you not make the decision while in an intimate deep rooted relationship with your eating disorder. \n\n- OP .. you may want to consider whether or not you want to recover or not and then we may want to consider whether or not this relationship is important to you or not because it seems like you’ve got a support system if you want it… Not just anybody is going to have that conversation with you that’s honesty if he’s having a conversation even this poorly - he cares.\n\nYou have to decide whether you care about him enough - whether you are ready - if this is the relationship you’re meant to be in it will work out now or later \nBut what matters now is starting to contemplate these things",
      "created_utc": 1671122978.0,
      "score": 7,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        }
      ]
    },
    {
      "id": "j0btk1r",
      "author": "Bananapopana88",
      "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
      "created_utc": 1671115657.0,
      "score": 9,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        }
      ]
    },
    {
      "id": "jnumztf",
      "author": "Bananapopana88",
      "body": "Okay for me, and all of this is person dependent, but what would help me:\n\nHelping me with meal planning and cooking. I can get extremely fixated on calories and panic after I eat it. If I don’t plan the meal it is easier to eat it. I may still panic after and at that point, just helping redirect the energy. Like if a guy were to get me to paint with him (I am artistic) then I may be distracted long enough to beat the urge. I’m sorry, I am tired. I will come back to this okay?",
      "created_utc": 1686533076.0,
      "score": 1,
      "context": [
        {
          "id": "jnu3akf",
          "author": "AnonBF123",
          "body": "GFs please explain what your man can do to help? I really want to know because I don't know what to do myself I wanna get it right now before it drives a wedge between us.",
          "created_utc": 1686522962.0
        }
      ]
    },
    {
      "id": "j0e69cg",
      "author": "meowawwa",
      "body": "YEAH EXACTLY I don't know why strangers think it's okay to comment on people's weight. It's absolutely ridiculous I'm so sorry u have to go through that on top of having this terrible disorder ☹️\nWhen I'm at work and say I'm on a diet or whtever they usually tell me things like \"Oh but there's nothing to you\" \"don't be stupid you are skinny\" like bro I'm trying to recover and eat healthier T__T",
      "created_utc": 1671149022.0,
      "score": 2,
      "context": [
        {
          "id": "j0c15tl",
          "author": "meowawwa",
          "body": "When I first started recovery when I was 16 my (ex)boyfriend was telling stuff he liked abt me and he was like yess u r chubby 🥰 I was absolutely mortified bc I told him I had previously had an eating disorder and when I showed my discomfort he made me seem in the wrong he was like what. Its true u r chubby 🙄🙄🙄 (I was 130lbs) I think a lot of guys have trouble with empathy tbh",
          "created_utc": 1671118770.0
        },
        {
          "id": "j0e4y9a",
          "author": "Bananapopana88",
          "body": "See I’m a 200 pound chub (like people openly will tell me you aren’t fat but aren’t skinny. A chub lol) and I usually get “oh you can’t actually have an ED you aren’t skinny” or get told that it’s dumb getting upset about weight comments because I’m chubby. \n\nLike nah man I’m upset because why are you, a stranger, telling me you think I would be pretty if I lost 50lbs?",
          "created_utc": 1671148456.0
        }
      ]
    },
    {
      "id": "j0c9kob",
      "author": "None",
      "body": "you deserve someone who will try to find ways to help your ed symptoms with you, not someone who seems to not care that you’re struggling and instead sees it as an annoyance, especially being so early in your relationship :( it sucks to hear but there is someone out there that will accept and care for all of you, and this man seems to be hurting you mentally more than he’s trying to help",
      "created_utc": 1671122058.0,
      "score": 6,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        }
      ]
    },
    {
      "id": "j0cb70c",
      "author": "redditistoo_leftwing",
      "body": "(I'm trying to avoid questioning why you are with him 🤫) \nProbably now cause he has to live with you and watch you do what you do? Is he the male version of \"I can change him\"?",
      "created_utc": 1671122679.0,
      "score": 2,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        }
      ]
    },
    {
      "id": "j0cclob",
      "author": "FlorDeLunaa",
      "body": "He seems frustrated. Upset\n\nMy partner who is AMAZING with me STILL gets rude and pissy\n\nI try to understand . He picked YOU. He likes you, he wants to be with you \n\nAnd here we are taking a shit on the relationship by showing we don’t care if we loose it or not. \n\n3 months is fresh but still. If he is even listening. Think about it before you push too hard or get too annoyed with him \n\nHe’s “done” because you’re sharing your disorder with no intent to better yourself\n\nAnyone who likes you isn’t going to support that. \nUnfortunately but it’s the truth \n- \nRemember we may need to vent but are we venting to the right person? \nYou vent to a partner who WANTS YOU they want the best for you \n\nMaybe if you’re not ready for that you DO need a good non recovery non relapse friend group to talk it out with so when you see your man you are more emotionally prepared to be with him. Not use him as a therapist",
      "created_utc": 1671123206.0,
      "score": 0,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        }
      ]
    },
    {
      "id": "j0cfkkh",
      "author": "Bananapopana88",
      "body": "Every man I’ve dated has. I’m around 5’ 6’ and stay between 190-200. Frankly men tell me all the time they would find me attractive if I was just skinny but i guess I’m not an option to anyone now. Rough as I need the income to have a place, roomies haven’t worked out as I have 3 cats and no apartments can accept that. No family. So shitty boyfriends = place to live. \n\nHell he was play fighting with me and I lost it and swung at him (old trauma due to being strangled, he grazed my nose and I couldn’t breathe for .5 seconds) and he told me I should have told him about that already. Well when I go to tell him my past my rambling style seems to annoy him.\n\nNone of the men I meet give 2 shits.",
      "created_utc": 1671124335.0,
      "score": 0,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        },
        {
          "id": "j0c9kob",
          "author": "None",
          "body": "you deserve someone who will try to find ways to help your ed symptoms with you, not someone who seems to not care that you’re struggling and instead sees it as an annoyance, especially being so early in your relationship :( it sucks to hear but there is someone out there that will accept and care for all of you, and this man seems to be hurting you mentally more than he’s trying to help",
          "created_utc": 1671122058.0
        }
      ]
    },
    {
      "id": "j0cewq6",
      "author": "Bananapopana88",
      "body": "It’s called we are poor in a city where wages aren’t raising with the rent, lol. Economic necessity.",
      "created_utc": 1671124083.0,
      "score": 1,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        },
        {
          "id": "j0cb70c",
          "author": "redditistoo_leftwing",
          "body": "(I'm trying to avoid questioning why you are with him 🤫) \nProbably now cause he has to live with you and watch you do what you do? Is he the male version of \"I can change him\"?",
          "created_utc": 1671122679.0
        }
      ]
    },
    {
      "id": "j0cg0lm",
      "author": "Bananapopana88",
      "body": "I don’t expect therapy from him. \n\nIf he doesn’t know what to say saying that will suffice. He could say he doesn’t understand why I feel the compulsion, or why the binges are large, or ask why I need to hide it.  I could work with that. Blind ignorance to how my illness works I can’t. \n\nNot even an “What’s going on that you feel the need to do this again”\n\nJust hey, you clogged the toliet. Snored. I don’t feel like he cares about me outside of this anyways.",
      "created_utc": 1671124505.0,
      "score": 3,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        },
        {
          "id": "j0cclob",
          "author": "FlorDeLunaa",
          "body": "He seems frustrated. Upset\n\nMy partner who is AMAZING with me STILL gets rude and pissy\n\nI try to understand . He picked YOU. He likes you, he wants to be with you \n\nAnd here we are taking a shit on the relationship by showing we don’t care if we loose it or not. \n\n3 months is fresh but still. If he is even listening. Think about it before you push too hard or get too annoyed with him \n\nHe’s “done” because you’re sharing your disorder with no intent to better yourself\n\nAnyone who likes you isn’t going to support that. \nUnfortunately but it’s the truth \n- \nRemember we may need to vent but are we venting to the right person? \nYou vent to a partner who WANTS YOU they want the best for you \n\nMaybe if you’re not ready for that you DO need a good non recovery non relapse friend group to talk it out with so when you see your man you are more emotionally prepared to be with him. Not use him as a therapist",
          "created_utc": 1671123206.0
        }
      ]
    },
    {
      "id": "j0culc6",
      "author": "redditistoo_leftwing",
      "body": "now that would make you bad roomates",
      "created_utc": 1671130059.0,
      "score": 4,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        },
        {
          "id": "j0cb70c",
          "author": "redditistoo_leftwing",
          "body": "(I'm trying to avoid questioning why you are with him 🤫) \nProbably now cause he has to live with you and watch you do what you do? Is he the male version of \"I can change him\"?",
          "created_utc": 1671122679.0
        },
        {
          "id": "j0cewq6",
          "author": "Bananapopana88",
          "body": "It’s called we are poor in a city where wages aren’t raising with the rent, lol. Economic necessity.",
          "created_utc": 1671124083.0
        }
      ]
    },
    {
      "id": "j0cix9i",
      "author": "FlorDeLunaa",
      "body": "I understand what you’re saying ive argued the same things. \n\nBut to see things from their perspective… it’s annoying to see you not care about yourself and no go to them. \nJust as \nupset you are he didn’t have something better to say I’m sure he’s upset you chose not to say anything at all.\n\nYou NEED support \nUnderstanding \nForgiveness. You need him to ask you nicely and show genuine concern TOTALLY VALID\n\nHe probably needs you too. \n\nIt’s just not easy and it takes WANT from both people to make things work.\n\nEating disorders make us into liars. People who keep things from others. Behave secretively. \nEating disorders are inherently puzzling for the person to understand and especially to those who do not suffer from them. It’s basically definition- if you don’t have an ED it’s not second nature and it’s not easy to understand or even tolerate**\n\nI’m not trying to be a dick OP I’m just trying to be helpful because I get upset with my partner about the same careless comments at times but the reality is HE IS BLINDLY IGNORANT TO YOUR ED he can’t even come up with those questions let alone ask them.\n\nIt’s kind of your job- our job- to let them in and show them - they honestly shouldn’t be expected to just know how to deal with this.\n\nI just don’t want you to feel what I fear :feelings of \n“I fucked this up - nobody wants or can tolerate me” that messed up stuff you were told originally which  was essentially “I’m disgusting and I deserve this and worse” \nI don’t want people feeling like they can’t be in a relationship. You just can’t drive them away either \n\nWe ALL have to take responsibility \n\nHE DOESNT GET IT . You will have to help him and ANY other man or woman who does not suffer from an ED - you will have to help . Yes even teach them what questions to ask \n\nYou can’t be upset they don’t JUST KNOW what to fo",
      "created_utc": 1671125607.0,
      "score": 1,
      "context": [
        {
          "id": "j0biesj",
          "author": "redditistoo_leftwing",
          "body": "Man's so done ! Not gonna lie we all would get the same treatment, bulimia doesn't help with relationships. \n\nOur need of validation grows stronger as we become weaker and our partner is not the Messiah that's gonna save us. \n\nThat's how i expect to be treated to be honest maybe even worse and be called disgusting as well, with no way of me being in a relationship.\n\n A friend group would be so much more suitable for what you need.",
          "created_utc": 1671110487.0
        },
        {
          "id": "j0btk1r",
          "author": "Bananapopana88",
          "body": "Why should he be so done when he hasn’t had to deal with it at all?\n\n3 months together and this is the first time he’s had any problems whatsoever caused by it. \n\nHe’s literally told me just don’t do it for a week and you should be over it, and called me wasteful as a purger. Said that he would rather me not eat at all than throw up (thanks)",
          "created_utc": 1671115657.0
        },
        {
          "id": "j0cclob",
          "author": "FlorDeLunaa",
          "body": "He seems frustrated. Upset\n\nMy partner who is AMAZING with me STILL gets rude and pissy\n\nI try to understand . He picked YOU. He likes you, he wants to be with you \n\nAnd here we are taking a shit on the relationship by showing we don’t care if we loose it or not. \n\n3 months is fresh but still. If he is even listening. Think about it before you push too hard or get too annoyed with him \n\nHe’s “done” because you’re sharing your disorder with no intent to better yourself\n\nAnyone who likes you isn’t going to support that. \nUnfortunately but it’s the truth \n- \nRemember we may need to vent but are we venting to the right person? \nYou vent to a partner who WANTS YOU they want the best for you \n\nMaybe if you’re not ready for that you DO need a good non recovery non relapse friend group to talk it out with so when you see your man you are more emotionally prepared to be with him. Not use him as a therapist",
          "created_utc": 1671123206.0
        },
        {
          "id": "j0cg0lm",
          "author": "Bananapopana88",
          "body": "I don’t expect therapy from him. \n\nIf he doesn’t know what to say saying that will suffice. He could say he doesn’t understand why I feel the compulsion, or why the binges are large, or ask why I need to hide it.  I could work with that. Blind ignorance to how my illness works I can’t. \n\nNot even an “What’s going on that you feel the need to do this again”\n\nJust hey, you clogged the toliet. Snored. I don’t feel like he cares about me outside of this anyways.",
          "created_utc": 1671124505.0
        }
      ]
    }
  ]
}