{
  "id": "zsd69o",
  "subreddit": "bulimia",
  "author": "Emmybug12",
  "created_utc": 1671686265.0,
  "title": "just purged a $200 meal and I want to cry",
  "selftext": "Went out for dinner for Christmas with my dad and sisters. He really wanted to treat us and do something special. before leaving though, I just had to get it up. I feel like I wasted my Dad's money and that the food could have gone to someone who needed it. \n\nWasn't a pleasant purge either, we had a blue cheese platter to finish, which definitely did not taste as good coming up and it did going down. \n\nI just want too cry, I feel so much guilt",
  "url": "https://www.reddit.com/r/bulimia/comments/zsd69o/just_purged_a_200_meal_and_i_want_to_cry/",
  "score": 68,
  "num_comments": 9,
  "comments": [
    {
      "id": "j17ljah",
      "author": "None",
      "body": "no no don’t feel guilty you have an addiction an illness, you didn’t not go out of ur way to purposely do it you tried and that’s all that matters! you was present with him and you had hopefully a nice time up until the purging part. the food did go to someone who needs it! you’re a human being we need food to live you’re worthy and deserving of food ik u purged it but still. i hope this can somehow be a step to trying to avoid doing it in the future,\n\n\nhowever i understand the emotions ur going through rn it’s ok just breathe you tried you didn’t quite manage it yet but pls love do not feel guilty it is not ur fault u didn’t do anything awful, u have an illness. im sure ur dad would feel no harsh feelings towards you.",
      "created_utc": 1671690846.0,
      "score": 33,
      "context": []
    },
    {
      "id": "j18cqnt",
      "author": "talktoaliens",
      "body": "i purge expensive meals pretty much every single time i go to a nice dinner. some of them were upwards of $500 pp. the way i kind of resolved this in my mind was that i really enjoyed eating it, and the company, and the experience. and that’s what i paid for. that’s what you actually do pay for. sure, the food is good quality, but expensive dinners are mostly about the experience. \n\nso don’t worry, it happens. and it’s ok. :)",
      "created_utc": 1671712138.0,
      "score": 25,
      "context": []
    },
    {
      "id": "j18450v",
      "author": "9miumiu9",
      "body": "I try not to think of purging food as a waste first I doubt anyone who \"needed it\" would have got the food it was a treat at a restaurant which most people who are in poverty wouldn't be able to afford and restaurants just throw out leftovers anyways second treats aren't exactly meant for fuel you don't need to justify eating it you wouldn't say you eat chocolate for fuel or nourishment it's okay to have fun foods or meals just for the sake of enjoyment regardless of whether you manage to keep it down and last of all you're a human you deserve to have food and trips out to eat at restaurants just because you're struggling doesn't mean you suddenly don't need food or deserve to have fun foods and expensive foods your dad took you to the restaurant so you would enjoy the meal and if you enjoyed it then he will be happy and that's all he wanted from you you haven't betrayed him or wasted it in any way you guys had a nice time eating and that's it I'm sure he wouldn't want you to beat yourself up over a mental illness :)",
      "created_utc": 1671705846.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j1ac9a9",
      "author": "Common-Club-1890",
      "body": "Try not to feel guilty. Sometimes, keeping meals down is too much. Be kind to yourself. Christmas can be so hard 💛",
      "created_utc": 1671742452.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j1awo89",
      "author": "None",
      "body": "I’ve been there countless times. It feels so much worse when it’s someone else’s money.\n\nJust know that he wouldn’t be concerned about it, he’d be concerned about your well being. So you should be too! Treat yourself kindly as much as you can",
      "created_utc": 1671750970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j1b1z7h",
      "author": "Fawun87",
      "body": "Tomorrow is a new day. Don’t feel guilty, you haven’t wasted your dads money. His main goal would have been to spend time with you and your sisters. \n\nSending you a lot of love. I know how hard this is.",
      "created_utc": 1671753294.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j1a2s7g",
      "author": "redditistoo_leftwing",
      "body": "I feel guilty thinking this could be me ! Oh God i'd rather kill some guy. But a bad guy, not a good one. Ok, that's exaggerating",
      "created_utc": 1671738721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1bkzjw",
      "author": "cdreh0",
      "body": "I agree, if you enjoyed the meal and tasting it, you enjoyed the gift of it. The gift wasn't a bunch of calories, the gift was enjoying the taste and experience of good food and company. And take as a very eating disordered thought, a gift that you enjoyed shouldn't have to come with caloric consequences.",
      "created_utc": 1671762087.0,
      "score": 1,
      "context": [
        {
          "id": "j18cqnt",
          "author": "talktoaliens",
          "body": "i purge expensive meals pretty much every single time i go to a nice dinner. some of them were upwards of $500 pp. the way i kind of resolved this in my mind was that i really enjoyed eating it, and the company, and the experience. and that’s what i paid for. that’s what you actually do pay for. sure, the food is good quality, but expensive dinners are mostly about the experience. \n\nso don’t worry, it happens. and it’s ok. :)",
          "created_utc": 1671712138.0
        }
      ]
    }
  ]
}