{
  "id": "1084ril",
  "subreddit": "fuckeatingdisorders",
  "author": "dr-bookshelf",
  "created_utc": 1673339525.0,
  "title": "Noom",
  "selftext": "It seriously fucked up my relationship with food and is a big reason why I’m in this sub now. I hate it because:\n\n- The default number of daily calories it suggests is 1,200, and you only get half the calories back from exercise. That is extreme, but the app makes it seem normal.\n\n- it claims that “no foods are bad” and yet labels them as red, green and yellow, then basically shames you for going over your allotted “red foods”\n\n- the whole weighing yourself every day thing. You start off your day immediately thinking about your weight, about food. \n\n- its general tone is patronizing AF\n\nMaybe this works for some people who have no underlying disorders (ED or otherwise), but, especially after the pandemic, that seems rare. \n\nI wish I could block their ads everywhere because it’s so triggering. I get so angry.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1084ril/noom/",
  "score": 112,
  "num_comments": 20,
  "comments": [
    {
      "id": "j3rjel7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1673367439.0,
      "score": 31,
      "context": []
    },
    {
      "id": "j3rlrj2",
      "author": "None",
      "body": "I've never used Noom but from this description it sounds like an absolute nightmare. I can't imagine this working well for *anyone*. Maybe they lose weight, sure, but this is absolutely ED fuel, not even in disguise.",
      "created_utc": 1673368316.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j3sdb8c",
      "author": "solskinnratel",
      "body": "I tried it after gaining some weight attempting recovery on my own. Note, I had atypical anorexia, so my weight was higher and when I “gained some” I was put into the “overweight” and then the “obese” category later on. This felt like I was both a) failing at recovery because I assumed you weren’t “supposed” to get “fat” again in recovery, and b) “not actually sick” etc etc. But I was also super afraid of going back into the ED mindset full in, and I though Noom would be like, ED-proof weight loss.\n\nNope nope NOPE NOPE NOPE. Three days in I jumped ship. Would rather learn to be neutral with the body I have that give any of my time, energy, or forbid MONEY to that company.\n\nDespite consuming a huge amount of anti-diet media, I still get so many weight loss ads everywhere that I want to scream. It’s no longer Noom but now Found (medicated weight loss), which I hate for different reasons. If they can track that I’m “fat” now, they should also be able to track that *im wholly uninterested in their “weight control” ads*",
      "created_utc": 1673378357.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j3r3dk1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1673361067.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j3thlg2",
      "author": "dollszn",
      "body": "1,200??? i’ve seen their ads a ton but i never knew they went that low. setting people up to develop eds is a different type of evil.",
      "created_utc": 1673393015.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j3rt3xl",
      "author": "namey_9",
      "body": "jesus, glad I never bothered with apps. As a woman, weighing myself every day would be nonsense no matter my fitness level. Good for you for seeing through the bs.",
      "created_utc": 1673371008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j3tv5vc",
      "author": "rusty_tutu",
      "body": "Thanks for posting this.. I  was curious about the psychological aspects they show on their commercials..\n\nWon't waste my time..!",
      "created_utc": 1673398494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j3zvdwb",
      "author": "Fruitbaaaatbabe",
      "body": "It’s sincerely an eating disorder in an app.",
      "created_utc": 1673499089.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j3rhi5k",
      "author": "Street-Broccoli-9084",
      "body": "All I am going to say is literally sameeeeeeee. Especially the 1,200 Calorie and half the exercise thing. It is very extreme and normalizes it.",
      "created_utc": 1673366716.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j3uf7s0",
      "author": "petitepea_",
      "body": "I agree… it’s so encouraging for EDs it’s outrageous. I was too young to know until it was too late when i was using those apps. It’s really damaged me in the complete long run and every. Day. It feels like a fight to be/think healthy. Its been 6 years. \nHonestly I can’t believe 1,200 cal is still normalized.",
      "created_utc": 1673406969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3ym92p",
      "author": "sunshineroar",
      "body": "I've heard their ads on NPR :/",
      "created_utc": 1673479461.0,
      "score": 0,
      "context": []
    },
    {
      "id": "j3ux71n",
      "author": "throwawaythattobasco",
      "body": "I never used Noom, but something similar. I remember thinking it was a good app because it let me eat 1300 kcal a day 🤨 That was deep into my disordered eating days. It was also weekly weigh ins instead of daily, and even if that was «better», it still fueled disordered eating. I remember this test you had to take to see how healthy/unhealthy you are and I was average at my worst disordered eating days. I was eating too much at 1300 kcal according to the app because I wasn’t losing enough weight. I also remember the app scolding me for having a mcflurry and I cried so hard I didn’t eat for days after. \n\nSafe to say when I finally deleted it I felt so much better.",
      "created_utc": 1673415907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3vajw6",
      "author": "noodle0",
      "body": "Agreed. It totally messed up how I viewed food and still does to this day now that I think about it. Eating barely ANY “red foods” and that bar shooting up like “no no no!! Cucumbers and spinach only!” So fucked up, I don’t recommend it to anyone.",
      "created_utc": 1673425168.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j5lvfpu",
      "author": "sunshineroar",
      "body": "I've never used Noom before, but these concerns sound pretty damning and dangerous. Has anyone here who has used the app left reviews with your thoughts? \n\nI just skimmed its reviews on the Play store, and maybe I didn't dig deep enough, but didn't notice any complaints about promoting EDs. Also, it has an average of 4.3 out of 5 stars, which is pretty good.",
      "created_utc": 1674513893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3rtb4g",
      "author": "namey_9",
      "body": ">And their statistics don't even seem that great - it says 78% of Noom users lose \"some\" weight over a six month period. Like...what? That doesn't seem that good? Most people probably lose a bit then gain a bit throughout the year, so that's totally meaningless.\n\nThis is excellent critical thinking.\n\nIt also means 22% of Noom users lose no weight at all in an entire 6 months - nearly a quarter of users. Considering that many people's weight fluctuates a little in either direction as you pointed out, for that many people to lose none at all in that amount of time is pretty bad.\n\nHowever, not everyone uses it to lose, some might be looking to gain or maintain. So there might not be enough information to judge either way.",
      "created_utc": 1673371082.0,
      "score": 17,
      "context": [
        {
          "id": "j3rjel7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1673367439.0
        }
      ]
    },
    {
      "id": "j3s7kvn",
      "author": "black_kyanite",
      "body": "I did their screening too. They were like, \"hey not only could you achieve your weight loss goals during this time, you could lose even *more* weight than that!\" And that's when I realized it was creepy and predatory and I would be giving them zero of my dollars.",
      "created_utc": 1673376208.0,
      "score": 8,
      "context": [
        {
          "id": "j3rjel7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1673367439.0
        }
      ]
    },
    {
      "id": "j3sz305",
      "author": "OvercookedRedditor",
      "body": "Yeah noon is basically MyFitnessPal again but rebranded. I never used it personally just from what I've seen.",
      "created_utc": 1673386105.0,
      "score": 3,
      "context": [
        {
          "id": "j3rlrj2",
          "author": "None",
          "body": "I've never used Noom but from this description it sounds like an absolute nightmare. I can't imagine this working well for *anyone*. Maybe they lose weight, sure, but this is absolutely ED fuel, not even in disguise.",
          "created_utc": 1673368316.0
        }
      ]
    },
    {
      "id": "j3szcrm",
      "author": "OvercookedRedditor",
      "body": "I'm not sure on every platform but you can block ads about trigging topics on Instagram. Ended up getting Hulu premium to avoid the constant ads about alcohol and one about medicine to help with bedroom stuff using vegetables to represent the thing.",
      "created_utc": 1673386202.0,
      "score": 2,
      "context": [
        {
          "id": "j3r3dk1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1673361067.0
        }
      ]
    },
    {
      "id": "j5ipr3o",
      "author": "dr-bookshelf",
      "body": "I hate it!! I listen to a lot of their podcasts and always get them.",
      "created_utc": 1674459083.0,
      "score": 1,
      "context": [
        {
          "id": "j3ym92p",
          "author": "sunshineroar",
          "body": "I've heard their ads on NPR :/",
          "created_utc": 1673479461.0
        }
      ]
    },
    {
      "id": "j3zvgl7",
      "author": "Fruitbaaaatbabe",
      "body": "This! I think even a little worse in a way due to the psychological manipulation",
      "created_utc": 1673499130.0,
      "score": 2,
      "context": [
        {
          "id": "j3rlrj2",
          "author": "None",
          "body": "I've never used Noom but from this description it sounds like an absolute nightmare. I can't imagine this working well for *anyone*. Maybe they lose weight, sure, but this is absolutely ED fuel, not even in disguise.",
          "created_utc": 1673368316.0
        },
        {
          "id": "j3sz305",
          "author": "OvercookedRedditor",
          "body": "Yeah noon is basically MyFitnessPal again but rebranded. I never used it personally just from what I've seen.",
          "created_utc": 1673386105.0
        }
      ]
    },
    {
      "id": "j3zx100",
      "author": "OvercookedRedditor",
      "body": "Yeah I don't know exactly because like I said I've never used it. My mom was very fortunately too cheap to actually put me in any program or anything like that. Unfortunately too cheap to put me in any treatment. Now, I personally don't struggle with amount as much as certain foods. A program that pushes certain foods are worse than otheds would be horrible for me personally. Certain foods I love I haven't had in years now.",
      "created_utc": 1673499993.0,
      "score": 1,
      "context": [
        {
          "id": "j3rlrj2",
          "author": "None",
          "body": "I've never used Noom but from this description it sounds like an absolute nightmare. I can't imagine this working well for *anyone*. Maybe they lose weight, sure, but this is absolutely ED fuel, not even in disguise.",
          "created_utc": 1673368316.0
        },
        {
          "id": "j3sz305",
          "author": "OvercookedRedditor",
          "body": "Yeah noon is basically MyFitnessPal again but rebranded. I never used it personally just from what I've seen.",
          "created_utc": 1673386105.0
        },
        {
          "id": "j3zvgl7",
          "author": "Fruitbaaaatbabe",
          "body": "This! I think even a little worse in a way due to the psychological manipulation",
          "created_utc": 1673499130.0
        }
      ]
    }
  ]
}