{
  "id": "10m0bm4",
  "subreddit": "fuckeatingdisorders",
  "author": "Pieta_prkl",
  "created_utc": 1674761675.0,
  "title": "Before and after \"recovery\" posts",
  "selftext": "They always show a picture of themselves completely emaciated and in the next pic they're like still skinny but with muscle. like i guess there's nothing wrong with that but then they're like \"Oh i was so small and fragile and skinny~ now i'm HEALTHY and TONED and i portion my salads right and work out a lot and i'm STRONG and so much HEALTHIER :D\" idk maybe that irks just me",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/10m0bm4/before_and_after_recovery_posts/",
  "score": 101,
  "num_comments": 8,
  "comments": [
    {
      "id": "j6061qc",
      "author": "Sareeee48",
      "body": "Nah as someone who likes to lift weights for the joy of it rather than aesthetics or the calorie burn, it’s really annoying that people go from pure restriction to exercise addiction and base what they’re allowed to eat on how much or how hard they exercise. The entire point of recovery is to find food freedom and accept your body—not continue to limit yourself out of fear of weight gain or becoming fat.\n\nBut when we live in a society that promotes disordered behaviors like exercising and restircting your intake as a means of changing your body, I can’t blame them entirely. They just genuinely don’t know any better, they really do think that’s what recovery looks like.",
      "created_utc": 1674762936.0,
      "score": 64,
      "context": []
    },
    {
      "id": "j60t09b",
      "author": "emilylikesturtles",
      "body": "Yeaaa I see a lot of bouncing between anorexia and exercise addiction (with some food restriction still, but not as bad so they claim they are \"better\"). Just one disordered behavior to another. Still terrified of gaining an ounce of fat and tracking macros obsessively, but eat slightly more than they used to to fuel their hard-core workouts now without passing out. It's very sad to me. I almost went down that pipeline before when I was trying to convince myself that I was doing \"better\"",
      "created_utc": 1674771529.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j62l1gy",
      "author": "Solal-King-Raccoon",
      "body": "It’s kinda annoying because it doesn’t seem like they actually recovered, I felt bad for my attempt at recovery not being the perfect sport girl açaí bowl thing",
      "created_utc": 1674802237.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j60q2bs",
      "author": "scrambled-satellite",
      "body": "I initially started a recov account but stopped because I didn’t want to perpetuate the same ED behaviors that got me deep in my relapse as healthy. \n\nAt this point I’m in quasi and honestly I refuse to lie online and say that I’m fine with how my body looks, not actively engaging with Ed behaviors (though I am using harm reduction techniques I didn’t use before such as increased intake) etc. \n\nIt’s frustrating and triggering to see others clearly in quasi pretending they are 100% healthy and promoting disordered behaviors online.",
      "created_utc": 1674770379.0,
      "score": 22,
      "context": []
    },
    {
      "id": "j63dcsf",
      "author": "Accomplished_Act412",
      "body": "the way i could @ a couple of people",
      "created_utc": 1674823696.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j61yyla",
      "author": "Stacee888",
      "body": "Fr tho",
      "created_utc": 1674789695.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j631h5o",
      "author": "DowntownCarob",
      "body": "Haha I love this description. It’s giving *manic pixie dream girl* energy",
      "created_utc": 1674815496.0,
      "score": 2,
      "context": [
        {
          "id": "j62l1gy",
          "author": "Solal-King-Raccoon",
          "body": "It’s kinda annoying because it doesn’t seem like they actually recovered, I felt bad for my attempt at recovery not being the perfect sport girl açaí bowl thing",
          "created_utc": 1674802237.0
        }
      ]
    }
  ]
}