{
  "id": "10zplzc",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1676129179.0,
  "title": "People should stop commenting on other people’s weight.",
  "selftext": "This is my first time posting on Reddit ever and I just had to rant because I’m just so upset and mad at our fatphobic society.\n\nSo a little background: I’m a bit underweight at the moment from severe restriction and I had all the symptoms of restriction: no period for about 8 months now, being cold all the time, hair loss, dry skin patches, low libido and no energy to do anything.\n\nRecently I got a part time EMT job and it was a wake up call for me to start recovering since I had to transport and lift patients safely and I was putting their health at risk if I dropped them or couldn’t transport them properly. Also I was just so sick of everything that my ed has taken from me (my social life, personality, etc) so I went full force into recovery a few days ago or the all in method as u call it. I have extreme mental hunger but I honor it fully and honestly the hardest part has been digestion issues which causes me so much pain every time I eat.\n\nYesterday, I went in for my EMT training shift and they told me that if I could not operate the gurney with at least 200 lbs on it, I was going to have to take time off (at least a month) to build strength and come back. Of course only being a few days into recovery, I didn’t have my strength back and failed to do so. I was so disappointed in myself because it was just another aspect of my life that my eating disorder took from me all because I foolishly believed that being skinny was the best thing in the world. While waiting for my Uber back to my college dorm, I started to cry, and I couldn’t stop even when my Uber got there. My Uber driver was an old man and he was clearly trying to make me feel better but he ended up doing exactly the opposite.\n\nHe asked me what was wrong to which I responded just having a bad day. Then, he proceeded to say well at least you’re a very pretty and skinny young lady. He kept going and told me there’s other girls on campus who are bigger and don’t look like me and that being skinny in America is already a reason why I shouldn’t be sad.\n\nI think this was possibly the worst thing that I could’ve heard in recovery and I’m just glad I’m so set on recovering since this was definitely really triggering. Im having a really hard time mentally from recovery, getting laid off (kind of), and this event, and also physically from so much food, bad digestion, and bloating. My friends and family don’t know about my ed and I just simply want a hug and reassurance from someone that everything is gonna be okay.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/10zplzc/people_should_stop_commenting_on_other_peoples/",
  "score": 95,
  "num_comments": 15,
  "comments": [
    {
      "id": "j84jda2",
      "author": "the_acid_lava_lamp",
      "body": "That’s terrible. Im so sorry he said that and I’m sorry for all the things the ED has taken from you. Recovery is worth it ❤️‍🩹",
      "created_utc": 1676131102.0,
      "score": 25,
      "context": []
    },
    {
      "id": "j84m88z",
      "author": "None",
      "body": "I had a (kinda?) similar thing happen before with a taxi driver. Old guy who knew me when I was bigger told me that I looked great even though I said I was sick and he basically replied to the effect of \"well at least you're skinny now\" and I just wanted to scream.\nSociety really does act like being thin is the most important thing and it's so damaging.\nKeep going, you are worth more than your weight and people's dumb opinions ♡",
      "created_utc": 1676132340.0,
      "score": 18,
      "context": []
    },
    {
      "id": "j84lp8d",
      "author": "firecat321",
      "body": "You’re doing amazing, love. Congrats on going all in! I’m so sorry that your ED has disrupted your job- it sounds like it’s something that you really value. Please keep going. 💜 You are so worth it.\n\nWhat an incredibly odd rant from your Uber driver. After the day you had, it must’ve sounded extra WTF. I don’t want to sound ageist (or sexist), but that kind of talk was so normalized in his generation; I’m sure he genuinely thought he was complementing you and lifting you up. Please take it with a huge grain of salt. But I absolutely agree that people should stop commenting on other peoples’ bodies. It’s super inappropriate and frustrating.",
      "created_utc": 1676132113.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j85ija5",
      "author": "cbau97",
      "body": "I've had a similar experience. My boyfriend's best friend's mom commented at dinner once how it was so good that I didn't gain any weight from COVID and how I look so good. Little did she know what I was going through on top of having stomach issues from IBS. Unfortunately, people feel the need to comment no matter what size you are.\n\nFocus on your goals! Don't let someone's poor attempt at a compliment derail you. You've come so far and have accomplished so much. The future will be even brighter ♥️",
      "created_utc": 1676145609.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j85p5z9",
      "author": "Spectrachic311311",
      "body": "I’ve gotten comments like that too. A few people have said “Well at least you aren’t fat in your middle age, unlike most women. You must have a lot of self discipline!”. It makes it so hard to recover.",
      "created_utc": 1676148381.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j85sz8u",
      "author": "Hupia24",
      "body": "I'm so sorry to hear you had to take such a blow to such an amazing mindset for recovery. What an inspiring recovery reason! I bet that if that uber driver knew your story he would absolutely support your choices.   \nNo matter what anyone says:   \nYou are allowed to eat the things you need to eat, so you can do the things you want to do.  \nYou are allowed to gain the weight you need to gain, to do the things you want to do.",
      "created_utc": 1676150016.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j86vliq",
      "author": "roaring_elbow",
      "body": "The main thing I learned in recovery is to just not on other people's appearances. Period. You just don't know where someone else is at with how they feel about themselves.  I'm so sorry that you had to go through that.  I am proud of your recovery!",
      "created_utc": 1676167723.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j88m9rl",
      "author": "Ok-Leopard7676",
      "body": "It sucks. My grandma had to stop hiring her cleaning lady until the pandemic was controlled enough, and when she came back she looked me up and down and said \"you look like you were cut in half, how did you do it?\" I cried and my family told me to just take it as a compliment. I wish people would mind their own effing business...",
      "created_utc": 1676209686.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j84zde7",
      "author": "None",
      "body": "Thank you I won’t let my ED take away any more!",
      "created_utc": 1676137723.0,
      "score": 5,
      "context": [
        {
          "id": "j84jda2",
          "author": "the_acid_lava_lamp",
          "body": "That’s terrible. Im so sorry he said that and I’m sorry for all the things the ED has taken from you. Recovery is worth it ❤️‍🩹",
          "created_utc": 1676131102.0
        }
      ]
    },
    {
      "id": "j84zxyl",
      "author": "None",
      "body": "That’s terrible I’m sorry you had to go through that :( it’s so frustrating when you’re already struggling with an ed. I guess we just have to learn to ignore people like this <3",
      "created_utc": 1676137953.0,
      "score": 3,
      "context": [
        {
          "id": "j84m88z",
          "author": "None",
          "body": "I had a (kinda?) similar thing happen before with a taxi driver. Old guy who knew me when I was bigger told me that I looked great even though I said I was sick and he basically replied to the effect of \"well at least you're skinny now\" and I just wanted to scream.\nSociety really does act like being thin is the most important thing and it's so damaging.\nKeep going, you are worth more than your weight and people's dumb opinions ♡",
          "created_utc": 1676132340.0
        }
      ]
    },
    {
      "id": "j8507p2",
      "author": "None",
      "body": "Yea I definitely understand that he was older and trying to make me feel better so I’m trying to see it from the best light possible. Thank you for your kind words💟",
      "created_utc": 1676138063.0,
      "score": 3,
      "context": [
        {
          "id": "j84lp8d",
          "author": "firecat321",
          "body": "You’re doing amazing, love. Congrats on going all in! I’m so sorry that your ED has disrupted your job- it sounds like it’s something that you really value. Please keep going. 💜 You are so worth it.\n\nWhat an incredibly odd rant from your Uber driver. After the day you had, it must’ve sounded extra WTF. I don’t want to sound ageist (or sexist), but that kind of talk was so normalized in his generation; I’m sure he genuinely thought he was complementing you and lifting you up. Please take it with a huge grain of salt. But I absolutely agree that people should stop commenting on other peoples’ bodies. It’s super inappropriate and frustrating.",
          "created_utc": 1676132113.0
        }
      ]
    },
    {
      "id": "j8622wg",
      "author": "None",
      "body": "Thank you so much! I’m so sorry about your experience too. People really underestimate how much their words can hurt to others and can be very insensitive🥲",
      "created_utc": 1676154070.0,
      "score": 1,
      "context": [
        {
          "id": "j85ija5",
          "author": "cbau97",
          "body": "I've had a similar experience. My boyfriend's best friend's mom commented at dinner once how it was so good that I didn't gain any weight from COVID and how I look so good. Little did she know what I was going through on top of having stomach issues from IBS. Unfortunately, people feel the need to comment no matter what size you are.\n\nFocus on your goals! Don't let someone's poor attempt at a compliment derail you. You've come so far and have accomplished so much. The future will be even brighter ♥️",
          "created_utc": 1676145609.0
        }
      ]
    },
    {
      "id": "j862f3x",
      "author": "None",
      "body": "I don’t know why people feel the need to comment it’s so unnecessary. I just try to remember that at the end of the day it’s not their words that matter but my own well being and happiness. Wishing you and I both the best on our recovery 🫶",
      "created_utc": 1676154221.0,
      "score": 5,
      "context": [
        {
          "id": "j85p5z9",
          "author": "Spectrachic311311",
          "body": "I’ve gotten comments like that too. A few people have said “Well at least you aren’t fat in your middle age, unlike most women. You must have a lot of self discipline!”. It makes it so hard to recover.",
          "created_utc": 1676148381.0
        }
      ]
    },
    {
      "id": "j862oar",
      "author": "None",
      "body": "Thank you! Your kind words or reassurance mean so much to me atm🥹🥹",
      "created_utc": 1676154335.0,
      "score": 1,
      "context": [
        {
          "id": "j85sz8u",
          "author": "Hupia24",
          "body": "I'm so sorry to hear you had to take such a blow to such an amazing mindset for recovery. What an inspiring recovery reason! I bet that if that uber driver knew your story he would absolutely support your choices.   \nNo matter what anyone says:   \nYou are allowed to eat the things you need to eat, so you can do the things you want to do.  \nYou are allowed to gain the weight you need to gain, to do the things you want to do.",
          "created_utc": 1676150016.0
        }
      ]
    },
    {
      "id": "j87a15v",
      "author": "None",
      "body": "Me too! Even something that seems positive about appearance may actually be harmful to someone. Thank you I’m so determined for full recovery this time! :)",
      "created_utc": 1676175069.0,
      "score": 1,
      "context": [
        {
          "id": "j86vliq",
          "author": "roaring_elbow",
          "body": "The main thing I learned in recovery is to just not on other people's appearances. Period. You just don't know where someone else is at with how they feel about themselves.  I'm so sorry that you had to go through that.  I am proud of your recovery!",
          "created_utc": 1676167723.0
        }
      ]
    }
  ]
}