{
  "id": "118btb8",
  "subreddit": "fuckeatingdisorders",
  "author": "emilyyypaigeee18",
  "created_utc": 1677002784.0,
  "title": "Fuck this disorder",
  "selftext": "Literally for anyone stuck in limbo, “should I recover or should I stay sick”, whatever your thought is from keeping you from getting better, like shut that shit down. Seriously. Remember that you are sick, and your brain is sick, and you are stuck in self destruct mode, you are not ever going to just choose better for yourself and have it be easy. You literally have to rewire your fucking brain, you are going to get more sick before you feel better, it’s going to be hard, you’re going to want to relapse, you’re going to hate yourself, it’s not going to feel good all the time, but after you start goddamn does it feel so fucking good. Once your body has time to start restoring itself and you stop feeling dizzy all the time, you stop passing out, you stop having seizures, you don’t feel sick 24/7, like you really start realizing that you don’t actually want those things, you don’t really want to be sick, you feel so grateful to not be sick and not feel cold that it pushes you to never want to go back. I promise you, you will never regret recovering. But you will regret letting yourself get more and more sick. They don’t tell you what you’re fucking up, and you think that you know but you don’t. Or sometimes getting another disorder or another thing wrong in your body is like a badge of honor, someone telling you that you did it, you’re getting more sick. That’s because you’ve rewired your brain to give you dopamine for self destructive behaviors. You get dopamine when you skip a meal instead of when you eat it bc you’ve rewired those neurons and chemicals in your brain. Getting osteoporosis might sound nice and like you’re SkinnyTM, until none of your bones can support you, your knees dislocate constantly and are collapsing beneath you, you’re getting arthritis in your 20s, and doctors are telling you that you probably won’t live past 35. \n\nAnd beyond any medical problem, you want to be skinny and tiny until you get there. I hate my body now. I look like a child, my pants look like they’re for babies, I can’t find anything in stores that fit me bc they don’t have sizes this small, and this all sounds like “aw poor you bullshit” but it fucking sucks. It fucking sucks to starve yourself for the better half of your life just to get everything you thought you wanted, and you hate it and you hate yourself and you destroyed your body and you destroyed ever having a chance for a healthy life, and you look back on pictures from when you hated yourself and get pissed off bc you used to be hot and have a bodyodyody and now you look like fucking flat Stanley. \n\nJust recover. Just do it. This is a war you will never win. This is a parasite inside your brain. Exterminate it. Just fucking recover.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/118btb8/fuck_this_disorder/",
  "score": 115,
  "num_comments": 22,
  "comments": [
    {
      "id": "j9gl5mv",
      "author": "lovetempests",
      "body": "I needed this. Having a hard time tonight. Thank you.",
      "created_utc": 1677010746.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j9hchrx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1677023509.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j9i8gzw",
      "author": "xSurpriseShawtyx",
      "body": "Instead of saying “am I sick enough?” Say “have I had enough of being sick?”",
      "created_utc": 1677037716.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j9i3scu",
      "author": "letter420elise",
      "body": "Thank you so much for this. Like \\_lunchlady said, I've felt stuck in limbo the past month too. February is always the month where my ED takes a turn for the worst, or when I relapse. I was scared going into this month, because I've been in recovery since this summer, and I've slowly been getting closer and closer to relapsing. But this snapped me out of it. \n\n\"This is a parasite inside your brain. Exterminate it.\" This gave me such a different perspective that I needed. Thank you so much.",
      "created_utc": 1677035474.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j9hir10",
      "author": "ventulicola",
      "body": "also yea fuck this disorder",
      "created_utc": 1677026161.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j9id0dn",
      "author": "throwaway49207",
      "body": "Thank you for this. I'm struggling so hard right now and can't eat but I need to push",
      "created_utc": 1677040037.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j9hd2t5",
      "author": "None",
      "body": "This is a sign. I never ever EVER get on Reddit and I was telling my husband about how I am 25 and finally, after spending over half of my life engaging in ED behaviors, I feel like I want to let go of my illness, but I won’t know who I am without it so I feel like I have to hold onto it for dear life. My husband suggested I check out this subreddit, so I did. I literally used the word “limbo” to describe where I am at in my recovery  and how I am not sure which way I want to take this because I am in a recovered body and I honestly don’t hate it as much as I thought I would. It’s HARD. Like so so so hard, but I can do more. I can live my life and feel joy—like real joy—and see more than just food and numbers and exercise is enjoyable and I am happy. Again, this is my second time ever pulling up Reddit and I feel like you were talking directly to me. Thank you so much for sharing this. Fuck ED.",
      "created_utc": 1677023752.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j9i4qge",
      "author": "Beautiful_Ab69",
      "body": "I’ve had a horrible week with my Ed and behaviors coming back full swing. Thank you for opening my eyes to the reality of the situation. Sending you hugs❤️",
      "created_utc": 1677035919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j9jdvm9",
      "author": "fishonthesun",
      "body": "What a heartfelt post. As I'm sure you've noticed, you're helping a lot of people with this, myself included. I've been working out to put on muscle, doing a \"bulk\" (surplus of calories with high protein focus to put on weight and muscle quickly) which is usually followed by a \"cut\" (mild to high calorie deficit to shed the fat weight put on to show the gained muscle) and I've been struggling to think about how I'll have to not do the cut and just deal with any extra fat I put on. I've found myself looking forward to a \"healthy weight loss\" even though it wouldn't be for me. \n\nAnyways. Thank you. This puts it in perspective- I don't need to lose weight to look \"skinny but shredded\" as my brain wants me to. I just need to be strong physically for my specific fitness goals, and strong mentally to not relapse.\n\nThank you thank you 💛",
      "created_utc": 1677066745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j9hiopi",
      "author": "ventulicola",
      "body": "wait are seizures an ed thing .. or made worse by ed .. um",
      "created_utc": 1677026133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j9hbns9",
      "author": "emilyyypaigeee18",
      "body": "You can do this. I believe in you and I’m proud of you for trying. Just keep trying. You don’t have to be sick to be loved.",
      "created_utc": 1677023164.0,
      "score": 7,
      "context": [
        {
          "id": "j9gl5mv",
          "author": "lovetempests",
          "body": "I needed this. Having a hard time tonight. Thank you.",
          "created_utc": 1677010746.0
        }
      ]
    },
    {
      "id": "j9hpsuh",
      "author": "emilyyypaigeee18",
      "body": "You can do this! It’s going to be hard but you’re going to find out just how strong you really are. You’re going to want to stop, you’re going to slip up sometimes, but just keep doing it. I can promise you, you will never regret recovering, but you will regret letting yourself get more sick. I wish you all the best throughout your recovery❤️",
      "created_utc": 1677029226.0,
      "score": 3,
      "context": [
        {
          "id": "j9hchrx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1677023509.0
        }
      ]
    },
    {
      "id": "j9ie9dy",
      "author": "emilyyypaigeee18",
      "body": "Exactly. And as you start recovery, I refer to my first year as the year I really learned what is was to be sick. As you start feeding your body and it starts getting used to eating consistently and stops storing food/feeding off itself, it starts repairing. And you get to see everything you fucked up. That’s when you really learn that it’s not cute to be sick, it’s not something you want, it’s not something you’re trying to obtain; it’s scary. You start recovering because nothing in your body works anymore, you spend most of your time at doctors, cardiologists, neurologists, orthopedic surgeons, you name a doctor you’ve probably been there. You can never walk into a doctors office without getting undressed for an EKG, which just adds to the trauma and the reasons to want to recover. \n\nBeing sick isn’t beautiful. It’s awful. It’s torture. There’s a reason we isolate ourselves so much, because it destroys you to make another person watch you die. Recover. I promise you, you don’t want this.",
      "created_utc": 1677040702.0,
      "score": 5,
      "context": [
        {
          "id": "j9i8gzw",
          "author": "xSurpriseShawtyx",
          "body": "Instead of saying “am I sick enough?” Say “have I had enough of being sick?”",
          "created_utc": 1677037716.0
        }
      ]
    },
    {
      "id": "j9id6qt",
      "author": "emilyyypaigeee18",
      "body": "Good job making it through this month! I’m so proud of you. And it is just like a parasite, and it feeds off of you being sick. It sends messages to your brain telling you not to eat, telling you to relapse, telling you this or that or anything it can to trigger you, because the more sick you get the more powerful it becomes. It consumes you. It sucks all the life out of you. But as you recover, you get that power back. As you silence that voice and feed yourself and take care of yourself and love yourself, you take all of that power back into your own hands, and it feels so good. This parasite makes you think you can’t live without it, because it can’t live without you. But you slowly start to learn that you were your own to begin with all along, and you don’t need it, and it can’t have you anymore. It can’t take anything from you anymore. \n\nSo good job silencing your parasite in one of your hardest months :) next month you’ll thank yourself that the voice is a little bit quieter. If your one year of recovery is coming up, you should start planning to celebrate, throw a little party for yourself! One year of strength. One year of choosing yourself. One year of choosing life.",
      "created_utc": 1677040133.0,
      "score": 3,
      "context": [
        {
          "id": "j9i3scu",
          "author": "letter420elise",
          "body": "Thank you so much for this. Like \\_lunchlady said, I've felt stuck in limbo the past month too. February is always the month where my ED takes a turn for the worst, or when I relapse. I was scared going into this month, because I've been in recovery since this summer, and I've slowly been getting closer and closer to relapsing. But this snapped me out of it. \n\n\"This is a parasite inside your brain. Exterminate it.\" This gave me such a different perspective that I needed. Thank you so much.",
          "created_utc": 1677035474.0
        }
      ]
    },
    {
      "id": "j9ihi70",
      "author": "emilyyypaigeee18",
      "body": "You can do this! You deserve nutrients!! Just think of it as brain fuel, energy for your body, things you need to keep you moving. Food is not the enemy. We need it just as much as we need to breathe.",
      "created_utc": 1677042529.0,
      "score": 2,
      "context": [
        {
          "id": "j9id0dn",
          "author": "throwaway49207",
          "body": "Thank you for this. I'm struggling so hard right now and can't eat but I need to push",
          "created_utc": 1677040037.0
        }
      ]
    },
    {
      "id": "j9hqvz6",
      "author": "emilyyypaigeee18",
      "body": "It’s scary letting go, and it is hard to figure out what life should look like without your disorder. In the beginning it’s work, you have to push those thoughts down yourself, you have to make yourself think of things in a positive light, you have to avoid your self destructive behaviors, and you start to see just how many of them you have. And it’s scary thinking about existing in the world without being sick, you think people won’t treat you the same or won’t care about you anymore, but that’s all your disorder talking. As you keep pushing through, the work becomes habit. You start realizing “it’s been x amount of days since I’ve thought about xyz”, and sometimes those thoughts want to make you spiral, and sometimes those thoughts feel like new badges of honor. As you start restoring your body and seeing all the things you’re capable of again, those become your goals and victories. \n\nAnd it sounds stupid, but practicing self love changes your fucking life. Not just taking baths and mental health days, but again, putting in the work. I would sit in front of the mirror and smile just to trick my brain, I started working on healing my inner child, I started figuring out what clothes make me feel good and what style I really like and how I really want to exist in the world for only me, not the sick part of my brain. Everything you think you love about yourself is still wrapped up in your disorder. In what you’re allowed to love. Figure out what you love, figure out what makes you happy, heal all parts of your life, and then you’ll really feel what it’s like to be in a healthy body, and it feels great. I’m still a little broken, but in the moments I feel healthy, it’s like standing in the sunshine in the morning light, it just feels so good and happy and fulfilling. \n\nTake this as your sign, take your life back into YOUR hands, not your disorder’s.",
      "created_utc": 1677029713.0,
      "score": 6,
      "context": [
        {
          "id": "j9hd2t5",
          "author": "None",
          "body": "This is a sign. I never ever EVER get on Reddit and I was telling my husband about how I am 25 and finally, after spending over half of my life engaging in ED behaviors, I feel like I want to let go of my illness, but I won’t know who I am without it so I feel like I have to hold onto it for dear life. My husband suggested I check out this subreddit, so I did. I literally used the word “limbo” to describe where I am at in my recovery  and how I am not sure which way I want to take this because I am in a recovered body and I honestly don’t hate it as much as I thought I would. It’s HARD. Like so so so hard, but I can do more. I can live my life and feel joy—like real joy—and see more than just food and numbers and exercise is enjoyable and I am happy. Again, this is my second time ever pulling up Reddit and I feel like you were talking directly to me. Thank you so much for sharing this. Fuck ED.",
          "created_utc": 1677023752.0
        }
      ]
    },
    {
      "id": "j9idl7s",
      "author": "emilyyypaigeee18",
      "body": "Sometimes we’ll slip up and that’s okay, because we need to offer ourselves love and compassion even when we mess up too, to also show ourselves that it’s okay to come back to where we were and just keep moving. I know it’s hard to give them up, but like I said, you will never regret recovering, but you will regret getting more sick. It’s okay to fall as long as we get back up. Just use it as fuel to push yourself.",
      "created_utc": 1677040349.0,
      "score": 1,
      "context": [
        {
          "id": "j9i4qge",
          "author": "Beautiful_Ab69",
          "body": "I’ve had a horrible week with my Ed and behaviors coming back full swing. Thank you for opening my eyes to the reality of the situation. Sending you hugs❤️",
          "created_utc": 1677035919.0
        }
      ]
    },
    {
      "id": "j9hr3f2",
      "author": "emilyyypaigeee18",
      "body": "My eating disorder caused me to start having seizures, not everyone develops these but it is very common since we’re fucking with our brains and every part of our body. Mine was caused by passing out too often among other issues.",
      "created_utc": 1677029804.0,
      "score": 3,
      "context": [
        {
          "id": "j9hiopi",
          "author": "ventulicola",
          "body": "wait are seizures an ed thing .. or made worse by ed .. um",
          "created_utc": 1677026133.0
        }
      ]
    },
    {
      "id": "j9hnea0",
      "author": "WhereBagel",
      "body": "yep I'm currently in the hospital on an iv for sodium and glucose imbalances because the doctor here says I'm at risk of seizures or a coma without it, due to nothing but the ED",
      "created_utc": 1677028161.0,
      "score": 2,
      "context": [
        {
          "id": "j9hiopi",
          "author": "ventulicola",
          "body": "wait are seizures an ed thing .. or made worse by ed .. um",
          "created_utc": 1677026133.0
        }
      ]
    },
    {
      "id": "j9hswfo",
      "author": "None",
      "body": "I don’t cry often, but this got me. Thank you. Thank you so much for quieting the part of me that is so loud. I know it won’t be easy at first—hell, it may be hard for a long time. I heard a lyric today, “living like this is no way to die”, and I have thought about it so much since. It’s bullshit. It’s all a lie and I am just ready to live. I am ready for the jump. Sure, it may be unknown and sure it may be scary, but I’m ready to let go. To live for the girl I tortured for so many years—for me. I will remember this. I’ll use it—and I promise you, I will win this fight (and so will you, those of you who are reading this also stuck in this weird limbo). Thank you again ❤️",
      "created_utc": 1677030610.0,
      "score": 6,
      "context": [
        {
          "id": "j9hd2t5",
          "author": "None",
          "body": "This is a sign. I never ever EVER get on Reddit and I was telling my husband about how I am 25 and finally, after spending over half of my life engaging in ED behaviors, I feel like I want to let go of my illness, but I won’t know who I am without it so I feel like I have to hold onto it for dear life. My husband suggested I check out this subreddit, so I did. I literally used the word “limbo” to describe where I am at in my recovery  and how I am not sure which way I want to take this because I am in a recovered body and I honestly don’t hate it as much as I thought I would. It’s HARD. Like so so so hard, but I can do more. I can live my life and feel joy—like real joy—and see more than just food and numbers and exercise is enjoyable and I am happy. Again, this is my second time ever pulling up Reddit and I feel like you were talking directly to me. Thank you so much for sharing this. Fuck ED.",
          "created_utc": 1677023752.0
        },
        {
          "id": "j9hqvz6",
          "author": "emilyyypaigeee18",
          "body": "It’s scary letting go, and it is hard to figure out what life should look like without your disorder. In the beginning it’s work, you have to push those thoughts down yourself, you have to make yourself think of things in a positive light, you have to avoid your self destructive behaviors, and you start to see just how many of them you have. And it’s scary thinking about existing in the world without being sick, you think people won’t treat you the same or won’t care about you anymore, but that’s all your disorder talking. As you keep pushing through, the work becomes habit. You start realizing “it’s been x amount of days since I’ve thought about xyz”, and sometimes those thoughts want to make you spiral, and sometimes those thoughts feel like new badges of honor. As you start restoring your body and seeing all the things you’re capable of again, those become your goals and victories. \n\nAnd it sounds stupid, but practicing self love changes your fucking life. Not just taking baths and mental health days, but again, putting in the work. I would sit in front of the mirror and smile just to trick my brain, I started working on healing my inner child, I started figuring out what clothes make me feel good and what style I really like and how I really want to exist in the world for only me, not the sick part of my brain. Everything you think you love about yourself is still wrapped up in your disorder. In what you’re allowed to love. Figure out what you love, figure out what makes you happy, heal all parts of your life, and then you’ll really feel what it’s like to be in a healthy body, and it feels great. I’m still a little broken, but in the moments I feel healthy, it’s like standing in the sunshine in the morning light, it just feels so good and happy and fulfilling. \n\nTake this as your sign, take your life back into YOUR hands, not your disorder’s.",
          "created_utc": 1677029713.0
        }
      ]
    },
    {
      "id": "j9nr3ko",
      "author": "Ok_Willingness_531",
      "body": "Wow sorry to hear that. Get well soon! I used to get really bad muscle cramps/spasms in my legs that I think might have been due to electrolyte imbalances.",
      "created_utc": 1677138453.0,
      "score": 2,
      "context": [
        {
          "id": "j9hiopi",
          "author": "ventulicola",
          "body": "wait are seizures an ed thing .. or made worse by ed .. um",
          "created_utc": 1677026133.0
        },
        {
          "id": "j9hnea0",
          "author": "WhereBagel",
          "body": "yep I'm currently in the hospital on an iv for sodium and glucose imbalances because the doctor here says I'm at risk of seizures or a coma without it, due to nothing but the ED",
          "created_utc": 1677028161.0
        }
      ]
    },
    {
      "id": "j9ibny2",
      "author": "emilyyypaigeee18",
      "body": "“Living like this is no way to die”, I love that. It’s so true. We all deserve so much more than we can even imagine for ourselves, and recovery opens those doors for us. You will win this fight, I know it. I just want to put the offer out there because I know how badly I just wanted someone who had recovered or at least had been on the journey to talk to me and tell me things were going to be okay, or help me navigate it, or really anything, so if you ever want someone to talk to feel free to message me. Whether it’s me or someone else, you don’t have to do it alone. <3",
      "created_utc": 1677039329.0,
      "score": 5,
      "context": [
        {
          "id": "j9hd2t5",
          "author": "None",
          "body": "This is a sign. I never ever EVER get on Reddit and I was telling my husband about how I am 25 and finally, after spending over half of my life engaging in ED behaviors, I feel like I want to let go of my illness, but I won’t know who I am without it so I feel like I have to hold onto it for dear life. My husband suggested I check out this subreddit, so I did. I literally used the word “limbo” to describe where I am at in my recovery  and how I am not sure which way I want to take this because I am in a recovered body and I honestly don’t hate it as much as I thought I would. It’s HARD. Like so so so hard, but I can do more. I can live my life and feel joy—like real joy—and see more than just food and numbers and exercise is enjoyable and I am happy. Again, this is my second time ever pulling up Reddit and I feel like you were talking directly to me. Thank you so much for sharing this. Fuck ED.",
          "created_utc": 1677023752.0
        },
        {
          "id": "j9hqvz6",
          "author": "emilyyypaigeee18",
          "body": "It’s scary letting go, and it is hard to figure out what life should look like without your disorder. In the beginning it’s work, you have to push those thoughts down yourself, you have to make yourself think of things in a positive light, you have to avoid your self destructive behaviors, and you start to see just how many of them you have. And it’s scary thinking about existing in the world without being sick, you think people won’t treat you the same or won’t care about you anymore, but that’s all your disorder talking. As you keep pushing through, the work becomes habit. You start realizing “it’s been x amount of days since I’ve thought about xyz”, and sometimes those thoughts want to make you spiral, and sometimes those thoughts feel like new badges of honor. As you start restoring your body and seeing all the things you’re capable of again, those become your goals and victories. \n\nAnd it sounds stupid, but practicing self love changes your fucking life. Not just taking baths and mental health days, but again, putting in the work. I would sit in front of the mirror and smile just to trick my brain, I started working on healing my inner child, I started figuring out what clothes make me feel good and what style I really like and how I really want to exist in the world for only me, not the sick part of my brain. Everything you think you love about yourself is still wrapped up in your disorder. In what you’re allowed to love. Figure out what you love, figure out what makes you happy, heal all parts of your life, and then you’ll really feel what it’s like to be in a healthy body, and it feels great. I’m still a little broken, but in the moments I feel healthy, it’s like standing in the sunshine in the morning light, it just feels so good and happy and fulfilling. \n\nTake this as your sign, take your life back into YOUR hands, not your disorder’s.",
          "created_utc": 1677029713.0
        },
        {
          "id": "j9hswfo",
          "author": "None",
          "body": "I don’t cry often, but this got me. Thank you. Thank you so much for quieting the part of me that is so loud. I know it won’t be easy at first—hell, it may be hard for a long time. I heard a lyric today, “living like this is no way to die”, and I have thought about it so much since. It’s bullshit. It’s all a lie and I am just ready to live. I am ready for the jump. Sure, it may be unknown and sure it may be scary, but I’m ready to let go. To live for the girl I tortured for so many years—for me. I will remember this. I’ll use it—and I promise you, I will win this fight (and so will you, those of you who are reading this also stuck in this weird limbo). Thank you again ❤️",
          "created_utc": 1677030610.0
        }
      ]
    }
  ]
}