{
  "id": "11kb6qh",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1678130840.0,
  "title": "Extreme hunger is going away/ Not feeling nostalgic for sick photos",
  "selftext": "What says on title. After 14 months of recovery I'm getting my life back. I can eat with friends and family, whenever I want and without wanting to move. I'm not hungry all the time; can enjoy movies, conversations, and books. My body image is less distorted; I can see old photos again but now i understand why my friends are family were so worried. Gained an x number of weight that would have made me squirm back then, overshoot, people didn't love me any less. In fact I got a boyfriend after spending years single; person who left just before I started recovery came back, despite my body size being bigger, despite having never weighed so much in my entire life (had to say no). Don't miss too small clothes anymore; bought new, prettier ones.  I wasn't better off sick, you weren't better off sick. You're so much, much, much more than your appearance. I still have to choose recovery every day, but I can't imagine dealing  again with the continuous torture of starving myself.\n\nSo far, the best advice I have received is always doing the opposite of what ED says, and it works, even if it seems it will never feel right. Trust your mind and body, and their amazing (I can't still wrap my head around this) capacity to heal. We can do this.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/11kb6qh/extreme_hunger_is_going_away_not_feeling/",
  "score": 89,
  "num_comments": 4,
  "comments": [
    {
      "id": "jb6a6gr",
      "author": "corgi-kisses",
      "body": "This is so inspiring and i am so, so proud of you 🥹♥️ you are truly amazing and i hope you continue to enjoy your beautiful life free of the ed!",
      "created_utc": 1678130916.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jb6xnmp",
      "author": "dealingwthstff",
      "body": "OMG, that’s incredible!! I’m so happy for you❤️\nNow is time to enjoy life.\n\nI’m proud of you!",
      "created_utc": 1678140215.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jb8mzbi",
      "author": "Gwynnja",
      "body": "I am so happy for you! That sounds amazing and you deserve every happy moment and thought!!",
      "created_utc": 1678170917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jb8sk77",
      "author": "None",
      "body": "thank you ❤️❤️❤️",
      "created_utc": 1678175198.0,
      "score": 2,
      "context": []
    }
  ]
}