{
  "id": "11mc2vo",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1678318586.0,
  "title": "stepped on the scale. ( tw: suicide )",
  "selftext": "I gained about 36 pounds in recovery. I know weight talk during this process is regarded as counterproductive but it’s not for me. I couldn’t feel more content. I genuinely don’t care about it. If you would’ve told me that I would be back at this number to me, deep in my Ed, I don’t know what I would’ve done. \n\nThe last time I didn’t feel devoid of harrowing depression was more than three years ago. Everyday during the depths of my disorder, I felt like an ostrich with its head in the sand. I was existing physically but my mental state was so far gone. I dissociated the most important years of my life. I have no memories of highschool besides those of restriction. I couldn’t even tell you about the day of my graduation, but I can remember everything I ate that day, and the amount of steps. \n\nIt’s saddening to me that I lost a lot of my youth to this disorder. It’s saddening that all of my relationships, my passions, my hobbies, my academics all went with the weight loss. With each pound, I lost a facet of my personality, and I lost who I was. I would work at my job and not remember who I was. What I was living for. I had no one and no one knew me. I never spoke, I was quiet, and I was alone. I had ghosted my friends, ended friendships of 12+ years because I no longer had the capacity for others in my life. My pulse was weak and my ability to run was gone. I wasn’t able to walk without agonizing pain. People would ask me questions, and all my brain would internalize was tv static. Food was a threat, something I had to plan for, and wait for, and long for, and dread. Life was only existent upon numbers. What time to eat, how many calories, how many more hours until I can eat, how much do I weigh, how much more do I need to lose. I went through anorexia, orthorexia, bulimia, binge eating, back to anorexia. I went through every Ed and suffered tremendously. I didn’t have the attention span to watch videos or listen to music. I played instruments for eight years and my love for music was lost. I didn’t care about anything. I would sit in my music class and my brain was dormant. My teacher knew something was wrong, but couldn’t discern why the student that was a freshman prodigy was now a lifeless senior post Covid. I never smiled, I never laughed, and when I did, it felt wrong. I didn’t think I would live much longer. I thought my years were limited, that I would either starve to death or I would commit suicide. \n\nI recall being on a walk, deep in my Ed, and seeing a tree, leaking honey colored sap. I can remember physically drooling over it, imagine the tree was bread, and the sap was honey. I manically walked the next ten miles, drooling at the thought of bread and honey. I can recall crying for hours, debating if i should make it painless, or draw out my end through my Ed. Insanity. \n\nI’m not underweight anymore. I have disordered thoughts occasionally. And I wouldn’t say I’m recovered. But I have the food freedom and mental clarity of someone who never went through the pain I did. \n\n I gained weight but I regained my love for music, my ability to walk, the ability to love, to speak to others with kindness, to be filled with excitement about food, to look in the mirror and recognize myself, to stay grounded, to have my mind think about myself with compassion, to show others compassion, to look forward to the future, to know my life is meaningful, to know I am loved. I picked up my clarinet again. Like I said, I used to be an outstanding musician, and I mean that, full cockiness implied. Playing it again, as a hobby, not as a distraction from food, genuinely makes me want to cry. This is the first month in a long time where I don’t wanna die. I have no depression, and I have no thoughts of suicide. \n\nPlease recover while you still can. It’s a long process. It’s even harder than the Ed. But I promise you, you don’t deserve to live hating yourself. You deserve happiness and joy, and to eat cake when you want, to be able to think of yourself kindly, to run, to walk, to not be confined to food thoughts. \n\nSo yeah, I stepped on the scale. I honestly have plans to chuck the fucker in the trash. But I felt only love towards myself. I saw a number, not an indicator of who I was as a person, or what I’ve lived. I unconditionally promise myself to never go back to the way it was. I deserve more in life. I deserve everything it has to offer. And then some.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/11mc2vo/stepped_on_the_scale_tw_suicide/",
  "score": 91,
  "num_comments": 5,
  "comments": [
    {
      "id": "jbhrw8r",
      "author": "myceliumfriend",
      "body": "Yo wtf I'm crying. Despite being obsessed with ED stories for 8+ years, none have touched my soul like this. Congratulations ❤️",
      "created_utc": 1678331647.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jbh04mz",
      "author": "corgi-kisses",
      "body": "I absolutely love this post  \nif i had an award to give, it would go here 😫  \nit makes me so, so incredibly happy to see that you’re doing so well now and i am infinitely proud of you 🥹 you are so incredibly strong and brave and you did what for most of us seems unthinkable and got through it and came through on the other side and that is truly, truly amazing! Thank you so much for this post and i wish you a beautiful and happy ed free life 💗 you deserve everything wonderful in life, my friend 🥹 always",
      "created_utc": 1678319238.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jbjanh4",
      "author": "LateFile8300",
      "body": "Don't chuck it in the trash; destroy it!  Wear some eye protection and break it with a hammer, run over it with a vehicle, throw it into the fires of a mythical volcano, just don't even give it the satisfaction of being used/recovered.  You are going through recovery, no reason to give the lifeless device which has taken so much of your life the same opportunity to come back into your life.",
      "created_utc": 1678368695.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbi5r52",
      "author": "LoveThatForYouBebe",
      "body": "I love this. Way to go, OP. And also, thank you; I needed this more than you know tonight.",
      "created_utc": 1678339104.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jbjt83x",
      "author": "voluminousseaturtle",
      "body": "im so happy for you omg 🫶🫶🫶",
      "created_utc": 1678376674.0,
      "score": 2,
      "context": []
    }
  ]
}