{
  "id": "11xvfbu",
  "subreddit": "fuckeatingdisorders",
  "author": "PreparationStock3274",
  "created_utc": 1679434426.0,
  "title": "\"high restriction\" isn't real, restriction is just restriction AND many ppl w/AN consume waaaay more per day than stereotyped",
  "selftext": "Ok couple notes: 1.) I will be discussing specific calorie values in this post 2.) yes I realize there is restricting more vs. less 3.) weight loss is NOT a criteria for having a serious ED (and, imo, should not be required for an AN diagnosis) 4.) different bodies, different responses and needs to different calorie intakes.\n\nthis is definitely kind of a rant lmao, but fr I think the phrase \"high res\" is super harmful and also misleading.\n\n\\*\n\n\\*\n\n\\*\n\n\\*\n\n\\*\n\n\\*\n\nSo I recently saw someone use the phrase \"high res\" on insta and I NAIVELY thought \"oh maybe they're referring to mental restriction while eating adequate calories or smth\"...nope! This person was talking about 1200 cal/day. I think it is INCREDIBLY harmful to paint this as \"restricting lite\" because restriction can be dangerous at many caloric amounts. Different bodies, activity levels, basal metabolisms, health conditions, etc. mean different nutritional needs - there's no singular amount of calories that can be use as a cutoff for restricting. Painting some arbitrary calorie limit as \"high res\" just generates a sense of shame/need to eat even less. And like hey, if you've restricted more in the past and youre increasing your intake now, awesome! but oh my GOD don't pretend that your restriction is suddenly \"sooo much food\" in a way that could so clearly induce shame in other people?? save those thoughts for private journals and your therapist jfc.\n\nOn that note, I have had AN for 12 years. I became medically unstable twice, once while eating an average of \\~1400 calories/day and another time while averaging \\~1700 calories/day. I was not purging either time; my instability was exclusively related to restriction. I won't tell you the least I ever ate bc I don't think that's useful information, but I will say that there were at least as many days where I ate 2000+ calories as there were days I ate under these approximate averages, and most of the time I ate around these values. I have met individuals with restrictive EDs, strong food rituals, and exercise addiction who became underweight while eating 2500+ calories per days (among many other health problems). And I don't think myself or these others are strange outliers; in fact, multiple studies document underweight AN patients consuming 1500-1800 cal/day ([link](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3584709/); [link](https://academic.oup.com/ajcn/article/84/4/698/4633254)). And why should this be shocking when most ppl (myself included) maintain weight between 2500 and 3500 cal/day?? Like of COURSE you could lose weight restricting to 1800 at that point???\n\nBesides invalidating people  and encouraging decreased intake with harmful effects, I think calling 1200+ calories a day \"high res\" also feeds into really dangerous stereotypes about this disease. The world is, by and large, sooo disconnected from knowing how many calories people actually need per day that me saying \"oh I eat 1600 calories/day\" to many people wouldn't read as problematic when it definitely should be. And the AN stereotype of like, one apple and a black coffee isn't helping this at all. ugh ok this is my rant byeee",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/11xvfbu/high_restriction_isnt_real_restriction_is_just/",
  "score": 310,
  "num_comments": 46,
  "comments": [
    {
      "id": "jd4yvxm",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1679434426.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd50esk",
      "author": "bienshee",
      "body": "The whole “high” and “low” res thing just makes EDs more competitive than it already is 😭",
      "created_utc": 1679435010.0,
      "score": 108,
      "context": []
    },
    {
      "id": "jd4zyjh",
      "author": "throwthetulipsaway",
      "body": "I just want to say thank you for this rant. Thank you times a million. I have more thoughts but I just need to soak in the info.",
      "created_utc": 1679434834.0,
      "score": 97,
      "context": []
    },
    {
      "id": "jd5b7dr",
      "author": "HermioneGranger152",
      "body": "Thank you so much for saying this! As someone who “high” restricts and is at a normal weight, I feel so invalidated sometimes, but I have an active job and school, I literally cannot function when “low” restricting, no one seems to take eating disorders seriously unless someone is eating like one crumb every day and severely underweight. The differentiation between high res and low res, just like the difference between anorexia and atypical anorexia is ridiculous imo. We’re all disordered and we all need help, we don’t need to make it more competitive than the disorders already make it seem",
      "created_utc": 1679439399.0,
      "score": 67,
      "context": []
    },
    {
      "id": "jd6wxbl",
      "author": "tickado",
      "body": "north yoke versed edge homeless hard-to-find automatic fanatical desert psychotic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1679470971.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jd5capd",
      "author": "fauxfoxem",
      "body": "Thank you for sharing this. I felt, for so long, that I wasn’t really restricting because I was eating 1400-1800 calories a day… despite being underweight, losing my period, having malnutrition, bad labs, and orthostatic hypotension. But because diet culture convinces us that women just don’t need food, I actually thought I was eating “too much” when every other signal in my life suggested otherwise.\n\nThis is also why I take such issue with TDEE calculators and the like. There’s just no way for a programmed formula to accurately determine how much food a person needs to be healthy. Our hunger, activity, health, hormones, and so much else changes all the time. And those calculators don’t take any of that into account and honestly lowball like crazy. I’m in recovery right now eating a ton each day and, despite actively pursuing weight restoration, I’m gaining MAYBE a pound a week. But TDEE calculators would suggest I’m actually eating so high above “maintenance” that I should be weight restored by now… yeah, it doesn’t work like that.\n\nReally grateful for this post.",
      "created_utc": 1679439840.0,
      "score": 57,
      "context": []
    },
    {
      "id": "jd5rcai",
      "author": "FartsMcGhee1",
      "body": "For the longest time I thought \"high res\" meant \"high residue\" like... food that made you poop more and \"low res\" meant \"low residue\" which was food that made you poop less. 🤷‍♀️",
      "created_utc": 1679446289.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jd6t7o2",
      "author": "ForestRagamuffin",
      "body": "mods, is this something that could be pinned at the top of the sub or something? this is so so important and it literally would have changed some stuff for me if i'd read it early in recovery.\n\nanyway, thank you op! i love your post, obviously 💕",
      "created_utc": 1679467840.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jd75imz",
      "author": "not-a-tthrowaway",
      "body": "I saw a study that said the average number of calories eaten in AN per day is 1300. I found that oddly reassuring.",
      "created_utc": 1679478415.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jd6qy1m",
      "author": "the_acid_lava_lamp",
      "body": "Really? That honestly makes me feel so much better. I always felt like a fraud because I usually ate between 1600-2000 which people said was normal, except I’m a growing 16 year old and I was heavily overexercising. And I became underweight on that intake so I know it wasn’t adequate. Thank you for this post 🙏",
      "created_utc": 1679465999.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jd6uxf7",
      "author": "Glittering_goat25",
      "body": "I LOVE this post! I became medically unstable at 1500 cals a day!! 😬 Thank you for posting this. I really thought I am not worth medical care because I am still eating “enough”",
      "created_utc": 1679469279.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jd53987",
      "author": "Longjumping-Size-762",
      "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
      "created_utc": 1679436118.0,
      "score": 49,
      "context": []
    },
    {
      "id": "jd5nygd",
      "author": "sirsmeebles",
      "body": "Absolutely agree with all of what you said! I’ve only been perusing this sub for a short time, and when I came across people posting about “high res”/“low res” I was like what is this fresh hell? Compounded even more when I saw that this supposed “high res” was around 1200 calories (side note; what’s the acute obsession with 1200 calories? It’s always bobbing up in multiple subreddits and life in general by supposedly “normal” folks.. and I’m pretty certain from my own 20+ years experience that’s long winded STARVATION people!). Genuinely concerned what “low res” is. Restriction is restriction, end of story. And you’re going to pay the price for it. \n\nAnd I agree the hyper focus on tdee calculations needs to bugger off. They are so inaccurate it’s plain silly. Use yourself as your own guide. Like others have commented here, I recently had a slap of reality with my own situation in that I had slipped to a dangerously low weight without even realising (I wasn’t weighing myself at the time) because despite feeling completely crap, faint, fatigue, bonier etc etc I was convinced I was “fine” and just being a wet nelly simply because I was consuming what was considered WAY above the average “non disordered” 5’3 female *should* be eating, if you go by online calculations or even just read grown women bemoaning that they can “only” eat x amount of calories or they will instantly become huge. By that token I should have been *gaining* weight, not getting down to stupidly low bmi. I thought I was going a little insane tbh. \n\nProof is in the pudding though..like I said restriction is restriction and your body is 100% going to let you know about it. \n\nGreat post, really glad I’m not the only one who thought this way! I hope it’s made others feel less invalidated by the “high res” narrative.",
      "created_utc": 1679444803.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jd8jd68",
      "author": "StationarySprint",
      "body": "You’re so right!!! I consumed ED media online and it drove me from restrictive ED eating “higher amounts” to trying to match what I thought “real anorexics” ate—queue binging, exercise bulimia, and finally purging. In recovery I also learned at the 2000 cals per day thing is mostly BULLSHIT, most people eat more and are fine! Eating less than 1300 made me so mentally unwell that I had irrational thoughts and totally lost touch w reality.\nEdit: spelling, grammar",
      "created_utc": 1679502705.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jdn8yek",
      "author": "cinnamoslut",
      "body": "Thank you! I had what would be considered 'severe' anorexia nervosa. Been fully recovered for about 5 years now thank goodness. TW: Numbers (calories and exercise).\n\nPeople are often surprised when I tell them how 'much' I was eating most days at my sickest. My average intake was probably around 1200 calories per day. Half my daily intake was fruit and veggies, if not more. As I got worse, I'd intentionally overestimate my intake, so it's possible I was eating under 1000 calories some of the time.\n\nI was so addicted to exercise. That was my drug, my escape from the anxious mind I'd been stuck with my whole life.\n\nI walk for transportation, live in a big city in the US with good public transit so no need for a car. Probably did 20k steps (10 miles) per day on average.\n\nI'd walk to the gym, where I'd walk some more on the treadmill lol. I loved reading and walking at the same time, still do, and you can only safely do that on a treadmill. When too anxious to leave home, I'd walk around my apartment for hours, walk in place... Embarrassingly, when out with friends or family, I'd sometimes go to the bathroom and jog in place for several minutes.\n\nOther than that, I was (and still am) super into Pilates. Yoga as well. And I was a dancer, for fun and professionally. It was two hours Pilates every day, an hour of yoga, and anywhere from 2 hours of dance to \\~10 hours of dance on my most active days.\n\nSo yeah, obviously all of this physical activity put me at a huge caloric deficit. My diet probably looked 'normal' to some people, but it was nowhere near enough food to sustain such an active lifestyle. My body was falling apart, emaciated, kidneys shutting down, weak immune system (low white blood cell count) I'd get sick all the time. That's no way to live.\n\nI used to feel embarrassed / ashamed when others with eating disorders would share their super low daily calorie count. Now I don't give a fuck, thankfully. It took some work to get to this level of confidence. I do my best to educate those who are ignorant about eating disorders, and I don't take it personally when I hear things like:\n\n'That's not anorexia... Anorexia means you don't eat anything!'\n\n'You weren't anorexic, anorexics don't eat anything...'\n\n'Anorexics only eat 300 calories per day.'",
      "created_utc": 1679766268.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jd7prvl",
      "author": "None",
      "body": "Yes, I can relate to this all so much. I became severely underweight while eating 1600 to 2500 calories a day, with moderate exercise. I find that now I'm not exercising, I can maintain on 2000 calories, and a lot of people are telling me it's impossible, but I'm not overestimating because my doctors are literally in charge of my food and calorie intake right now.",
      "created_utc": 1679490853.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jdey5su",
      "author": "alexisseffy",
      "body": "Yes this is so helpful I feel invalid bc I \"high restrict\" and I feel like my ed is basically just a diet gone wrong because essentially I eat the same amount as a normal dieter.",
      "created_utc": 1679609957.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jd6vhy0",
      "author": "Prestigious-Bug-7641",
      "body": "Thankyou for this, definitely made me feel alot less horrendous about things.. well said.. 💕",
      "created_utc": 1679469764.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jd73hrc",
      "author": "Ok-Juggernaut-2124",
      "body": "Thankyou thankyou thankyou. really needed to hear this today.",
      "created_utc": 1679476718.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l017ptf",
      "author": "AnonymousApple26",
      "body": "I am late to this post, but thank you so much for this.... I have had a restrictive ED for 6 years, and I was recently diagnosed with Anorexia Nervosa. For years, I told others that I had a \"restrictive\" ED but that it was definitely not Anorexia. I believed this was the case because of the stereotypes in society, online, and even in medical/professional spaces. The first reason was that I thought my level of restriction wasn't severe enough. Because I was eating about 1,580 cals for 5 years consistently, and the lowest calories I maintained were \\~1,200-1,300, I thought that I was eating TOO much to be considered anorexic. However, I lost my period very early on as my restriction began, and I was even losing weight when I bumped up my calories to 1,900-2,000 for a period of time in the early stages. I had amenorrhea for \\~6 years, which resulted in osteoporosis. I also had the typical signs of a decreased BMR, such as sensitivity to cold, decreased BP and HR, fatigue, skin/teeth issues, etc. A second reason was that I didn't think I was \"thin enough\" to be considered anorexic. My BMI had fluctuated below and within the normal BMI range, and it was only at my very lowest weight that my BMI fell mildly below the \"normal weight range.\" This BMI range was not taking into account what my pre-ED, non-restrictive, healthy weight was.",
      "created_utc": 1713382324.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kg0mjca",
      "author": "Abject_Sea_8470",
      "body": "I gót to 12% bf (bmi still in the high 17s) with like 1700 on average",
      "created_utc": 1704223575.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m05o21o",
      "author": "ethereal_girl",
      "body": "what does \"mental restriction while eating adequate calories\" mean",
      "created_utc": 1733202510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhktwy5",
      "author": "None",
      "body": "I burn an average of 2000 calories a day. So even if I ate 1800 cals I would be losing",
      "created_utc": 1723378496.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jdeibvr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1679603787.0,
      "score": 0,
      "context": []
    },
    {
      "id": "je2yg8s",
      "author": "None",
      "body": "Shit this post made me realize I am anorexic ….",
      "created_utc": 1680051230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd5rzf5",
      "author": "snackytacky",
      "body": "Ey I just want to say, please stay at this point. I was at your same spot (except I dont work) and then summer came and I was \"allowed to let myself go\" currently in recovery but even after I came back to school I couldnt go back to eating the same. Its easy to fall in, harder to climb out",
      "created_utc": 1679446572.0,
      "score": 11,
      "context": [
        {
          "id": "jd5b7dr",
          "author": "HermioneGranger152",
          "body": "Thank you so much for saying this! As someone who “high” restricts and is at a normal weight, I feel so invalidated sometimes, but I have an active job and school, I literally cannot function when “low” restricting, no one seems to take eating disorders seriously unless someone is eating like one crumb every day and severely underweight. The differentiation between high res and low res, just like the difference between anorexia and atypical anorexia is ridiculous imo. We’re all disordered and we all need help, we don’t need to make it more competitive than the disorders already make it seem",
          "created_utc": 1679439399.0
        }
      ]
    },
    {
      "id": "jd7qw3h",
      "author": "PreparationStock3274",
      "body": "!! Also an excellent point! We literally have so much literature to show that these amounts are inadequate",
      "created_utc": 1679491364.0,
      "score": 10,
      "context": [
        {
          "id": "jd6wxbl",
          "author": "tickado",
          "body": "north yoke versed edge homeless hard-to-find automatic fanatical desert psychotic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1679470971.0
        }
      ]
    },
    {
      "id": "jd7q670",
      "author": "PreparationStock3274",
      "body": "I'm so glad you (and others!) feel supported by this. I TOTALLY get the \"I'm not really restricting\" thoughts; they've been one of the hardest barriers in recovery for me. But as we both know, when the consequence is you suffering it is definitely \"restricting enough\". Also again weight loss is not a requirement for being very ill but like SAME I was underweight at 1400-1800...regardless of how someone's body changes at that caloric intake, it can clearly be damaging",
      "created_utc": 1679491035.0,
      "score": 12,
      "context": [
        {
          "id": "jd5capd",
          "author": "fauxfoxem",
          "body": "Thank you for sharing this. I felt, for so long, that I wasn’t really restricting because I was eating 1400-1800 calories a day… despite being underweight, losing my period, having malnutrition, bad labs, and orthostatic hypotension. But because diet culture convinces us that women just don’t need food, I actually thought I was eating “too much” when every other signal in my life suggested otherwise.\n\nThis is also why I take such issue with TDEE calculators and the like. There’s just no way for a programmed formula to accurately determine how much food a person needs to be healthy. Our hunger, activity, health, hormones, and so much else changes all the time. And those calculators don’t take any of that into account and honestly lowball like crazy. I’m in recovery right now eating a ton each day and, despite actively pursuing weight restoration, I’m gaining MAYBE a pound a week. But TDEE calculators would suggest I’m actually eating so high above “maintenance” that I should be weight restored by now… yeah, it doesn’t work like that.\n\nReally grateful for this post.",
          "created_utc": 1679439840.0
        }
      ]
    },
    {
      "id": "jd7bzl1",
      "author": "Gourdon00",
      "body": "Exactly this. These formulas are so out of place and reality but simultaneously do so much damage. Most of them will write you off as eating way off the upper limit and if you actually consider what you've ate it will be like a normal-ish typical simple meal. For the whole darn day. Not even taken in consideration that most people need much more than a simple meal during their day. Also usually their \"nutritional\" values are also non sensical. Like someone eats 2 eggs and thats your vitamins for the day. ***Nani???***\n\nMy partner is the one that has AN, not myself, but even though I supposedly have an okay relationship with food, everytime I have used one of these even for \"fun\" I get terrified and perplexed. They give a ***so*** wrong and scewed version of eating and \"appropriate calorie intake\" that they become a very quick path to an ED even if someone doesn't have one.\n\n\nNot even mentioning all the suggestions and ads for even more destructive eating habits they're all floaded with.",
      "created_utc": 1679483331.0,
      "score": 7,
      "context": [
        {
          "id": "jd5capd",
          "author": "fauxfoxem",
          "body": "Thank you for sharing this. I felt, for so long, that I wasn’t really restricting because I was eating 1400-1800 calories a day… despite being underweight, losing my period, having malnutrition, bad labs, and orthostatic hypotension. But because diet culture convinces us that women just don’t need food, I actually thought I was eating “too much” when every other signal in my life suggested otherwise.\n\nThis is also why I take such issue with TDEE calculators and the like. There’s just no way for a programmed formula to accurately determine how much food a person needs to be healthy. Our hunger, activity, health, hormones, and so much else changes all the time. And those calculators don’t take any of that into account and honestly lowball like crazy. I’m in recovery right now eating a ton each day and, despite actively pursuing weight restoration, I’m gaining MAYBE a pound a week. But TDEE calculators would suggest I’m actually eating so high above “maintenance” that I should be weight restored by now… yeah, it doesn’t work like that.\n\nReally grateful for this post.",
          "created_utc": 1679439840.0
        }
      ]
    },
    {
      "id": "jd73wyf",
      "author": "None",
      "body": "Lmaoo",
      "created_utc": 1679477077.0,
      "score": 8,
      "context": [
        {
          "id": "jd5rcai",
          "author": "FartsMcGhee1",
          "body": "For the longest time I thought \"high res\" meant \"high residue\" like... food that made you poop more and \"low res\" meant \"low residue\" which was food that made you poop less. 🤷‍♀️",
          "created_utc": 1679446289.0
        }
      ]
    },
    {
      "id": "kymb7ef",
      "author": "Maleficent-Set-6179",
      "body": "What is AN?",
      "created_utc": 1712584879.0,
      "score": 1,
      "context": [
        {
          "id": "jd75imz",
          "author": "not-a-tthrowaway",
          "body": "I saw a study that said the average number of calories eaten in AN per day is 1300. I found that oddly reassuring.",
          "created_utc": 1679478415.0
        }
      ]
    },
    {
      "id": "jd7pxdi",
      "author": "None",
      "body": "Same here!!!",
      "created_utc": 1679490922.0,
      "score": 2,
      "context": [
        {
          "id": "jd6qy1m",
          "author": "the_acid_lava_lamp",
          "body": "Really? That honestly makes me feel so much better. I always felt like a fraud because I usually ate between 1600-2000 which people said was normal, except I’m a growing 16 year old and I was heavily overexercising. And I became underweight on that intake so I know it wasn’t adequate. Thank you for this post 🙏",
          "created_utc": 1679465999.0
        }
      ]
    },
    {
      "id": "jd7qtid",
      "author": "PreparationStock3274",
      "body": "!!! I have felt the exact same way. Especially seeing studies trying to avoid refeeding syndrome that start AN patients on 1400-1600 cal/day like....I got underweight on that lmfao, that's what I was eating before I started treatment",
      "created_utc": 1679491331.0,
      "score": 13,
      "context": [
        {
          "id": "jd6uxf7",
          "author": "Glittering_goat25",
          "body": "I LOVE this post! I became medically unstable at 1500 cals a day!! 😬 Thank you for posting this. I really thought I am not worth medical care because I am still eating “enough”",
          "created_utc": 1679469279.0
        }
      ]
    },
    {
      "id": "jd56f85",
      "author": "ventulicola",
      "body": "that sub is disordered as fuck 😭 in a lot of cases at least so clearly eating at 1200 for a while can lead people into a scarcity mindset / trying to cope with feeling like they have to restrict to that level to lose weight and then we get that mess of a sub",
      "created_utc": 1679437411.0,
      "score": 45,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        }
      ]
    },
    {
      "id": "jd77ang",
      "author": "None",
      "body": "Omg for some reason Reddit thought that, because I spend a lot of time on this sub, I’d be interested in getting notifs from the 1200 is plenty sub… like… read the room, Reddit",
      "created_utc": 1679479866.0,
      "score": 16,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        }
      ]
    },
    {
      "id": "jd85wp6",
      "author": "Savesomeposts",
      "body": "Hahaha I have a screenshot from that sub on my phone bc someone posted a picture of eating raw baby carrots dipped in Taco Bell salsa and I was like … bruh.",
      "created_utc": 1679497608.0,
      "score": 8,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        }
      ]
    },
    {
      "id": "jda73bx",
      "author": "Autismsaurus",
      "body": "This is enlightening and useful information to have, I didn’t know how significantly low 1200 calories a day actually was.  During my last bout of active restriction about nine months ago, I “allowed” myself to eat 1200 calories a day and thought it wasn’t so bad because the previous bout of restriction prior to that, I limited myself to 750 calories a day.  Three protein shakes per day, one for each meal.",
      "created_utc": 1679525781.0,
      "score": 6,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        }
      ]
    },
    {
      "id": "jd9sqeq",
      "author": "myceliumfriend",
      "body": "I'm pretty sure it's because the most common starvation app, MyFitnessPal, sets it as the low limit. It says that anything lower is dangerous, which most people disregard, but what they don't disregard is the myth that you can literally gain weight while eating lower than that because of 'starvation mode'. (Metabolic adaptation does exist and it's dangerous but it does not result in packing on the pounds because you starved yourself eating 1100 calories instead of 1400) So basically, for many people with eating disorders it started off as the most effective way to lose weight in their minds.",
      "created_utc": 1679519874.0,
      "score": 7,
      "context": [
        {
          "id": "jd5nygd",
          "author": "sirsmeebles",
          "body": "Absolutely agree with all of what you said! I’ve only been perusing this sub for a short time, and when I came across people posting about “high res”/“low res” I was like what is this fresh hell? Compounded even more when I saw that this supposed “high res” was around 1200 calories (side note; what’s the acute obsession with 1200 calories? It’s always bobbing up in multiple subreddits and life in general by supposedly “normal” folks.. and I’m pretty certain from my own 20+ years experience that’s long winded STARVATION people!). Genuinely concerned what “low res” is. Restriction is restriction, end of story. And you’re going to pay the price for it. \n\nAnd I agree the hyper focus on tdee calculations needs to bugger off. They are so inaccurate it’s plain silly. Use yourself as your own guide. Like others have commented here, I recently had a slap of reality with my own situation in that I had slipped to a dangerously low weight without even realising (I wasn’t weighing myself at the time) because despite feeling completely crap, faint, fatigue, bonier etc etc I was convinced I was “fine” and just being a wet nelly simply because I was consuming what was considered WAY above the average “non disordered” 5’3 female *should* be eating, if you go by online calculations or even just read grown women bemoaning that they can “only” eat x amount of calories or they will instantly become huge. By that token I should have been *gaining* weight, not getting down to stupidly low bmi. I thought I was going a little insane tbh. \n\nProof is in the pudding though..like I said restriction is restriction and your body is 100% going to let you know about it. \n\nGreat post, really glad I’m not the only one who thought this way! I hope it’s made others feel less invalidated by the “high res” narrative.",
          "created_utc": 1679444803.0
        }
      ]
    },
    {
      "id": "jd7qe9e",
      "author": "PreparationStock3274",
      "body": "I also want to know where the obsession w/1200 came from??? So arbitrary",
      "created_utc": 1679491137.0,
      "score": 2,
      "context": [
        {
          "id": "jd5nygd",
          "author": "sirsmeebles",
          "body": "Absolutely agree with all of what you said! I’ve only been perusing this sub for a short time, and when I came across people posting about “high res”/“low res” I was like what is this fresh hell? Compounded even more when I saw that this supposed “high res” was around 1200 calories (side note; what’s the acute obsession with 1200 calories? It’s always bobbing up in multiple subreddits and life in general by supposedly “normal” folks.. and I’m pretty certain from my own 20+ years experience that’s long winded STARVATION people!). Genuinely concerned what “low res” is. Restriction is restriction, end of story. And you’re going to pay the price for it. \n\nAnd I agree the hyper focus on tdee calculations needs to bugger off. They are so inaccurate it’s plain silly. Use yourself as your own guide. Like others have commented here, I recently had a slap of reality with my own situation in that I had slipped to a dangerously low weight without even realising (I wasn’t weighing myself at the time) because despite feeling completely crap, faint, fatigue, bonier etc etc I was convinced I was “fine” and just being a wet nelly simply because I was consuming what was considered WAY above the average “non disordered” 5’3 female *should* be eating, if you go by online calculations or even just read grown women bemoaning that they can “only” eat x amount of calories or they will instantly become huge. By that token I should have been *gaining* weight, not getting down to stupidly low bmi. I thought I was going a little insane tbh. \n\nProof is in the pudding though..like I said restriction is restriction and your body is 100% going to let you know about it. \n\nGreat post, really glad I’m not the only one who thought this way! I hope it’s made others feel less invalidated by the “high res” narrative.",
          "created_utc": 1679444803.0
        }
      ]
    },
    {
      "id": "jdeyl1z",
      "author": "alexisseffy",
      "body": "Ya honestly it feels kinda nuts like I am a short sedentary female and can maintain a low normal weight on 2000 cal even though calculators say my maintenence is around 1700",
      "created_utc": 1679610130.0,
      "score": 7,
      "context": [
        {
          "id": "jd7prvl",
          "author": "None",
          "body": "Yes, I can relate to this all so much. I became severely underweight while eating 1600 to 2500 calories a day, with moderate exercise. I find that now I'm not exercising, I can maintain on 2000 calories, and a lot of people are telling me it's impossible, but I'm not overestimating because my doctors are literally in charge of my food and calorie intake right now.",
          "created_utc": 1679490853.0
        }
      ]
    },
    {
      "id": "jdeqsme",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1679607016.0,
      "score": 3,
      "context": [
        {
          "id": "jdeibvr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1679603787.0
        }
      ]
    },
    {
      "id": "kyy8kap",
      "author": "Vivid_Praline_2267",
      "body": "Anorexia nervosa, in spaces like these you’ll see that abbreviation a lot as well as AN-R which means the restriction subtype of anorexia and AN-B/P which means the binge/purge subtype of anorexia",
      "created_utc": 1712770495.0,
      "score": 3,
      "context": [
        {
          "id": "jd75imz",
          "author": "not-a-tthrowaway",
          "body": "I saw a study that said the average number of calories eaten in AN per day is 1300. I found that oddly reassuring.",
          "created_utc": 1679478415.0
        },
        {
          "id": "kymb7ef",
          "author": "Maleficent-Set-6179",
          "body": "What is AN?",
          "created_utc": 1712584879.0
        }
      ]
    },
    {
      "id": "jd5717l",
      "author": "Longjumping-Size-762",
      "body": "Normies in real life routinely tell me why it’s ok to skip breakfast because they don’t feel hungry or entire meals, or use “intermittent fasting” as a restriction tool, and I tell them yeah you still have to eat ALL YOUR CALORIES in that window. It’s so fucking upsetting hearing people be so cavalier with food.",
      "created_utc": 1679437666.0,
      "score": 38,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        },
        {
          "id": "jd56f85",
          "author": "ventulicola",
          "body": "that sub is disordered as fuck 😭 in a lot of cases at least so clearly eating at 1200 for a while can lead people into a scarcity mindset / trying to cope with feeling like they have to restrict to that level to lose weight and then we get that mess of a sub",
          "created_utc": 1679437411.0
        }
      ]
    },
    {
      "id": "jd8grqu",
      "author": "callmedylanelliot",
      "body": "CW: numbers; mentions of pro-ana cringe\n.\n.\n\n\n.\n\n.\n\n.\n\n\nI'm pretty sure in like 2000s/1990s it was recommended as a low but \"healthy\" calorie number for women to aim for when dieting. Like, the lowest number you can recommend to an already thin person without coming across like a sociopath encouraging EDs. (Thinking back to how sick I felt when eating around this amount as a little 5'2 teenager I doubt it's enough energy for anyone who's not like...bedbound and in a coma).\n\nSo disordered girlies took the 1200 number and went with it because that way they could tell themselves and orhers what they were doing wasn't disordered at all. Remember \"hEalThy Skinny Girl Diet\"? (Gods, I wish I could forget) So cool, so healthy, so proana, so 1200 cal. 1200 is still the lowest number many calorie counting apps, like MFP, allow you to set as a goal. That way they can cater do disordered folks and still pretend they care about peoples health.",
      "created_utc": 1679501739.0,
      "score": 13,
      "context": [
        {
          "id": "jd5nygd",
          "author": "sirsmeebles",
          "body": "Absolutely agree with all of what you said! I’ve only been perusing this sub for a short time, and when I came across people posting about “high res”/“low res” I was like what is this fresh hell? Compounded even more when I saw that this supposed “high res” was around 1200 calories (side note; what’s the acute obsession with 1200 calories? It’s always bobbing up in multiple subreddits and life in general by supposedly “normal” folks.. and I’m pretty certain from my own 20+ years experience that’s long winded STARVATION people!). Genuinely concerned what “low res” is. Restriction is restriction, end of story. And you’re going to pay the price for it. \n\nAnd I agree the hyper focus on tdee calculations needs to bugger off. They are so inaccurate it’s plain silly. Use yourself as your own guide. Like others have commented here, I recently had a slap of reality with my own situation in that I had slipped to a dangerously low weight without even realising (I wasn’t weighing myself at the time) because despite feeling completely crap, faint, fatigue, bonier etc etc I was convinced I was “fine” and just being a wet nelly simply because I was consuming what was considered WAY above the average “non disordered” 5’3 female *should* be eating, if you go by online calculations or even just read grown women bemoaning that they can “only” eat x amount of calories or they will instantly become huge. By that token I should have been *gaining* weight, not getting down to stupidly low bmi. I thought I was going a little insane tbh. \n\nProof is in the pudding though..like I said restriction is restriction and your body is 100% going to let you know about it. \n\nGreat post, really glad I’m not the only one who thought this way! I hope it’s made others feel less invalidated by the “high res” narrative.",
          "created_utc": 1679444803.0
        },
        {
          "id": "jd7qe9e",
          "author": "PreparationStock3274",
          "body": "I also want to know where the obsession w/1200 came from??? So arbitrary",
          "created_utc": 1679491137.0
        }
      ]
    },
    {
      "id": "kyyd5bz",
      "author": "Maleficent-Set-6179",
      "body": "What if someone is both ?",
      "created_utc": 1712772044.0,
      "score": 1,
      "context": [
        {
          "id": "jd75imz",
          "author": "not-a-tthrowaway",
          "body": "I saw a study that said the average number of calories eaten in AN per day is 1300. I found that oddly reassuring.",
          "created_utc": 1679478415.0
        },
        {
          "id": "kymb7ef",
          "author": "Maleficent-Set-6179",
          "body": "What is AN?",
          "created_utc": 1712584879.0
        },
        {
          "id": "kyy8kap",
          "author": "Vivid_Praline_2267",
          "body": "Anorexia nervosa, in spaces like these you’ll see that abbreviation a lot as well as AN-R which means the restriction subtype of anorexia and AN-B/P which means the binge/purge subtype of anorexia",
          "created_utc": 1712770495.0
        }
      ]
    },
    {
      "id": "jd59ca8",
      "author": "ventulicola",
      "body": "!!! esp hearing people i care about talk about stuff like that",
      "created_utc": 1679438634.0,
      "score": 17,
      "context": [
        {
          "id": "jd53987",
          "author": "Longjumping-Size-762",
          "body": "I *was* the one apple and a coffee girl 😭 kind of unbelievable. but thank you for this post I needed this, 1200 is dangerously low!! It’s a terrible amount. There’s a sub on Reddit called 1200 is plenty like wtf.",
          "created_utc": 1679436118.0
        },
        {
          "id": "jd56f85",
          "author": "ventulicola",
          "body": "that sub is disordered as fuck 😭 in a lot of cases at least so clearly eating at 1200 for a while can lead people into a scarcity mindset / trying to cope with feeling like they have to restrict to that level to lose weight and then we get that mess of a sub",
          "created_utc": 1679437411.0
        },
        {
          "id": "jd5717l",
          "author": "Longjumping-Size-762",
          "body": "Normies in real life routinely tell me why it’s ok to skip breakfast because they don’t feel hungry or entire meals, or use “intermittent fasting” as a restriction tool, and I tell them yeah you still have to eat ALL YOUR CALORIES in that window. It’s so fucking upsetting hearing people be so cavalier with food.",
          "created_utc": 1679437666.0
        }
      ]
    }
  ]
}