{
  "id": "138fxv2",
  "subreddit": "fuckeatingdisorders",
  "author": "VerminDevourer",
  "created_utc": 1683277617.0,
  "title": "Thank you Ed communities for the recent \"ANA to BED\" posts",
  "selftext": "I really should uninstall reddit because just as I started to feed myself more (which is a lot of food to my ED brain) I came across multiple threads and discussions about how common is BED, how most people overconsume and sit on their asses all day(this was in a 'recovery sub' not a gymbro sub!), how binges don't need to be emotional/dissociating and how restrictive EDs can turn into BED and it's not necessarily EH. Now I'm feeling called out and am questioning my existence again. Thanks a lot I guess UGH",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/138fxv2/thank_you_ed_communities_for_the_recent_ana_to/",
  "score": 92,
  "num_comments": 29,
  "comments": [
    {
      "id": "jixw5pu",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1683277617.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jj09d6m",
      "author": "uxhelpneeded",
      "body": "A common feature of anorexia is convincing yourself that you have BED, that you are 'out of control' around food, and that starvation is a better option.\n\nYou don't have BED. You're in recovery. I hope you've sought help",
      "created_utc": 1683317961.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jixx0bs",
      "author": "chaesikdoujiao",
      "body": "I'm not sure why so many people are posting that lately! Especially because bed and AN have completely different neuron firings. It's not common at all for that switch in brain chemistry to occur. Bodies will have reactive eating and it's not bed..",
      "created_utc": 1683278382.0,
      "score": 67,
      "context": []
    },
    {
      "id": "jiygtgz",
      "author": "scrambled-satellite",
      "body": "It’s interesting, because statistically those with AN are more likely to “switch” to bulimia than BED…",
      "created_utc": 1683291314.0,
      "score": 30,
      "context": []
    },
    {
      "id": "jiy2xmg",
      "author": "Danif22p_",
      "body": "This, in my opinion, is why so many people can't fully recover. The fear of developing BED makes us all want to go back to our restrictive EDs, which will eventually result in reactive eating because of the constant undereating. We need to be kinder to ourselves and get rid of those negative emotions when we start to eat more again. Also, BED is an eating disorder as valid as AN and I don't get why it is so feared in the ed community when AN has been proven to be deadlier than BED, even if the restriction turned into BED there's nothing wrong with that, you're still worthy of respect and you deserve to get the help you need, but again, this isn't the case for most people. People lurking in ed subs are still fairly disordered and if the sub is left unmodded or modded by the wrong person they can end up allowing pro-ana content, so yeah, be careful with them because the \"pro-recovery\" thing is so vaguely used nowadays.",
      "created_utc": 1683283205.0,
      "score": 46,
      "context": []
    },
    {
      "id": "jiyigdd",
      "author": "honeynutlatte13",
      "body": "this is a complicated topic and what happens is based on the specific person, so of course nothing i say applies to every individual. i think people are correct in that restrict/binge cycles are very common but that's different from going from AN to BED. EVERY time i was bingeing in my ED and feeling out of control it was because i had heavily restricted before. and i think in recovery there can be a messy middle ground where you're getting out of a scarcity mindset, getting out of malnutrition, figuring out hunger cues, and it can look like BED because your body and mind are going haywire lol.\n\ni think if people come from a history of restrictive eating it is rare to develop BED in place of it, and more common that people get freaked out by EH and the messy middle ground. EH lasted for 4-5 months for me but can go on for more than a year for some people, which is a really long time to persevere! but while we shouldn't erase the experiences of the people who later developed BED after AN, i don't think it's fair or accurate to suggest that it's \"common\" to develop BED if you try to recover from a restrictive ED. the last thing we need here is to make people more scared to recover and frankly to weaponize the experience of BED sufferers to keep people sick, instead of lifting up and supporting them too",
      "created_utc": 1683292110.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jiyls5x",
      "author": "DecentEconomics5033",
      "body": "Honestly ignore this stuff. Deeper in my ED I was thinking the same way that people just “sit on their asses all day and overeat” which is probably something we think of because our eating disorder wants to hold on to us so that we “don’t become those people.” Our ED will come up with anything so that we don’t recover. \n\nI guess just remember that people in ED subs are still having disordered thoughts and projecting them online. A lot of binge eaters are probably restricting anyway. At the beginning of recovery I was eating a real lot, and now that I’ve been eating consistently I’m not thinking about food all day. I’m so sick of seeing this stuff everywhere too though, and it seems like the gym bro stuff and keto crap is everything lately. I’m just trying to stay focused on myself.",
      "created_utc": 1683293656.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jiyf4u1",
      "author": "None",
      "body": "In my opinion, my eating disorder evolving into BED was the only reason I got help, accepted it and took recovery seriously. I no longer had that hope of reaching my goal weight (I never would have anyway cos the goal posts kept changing), but my existence still revolved around food, restriction, obsession but with constant failure. I couldn't physically purge anymore, I couldn't sustain restricting without my brain turning to lizard mode and binging. It was absolute rock bottom and really dark.\n\nBut because of that I am now able to eat normally and my existence doesn't revolve around food. I made it out. I hope you can too.",
      "created_utc": 1683290480.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jj038ib",
      "author": "GetYourFixGraham",
      "body": "Someone going from BED to AN (or vice versa) is incredibly rare. In one of my prior posts, I mentioned that finding someone who has had BED and AN would be a unicorn... Because it's really uncommon. Most people with AN recover to be \"happy eaters\" or even struggle somewhat with undereating... Not even remotely BED.\n\nIt's much more common to find someone who goes from AN to maybe a \"milder\" version of AN who is still restricting and does binge occasionally. But that isn't BED - BED means no restriction and binging as well, usually to cope with stress.\n\nAlso, EH isn't binging. BED doesn't wait in the wings for someone to overeat once... And its intensity starts off much lower than EH does. My first binge for BED happened once and I didn't binge for months after that. This is subclinical BED. Some people do get to a higher intensity BED, but it's usually after the mental illness has progressed for years - and then it becomes clinically diagnosable.\n\nFrom my limited understanding, a lot of people with AN really /really/ struggle with the idea of gaining weight, especially early days... And this misinformed posts about AN going to BED are just cruel to those trying to recover. It's also cruel for those with BED... Imagine your mental illness being used as a boogeyman because of a fear of weight gain. It's an ouch for everyone.",
      "created_utc": 1683315402.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jiz6c7p",
      "author": "messythelioma",
      "body": "I hate seeing those posts. It's ODD. I don't trust them because they say they have \"BED\" now but it's them just eating in recovery because they've been restricting, so it isn't actually \"BED.\" Still, they're using it and spreading it around which puts fears into people from entering recovery because now they're scared that they'll develop \"BED\" too.",
      "created_utc": 1683302057.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jizxyzn",
      "author": "namey_9",
      "body": "Please give yourself some time. One thing I notice about my ED brain is that it's extremely impatient and judgmental, constantly slapping labels on things in an effort to control them. You won't know whether you have EH or BED until enough time passes - and whichever it is, you can deal with it. I find that the more slowly and gently I deal with my body, the longer whatever healing I'm trying to achieve lasts. So it can help not to jump to conclusions right away and just give myself some time to breathe and see what happens.",
      "created_utc": 1683313222.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jiz4bmd",
      "author": "Expensive-Relation-4",
      "body": "ignore it. the people making those posts are people deep in their eds and want to shame others for recovering.",
      "created_utc": 1683301257.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jj2f0dr",
      "author": "Valuable_You_5144",
      "body": "Imo the main difference between reactive/extreme hunger and a binge eating disorder is whether or not it becomes a chronic cycle. It is my belief that after any period of deprivation it is completely appropriate and necessary to make up for the deprivation with a vast consumption of whatever it is that has been lacking (for example we would not think twice about chugging water when dehydrated or having a long sleep when exhausted). Therefore if you are starving you need to eat. A LOT. I know it’s so scary especially when we can’t specifically know how much for how long, but this is where we have to give some trust to our bodies and not try to resist these cues that are there to save us. The “BED” in my mind is more the result of a persistent resistance and then the inevitable reactive hunger that becomes a perpetual cycle over a period of time. I think the only way to avoid this cycle is to from the beginning allowing the body to heal and eventually the extreme hunger will subside and normal eating will resume. Otherwise, yes I do think it can become a never ending cycle of restriction and binging which is more or less what BED is (contrary to the misconception that it is simply just some form of out of control gluttony). Bottom line is our bodies are so incredibly smart and if we allow ourselves to trust them rather than attempt to override their instincts, they most always will get us to where we need to be:)",
      "created_utc": 1683361621.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jizomz9",
      "author": "Sophie_rose95",
      "body": "The fact you’re feeling worried about it turning to BED shows it’s not bed at all, you just have reactive/extreme hunger in response to restriction in AN. Keep going, keep eating more and recover from AN. You won’t develop BED",
      "created_utc": 1683309412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jj2s1aq",
      "author": "Myluckyvalentine",
      "body": "I have seen posts like this too and I remember hearing things like this early on in recovery and it really scared me. But the truth is this is actually not as common or likely as you may believe. After a restrictive ed, of course you are going to be consuming lots of food. When I was in early recovery I would probably be considered to be “binging”. But I wasn’t binging, I was giving my body what it needed and I trusted myself even though it was scary. Gradually things balanced out and slowed down, and I no longer “binge”. I would hesitate to even use the word binge when recovering from a restrictive ed, as large amounts of food, preferably high in caloric value, is exactly what is needed",
      "created_utc": 1683372558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jj0f4nm",
      "author": "VerminDevourer",
      "body": "thank you",
      "created_utc": 1683320417.0,
      "score": 3,
      "context": [
        {
          "id": "jj09d6m",
          "author": "uxhelpneeded",
          "body": "A common feature of anorexia is convincing yourself that you have BED, that you are 'out of control' around food, and that starvation is a better option.\n\nYou don't have BED. You're in recovery. I hope you've sought help",
          "created_utc": 1683317961.0
        }
      ]
    },
    {
      "id": "jixycl2",
      "author": "VerminDevourer",
      "body": "It's like a trend, dear lord. Now it's etched in my brain",
      "created_utc": 1683279569.0,
      "score": 21,
      "context": [
        {
          "id": "jixx0bs",
          "author": "chaesikdoujiao",
          "body": "I'm not sure why so many people are posting that lately! Especially because bed and AN have completely different neuron firings. It's not common at all for that switch in brain chemistry to occur. Bodies will have reactive eating and it's not bed..",
          "created_utc": 1683278382.0
        }
      ]
    },
    {
      "id": "jixymu9",
      "author": "None",
      "body": " yeah, a lot of the an-bed stuff is bunk, but idk. I have gone from binge eating, to restrictive episodes with some binging to restrictive episodes plus C/s and purging and no binging.",
      "created_utc": 1683279816.0,
      "score": 9,
      "context": [
        {
          "id": "jixx0bs",
          "author": "chaesikdoujiao",
          "body": "I'm not sure why so many people are posting that lately! Especially because bed and AN have completely different neuron firings. It's not common at all for that switch in brain chemistry to occur. Bodies will have reactive eating and it's not bed..",
          "created_utc": 1683278382.0
        }
      ]
    },
    {
      "id": "jiyzb75",
      "author": "BeastieBeck",
      "body": "Sometimes I think people mix bulimia and BED because the binges are (at least partly) compensated via exercise and/or restrictive eating and not purging. Yes? No?",
      "created_utc": 1683299270.0,
      "score": 12,
      "context": [
        {
          "id": "jiygtgz",
          "author": "scrambled-satellite",
          "body": "It’s interesting, because statistically those with AN are more likely to “switch” to bulimia than BED…",
          "created_utc": 1683291314.0
        }
      ]
    },
    {
      "id": "jiy7wva",
      "author": "VerminDevourer",
      "body": "Yeah I totally agree with you. It's sad to see so many people claiming that they developed BED in anorexia recovery and there's no way to actually know what's going on as a bystander. \n\nIt feels like the community is so divided on the topic, some say that An/Bn to BED is super duper common and the others suggest that it's near impossible.\n\nEdit: I meant the Ed community on reddit, not the scientific research community",
      "created_utc": 1683286490.0,
      "score": 5,
      "context": [
        {
          "id": "jiy2xmg",
          "author": "Danif22p_",
          "body": "This, in my opinion, is why so many people can't fully recover. The fear of developing BED makes us all want to go back to our restrictive EDs, which will eventually result in reactive eating because of the constant undereating. We need to be kinder to ourselves and get rid of those negative emotions when we start to eat more again. Also, BED is an eating disorder as valid as AN and I don't get why it is so feared in the ed community when AN has been proven to be deadlier than BED, even if the restriction turned into BED there's nothing wrong with that, you're still worthy of respect and you deserve to get the help you need, but again, this isn't the case for most people. People lurking in ed subs are still fairly disordered and if the sub is left unmodded or modded by the wrong person they can end up allowing pro-ana content, so yeah, be careful with them because the \"pro-recovery\" thing is so vaguely used nowadays.",
          "created_utc": 1683283205.0
        }
      ]
    },
    {
      "id": "jiyz1dk",
      "author": "BeastieBeck",
      "body": ">and I don't get why it is so feared in the ed community when AN has been proven to be deadlier than BED\n\nOk....",
      "created_utc": 1683299162.0,
      "score": 3,
      "context": [
        {
          "id": "jiy2xmg",
          "author": "Danif22p_",
          "body": "This, in my opinion, is why so many people can't fully recover. The fear of developing BED makes us all want to go back to our restrictive EDs, which will eventually result in reactive eating because of the constant undereating. We need to be kinder to ourselves and get rid of those negative emotions when we start to eat more again. Also, BED is an eating disorder as valid as AN and I don't get why it is so feared in the ed community when AN has been proven to be deadlier than BED, even if the restriction turned into BED there's nothing wrong with that, you're still worthy of respect and you deserve to get the help you need, but again, this isn't the case for most people. People lurking in ed subs are still fairly disordered and if the sub is left unmodded or modded by the wrong person they can end up allowing pro-ana content, so yeah, be careful with them because the \"pro-recovery\" thing is so vaguely used nowadays.",
          "created_utc": 1683283205.0
        }
      ]
    },
    {
      "id": "jj06b3h",
      "author": "VerminDevourer",
      "body": "I wholeheartedly agree. It kind of angers me that these posts are from a sub that nickpicks even the smallest 'disordered' things in recovering folks' lives but meanwhile this kind of harmful posts won't get called out.",
      "created_utc": 1683316673.0,
      "score": 6,
      "context": [
        {
          "id": "jj038ib",
          "author": "GetYourFixGraham",
          "body": "Someone going from BED to AN (or vice versa) is incredibly rare. In one of my prior posts, I mentioned that finding someone who has had BED and AN would be a unicorn... Because it's really uncommon. Most people with AN recover to be \"happy eaters\" or even struggle somewhat with undereating... Not even remotely BED.\n\nIt's much more common to find someone who goes from AN to maybe a \"milder\" version of AN who is still restricting and does binge occasionally. But that isn't BED - BED means no restriction and binging as well, usually to cope with stress.\n\nAlso, EH isn't binging. BED doesn't wait in the wings for someone to overeat once... And its intensity starts off much lower than EH does. My first binge for BED happened once and I didn't binge for months after that. This is subclinical BED. Some people do get to a higher intensity BED, but it's usually after the mental illness has progressed for years - and then it becomes clinically diagnosable.\n\nFrom my limited understanding, a lot of people with AN really /really/ struggle with the idea of gaining weight, especially early days... And this misinformed posts about AN going to BED are just cruel to those trying to recover. It's also cruel for those with BED... Imagine your mental illness being used as a boogeyman because of a fear of weight gain. It's an ouch for everyone.",
          "created_utc": 1683315402.0
        }
      ]
    },
    {
      "id": "jj1dniy",
      "author": "no_uapples",
      "body": "I mean, I did go from BED to AN because I initially used binging to cope with loneliness and then replaced that with heavy restriction so it COULD happen but nothing really to worry about for most people tbh",
      "created_utc": 1683337064.0,
      "score": 1,
      "context": [
        {
          "id": "jj038ib",
          "author": "GetYourFixGraham",
          "body": "Someone going from BED to AN (or vice versa) is incredibly rare. In one of my prior posts, I mentioned that finding someone who has had BED and AN would be a unicorn... Because it's really uncommon. Most people with AN recover to be \"happy eaters\" or even struggle somewhat with undereating... Not even remotely BED.\n\nIt's much more common to find someone who goes from AN to maybe a \"milder\" version of AN who is still restricting and does binge occasionally. But that isn't BED - BED means no restriction and binging as well, usually to cope with stress.\n\nAlso, EH isn't binging. BED doesn't wait in the wings for someone to overeat once... And its intensity starts off much lower than EH does. My first binge for BED happened once and I didn't binge for months after that. This is subclinical BED. Some people do get to a higher intensity BED, but it's usually after the mental illness has progressed for years - and then it becomes clinically diagnosable.\n\nFrom my limited understanding, a lot of people with AN really /really/ struggle with the idea of gaining weight, especially early days... And this misinformed posts about AN going to BED are just cruel to those trying to recover. It's also cruel for those with BED... Imagine your mental illness being used as a boogeyman because of a fear of weight gain. It's an ouch for everyone.",
          "created_utc": 1683315402.0
        }
      ]
    },
    {
      "id": "jiz72vd",
      "author": "messythelioma",
      "body": "You nailed it with \"trend.\" People use the term \"BED\" rather lightly and loosely. I think it also detracts from actual people who do have BED when people who restrict encounter reactive eating and then label that as \"BED.\" \n\nBED is a mental disorder just like every other ED, you don't just \"develop\" it by eating more than usual, especially if it's recovery eating from a restrictive ED.",
      "created_utc": 1683302352.0,
      "score": 22,
      "context": [
        {
          "id": "jixx0bs",
          "author": "chaesikdoujiao",
          "body": "I'm not sure why so many people are posting that lately! Especially because bed and AN have completely different neuron firings. It's not common at all for that switch in brain chemistry to occur. Bodies will have reactive eating and it's not bed..",
          "created_utc": 1683278382.0
        },
        {
          "id": "jixycl2",
          "author": "VerminDevourer",
          "body": "It's like a trend, dear lord. Now it's etched in my brain",
          "created_utc": 1683279569.0
        }
      ]
    },
    {
      "id": "jizqnrj",
      "author": "selkieflying",
      "body": "Yes",
      "created_utc": 1683310242.0,
      "score": 4,
      "context": [
        {
          "id": "jiygtgz",
          "author": "scrambled-satellite",
          "body": "It’s interesting, because statistically those with AN are more likely to “switch” to bulimia than BED…",
          "created_utc": 1683291314.0
        },
        {
          "id": "jiyzb75",
          "author": "BeastieBeck",
          "body": "Sometimes I think people mix bulimia and BED because the binges are (at least partly) compensated via exercise and/or restrictive eating and not purging. Yes? No?",
          "created_utc": 1683299270.0
        }
      ]
    },
    {
      "id": "jiyaun3",
      "author": "Sareeee48",
      "body": "I mean statistically it is far more likely to transition to bulimia from a restrictive ED. There is very little research to suggest AN to BED is very common.",
      "created_utc": 1683288177.0,
      "score": 13,
      "context": [
        {
          "id": "jiy2xmg",
          "author": "Danif22p_",
          "body": "This, in my opinion, is why so many people can't fully recover. The fear of developing BED makes us all want to go back to our restrictive EDs, which will eventually result in reactive eating because of the constant undereating. We need to be kinder to ourselves and get rid of those negative emotions when we start to eat more again. Also, BED is an eating disorder as valid as AN and I don't get why it is so feared in the ed community when AN has been proven to be deadlier than BED, even if the restriction turned into BED there's nothing wrong with that, you're still worthy of respect and you deserve to get the help you need, but again, this isn't the case for most people. People lurking in ed subs are still fairly disordered and if the sub is left unmodded or modded by the wrong person they can end up allowing pro-ana content, so yeah, be careful with them because the \"pro-recovery\" thing is so vaguely used nowadays.",
          "created_utc": 1683283205.0
        },
        {
          "id": "jiy7wva",
          "author": "VerminDevourer",
          "body": "Yeah I totally agree with you. It's sad to see so many people claiming that they developed BED in anorexia recovery and there's no way to actually know what's going on as a bystander. \n\nIt feels like the community is so divided on the topic, some say that An/Bn to BED is super duper common and the others suggest that it's near impossible.\n\nEdit: I meant the Ed community on reddit, not the scientific research community",
          "created_utc": 1683286490.0
        }
      ]
    },
    {
      "id": "jj1k3bh",
      "author": "GetYourFixGraham",
      "body": "It seems you’ve swapped from BED to AN a few times, the BED initially occurring after attempting to lose weight when you were 8(ish)?\n\nI’m glad you’re doing better now (somewhat? I didn’t read all the things lol). It’s cool to meet a unicorn. ^^\n\nYou’re also welcome to look at my post history and see my utter denial of having bulimia after treatment for BED… The signs were there lol",
      "created_utc": 1683340324.0,
      "score": 3,
      "context": [
        {
          "id": "jj038ib",
          "author": "GetYourFixGraham",
          "body": "Someone going from BED to AN (or vice versa) is incredibly rare. In one of my prior posts, I mentioned that finding someone who has had BED and AN would be a unicorn... Because it's really uncommon. Most people with AN recover to be \"happy eaters\" or even struggle somewhat with undereating... Not even remotely BED.\n\nIt's much more common to find someone who goes from AN to maybe a \"milder\" version of AN who is still restricting and does binge occasionally. But that isn't BED - BED means no restriction and binging as well, usually to cope with stress.\n\nAlso, EH isn't binging. BED doesn't wait in the wings for someone to overeat once... And its intensity starts off much lower than EH does. My first binge for BED happened once and I didn't binge for months after that. This is subclinical BED. Some people do get to a higher intensity BED, but it's usually after the mental illness has progressed for years - and then it becomes clinically diagnosable.\n\nFrom my limited understanding, a lot of people with AN really /really/ struggle with the idea of gaining weight, especially early days... And this misinformed posts about AN going to BED are just cruel to those trying to recover. It's also cruel for those with BED... Imagine your mental illness being used as a boogeyman because of a fear of weight gain. It's an ouch for everyone.",
          "created_utc": 1683315402.0
        },
        {
          "id": "jj1dniy",
          "author": "no_uapples",
          "body": "I mean, I did go from BED to AN because I initially used binging to cope with loneliness and then replaced that with heavy restriction so it COULD happen but nothing really to worry about for most people tbh",
          "created_utc": 1683337064.0
        }
      ]
    },
    {
      "id": "jj03msj",
      "author": "GetYourFixGraham",
      "body": "Exactly this. The terms \"binging\" and \"BED\" have really been used as a boogeyman in recovery spaces, and it's damaging for everyone.\n\n\"Overeating\" isn't binging. Eating more while recovering from a restrictive ED is not BED. >\\_>",
      "created_utc": 1683315568.0,
      "score": 4,
      "context": [
        {
          "id": "jixx0bs",
          "author": "chaesikdoujiao",
          "body": "I'm not sure why so many people are posting that lately! Especially because bed and AN have completely different neuron firings. It's not common at all for that switch in brain chemistry to occur. Bodies will have reactive eating and it's not bed..",
          "created_utc": 1683278382.0
        },
        {
          "id": "jixycl2",
          "author": "VerminDevourer",
          "body": "It's like a trend, dear lord. Now it's etched in my brain",
          "created_utc": 1683279569.0
        },
        {
          "id": "jiz72vd",
          "author": "messythelioma",
          "body": "You nailed it with \"trend.\" People use the term \"BED\" rather lightly and loosely. I think it also detracts from actual people who do have BED when people who restrict encounter reactive eating and then label that as \"BED.\" \n\nBED is a mental disorder just like every other ED, you don't just \"develop\" it by eating more than usual, especially if it's recovery eating from a restrictive ED.",
          "created_utc": 1683302352.0
        }
      ]
    },
    {
      "id": "jj1ysv6",
      "author": "no_uapples",
      "body": "Yeah, I was pretty messed up back then fr 😩😩 and yeah I'll check when I have time",
      "created_utc": 1683348723.0,
      "score": 2,
      "context": [
        {
          "id": "jj038ib",
          "author": "GetYourFixGraham",
          "body": "Someone going from BED to AN (or vice versa) is incredibly rare. In one of my prior posts, I mentioned that finding someone who has had BED and AN would be a unicorn... Because it's really uncommon. Most people with AN recover to be \"happy eaters\" or even struggle somewhat with undereating... Not even remotely BED.\n\nIt's much more common to find someone who goes from AN to maybe a \"milder\" version of AN who is still restricting and does binge occasionally. But that isn't BED - BED means no restriction and binging as well, usually to cope with stress.\n\nAlso, EH isn't binging. BED doesn't wait in the wings for someone to overeat once... And its intensity starts off much lower than EH does. My first binge for BED happened once and I didn't binge for months after that. This is subclinical BED. Some people do get to a higher intensity BED, but it's usually after the mental illness has progressed for years - and then it becomes clinically diagnosable.\n\nFrom my limited understanding, a lot of people with AN really /really/ struggle with the idea of gaining weight, especially early days... And this misinformed posts about AN going to BED are just cruel to those trying to recover. It's also cruel for those with BED... Imagine your mental illness being used as a boogeyman because of a fear of weight gain. It's an ouch for everyone.",
          "created_utc": 1683315402.0
        },
        {
          "id": "jj1dniy",
          "author": "no_uapples",
          "body": "I mean, I did go from BED to AN because I initially used binging to cope with loneliness and then replaced that with heavy restriction so it COULD happen but nothing really to worry about for most people tbh",
          "created_utc": 1683337064.0
        },
        {
          "id": "jj1k3bh",
          "author": "GetYourFixGraham",
          "body": "It seems you’ve swapped from BED to AN a few times, the BED initially occurring after attempting to lose weight when you were 8(ish)?\n\nI’m glad you’re doing better now (somewhat? I didn’t read all the things lol). It’s cool to meet a unicorn. ^^\n\nYou’re also welcome to look at my post history and see my utter denial of having bulimia after treatment for BED… The signs were there lol",
          "created_utc": 1683340324.0
        }
      ]
    }
  ]
}