{
  "id": "13dk8e8",
  "subreddit": "fuckeatingdisorders",
  "author": "Mysterious_Raindrop",
  "created_utc": 1683706860.0,
  "title": "My dream life does not include weighing out lettuce.",
  "selftext": "I've really struggled the past few months and have started weighing myself and my food again. Yesterday, I asked my best friend if I could give him my scale and invited him to pizza for lunch today. \n\nI am terrified but I am writing this to remind myself that this is the right choice. I am a grown woman. I don't need to starve myself in order to be worthy of love and respect. I want to live a fulfilling life more than I want to be small. I am allowed to take up space. I feel like shit right now because this is new and scary. That's okay and it will fade. \n\n&#x200B;\n\nDealing with anxiety by not eating does not work in the long run. Not eating makes my depression worse. Food is normal and nothing to be afraid of. \n\nWhen I imagine a life worth living, that does not include counting tomatoes or weighing out salad or cancelling plans because of low energy or fear of calories. \n\n&#x200B;\n\nI am safe where I am right now. I can make my own decisions. I will not let this ED continue to rule my life. It has taken enough of me already",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/13dk8e8/my_dream_life_does_not_include_weighing_out/",
  "score": 98,
  "num_comments": 11,
  "comments": [
    {
      "id": "jjkv6y0",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1683706860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjkw118",
      "author": "None",
      "body": "I am proud of you! That's a great step forward. Your self-reassuring words show how much stronger than the illness you have gotten!",
      "created_utc": 1683707621.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jjlzq06",
      "author": "fauxfoxem",
      "body": "This is such a lovely and important reminder, and I'm grappling with the same sentiment right now too! I haven't weighed myself in awhile, but I'd been keeping my scale in the house because it felt safer knowing I could always check back in if I \"needed\" to.\n\nYesterday, my boyfriend and I tossed it. Right now, he's making me breakfast and I'm in the other room with no idea what's going into it, only that it will be delicious and that having a partner who loves me enough to cook for me is meaningful in its own right.\n\nIt's definitely scary, but you're so right - our ideal lives shouldn't be and aren't measured in grams or pounds. I'm super, super happy for you!",
      "created_utc": 1683730770.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jjmk16z",
      "author": "Abrookspug",
      "body": "Ha, I love the title of this post. It’s so simple but true. The idea of weighing lettuce is absurd, yet the ED convince us that it’s normal.  I remember purging after eating a salad so I didn’t gain weight. 🙄 I’ve been recovered for years so I can look back and just roll my eyes at the things I did. You’ve got this!",
      "created_utc": 1683738567.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jjljodp",
      "author": "GetYourFixGraham",
      "body": "Congratulations, OP! I'm glad that you're able to punch down the ED and realize it's not a part of your best future. :D Great job!",
      "created_utc": 1683723751.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jjmlywb",
      "author": "petitelinotte212",
      "body": "You got this! If it helps, this is the place I was in mentally when I finally recovered for good: I was just so freaking sick of agonizing over everything I put in my mouth and missing out on life. I still had allllll of my fatphobia to confront, but this really lit the fire for me and kept me going.",
      "created_utc": 1683739310.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jjn0f7p",
      "author": "PintSizedKitsune",
      "body": "You’ve got this 🖤 Proud of you for looking out for yourself and your well-being. Wishing you nothing but the best going forward.",
      "created_utc": 1683744763.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jjntsio",
      "author": "BabyUtensil",
      "body": "Live the life you envision a healed version of yourself leading. Example: today after lunch I wanted a snack. I thought “what would the healed version of myself do” and then I did that thing\n\nIf I don’t want to be the Ed version of myself, I don’t need to act like that version of me\n\nI don’t know if that makes sense, it’s just helping in my recovery right now ♥️",
      "created_utc": 1683756229.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjoknlh",
      "author": "stoptouchingmyhair",
      "body": "👏🏼👏🏼👏🏼👏🏼👏🏼",
      "created_utc": 1683767785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjkx6p2",
      "author": "Mysterious_Raindrop",
      "body": "Thank you for your kindness <3",
      "created_utc": 1683708665.0,
      "score": 6,
      "context": [
        {
          "id": "jjkw118",
          "author": "None",
          "body": "I am proud of you! That's a great step forward. Your self-reassuring words show how much stronger than the illness you have gotten!",
          "created_utc": 1683707621.0
        }
      ]
    },
    {
      "id": "jjkxf90",
      "author": "None",
      "body": "You're welcome! Here's to more wins for both of us!",
      "created_utc": 1683708873.0,
      "score": 3,
      "context": [
        {
          "id": "jjkw118",
          "author": "None",
          "body": "I am proud of you! That's a great step forward. Your self-reassuring words show how much stronger than the illness you have gotten!",
          "created_utc": 1683707621.0
        },
        {
          "id": "jjkx6p2",
          "author": "Mysterious_Raindrop",
          "body": "Thank you for your kindness <3",
          "created_utc": 1683708665.0
        }
      ]
    }
  ]
}