{
  "id": "141q4ae",
  "subreddit": "fuckeatingdisorders",
  "author": "rott1ng",
  "created_utc": 1685995629.0,
  "title": "“you can always just lose weight again healthily!” is the worst advice you can give to a disordered person",
  "selftext": "when i was debating on whether if i wanted to recover or not, i was scared of becoming ‘overweight’ and people around me kept saying that i could just lose weight in a ‘healthy’ way with exercise and diet etc. however i literally developed my ED with a diet. now i’m scared i’ll become a weight that is considered “unhealthy”, and be bodyshamed for not wanting to diet to lose it. the diet mindset lead me to disordered eating, and the disordered eating to a full blown eating disorder. i so desperately want to let go of my obsession with my weight, but it feels like i’ve had it ever since i was born, thanks to diet culture",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/141q4ae/you_can_always_just_lose_weight_again_healthily/",
  "score": 85,
  "num_comments": 11,
  "comments": [
    {
      "id": "jn13wli",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1685995629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jn153cf",
      "author": "Halaros",
      "body": "A \"bonus\" is when diet culture says that your body will attempt to go towards the highest weight it has been at. So if you suddenly gain weight, losing it will be \"harder\". This is one mental barrier I just cannot seem to let go of.\n\nWhat does lose weight healthily even mean? How healthy is exercise and diet truly, when it literally takes up all your mental capacity?\n\nDiet culture bad",
      "created_utc": 1685996097.0,
      "score": 43,
      "context": []
    },
    {
      "id": "jn1tdoy",
      "author": "coconuts-and-treason",
      "body": "It’s so fucking hard to recover sometimes with diet culture spewing nonsense and fucking with our heads! I feel you.",
      "created_utc": 1686006110.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jn4jrcg",
      "author": "yaycancer",
      "body": "I feel this so hard, I developed my ED the exact same way - overweight -> dieting -> disordered eating -> anorexia. I'm trying to recover, but people are still telling me I'm an inspiration for losing so much weight, and that I look so much fitter/better than before I started dieting. I don't think they mean it this way, but to me it all just sounds like, \"Doesn't matter that you're mentally destroying yourself, you look great on the outside so it's worth it!\" The pressure not to regain and look like a failure is insanely hard to fight against most days.",
      "created_utc": 1686062931.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jn2u9qz",
      "author": "None",
      "body": "If your doctor knows how sick you've been, they may not fat shame you. It's very hard with anorexia to lose weight in a healthy way. Having a dietician and counsellor would be so helpful.",
      "created_utc": 1686023683.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jn3cx8j",
      "author": "Alarming-Mistake683",
      "body": "Yes. I also hear \"you can still eat healthy\" when i purposefully don't pick a safe food.\nLike... When was I EVER eating \"healthy\"???",
      "created_utc": 1686036890.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jn96mm4",
      "author": "None",
      "body": "yeah. imagine telling a recovering alcoholic that they can go back to drinking casually again.",
      "created_utc": 1686145877.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jn1cmif",
      "author": "rott1ng",
      "body": "oh my god dont even get me started on that!! the way the diet obsessed people promote fighting against your own damn biology as something you should do for your health and wellbeing will never not be insane to me",
      "created_utc": 1685999043.0,
      "score": 19,
      "context": [
        {
          "id": "jn153cf",
          "author": "Halaros",
          "body": "A \"bonus\" is when diet culture says that your body will attempt to go towards the highest weight it has been at. So if you suddenly gain weight, losing it will be \"harder\". This is one mental barrier I just cannot seem to let go of.\n\nWhat does lose weight healthily even mean? How healthy is exercise and diet truly, when it literally takes up all your mental capacity?\n\nDiet culture bad",
          "created_utc": 1685996097.0
        }
      ]
    },
    {
      "id": "jn1annh",
      "author": "Sareeee48",
      "body": "I wouldn’t say exercise *in itself* is bad, but using exercise as a means to manipulate your body is absolutely disordered. You can’t enjoy exercise when you’re doing it out of obligation to achieve some goal over, well, doing it for enjoyment.",
      "created_utc": 1685998261.0,
      "score": 9,
      "context": [
        {
          "id": "jn153cf",
          "author": "Halaros",
          "body": "A \"bonus\" is when diet culture says that your body will attempt to go towards the highest weight it has been at. So if you suddenly gain weight, losing it will be \"harder\". This is one mental barrier I just cannot seem to let go of.\n\nWhat does lose weight healthily even mean? How healthy is exercise and diet truly, when it literally takes up all your mental capacity?\n\nDiet culture bad",
          "created_utc": 1685996097.0
        }
      ]
    },
    {
      "id": "jn3pej8",
      "author": "rott1ng",
      "body": "i will just be searching something completely unrelated to diets and boom! Intermittent fasting ads. They’re literally everywhere ugh.",
      "created_utc": 1686047393.0,
      "score": 3,
      "context": [
        {
          "id": "jn1tdoy",
          "author": "coconuts-and-treason",
          "body": "It’s so fucking hard to recover sometimes with diet culture spewing nonsense and fucking with our heads! I feel you.",
          "created_utc": 1686006110.0
        }
      ]
    },
    {
      "id": "joeapho",
      "author": "daddydearest6969feet",
      "body": "DUDE FOR REAL THOUGH. I literally am fucking incapable of losing weight “healthily”, I can shift slightly, stop drinking, cook more at home, but i’ve been recovered for like 5 years and I still cannot do much more than the aforementioned list of things. it’s been hard pill to swallow but still worth it. edit: OP do you. do your thing and know that it’s fine to just be yourself.",
      "created_utc": 1686948898.0,
      "score": 3,
      "context": [
        {
          "id": "jn96mm4",
          "author": "None",
          "body": "yeah. imagine telling a recovering alcoholic that they can go back to drinking casually again.",
          "created_utc": 1686145877.0
        }
      ]
    }
  ]
}