{
  "id": "143jehd",
  "subreddit": "fuckeatingdisorders",
  "author": "fauxfoxem",
  "created_utc": 1686158938.0,
  "title": "It feels like recovery has truly opened my eyes to just how completely fucked up diet culture and weight loss advice is.",
  "selftext": "It’s insane to me that I’ve spent over a decade of my life absolutely terrified of eating without tracking calories. Most weight loss advice and CICO subs act like it’s not only normal, but necessary, to be hyper-vigilant around food. Diet culture really treats bodies like a machine with perfect calorie-to-weight inputs and outputs.\n\nNow that I’m further along in recovery and eating pretty “normally,” it just feels like I’m finally seeing all this bullshit for what it is. I don’t track, but I am still aware of the calorie content of most of what I eat from the years of disordered eating. I’m past EH and am weight restored, but I still have days where I eat 3xxx+ calories just because, as I’m learning, that’s a normal ass thing to do. My body on and after those days doesn’t look any different than on days I eat less. \n\nI’ve gained weight in recovery (since that was obviously the goal), but since hitting a range my doctors are happy with, I honestly have kind of stalled out - not intentionally, just like… I eat enough to not lose and stay full and my body just kind of doesn’t change (granted, I don’t weigh myself, but I’ve stopped outgrowing my clothes the way I did at the beginning of recovery before weight restoration).\n\nIt’s just weird to me that so much advice surrounding bodies is dedicated to this extreme calorie counting and body vigilance when not doing that has led to a much happier and stable relationship to my body. I’m not my smallest, sure, but my smallest was so miserable to maintain and deleterious to my health that it just wasn’t worth it. Now I just look the way I do, feed myself, and my body doesn’t fluctuate like crazy. Seriously, I absolutely housed pastries AT NIGHT (huge ED fear for me was night eating) on top of my normal meals yesterday and I’m less bloated today than I was most days with my ED. And even when I do bloat, I don’t hate it so much because I know my body stops being bloated eventually. Like I just have so much more patience for myself now.\n\nNot really sure why I’m sharing this, but I guess it’s in part because of how annoyed I am for creating all these long-term health ramifications when eating without tracking is so much more peaceful. I know my ED wasn’t my fault, but I still feel almost in disbelief that eating could ever feel this normal. Not perfect mentally, by any means, but compared to where I was at the beginning of the year, I’m fucking crushing it. The fact I can have consecutive days of not thinking about my body is insane.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/143jehd/it_feels_like_recovery_has_truly_opened_my_eyes/",
  "score": 86,
  "num_comments": 9,
  "comments": [
    {
      "id": "jna4wmq",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1686158938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnajq7i",
      "author": "None",
      "body": "You're doing so great! We're in a similar situation, I started all in recovery 3 months ago and are probably weight restored (I don't weigh myself anymore as well). I feel at peace and comfortable and although my EH is definitely not yet over, I stopped gaining so fast/at all. Its amazing how bodies can regulate themselves. I cringe so much at diet culture, especially the posts that are like \"if you use x instead of y, you save 50 calories!!\" \"Eat xxx calories less and you're gonna lose x pounds in x days\" Like shit, the body doesn't care about 50 calories and it's not a calculator. If we would need the same amount of energy every day, how come that intuitive eaters (like you and me seem to be) have a steady weight despite eating differently every day? We should complicate things that are actually natural...",
      "created_utc": 1686164451.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jnb24du",
      "author": "coconuts-and-treason",
      "body": "Yup, I feel all of this. It’s basically like the whole fucking world has an eating disorder. Diet culture is just so normalized and the true harms of it aren’t well known enough yet.",
      "created_utc": 1686171209.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jna8dvt",
      "author": "Alarming-Mistake683",
      "body": "So proud of you! Keep up that awesome work. This is a huge deal.\n\nDo you mind if I ask, during your earlier stages of recovery, did you experience that constant bloat? If so, how long did that last?\nI look like a pregnant woman and some days it makes it hard to push through.",
      "created_utc": 1686160229.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jne8bls",
      "author": "GetYourFixGraham",
      "body": "I feel this so much. I was a huge CICO-path when I was actively bulimic. It was so self defeating IMO.\n\nNow that I’m just eating normally… I’m not spiraling and permanently gaining weight like I thought I would. To be clear, I had zero weight restoration to do so, even if you do gain weight, it’s totally fine.\n\nAnyway, diet culture made my problem so much worse. It justified my ED. Post diet culture, I sometimes dip into these subs and see how crazy some of the advice is. Someone will say they ate a larger portion of dessert or something and someone else is like “have you tried this ultra synthetic, volumized version of that thing instead? It’s sooooo good.” I’ve lived that life. Volumized food is not as tasty or satisfying as its normal counterparts.\n\nI used to be a “weigh myself everyday” person, too. Weighing yourself everyday is totally pointless for most people because weight fluctuates so much day to day. And I’m at the point where I don’t care. I cared for a decade and no number brought me peace.\n\nAnyway, congratulations on your journey, OP - and I’m glad you’re seeing it all for what it is!",
      "created_utc": 1686232698.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jnb6kv3",
      "author": "happy_bluebird",
      "body": "You NEED to listen to the podcast Maintenance Phase!! r/maintenancephase",
      "created_utc": 1686172847.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jncpunn",
      "author": "ForestRagamuffin",
      "body": "thank you so much for sharing this. i'm having some hard ed-unrelated things feelings today and i've been sort of kind of maybe intending to restrict about it. focussing on how much bigger my body is now (not thin, never was) has been my go-to distraction. instead of restricting, imma screenshot this post and eat some food. i gotta feed my body if i wanna process my emotions. all bodies are good bodies, fat bodies are good bodies, and it's ok to just vibe",
      "created_utc": 1686197191.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jna9d40",
      "author": "fauxfoxem",
      "body": "YES! Oh my god, my early recovery bloat was so bad I went to the hospital thinking I was having a heart attack because of the chest pressure - but nope, just severe bloat! I was coming off of 7+ years of laxative abuse, and my body was just losing it. \n\nI was carrying like 10+ pounds of JUST water in addition to actual weight gain for about two months. It was miserable. I cried constantly. Having to eat thousands of calories when I was that bloated and constipated made me want to give up, but I didn’t. I stopped laxatives entirely and haven’t relapsed since.\n\nAround the three month mark, it got significantly better. By five months, I’d say the excess bloat was completely gone. The biggest thing that helped me was eating, consistently, and intentionally adding fiber to my diet. I also weirdly found that ice cream helped me a lot? I don’t know if that was real or not, but something about downing a pint gave me relief from my IBS-C the next day which helped with the bloat.\n\nIt’s ultimately a waiting game, but it does get better. Even if it feels like it never, ever will, it does. Even if me saying that feels like a, “It worked for her, but I’m not her,” it does. I recommend finding comfy, loose clothes and living in them. I wore dresses exclusively during early recovery because they allowed for the bloat without any tightness.",
      "created_utc": 1686160590.0,
      "score": 14,
      "context": [
        {
          "id": "jna8dvt",
          "author": "Alarming-Mistake683",
          "body": "So proud of you! Keep up that awesome work. This is a huge deal.\n\nDo you mind if I ask, during your earlier stages of recovery, did you experience that constant bloat? If so, how long did that last?\nI look like a pregnant woman and some days it makes it hard to push through.",
          "created_utc": 1686160229.0
        }
      ]
    },
    {
      "id": "jnbqtub",
      "author": "comemadamletsaway",
      "body": "!!!!",
      "created_utc": 1686181139.0,
      "score": 2,
      "context": [
        {
          "id": "jnb6kv3",
          "author": "happy_bluebird",
          "body": "You NEED to listen to the podcast Maintenance Phase!! r/maintenancephase",
          "created_utc": 1686172847.0
        }
      ]
    }
  ]
}