{
  "id": "14lrk6w",
  "subreddit": "fuckeatingdisorders",
  "author": "Invisibly_Fragile513",
  "created_utc": 1688002728.0,
  "title": "So much shame and guilt for things I did during my ED/recovery. Fucking hate myself tbh",
  "selftext": "This is my first post so idk really know where I'm going with this. Basically I hate myself and need to vent somewhere, because I have a bunch of shit to get off my chest and I can't keep it all to myself anymore. I'm so tired of keeping secrets and just need to put it all out in the world, even if it is just anonymously...\n\nI’ve been actually trying to commit to this recovery thing (for me that means significantly reduced exercise, and eating what/when/as much as I want) for 5 months now, and food feels quite a bit easier and more flexible. As in, I’m a bit better at ignoring the disordered thoughts, but sometimes they’re still really loud and at times I succumb to them. I struggled with a bunch of undiagnosed disordered eating/ED stuff for 9 yrs. Never ‘heavily’ restricted, but lots of over exercise and was significantly underweight for a long time after losing lots of weight. During these past months I experienced some really intense hunger (more on that later) that has finally mostly died down, but I don’t feel like I even deserved it due to me eating more than most non-disorded people during my few years of quasi recovery before fully committing, despite all the rules and cognitive symptoms I still had at that point. In 8 months I went from 88 lbs to 164 lbs, (5’5”, 23F for context, so we're talking a BMI jump from 15 to a whopping 27) so obviously body image fucking sucks (especially since the majority of the weight went straight to my stomach/hips/waist/thighs. I know that's 'normal'/expected but I still fucking hate it). Based on my genetics/family members, this is probably way closer to my set point weight, but I’m definitely hoping at least 30-40 lbs is overshoot. \n\nWorse than the physical discomfort though is the mental anguish due to shame for all the shit I did during my ED, and honestly lots of things during recovery and the extreme hunger period, because that’s when I felt most out of control. So many things that I’ve never admitted to anyone that still haunt me and I wish I could just forget. I feel like I don’t deserve to be alive and like I’m just a fucked up, shitty person. I only ever wanted to hurt myself and I deeply regret that so many other people were affected by my inner demons bringing out the worst in me. I just want to be a good person and I hate that I've managed to fuck up not only my own life but also the lives of everyone around me. Any sort of addiction can really throw a monkey wrench in everything I guess, but that certainly doesn't absolve me of responsibility for all of this.\nSo here are all the things I need to confess before my secrets suffocate me. I’m so sorry for everything. I wish I could take it all back or prevented all of it in the first place.\n\nDuring ED:\n\nYelling at and being a total bitch to my little brother because he was buying me chocolate for my Christmas stocking\n\nThrowing away so much food\n\nSneaking into my parents' room to weigh myself multiple times per day\n\nFinally just getting my own scale, which also measured body fat percentage, so then I had a second metric to obsess over (joke's on me, that's probably quadrupled at this point)\n\nWatching my mom like a hawk when she'd cook for the family, and biting her head off for using too much oil/cheese/sugar/etc.\n\nBeing pissed, rather than grateful, that my friends brought me these little individual ice cream cartons when I got my wisdom teeth out. Ended up melting them with the space heater in my room and pouring them down the sink, because that's definitely what a normal 16 year old would do\n\nSo many lies. To family, friends, therapists, dietitians, everyone.\n\nThinking about food 24/7. Planning, calculating, obsessing. All of which prevented me from really being present with people and connecting with them. I was honestly so self-centered, stubborn, and uncompromising\n\nTrying all sorts of 'detox' teas and weight/fat loss pills\n\nBeing really irritable and tense in general \n\nMaking food/exercise/weight an integral part of my identity\n\nGoogling and comparing my height/weight/BMI to pro runners. I did a lot of running during my ED, and my mentality was that if I couldn't be faster than the pros, at least I could be thinner\n\nGoing to random events in college just for the food, and then feeling either completely overwhelmed or totally out of control in unlimited food situations\n\nCausing so many fights that my parents nearly got divorced. My mom straight up told me I was tearing my family apart, and she wasn't wrong\n\nSaying so many cruel things and making everyone else’s lives miserable\n\nFaked having my period for years so that I could claim to not be sick/too thin and allowed to occasionally exercise. This sometimes involved food coloring, other times legit stealing used pads from the trash at school, putting them in a Ziploc, and bringing them home to my trash can in case mom checked or something. what the actual fuck?!?\n\nMissing so many social opportunities with friends and family so that I could exercise and not have to deal with the food (or going and sucking the fun out of it)\n\nSpending hours looking up random restaurant menus in random cities and picking out what I'd order if I were there\n\nDefinitely did my fair share of the whole chew/spit thing, and just lots of sneaky/secretive eating in general\n\nMemorizing. Calories. Of. Everything. And somehow always managing to steer conversations towards food/calories/exercise, as if that was interesting to anyone without an ED\n\nBeing obsessed with mirrors/body\n\nPretending to eat foods, but really hiding it in my sleeves/pockets/underwear/purse, feeding it to the dog, spitting it out, flushing it, throwing it over the fence into the neighbor's yard (??), etc.\n\nSkipping class in HS to drive the 2 miles home and do my mom’s workout videos while parents were at work\n\nLying about where I was so I could exercise more\n\nFabricating my own medical printouts with my weight/body fat % bolstered. not going to lie, I'm somewhat proud of how convincing they were. I remember my mom being proud of me too, because she believed the numbers\n\nGoing to stores to walk up and down the aisles and look at nutrition info, just for 'fun'\n\nJudging other people's food choices, weights, exercise habits, etc., and feeling like I was superior (even though the opposite was/is true)\n\nRunning on a fractured foot (that I told nobody about) for months (I was in a sports med class and was convinced I could heal it myself... whilst blatantly ignoring the 'rest' piece of the healing process)\n\nMemorizing workout routines and going to the bathroom or back stairwell between every class in HS to do squats and lunges to chip away at the 'mandatory' daily regimen \n\nWearing baggy clothes and/or trying to make my ribs/hip bones obvious for the concern from others, aka compliments in my mind\n\nReplacing ice cream with plain, nonfat yogurt so I could eat it in front of my parents and trick them into thinking I was ok. I was on thin ice at that point already, and am almost certain I would've been sent to treatment had I been caught. adrenaline levels were absolutely through the roof\n\nZiplocs of food and lists of calorie logging hidden in my room. Parents cancelled their 20th anniversary trip after finding them and realizing they couldn’t trust me alone with my brother\n\nWaking up at 4am to exercise before HS, and putting the sweaty clothes back in my drawer, because mom did the family laundry and would be suspicious of the volume of exercise clothes I was washing \n\nHad to get hair extensions since mine was breaking/thinning so much \n\nAdding extra cheese/oil/calories in general to other people’s food, and tracking their calories in separate tabs in my brain. Literally would pour olive oil into smoothies and melt butter on nachos for my brother, and then watch him eat it to be sure he finished, like a fucking psychopath\n\nThrowing out other people’s food so I wouldn’t eat it\n\nI was so bad at actually talking to/connecting with people that I read my roommates' personal journals. I completely sucked at making friends and had no idea how to actually get to know people. One of them had an ED and I was trying to find triggering stuff. I was also afraid that they had written about me, since I was super paranoid about everything, and also kind of a shitty person. Honestly I was jealous of everyone else living normal lives and wanted to know all about them.\n\n\nFaking stomach aches or claiming to not like foods to get out of eating\n\nExercising until feeling like I was gonna pass out\n\nHaving a sick sense of pride every time I lost weight, got away with something, had an irregular EKG, or had my HR dip into the 30s\n\nMade family vacations miserable and tension filled for everyone\n\nonly being willing/able to go to restaurants and try new foods and eat more than people around me (while in partial recovery) if it was all pre-planned, compensated for, or earned; basically conditional permission to eat as long as my body didn't change and I got in all my exercise and I adjusted accordingly before/after (and I almost always went alone, so I'd have complete control, and it's not like I could focus on a conversation with food around anyway)\n\nWas super particular about eating at exact times each day, and got really irritated if anyone interfered with that \n\nGoing into my (tiny) roommate's room in undergrad to try on her clothes as body checking and making sure I was always the thinnest one\n\nTried numerous times (unsuccessfully) to purge, so I resorted to compulsive exercise, which did result in me throwing up a few times\n\nTried (unsuccessfully) to get out of both going to a family reunion for my great-grandma's 80th bday, and of being in a childhood friend's wedding, since it'd throw off my routine\n\nRefused to eat things family members made or bought for me\n\nWas legit jealous of a family friend with cancer, because he lost a bunch of weight (he died a few months later)\n\nAlso jealous of all the people who skip meals or eat less than I do, disordered or not. for most of my ED I was somehow also afraid of under-eating and losing weight, because I didn't want backlash from my parents, and I also was really bad at restricting\n\nWent on pro-Ana sites to find more tricks, and contributed some of my 'clever' ideas\n\nWater loading and sticking batteries/coins in shoes/pockets to manipulate my weight and avoid being sent to treatment\n\nWas overall just not my best self. Everything made me angry. I was irritable and had a temper, and I took it out on others. I adopted a puppy impulsively while in college, and I was so overwhelmed that everything he did wrong would set me off. I was having daily panic attacks and mental breakdowns. Overreacting was my default, and I’d yell at him and spank him, often harder than intended, followed by extreme self-loathing for letting my mental struggles bring out the worst in me. I love him so much and just want him to feel protected, loved, and safe, but for quite some time I failed to show him the unconditional love he deserved, and that he always showed me. I know that he probably doesn't even understand or remember, but he is basically my child and physical discipline of a child/pet is flat out wrong, regardless of circumstance, so I feel like I can't ever redeem myself for failing him in such a colossal way. I hate that I am capable of being physically aggressive when in a state of extreme imbalance/nervous system dysregulation, especially considering I always had a strong connection to animals as a kid, and was always gentle and nurturing towards them. But I let my overwhelm turn me into a monster\n\nFuck, that’s a long list. And we’re not done, because I did some really horrible and shameful stuff once starting recovery too. Once I just kind of said fuck it and dropped all the rules to get out of quasi recovery and a semi relapse, I completely lost control of food. I swung so hard to the other side with my extreme hunger levels. Equal and opposite reaction I guess. I feel so invalid though, and like I wasn’t sick enough to warrant such intense reactive hunger/deprivation backlash. Other people who were way thinner or restricting way lower (for years of quasi recovery I was eating 2500-3000 calories, but was still losing weight/barely maintaining due to my exercise and hyper-metabolism from the energy debt I’d accumulated) didn’t do this kind of shit, and recovered in a slow and controlled way, but I felt almost possessed and overtaken with the urge to eat and intense food seeking behaviors. So, here are the things I did during that incredibly dark time: \n\nStole food from my roommates and lied about it over and over again. Literally would take their stuff from the fridge and even their rooms and try to either cover it up or replace it, but sometimes that just wasn’t possible\n\nBeing jealous of people who were still sick, and wanting to both be sicker and fully recovered at the same time\n\nEating out of the trash. And I’m not talking about just stuff that I or my roommates threw away. I mean stuff from public trash cans at the mall, school dining hall/classrooms, restaurants, etc. The urge to eat everything in sight was so strong that it didn’t matter in the moment. It was like being driven by a motor. I wanted to stop, but it was overpowering, compulsive, and obsessive. This was happening daily for months. I'd 'make the rounds' around campus, like a fucking rat searching a maze for a fucking piece of cheese, or a drug addict desperate for a hit. I'd pop into the grad student lounge too, and do shit like eat the chocolate chips out of all the cookies provided by other students. Sometimes it even felt like a positive thing, since I was rebelling against my arbitrary rules, giving into my hunger, eating all sorts of foods I'd never allowed myself to eat, yet alone buy- but then reality would set in and I'd absolutely hate myself and be left with the most intense suicidal thoughts of my life (part of me wishes I had committed suicide back in March, when I had the opportunity). And then I’d try to justify/make excuses so that I wouldn’t feel so disgusting. Like I was only allowed to eat more and certain types of food if it was ‘free’ and going to go to waste otherwise. Definitely had that scarcity mindset with money in addition to food. Sometimes stuff was in takeout boxes, but often just loose food scraps/dregs of caloric drinks that were loose in the can. I felt like some sort of wild animal whose primal instincts overpowered my logical brain in the moment. I had complete strangers offer me food and money (which I never took, of course) because they thought I was homeless or legit starving or something. My roommates confronted me too. And somehow, even that plus the shame weren’t enough to stop the behaviors.\n\nAnd finally, worst of all, messing with, rather than just eating, roommates’ food, without telling them, because I had so much shame that I literally would’ve rather died than admit what I did. Eating their PB and Nutella out of the jar with my fingers. Picking the streusel off their coffee cake. Extracting the cinnamon swirl from raw freaking cinnamon rolls. Eating the cookie dough chunks out of ice cream. Taking bites out of things. Literally sucking the sauce/cheese off of pasta or the curry sauce off of tofu chunks in their food, and then returning the chunks and frantically trying to ‘replace’ the sauce so it wasn’t noticeable. The list goes on. Like what the actual fuck is wrong with me? What kind of deranged fucking psychopath does that?? That’d be weird enough if it was my own food, but this is a whole other level of fucked up. I hate that my issues affected them, and that I wasn’t strong enough to have self control. They didn’t deserve to suffer because of me being a disgusting human (despite one of them being one of the most inconsiderate people I've ever encountered). It felt like I was in a trance, or having an out of body experience. It was like when you watch a scary movie and practically beg the main character not to go into the dark basement alone, only to end up exasperated when they inevitably do, since your pleading fell on deaf ears. As in, I was aware of what was happening, and had intense shame, guilt, and self-hatred even in the moment, but it was as if trying to resist just resulted in a tug-of-war match with these biological urges- one which I was destined to lose. It was like having two voices in my head: one screaming at me to stop, the other egging me on, with the real me caught in the crossfire feeling completely unable to influence my own actions. The harder I tried not to steal from roommates, the more I was taking things from the trash. I was trying to buy all of the things at the store, but it was really hard at first because all I was craving were the foods I avoided for so long, and I couldn’t even keep up with the insane amounts I was eating, especially since I just hate spending money on myself/food in general. Even once I started fully stocking up and giving in, it was hard to resist the urges to steal and do weird shit with other people’s food, because I felt like I needed to stockpile and hoard my food. And, for some reason, I still have really strong urges to pick apart/eat little bits off of food with my fingers, instead of just eating it. Idk what that's all about, but I feel like a fucking savage sometimes. I went from having so much control and discipline to it all blowing up in my face and me being like a damn puppet controlled by impulsive, fucked-up food urges and behaviors.\n\nSo there we have it. A comprehensive list of all the worst things I’ve ever done in my life, and why I feel like I don’t deserve to be alive, much less happy, successful, or at peace. Honestly I have so much compassion, forgiveness, and understanding for others struggling with any sort of mental disorder (just people in general really, being alive is hard AF for everyone sometimes), but it’s so hard to have even a sliver of any of those for myself. It feels damn near impossible to separate the ED-driven actions from who I am as a person. Like, my ED is an explanation for all this, and it influenced my actions, but it's definitely not an excuse or justification, and it all was still really shitty of me to do. And besides, surely there are people with EDs who don't do stuff this messed up, so logically it seems that I must be both someone with an ED and a bad person. I wish I could’ve just done recovery in a slow and controlled way, but it really didn’t feel like I had that option, as I just really lost control of everything and food obsession completely overpowered me. Everything was just so confusing, overwhelming, and scary. My whole body was sore, achy, bloated (still dealing with that one), and swollen. My anxiety and depression skyrocketed and I stopped going to class, fell behind on my schoolwork (which prevented me from graduating on time), cried more in those few months than in the past 9 years combined, barely slept at all, and way overdid the caffeine on numerous occasions. I felt crazy, insatiable, and like my brain's sole function was to drive me to devour anything and everything. Going to the store literally 4 times a week to get more food, and eating 5000+ calories a day of mostly things like cookies, PB, and pizza, (I'm not even exaggerating, I was legit going through 4+ family packs of cookies per week) for months on end, felt so wrong. But trying to resist was so much worse, because then I was stealing from roommates and the trash, and trying to stop those behaviors felt as impossible as fighting my hyper-appetite itself. I just feel like I somehow completely fucked up both having an ED and recovering. Like I was never 'sick enough', but then recovery was a shitshow and in many ways felt worse than the later years of having an ED, so like now what?\n\nI realize that feeling so out of control was a reaction to my death grip on control, and really a sign that I was, in fact, sick, but still. I hate my bigger body and I hate myself, my body still aches from healing, and I have so much guilt and shame that at times it physically hurts my chest and makes me nauseous, but I don’t know how to forgive myself for all of this. I know I can’t change the past, but I wish I could just forget, or start over, or disappear. Honestly I sometimes wish I had never even tried to fully recover. At least being in quasi recovery basically only negatively impacted me, and it would’ve saved me so much guilt and shame, and I’d still be thin, instead of a fucking fatass. And now that I have more mental space due to not having obsessive food and exercise thoughts, that space is being filled with all of these horrible feelings and memories. They torment me and I ruminate and sometimes beat myself up even to the point of panic attacks, but honestly I deserve that and more. I spent so many years trying to be perfect and 'the best', but I ironically ended up being the polar opposite, and that hits really hard. I know that going back to my old patterns of behavior will just perpetuate the cycle, as I'll either have to stay stuck there or finally fully recover at some point in the future, but I hate not having control and having all these damn feelings on top of it all. I don't understand how something supposedly 'good' and 'healthy' (recovery) can feel so wrong. I was so fit, fast, thin, disciplined, and controlled. It feels as if I have to choose between having a personality and food freedom, OR having stable mental health (even if just a façade), OR being physically fit. I know everyone's journey is different, and that bodies all react differently to chronic stress, over-exercise, and under-nourishment, but it seems like everyone else becomes fitter, faster, stronger, happier, and healthier with recovery, whilst I'm like the inverse of that. Like they all gain 20 pounds at most and are technically a healthy weight but still objectively thin. Meanwhile I don’t 'look like a runner' anymore, or even like I work out, and I kept up that outward appearance for so long. Letting go of the fit, disciplined, and perfectionist identities feels like giving up or self-sabotage, even though I know there's so much more to life, and my life's purpose specifically, than control and fitness, especially at the cost of mental, and ultimately physical, health. \n\nI just feel like I fucked everything up and it doesn't feel worth it, since in many ways I physically and mentally felt better and more energetic during my ED days. Like I don’t want to trust the process anymore. I want the sense of safety and control and discipline, to be thin again, and to have my energy back (even if it was all artificial and just adrenaline). Food kind of felt easier during the period of intense hunger/binging because at that point my body’s primal desire to eat overpowered my intense fear of weight gain and it often didn’t feel like I had a choice as it was pretty out of control and often not me intentionally challenging myself. Now that my appetite is more stable I have to be intentional about allowing all foods and not compensating or trying to restrict, but I don’t really want to do any of that because now I’m fat and feel like I need to regain control over my body (and I could get away with it now, since it would be socially acceptable to lose weight)… I feel like if I was thin it would be easier to consciously and intentionally allow myself to eat enough/my fear foods without compensating or having to have rigid control/pre-planning (at least that's what my brain tells me. But, of course, when I was thin I wasn't ever willing/able to do those things, hence why things were so uncontrollable and drastic. So I suppose being thin wouldn't make the mental struggle any easier...). The comparison aspect feels hard again too; like I used to be able to sort of 'justify' eating lots or more than other people, when I was underweight and exercising a ton to burn it off, but now I have no excuse and feel like I shouldn't still be eating more than others even though this is my 'normalized' appetite. But now when I try to restrict even a little I end up feeling crazy and obsessive and doing weird food behaviors again... Honestly I just wish I could go back and knock some sense into my stupid 15-year-old self. If she had just been receptive to therapy and willing to take baby steps, most of this shit would've never happened. \n\nAnyway, hopefully this will help some of you all feel better about yourselves, or at least less alone in your guilt and shame.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/14lrk6w/so_much_shame_and_guilt_for_things_i_did_during/",
  "score": 90,
  "num_comments": 23,
  "comments": [
    {
      "id": "jpxsihs",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1688002729.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jpxze7p",
      "author": "Cheap-Lack-2804",
      "body": "Wow. Can I just say how STRONG you are for posting this!! This post brought me to tears. I hope you know how much this means to me. I did EVERY. SINGLE. THING that you did, and honestly more. I am over two years into recovery and still feel SO much shame and guilt for my past actions. I also did the whole quasi, to uncontrollable route of recovery, and also feel shame in the fact that I never went inpatient or got higher levels of care. I’m so sorry you feel that you don’t deserve happiness, because that’s such a lie. If anything for all this SHIT you went through, you deserve so much more than happiness. You are not alone in this fight, and you have so much to live for. Please do not hesitate to ever reach out (im not kidding pls message me if you need anything at all) and I wish you the most peace, love, and kindness the world has to offer. Please be kind to yourself, you are worthy of love 💓",
      "created_utc": 1688005952.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jpy8iqh",
      "author": "BabyUtensil",
      "body": "Oh dear friend. You were sick. \n\nI’ve done nearly all of those things! Down to eating my roommates Nutella or even cheese off their pizza or bits of avocado from their sushi in the fridge. And then I lied or tried to replace things but failed to do it right or in time and remembering all of that shames me to think about\n\nBut like you, I felt feral. I was malnourished and the hunger would make me absolutely snap and do deranged things. I too have eaten out of the trash at work. One time I was so hungry that after a work lunch (where I myself had only ordered a salad with no cheese or dressing) was so insanely snapped I offered to clean up everyone’s lunch box and (IN THE PUBLIC OFFICE EATING SPACE) ate my co workers discarded scraps of bread and bits of chips. \n\nAnyone could have seen me if they walked in to the open space and it would’ve been clear what I was doing. But in that moment I didn’t care, the hunger had taken over and I didn’t have a choice \n\nI too have exercised through injury, through snow storms… through events that WERE more important (my best friends wedding rehearsal dinner)\n\nBut I acknowledge I was/ am sick. Those things… were me.. but I was doing them not because I’m a terrible person who thinks it’s fine to eat others food or not prioritize my loved ones, but because I have a mental illness\n\nHating myself for the things and moments doesn’t change what happened. I can and have made amends when and where it makes sense but the really important thing is how you treat yourself and your life GOING FORWARDS.\n\nAnd that starts, at the very least- with forgiving yourself.",
      "created_utc": 1688010562.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jpy0sif",
      "author": "Exciting-Beach9450",
      "body": "Thank you for sharing this. I hope you can forgive yourself. It really helped me to share with my family how grateful I was for sticking with me when I was (repeatedly) relapsing.",
      "created_utc": 1688006616.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jq0qaf9",
      "author": "P0cd81",
      "body": "Wow, thank you so much for expressing how I feel so well. I’ve been to treatment at least 10 times and know dozens of people with ED’s and no one has ever had the courage to share what you just did. Your desire to be held accountable for your actions shows what a truly good person you are. None of the behaviours you listed are your fault. They were the ED’s fault and you are not your ED. I hope sharing this helps you to let go of some of the shame and move on.",
      "created_utc": 1688060174.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jpyufty",
      "author": "catacles",
      "body": "I've done so many of these things, and I feel so much compassion for you having struggled so deeply. Thank you for writing all that out. Thank you for letting us feel compassion for you, and for being so vulnerable. It'll get easier. I promise.",
      "created_utc": 1688025455.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jpy9rfg",
      "author": "pinkyhex",
      "body": "Sometimes, one of the hardest and best things we can do is to simply accept it. \n\nYour shame and how you are describing your thoughts process of yourself sounds as if you deserve punishment. What good does you deserving panic attacks do? No good at all. Especially for someone suffering from years of pain from a mental illness.\n\nProcessing the things you feel shame of takes time, but it is possible. And it doesn't need to involve justifying it. Sometimes I find that makes it so it lingers worse because then it feels like an excuse. \n\nSomething I have found has helped me was essentially apologizing to myself for both my actions and how I beat myself up about them. And then using the grace I give to others for myself and accepting it and forgiving myself. \n\nAn apology is built of many things more than simply I'm sorry. It is comprised of expressing regret, accepting responsibility that you did the things/basically admitting it happened and acknowledging what the hurtful things were (you have a whole list here for example), and promising how you will behave differently in the future/pay back where you can. With a healthy dose of you will do your best, because we are human and we mess up.\n\nI really hope you are able to overcome the shame and find joy in life. You don't deserve to be stuck in such a hard place.",
      "created_utc": 1688011242.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k129n7l",
      "author": "Susm8au",
      "body": "This is the realest post I’ve ever read on reddit. Please keep this post up. Hope your okay ❤️",
      "created_utc": 1694997568.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jpzki9x",
      "author": "None",
      "body": "and what will carrying around that guilt is going to help, exactly?\n\nlike, obviously, if you did shitty things it's only natural that you'd feel shitty and regretful about them, but what else is there to do except try to make amends where possible and do better going forward?",
      "created_utc": 1688043393.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jqizldx",
      "author": "not-a-tthrowaway",
      "body": "OP I have done almost every single one of those things. In fact I managed to completely sever a relationship with my flatmates (at the time) during a relapse because I had a good day, suggested a pancake night, planned all the ingredients we were going to use then freaked out on the night and refused to join in. They got so angry that it was my idea and thought I was being petty for saying no last minute that we never really spoke again.\n\nI have had an ED for over 16 years now (not all the time but relapses) and during my first real period of recovery I was like you. I was constantly haunted by the impact my ED had on me, the things I had done and the animal I had become. I think part of it is that during recovery you need to create a new life for yourself and in a way, become like everyone else. The ED is a dark secret and it’s hard to go from living that dark double life to just living a more surface life without having to constantly hide everything. \n\nGiven all the secrets it’s not like you can relive that trauma and process it too much  because who can you do that with? (good friends, family, therapist if you’re lucky but most people aren’t!) so it does go round and round your head. And the more you live a normal life the more it hits you how actually crazy these things you did were when at the time they seemed completely normal.\n\nIf it helps: it goes away with time. The more time you put between you now, and the sick you; the more you identify with who are now and the more the sick you feels like a different person. You don’t have to feel guilty for things you did when you were unwell. If you’re well now and not doing those things, that’s more a reflection of who you are. Go back to those people and rebuild relationships, remind them of who you truly are, and use those memories as motivation if you ever want to relapse.",
      "created_utc": 1688404089.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3qefrb",
      "author": "teababyyy",
      "body": "Hi, I know this is an older post but I am going the FUCK through it and was searching this sub for something that I could relate to. I hate that you experienced all of this, but I am so grateful that you shared. You’re helping so many of us by being so honest and candid. So THANK YOU. and also.. how are you now?? I hope that all of the pieces of recovery fell into place for you. You deserve so much peace and happiness",
      "created_utc": 1735134040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k153880",
      "author": "None",
      "body": "😆 ED stands for erectile disfunction and not eating disorder. 😂",
      "created_utc": 1695052557.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jq1u2sg",
      "author": "Invisibly_Fragile513",
      "body": "and now your comment has brought me to tears. Thank you so much for your compassion and support, it honestly means so much that someone could know all the worst parts of me, yet still have kindness. The feeling invalid, is, ironically, so valid. I too never went to treatment besides therapy, but even that was only for a small portion of my disorder. For the most part, I was able to hide the chaos in my mind since my ED took on a more 'socially acceptable' form, ie eating 'clean' but more food overall than most people without ED and over exercising, but I suppose that not giving in to the reactive hunger and ignoring the hyper metabolism I developed due to being underweight and in an energy debt from the months were I did restrict calories still counts as restriction.  Anyway, thanks again. feel free to reach out to me as well, and I wish you so much peace, healing, and compassion too <3",
      "created_utc": 1688075329.0,
      "score": 7,
      "context": [
        {
          "id": "jpxze7p",
          "author": "Cheap-Lack-2804",
          "body": "Wow. Can I just say how STRONG you are for posting this!! This post brought me to tears. I hope you know how much this means to me. I did EVERY. SINGLE. THING that you did, and honestly more. I am over two years into recovery and still feel SO much shame and guilt for my past actions. I also did the whole quasi, to uncontrollable route of recovery, and also feel shame in the fact that I never went inpatient or got higher levels of care. I’m so sorry you feel that you don’t deserve happiness, because that’s such a lie. If anything for all this SHIT you went through, you deserve so much more than happiness. You are not alone in this fight, and you have so much to live for. Please do not hesitate to ever reach out (im not kidding pls message me if you need anything at all) and I wish you the most peace, love, and kindness the world has to offer. Please be kind to yourself, you are worthy of love 💓",
          "created_utc": 1688005952.0
        }
      ]
    },
    {
      "id": "jq1x22u",
      "author": "Invisibly_Fragile513",
      "body": "Thank you so much. Re-reading my post I can see that I \\*was\\* sick, even though I never felt 'sick enough'. Between not having a diagnosis, not eating low calorie, (save for the first few months in HS when I first rapidly dropped weight, but even then it wasn't low compared to the stereotypes) and my eating appearing normal (but only without accounting for the compensation via exercise and the fact that I was resisting my extreme hunger to stay underweight) it's hard to accept that my brain/body would fight back so hard to drive me to do the things I did, when other sufferers were literally starving and had enough self-control to not snap. I know I was malnourished and honestly my behaviors should be evidence themselves that I was not mentally healthy, as no energy-balanced, stable person would even think of, yet alone act on, these compulsions and urges. I relate so much to your office lunch experience. In college I would go into classrooms where parties/events  had taken place and 'clean up' and scavenge scraps from the plates in the trash, knowing damn well anyone could've walked in (and they sometimes did). It's honestly fascinating how mental health issues can almost turn us into different people, or at least the worst versions of ourselves. I hope you are doing ok <3",
      "created_utc": 1688076557.0,
      "score": 5,
      "context": [
        {
          "id": "jpy8iqh",
          "author": "BabyUtensil",
          "body": "Oh dear friend. You were sick. \n\nI’ve done nearly all of those things! Down to eating my roommates Nutella or even cheese off their pizza or bits of avocado from their sushi in the fridge. And then I lied or tried to replace things but failed to do it right or in time and remembering all of that shames me to think about\n\nBut like you, I felt feral. I was malnourished and the hunger would make me absolutely snap and do deranged things. I too have eaten out of the trash at work. One time I was so hungry that after a work lunch (where I myself had only ordered a salad with no cheese or dressing) was so insanely snapped I offered to clean up everyone’s lunch box and (IN THE PUBLIC OFFICE EATING SPACE) ate my co workers discarded scraps of bread and bits of chips. \n\nAnyone could have seen me if they walked in to the open space and it would’ve been clear what I was doing. But in that moment I didn’t care, the hunger had taken over and I didn’t have a choice \n\nI too have exercised through injury, through snow storms… through events that WERE more important (my best friends wedding rehearsal dinner)\n\nBut I acknowledge I was/ am sick. Those things… were me.. but I was doing them not because I’m a terrible person who thinks it’s fine to eat others food or not prioritize my loved ones, but because I have a mental illness\n\nHating myself for the things and moments doesn’t change what happened. I can and have made amends when and where it makes sense but the really important thing is how you treat yourself and your life GOING FORWARDS.\n\nAnd that starts, at the very least- with forgiving yourself.",
          "created_utc": 1688010562.0
        }
      ]
    },
    {
      "id": "jq1ua03",
      "author": "Invisibly_Fragile513",
      "body": "Thanks for your comment. I agree; the people who have stuck with me are honestly just incredible and selfless.",
      "created_utc": 1688075409.0,
      "score": 6,
      "context": [
        {
          "id": "jpy0sif",
          "author": "Exciting-Beach9450",
          "body": "Thank you for sharing this. I hope you can forgive yourself. It really helped me to share with my family how grateful I was for sticking with me when I was (repeatedly) relapsing.",
          "created_utc": 1688006616.0
        }
      ]
    },
    {
      "id": "jq1vo9w",
      "author": "Invisibly_Fragile513",
      "body": "thank you so much for this. i'm glad that i can turn a bit of my mess into a message to help others feel less alone in all this. and yes, sharing does help alleviate the burden a bit as I work towards separating my actions from my character. i hope you are doing well <3",
      "created_utc": 1688075976.0,
      "score": 3,
      "context": [
        {
          "id": "jq0qaf9",
          "author": "P0cd81",
          "body": "Wow, thank you so much for expressing how I feel so well. I’ve been to treatment at least 10 times and know dozens of people with ED’s and no one has ever had the courage to share what you just did. Your desire to be held accountable for your actions shows what a truly good person you are. None of the behaviours you listed are your fault. They were the ED’s fault and you are not your ED. I hope sharing this helps you to let go of some of the shame and move on.",
          "created_utc": 1688060174.0
        }
      ]
    },
    {
      "id": "jq1v08t",
      "author": "Invisibly_Fragile513",
      "body": "thank you so much for your kindness. I have so much compassion for you as well, and hope that you continue to heal <3",
      "created_utc": 1688075704.0,
      "score": 3,
      "context": [
        {
          "id": "jpyufty",
          "author": "catacles",
          "body": "I've done so many of these things, and I feel so much compassion for you having struggled so deeply. Thank you for writing all that out. Thank you for letting us feel compassion for you, and for being so vulnerable. It'll get easier. I promise.",
          "created_utc": 1688025455.0
        }
      ]
    },
    {
      "id": "jq1ut2c",
      "author": "Invisibly_Fragile513",
      "body": "Thank you so much. I do feel like I deserve punishment, although I don't think that way about anyone else, and know that me hating myself won't solve anything. I am working on processing all of this shit, and I agree that trying to justify can feel like making an excuse. I certainly don't excuse or condone my actions, but I think the goal is to understand, accept, forgive, and move on. And, yes, intention to do better is the most important piece imo.",
      "created_utc": 1688075624.0,
      "score": 3,
      "context": [
        {
          "id": "jpy9rfg",
          "author": "pinkyhex",
          "body": "Sometimes, one of the hardest and best things we can do is to simply accept it. \n\nYour shame and how you are describing your thoughts process of yourself sounds as if you deserve punishment. What good does you deserving panic attacks do? No good at all. Especially for someone suffering from years of pain from a mental illness.\n\nProcessing the things you feel shame of takes time, but it is possible. And it doesn't need to involve justifying it. Sometimes I find that makes it so it lingers worse because then it feels like an excuse. \n\nSomething I have found has helped me was essentially apologizing to myself for both my actions and how I beat myself up about them. And then using the grace I give to others for myself and accepting it and forgiving myself. \n\nAn apology is built of many things more than simply I'm sorry. It is comprised of expressing regret, accepting responsibility that you did the things/basically admitting it happened and acknowledging what the hurtful things were (you have a whole list here for example), and promising how you will behave differently in the future/pay back where you can. With a healthy dose of you will do your best, because we are human and we mess up.\n\nI really hope you are able to overcome the shame and find joy in life. You don't deserve to be stuck in such a hard place.",
          "created_utc": 1688011242.0
        }
      ]
    },
    {
      "id": "k33xk6k",
      "author": "Invisibly_Fragile513",
      "body": "Well it’s definitely the realest thing I’ve ever written, here or elsewhere. And thank you, I’m doing a little better ❤️",
      "created_utc": 1696228524.0,
      "score": 1,
      "context": [
        {
          "id": "k129n7l",
          "author": "Susm8au",
          "body": "This is the realest post I’ve ever read on reddit. Please keep this post up. Hope your okay ❤️",
          "created_utc": 1694997568.0
        }
      ]
    },
    {
      "id": "jq1valk",
      "author": "Invisibly_Fragile513",
      "body": "i agree, and don't deny that carrying this burden won't solve anything. It's hard to let go of when you feel that you deserve to shoulder it for eternity though. but, you're right. we can't go back. we can only learn and try to change the future.",
      "created_utc": 1688075820.0,
      "score": 3,
      "context": [
        {
          "id": "jpzki9x",
          "author": "None",
          "body": "and what will carrying around that guilt is going to help, exactly?\n\nlike, obviously, if you did shitty things it's only natural that you'd feel shitty and regretful about them, but what else is there to do except try to make amends where possible and do better going forward?",
          "created_utc": 1688043393.0
        }
      ]
    },
    {
      "id": "jqj4k8j",
      "author": "Invisibly_Fragile513",
      "body": "Thank you for sharing your story and for the reassurance. It helps to know that others have been in the same place. I hope you’re doing well on your journey 💗",
      "created_utc": 1688406045.0,
      "score": 1,
      "context": [
        {
          "id": "jqizldx",
          "author": "not-a-tthrowaway",
          "body": "OP I have done almost every single one of those things. In fact I managed to completely sever a relationship with my flatmates (at the time) during a relapse because I had a good day, suggested a pancake night, planned all the ingredients we were going to use then freaked out on the night and refused to join in. They got so angry that it was my idea and thought I was being petty for saying no last minute that we never really spoke again.\n\nI have had an ED for over 16 years now (not all the time but relapses) and during my first real period of recovery I was like you. I was constantly haunted by the impact my ED had on me, the things I had done and the animal I had become. I think part of it is that during recovery you need to create a new life for yourself and in a way, become like everyone else. The ED is a dark secret and it’s hard to go from living that dark double life to just living a more surface life without having to constantly hide everything. \n\nGiven all the secrets it’s not like you can relive that trauma and process it too much  because who can you do that with? (good friends, family, therapist if you’re lucky but most people aren’t!) so it does go round and round your head. And the more you live a normal life the more it hits you how actually crazy these things you did were when at the time they seemed completely normal.\n\nIf it helps: it goes away with time. The more time you put between you now, and the sick you; the more you identify with who are now and the more the sick you feels like a different person. You don’t have to feel guilty for things you did when you were unwell. If you’re well now and not doing those things, that’s more a reflection of who you are. Go back to those people and rebuild relationships, remind them of who you truly are, and use those memories as motivation if you ever want to relapse.",
          "created_utc": 1688404089.0
        }
      ]
    },
    {
      "id": "k33xgw7",
      "author": "Invisibly_Fragile513",
      "body": "Cool thing about abbreviations is that they can stand for multiple things. ED is a very common abbreviation for eating disorder, and it was pretty obvious given the context and sub",
      "created_utc": 1696228457.0,
      "score": 6,
      "context": [
        {
          "id": "k153880",
          "author": "None",
          "body": "😆 ED stands for erectile disfunction and not eating disorder. 😂",
          "created_utc": 1695052557.0
        }
      ]
    }
  ]
}