{
  "id": "15nmvaw",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1691698017.0,
  "title": "There will a 2 week moratorium on posts regarding “binging”",
  "selftext": "The mods understand the difficulties of early recovery, and that includes the struggles that accompany eating a lot. However, as of late a huge uptick in posts about “binging” have been made on this sub and many of them are repetitive, fatphobic, and harmful to other members trying to recover. Not to mention members here who actually struggle with emotional binging who have to see these kinds of posts every time they frequent the sub. Thus, any posts made regarding binging will be removed for the allotted time period. \n\nIf you have any questions, please reach out to us via Mod Mail and we will answer any questions you may have. Thank you.\n\n**EDIT**: moratorium has been extended indefinitely. We will update you on when they will once again be allowed.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/15nmvaw/there_will_a_2_week_moratorium_on_posts_regarding/",
  "score": 89,
  "num_comments": 1,
  "comments": [
    {
      "id": "jvmswbe",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1691698018.0,
      "score": 1,
      "context": []
    }
  ]
}