{
  "id": "15s331c",
  "subreddit": "fuckeatingdisorders",
  "author": "sickandcoolgirl",
  "created_utc": 1692129234.0,
  "title": "“girl dinner” trend",
  "selftext": "this is random but is anyone else insanely triggered by the tik tok “girl dinner” trend? most of the posts just seem like people bragging about how little they eat. nobody needs to know that you only had fucking cheese and crackers for dinner lmaooo. i’ve seen people call out the trend before but it just seems to be getting more popular and normalized and puts pressure on me to eat less for dinner because it’s “what everyone else is doing”. :(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/15s331c/girl_dinner_trend/",
  "score": 87,
  "num_comments": 7,
  "comments": [
    {
      "id": "jwbxd9l",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1692129234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jwcdm7y",
      "author": "duderancherooni",
      "body": "I like the ones where they’re clearly not restricting, they just don’t have any thought given to putting together a cohesive meal. Those are funny and make me feel seen bc I too will eat nachos and then cereal and then a pb&j plus some carrots or whatever and call it girl dinner. The ones where people are like, here’s an egg and a cheese stick I’m just like, noooo babe that’s not dinner, that’s bragging.",
      "created_utc": 1692135113.0,
      "score": 72,
      "context": []
    },
    {
      "id": "jwbylis",
      "author": "rott1ng",
      "body": "someone posted ice in a bowl to that audio i hate that trend and its so boring lol",
      "created_utc": 1692129673.0,
      "score": 38,
      "context": []
    },
    {
      "id": "jwcd9el",
      "author": "cornrebeca",
      "body": "yes it’s so annoying to see those videos where most people have tiny dinners like a glass of milk or something like that. it’s so unnecessary to show to the world that you’re undereating",
      "created_utc": 1692134979.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jwcghgk",
      "author": "BedroomImpossible124",
      "body": "Married for 30 years here.  My sisters and I call it \"we're sick of cooking for our husbands every night dinner\". Been saying it for years. Of course it does appeal to my ED but the intent is purely non ED. It's been a running joke btwn of for long time. But yeah, this trend is triggering.",
      "created_utc": 1692136204.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jwccy16",
      "author": "cutiepie538",
      "body": "I HATE IT. especially because sometimes I do have a really hard time coming up with full meals and yeah sure, sometimes my dinner is a few uncrustables and some fruit and cheese and crackers or whatever. But those are my struggle *struggle* days where even throwing that together is a humongous effort. I hate seeing it used as some “oh ha ha we’re all so alike and kooky with our gIrL dInNeRs🤪” \n\nI’m glad I’m not on TikTok much cause seeing that constantly would trigger the shit outta me. I already have my brain trying to lie to me about how snacks can be a meal, I don’t need to see it plastered everywhere else as some sort of bonding activity 😔",
      "created_utc": 1692134862.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jwbzkf8",
      "author": "sickandcoolgirl",
      "body": "FR this one girl posted herself taking a nap 💀",
      "created_utc": 1692130023.0,
      "score": 25,
      "context": [
        {
          "id": "jwbylis",
          "author": "rott1ng",
          "body": "someone posted ice in a bowl to that audio i hate that trend and its so boring lol",
          "created_utc": 1692129673.0
        }
      ]
    }
  ]
}