{
  "id": "162gwad",
  "subreddit": "fuckeatingdisorders",
  "author": "Valkyria99",
  "created_utc": 1693111519.0,
  "title": "Edanonym/ous is ABSOLUTELY pro ana.",
  "selftext": "I’ve been in that subreddit for more than a year and can 100% say that it’s full of people who don’t want to get better. Now that I’m in recovery it’s super triggering so I just left.\n\nI made a post talking about how proud I am for eating more and how I don’t care about this disease anymore and was downvoted to DEATH. Literally packed my things and left after that lmao.\n\nTo me that subreddit is like a really bad doctor you see in recovery, who tells you thing like “extreme hunger is a myth” and “honour it by eating ONLY fruits and shit” , doesn’t help you, makes your recovery even harder and longer and takes a shit lot of your time for nothing.\n\nWhen my mind was super sick and fully into this disorder, that place was like a safe haven, I wasn’t browsing it to help me get better but to “normalise” my ed and make a joke out of it with stupid memes. I can understand that it’s a place to cope, I was coping with it too, but to see posts like “what’s your favourite safe food?” And “I love the feeling of hunger” or something trending every day? Now that I’m in recovery I can clearly see how sick it is. \nAnd can I just add that it’s a super fat phobic place too? \n\n\nIt’s a subreddit for people to glorify their disease. The worst thing is that there’s a lot of underage people there that are still developing their body, thinking that that mindset is normal,\nPlease if you are serious about this disorder NOT consuming you stay as far away as you can.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/162gwad/edanonymous_is_absolutely_pro_ana/",
  "score": 155,
  "num_comments": 22,
  "comments": [
    {
      "id": "jxx6atz",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1693111520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jxxiz53",
      "author": "criesofalonelyfairy",
      "body": "when i was deep into my ed, i used to spend HOURS scrolling through that sub to further my eating disorder,,,",
      "created_utc": 1693120710.0,
      "score": 47,
      "context": []
    },
    {
      "id": "jxxak5m",
      "author": "None",
      "body": "Yeah honestly. I joined it when I was struggling really bad earlier this year after relapsing and am doing a lot better now and with the better cognitive function I can see how messed up a lot of stuff on there is. It seemed comforting at the time but it was really just making my ED feel normal and not like a serious mental health crisis. Been meaning to leave it ty for the reminder.",
      "created_utc": 1693114363.0,
      "score": 42,
      "context": []
    },
    {
      "id": "jxxoman",
      "author": "TrainerAvailable5377",
      "body": "I'm decently active on both communities. Edanon is absolutely not a healthy place\n\nWhen I'm struggling I tend to socially isolate. \n\nI don't think I go there to INTENTIONALLY trigger myself. (Although that is absolutely one of the consequences.)\n\nIm just lonely and feel like I can't relate to normal people.\n\nI know that long term giving that community up is the right call. \n\nI rationalize it by telling myself that if I stopped going there tomorrow id still be struggling but just even more alone.\n\nThe good news is that I finally reached a place where I'm looking for professional help again. \n\nHopefully I'll soon be at a place where I don't keep like I need that community anymore. And I really want the next time I move on from it to be the last time I ever have to",
      "created_utc": 1693125265.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jxxt100",
      "author": "yeof",
      "body": "the one thing it's good for to me is some posts are so bad they make me realize that i never want to end up like that/let it take over to that point. and i don't mean those people deserve it in any way, i really hope they get the help they need but they really do serve as a reality check sometimes",
      "created_utc": 1693128800.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jxzznyi",
      "author": "CD-ROM-schublade",
      "body": "Half the people in there will have some sort of triggering thing in their dsc too…like no one cares that you’re underweight. Shut up.",
      "created_utc": 1693166040.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jxzx6jd",
      "author": "irgendyemand",
      "body": "i think whats the worst is that the sub doesn't seem so bad at first glance. like edtwt you can easially tell at a glance that they are proana. but with ed anonymous there are still good posts, it's just hidden by the mountain of garbage posted there aswell",
      "created_utc": 1693165009.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jxz6s26",
      "author": "Hedgehognoodle",
      "body": "Idk if it's because my mentality has improved but I feel like that sub is worse lately. It shouldn't be so taboo to tell people, you know, facts. Like I'm sorry if the reality that low restriction is a terrible strategy for staying thin long term is hard to hear, or that actually people don't care *that* much about your weight and you're not going to be magically popular and desired at X BMI is uncomfortable but that's reality. And yeah, so many people who are basically kids having their most disordered thoughts encouraged by people old enough to know better. I still think it should be allowed to exist though, there's far worse out there",
      "created_utc": 1693154571.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jxxttxd",
      "author": "kristkakes",
      "body": "It's a sub for those that are sick and need validation that staying sick and *harm reducition/quasi* are doing their best and it's valid and enough.\n\nIt's a sub to play victim to their disorder because they're not interested in recovery. They're not interested in getting to the root of their disorder and would rather avoid life by using their disorder to cope.\n\nIt's a sub where sick people stay sick and *compare/compete* with other sick people on who is the sicker.\n\nMisery loves company.",
      "created_utc": 1693129458.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jxy8y8t",
      "author": "emptyhellebore",
      "body": "I once got downvoted to hell and moderated for linking to a study that showed that the person I was replying to was wrong about something.  I wasn’t being supportive by bringing up facts. \n\nIt’s really unfortunate, but I’m glad you stepped away.  This is a great step towards better health.",
      "created_utc": 1693139995.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jxxcm9r",
      "author": "Sareeee48",
      "body": "EDAnonymous and I are **e n e m i e s** lmao.\n\nBut no seriously, it’s a nightmare there. The second you mention extreme hunger or being above a “hEaLtHy/NoRmAl” BMI there’s someone there to explain to you why engaging in behaviors is in your best insterest. It’s so weird because like… why do you care how other people recover so much?\n\nI understand wanting a place to vent about your mental illness, but that sub is not well moderated and the rules are extremely lax. You don’t need to be a recovery focused sub, but there is little to no intervention from the mods regarding blatantly pro-ED and fatphobic content. It’s disgusting, quite frankly, and I honestly think they are just as bad as subs like >!fatlogic!< when it comes to how they treat fat people and justify behaviors.",
      "created_utc": 1693115834.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jxy0d3w",
      "author": "Slow_Technology2945",
      "body": "Thanks for posting this! I’m relatively new to both subs because I didn’t want to get involved with ED subreddits until I felt far enough away from the initial slog of recovery to be of use. When they came up in my feed, I didn’t always check which sub it is before replying but the past couple of days I’ve realised I will be doing and I think I will actually leave that sub. I do want to pass what I’ve learnt on so hopefully people don’t stay stuck for as long as I was but I think that’s only useful when someone is open to accepting things like extreme hunger, Minnesota, setpoints being higher than the ED wants etc. \n\nIf I can summarise it, I think there’s a lot of wanting to be able to pick and choose certain ED behaviours rather than understanding they all have to go. It’s a hard place to be and I’m not qualified to help someone get out of it.\n\nThanks again for posting this and prompting me to think through what’s been making me uneasy!",
      "created_utc": 1693134581.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jxy51mb",
      "author": "lunarlyplutonic",
      "body": "1000000000% I have been downvoted so much there for commenting anti-ED stuff. The comments are never removed, and no one says anything agreeing with me. Yet their sub rules are to not post pro-ED content. I feel sorry for those people and I actually credit that subreddit for being part of the reason to get better. I was tight-roping between committing to recovery and engaging in restriction and reading so much of it made me realize how sick I could *become* and what I was doing that was still feeding the ED.",
      "created_utc": 1693137694.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jxyozzy",
      "author": "strawberry_poptart2",
      "body": "I’m in recovery and also struggling in recovery. That sub makes me feel understood when I am engaging in behaviors but doesn’t make me want to recover or fix them. It’s a place to feel understood but not recovery oriented.",
      "created_utc": 1693147557.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jxxtxb4",
      "author": "cbbss",
      "body": "Agreed, when I see people from here post on it or other pro ana /weight related subs yet claiming they’re in recovery, it rubs me the wrong way and I honestly feel bad for them.\nEds are so malicious and the ability to blind people from seeing the truth is awful. My rule is to avoid most ed/weight associated subs. I tend to even skip a lot of posts on here because sometimes it’s falling down the proana hole. But anyway. \n\nI wish all of you a great real recovery, this shit is hard but we’ll get there eventually 💕",
      "created_utc": 1693129537.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jxxaxvt",
      "author": "None",
      "body": "What freaked me out the most is how many young people there are on there. It’s just not safe to have an un filtered mix of young people and older people with EDs as the younger people will look up to the older ones and copy the things that they say/do",
      "created_utc": 1693114628.0,
      "score": 19,
      "context": [
        {
          "id": "jxxak5m",
          "author": "None",
          "body": "Yeah honestly. I joined it when I was struggling really bad earlier this year after relapsing and am doing a lot better now and with the better cognitive function I can see how messed up a lot of stuff on there is. It seemed comforting at the time but it was really just making my ED feel normal and not like a serious mental health crisis. Been meaning to leave it ty for the reminder.",
          "created_utc": 1693114363.0
        }
      ]
    },
    {
      "id": "jxxtm5q",
      "author": "Valkyria99",
      "body": "I completely understand. It was like a safe place for me to cope with the fact that I’m not ready to recover yet. I think that if you are not in the right mindset and not motivated to recover it won’t happen successfully and that’s why I’ve been through two relapses this past year. But this time I can absolutely say that my mind is 100% serious about this third recovery try, so I finally left that community. Which felt super weird because it was a place I spent a lot of time daily, a big step into recovery is leaving the triggers behind and to me that community was a big trigger. Wishing you good luck! Admitting that you need professional help is a big step that I just recently took as well.",
      "created_utc": 1693129283.0,
      "score": 5,
      "context": [
        {
          "id": "jxxoman",
          "author": "TrainerAvailable5377",
          "body": "I'm decently active on both communities. Edanon is absolutely not a healthy place\n\nWhen I'm struggling I tend to socially isolate. \n\nI don't think I go there to INTENTIONALLY trigger myself. (Although that is absolutely one of the consequences.)\n\nIm just lonely and feel like I can't relate to normal people.\n\nI know that long term giving that community up is the right call. \n\nI rationalize it by telling myself that if I stopped going there tomorrow id still be struggling but just even more alone.\n\nThe good news is that I finally reached a place where I'm looking for professional help again. \n\nHopefully I'll soon be at a place where I don't keep like I need that community anymore. And I really want the next time I move on from it to be the last time I ever have to",
          "created_utc": 1693125265.0
        }
      ]
    },
    {
      "id": "jxzxev9",
      "author": "irgendyemand",
      "body": "i do sometimes post there but like, idk i don't feel good about it.\n\ni do post on the meme forum tho, just beacause i like to cope with memes and sadly there isn't any other ed meme sub i know of",
      "created_utc": 1693165109.0,
      "score": 3,
      "context": [
        {
          "id": "jxzx6jd",
          "author": "irgendyemand",
          "body": "i think whats the worst is that the sub doesn't seem so bad at first glance. like edtwt you can easially tell at a glance that they are proana. but with ed anonymous there are still good posts, it's just hidden by the mountain of garbage posted there aswell",
          "created_utc": 1693165009.0
        }
      ]
    },
    {
      "id": "l0otmuo",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1713754270.0,
      "score": 0,
      "context": [
        {
          "id": "jxxcm9r",
          "author": "Sareeee48",
          "body": "EDAnonymous and I are **e n e m i e s** lmao.\n\nBut no seriously, it’s a nightmare there. The second you mention extreme hunger or being above a “hEaLtHy/NoRmAl” BMI there’s someone there to explain to you why engaging in behaviors is in your best insterest. It’s so weird because like… why do you care how other people recover so much?\n\nI understand wanting a place to vent about your mental illness, but that sub is not well moderated and the rules are extremely lax. You don’t need to be a recovery focused sub, but there is little to no intervention from the mods regarding blatantly pro-ED and fatphobic content. It’s disgusting, quite frankly, and I honestly think they are just as bad as subs like >!fatlogic!< when it comes to how they treat fat people and justify behaviors.",
          "created_utc": 1693115834.0
        }
      ]
    },
    {
      "id": "l0ouuo5",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 3 (No fatphobia). Please contact the mods if you have any doubts.\n\nUh, yeah no being fat doesn’t automatically make you unhealthy, sorry.",
      "created_utc": 1713754841.0,
      "score": 1,
      "context": [
        {
          "id": "jxxcm9r",
          "author": "Sareeee48",
          "body": "EDAnonymous and I are **e n e m i e s** lmao.\n\nBut no seriously, it’s a nightmare there. The second you mention extreme hunger or being above a “hEaLtHy/NoRmAl” BMI there’s someone there to explain to you why engaging in behaviors is in your best insterest. It’s so weird because like… why do you care how other people recover so much?\n\nI understand wanting a place to vent about your mental illness, but that sub is not well moderated and the rules are extremely lax. You don’t need to be a recovery focused sub, but there is little to no intervention from the mods regarding blatantly pro-ED and fatphobic content. It’s disgusting, quite frankly, and I honestly think they are just as bad as subs like >!fatlogic!< when it comes to how they treat fat people and justify behaviors.",
          "created_utc": 1693115834.0
        },
        {
          "id": "l0otmuo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1713754270.0
        }
      ]
    }
  ]
}