{
  "id": "16ae1je",
  "subreddit": "fuckeatingdisorders",
  "author": "Valkyria99",
  "created_utc": 1693887678.0,
  "title": "EDs are immeasurably embraced in modern society.",
  "selftext": "To the point where most people don’t even realise they have some kind of that disorder. \n\nThe definition of an ED is \"a mental disorder defined by abnormal eating behaviors that negatively affect a person's physical or mental health.\"\nWhich basically implies that to have an eating disorder you need to let food control your life and everyday activities in some capacity. \n\nWhile I’m in recovery I’ve really opened my eyes in the enormous amount of dietary comments and thoughts a regular person you will meet has. Most of my friends will always make a comment about “punishing themselves by eating less next week” because we just ate what society considers as “unhealthy”. A childhood friend of mine started going to the gym a year ago and completely changed, he now won’t eat chocolate or “junk food” unless it’s dark chocolate because he considers it more “healthy”, he is at the gym 7 days a week and becomes depressed when he can’t go, constantly body checks his gains and just last week made a comment about how “he would be extremely fat by eating this if he didn’t go to the gym frequently” which is just plainly wrong, right?\n\nMy aunt came by some days ago and didn’t want to have a bite of the dessert my mother prepared because “it’s gonna make her fat” and “she’s been slacking off this past week”\n\nHow are comments like that NOT considered  disordered? How are these same people talking to me about my ED (which I now admit that I have) but can’t see the reality of their own minds? \n\nHow can they even question how I developed a thing like that when those comments are what I constantly hear since a baby. Literally since I was born, the first thing you comment about a baby is their appearance “oh how beautiful she is!”.\n\nI don’t think I should say this but battling this disorder for a year made me appreciate food so much more, and am actually glad that I see now the real consequences of a dietary culture, I just will NEVER make comments like that ever again, I will never see food as something bad, I will enjoy a fruit and a cookie the same exact way. Because it’s just not worth it.\n\nbut how can you recover in a world where everything will literally trigger you?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/16ae1je/eds_are_immeasurably_embraced_in_modern_society/",
  "score": 125,
  "num_comments": 12,
  "comments": [
    {
      "id": "jz6vr8x",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1693887678.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz6zd2q",
      "author": "Rare_Gap_2495",
      "body": "It’s maddening that the normalization of EDs has led to such fear mongering and health anxiety. So many misinformed people form echo chambers of competitive disordered tendencies where certain foods and food rituals are antagonized to the point that people w EDs and mental health issues live in fear of having permanently damaged their bodies.",
      "created_utc": 1693889835.0,
      "score": 49,
      "context": []
    },
    {
      "id": "jz80o2x",
      "author": "Racacooonie",
      "body": "Diet culture is rampant and the line between it and disordered eating is beyond blurred.  It's no wonder we have such a hard time admitting we need help, eh?  Doesn't everyone need help?!  Kind feels like it, most of the time.",
      "created_utc": 1693916106.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jz8a7fy",
      "author": "thesquishsquash",
      "body": "‘Our society has its own eating disorder’ was something my first dietitian said to me that really stuck.",
      "created_utc": 1693919985.0,
      "score": 21,
      "context": []
    },
    {
      "id": "jz760qj",
      "author": "Puzzleheaded-Log1434",
      "body": "Completely maddening. Dealing with my coworkers around the new year in the breakdown room made me eat in a separate area. All they talked about was losing weight and their new diets and myfitnesspal and tracking calories. They are all significantly smaller than me. I gained weight in recovery and it's hard not to want to jump on that bandwagon. It happens every year. \n\nThey don't even realize how disordered they sound when they talk about cutting out x and only eating y calories per day. It's exhausting. \n\nThis honestly goes doubly for my body building coworkers because everyone only sees them as the epitome of health. They are so disordered in my mind. \n\nThen again, I see an eating disorder in everyone because of my own experiences.",
      "created_utc": 1693894289.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jz7q1j0",
      "author": "lintuski",
      "body": "It’s highly normalised, and it’s also seen as morally correct. It’s the ‘right’ thing to do and say. Most people seem being or becoming fat as the worst thing that could happen to them.",
      "created_utc": 1693909850.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jzc06oq",
      "author": "Spirited_Mulberry568",
      "body": "Yes. Adding to this is the notion of “always grinding”. It’s disheartening to see people adopt exercise bulimia and encourage it as “being a beast” or “unstoppable”.\n\n Battling for over 20 years on and off - the real “beast” is listening to your body, being a loving human being, and focusing on what you truly enjoy out of life IMO",
      "created_utc": 1693971489.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jz94d59",
      "author": "None",
      "body": "I’m 25 and I’m currently dealing with an eating disorder. I really don’t want to be this way so I’m seeking help ❤️",
      "created_utc": 1693930797.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jzaahug",
      "author": "tabbycatmeoww",
      "body": "I think a lot of it can be disordered thinking around eating more than an eating disorder tbh.",
      "created_utc": 1693946479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz8zcm1",
      "author": "Sareeee48",
      "body": "Wow that is… resounding.",
      "created_utc": 1693929040.0,
      "score": 6,
      "context": [
        {
          "id": "jz8a7fy",
          "author": "thesquishsquash",
          "body": "‘Our society has its own eating disorder’ was something my first dietitian said to me that really stuck.",
          "created_utc": 1693919985.0
        }
      ]
    },
    {
      "id": "jz9mt1i",
      "author": "Canjo_667",
      "body": "Well it’s maybe not the worst thing, but it’s depressing to gain alot of weight and gave it affect your day to day functioning. Speaking from experience.",
      "created_utc": 1693937603.0,
      "score": 2,
      "context": [
        {
          "id": "jz7q1j0",
          "author": "lintuski",
          "body": "It’s highly normalised, and it’s also seen as morally correct. It’s the ‘right’ thing to do and say. Most people seem being or becoming fat as the worst thing that could happen to them.",
          "created_utc": 1693909850.0
        }
      ]
    },
    {
      "id": "jz9pcks",
      "author": "lintuski",
      "body": "Oh same! For sure its hard to deal with.",
      "created_utc": 1693938544.0,
      "score": 2,
      "context": [
        {
          "id": "jz7q1j0",
          "author": "lintuski",
          "body": "It’s highly normalised, and it’s also seen as morally correct. It’s the ‘right’ thing to do and say. Most people seem being or becoming fat as the worst thing that could happen to them.",
          "created_utc": 1693909850.0
        },
        {
          "id": "jz9mt1i",
          "author": "Canjo_667",
          "body": "Well it’s maybe not the worst thing, but it’s depressing to gain alot of weight and gave it affect your day to day functioning. Speaking from experience.",
          "created_utc": 1693937603.0
        }
      ]
    }
  ]
}