{
  "id": "17z8wfi",
  "subreddit": "fuckeatingdisorders",
  "author": "MushuDaChicken",
  "created_utc": 1700432911.0,
  "title": "Guys, we need a lot of food.",
  "selftext": "The title is basically the realization I just had. I’ve been trying to restrict back to “normal amounts” to be able to slowly move into a more healthy routine of eating habits and so on however I’ll be very upfront- it was literal hell. And I’m talking HIGH restricting, basically what a normal person would convine in a day yet I was miserable. The cherry on top of the sundae was the reaction my body had to these few days of seemingly normal amounts however. My hair immediately started falling out like crazy more than before( and it was BAD before) so now I’m here, after a night of honoring all my hunger. For the love of god please, no one here is a special snowflake and your body IS NOT a science experiment. Our bodies are fragile and weak right now and if they’re asking for something, trust me it’s for a reason. And anyway I’m so sick of being hungry to the point of breaking down in tears, or having half of my hair fall out every time I brush it. If that means eating EVERYTHING I truly want and gaining weight, so be it, I’m tired of putting my and others’ mental health at risk. Also I’m stopping my classification for these night eats as ,,binges” because I’ve come to understand they’re FAR from binges. I wish everyone a calm day/night and remember if anyone wants to share or needs support they can always do that under my posts! ❤️",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/17z8wfi/guys_we_need_a_lot_of_food/",
  "score": 103,
  "num_comments": 8,
  "comments": [
    {
      "id": "k9y1bf6",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our new [Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. A FAQ is forthcoming.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1700432911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9y5hce",
      "author": "mykindabook",
      "body": "Thank you for sharing your amazing revelation and I hope you’re reminding yourself of this fact as much as all of us! we deserve recovery. Food freedom. Satiety. Health.\n\nAlso, any amount of restriction = non compatible with recovery! Not during it, not afterwards. Full food freedom is FOR LIFE. ❤️‍🩹",
      "created_utc": 1700434755.0,
      "score": 23,
      "context": []
    },
    {
      "id": "k9yodou",
      "author": "fauxfoxem",
      "body": "This is so real! Thank you for sharing!\n\nI was literally just staring in the mirror wondering when my skin got so glowy and full of life, and it struck me that I’m so used to seeing the dull, dry lifelessness of my ED all over my face and it just isn’t there anymore.\n\nHealing requires food in plentiful amounts. You don’t put a bandaid over a gunshot wound just because the person next to you found it good enough for their paper cut.",
      "created_utc": 1700443491.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ka04rz9",
      "author": "myceliumfriend",
      "body": "YESSS. i spent my first year in 'recovery' worse than ever. i was eating 'like a normal person' and 'intuitive eating' (aka eating tiny bites until i could convince myself my stomach wasn't growling anymore). it was fucking miserable. we need a lot of food to recover, and almost everyone needs more than what we see as 'normal'. even if the smaller portions are truly what average intuitive eaters have, they also have the days where they eat 4 plates of dinner and a full bag of chips - but grazing doesn't get filmed and posted to the platforms many of us are obsessed with.\n\ni'm not a half a cup of oats, 2 slices of bread kinda person. i don't think i'll ever be. healthy for me isn't instagrammable. it's double servings and other people's leftovers. i want a life where i'm not thinking about this. i've seen the light at the end of the tunnel once so it must be possible.",
      "created_utc": 1700478043.0,
      "score": 18,
      "context": []
    },
    {
      "id": "k9y7qfz",
      "author": "Anfie22",
      "body": "Absolute bullseye, this is the jackpot epiphany I hope each and every individual pursuing recovering may also attain.\n\nAll my love to you beautiful person! I'm grabbing my imaginary pom poms to cheer you on all the way!",
      "created_utc": 1700435760.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ka1sinm",
      "author": "Invisibly_Fragile513",
      "body": "Trying to eat ‘normal’ amounts kept me in quasi for years. It also kept me feeling crazy around food and overcome with primal hunger. I knew I wasn’t eating as much as a truly wanted and needed, especially since I was compensating with excessive exercise. I was convinced I was doing the right thing because I was out-eating most normal people, but your body doesn’t care what others eat, only whether you’re eating enough for your body and energy needs!",
      "created_utc": 1700505864.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ka046mv",
      "author": "myceliumfriend",
      "body": "fr... sometimes i feel the guilt of eating a shit ton and then i feel the skin on my face being hella hot and smooth.\n\none time my sister told me i had a 'pretty day'. i did feel kinda cute in mirrors that day bc my face had color and was relaxed instead of anxious and dull. yet i also felt ugly and bloated as hell from eating lots those days. it's one of the best appearance compliments i ever got because it proved to me that i really do look better when i'm fed.",
      "created_utc": 1700477553.0,
      "score": 9,
      "context": [
        {
          "id": "k9yodou",
          "author": "fauxfoxem",
          "body": "This is so real! Thank you for sharing!\n\nI was literally just staring in the mirror wondering when my skin got so glowy and full of life, and it struck me that I’m so used to seeing the dull, dry lifelessness of my ED all over my face and it just isn’t there anymore.\n\nHealing requires food in plentiful amounts. You don’t put a bandaid over a gunshot wound just because the person next to you found it good enough for their paper cut.",
          "created_utc": 1700443491.0
        }
      ]
    },
    {
      "id": "ka081as",
      "author": "MushuDaChicken",
      "body": "So true!! I was trying “intuitive eating” as well until it turned back into telling myself I’m not actually hungry to the point of feeling like shit, and crying when it was actually time to eat (which sucked considering I had made so much progress.) The truth is we need a ton of food, even if it’s tough to accept. I see how much people my age eat and I can only imagine what a starved person would need in comparison to that.",
      "created_utc": 1700480574.0,
      "score": 6,
      "context": [
        {
          "id": "ka04rz9",
          "author": "myceliumfriend",
          "body": "YESSS. i spent my first year in 'recovery' worse than ever. i was eating 'like a normal person' and 'intuitive eating' (aka eating tiny bites until i could convince myself my stomach wasn't growling anymore). it was fucking miserable. we need a lot of food to recover, and almost everyone needs more than what we see as 'normal'. even if the smaller portions are truly what average intuitive eaters have, they also have the days where they eat 4 plates of dinner and a full bag of chips - but grazing doesn't get filmed and posted to the platforms many of us are obsessed with.\n\ni'm not a half a cup of oats, 2 slices of bread kinda person. i don't think i'll ever be. healthy for me isn't instagrammable. it's double servings and other people's leftovers. i want a life where i'm not thinking about this. i've seen the light at the end of the tunnel once so it must be possible.",
          "created_utc": 1700478043.0
        }
      ]
    }
  ]
}