{
  "id": "1bi0j9k",
  "subreddit": "fuckeatingdisorders",
  "author": "sunflowersss3",
  "created_utc": 1710792636.0,
  "title": "Good news: recovery is the best thing you could ever do for yourself. Bad news: you actually have to work for it",
  "selftext": "hey guys! warning: this is long and unstructured, but i think it's worth at least a quick skim. mwah!\n\ni have been recovering for... i wanna say 1 and a half years now? it was a very quick switch for me - i was getting stronger and stronger feelings of wanting to kick ana's booty over a few days, and then, one day, i was writing in my diary, and it just clicked. Yes, I've had lapses, but nothing i couldn't deal with.i'm writing this post for anyone out there who is like younger me - curious about being free of this bitchass illness, but not willing to put in the effort past scrolling through online recovery sites.\n\nhere's the good news:\n\nRecovery is. i dont even know how to say it. it's like someone saying 'here's your life. enjoy.' ed habits pass slowly at first, and then faster and faster like falling sand until suddenly it's been 3 months since you wondered if something had too many calories and 9 months since you actually didnt eat somethibg for fear of its calories and your 'i am sober' app got automatically offloaded because your \"not willingly finding out my weight\" timer is at 1 year 7 months 4 days and at some point you forgot to care about it.\n\ni promise you won't miss it. actually, sometimes i do miss the false euphoria of weight loss and starvation, but that's okay, because now i have real serotonin, generated from time spent with hobbies and tv shows and my friends. i used to love this quote: 'nobody who has ever fully recovered regrets it.'\n\nnow here's the bad news:\n\nit's slow at first. very slow. weight restoration comes fast though - and it can feel like you're doing something wrong to be gaining so much so quickly. the mental, though? that's more work. but there's one secret to helping it along.\n\ncome here, let me whisper it to you.\n\n*eat*\n\nwould a tennis player enter a competition after only having scrolled through the 'tennis' subreddit? would you confidently enter an exam only having watched tiktok study tips, but never having actually studied? would you drive a car after only reading a book on how fun driving is? you get my point. there's no cheat here. practice tennis. use flashcards. take driving lessons. eat.\n\nof course, i'm not saying to cut out the online help. by all means, go for it. my tiktok 'ed recovery' collection with over 120 videos and my pinterest board with \\~500 pins is where i first started seriously considering the idea of recovery. i think i was scrolling this subreddit \\~10 minutes before the recovery switch flipped in my brain. the internet is an amazing tool - but it's just that. a TOOL. 'nothing changes if nothing changes' (or, to put it better 'nothing changes in your life if nothing changes in your actions.')\n\n'but GIRL', i hear the cry, 'HOW do I change my actions? WHAT do i change??'\n\nbesides the obvious (*EAT*), there are a few other bullet points:\n\n-stop weighing yourself. cut it out. vamoosh. i feel no more pull to the scale - i now only use it as a footrest when im trying to take a shit in my parent's bathroom (regular bowel movements!!!! oh, and how couldn't i mention, the anorexia biohazard farts go away too. ikr!)\n\n-unfollow anything even vaguely proana. better yet, delete any accounts dedicated to your ed. just as the internet fished me out of ana, it was also what plunged me in. be slightly critical when finding a new ed-recovery account - it can be a red flag that you're not over your ed if you're active and posting about it every day when you claim to be fully recovered. i can go weeks without thinking more than a passing joke about my anorexia - i can't imagine tying a whole online identity to it now.\n\n-know that recovery is not linear. when i went to japan, i had a week-long relapse. the thin glorification there goes deep. and i regret it SO much. i remember walking through the most glorious food stalls, with the most mouthwateringly tasty smells, and opting for a cup of strawberries for lunch. on the plane home, i was shaking with hunger. i went into the toilet, and when i caught a glimpse of myself in the mirror, i looked myself in the eye, and said 'girly. this is not you. this is not who you are, and it's not who you want to be.' i then found a small pack of mini eggs in my bag and devoured it. recovery is not a straight line upwards.\n\n-celebrate the achievements!!! you wake up at home alone. you could skip breakfast - no-one would know. instead, you pour yourself a juicy bowl of cereal. woop woop! you're walking down the street and smell something tasty, but you're not hungry. you spot the stall it's coming from, and buy yourself it. woop woop! you're beating a MENTAL ILLNESS here. i don't know about the others but in my case, ana is the psychological disorder with the highest mortality rate. and here you are, giving it a double middle finger with a chocolate chip cookie\n\n>this also reminded me. ive heard of a lot of people making thismistake in early recovery. 'intuitive eating' is NOT the same as the 'hunger/fullness' diet. meaning - you don't only eat when you can hear a little grumbling and an empty feeling in your stomach. food is not solely for nutrients, it is for culture, pleasure, friends and family, and sometimes comfort. tell me, when you think of the word 'healthy', do you associate it more with physical health or mental health? when someone says 'make my ~~disgusting~~ delicious ~~pile of mush~~ banana smoothie bowl. It's so healthy, only x calories!!!!' they mean healthy from a physical perspective. from a mental perspective, the healthiness of forcing down glorified mush in hopes it'll shut your hunger up (and, subsequently, make you thinner) is. well. not great. balance is key. it's important to find food that's mentally healthy, and also physically healthy (which DOES NOT equal lower calories. im talking nutrient numbers or whatever here.) in the early stages of recovery (e.g. first year/half year-ish)  i suggest focusing mainly on mental foods. only when you start to feel good and stable should you incorporate gentle nutrition into your mindset. It is also okay to enjoy diet foods - but not because you're substituting them for something else. i love zucchnini noodles, but if i want a pasta, that just won't do.\n\nnow that i've made that list. go do it. \"ohh but i'm not ready!\", \"i don't know how to start\", \"i'm too scared of what others will think of me\", \"what if i end up hating my body?\", \"ahh but i have this trip to the carribean and i've already bought new bikinis and what if my friends judge my body etc etc etc?\". IRRELEVANT. these are all irrelevant points. do you want to recover? do you honestly truly want it? if you want it, i promise it will happen. these points all fade into background noise when considering the fact that if you want it, you have it.\n\nthis got quite long. i mightve forgotten my original point....\n\ni'm trying to think up some good parting words. hmm.\n\nyou and your body are on the same team. remind yourself that. it's you and your body not you vs your body. your body is always doing more right than wrong at any given moment.\n\nalso, this is a weird thing that maybe only worried me, but i was always concerned that if i recovered that i'd be much more bored all the time. for example, whenever school dragged us to some long service, i would happily zone out for the 2+ hours and think about a plate of porridge or something.(this is a true story, one time i actually spent the whole time thinking about pouring honey on porridge. i was perfectly content making calorie calculations for the day, different meal plans depending on how much honey i added, and imagining eating it. i also spent an hour long train ride thinking about a cake slice from starbucks. i was actually walking past starbucks a few months ago, saw this cake slice again that i thought was only sold in america, bought it and ate it. it sucked. if there's one thing i guenienly miss, it's how delicious food tastes when youre starving 24/7.) anyway, i have since found that to be a non-issue. now, i have a whole world of thoughts to have. i can think about crushes, homework, media, current hobbies, OR. wait for it. i can actually focus on what is being said by whoever is on stage. SHOCKERRRRRRRRRR. i can focus on someone talking about something that isnt food or eating disorders??? for a long time? sounds fake.\n\nnow that im thinking about it, that's the best thing about recovery. as the title says, recovery is the best thing you could ever do to yourself, because it opens up a whole WORLD. there's whole countries and people and places and restaurants and hobbies and sights that exist outside of your eating disorder. 'theres a whole world out there, and you just have to look up from your myfitnesspal to see it.' -anonymous (me)\n\nhasta la vista, babes. i know this is all over the place and warning i have not reread it so take this as you will. if anyone manages to make it this far without zoning out imagining eating an apple and has questions i will try my best to answer them.  😘\n\nedit: guys im peeing myself do i tag this as rant or recovery progress",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1bi0j9k/good_news_recovery_is_the_best_thing_you_could/",
  "score": 108,
  "num_comments": 17,
  "comments": [
    {
      "id": "kvh65ca",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1710792636.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvhdwod",
      "author": "Kycb",
      "body": "This was a super well written, motivational and fun read. You should be published, friend.",
      "created_utc": 1710795254.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kvhiede",
      "author": "Nice-Path-4189",
      "body": "thank you for writing this post! I am so proud of you. I am trying to recover but realized how stuck I am, and what you said about nothing changing if your actions don’t change really spoke to me. I get so motivated by other people’s stories and their recovery and feel inspired to recover, but I never act on it. \n\ni love your tools analogy. tools are useless if you don’t pick them up to build or fix something, so that’s what I am going to do. I wish you all the best and hope you know that this post really helped me!",
      "created_utc": 1710796787.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvhm5rk",
      "author": "Landiskew",
      "body": "Thank you for this. Do you have any tips on dealing with the body grief that comes with rapid weight gain in the beginning? I'm just starting recovery and I wasn't underweight to begin with, but I can feel the physical effects. I  don't weigh myself (haven't in weeks). I'm trying to remind myself that my body is healing. Just struggling to keep pressing forward with recovery.",
      "created_utc": 1710798077.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvizlb5",
      "author": "psychadelicphysicist",
      "body": "Anything tip wise for extreme hunger? That’s what terrifies me the most. My mental hunger is so intense I can’t ever imagine not eating 24/7- that’s all I truly want to do.",
      "created_utc": 1710816981.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvq624q",
      "author": "Key-Amount-4249",
      "body": "THANKS DEAR STRANGER! YOU'VE no idea how helpful your post is🙏",
      "created_utc": 1710939859.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvjdjwk",
      "author": "smokyoat",
      "body": "Omg this was so great lol I totally relate to everything you said! I am less than 6 months in but I am absolutely loving recovery ✌️💛",
      "created_utc": 1710824018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvq65w5",
      "author": "Key-Amount-4249",
      "body": "Can you please tell me how to deal with body changes and body checking?",
      "created_utc": 1710939903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvijhrx",
      "author": "IShouldHaveKnocked",
      "body": "You are fabulous and I super super love every word!",
      "created_utc": 1710810458.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kviz63q",
      "author": "Ok-Cryptographer8537",
      "body": "Thank you for writing something so inspiring, motivating, funny, and thoughtful. This really helped me so very much.",
      "created_utc": 1710816795.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvjx3a0",
      "author": "Independent_Ball_581",
      "body": "this was amazingly written thank you so much. words truly cannot explain how reading this made me feel, thank you.",
      "created_utc": 1710838271.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw12m6v",
      "author": "FlyingSheep77",
      "body": "Best thing I read in a while :) I'm over month in recovery. Thoughts are still there, sometimes checking is there, but I one day I was surprised, that I haven't thought about food since morning :D I was immersed in my life fully, not in my thoughts. It's so motivating to keep going. Thank you for this posts, I'm saving it ^^",
      "created_utc": 1711106450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw65e67",
      "author": "None",
      "body": "Thank you! I have been working up the nerve to begin recovery for weeks. This really helps. I'm so proud of you; I know that it wasn't easy at first.❤️",
      "created_utc": 1711181662.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvhmy6d",
      "author": "sunflowersss3",
      "body": "thank you!! i just logged into my old reddit account, saw this sub, and thought 'why not, i'll see if my experiences could help anyone.' have a great day :3",
      "created_utc": 1710798351.0,
      "score": 5,
      "context": [
        {
          "id": "kvhdwod",
          "author": "Kycb",
          "body": "This was a super well written, motivational and fun read. You should be published, friend.",
          "created_utc": 1710795254.0
        }
      ]
    },
    {
      "id": "kvhos5d",
      "author": "sunflowersss3",
      "body": "ahh you have no idea how much this means to me! you're going to make it out, i believe in you :33",
      "created_utc": 1710798995.0,
      "score": 2,
      "context": [
        {
          "id": "kvhiede",
          "author": "Nice-Path-4189",
          "body": "thank you for writing this post! I am so proud of you. I am trying to recover but realized how stuck I am, and what you said about nothing changing if your actions don’t change really spoke to me. I get so motivated by other people’s stories and their recovery and feel inspired to recover, but I never act on it. \n\ni love your tools analogy. tools are useless if you don’t pick them up to build or fix something, so that’s what I am going to do. I wish you all the best and hope you know that this post really helped me!",
          "created_utc": 1710796787.0
        }
      ]
    },
    {
      "id": "kvhs0ur",
      "author": "sunflowersss3",
      "body": "honestly, the initial rapid weight gain might be the hardest part. i honestly don't have many tips except to sit with the discomfort, and remember that, no matter how painful, it will pass. also, what really is the alternative? i see two choices here: grit your teeth and claw your way through the body grief, continuing to eat and gain weight and progress through recovery, knowing that it'll eventually fade to make way for a better life - or go back to your eating disorder. remember that your eating disorder will likely come with it's own body hatred / dysmorphia, so if you stopped 'pressing forward' you would be setting back weeks of progress for... what? a different flavour of not liking your body?\n\nI know it's hard. But you're doing the right thing, TRUST me. youre right that your body is healing - it knows what it's doing, so let it take the reigns for once. By physical effects, i assume you mean looks-wise? because i soo get it. in the first few days, i would cry seeing my body because i didn't want to lose it. in the first few months, my weight went straight to my stomach, and i was quite insecure about how weirdly unproportionate i looked. after a while, though, it redistributed more evenly around my body, and now it looks normal - good, even. my waist looks proportional to my body - even though i wouldve learnt to live with it if it had stayed like it did in the first few months  (and noone mentions how, having an ed while younger can block puberty, and recovery can really rapidly start it again. in those first few months, i went from like an A cup to a D cup. weight gain isnt all bad)\n\nthis got long. i'm getting my period soon and im in a ranting mood, sorry. summary is just to sit with it. remind yourself of how miserable being in a thinner body was, and no matter how bad body grief sucks an ed sucks worse. sometimes i see an old bikini photo of myself, and i just think 'wow. i was probably thinking about food and worrying if i looked skinny enough when this was taken. what a sad life.'\n\n😘",
      "created_utc": 1710800151.0,
      "score": 5,
      "context": [
        {
          "id": "kvhm5rk",
          "author": "Landiskew",
          "body": "Thank you for this. Do you have any tips on dealing with the body grief that comes with rapid weight gain in the beginning? I'm just starting recovery and I wasn't underweight to begin with, but I can feel the physical effects. I  don't weigh myself (haven't in weeks). I'm trying to remind myself that my body is healing. Just struggling to keep pressing forward with recovery.",
          "created_utc": 1710798077.0
        }
      ]
    },
    {
      "id": "kw13ro2",
      "author": "FlyingSheep77",
      "body": "I'm trying to ignore it as much as I can. Sometimes it's not easy, I stress and fall into hole of overthinking. Try not looking in big mirrors, wearing loose clothes. I avoid staring at my body too much while showering. I like to remind myself that pre-ed my body was okay for me. I was like - Why would I worry for my weight? I have different things going on. And I tell myself that I have to grow strong body to be strong. And trust your body. It wants to be fueled. \nAt the beginning you can avoid looking at body changes, but after you get some confidence, you can slowly adjust to your new (better) look. And you'll get used to it. I know, it's hard. But think about plants. They change their shape, right? Humans do to. It's for growth. Have a good day and nice meal ;)",
      "created_utc": 1711107082.0,
      "score": 1,
      "context": [
        {
          "id": "kvq65w5",
          "author": "Key-Amount-4249",
          "body": "Can you please tell me how to deal with body changes and body checking?",
          "created_utc": 1710939903.0
        }
      ]
    }
  ]
}