{
  "id": "1bi8gyp",
  "subreddit": "fuckeatingdisorders",
  "author": "sorcerers_apprentice",
  "created_utc": 1710812426.0,
  "title": "Another person I met in treatment died.",
  "selftext": "And I feel really weird.\n\nI’m not grieving exactly. We weren’t particularly close. I hadn’t spoken to her in a few years.\n\nI’m in recovery, but more and more of the people I knew during the time in my life when I was ill are dying. I’m in my mid-20s, and so were they. I shouldn’t have dead friends.\n\nI feel simultaneously lucky to have escaped this and sad that so many people haven’t. I don’t want to keep watching this happen.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1bi8gyp/another_person_i_met_in_treatment_died/",
  "score": 87,
  "num_comments": 4,
  "comments": [
    {
      "id": "kvioi3b",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1710812427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kviq0ms",
      "author": "Cokezerowh0re",
      "body": "I’m so sorry hun 🫶 I’m glad you chose recovery❤️",
      "created_utc": 1710813027.0,
      "score": 27,
      "context": []
    },
    {
      "id": "kvk6d3u",
      "author": "largerandbrighter",
      "body": "I’m in the same boat. I also wasn’t particularly close with these people, but it still hits. It’s sad. I am experiencing survivor’s guilt too but am practicing being grateful that I’m making it. I’m glad you’re continuing to choose recovery ❤️",
      "created_utc": 1710845004.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvlvd8e",
      "author": "ventulicola",
      "body": ")))): sending hugs if you would like them. of herbs and altars talks about this, how in normally late 20s/early 30s people's bodies just start giving up, like stop being able to handle the cumulative stress and damage of disordered behaviours. it's horrible to watch - and i'm just saying that seeing deaths on social media, i can't imagine what it's like when it's people you know/knew personally. \n\nit can feel lucky that you're ok, but also it is worth remembering you did this yourself - chose recovery and managed to keep yourself safer as a result). i'm glad you did and still do ❤️",
      "created_utc": 1710869424.0,
      "score": 5,
      "context": []
    }
  ]
}