{
  "id": "1cw5b35",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1716173133.0,
  "title": "A meal is whatever the fuck you want it to be",
  "selftext": "Someone said earlier that banana bread isn’t a meal. I’m sorry, but who the fuck died and made you the arbiter of what is and isn’t a meal? If you want banana bread for dinner, then eat the fucking banana bread. Just make sure you’re actually satisfying your hunger if you do so.\n\nA meal is whatever the fuck you want it to be. Sometimes, a thing of hostess donuts and a latte is a breakfast for me. And nine times out of ten, lunch and/or dinner is a snack platter because I have ADHD and cannot commit to “balanced meals.” I certainly did not follow the logic behind such a term in my own recovery—am I less recovered, less healthy, because I ate what and when I wanted rather than sticking to a specific number of carbs, protein, and fats for each meal? Why does it matter if I was satisfied at the end of the day?\n\nNot to mention not everyone has the luxury of meeting whatever the fuck defines a balanced meal, anyway. Health is *also* a privilege for many. Let’s not ignore these things.\n\nThis isn’t to say that if you want a protein, carb, and fat source with every meal you’re doing something wrong—one or the main takeaways of recovery is to eat how you want and learn to listen to your body to the best of your ability. There is no wrong answer as long as you are challenging yourself and learning to listen to your body’s needs and, yes, even its wants (once more, to the best of your ability).\n\nWe need to keep in mind that in early recovery especially, the body tends to lean more towards sugary/carb-heavy foods because they are quickly digested into energy the body *desperately* needs for repairs. And that is *okay*. Again, that doesn’t mean eating other foods is discouraged (no food source should be outright discouraged, assuming it is safe for you to consume—i.e., allergies, intolerances, certain health conditions, etc.), but for fuck’s sake if someone is eating a lot of sugar or carb heavy foods, the last thing they need to hear is “Xyz isn’t a meal. Eat more balanced.”\n\nThe entire point is to unlearn harmful beliefs and ideals regarding food. For many of us, in early recovery at the *very* least, “balance” is a synonym for restriction and control rather than a form of gentle nutrition. \n\nThanks for coming to my latest TED Talk.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1cw5b35/a_meal_is_whatever_the_fuck_you_want_it_to_be/",
  "score": 204,
  "num_comments": 32,
  "comments": [
    {
      "id": "l4tomo4",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1716173133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4u0m57",
      "author": "ForestRagamuffin",
      "body": "THANK YOU. i've been seeing a ton of comments lately about eating \"balanced\" meals during recovery and like, let's be real that's just restriction",
      "created_utc": 1716179359.0,
      "score": 65,
      "context": []
    },
    {
      "id": "l4u60m4",
      "author": "coolgirl2244",
      "body": "Thank you !!!!!\nAll I wanted was some goddamn banana bread after restricting for years and recovery is different for everyone! Considering my “balanced” meals have always lead to an obsession over nutrition and  relapses, I’m currently focusing on breaking those food rules\nThis post has made my day, you are a beautiful human",
      "created_utc": 1716182723.0,
      "score": 44,
      "context": []
    },
    {
      "id": "l4ugmtp",
      "author": "peppysociopath",
      "body": "The really funny thing about the whole banana bread thing is that it... DOES have carbs AND fats and even a little fiber and protein. In the context of a variety of foods generally, there's zero reason you couldn't have a meal of banana bread if it makes ya fuckin happy.",
      "created_utc": 1716190267.0,
      "score": 17,
      "context": []
    },
    {
      "id": "l4ur0u6",
      "author": "school-is-a-bitch",
      "body": "I literally hate when people are like \"that's not a meal, you need to add more/less\" stop policing my food 😭😭 people dont realize that when i was in a deep relapse my safe foods were NOTHING except monster energy, so to even eat a little thing now takes so much mental work",
      "created_utc": 1716198418.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l4uhp41",
      "author": "160306",
      "body": "i saw two insta reels that really struck me\n\nthe first one said that airports are the place where social rules regarding meals dont really apply. wanna eat icecream for breakfast? go ahead! want pizza as your midnight snack? do that! but it got me thinking, why dont we just do that everywhere if its so cool doing that at an airport?\n\nthe other one was a vegan tiktoker posting her wiead (very problematic format if you ask me but anyway) and she ate cookies, chocolate and other stuff but no \"actual meals\" and everyone shamed her for it but i was like??? even if she ate like this everyday why do you care???\n\nso just eat whenever, whatever. \nim autistic so i dont really get social rules as much anyway so ive always been distant to this but my ed taught me how to avoid certain food at specific times. unlearning that rn 🫶🏻",
      "created_utc": 1716191088.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l4u78ux",
      "author": "None",
      "body": "Preach! Convenience and comfort over whatever ‘perfect’ ‘healthy’ notion of eating. No need to put certain foods on a pedestal. All foods are good foods.",
      "created_utc": 1716183536.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l4vlf8x",
      "author": "Training_Mastodon_33",
      "body": "Exactly! Throughout history people have eaten whatever they could get their hands on at the time. Bread as a meal was probably the reality for most of my ancestors... throw some bananas in it who cares?",
      "created_utc": 1716214361.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l4vmcsy",
      "author": "ImOnlyHereForTheSims",
      "body": "Thank you for this. The part that says the body tends to lean more towards sugary/carb-heavy foods because they are quickly digested into the body desperately needs for repairs has made me feel so much better. You have no idea how much I needed to read that today.",
      "created_utc": 1716214728.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l4uhl2m",
      "author": "None",
      "body": "100000%💞💞💞💞💞💞",
      "created_utc": 1716191002.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l4uyyne",
      "author": "MB_Number5",
      "body": "YES, and everyone gave such great answers here!\n\nI'm all for a good, healthy, balanced meal, but sometimes a slice of banana bread or whatever is the best you can do (for either practical reasons or personal reasons), and that is FINE. I feel like my therapist gets on my case at times when it's really uncalled for.\n\nFor instance, it's a long trip (about two or three hours depending on the connections) to therapy and back, it involves a lot of changing to different buses, and eating is not allowed on the bus. Therapy happens to end around 11 usually, and I'll be home around 2 or 3 which means that having an actual lunch is quite a challange on that day. So sometimes I'll just eat two or three date bars for \"lunch\", because that's the only nutricious thing I can shove down between buses. Then when I get home I might have something more, but then it's not lunchtime anymore, so \"I should have eaten that around 12\". \\*eyeroll\\*\n\n  \nEDIT: My therapist is really very nice, it's just that this bothers me sometimes. Because life happens, and we can only do the best we can.",
      "created_utc": 1716203814.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l4uzerb",
      "author": "ImpressionTall5644",
      "body": "Can’t agree more! Also can people get the fck out of other people’s plates (and bodies and diets etc) and stfu ;) just mind your own business and don’t spread you “healthy lifestyle” diet culture bs :) thx bye ;)",
      "created_utc": 1716204081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l4w6hnl",
      "author": "kdawg94",
      "body": "Preach 🙌🙌🙌 If I'm going through it and I eat some banana bread, that's something I'd cry of happiness about later. That's a win.",
      "created_utc": 1716222149.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l4uqyq8",
      "author": "Neither-Egg-6536",
      "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
      "created_utc": 1716198374.0,
      "score": 5,
      "context": []
    },
    {
      "id": "la6xgup",
      "author": "lumpy_space_queenie",
      "body": "MIC DROP especially the last paragraph I feel so seen. I wish everyone saw food this way.",
      "created_utc": 1719315781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4uctjf",
      "author": "Scared-Film1053",
      "body": "Someone got up on the wrong foot...",
      "created_utc": 1716187431.0,
      "score": -8,
      "context": []
    },
    {
      "id": "l4u899d",
      "author": "havana_ooh_na_na",
      "body": "What if you’re ADDING to your meals instead of subtracting? \n\nI’m kind of in recovery right now and I let myself eat more and I try to make meals/ snacks more balanced e.g. if I make pizza I’ll eat it with a chicken salad, and make sure every meal has carbs, fats, fibre and protein. \n\nIs that still restriction? I don’t think so…",
      "created_utc": 1716184210.0,
      "score": 19,
      "context": [
        {
          "id": "l4u0m57",
          "author": "ForestRagamuffin",
          "body": "THANK YOU. i've been seeing a ton of comments lately about eating \"balanced\" meals during recovery and like, let's be real that's just restriction",
          "created_utc": 1716179359.0
        }
      ]
    },
    {
      "id": "l4u723i",
      "author": "Sareeee48",
      "body": "The comments on that post got me ✨heated✨, like I will fight anyone who says banana bread isn’t a meal!\n\nIn all seriousness though, I’m sorry you had to see those shitty comments. It was definitely inappropriate and unsolicited.",
      "created_utc": 1716183414.0,
      "score": 27,
      "context": [
        {
          "id": "l4u60m4",
          "author": "coolgirl2244",
          "body": "Thank you !!!!!\nAll I wanted was some goddamn banana bread after restricting for years and recovery is different for everyone! Considering my “balanced” meals have always lead to an obsession over nutrition and  relapses, I’m currently focusing on breaking those food rules\nThis post has made my day, you are a beautiful human",
          "created_utc": 1716182723.0
        }
      ]
    },
    {
      "id": "l4vqrwt",
      "author": "Future-Membership133",
      "body": "This makes my heart smile 😊❤️‍🩹❤️\nThank goodness for people who get it and there are a lot more than ones who are clueless.",
      "created_utc": 1716216425.0,
      "score": 6,
      "context": [
        {
          "id": "l4u60m4",
          "author": "coolgirl2244",
          "body": "Thank you !!!!!\nAll I wanted was some goddamn banana bread after restricting for years and recovery is different for everyone! Considering my “balanced” meals have always lead to an obsession over nutrition and  relapses, I’m currently focusing on breaking those food rules\nThis post has made my day, you are a beautiful human",
          "created_utc": 1716182723.0
        }
      ]
    },
    {
      "id": "l4vizop",
      "author": "Sareeee48",
      "body": "Okay but it’s not about whether we have a difference in opinion. A difference in opinion doesn’t mean you get to go on someone’s post and tell them that banana bread isn’t a complete meal and they should try for more balanced meals. Additionally, you don’t really get to decide what someone else’s body needs—you don’t know what it needs and you shouldn’t pretend to know more than their own body. You only know what *your* body needs. Personally, my body *didn’t* need a lot of protein, it needed a lot of carbs and sugars, as well as fat in any form. Not to mention that I still met my protein needs eating what I wanted, when I wanted in spite of not having what would be considered a complete meal. All food has macronutrients. If I’m trying to force my body to have what it doesn’t want, then how was I supposed to learn to trust it? \n\n*Again*, if you want to eat “balanced meals,” which is extremely nuanced and vague at best, then you are free to do so, there is absolutely nothing wrong with that. But why come on here and make people feel bad for doing something different than you? It’s wholly unnecessary. Just don’t say anything if you disagree or have a different approach to recovery, at least in the context of how you think they should be doing things.\n\nEdit: considering your post history, I can see where your current perspective stems from. You’re definitely free to have those opinions regarding food and your body, but we are not going to agree on this and therefore I’m not in the business of arguing, have a good day.",
      "created_utc": 1716213390.0,
      "score": 8,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        }
      ]
    },
    {
      "id": "l4ute0l",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1716200174.0,
      "score": 4,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        }
      ]
    },
    {
      "id": "l4us7on",
      "author": "Neither-Egg-6536",
      "body": "One resource I think is awesome is the R.E.A.L. food pyramid for recovery.",
      "created_utc": 1716199323.0,
      "score": 1,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        }
      ]
    },
    {
      "id": "l4vneaa",
      "author": "Sareeee48",
      "body": "Lmao how so?",
      "created_utc": 1716215133.0,
      "score": 5,
      "context": [
        {
          "id": "l4uctjf",
          "author": "Scared-Film1053",
          "body": "Someone got up on the wrong foot...",
          "created_utc": 1716187431.0
        }
      ]
    },
    {
      "id": "l4ur4k2",
      "author": "school-is-a-bitch",
      "body": "it's \"someone got up on the wrong side of bed\" 😭😭",
      "created_utc": 1716198497.0,
      "score": 5,
      "context": [
        {
          "id": "l4uctjf",
          "author": "Scared-Film1053",
          "body": "Someone got up on the wrong foot...",
          "created_utc": 1716187431.0
        }
      ]
    },
    {
      "id": "l4ugf1a",
      "author": "peppysociopath",
      "body": "While it's great that you're taking steps to make sure your meals have all of those things, it's important to remember that not everyone is dealing with the same EDs or at the same place in recovery.\n\nWhen people are first starting out, it can be a huge burden to convince yourself to eat ANYTHING, much less making sure your meals are nutritionally complete. It's important to remember that no food is bad, and encourage the idea that food > no food.",
      "created_utc": 1716190100.0,
      "score": 29,
      "context": [
        {
          "id": "l4u0m57",
          "author": "ForestRagamuffin",
          "body": "THANK YOU. i've been seeing a ton of comments lately about eating \"balanced\" meals during recovery and like, let's be real that's just restriction",
          "created_utc": 1716179359.0
        },
        {
          "id": "l4u899d",
          "author": "havana_ooh_na_na",
          "body": "What if you’re ADDING to your meals instead of subtracting? \n\nI’m kind of in recovery right now and I let myself eat more and I try to make meals/ snacks more balanced e.g. if I make pizza I’ll eat it with a chicken salad, and make sure every meal has carbs, fats, fibre and protein. \n\nIs that still restriction? I don’t think so…",
          "created_utc": 1716184210.0
        }
      ]
    },
    {
      "id": "l4utoje",
      "author": "Neither-Egg-6536",
      "body": "I saw something that I really liked that said the true enemy of disordered eating is normal eating. Not too drastic in any direction. Just standard ways of eating, although obviously more overall intake in early recovery",
      "created_utc": 1716200382.0,
      "score": 6,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        },
        {
          "id": "l4ute0l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716200174.0
        }
      ]
    },
    {
      "id": "l4vke83",
      "author": "Sareeee48",
      "body": ">Yes, meals are social constructs, but also they are there for a reason.\n\nBeing there for a reason ≠ they are always helpful all of the time. It’s very ableist to assume everyone can and should follow these social expectations to eat meals. Not everyone has the financial luxury. Not everyone is neurotypical. Etc., etc., etc.\n\nIf eating what you would consider to be proper meals helped you in your recovery—that’s great! Everyone is different and *should* do what works for them. But why go out of your way to say that no one should be shaming others for how they eat, then proceed to suggest that eating what and when you want isn’t forming a healthy relationship with food?",
      "created_utc": 1716213951.0,
      "score": 5,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        },
        {
          "id": "l4ute0l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716200174.0
        }
      ]
    },
    {
      "id": "l4v89ht",
      "author": "Scared-Film1053",
      "body": "Maybe in NA. I'm a europoor.",
      "created_utc": 1716208697.0,
      "score": -1,
      "context": [
        {
          "id": "l4uctjf",
          "author": "Scared-Film1053",
          "body": "Someone got up on the wrong foot...",
          "created_utc": 1716187431.0
        },
        {
          "id": "l4ur4k2",
          "author": "school-is-a-bitch",
          "body": "it's \"someone got up on the wrong side of bed\" 😭😭",
          "created_utc": 1716198497.0
        }
      ]
    },
    {
      "id": "l4xtklo",
      "author": "Jolly_Map680",
      "body": "Yeah absolutely you make a very valid point. I guess my intention was more to question the decision, but looking back I can see how it was shaming in some ways, so I am sorry about that. Truly wish you the best, and also hard agree that the boyfriend is incredibly problematic!!",
      "created_utc": 1716243428.0,
      "score": 2,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        },
        {
          "id": "l4ute0l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716200174.0
        },
        {
          "id": "l4vke83",
          "author": "Sareeee48",
          "body": ">Yes, meals are social constructs, but also they are there for a reason.\n\nBeing there for a reason ≠ they are always helpful all of the time. It’s very ableist to assume everyone can and should follow these social expectations to eat meals. Not everyone has the financial luxury. Not everyone is neurotypical. Etc., etc., etc.\n\nIf eating what you would consider to be proper meals helped you in your recovery—that’s great! Everyone is different and *should* do what works for them. But why go out of your way to say that no one should be shaming others for how they eat, then proceed to suggest that eating what and when you want isn’t forming a healthy relationship with food?",
          "created_utc": 1716213951.0
        }
      ]
    },
    {
      "id": "l4x7ssd",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1716235375.0,
      "score": 0,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        },
        {
          "id": "l4ute0l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716200174.0
        },
        {
          "id": "l4vke83",
          "author": "Sareeee48",
          "body": ">Yes, meals are social constructs, but also they are there for a reason.\n\nBeing there for a reason ≠ they are always helpful all of the time. It’s very ableist to assume everyone can and should follow these social expectations to eat meals. Not everyone has the financial luxury. Not everyone is neurotypical. Etc., etc., etc.\n\nIf eating what you would consider to be proper meals helped you in your recovery—that’s great! Everyone is different and *should* do what works for them. But why go out of your way to say that no one should be shaming others for how they eat, then proceed to suggest that eating what and when you want isn’t forming a healthy relationship with food?",
          "created_utc": 1716213951.0
        }
      ]
    },
    {
      "id": "l4xb3q4",
      "author": "Sareeee48",
      "body": "If you don’t see how OP’s boyfriend commenting about what they should or shouldn’t be eating is problematic and not conducive to their recovery, then idk what to tell you. He also has zero right to decide what is and isn’t a meal just as anyone else here, especially when he has already made it clear that he would rather OP *not* gain weight. Oof.",
      "created_utc": 1716236562.0,
      "score": 4,
      "context": [
        {
          "id": "l4uqyq8",
          "author": "Neither-Egg-6536",
          "body": "Firstly, I will say that I hope the mod team will entertain the perspective of someone who slightly disagrees with them, as this is supposed to be a safe space for everyone to share their thoughts. With that being said, I feel this is a more nuanced topic than is being conveyed. In eating disorder recovery, the body needs a lot of things to do repairs. It needs lots of carbs and fats and sugars. It also needs proteins, vitamins, and micronutrients. Another important thing, in my opinion, is to ‘normalize’ eating patterns. I think there is some value in making sure that some more nutrient dense foods are being consumed regularly, to provide the body the building blocks to do what it needs to. Do I think banana bread can be a meal? Sure. But do I think that it may be a better option to have with something alongside it? Also yes. I know this will not be a popular perspective but I have found it important in my recovery efforts.",
          "created_utc": 1716198374.0
        },
        {
          "id": "l4ute0l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716200174.0
        },
        {
          "id": "l4vke83",
          "author": "Sareeee48",
          "body": ">Yes, meals are social constructs, but also they are there for a reason.\n\nBeing there for a reason ≠ they are always helpful all of the time. It’s very ableist to assume everyone can and should follow these social expectations to eat meals. Not everyone has the financial luxury. Not everyone is neurotypical. Etc., etc., etc.\n\nIf eating what you would consider to be proper meals helped you in your recovery—that’s great! Everyone is different and *should* do what works for them. But why go out of your way to say that no one should be shaming others for how they eat, then proceed to suggest that eating what and when you want isn’t forming a healthy relationship with food?",
          "created_utc": 1716213951.0
        },
        {
          "id": "l4x7ssd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1716235375.0
        }
      ]
    }
  ]
}