{
  "id": "1d9ynxf",
  "subreddit": "fuckeatingdisorders",
  "author": "busted3000",
  "created_utc": 1717723196.0,
  "title": "State of the Sub",
  "selftext": "This is not a post we wanted to have to make, but we really need to talk about the levels of hostility towards us a mod team we have been receiving lately.\n\nIf you have questions about a rule/why your post was removed then you can just ask us, kindly and respectfully. We are always willing to clarify our decisions, and help you repost in a way that adheres to our rules.\n\nIf we’ve made a post/comment you disagree with you can bring that up to us, kindly and respectfully.\n\nWe have a very large community and as such we have rules designed to keep everyone safe. You need to follow the rules even if you don’t see the point of them, this is becoming particularly ridiculous with the no weight numbers rule. I don’t care if you said ‘TW’ at the top of your post, I don’t care if you put a spoiler bar over it, 👏stop👏posting👏your👏goddamn👏weight👏. We will be starting to issue temp bans for violating this rule as it’s becoming egregious. \n\nWe also attract a lot of vile trolls due to both the size and nature of our sub, as such we have spam filters in place to auto-remove comments from new accounts. This is for everyone’s safety, and that trumps the convenience of having your comments approved immediately, just report the bot reply and we will approve your comment as soon as we can.\n\nWe understand that eating disorders are frustrating as all hell, but we aren’t your punching bags on which you can take out that frustration. We are only 3 mods for a community 35,000 strong. We simply can’t see everything in this sub immediately, and we really need you to be patient with us.\n\nIt’s disappointing to have to remind people of this, but we’re human, and we’re also recovering from an eating disorder just the same as all of you. All we ask is that you treat us with kindness, respect, and patience. We don’t deserve to be insulted for having lives outside the sub (unless y’all wanna start paying us lmao), we don’t deserve to be blamed for your mental health, we don’t deserve to be blamed for your relapse, we don’t deserve dedicated hate posts about us, we don’t deserve death threats. We are striving to create a safe, welcoming community for everyone, not a safe, welcoming community for everyone *except* the mod team.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1d9ynxf/state_of_the_sub/",
  "score": 136,
  "num_comments": 28,
  "comments": [
    {
      "id": "l7gomsi",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1717723196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hwirz",
      "author": "callmedylanelliot",
      "body": ">I don’t care if you said ‘TW’ at the top of your post, I don’t care if you put a spoiler bar over it, 👏stop👏posting👏your👏goddamn👏weight👏.\n\nI want to thank you guys for actually enforcing this rule. What you have created here is really amazing compared to other online pro-recovery spaces - less toxic, less stuck in a quasi recovery mindset. Still, dealing with the thoughtless and sometimes outright nasty posts comments that do pop up must be exhausting.",
      "created_utc": 1717746073.0,
      "score": 86,
      "context": []
    },
    {
      "id": "l7hrbkr",
      "author": "pathologicalprotest",
      "body": "I’m sorry y’all are getting flack. It should be self-evident why the rules are in place. Thanks for your time and labour, mods, I luv u",
      "created_utc": 1717742532.0,
      "score": 30,
      "context": []
    },
    {
      "id": "l7hhuyl",
      "author": "mykindabook",
      "body": "Anything to stop the terrible trolls and unnecessarily triggering posts. Lots of respect to you mods!",
      "created_utc": 1717736727.0,
      "score": 18,
      "context": []
    },
    {
      "id": "l7hlotm",
      "author": "survivorwannabella",
      "body": "thx for creating safe space for us 🙏🏼",
      "created_utc": 1717738980.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7gt5wb",
      "author": "Parking_Pineapple440",
      "body": "Thank you for what you all do here and dedicating time to keep this space safe. Big hugs.",
      "created_utc": 1717725047.0,
      "score": 42,
      "context": []
    },
    {
      "id": "l7gziph",
      "author": "IShouldHaveKnocked",
      "body": "I appreciate the work you all put into this subreddit. It’s a thankless job, but keeping the creeps and the harmful posts at bay is so important. Thank you!",
      "created_utc": 1717727677.0,
      "score": 23,
      "context": []
    },
    {
      "id": "l7j1w38",
      "author": "None",
      "body": "I appreciate you all. If I didn't have this place to vent and ask for help/advice or clarifications, I can't imagine how much worse off my mental health would've been during the recovery process. Heck, if it weren't for this subreddit I wouldn't have learned what EH is when my body started going through it and I was able to get an ED specialist/dietician ASAP because of it and get my health of track. Thank you for providing this space that feels like the ED safe haven.",
      "created_utc": 1717768547.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l7gytn8",
      "author": "None",
      "body": "Thank you mods, I love this community, and I am so happy for the protections in place! \n\nA good rule of thumb I had to learn abt online etiquette is “would I want my name attached to this?/would I speak to someone like this irl?” \nIf you’re reading this, pls feel free to adopt!",
      "created_utc": 1717727385.0,
      "score": 25,
      "context": []
    },
    {
      "id": "l7hqlrr",
      "author": "Commodore_Kangaroo",
      "body": "My recovery would not be the same (or maybe would not even still exist) without this sub. And I am sure that’s because this sub has been a safe place to come and not feel alone. That is due to the hard and diligent work of the mod team. Thanks for all you do. I cannot believe you all get such shit.",
      "created_utc": 1717742062.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l7i0suv",
      "author": "LostRedKitten",
      "body": "Thank you mod team, this subreddit has been really helpful with my recovery and it wouldn't be that way without you. Thank you for keeping this space a place where I (and everyone else) can feel safe <3",
      "created_utc": 1717749167.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7i5wvx",
      "author": "Luckyme58",
      "body": "You do an amazing job mods: I'm sorry you had to write this post- especially re death threats.  Thank-you so much for all the work you do to make this a safe space.  Sending you lots of light and hugs.",
      "created_utc": 1717752883.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7i5abp",
      "author": "the_nerdy_ginger",
      "body": "Thank you so much, you’re an amazing group of people and you are really doing god’s work. This sub has helped me so much, and no one deserves more love and appreciation than you guys do for creating this sanctuary 💙",
      "created_utc": 1717752427.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7jyq6o",
      "author": "ChickieD",
      "body": "❤️",
      "created_utc": 1717779770.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7me3pz",
      "author": "Minute_Drawer7777",
      "body": "this sub is healing, others, itself, and myself. thank you for creating such a safe place, i’m sorry you have to deal with all the bs that comes through. i appreciate you all!!! thank you mods!!! 🤍🤍",
      "created_utc": 1717812989.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7iqtkj",
      "author": "Misayumi",
      "body": "So sidenote. Would you like to have more mods because I'm happy to help out",
      "created_utc": 1717764256.0,
      "score": 4,
      "context": []
    },
    {
      "id": "la7mp3i",
      "author": "lovefarewell",
      "body": "thank y'all for your vigilance around the rules of this sub. I'm so sorry that this was a post that needed to be made. patience & understanding should be a part of the way we all communicate.",
      "created_utc": 1719326259.0,
      "score": 2,
      "context": []
    },
    {
      "id": "laauc80",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1719366505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc6463s",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1720432301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljimtqw",
      "author": "sacredlemonade",
      "body": "Why does this sub get trolls? I feel like this would be the one place free of trolls due to the nature of the sub",
      "created_utc": 1724403575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7iyqxz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1717767398.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m2k0amd",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1734469830.0,
      "score": -2,
      "context": []
    },
    {
      "id": "l7tgx5o",
      "author": "Sareeee48",
      "body": "We have been considering expanding the mod team for awhile, it’s more just finding the time for the interview process, as well as finding someone who fits the criteria (I.e., agrees with what we’re trying to do on the sub while also adding to the diversity of the mod team so we can better support our members). We will of course keep everyone updated if/when we do decide to add more mods!",
      "created_utc": 1717943053.0,
      "score": 3,
      "context": [
        {
          "id": "l7iqtkj",
          "author": "Misayumi",
          "body": "So sidenote. Would you like to have more mods because I'm happy to help out",
          "created_utc": 1717764256.0
        }
      ]
    },
    {
      "id": "laavrbp",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nWe can see the record of any mod actions associated with an account and we have never removed any posts or comments from you. If this was a previous account you used then we can take a look and clarify our removal reasons if you provide the account name.",
      "created_utc": 1719367072.0,
      "score": 2,
      "context": [
        {
          "id": "laauc80",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1719366505.0
        }
      ]
    },
    {
      "id": "laaw6tg",
      "author": "Sareeee48",
      "body": "1. Clarifying something wasn’t right is still inappropriate on a sub that focuses on recovery. I said what I said. Note that pro-ED content, as per the rule, falls under descriptions of behaviors as well, which is likely why the post was removed. Posts are subject to moderators’ discretion, and while you don’t have to like it you do have to adhere to *that* rule as well as we all have different viewpoints on what breaks a rule here.\n\n2. We, the only three active mods on this sub, have lives outside of Reddit and do not owe you a response in a given timeframe. We are busy, and yet we do this for free, with zero expectations of acknowledgement outside of basically human decency. If we didn’t respond when you wanted us to then idk what to tell you other than to be patience and/or shoot us another message in modmail. We have 35k members and growing—sometimes it takes us several hours, or even days, to see something.\n\n3. You clearly just want to be mad and while you have a right to your feelings, you don’t actually want a discussion so we will not be engaging in this. If you would like to have a civil conversation in modmail, we will be happy to discuss whatever it is that is bothering you. Have a wonderful day.",
      "created_utc": 1719367242.0,
      "score": 2,
      "context": [
        {
          "id": "laauc80",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1719366505.0
        }
      ]
    },
    {
      "id": "lc69p81",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 13 (No research/survey posts or comments). We no longer allow research studies in our community. Please contact the mods via modmail if you have questions.",
      "created_utc": 1720435866.0,
      "score": 1,
      "context": [
        {
          "id": "lc6463s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1720432301.0
        }
      ]
    },
    {
      "id": "ljinacr",
      "author": "busted3000",
      "body": "Unfortunately trolls just want a reaction, they don’t care if they hurt people so they don’t avoid subs like this",
      "created_utc": 1724403876.0,
      "score": 1,
      "context": [
        {
          "id": "ljimtqw",
          "author": "sacredlemonade",
          "body": "Why does this sub get trolls? I feel like this would be the one place free of trolls due to the nature of the sub",
          "created_utc": 1724403575.0
        }
      ]
    },
    {
      "id": "l7j1u97",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nDid you actually read the post? It’s okay if you don’t like this sub, there’s many others and some people prefer those for a variety of reasons. You don’t have to love our sub, you just have to treat us with respect and kindness. If you disagree with something we say you can discuss that with us respectfully, rather than what you did here.",
      "created_utc": 1717768529.0,
      "score": 5,
      "context": [
        {
          "id": "l7iyqxz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1717767398.0
        }
      ]
    },
    {
      "id": "m2keva4",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking rule 7 (No drama). Please contact the mods if you have any doubts.\n\nYou already addressed your concerns in modmail; you don’t need to make a comment about it on a months old post.",
      "created_utc": 1734474531.0,
      "score": 2,
      "context": [
        {
          "id": "m2k0amd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734469830.0
        }
      ]
    }
  ]
}