{
  "id": "1ej5r31",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1722698201.0,
  "title": "Yall gotta stop posting every damn thing you eat in a day—it breaks rule 4.",
  "selftext": "There is absolutely no reason to list every single thing you ate in a day. Especially when many of the posters/commenters that are guilty of this are still restricting and are more concerned with seeking validation (usually a “you didn’t eat too much!” So they can justify continuing this behavior) than whether or not the contents will trigger other members.\n\n**But why does it break rule 4?**\n\nBecause it breeds competition among members, a common behavior among ED sufferers. If one user ate xxxx calories by honoring their extreme hunger or from a reactive eating episode, and saw that another user had, say, two cookies, a few handfuls of granola, a half cup of fat free yogurt and a whole pint of “hEaLtHy” icecream and is freaking out despite the fact they likely still didn’t meet their minimums, it could cause the first user to compare themselves to the other’s intake. Thus it could begin the cycle of feeling guilty or like a failure for eating so much when others are clearly sicker than them (note: they aren’t, that’s just the thought process), and may lead to a relapse or further restriction to prove they’re sick enough.\n\nIs that always the case? No, of course not. But this is **a safe space** and everyone deserves to feel safe here. It is *not* a space to seek validation on your restrictive mindset from members who also need support.\n\n**Note**: I don’t care that you post about a specific food or that you’ve eaten nothing but oatmeal during extreme hunger—I care if you list quantities and possibly calories depending on the context. If you have any questions about this rule, please don’t hesitate to ask and I’ll try my best to clarify! And if you see posts like the ones mentioned here, for the love of god, *please* report them. I’m not always monitoring this sub but I do get notifications for reported posts immediately, and there are two other wonderful active mods who will see to them if I don’t.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1ej5r31/yall_gotta_stop_posting_every_damn_thing_you_eat/",
  "score": 151,
  "num_comments": 7,
  "comments": [
    {
      "id": "lgb61ng",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1722698202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgbdf2z",
      "author": "strawberrymystic",
      "body": "Thank you mods for keeping this space as safe and recovery-focused as possible 🫶💕",
      "created_utc": 1722700710.0,
      "score": 42,
      "context": []
    },
    {
      "id": "lgc0u79",
      "author": "Calm-Cockroach-6940",
      "body": "omg thank you this drives me absolutely fucking mental. i don't need to hear about how you feel so guilty for having a yogurt bowl w a lil extra granola during extreme hunger or how you \"binged\" on a cupcake after dinner, because it makes everyone that's eating more than that feel like shit.",
      "created_utc": 1722708730.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lgbvfjb",
      "author": "dykezilluh",
      "body": "thank you so much for enforcing this, seriously. every other ED-centered \"safe\" space ultimately becomes unsafe and competitive because sick people will do... sick things, and us other sick people see that and rethink our entire disorder, body, intake, etc. i do not trust most ed \"communities\" because there's never any moderation or understanding, just this idea that it's essentially an online diary you get to share with other sick people and breed competition.",
      "created_utc": 1722706873.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lgc6oly",
      "author": "matchacloudcake",
      "body": "thank you, every time i see a post like that i wanna say something but i feel like it’s pointless because so many people feel the need to post every single thing they eat. like they’re looking for reassurance/permission to eat. it’s the type of shit i’d do in semi-recovery, so i get it, but it really needs to stop.",
      "created_utc": 1722710748.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lgdr4fq",
      "author": "axkate",
      "body": "THANK YOU 🙏 I've been sitting out of interacting within this sub for this exact reason!!",
      "created_utc": 1722731368.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lgbo02w",
      "author": "Quirky_Top_8990",
      "body": "I love this sub.",
      "created_utc": 1722704341.0,
      "score": 14,
      "context": [
        {
          "id": "lgbdf2z",
          "author": "strawberrymystic",
          "body": "Thank you mods for keeping this space as safe and recovery-focused as possible 🫶💕",
          "created_utc": 1722700710.0
        }
      ]
    }
  ]
}