{
  "id": "1ew9l4r",
  "subreddit": "fuckeatingdisorders",
  "author": "Resident-Question440",
  "created_utc": 1724092999.0,
  "title": "I'll list all the best parts of losing weight!",
  "selftext": "-body dysmorphia, feeling million times worse about my body, i felt more confident when i weighted more\n\n-intense anxiety, i'm terrified of everything and can't stop worrying\n\n-malnourishment driven compulsions (ocd)\n\n- being angry at my parents 247, turning into a monster\n\n-absolutely dreading waking up because existing becomes so painful\n\n-losing all the hope for a future and not giving a shit about anything, i don't care if i fail my classes and don't get into uni\n\n-isolating from friends because imagine how horrible it would be if i needed to eat my portioned safe foods five minutes away from my schedule!\n\n-fucking awful dissociation, i could accidentally walk under a car and not blink, nothing feels real\n\n-losing your whole personality, people not recognising you mentally\n\n-being freezing cold \n\n-days revolving around food and exercise\n\n-the rituals that take over your whole life and all your freedom\n\n-physical symptoms that you ignore because you kind of wish that they were serious\n\n-being adult and told that you're on your own, wishing you were kid and sent to treatment\n\n-being in such an intense pain that you can only exist by day at a time, the thought of being here in a week makes you want to scream\n\n-every day feels like a pure torture in every way possible\n\n-being in the worst mental pain you've ever been but being so numb you can't let it out so you just turn so angry at everyone and because you don't want to hurt others you end up hurting yourself more and more, it just bottles up to the point of absolute torture\n\nSo yes, keep the ng tiktok dances up and promote relapsing it truly is just as fun as your ed promises!! xxx\n\n\n\n",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1ew9l4r/ill_list_all_the_best_parts_of_losing_weight/",
  "score": 135,
  "num_comments": 11,
  "comments": [
    {
      "id": "liwynnu",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1724092999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lix1mf1",
      "author": "Zoezow",
      "body": "Tysm, I needed this 😭 I’ve been in recovery for about a month by now and it feels like my ed ‘never existed’ and I just made up the bad things because the memories of my ed life feel so distant and now I’m doubting my own mind saying things like “living with the ed wasn’t that bad, I just made it up” (even tho I lost almost everything, including my life) \n\nSo I really needed a reminder of how miserable my life was because of my ed :’3",
      "created_utc": 1724093934.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lix4jy2",
      "author": "LilyGoldberg",
      "body": "im seriously so tired of this illness. im 3 months all in and gained all my life back, yet still i hear this voice saying „you’d rather be thin and have nothing than weight more and have everything”. why? i know thats not even true!! thank you for this post.",
      "created_utc": 1724094863.0,
      "score": 16,
      "context": []
    },
    {
      "id": "liyxage",
      "author": "1in7billion_",
      "body": "REAL!!!!!! I used to never body check obsessively pre-Ed (I was in a bigger body) but my ed made me do that sooooooo much and I obviously weighed a lot less like… where’s the common sense?? FUCK EATING DISORDERS!!! RECOVERY FOR THE WIN!!",
      "created_utc": 1724116549.0,
      "score": 6,
      "context": []
    },
    {
      "id": "liy3vbm",
      "author": "Interesting-Cow8131",
      "body": "Omg why do we have such a strict schedule with eating. !",
      "created_utc": 1724106095.0,
      "score": 5,
      "context": []
    },
    {
      "id": "liy7o0v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1724107389.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lizfhc4",
      "author": "Sorry-Fault1864",
      "body": "Thankyou I’ve recently relapsed after 3 year recovery and really need proof on why I should recover again",
      "created_utc": 1724123317.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lizalpc",
      "author": "monsterintheuniverse",
      "body": "Thank you so much for this 🫕🍝💓",
      "created_utc": 1724121401.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lj06f10",
      "author": "Quirky_Top_8990",
      "body": "Was about to report this- glad I read it properly. 😂",
      "created_utc": 1724137124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lix26s0",
      "author": "Resident-Question440",
      "body": "yes i totally get that and sending a lot of strenght in your way xxx i struggle with that too, that's why i made that post. if i manage to eat 'normally' (a \"cheat day\" just below maintenance wow that's crazy i know) i literally forget that it's an illnes and i'm about to quit therapy because i feel like i'm cured :/ i hate this illness so much",
      "created_utc": 1724094113.0,
      "score": 8,
      "context": [
        {
          "id": "lix1mf1",
          "author": "Zoezow",
          "body": "Tysm, I needed this 😭 I’ve been in recovery for about a month by now and it feels like my ed ‘never existed’ and I just made up the bad things because the memories of my ed life feel so distant and now I’m doubting my own mind saying things like “living with the ed wasn’t that bad, I just made it up” (even tho I lost almost everything, including my life) \n\nSo I really needed a reminder of how miserable my life was because of my ed :’3",
          "created_utc": 1724093934.0
        }
      ]
    },
    {
      "id": "lizacpj",
      "author": "Resident-Question440",
      "body": "me too! i will n e v e r stop talking about the fact that you don't have to be (i'm not) underweight for it to ruin your life",
      "created_utc": 1724121307.0,
      "score": 4,
      "context": [
        {
          "id": "liy7o0v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1724107389.0
        }
      ]
    },
    {
      "id": "lj3pvxn",
      "author": "Disastrous_Egg_2251",
      "body": "Thank you, I’m not underweight and I’m struggling so much to accept recovery without having gotten to that point",
      "created_utc": 1724187039.0,
      "score": 3,
      "context": [
        {
          "id": "liy7o0v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1724107389.0
        },
        {
          "id": "lizacpj",
          "author": "Resident-Question440",
          "body": "me too! i will n e v e r stop talking about the fact that you don't have to be (i'm not) underweight for it to ruin your life",
          "created_utc": 1724121307.0
        }
      ]
    }
  ]
}