{
  "id": "1f59m1v",
  "subreddit": "fuckeatingdisorders",
  "author": "lxstvanillasmile",
  "created_utc": 1725061211.0,
  "title": "My honest advice for recovery as someone who is more or less recovered.",
  "selftext": "While reading this, keep the phrase “Easier said than done” in mind. I’m going to try to keep all of the Healthline Mayo clinic psychobabble buzzwords out of this.\n\n1. I promise you, truly no one gives a damn what you look like.\n\n2. Yes, #SelfLove and #BodyPositivity is great, but also remember that we’re simply just talking about the fleshy outer vessel here, and you can just stop caring.\n\n3. Learning to love the inner self will make learning to love the outer self a hell of a lot easier.\n\n4. Relapses happen. Binges happen. No one is perfect. Move on.\n\n5. “Bad food” is better than no food.\n\n6. 9 times out of 10 (probably even 10 times out of 10), people don’t get an eating disorder just because they want to be thin. Trace back to when you first started sliding down that rabbit hole, and try find the deeper reason.\n\n7. It’s okay if some days you just want to stay in bed and pretend you don’t exist. It doesn’t mean you’re not trying hard enough, it just means you're human.\n\n8. Not everything happens for a reason. Sometimes the world is just fucked up, and you just have to find a way around it.\n\n9. Find new recipes and foods you enjoy eating. Maybe lettuce with sesame sauce really is your favourite dish in the whole wide world, but it wouldn’t hurt to add some variety to your life.\n\n10. Find the humour in everything.\n\n11. Recovery is not going to be an easy road. That doesn’t mean you can’t do it though.\n\n12. In the words of Eleanor Roosevelt, “Every day, do something that scares you.”\n\nThat‘s all. Good luck folks.\n\n",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1f59m1v/my_honest_advice_for_recovery_as_someone_who_is/",
  "score": 134,
  "num_comments": 12,
  "comments": [
    {
      "id": "lkr6lz7",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1725061211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkrcd8j",
      "author": "_AintThatJustTheWay_",
      "body": "I’m struggling pretty hard tonight. This post was a nice reminder. Thank you for sharing",
      "created_utc": 1725063414.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lkrjtv8",
      "author": "None",
      "body": "Thank you for this! I saved this post so I can come back to it on tough days.",
      "created_utc": 1725066344.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lkri9cx",
      "author": "1in7billion_",
      "body": "Ooh I love this one!! It’s so true.",
      "created_utc": 1725065717.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lkrpbtv",
      "author": "NiceGuy1020",
      "body": "Imma follow #10… #9 on this list is funny as shit 😅",
      "created_utc": 1725068594.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lks4q11",
      "author": "appIecinnamon",
      "body": "really needed this, esp 3 and 7 thank U sm for sharing",
      "created_utc": 1725075266.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lku25ts",
      "author": "Minute_Drawer7777",
      "body": "been on number 6 for a while. the brainfog is real but i am determined to get to the bottom of this. wonderful list, super insightful and helpful. thank you! hope you’re having a good day ⛅️🤍",
      "created_utc": 1725113539.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkwukz4",
      "author": "Aggravating_Paint309",
      "body": "I love this. Thank you. 🤍🤍",
      "created_utc": 1725148455.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkxsbwc",
      "author": "vr4gen",
      "body": "agreed 1000%! wish i had seen this before i started recovery, especially 1-5.",
      "created_utc": 1725162409.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkzaz2g",
      "author": "oblomove",
      "body": "thank you. i will screenshot this and read whenever i struggle.",
      "created_utc": 1725194645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llll17g",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1725524993.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llll18m",
      "author": "AutoModerator",
      "body": "This post has been removed because our automoderator detected it as spam. If you believe this action was made in error, please **report** this comment to bring it to the attention of the moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1725524994.0,
      "score": 1,
      "context": [
        {
          "id": "llll17g",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1725524993.0
        }
      ]
    }
  ]
}