{
  "id": "1fha788",
  "subreddit": "fuckeatingdisorders",
  "author": "Decent-Poetry3190",
  "created_utc": 1726399110.0,
  "title": "People don’t understand eating disorders AT ALL",
  "selftext": "I’ve struggled with an eating disorder for the past three years - first purely restrictive, and then/now turning into bulimia. My biggest hurdle in recovery is making sure to eat regularly and consistently to reduce binge urges, and break cycles. Basically, it’s something that’s 99% effective but my brain convinces me otherwise.\n\nMy family are really supportive and after I was discharged from the NHS, and not allowed back when I continued to struggle - paid for private treatment. But, I really really hate that my parents just don’t ‘get’ how eating disorders work. These are just a few of the things they’ve said to me in the past week:\n\n- There should be a buddy system like AA, where people who have recovered support someone struggling. This is a great idea theoretically but in practice is probably really dangerous for the person who’s recovered to be in that headspace\n\n- Saying ‘I don’t want that’ because it’s full of processed junk, I want to eat clean (they’re not orthorexic, but continue to label meals as being ‘healthy’ in front of me)\n\n- My dad doing intermittent fasting to lose weight for high blood pressure. This frustrates me because when I’m around him, he doesn’t have breakfast with me. And, he’s not doing this with the support of a dietician or trainer, he just decided to and I don’t even know if it’s really working because he snacks a lot\n\n- When eating with me (which I find really helpful) they will often just eat half their portion, and leave food because they don’t like it. We went for burgers the other day and my mum only ate half hers, and didn’t understand why it upset me so much\n\nI know they are trying but I know I’m much more mindful with how I talk about food and health around others, and I want them to be too\n\nEDIT: I am 28 for anyone who was assuming I was a child - I know I’m ultimately responsible for my health ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1fha788/people_dont_understand_eating_disorders_at_all/",
  "score": 84,
  "num_comments": 23,
  "comments": [
    {
      "id": "ln89h9y",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1726399110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln8bpr6",
      "author": "FloridaMomm",
      "body": "Have they done any reading or participated in any part of treatment with you? When I was younger I struggled with extreme dieting followed by binging (disordered behavior to be sure but never met diagnostic criteria for an ED. My parents had us do Atkins and South Beach and all kinds of stuff as a family starting when I was in kindergarten). And I had to do a lot of work to unlearn toxic diet culture BS and move toward food neutrality. But even then, when my husband was diagnosed with anorexia I realized I really have **no idea** how eating disorders work. The thought processes he has just make absolutely no sense to my non-ED brain, but educating myself has really helped!",
      "created_utc": 1726400367.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ln8apyz",
      "author": "kqtherines",
      "body": "I totally get you. Unfortunately its really hard to explain why certain stuff triggers or upsets people with EDs to someone who has never had one or hasnt at least experienced disordered thoughts. I wish you all the best and I hope your parents and the people around you understand you soon ❤️",
      "created_utc": 1726399833.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ln9z1wv",
      "author": "Beea282",
      "body": "I’m sorry you’re going through this. I have had problems with my parents as well. What really helped was talking them through the process with my Ed therapist and nutritionist in one meeting. And constantly tell them what I’m working on with them. These meetings happen every few months. It’s not family therapy. It’s educational counseling of Ed for them. If you need more information on this, feel free to message me.",
      "created_utc": 1726420787.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lnayxup",
      "author": "starinspired222",
      "body": "dude the last one is so reallll! i don’t know why it makes me so frustrated!",
      "created_utc": 1726431637.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ln8cpnb",
      "author": "Fubusu",
      "body": "I mean, people get mad at me when i say, \n\n3 square meals a day, enough calories, and healthy support comunitty, \n\nMostly healthy comunitty is the one thing you need deeply, real friends, real parents, and real understanding and support 😭",
      "created_utc": 1726400888.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ln9guhw",
      "author": "CimJotton",
      "body": "Have you tried explaining your concerns / distress? It seems like that is your only course of action.\n\nThey probably legit don't realize how their actions make you feel. It's hard to see them doing it purposely.",
      "created_utc": 1726415007.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lndangi",
      "author": "sweetness331",
      "body": "Maybe some education/resources would be helpful for them?",
      "created_utc": 1726464879.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnphh3v",
      "author": "idkjgmabofc",
      "body": "Peer support is sometimes an option, depending on where you are. Worth reaching out to Beat / seeing what they have on offer if you haven't already as they used to offer this. Provided the recovered person is in a good place and has supervision, it can be really beneficial :)",
      "created_utc": 1726651239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln8yk24",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1726409366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln9sjvz",
      "author": "Great-Direction-6056",
      "body": "This is difficult. And sadly, sometimes I think it's best that our loved ones don't fully understand, even though it's unhelpful... I think the only way someone can really understand an ED is to experience one, or to specialise in it as a career. And I wouldn't want my parents fully understanding if it means they have to suffer through it.\n\nSounds like there's lots of comparisons going on... You comparing your diet and portions with your parents. I understand why, but want to say that it's likely the ED focussing on comparisons. Remember lots of people have disordered eating habits, and no eating disorder. Remember that although normal people may be able to live healthy lives with these bad habits and skewed beliefs, but as someone with an eating disorder, you simply can't. We'd take it to the extreme. Just because we can't, doesn't mean everyone else has to follow the same criteria we do in recovery like it's the only way to be healthy. Some people have bad habits and they are just that, they aren't the same as the extremes we take things while in the midst of an ED. People do things that are unhealthy, and that simply can't be our concern. I found the further I got into recovery, the less I compared in this way... Other people's diets are their issue, and we should only be concerned with what is right for us. Easier said than done, but it gets easier as recovery progresses and the acceptance builds that this is what WE need to do to be healthy.\n\nIntermittent fasting is infuriating and very popular ATM. If his goal is to loose weight for BP, he's certainly not helping. British Heart Foundation very recently published new research to tackle this trend - the study concluded that just one single stint of fasting for 8 hours can dramatically decrease your cardiovascular health and increase cardiovascular disease. That's after one fast! Consider finding this research and sending him a link. Also remember this research for yourself!!!\n\nMy best advice... Try not to battle with them. Your priority battle ATM is fighting the ED, not fighting to change loved ones perspective. If they want to understand more, they'll do more research. My Dad never wanted to understand... I had to accept that challenging his comments or trying to discuss it with him often just opened me up to more triggering comments, more heartache and more struggle. My Mum eventually wanted to understand more, and got research/support for carers signposted to her by professionals, which helped her and our relationship. But I didn't change her perspective and understanding, she was just given the resources and the choice. I would advice not directly challenging dialogue with them regarding ED, especially if it ends up triggering you when you have tried this in the past  Instead, and at most ... Start sending them research, interesting articles, other patients/carers accounts etc. anything you find that you think they'll benefit from reading. I would most certainly focus this on resources specifically for carers, and not for sufferes. What might be helpful for us to read, might be more alienating for them. They'll be more accessible and relatable for them, framed in a way and perspective that they will be able to understand and access, aiding their overall understanding of EDs. If you send resources that are designed for patients, they won't be accessible because they still won't get what it's like. But they do get what it's like having a loved one with an ED. These resources often include advice on what not to say/do, what to say/do. Doing this works well because it's not you giving them the information, it's professionals who have made these resources... There's more legitimacy from the resources that they will be more willing to listen to. As annoying as it is... You're their child (no matter how old you are!) there's a dynamic there that undermines you teaching them anything, let alone something that is so complex to understand. It's likely you alone encouraging them to be more mindful of what they say/do around you will just be shut down or they'll go on the defensive/feel attacked, like we're in some way implying they cause it (even though thats not our intention, and definitely not what we're doing!). Receiving the same advice from experts/professionals in whatever format will just hold more legitimacy for them to accept and act on it. It's stupid, but I suppose that's psychology.\n\nBut most importantly... Remember it's not your job. It's their choice. You can lead a donkey to water, but you can't make it drink. You can give them access to information, but they still might not engage with it. The sad fact of reality is the only person's thoughts, knowledge and perspective we have any sort of control over is our own, and even then that's not always doable. Your main priority is your recovery and health, your own choices...  and there's going to be shit that gets in the way of that or undermines it, but ultimately sometimes all we can do is try and brush it off and carry on. Sometimes the most peaceful route for everyone is these moments is just to walk away and not engage. Try not to let the ED hijack these moments and feelings, keep calm and carry on. Good luck!",
      "created_utc": 1726418702.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ln98erg",
      "author": "Taurus420Spirit",
      "body": "Is that even legal? The NHS refusing to help you and basically forcing you to go private for treatment ?!",
      "created_utc": 1726412460.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ln8dzmw",
      "author": "Quirky_Top_8990",
      "body": "They sound like they have deeply disordered eating habits.",
      "created_utc": 1726401540.0,
      "score": -3,
      "context": []
    },
    {
      "id": "ln92q0a",
      "author": "thicccque",
      "body": "Have you considered FBT?",
      "created_utc": 1726410723.0,
      "score": -3,
      "context": []
    },
    {
      "id": "ln9r239",
      "author": "Decent-Poetry3190",
      "body": "I know they got a free guide from Beat (the main ED charity in the UK) but, even in family therapy, the concept of diet culture was never brought up.",
      "created_utc": 1726418200.0,
      "score": 6,
      "context": [
        {
          "id": "ln8bpr6",
          "author": "FloridaMomm",
          "body": "Have they done any reading or participated in any part of treatment with you? When I was younger I struggled with extreme dieting followed by binging (disordered behavior to be sure but never met diagnostic criteria for an ED. My parents had us do Atkins and South Beach and all kinds of stuff as a family starting when I was in kindergarten). And I had to do a lot of work to unlearn toxic diet culture BS and move toward food neutrality. But even then, when my husband was diagnosed with anorexia I realized I really have **no idea** how eating disorders work. The thought processes he has just make absolutely no sense to my non-ED brain, but educating myself has really helped!",
          "created_utc": 1726400367.0
        }
      ]
    },
    {
      "id": "ln9jxep",
      "author": "Decent-Poetry3190",
      "body": "I explained that I was upset by my parents literally eating half their burger, and both said ‘why do you care so much - have you brought this up with your therapist, and what did they say?’. I didn’t know quite how to explain to them what I was feeling because it sounded stupid in my head. \n\nLook, I’m 28 and am an adult so I know these things shouldn’t upset me so much, but it’s such a fundamental lack of understanding. My parents are both keen to start family therapy, which I agreed to, but I always feel like I’m the issue and they don’t really understand my eating disorder, and often just randomly come up with theories as to why I have one. It’s just a bit frustrating when they clearly do want me to get better.",
      "created_utc": 1726415932.0,
      "score": -2,
      "context": [
        {
          "id": "ln9guhw",
          "author": "CimJotton",
          "body": "Have you tried explaining your concerns / distress? It seems like that is your only course of action.\n\nThey probably legit don't realize how their actions make you feel. It's hard to see them doing it purposely.",
          "created_utc": 1726415007.0
        }
      ]
    },
    {
      "id": "ln954ai",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nSupport is one of the most key factors in recovery. You cannot recover in an environment that promotes your disorder. Please don’t tell members that the way they are influenced by others’ eating habits is a them problem when studies have shown that the development of eating disorders are partially environmental.",
      "created_utc": 1726411481.0,
      "score": 3,
      "context": [
        {
          "id": "ln8yk24",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1726409366.0
        }
      ]
    },
    {
      "id": "ln9qkhi",
      "author": "Decent-Poetry3190",
      "body": "I have no idea, I know it’s against the guidelines. I did get reassessed but was told to come back in 6 months if I was still struggling. It was definitely not in line with guidance which obviously suggests care as quick as possible - but adult ED services are so underfunded and I’m sure there were people more critical than me. I have no intention of ever suing the NHS because the issues it faces are due to Government underfunding rather than negligence.",
      "created_utc": 1726418034.0,
      "score": 3,
      "context": [
        {
          "id": "ln98erg",
          "author": "Taurus420Spirit",
          "body": "Is that even legal? The NHS refusing to help you and basically forcing you to go private for treatment ?!",
          "created_utc": 1726412460.0
        }
      ]
    },
    {
      "id": "ln9qtas",
      "author": "Decent-Poetry3190",
      "body": "Going to start is soon - we’ve had it before but I always found it unnecessary because they literally never talked about my eating disorder and came up with theories that didn’t resonate with me.",
      "created_utc": 1726418116.0,
      "score": 1,
      "context": [
        {
          "id": "ln92q0a",
          "author": "thicccque",
          "body": "Have you considered FBT?",
          "created_utc": 1726410723.0
        }
      ]
    },
    {
      "id": "lnacya9",
      "author": "little_milkee",
      "body": "I have to wonder, is it the lack of understanding or is it the half eaten burger that's bothering you most? because if it's the understanding why you're upset part I feel that's easier to address, but their actual eating habits perhaps less so. \n\nlike, if I knew I upset someone I cared for by eating half a burger I would do my best to understand their perspective and maybe work out a solution that works for us both, but I would not agree to eat the entire burger to make them happy if I did not want to eat an entire burger.",
      "created_utc": 1726424922.0,
      "score": 12,
      "context": [
        {
          "id": "ln9guhw",
          "author": "CimJotton",
          "body": "Have you tried explaining your concerns / distress? It seems like that is your only course of action.\n\nThey probably legit don't realize how their actions make you feel. It's hard to see them doing it purposely.",
          "created_utc": 1726415007.0
        },
        {
          "id": "ln9jxep",
          "author": "Decent-Poetry3190",
          "body": "I explained that I was upset by my parents literally eating half their burger, and both said ‘why do you care so much - have you brought this up with your therapist, and what did they say?’. I didn’t know quite how to explain to them what I was feeling because it sounded stupid in my head. \n\nLook, I’m 28 and am an adult so I know these things shouldn’t upset me so much, but it’s such a fundamental lack of understanding. My parents are both keen to start family therapy, which I agreed to, but I always feel like I’m the issue and they don’t really understand my eating disorder, and often just randomly come up with theories as to why I have one. It’s just a bit frustrating when they clearly do want me to get better.",
          "created_utc": 1726415932.0
        }
      ]
    },
    {
      "id": "ln9tdgj",
      "author": "Taurus420Spirit",
      "body": "I understand what you mean on the latter but you still deserve to be treated. I've only just entered ED services for ARFID for the first time at 29 and my area has a day programme (I tried to push for inpatient and the rude bitch of a psychiatrist basically told me, there are people there that are skinnier in ward and \"I'm not that bad\", that was after she rudely told me I talk too fast and she was struggling to understand me, [I have autism and severe trauma] some staff in ED services are horrible bullies and made me think they are jealous they aren't slim. She was an obsese lady). It's as if we are seen as overdramatic adult babies who are choosing to just want to not eat and they forget we have severe mental health conditions.",
      "created_utc": 1726418975.0,
      "score": -2,
      "context": [
        {
          "id": "ln98erg",
          "author": "Taurus420Spirit",
          "body": "Is that even legal? The NHS refusing to help you and basically forcing you to go private for treatment ?!",
          "created_utc": 1726412460.0
        },
        {
          "id": "ln9qkhi",
          "author": "Decent-Poetry3190",
          "body": "I have no idea, I know it’s against the guidelines. I did get reassessed but was told to come back in 6 months if I was still struggling. It was definitely not in line with guidance which obviously suggests care as quick as possible - but adult ED services are so underfunded and I’m sure there were people more critical than me. I have no intention of ever suing the NHS because the issues it faces are due to Government underfunding rather than negligence.",
          "created_utc": 1726418034.0
        }
      ]
    },
    {
      "id": "ln9r77z",
      "author": "thicccque",
      "body": "Doesn't sound like they'll be useful for it unless they get a change of heart from a specialist then. Tenets of FBT include not trying to figure out what caused the ED in the first place, and family participation in treatment...",
      "created_utc": 1726418248.0,
      "score": 1,
      "context": [
        {
          "id": "ln92q0a",
          "author": "thicccque",
          "body": "Have you considered FBT?",
          "created_utc": 1726410723.0
        },
        {
          "id": "ln9qtas",
          "author": "Decent-Poetry3190",
          "body": "Going to start is soon - we’ve had it before but I always found it unnecessary because they literally never talked about my eating disorder and came up with theories that didn’t resonate with me.",
          "created_utc": 1726418116.0
        }
      ]
    },
    {
      "id": "lnis7qj",
      "author": "yozhik0607",
      "body": "It's a hard situation. I guess if it were me with my child I would not put myself in a situation where I wouldn't eat the whole thing. Like order something I knew I could finish. But that's bc I would be very conscious of their perceptions of my actions. It sounds like OPs parents are missing that consciousness piece. And it can be hard to develop that sense without either personal experience or a lot of professional experience.",
      "created_utc": 1726545463.0,
      "score": 2,
      "context": [
        {
          "id": "ln9guhw",
          "author": "CimJotton",
          "body": "Have you tried explaining your concerns / distress? It seems like that is your only course of action.\n\nThey probably legit don't realize how their actions make you feel. It's hard to see them doing it purposely.",
          "created_utc": 1726415007.0
        },
        {
          "id": "ln9jxep",
          "author": "Decent-Poetry3190",
          "body": "I explained that I was upset by my parents literally eating half their burger, and both said ‘why do you care so much - have you brought this up with your therapist, and what did they say?’. I didn’t know quite how to explain to them what I was feeling because it sounded stupid in my head. \n\nLook, I’m 28 and am an adult so I know these things shouldn’t upset me so much, but it’s such a fundamental lack of understanding. My parents are both keen to start family therapy, which I agreed to, but I always feel like I’m the issue and they don’t really understand my eating disorder, and often just randomly come up with theories as to why I have one. It’s just a bit frustrating when they clearly do want me to get better.",
          "created_utc": 1726415932.0
        },
        {
          "id": "lnacya9",
          "author": "little_milkee",
          "body": "I have to wonder, is it the lack of understanding or is it the half eaten burger that's bothering you most? because if it's the understanding why you're upset part I feel that's easier to address, but their actual eating habits perhaps less so. \n\nlike, if I knew I upset someone I cared for by eating half a burger I would do my best to understand their perspective and maybe work out a solution that works for us both, but I would not agree to eat the entire burger to make them happy if I did not want to eat an entire burger.",
          "created_utc": 1726424922.0
        }
      ]
    },
    {
      "id": "ln9rsmn",
      "author": "Decent-Poetry3190",
      "body": "I hope so - I have had issues in the past with depression and alcohol, but I was very frustrated that the previous ED family therapist did not ever explore my ED at all. My therapist does and validates my feelings but my family (actually just my parents) are slow to acknowledging their views are harmful.",
      "created_utc": 1726418451.0,
      "score": 1,
      "context": [
        {
          "id": "ln92q0a",
          "author": "thicccque",
          "body": "Have you considered FBT?",
          "created_utc": 1726410723.0
        },
        {
          "id": "ln9qtas",
          "author": "Decent-Poetry3190",
          "body": "Going to start is soon - we’ve had it before but I always found it unnecessary because they literally never talked about my eating disorder and came up with theories that didn’t resonate with me.",
          "created_utc": 1726418116.0
        },
        {
          "id": "ln9r77z",
          "author": "thicccque",
          "body": "Doesn't sound like they'll be useful for it unless they get a change of heart from a specialist then. Tenets of FBT include not trying to figure out what caused the ED in the first place, and family participation in treatment...",
          "created_utc": 1726418248.0
        }
      ]
    }
  ]
}