{
  "id": "1fkrn1n",
  "subreddit": "fuckeatingdisorders",
  "author": "untitledgooseshame",
  "created_utc": 1726769696.0,
  "title": "what my nutritionist said to me after i stopped fighting the extreme hunger",
  "selftext": "\"you're not a bottomless pit. you're not the cookie monster. you just weren't eating enough. you're doing great. keep eating those meals!\"",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1fkrn1n/what_my_nutritionist_said_to_me_after_i_stopped/",
  "score": 91,
  "num_comments": 6,
  "comments": [
    {
      "id": "lnxn6up",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1726769696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnycwwa",
      "author": "Life_Command_1313",
      "body": "Smart nutritionist.",
      "created_utc": 1726781419.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lnxzybp",
      "author": "chilacayotes",
      "body": "thanks for sharing this. needed to hear it",
      "created_utc": 1726777339.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lny7gbk",
      "author": "teababyyy",
      "body": "we have no choice but to stan 🫶🏼",
      "created_utc": 1726779681.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lnzq2ne",
      "author": "Ok_Bird_1378",
      "body": "XD I love them",
      "created_utc": 1726799574.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lo2k71m",
      "author": "_AintThatJustTheWay_",
      "body": "Can we share some positive/good/funny advice we're gotten from dieticians?! I feel like so often I see post about clueless ones so it's nice to remember there's some stars out there. The best dietician I had really helped me through my stint with using social media as basically a google search. One time I asked her an insane food question I had seen from a post and she lovingly responded \"what in the tiktok f\\*ckery is that?!\". To this day when I hear someone sharing clearly unfounded social media nutrition nonsense I say this to myself. (and sometimes to whoever said it)",
      "created_utc": 1726848668.0,
      "score": 2,
      "context": []
    }
  ]
}