{
  "id": "1gl4ah8",
  "subreddit": "fuckeatingdisorders",
  "author": "donnadoctor",
  "created_utc": 1730915058.0,
  "title": "Not eating won’t help anything",
  "selftext": "Idk if anyone else needs this reminder today, but I sure do.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1gl4ah8/not_eating_wont_help_anything/",
  "score": 116,
  "num_comments": 7,
  "comments": [
    {
      "id": "lvqz25x",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1730915058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lvrzd6r",
      "author": "Anfie22",
      "body": "Real, it doesn't do shit besides make you feel like shit. Absolutely nothing about your life will change let alone improve for depriving yourself of food, rather the opposite, your health turns to shit and you suffer, all for nothing. Nothing was ever going to come of derailing yourself, you've set a booby trap against yourself and you've walked right into it. What did you benefit of it? You're just crippled on the ground in pain and have to nurse yourself better from the injury of your own trap, against yourself. Mission accomplished? What tf was that even for? What was the purpose of setting up an elaborate sabotage plot that you'd inevitably be hurt by, and only you? Why?",
      "created_utc": 1730924947.0,
      "score": 29,
      "context": []
    },
    {
      "id": "lvr2cdz",
      "author": "None",
      "body": "I wonder where we got this idea that not eating might be a good thing. I can't believe so many people independently came up with the idea of not eating or food limitation.  \nAlso, even if it is some genetic bug of a particular person, no one around raises a red flag when they see a person restricting their food.",
      "created_utc": 1730915939.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lvvctm2",
      "author": "rebeccaexo",
      "body": "Absolutely. My boyfriend always tells me “eating good, not eating bad” which always makes me chuckle",
      "created_utc": 1730971238.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lvrm8v5",
      "author": "None",
      "body": "True.",
      "created_utc": 1730921366.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lvry2xh",
      "author": "meh787",
      "body": "❤️",
      "created_utc": 1730924596.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lw0qm34",
      "author": "thesquishsquash",
      "body": "That’s so sweet 🥲",
      "created_utc": 1731036702.0,
      "score": 2,
      "context": [
        {
          "id": "lvvctm2",
          "author": "rebeccaexo",
          "body": "Absolutely. My boyfriend always tells me “eating good, not eating bad” which always makes me chuckle",
          "created_utc": 1730971238.0
        }
      ]
    }
  ]
}