{
  "id": "1goiw56",
  "subreddit": "fuckeatingdisorders",
  "author": "1in7billion_",
  "created_utc": 1731295831.0,
  "title": "Your ED is a liar",
  "selftext": "No, you won’t gain an infinite amount of weight when recovering. No, you won’t become bed-bound. No, you won’t become ugly. No, you won’t develop BED. No, extreme hunger isn’t forever. No, people won’t stop talking to you because you’re in a larger body (and if they do that’s their loss and something they need to heal within themselves to be so hateful so better for u if that’s the case tbh). No, you won’t be constantly obsessing about how you look, and yes you’ll stop caring so much about how you look. No, you aren’t a failure for going against your ed, nor did you lose self-control. No, you aren’t unhealthy for eating “bad/junk” foods, or more than what’s “acceptable”. And most of all, you won’t be less worthy if you exist in a body that society deems “unacceptable”. You’re already worthy and acceptable. Your body is a vessel that’s there to help you experience life. Ironically, you’ll gain more control when you choose recovery. It’s so unbelievably worth it, even if it doesn’t seem like it right now. I’m not fully recovered and I still have a ways to go, but I’m doing a million times better than when I was deep in my ed, and when I started recovery at the beginning of this year. I hope that with this, I can help at least one person. You’re worthy of help, no matter what weight you are. It isn’t a weight-disorder. You’ve got this ❤️‍🩹",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1goiw56/your_ed_is_a_liar/",
  "score": 116,
  "num_comments": 8,
  "comments": [
    {
      "id": "lwixu1x",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1731295831.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwj1v6n",
      "author": "None",
      "body": "i really needed this today💞",
      "created_utc": 1731297378.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lwjc0dx",
      "author": "salty_peaty",
      "body": "You're so right with this post, thank you for writing this!",
      "created_utc": 1731301696.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lwn32pa",
      "author": "Imaginary_Meaning",
      "body": "Thank you so much",
      "created_utc": 1731358429.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxacw5z",
      "author": "Dazzling-Exchange986",
      "body": "I'm starting recovery tomorrow this was exactly what I needed cuz I lost all my motivation",
      "created_utc": 1731688555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwj3yil",
      "author": "1in7billion_",
      "body": "Glad I can help you :) ❤️‍🩹",
      "created_utc": 1731298224.0,
      "score": 6,
      "context": [
        {
          "id": "lwj1v6n",
          "author": "None",
          "body": "i really needed this today💞",
          "created_utc": 1731297378.0
        }
      ]
    },
    {
      "id": "lwje1gw",
      "author": "1in7billion_",
      "body": "Aww yes of course!! Hoping I can inspire others to choose recovery ❤️‍🩹",
      "created_utc": 1731302685.0,
      "score": 6,
      "context": [
        {
          "id": "lwjc0dx",
          "author": "salty_peaty",
          "body": "You're so right with this post, thank you for writing this!",
          "created_utc": 1731301696.0
        }
      ]
    },
    {
      "id": "lwxiik5",
      "author": "1in7billion_",
      "body": "Of course! 💗",
      "created_utc": 1731512378.0,
      "score": 1,
      "context": [
        {
          "id": "lwn32pa",
          "author": "Imaginary_Meaning",
          "body": "Thank you so much",
          "created_utc": 1731358429.0
        }
      ]
    }
  ]
}