{
  "id": "1gxlpip",
  "subreddit": "fuckeatingdisorders",
  "author": "pcolikm",
  "created_utc": 1732318547.0,
  "title": "I dont miss being skinny",
  "selftext": "Some of the things that i dont miss about my ed:\n\n-Not being able to share a snack with my friends.\nI used to be the person that always brought snacks to the hang out. Giving food to others is one of my love languages. \nBut then i stopped having cool snacks in my backpack. I only had boring stuff that no one wanted to eat. So eventually i stopped bringing food to share, just a measured amount for myself. At the time, while i felt sad and disconnected from others, i also felt a twisted pride in eating \"better\" and less, always comparing myself.\nThose days are long gone, and now when someone invites me to go eat somewhere the only feeling that i get is excitement. I LOVE trying new foods. And when i eat something that i dont like that much, i dont panick bc i \"ate calories for nothing\", i just shrug and move on.\n\n-Being so cold all the time.\nAs someome who LOVES swimming, nothing was more heartbreaking than not being able to swim in the sea that summer because it was too cold for me. Now i can spend hours in the water again.\n\n-Having no fat layer protecting me from impact. I'm always bumping into furniture, and it used to hurt so so much. Now when i bump into a table, the table moves from its place and im left intact.\n\n-Losing hair and getting brittle nails.\nMy bathroom was always covered in my hair and i could tear my nails apart by just lightly pulling them. Now my hair is full and shiny again and my strong nails could claw someone's eyes out.\n\n-Not being able to find clothes that fit me.\nI love thrifting, and it was SO hard to find clothes that actually fit me. But even if i did, i was too insecure to actually wear them. I kept using my larger clothes to hide my \"curves\" (i didnt have any..) and ironically i felt more confident when i looked bigger bc of the multiple layers.\n\n-Feeling apathy towards my loved ones.\nOn my worst days, i thought about my loved ones-my partner, my friends, my family, even my cat- and i felt absolutely nothing. I felt like a horrible person, how could i not care about them?! I felt so numb, unable to fully feel emotions. My number one priority was controling my food intake and my body. I couldn't think about anything else. It was exhausting. And this didn't affect only me. It negatively affected everyone around me, everyone that cared about me. I was selfish, self centered, easily annoyed, too obssessed with myself to notice the world around me.\n\nI like to think that i've improved.  People have noticed positive changes, and i have so too. It's so relaxing to not have an ed anymore. To not worry about such ridiculous things that seemed so important less than a year ago. Now i care about my loved ones, my hobbies.\n\nThese are just some of them that i was thinking about right now. But there's so much more. SO MUCH MORE.\n\n3 months into recovery i would see old pics of me and feel so jealous of that thinner body i used to have. I felt so disgusted at what i looked like, at the \"enormous\" amounts of food i was eating.\nNow, 9 months into recovery, i can only feel sorry for that fragile, anxious small person. I looked empty, colorless, stiff. I look into the mirror now and see myself again. \n\nLike everyone else, i thought i would be the exception. That i would grow and grow forever into this disgusting blob. That i would never go past the extreme hunger phase. But that obviously didn't happen.\nWell, i did get bigger, I am still growing (at a slower rate), but it just doesnt bother me nearly as much. I am overweight, my midsection is even bigger than before my ed, and i feel fine, cute, beautiful even on the good days. I am fat and i am happier than i ever was during that awful year.\nLast week i had the last fear food i had not eaten yet. I felt very proud, but i also didnt think about it for too long. I was at the zoo and there were more interesting things to think about.\n\nThe other day i genuinely craved a salad?! But this time i used the sauce and it was great.\nCrazy that when u honour ur cravings, eventually u dont crave those things anymore.\nI still eat chocolate pretty much everyday, but i feel satisfied with much smaller portions. Sometimes i cant even finish all the chocolate cereal i put on my bowl, or i just forget about it and it gets soggy. And i just.. dont care? I can get more later if i want to.\n\nI know it's too soon to say im recovered. A lot of people even say its impossible to fully recover, that i should be careful to not let those obssessive thoughts control me again. But im feeling very optimistic about my future. I feel whole again. I have space in my heart and mind to care about the people and things that truly matter to me. I am happy.\nI still think about food, about what im gonna eat the next days, not from a place of despair, but with excitement and curiosity.\n\nI know this is a scary journey. It took me months of binge watching recovery content before i actually started eating more. I went \"all in\" but i was still restricting without realizing for a long time. They say it gets worse before it gets better, and its true. But you should focus on the second part. It WILL get better. I promise you. You are stronger than you believe and you will get through this.\nI know you also miss a lot of things you had before you started struggling with this awful thing. And it will be worth it.\n\nI dont even know what i was trying to do with this text. But i hope it helps at least one of you. Watching other people's recovery helped me a lot before, it brought me hope. If anyone wants to know anything about my experience, feel free to ask!! \n\nEdit: typos 😭",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1gxlpip/i_dont_miss_being_skinny/",
  "score": 182,
  "num_comments": 27,
  "comments": [
    {
      "id": "lyhx7tm",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1732318547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyhxrjd",
      "author": "None",
      "body": "i love this. it’s so motivating and i’m so happy for you!!",
      "created_utc": 1732318751.0,
      "score": 30,
      "context": []
    },
    {
      "id": "lyi0iax",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1732319767.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lyicpz8",
      "author": "shield_maiden0910",
      "body": "The relationship apathy is so relatable!! I'm so happy for you. Full recovery is possible and you are doing it!!",
      "created_utc": 1732324384.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lyjg21s",
      "author": "1in7billion_",
      "body": "This is so beautiful. I’m proud of you 💓",
      "created_utc": 1732341684.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lyjh1w5",
      "author": "tokieofrivia",
      "body": "This is something I want to add to my journal tomorrow, thank you so much for the inspiration!❤️ you are strong and wonderful and deserve all the love and happiness the world has to offer!",
      "created_utc": 1732342244.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lyjwuqn",
      "author": "Low-Opposite-3065",
      "body": "Thank you for this. ",
      "created_utc": 1732351978.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyk0naz",
      "author": "Maximum-Flamingo-976",
      "body": "Needed this today, well done and thank you ❤️",
      "created_utc": 1732354495.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lyk48mw",
      "author": "-abby-normal",
      "body": "I am so happy for you and proud of you for overcoming your ED <3",
      "created_utc": 1732356847.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lykegpi",
      "author": "BeginningCell6851",
      "body": "Thank you so much for this...I needed some more motivation to keep going (currently at the beginning stage of recovery) and this is so helpful and motivating..Proud of you! 🫶🏻❤️",
      "created_utc": 1732363111.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyj8z06",
      "author": "anemicstoner",
      "body": "❤️❤️❤️ be so proud of this progress. you seem extremely intelligent",
      "created_utc": 1732338014.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lyl1948",
      "author": "newprofilewhodis1352",
      "body": "After full recovery I feel the same. I don’t miss the layer of hair I grew all over my body, or feeling like I was dying walking up stairs, or not being able to stand for more than two minutes. It took a long long time but once you’re there, physically you feel so much better.",
      "created_utc": 1732373184.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lylgzau",
      "author": "Ejs1983",
      "body": "Love this so much and really needed to read this Thankyou !!",
      "created_utc": 1732378662.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lym2pc9",
      "author": "LameLoserLauren",
      "body": "This is beautiful, and it reminds me of why recovery is so worthwhile (despite being incredibly daunting). Thank you *so* much for this post. Continue enjoying these victories—you’ve earned every one of them!",
      "created_utc": 1732385643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyn2ssm",
      "author": "cl0verblooms",
      "body": "thank you for this post.",
      "created_utc": 1732397445.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lynuy1x",
      "author": "Sacha-Louise",
      "body": "I really, really love that you shared this - thank you so much 🩷 \n\nI’ve battled with anorexia for the last 15 years & due to having had it for so long, there have been many times I’ve lost hope that I’ll ever actually be able to get better. That it will just be the way my life is forever. However, I’m now 5 months into recovery - the first recovery attempt I’ve actually taken super seriously & truly committed to. It’s definitely been hard at times, especially during the first few months but very slowly things are beginning to get a little bit easier. I’m still scared of gaining weight, I’ve accepted it but it still terrifies me. \n\nBUT reading your post has genuinely given me hope about what’s waiting for me on the other side of this & that it’ll all be worth it. Reading what you wrote made me genuinely smile for the first time in a while so I truly thank you & I am so incredibly proud of you 🩷",
      "created_utc": 1732407479.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyteojn",
      "author": "IntergalacticStrudel",
      "body": "this post motivated me to keep recovering, thank you so much for your words <3",
      "created_utc": 1732488659.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzvwz2k",
      "author": "SurpriseAfraid3201",
      "body": "I love this so much. I’m a 15 year old and i really needed this, it made me cry a bit. Thsnk you❤️",
      "created_utc": 1733069148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lykq9a4",
      "author": "JuggaloDoctor",
      "body": "I usually go searching through numerous threads on recovery motivation before feeling satisfied, and somewhat comfortable. Today, however, I read just your post. Even from line two, I felt satisfied. So much so, I got up and got a bowl of cereal to enjoy alongside your writing. Thank you.",
      "created_utc": 1732368814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lyjqraw",
      "author": "Aaaaali786",
      "body": "I’m so proud of you, I get exactly what you mean. I’m 16 now and look at the pics of me at 14 and see someone who was sick and needed help. I was the person who helped little me 💜\n\nI think for me I was “lucky” recovery was easier on me as a teenage boy bc most of eating properly meant that a lot of the weight I gained back was just muscle my body had been waiting to develop bc of having an ED whilst still being in puberty which made the transition a lot easier for me. I look like a strong *man* now, before I looked like an ill little kid.",
      "created_utc": 1732348010.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyhygtj",
      "author": "pcolikm",
      "body": "im glad! thank you <3",
      "created_utc": 1732319013.0,
      "score": 6,
      "context": [
        {
          "id": "lyhxrjd",
          "author": "None",
          "body": "i love this. it’s so motivating and i’m so happy for you!!",
          "created_utc": 1732318751.0
        }
      ]
    },
    {
      "id": "lyi1r8a",
      "author": "pcolikm",
      "body": "Thank you!!! <3 so true!!",
      "created_utc": 1732320234.0,
      "score": 6,
      "context": [
        {
          "id": "lyi0iax",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1732319767.0
        }
      ]
    },
    {
      "id": "lyjwss1",
      "author": "pcolikm",
      "body": "It was the worst thing, i feel human again. Thank you!!!!! i also believe in that <3",
      "created_utc": 1732351942.0,
      "score": 3,
      "context": [
        {
          "id": "lyicpz8",
          "author": "shield_maiden0910",
          "body": "The relationship apathy is so relatable!! I'm so happy for you. Full recovery is possible and you are doing it!!",
          "created_utc": 1732324384.0
        }
      ]
    },
    {
      "id": "lyjwteq",
      "author": "pcolikm",
      "body": "Thank you <3",
      "created_utc": 1732351954.0,
      "score": 3,
      "context": [
        {
          "id": "lyjg21s",
          "author": "1in7billion_",
          "body": "This is so beautiful. I’m proud of you 💓",
          "created_utc": 1732341684.0
        }
      ]
    },
    {
      "id": "lyjwwku",
      "author": "pcolikm",
      "body": "wow i feel honored! Im so happy i inspired someone! Thank you sm <33",
      "created_utc": 1732352012.0,
      "score": 2,
      "context": [
        {
          "id": "lyjh1w5",
          "author": "tokieofrivia",
          "body": "This is something I want to add to my journal tomorrow, thank you so much for the inspiration!❤️ you are strong and wonderful and deserve all the love and happiness the world has to offer!",
          "created_utc": 1732342244.0
        }
      ]
    },
    {
      "id": "lyjxgyy",
      "author": "pcolikm",
      "body": "<3",
      "created_utc": 1732352388.0,
      "score": 4,
      "context": [
        {
          "id": "lyjwuqn",
          "author": "Low-Opposite-3065",
          "body": "Thank you for this. ",
          "created_utc": 1732351978.0
        }
      ]
    },
    {
      "id": "lyjwy0r",
      "author": "pcolikm",
      "body": "that's so sweet!! thank you <33",
      "created_utc": 1732352039.0,
      "score": 3,
      "context": [
        {
          "id": "lyj8z06",
          "author": "anemicstoner",
          "body": "❤️❤️❤️ be so proud of this progress. you seem extremely intelligent",
          "created_utc": 1732338014.0
        }
      ]
    },
    {
      "id": "lyjxaow",
      "author": "pcolikm",
      "body": "Thank you sm!!! I'm so glad you are doing better now! I'm also proud of you for helping yourself!!!",
      "created_utc": 1732352272.0,
      "score": 1,
      "context": [
        {
          "id": "lyjqraw",
          "author": "Aaaaali786",
          "body": "I’m so proud of you, I get exactly what you mean. I’m 16 now and look at the pics of me at 14 and see someone who was sick and needed help. I was the person who helped little me 💜\n\nI think for me I was “lucky” recovery was easier on me as a teenage boy bc most of eating properly meant that a lot of the weight I gained back was just muscle my body had been waiting to develop bc of having an ED whilst still being in puberty which made the transition a lot easier for me. I look like a strong *man* now, before I looked like an ill little kid.",
          "created_utc": 1732348010.0
        }
      ]
    }
  ]
}