{
  "id": "1gz8hmv",
  "subreddit": "fuckeatingdisorders",
  "author": "literarywitch32",
  "created_utc": 1732501829.0,
  "title": "A few holiday reminders from your mods",
  "selftext": "Hello community!\n\nAs we approach the end of the year, we know there are a lot of holidays and traditions that can bring up tough emotions. The mods decided to put together a post with some reminders to support your recovery while participating in the season.\n\n* It is normal to feel stressed about upcoming holiday meals. This can be a super hard time of year for many and you are not alone.\n* Start planning now for how you’re going to cope with stressors. Some ideas include phoning an understanding friend, carving out alone time away from family, journaling, screaming into pillows, and remembering this is just one season, not your whole life.\n* If you can have a trusted support to call back on, ask for help and walk away from situations that are unhelpful.\n* Eat regularly, there is no reason to “save up” for big meals. You also do NOT need to exercise or run a marathon before or after a meal.\n* Even during this season, there are no “naughty” and “nice” foods, you can partake in all your holiday favorites without substitutions or restrictions.\n* If you have a lapse, know that it is not the end of the world. Give yourself grace and remember that tomorrow is a new day.\n* Clothes are made to fit you, wear what makes you comfortable and feel good\n* It’s no one’s business what you put on your plate. If your nosy relative has the audacity to ask about what you’re eating, tell them to kindly kick rocks.\n* Be prepared that we will soon be inundated with messages about New Year’s Resolutions that are rooted in diet culture. Gyms will have membership deals, coworkers will start diets, friends will start fitness journeys, and that’s their business, but you do not need to partake. Just because your coworker is doing whatever the latest fad diet is doesn’t mean you need to do the same. People microwave fish, that doesn’t mean they’re right.\n* Spend time with the ones you love, watch movies, look at lights, make cookies, and leave your ED behind.\n* Take it one day at a time and try to enjoy the magic of the season. Rest, heal, and reinvigorate your desire to recover.\n\nThis subreddit is here to provide support. Use this time to boost each other up and please, please follow the rules. If you see a post or comment breaking the rules, utilize the report button so the mods will see it the next time we check-in. The mods are also in recovery and we have our own challenges this time of year.\n\nWe are grateful for all of you and wish you a safe and healthy holiday season!\n\nYour mod team",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1gz8hmv/a_few_holiday_reminders_from_your_mods/",
  "score": 91,
  "num_comments": 2,
  "comments": [
    {
      "id": "lyueyr4",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1732501829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4flj4g",
      "author": "Odd-County-8182",
      "body": "I love you all ,thank you sm for the reminder ❣️",
      "created_utc": 1735513912.0,
      "score": 2,
      "context": []
    }
  ]
}