{
  "id": "1hfhur6",
  "subreddit": "fuckeatingdisorders",
  "author": "blueberries-Any-kind",
  "created_utc": 1734351527.0,
  "title": "3 years later and body dysmorphia melted away >> A quick tip and ah-ha moment!",
  "selftext": "TLDR at the bottom.\n\nI was diagnosed with anorexia 3 years ago. Middle of pandemic so that stagnated my healing. I was an older diagnosis at 30 years old.\n\nI restored my weight easily, but battled for many years with the fact that my weight was restored. I had have a lot of negative self talk/body dysmorphia that I've tried hard to combat with self love.\n\nAnyways.. something happened the other day. I went on a lovely trip that was busy and full of running around- no time to worry about what I looked like or even look in the mirror. After I got home I spent a few days resting and hanging around the house.\n\nI got dressed on Saturday to go out, and I walked over to the mirror to check my outfit. I was wearing something a little more form fitting (finally getting used to that again).. and for some reason when I looked in the mirror I saw someone completely different than who I had been seeing last week. She was kind of beautiful??? She wasn't a flabby monster?? She actually had a nice body?? I couldn't believe what I was seeing. I was so surprised and excited that the body dysmorphia seemed to be gone for that moment.\n\nI couldn't comprehend what I was seeing or why it happened, but omg did I love it! I weighed myself the next day, (something that is safe for me to do now), and I was the same weight I've been for the last year +.\n\nI started wondering why, and really analyzing if something was different about me. All my clothes fit the same, and I was even on my period that day- so how could I not feel like a bloated monster suddenly?\n\nAs I caught glimpses of myself in reflections during that day, I realized that something WAS different.\n\n**TLDR: When I walked up to check my outfit that morning, I had approached the mirror differently. My eyes were at a different place than usual. For years, maybe the last 20 years- I have been walking up to the mirror with my eyes on my stomach first. This time, for whatever reason, I approached the mirror looking at my shoulders.. and that's when I saw my body differently. I saw my stomach in the context of the rest of my body, and it looks good with the rest of me!**\n\nAfter that, I noticed that any time I walked by any reflection on the street, in a car, even in the oven (ours is up high), I was zeroed in on my stomach at all times! And not just that, I was focused in on any flaws I perceived as I walked by- as if to check if they'd finally changed (lol).\n\nI've experimented over the weekend with continuing to approach the mirror from looking at my shoulders, and it's realllllly impacted the way I see myself. I saw my stomach in the context of the rest of my body for the first time, and you know what? It was fine! It's not flat, but it fits my body, it's beautiful and I love it <3",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1hfhur6/3_years_later_and_body_dysmorphia_melted_away_a/",
  "score": 95,
  "num_comments": 13,
  "comments": [
    {
      "id": "m2bhfjg",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1734351527.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2c3iwa",
      "author": "kafkaesque_xo",
      "body": "so so proud of you<333",
      "created_utc": 1734360815.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m2ckf56",
      "author": "kibirvibir",
      "body": "FIRST OF ALL I AM SO SO SO HAPPY TO READ THIS! Go you!\n\nOh my god I had the same experience after battling this shit for close to 15years!\n\nSomehow this year it clicked. I dont even know how really, but my stomach, which was my biggest insecurity, just looks normal to me now. But I don't look at it nearly as much! Body checking who? Not me! And I have no idea how much I weigh. I think its just good days outweighing the bad days by a large margin.\n\nOnwards and upwards!",
      "created_utc": 1734366492.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m5j0jmp",
      "author": "ampelkuchen",
      "body": "So happy for you!!!",
      "created_utc": 1736088820.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2cp4rz",
      "author": "KillingTime989",
      "body": "Amazing! So pleased for you! 💛",
      "created_utc": 1734367988.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2c4d89",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1734361113.0,
      "score": -18,
      "context": []
    },
    {
      "id": "m2cq9lv",
      "author": "blueberries-Any-kind",
      "body": "wow!!!! That is so fascinating that we had the same experience. It really makes me think that there are some things in healing that many people feel. really happy you've felt this too.\n\nI learned about body checking ages ago, and  it's hard to describe, but I literally didnt even realize I was doing it?!",
      "created_utc": 1734368344.0,
      "score": 5,
      "context": [
        {
          "id": "m2ckf56",
          "author": "kibirvibir",
          "body": "FIRST OF ALL I AM SO SO SO HAPPY TO READ THIS! Go you!\n\nOh my god I had the same experience after battling this shit for close to 15years!\n\nSomehow this year it clicked. I dont even know how really, but my stomach, which was my biggest insecurity, just looks normal to me now. But I don't look at it nearly as much! Body checking who? Not me! And I have no idea how much I weigh. I think its just good days outweighing the bad days by a large margin.\n\nOnwards and upwards!",
          "created_utc": 1734366492.0
        }
      ]
    },
    {
      "id": "m2c8y2a",
      "author": "Jaded-Banana6205",
      "body": "Nothing will work for everyone. That goes without saying.",
      "created_utc": 1734362717.0,
      "score": 15,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        }
      ]
    },
    {
      "id": "m2c98a8",
      "author": "blueberries-Any-kind",
      "body": "Sorry for sharing?  But mindfulness is literally part of the healing process for all.. \n\nI wasn’t trying to say this one thing fixed my body dysmorphia, just an aspect that helped after a lifetime of trauma and ED. \n\nIf you want to fix it at the core obviously you need extensive therapy and dietician help, not just to look in the mirror differently- but after 4 years of therapy 1-3x/week and 3 years of ED recovery some of the smaller midnfulness stuff can be a big difference. ",
      "created_utc": 1734362814.0,
      "score": 14,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        }
      ]
    },
    {
      "id": "m2d1dhp",
      "author": "Independent_Bag_4909",
      "body": "Have a modicum of compassion please.",
      "created_utc": 1734371846.0,
      "score": 7,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        }
      ]
    },
    {
      "id": "m2hl12q",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1734440633.0,
      "score": 0,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        }
      ]
    },
    {
      "id": "m2hfbfj",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1734437942.0,
      "score": 0,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        },
        {
          "id": "m2d1dhp",
          "author": "Independent_Bag_4909",
          "body": "Have a modicum of compassion please.",
          "created_utc": 1734371846.0
        }
      ]
    },
    {
      "id": "m2hl2dy",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1734440649.0,
      "score": 0,
      "context": [
        {
          "id": "m2c4d89",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734361113.0
        },
        {
          "id": "m2d1dhp",
          "author": "Independent_Bag_4909",
          "body": "Have a modicum of compassion please.",
          "created_utc": 1734371846.0
        },
        {
          "id": "m2hfbfj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734437942.0
        }
      ]
    }
  ]
}