{
  "id": "1ht22vw",
  "subreddit": "fuckeatingdisorders",
  "author": "upsilontries",
  "created_utc": 1735951649.0,
  "title": "a reminder about extreme hunger",
  "selftext": "you are not developing bed. i have experienced both \"traditional\" binges and extreme hunger, and trust me, there is a major difference. extreme hunger is insatiable. it's eating a massive restaurant meal and your stomach feeling empty 10 minutes later. it's not being able to be functional in any way since all you can think about is food. it's a body that's essentially been through a famine begging to be fed. \n\nwhen i've binged before developing anorexia, i wasn't out of hunger. it's having a bad day and saying \"fuck it\" and powering your way through a quart of ice cream. it's emotionally driven. i would feel stuffed and sick afterwards, trying to numb any negative feelings i had.\n\nthis is going to sound blunt, but it's what i needed to hear in my recovery. imagine seeing a prisoner of war be freed and finally have access to food after being starved for a period of time. it would be genuinely insane to accuse them of developing bed if they started to eat loads. it's kinda common sense that the body needs a lot of food after being starved. there's a massive deficit to make up for.\n\nit's definitely harder than it sounds, but try to view yourself as you would other's in your situation. be gentle with yourself too, you deserve a break considering what your body has been through.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1ht22vw/a_reminder_about_extreme_hunger/",
  "score": 104,
  "num_comments": 20,
  "comments": [
    {
      "id": "m5a06wt",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1735951650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a5rze",
      "author": "Frosty_Swimming2676",
      "body": "I really appreciate this post. Thank you",
      "created_utc": 1735953574.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m5arjno",
      "author": "ComfortableBox8794",
      "body": "Did you ever feel stuffed/sick during extreme hunger? I listened to my mental hunger today and ended up very physically full",
      "created_utc": 1735961496.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m5d26tz",
      "author": "bluebonnet-baby",
      "body": "This is such a helpful reminder, because this is one of my deep-seated fears about recovering, is swinging the other direction.",
      "created_utc": 1736003711.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5zoq5q",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1736306379.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5bv7gw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1735981663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvov6ez",
      "author": "Dangerous_Eyes937",
      "body": "I really needed to see this. I've been struggling with eh right now, and it's been making me feel really bad and driving me a little insane. This was super reassuring.",
      "created_utc": 1748912161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5dv2jh",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1736013058.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m5ayr3e",
      "author": "upsilontries",
      "body": "I'm still going through extreme hunger now, and yeah, sometimes i feel very full after fully honoring my hunger. i think the key difference for me though is this fullness doesn't last. i could be physically stuffed, almost nauseous, and an hour later I will feel fine again. when i would actually binge, it was typically late at night and i would go to bed stuffed and wake up still full and uncomfortable. obviously everyone's experience is different though.\n\ni want to be really clear however, eating to the point of being stuffed during extreme hunger does NOT mean you are developing bed. there are tonnnn of other factors that play into that and it's super common to eat pass fullness during the extreme hunger phase of recovery.",
      "created_utc": 1735964373.0,
      "score": 22,
      "context": [
        {
          "id": "m5arjno",
          "author": "ComfortableBox8794",
          "body": "Did you ever feel stuffed/sick during extreme hunger? I listened to my mental hunger today and ended up very physically full",
          "created_utc": 1735961496.0
        }
      ]
    },
    {
      "id": "m5zr6g2",
      "author": "upsilontries",
      "body": "this is very reassuring, other people's experiences consistently give me hope that if i stay committed to recovery that i will come out victorious ‼️\n\n\nhere is something else i tell myself when i start spiraling about extreme hunger:\n\n\nfirst of all, there is no reason to think it won't die down. my body is all out of wack right now, my hormones are messed up, my body is doing a lot of internal repairs, etc., all things that require extra calories and are temporary.\n\n\nsecond of all, lets say worst case scenario the extreme hunger doesn't go away. it still takes large portions of food to satisfy me, and i am hungry at almost any given point in the day. so what? eating a lot isn't \"morally wrong,\" it doesn't make me a bad person or any less worthy. if i'm eating when i'm hungry and not consistently making myself sick, there is literally nothing actually wrong with eating a lot. 90% of my fear of extreme hunger is purely my eating disorder talking. if i'm really concerned with my level of hunger late into recovery, i can always go to a doctor and see if there is an underlying reason i can address to make it more manageable.\n\n\npoint is, it would not be the end of the world. life would go on. i would still have the capacity to live a wonderful, fulfilling life. ",
      "created_utc": 1736307292.0,
      "score": 6,
      "context": [
        {
          "id": "m5zoq5q",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1736306379.0
        }
      ]
    },
    {
      "id": "m5cgz38",
      "author": "upsilontries",
      "body": "i think it's also important to acknowledge that not every response to extreme hunger is going to be pretty. there have been times where i also have felt this way. but if you have restricted for any length of time, \"binging\" is not a sign of bed, no matter how \"ugly\" the binge is. you also  don't have to be underweight for your body to be in a major energy deficit, so you definitely aren't \"making it up.\" \n\nwhen i find myself uncomfortable or have eaten past satiety during my extreme hunger (which has been very often) i try to be very gentle with myself. don't beat yourself up. your body is begging for food for a reason. any sort of extreme guilt or restriction of food will only make the process more difficult and drawn out. \n\ni understand it's hard to trust the process, i'm struggling with that too, but i truly believe that if you fully commit to recovery and surrender to any hunger you may have, it will one day subside. there are too many success stories out there for me not to believe that it's possible. in just my own experience, i've attempted traditional, slower forms of recovery before. sure, i gained weight during those attempts, but was still very mentally sick. with just 1 month of \"all-in\" i feel like i have shattered my eating disorder. i'm not even fully weight restored and the guilt and food noise and obsession is almost entirely gone. my fear of weight gain has decreased significantly. my relationships with friends and family have improved. i'm actually present in each moment, and not distracted by all the background noise of an eating disorder. \n\npoint is, be kind to yourself, and trust the process. whatever is on the other side, it will be better than the life an eating disorder has given you.",
      "created_utc": 1735994913.0,
      "score": 6,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        }
      ]
    },
    {
      "id": "m5d2jom",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1736003837.0,
      "score": 3,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        }
      ]
    },
    {
      "id": "m5c6mzh",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1735988984.0,
      "score": 3,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        }
      ]
    },
    {
      "id": "m5dxsmd",
      "author": "upsilontries",
      "body": "if you restricted food for any length of time, it's normal to feel extra hungry for a period of time. point blank. you are definitely not alone.\n\nthis morning alone i had a big breakfast and thought i was full until i sat down for a little bit and felt this emptiness in my stomach. i ate a protein bar, but the feeling was still there. i then ate a pack of nuts, a few squares of chocolate, and some granola. only then was i satiated and could focus on something else.\n\ni acknowledge that it's extremely common for people to find themselves in binge/restrict cycles after recovery, and often these individuals will mistakenly believe they developed bed. but if you don't compensate, don't restrict, and see your hunger all the way through and allow your body to gain a sense of stability and trust again, it WILL eventually subside\n\nand i don't mind at all about you \"dumping so much info,\" we are on an ed support sub for a reason!!! we are all struggling 😭. i am happy to attempt to help people going through the same thing as me in any way i can.",
      "created_utc": 1736013908.0,
      "score": 4,
      "context": [
        {
          "id": "m5dv2jh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736013058.0
        }
      ]
    },
    {
      "id": "m5dxxw9",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.\n\nIf you’re experiencing extreme physical and/or mental hunger, you aren’t at a healthy weight. BMI is not a scientifically accurate measurement of health, so you need to stop intertwining your physical and mental health with it if you expect to recover and honor your hunger.",
      "created_utc": 1736013953.0,
      "score": 3,
      "context": [
        {
          "id": "m5dv2jh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736013058.0
        }
      ]
    },
    {
      "id": "m5cffri",
      "author": "ComfortableBox8794",
      "body": "That makes sense! Thank you for your response🤍",
      "created_utc": 1735994133.0,
      "score": 3,
      "context": [
        {
          "id": "m5arjno",
          "author": "ComfortableBox8794",
          "body": "Did you ever feel stuffed/sick during extreme hunger? I listened to my mental hunger today and ended up very physically full",
          "created_utc": 1735961496.0
        },
        {
          "id": "m5ayr3e",
          "author": "upsilontries",
          "body": "I'm still going through extreme hunger now, and yeah, sometimes i feel very full after fully honoring my hunger. i think the key difference for me though is this fullness doesn't last. i could be physically stuffed, almost nauseous, and an hour later I will feel fine again. when i would actually binge, it was typically late at night and i would go to bed stuffed and wake up still full and uncomfortable. obviously everyone's experience is different though.\n\ni want to be really clear however, eating to the point of being stuffed during extreme hunger does NOT mean you are developing bed. there are tonnnn of other factors that play into that and it's super common to eat pass fullness during the extreme hunger phase of recovery.",
          "created_utc": 1735964373.0
        }
      ]
    },
    {
      "id": "m5d7o4l",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.",
      "created_utc": 1736005610.0,
      "score": 3,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        },
        {
          "id": "m5c6mzh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735988984.0
        }
      ]
    },
    {
      "id": "m5cembl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1735993694.0,
      "score": 1,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        },
        {
          "id": "m5c6mzh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735988984.0
        }
      ]
    },
    {
      "id": "m5dzoq5",
      "author": "BlueberryIogurt",
      "body": "Thank you for the reassurance! I definitely feel less alone in all of this knowing many are going through similar though experiences. You are really sweet! I hope all goes well for you, again 😊",
      "created_utc": 1736014494.0,
      "score": 4,
      "context": [
        {
          "id": "m5dv2jh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736013058.0
        },
        {
          "id": "m5dxsmd",
          "author": "upsilontries",
          "body": "if you restricted food for any length of time, it's normal to feel extra hungry for a period of time. point blank. you are definitely not alone.\n\nthis morning alone i had a big breakfast and thought i was full until i sat down for a little bit and felt this emptiness in my stomach. i ate a protein bar, but the feeling was still there. i then ate a pack of nuts, a few squares of chocolate, and some granola. only then was i satiated and could focus on something else.\n\ni acknowledge that it's extremely common for people to find themselves in binge/restrict cycles after recovery, and often these individuals will mistakenly believe they developed bed. but if you don't compensate, don't restrict, and see your hunger all the way through and allow your body to gain a sense of stability and trust again, it WILL eventually subside\n\nand i don't mind at all about you \"dumping so much info,\" we are on an ed support sub for a reason!!! we are all struggling 😭. i am happy to attempt to help people going through the same thing as me in any way i can.",
          "created_utc": 1736013908.0
        }
      ]
    },
    {
      "id": "m5d7oum",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.",
      "created_utc": 1736005617.0,
      "score": 3,
      "context": [
        {
          "id": "m5bv7gw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735981663.0
        },
        {
          "id": "m5c6mzh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735988984.0
        },
        {
          "id": "m5cembl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1735993694.0
        }
      ]
    }
  ]
}