{
  "id": "1hzrdg2",
  "subreddit": "fuckeatingdisorders",
  "author": "SouthCharacter43",
  "created_utc": 1736701804.0,
  "title": "YOUR MOTIVATION TO RECOVER",
  "selftext": "I AM SO FUCKING BEAUTIFUL. my stomach is not flat. and i LOVE IT. i have pimples all over my face and they're so CUTE. life is on my side. i hugged a tree today. i just stood there, surrounded by green moss and snow and sun on my face, hugging it. and if someone were to walk by i wouldn't move. i don't care if they think i'm weird. i just don't care! my sister's chocolate cake is DELICIOUS and i ate two servings because i'm ALIVE. i'm LIVING again. in the end it's all just so worth it. I LOVE MYSELF and i don't care if other people don't. i am human. i have bad days. i cry. and today, i've smiled so fucking much. keep pushing. you can do it. you CAN. every bite, every meal, every spoon of peanut butter and croissant and cake and moist blueberry muffin, every day is a step towards life. and you deserve it. you deserve to love yourself and live. you will gain so much more than just weight by recovering, spontaneity and creativity, health and energy for doing the things you love. this is your sign. eat the cookie or send that text. tell them you love them. just go for it. don't rush it. take your time. but know that life is waiting for you on the other side.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1hzrdg2/your_motivation_to_recover/",
  "score": 136,
  "num_comments": 5,
  "comments": [
    {
      "id": "m6rrlc7",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1736701805.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6ru7r6",
      "author": "Far-Persimmon-546",
      "body": "I love this energy",
      "created_utc": 1736702574.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m6s2s70",
      "author": "NZKhrushchev",
      "body": "You’re amazing!!!",
      "created_utc": 1736705005.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m6sscyk",
      "author": "AngleGlittering9853",
      "body": "Thank you for this! Sometimes I need a little reminder of how beautiful life can be",
      "created_utc": 1736712251.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m6v0v1i",
      "author": "WIwildflower",
      "body": "I hope the universe hugs you because this is amazing.",
      "created_utc": 1736737685.0,
      "score": 5,
      "context": []
    }
  ]
}