{
  "id": "1i2d9lw",
  "subreddit": "fuckeatingdisorders",
  "author": "_MYORAR",
  "created_utc": 1736990243.0,
  "title": "an extreme hunger story (from a non ed person) ",
  "selftext": "so this is a little story time of what is was like witnessing my grandma (who has never struggled with disordered eating) go through extreme hunger. i like to think about this when im feeling self conscious about my mental/physical eh and i think it might be reassuring for someone else to hear too. \n\nmy grandma injured her hip pretty severely in the summer of 2022. we were just about to board a ship as it was day 1 of our family vacation when suddenly she could no longer walk at all. before any of this she was very mobile, walking, driving etc. an employee had to bring around a wheelchair and from then on things only continued to spiral downhill. \n\nflash forward to when we get back she is seen by a doctor and it is confirmed that she would be needing immediate surgery. due to the nature of her injury, she was admitted to a senior rehabilitation center where she then stayed for 3-4months. this was a pretty traumatic time for my grandma. while she was at this center, she was given many shots, pills and supplements she was unfamiliar with, she felt as though she lost all control over her body and on top of that the meals they served were absolutely WHACK. i’m talking microwave meals with frozen blocks in the middle. think prison food. she often times opted for ensure or relied on us to bring her meals from home on occasion when we could visit. \n\nnow we get into the hunger. \n\nonce my grandma arrived home things were rough. the recovery was hard and my family and i had to take turns doing the mundane tasks a human being does for themselves for her sometimes even spoon feeding her (her nerves were messed up too). about a month of this goes by and she is getting the hang of things on her own again. before this we had been bringing her meals whenever we cooked but once she started using the wheelchair she was able to come into the kitchen to get her own food. i remember specifically this one day where my mom made chili and brought my grandma her usual bowl portion. that evening my grandma wheeled herself back into the kitchen 3 more times and each time got a bigger portion with all the toppings. fritos, chives, cheese. my mom commented on her eating and all my grandma said was “i’m just really hungry” she had not one care about the way she was eating. for about a month after this day i would receive special request to pick up oreos and butter pecan ice cream to which she would eat sleeves a day and half tubs every other day. whenever dinner was served we would always give her a bigger portion and often times she would come back for seconds/thirds. \n\nmy mom was absolutely astonished by the way my grandma was eating during this time. i remember watching in awe as i saw all this happening knowing exactly how it felt but only mine was coupled with guilt,  shame and compensation. seeing my moms reaction to this also exacerbated\nmy fear of fully honoring my hunger however that was simply my ed brain. \n\nmy grandma was already slim to begin with and has been her entire life, while she was in this treatment center she had lost quite a bit of weight due to the shit quality food and traumatic state she was in. after about a month when the extreme hunger began to die down and she was requesting less and less food or simply being satisfied after a solid portion. she was proud to see her weight gain even though it was not as much as she or my mom was expecting. it’s as if all that food went to repairing her internal organs?? 🤔she was even the one to ask for the scale so she could see her progress. \n\nbasically i just wanted to put this out there so it could serve as a little reassurance to you as it has been to me. i know it’s long and i mostly wrote it out for myself to come back to but whatever works, works!good luck on recovery guys and eat wtf you want. ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1i2d9lw/an_extreme_hunger_story_from_a_non_ed_person/",
  "score": 121,
  "num_comments": 5,
  "comments": [
    {
      "id": "m7dj7ew",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1736990243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m7e210u",
      "author": "funsized_",
      "body": "Thank you for this, it actually makes me feel better than most stories of others who have experienced EH. \n\nAlso, i’m so glad your grandma is better! Her body needed the nutrients to heal :)",
      "created_utc": 1736996796.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m7em207",
      "author": "Far-Persimmon-546",
      "body": "Hell yeah, no shame! I hope I get to that level eventually",
      "created_utc": 1737005006.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m7fa0d7",
      "author": "None",
      "body": "Really interesting insight, thank you!",
      "created_utc": 1737018784.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m7ikms5",
      "author": "_MYORAR",
      "body": "im so happy this could be of use to you. keep taking care of yourself love! 🫶",
      "created_utc": 1737060963.0,
      "score": 3,
      "context": [
        {
          "id": "m7e210u",
          "author": "funsized_",
          "body": "Thank you for this, it actually makes me feel better than most stories of others who have experienced EH. \n\nAlso, i’m so glad your grandma is better! Her body needed the nutrients to heal :)",
          "created_utc": 1736996796.0
        }
      ]
    }
  ]
}