{
  "id": "1j81wv4",
  "subreddit": "fuckeatingdisorders",
  "author": "Reverse7695",
  "created_utc": 1741622172.0,
  "title": "EDs are so misunderstood. If you had to pick one thing to educate people on, what would it be?",
  "selftext": "I think for me, I would want people to understand how multilayered and complex EDs are. It isn't just \"not eating a lot of food\"; EDs are depression, sleepless nights, SH, anxiety, self-hatred. There's so much more I wish people understood, but that one particularly comes to mind.\n\nWhat are your thoughts?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1j81wv4/eds_are_so_misunderstood_if_you_had_to_pick_one/",
  "score": 94,
  "num_comments": 59,
  "comments": [
    {
      "id": "mh1g8rg",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1741622173.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh1jtos",
      "author": "among_flowers",
      "body": "This is a hard one. Probably the fact that someone’s size does not determine the severity of their ED. Especially not how much of a mental toll it takes on people.",
      "created_utc": 1741623194.0,
      "score": 125,
      "context": []
    },
    {
      "id": "mh1mkv2",
      "author": "chemicallycalmed",
      "body": "That you can die at any bmi",
      "created_utc": 1741623963.0,
      "score": 69,
      "context": []
    },
    {
      "id": "mh1lxjj",
      "author": "blockifyouhaterats",
      "body": "i feel like the stereotype is that “eating disorder” means “skinny white cis straight girl who thinks she’s fat and ugly and starves/throws up to make herself more attractive.” there’s a lot to unpack there, and i don’t think i can pick one that’s the *most important*… but the thing that’s been bothering me the most lately is the idea that every eating disorder looks exactly the same on the *inside.* even if the behaviors are the same, it doesn’t mean the thought process is.",
      "created_utc": 1741623783.0,
      "score": 50,
      "context": []
    },
    {
      "id": "mh1k826",
      "author": "Kastrullock",
      "body": "That’s it’s a real mental disorder with real and severe complications and not a “quirky girl behaviour”.",
      "created_utc": 1741623307.0,
      "score": 46,
      "context": []
    },
    {
      "id": "mh20m13",
      "author": "L1ll3My",
      "body": "The one thing: that when people in recovery start “looking better” it doesn’t necessarily mean that they feel better. Usually that’s when I feel my worst because my ED is no longer serving its purpose as a coping strategy. So people around me see me looking healthier and assume everything’s fine, and they also start expecting more from me that I’m unable to give as my mental state is worse than ever. Shortly put: weight status doesn’t always correlate with how well one is doing",
      "created_utc": 1741627878.0,
      "score": 49,
      "context": []
    },
    {
      "id": "mh266if",
      "author": "NZKhrushchev",
      "body": "How incredibly disordered and harmful it is to demonize and fear monger food. The disordered eating we’ve normalized in our society directly links to the rise in eating disorders.",
      "created_utc": 1741629455.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mh1jv86",
      "author": "Minimum_Win_5312",
      "body": "I think it’s a popular one: just telling me to just eat doesn’t help. \nOmg though I have had the worst things said to me by people including those in the medical field who knew I was sick.",
      "created_utc": 1741623207.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mh38c16",
      "author": "_seulgi",
      "body": "What I Eat In A Day content is EVIL. Any celebrity who posts shit like that to their young audiences should recieve backlash. It's incredibly narcissistic.",
      "created_utc": 1741640334.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mh2jr8q",
      "author": "TooManyTongues",
      "body": "The most anorexics eat every day.",
      "created_utc": 1741633275.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mh3vdpd",
      "author": "Jaded-Banana6205",
      "body": "That you can die at any weight, even if you \"only\" had your ED for (X) amount of time. There is no \"safe\" way to engage in an ED. Damage begins on day 1.\n\nThat lots of people with EDs love food!\n\nThat our society's obsession with macros and high protein versions of everything is just disordered eating wearing a different hat. Ditto for gym fitness bro and girlie culture. I had a bias against buff guys at the gym from some bad experiences, avoided them a lot. Then I spoke to a friend who is a buff personal trainer with a history of CPTSD and an ED and started to realize how much a lot of those guys are probably struggling.  MEN (and everybody who is not a cis woman) NEED BETTER SUPPORT FOR EDs.",
      "created_utc": 1741647214.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mh35go7",
      "author": "Successful-Carob8396",
      "body": "i hate when people think its just eating half an apple a day, when i was sickest eating full 3 meals and snacks",
      "created_utc": 1741639515.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mh27c6q",
      "author": "Extra-Blueberry-4320",
      "body": "That you don’t outgrow these. They persist in your life if you don’t treat them. They take over your entire life and you have to deal with them if you want them to go away.",
      "created_utc": 1741629782.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mh27ss1",
      "author": "Seigneurlapindelune",
      "body": "You don't have to be severly underweight to have anorexia",
      "created_utc": 1741629914.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mh22w2h",
      "author": "Deep-Ad-6638",
      "body": "That not everyone with an ED has body dysmorphia or thinks they’re bigger than they are. I would say I have pretty good self-perception, so for me it’s not that I engage in the ED because I think I’m overweight, but because I have this unhealthy fixation on trying to “looksmax” and be the “best” version of myself. But it seems its easier for people to have sympathy for those with body dysmorphia/really bad self esteem. Like a thin girl who thinks she’s huge, they’d pity and want to help, whereas they may judge people like me as being shallow and self-absorbed.",
      "created_utc": 1741628531.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mh2moit",
      "author": "Entire_Resolution_36",
      "body": "Just one? I would need a FAQ page. \n\nThe fact that most people don't develop eating disorders solely out of vanity. The fact recovery isn't just \"start eating again\". The fact that Starving or purging are not the only way to have an eating disorder.",
      "created_utc": 1741634107.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mh28oh4",
      "author": "chococat159",
      "body": "It's not about appearance or wanting to be beautiful. I don't think that ever entered my brain in my ED days. It was a very unhealthy coping mechanism that consumed my life, a way to control something, being in competition with both my past self and future self all at once.",
      "created_utc": 1741630166.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mh4stpq",
      "author": "burrito564",
      "body": "I think a lot of people assume EDs are just the actions related to food. So much of it is mental and hard to explain. The mental battle people experience with an ED is pure torture and won’t make sense to the average person.",
      "created_utc": 1741657969.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mh3lmxf",
      "author": "CompetitiveTourist18",
      "body": "Stop using anorexic as an adjective to describe \"skinny\". Stop saying \"she looks anorexic\" - you can be anorexic at any weight, any body.",
      "created_utc": 1741644233.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mh2xcer",
      "author": "AstronomerAsleep5676",
      "body": "it's not just about weight. sometimes i really want to eat but my body won't let me.\n\nthis and the fact it is not a choice, we didn't choose for this life",
      "created_utc": 1741637173.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mh3ral7",
      "author": "SnooPeppers8723",
      "body": "I want people to understand how non functional an ED can make you. Like it’s not being hungry all the time as normal people expect. It literally turns you into a living corpse and clouds your judgment so hard. So i wish the systems would be more equipped to show grace to those suffering from an ED instead of labelling them in a box of «lazy» people or failures, and giving them no opportunity to catch up to other normal human beings.",
      "created_utc": 1741645956.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mh2bwld",
      "author": "lovefarewell",
      "body": "i have many issues w the way EDS are perceived publically. the way recovery institutions still use BMI to classify who's under/overweight, the way that those who are considered \"overweight\" are denied equal treatment in their recovery efforts. the public perception of EDs as only affecting thin, white, teenage girls - while still failing to really help the people who *do* fit that stereotype. \n\nbut besides that, b/c a lot of people have made similar comments in the replies (love y'all <3) ... one smaller thing that I wish people understood is that often, EDs are a lifetime thing. that's not to say that recovery isn't possible (it is!!!!), or you can't get to a point where your disordered behaviors are under control - I believe that's possible for everyone. but for me (& I think for many of us), the thought patterns, desires, & psychology of the ED will always be some part of the way I go about my life. many people seem to believe that this is just a temporary affliction, like a broken leg - just a difficult stage in my life... something that I can rid myself of completely with the right treatment. & maybe that is true for some people. but for me - it's a lifetime commitment & struggle with my desire/addiction to harming myself. \n\ni don't think I'll ever *not* have an ED. i want to be clear - i wholeheartedly believe in the possibility of recovery. i believe that ALL of us have the opportunity to live lives where that's not how we make our choices. but at least on the mental/emotional side... it's always gonna be a part of me. recovery is a never-ending, continuous battle for some of us. or at least that's how I feel.",
      "created_utc": 1741631084.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mh1mi9d",
      "author": "Vikkkiiix",
      "body": "it's not something that's made up and ed's don't discriminate 🤦🏼‍♀️",
      "created_utc": 1741623943.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mh3mth7",
      "author": "Blue_eyed_bones",
      "body": "EDs are not a choice, you can die at any size, EDs are a coping mechanism not about vanity.",
      "created_utc": 1741644590.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mh3pini",
      "author": "pennyisadog1313",
      "body": "People with Ed’s actually eat and they aren’t all skinny white overprivledged girls",
      "created_utc": 1741645411.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mh2feb6",
      "author": "CimJotton",
      "body": "(1) They're not only about body image and (2) guys like me get them too.",
      "created_utc": 1741632064.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mh2yg39",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741637496.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mh25ipc",
      "author": "FruitSalad_24",
      "body": "Probably that it's a mental Illness and that there's alot more too it than being 'weird with food'",
      "created_utc": 1741629278.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mh3z1dh",
      "author": "sidvicioustheyorkie",
      "body": "I think maybe that *so* many people suffer from them and you'd never know. People you hang out with every day.",
      "created_utc": 1741648352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh1rjid",
      "author": "Rhyme_orange_",
      "body": "In a way, my ADHD meds help manage it, but also ignoring it can make it fester.",
      "created_utc": 1741625338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh1tqxs",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741625949.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh36aoy",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741639754.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mh1pykn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741624899.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mh2h7y2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741632570.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mh2fpaf",
      "author": "calcamkatsamm",
      "body": "this. and also the way diet culture influences it too; being told you “look great” when you’re at your sickest, and people not understanding why it’s harmful to say that to someone (even if you don’t “think” they have an ed)",
      "created_utc": 1741632150.0,
      "score": 34,
      "context": [
        {
          "id": "mh1jtos",
          "author": "among_flowers",
          "body": "This is a hard one. Probably the fact that someone’s size does not determine the severity of their ED. Especially not how much of a mental toll it takes on people.",
          "created_utc": 1741623194.0
        }
      ]
    },
    {
      "id": "mh26oxp",
      "author": "lovefarewell",
      "body": "yes, totally. that stereotype of the thin/white/rich pro-ana girl serves no one - not even the people who DO fit that description. one of the most impactful statistics on EDS that I always think about in regards to this misconception is that [food insecurity is the biggest predictor of developing an ED](https://pmc.ncbi.nlm.nih.gov/articles/PMC8250281/#:~:text=Chi%E2%80%90squared%20tests%20showed%20higher,specified%20feeding%20and%20eating%20disorder) ...",
      "created_utc": 1741629599.0,
      "score": 21,
      "context": [
        {
          "id": "mh1lxjj",
          "author": "blockifyouhaterats",
          "body": "i feel like the stereotype is that “eating disorder” means “skinny white cis straight girl who thinks she’s fat and ugly and starves/throws up to make herself more attractive.” there’s a lot to unpack there, and i don’t think i can pick one that’s the *most important*… but the thing that’s been bothering me the most lately is the idea that every eating disorder looks exactly the same on the *inside.* even if the behaviors are the same, it doesn’t mean the thought process is.",
          "created_utc": 1741623783.0
        }
      ]
    },
    {
      "id": "mh26j2k",
      "author": "NZKhrushchev",
      "body": "As a guy, thank you for this. The stereotypes around EDs are so harmful.",
      "created_utc": 1741629553.0,
      "score": 6,
      "context": [
        {
          "id": "mh1lxjj",
          "author": "blockifyouhaterats",
          "body": "i feel like the stereotype is that “eating disorder” means “skinny white cis straight girl who thinks she’s fat and ugly and starves/throws up to make herself more attractive.” there’s a lot to unpack there, and i don’t think i can pick one that’s the *most important*… but the thing that’s been bothering me the most lately is the idea that every eating disorder looks exactly the same on the *inside.* even if the behaviors are the same, it doesn’t mean the thought process is.",
          "created_utc": 1741623783.0
        }
      ]
    },
    {
      "id": "mh2fjp8",
      "author": "CimJotton",
      "body": "Not only girls that get EDs. That in itself is something people should be made aware of...",
      "created_utc": 1741632106.0,
      "score": 10,
      "context": [
        {
          "id": "mh1k826",
          "author": "Kastrullock",
          "body": "That’s it’s a real mental disorder with real and severe complications and not a “quirky girl behaviour”.",
          "created_utc": 1741623307.0
        }
      ]
    },
    {
      "id": "mh397cf",
      "author": "_seulgi",
      "body": "Thank you!! So sick of online discourse relegating EDs to quirky white girls participating in niche subcultures like ballet core or the coquette aesthetic. It's so irresponsible because it compartmentalizes EDs in a mystical space that somehow does not concern the average person.",
      "created_utc": 1741640586.0,
      "score": 4,
      "context": [
        {
          "id": "mh1k826",
          "author": "Kastrullock",
          "body": "That’s it’s a real mental disorder with real and severe complications and not a “quirky girl behaviour”.",
          "created_utc": 1741623307.0
        }
      ]
    },
    {
      "id": "mh3w32g",
      "author": "None",
      "body": "Yeah, I've heard someone say \"we should all be a little orthorexic.\" That's so disgusting and it's ridiculous to assert that it's normal to obsess over eating \"healthy\" enough.",
      "created_utc": 1741647431.0,
      "score": 14,
      "context": [
        {
          "id": "mh266if",
          "author": "NZKhrushchev",
          "body": "How incredibly disordered and harmful it is to demonize and fear monger food. The disordered eating we’ve normalized in our society directly links to the rise in eating disorders.",
          "created_utc": 1741629455.0
        }
      ]
    },
    {
      "id": "mh3bes3",
      "author": "Reverse7695",
      "body": "Ugg, there was def a time I was obsessed with watching WIEIAD videos 🤦🏼‍♀️\n\nAlso, what do you think of Seulgi's new song??",
      "created_utc": 1741641237.0,
      "score": 3,
      "context": [
        {
          "id": "mh38c16",
          "author": "_seulgi",
          "body": "What I Eat In A Day content is EVIL. Any celebrity who posts shit like that to their young audiences should recieve backlash. It's incredibly narcissistic.",
          "created_utc": 1741640334.0
        }
      ]
    },
    {
      "id": "mh3wwbi",
      "author": "None",
      "body": "Definitely. You can't base what you eat on what someone else does because we all have such different nutritional needs. Most of them are incredibly restrictive and probably blatant lies compared to what they actually eat. If not, then they likely have an ED.",
      "created_utc": 1741647682.0,
      "score": 4,
      "context": [
        {
          "id": "mh38c16",
          "author": "_seulgi",
          "body": "What I Eat In A Day content is EVIL. Any celebrity who posts shit like that to their young audiences should recieve backlash. It's incredibly narcissistic.",
          "created_utc": 1741640334.0
        }
      ]
    },
    {
      "id": "mh3xnv6",
      "author": "None",
      "body": "The fear mongering about protein right now is ridiculous. If you like protein, that's great, and there's nothing wrong with wanting to get enough. But the amount some media sources say you need at every meal is ridiculous and not sustainable. Plus, most people get plenty of protein without worrying about counting how many grams they get during the day.",
      "created_utc": 1741647917.0,
      "score": 4,
      "context": [
        {
          "id": "mh3vdpd",
          "author": "Jaded-Banana6205",
          "body": "That you can die at any weight, even if you \"only\" had your ED for (X) amount of time. There is no \"safe\" way to engage in an ED. Damage begins on day 1.\n\nThat lots of people with EDs love food!\n\nThat our society's obsession with macros and high protein versions of everything is just disordered eating wearing a different hat. Ditto for gym fitness bro and girlie culture. I had a bias against buff guys at the gym from some bad experiences, avoided them a lot. Then I spoke to a friend who is a buff personal trainer with a history of CPTSD and an ED and started to realize how much a lot of those guys are probably struggling.  MEN (and everybody who is not a cis woman) NEED BETTER SUPPORT FOR EDs.",
          "created_utc": 1741647214.0
        }
      ]
    },
    {
      "id": "mh3wqd3",
      "author": "None",
      "body": "Yeah, it just makes people get sicker by restricting more when they think they have to fit the stereotype of having an eating disorder.",
      "created_utc": 1741647630.0,
      "score": 5,
      "context": [
        {
          "id": "mh35go7",
          "author": "Successful-Carob8396",
          "body": "i hate when people think its just eating half an apple a day, when i was sickest eating full 3 meals and snacks",
          "created_utc": 1741639515.0
        }
      ]
    },
    {
      "id": "mh3wd18",
      "author": "None",
      "body": "You really don't have to be underweight at all to have anorexia. If you lose a significant amount of weight by restricting, that is anorexia.",
      "created_utc": 1741647516.0,
      "score": 3,
      "context": [
        {
          "id": "mh27ss1",
          "author": "Seigneurlapindelune",
          "body": "You don't have to be severly underweight to have anorexia",
          "created_utc": 1741629914.0
        }
      ]
    },
    {
      "id": "mh2cfwf",
      "author": "lovefarewell",
      "body": "great point. i feel like the more the public relies on these superficial ideas of what an ED is, rather than like - defining it as a mental illness that has many different presentations depending on the person... the easier it is to miss that someone's really struggling. when I was in the depths of my ED, doing everything I could not to recover/get better in any way - I often took advantage of people's shallow perceptions abt what an ED is in order to make myself sicker.",
      "created_utc": 1741631232.0,
      "score": 6,
      "context": [
        {
          "id": "mh22w2h",
          "author": "Deep-Ad-6638",
          "body": "That not everyone with an ED has body dysmorphia or thinks they’re bigger than they are. I would say I have pretty good self-perception, so for me it’s not that I engage in the ED because I think I’m overweight, but because I have this unhealthy fixation on trying to “looksmax” and be the “best” version of myself. But it seems its easier for people to have sympathy for those with body dysmorphia/really bad self esteem. Like a thin girl who thinks she’s huge, they’d pity and want to help, whereas they may judge people like me as being shallow and self-absorbed.",
          "created_utc": 1741628531.0
        }
      ]
    },
    {
      "id": "mh4vooh",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741658909.0,
      "score": -1,
      "context": [
        {
          "id": "mh28oh4",
          "author": "chococat159",
          "body": "It's not about appearance or wanting to be beautiful. I don't think that ever entered my brain in my ED days. It was a very unhealthy coping mechanism that consumed my life, a way to control something, being in competition with both my past self and future self all at once.",
          "created_utc": 1741630166.0
        }
      ]
    },
    {
      "id": "mh45tqj",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nPlease don’t describe your body as it can and does breed comparison.",
      "created_utc": 1741650554.0,
      "score": 3,
      "context": [
        {
          "id": "mh2yg39",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741637496.0
        }
      ]
    },
    {
      "id": "mh4t05o",
      "author": "burrito564",
      "body": "I think the hardest part of growing up with an ED is my parents referring to me as having “food issues” when in reality my brain was beating me senselessly every day. It was excruciating.",
      "created_utc": 1741658027.0,
      "score": 2,
      "context": [
        {
          "id": "mh25ipc",
          "author": "FruitSalad_24",
          "body": "Probably that it's a mental Illness and that there's alot more too it than being 'weird with food'",
          "created_utc": 1741629278.0
        }
      ]
    },
    {
      "id": "mh48kyg",
      "author": "Reverse7695",
      "body": "This!",
      "created_utc": 1741651456.0,
      "score": 1,
      "context": [
        {
          "id": "mh3z1dh",
          "author": "sidvicioustheyorkie",
          "body": "I think maybe that *so* many people suffer from them and you'd never know. People you hang out with every day.",
          "created_utc": 1741648352.0
        }
      ]
    },
    {
      "id": "mh1zjld",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nRemoved because, while it is case by case, the mods are concerned that many struggling with b/p or b/r stemming from restriction are going to read this alone latch onto the idea that leaving food is a desirable behavior when in reality, they *should* be eating more. Hopefully that was clear enough—I do think that’s a wonderful win and we are so glad you’ve been able to learn so much from this sub!",
      "created_utc": 1741627578.0,
      "score": 5,
      "context": [
        {
          "id": "mh1tqxs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741625949.0
        }
      ]
    },
    {
      "id": "mh1vbu7",
      "author": "Reverse7695",
      "body": "So so amazing that, through this sub, you've learned how to better support your friends. I LOVE that.",
      "created_utc": 1741626392.0,
      "score": 3,
      "context": [
        {
          "id": "mh1tqxs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741625949.0
        }
      ]
    },
    {
      "id": "mh3x4b9",
      "author": "None",
      "body": "I think the line between disordered eating and an actual eating disorder is really blurry. If someone is really struggling, I don't think it matters if you have a label of an ED. All struggles with food/body image are valid.",
      "created_utc": 1741647751.0,
      "score": 5,
      "context": [
        {
          "id": "mh36aoy",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741639754.0
        }
      ]
    },
    {
      "id": "mh47f97",
      "author": "Sareeee48",
      "body": "I don’t think this is entirely fair. Eating disorder behaviors are so normalized that they often go unnoticed under the guise of “health.” One of the biggest risk factors for developing an eating disorder is a history of dieting—some studies suggest that people who have dieted are up to 18 times more likely to develop one.\n\nThe reality is, we can’t always tell if someone is struggling with an eating disorder. If we treated all bodies equally—both systemically and individually—there would likely be far less dieting overall, including in the cases of eating disorders. Access to diagnosis and treatment is a privilege, especially when it comes to receiving the right diagnosis, and even more so for those in larger bodies. Framing dieting as separate from disordered eating is, at best, problematic. Restriction in any form is harmful when it involves withholding food for reasons unrelated to medical conditions that directly impact health.",
      "created_utc": 1741651077.0,
      "score": 4,
      "context": [
        {
          "id": "mh36aoy",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741639754.0
        }
      ]
    },
    {
      "id": "mh62ay5",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.",
      "created_utc": 1741679111.0,
      "score": 2,
      "context": [
        {
          "id": "mh36aoy",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741639754.0
        }
      ]
    },
    {
      "id": "mh1v7rg",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nI haven't seen what you're referencing and this is overall just an unnecessary comment",
      "created_utc": 1741626361.0,
      "score": 3,
      "context": [
        {
          "id": "mh1pykn",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741624899.0
        }
      ]
    },
    {
      "id": "mh2ja3l",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.\n\nThis is not true",
      "created_utc": 1741633141.0,
      "score": 3,
      "context": [
        {
          "id": "mh2h7y2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741632570.0
        }
      ]
    },
    {
      "id": "mh2gea5",
      "author": "among_flowers",
      "body": "YESS THIS",
      "created_utc": 1741632344.0,
      "score": 5,
      "context": [
        {
          "id": "mh1jtos",
          "author": "among_flowers",
          "body": "This is a hard one. Probably the fact that someone’s size does not determine the severity of their ED. Especially not how much of a mental toll it takes on people.",
          "created_utc": 1741623194.0
        },
        {
          "id": "mh2fpaf",
          "author": "calcamkatsamm",
          "body": "this. and also the way diet culture influences it too; being told you “look great” when you’re at your sickest, and people not understanding why it’s harmful to say that to someone (even if you don’t “think” they have an ed)",
          "created_utc": 1741632150.0
        }
      ]
    },
    {
      "id": "mh4vf7x",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1741658820.0,
      "score": -1,
      "context": [
        {
          "id": "mh1lxjj",
          "author": "blockifyouhaterats",
          "body": "i feel like the stereotype is that “eating disorder” means “skinny white cis straight girl who thinks she’s fat and ugly and starves/throws up to make herself more attractive.” there’s a lot to unpack there, and i don’t think i can pick one that’s the *most important*… but the thing that’s been bothering me the most lately is the idea that every eating disorder looks exactly the same on the *inside.* even if the behaviors are the same, it doesn’t mean the thought process is.",
          "created_utc": 1741623783.0
        },
        {
          "id": "mh26oxp",
          "author": "lovefarewell",
          "body": "yes, totally. that stereotype of the thin/white/rich pro-ana girl serves no one - not even the people who DO fit that description. one of the most impactful statistics on EDS that I always think about in regards to this misconception is that [food insecurity is the biggest predictor of developing an ED](https://pmc.ncbi.nlm.nih.gov/articles/PMC8250281/#:~:text=Chi%E2%80%90squared%20tests%20showed%20higher,specified%20feeding%20and%20eating%20disorder) ...",
          "created_utc": 1741629599.0
        }
      ]
    },
    {
      "id": "mh51fts",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking rule 7 (No drama). Please contact the mods if you have any doubts.\n\nThese responses are all personal to the commenter, we're not here to debate each other. They're allowed to feel that way without you contradicting them.",
      "created_utc": 1741660872.0,
      "score": 2,
      "context": [
        {
          "id": "mh28oh4",
          "author": "chococat159",
          "body": "It's not about appearance or wanting to be beautiful. I don't think that ever entered my brain in my ED days. It was a very unhealthy coping mechanism that consumed my life, a way to control something, being in competition with both my past self and future self all at once.",
          "created_utc": 1741630166.0
        },
        {
          "id": "mh4vooh",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741658909.0
        }
      ]
    },
    {
      "id": "mh1x69e",
      "author": "Fox_Hawk",
      "body": "I have learned so much here via the sit down and shut up method :)",
      "created_utc": 1741626909.0,
      "score": 2,
      "context": [
        {
          "id": "mh1tqxs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741625949.0
        },
        {
          "id": "mh1vbu7",
          "author": "Reverse7695",
          "body": "So so amazing that, through this sub, you've learned how to better support your friends. I LOVE that.",
          "created_utc": 1741626392.0
        }
      ]
    },
    {
      "id": "mh4zu8e",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\nThat’s line saying you understand why white supremacy is harmful, just not for white people. It’s icky.",
      "created_utc": 1741660309.0,
      "score": 1,
      "context": [
        {
          "id": "mh1lxjj",
          "author": "blockifyouhaterats",
          "body": "i feel like the stereotype is that “eating disorder” means “skinny white cis straight girl who thinks she’s fat and ugly and starves/throws up to make herself more attractive.” there’s a lot to unpack there, and i don’t think i can pick one that’s the *most important*… but the thing that’s been bothering me the most lately is the idea that every eating disorder looks exactly the same on the *inside.* even if the behaviors are the same, it doesn’t mean the thought process is.",
          "created_utc": 1741623783.0
        },
        {
          "id": "mh26oxp",
          "author": "lovefarewell",
          "body": "yes, totally. that stereotype of the thin/white/rich pro-ana girl serves no one - not even the people who DO fit that description. one of the most impactful statistics on EDS that I always think about in regards to this misconception is that [food insecurity is the biggest predictor of developing an ED](https://pmc.ncbi.nlm.nih.gov/articles/PMC8250281/#:~:text=Chi%E2%80%90squared%20tests%20showed%20higher,specified%20feeding%20and%20eating%20disorder) ...",
          "created_utc": 1741629599.0
        },
        {
          "id": "mh4vf7x",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1741658820.0
        }
      ]
    }
  ]
}