{
  "id": "1jc35te",
  "subreddit": "fuckeatingdisorders",
  "author": "applepeartear",
  "created_utc": 1742067286.0,
  "title": "I've stopped giving a shit as of today",
  "selftext": "Honestly I've been TERRIFIED of extreme hunger but today I realised I'm literally in control of what I eat and I'm going to use that control to listen to my body as it's SCREAMING at me to eat. I've deprived it so much, that food is all I ever think about. I literally have stress dreams about breakfast. So I just ate and ate until I felt it was enough and yeah it's uncomfortable but I don't feel like a shivering, miserable pit of doom awaiting the next stupidly small meal ill eat.\n\nI've been trying to resist it for MONTHS and let me tell you it does not go away and I'm just giving in as of today. If you're reading this because you're scared of your extreme hunger, take it as a sign to just go and eat because it isn't going anywhere and your body is literally begging you. Food isn't scary it's just energy and youre in control. No you aren't binging, no you aren't doing anything wrong. You need more food than anyone else in your house right now. \n\nEat your way out or you'll be miserable until you do, life is so much more than worrying about food, exercise and bodies every waking hour so go and LIVE ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jc35te/ive_stopped_giving_a_shit_as_of_today/",
  "score": 119,
  "num_comments": 8,
  "comments": [
    {
      "id": "mhyxwef",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1742067286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhze1js",
      "author": "Halaros",
      "body": "Everything is honestly so much better when I stop giving a shit... Now all that remains is to CONSISTENTLY not give a shit; but being consistent and continuous is the hard part. Good job pushing past that boundary!",
      "created_utc": 1742072439.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mhz67f4",
      "author": "_AintThatJustTheWay_",
      "body": "All the power to you friend! Keep up the fight when the ED tries to kick back and we’re all here to support you!",
      "created_utc": 1742069933.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mi0r0df",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742089607.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mi24g1t",
      "author": "sabsab510",
      "body": "I needed this thank you ❤️🙏🏽",
      "created_utc": 1742113932.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mi3eip2",
      "author": "applepeartear",
      "body": "Thank you so much!!",
      "created_utc": 1742136296.0,
      "score": 2,
      "context": [
        {
          "id": "mhz67f4",
          "author": "_AintThatJustTheWay_",
          "body": "All the power to you friend! Keep up the fight when the ED tries to kick back and we’re all here to support you!",
          "created_utc": 1742069933.0
        }
      ]
    },
    {
      "id": "mi1j9ta",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.",
      "created_utc": 1742101466.0,
      "score": 2,
      "context": [
        {
          "id": "mi0r0df",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742089607.0
        }
      ]
    },
    {
      "id": "mi3ef5o",
      "author": "applepeartear",
      "body": "You can do this!!! ",
      "created_utc": 1742136264.0,
      "score": 3,
      "context": [
        {
          "id": "mi24g1t",
          "author": "sabsab510",
          "body": "I needed this thank you ❤️🙏🏽",
          "created_utc": 1742113932.0
        }
      ]
    }
  ]
}