{
  "id": "1jeb6ww",
  "subreddit": "fuckeatingdisorders",
  "author": "among_flowers",
  "created_utc": 1742320462.0,
  "title": "Mod appreciation post",
  "selftext": "I just want to say thank you to all of the mods for how quickly you all manage to recognise and take down triggering posts. I am someone who has had a few posts removed, and in the moment I felt a little attacked. I realise like 10 minutes after this that it’s the eating disorder feeling attacked, which is such a weird but sort of cool revelation I think. \nMy main appreciation goes to the fact that when removing posts, the mods will give a response to your post directly, rather than just removing the post and being left with no insight. It’s a tough love approach, but it f*cking works and I am so grateful for this subreddit. \n\nI’m sorry if this clogs up the sub in any way, I just wanted to thank the mod(s) that removed my previous post, so I really hope you see this. :) And if you do, just know that your insight was what I needed, and I proceeded honour the food noise. 💗",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jeb6ww/mod_appreciation_post/",
  "score": 91,
  "num_comments": 10,
  "comments": [
    {
      "id": "mih3v39",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1742320462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mihc491",
      "author": "Zanci19",
      "body": "“that it’s the eating disorder feeling attacked”\n\nHoly. Thank you so much for saying it this way. I’ve also had a good bunch of posts deleted, but upon reading some of these again, they do sound quite disordered. Your words above shift the perspective completely. Thanks again.",
      "created_utc": 1742322619.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mih9b2z",
      "author": "Minimum_Win_5312",
      "body": "Yes! Keeping this a safe community!",
      "created_utc": 1742321801.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mihzanz",
      "author": "lovefarewell",
      "body": "yes! the mods work so hard to keep things productive here, & I feel so grateful for the environment :)",
      "created_utc": 1742329215.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mihm0o7",
      "author": "notmybaggage",
      "body": "this was literally me a week ago lol when i made a post about extreme hunger and honoring it! the response was just what i needed to hear at the time 🫶",
      "created_utc": 1742325456.0,
      "score": 9,
      "context": []
    },
    {
      "id": "miimbp9",
      "author": "SweetenedMelon",
      "body": "i feel the same way, or with like comments i’ve made in the past, it helps me realise how much of what i say is rooted in the disorder and it gives me a good reflection and of course genuinley creates a safe space",
      "created_utc": 1742335922.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mikfc04",
      "author": "DecentEconomics5033",
      "body": "I love this community! I’ve had a few posts taken down too, but after reading them again I can see why they were. I’m happy they keep it safe here!!",
      "created_utc": 1742358996.0,
      "score": 3,
      "context": []
    },
    {
      "id": "miof5cm",
      "author": "asdfghjkl12345678888",
      "body": "agreed i had like two comments removed and sat on it for a while and it makes perfect sense now im so glad this is such a safe space 🫶",
      "created_utc": 1742415170.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mikw61x",
      "author": "NZKhrushchev",
      "body": "They are wonderful.",
      "created_utc": 1742368672.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mihise3",
      "author": "among_flowers",
      "body": "AHHH I HELPED SOMEONE IM SO HAPPY FOR YOU 😭😭💗",
      "created_utc": 1742324531.0,
      "score": 5,
      "context": [
        {
          "id": "mihc491",
          "author": "Zanci19",
          "body": "“that it’s the eating disorder feeling attacked”\n\nHoly. Thank you so much for saying it this way. I’ve also had a good bunch of posts deleted, but upon reading some of these again, they do sound quite disordered. Your words above shift the perspective completely. Thanks again.",
          "created_utc": 1742322619.0
        }
      ]
    }
  ]
}