{
  "id": "1jhhqym",
  "subreddit": "fuckeatingdisorders",
  "author": "chocolatecoveredcats",
  "created_utc": 1742674984.0,
  "title": "I’m actually healing 🥹",
  "selftext": "I heard my classmates mention specific calorie amounts about things I like eating, and instead of losing my mind over it I just went on with the rest of my day mildly annoyed. Literally 2 days later, and I don’t even remember what numbers they said! It just made me realize that even when things are tough, I HAVE gotten better. I even started going on dates and stuff, and having no problem with eating burgers or having unknown snacks afterwards. I promise it’s possible to heal!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jhhqym/im_actually_healing/",
  "score": 83,
  "num_comments": 12,
  "comments": [
    {
      "id": "mj79cy2",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1742674984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj7jzlp",
      "author": "Halaros",
      "body": "The moment when you encounter a trigger, and OVERCOME it is a great sign of recovery! I am proud of you, chocolatecoveredcats! :-)",
      "created_utc": 1742678470.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mj7aqaf",
      "author": "None",
      "body": "heyy!!! so happy for you 🤍🤍🤍 posts like this give me hope that it does get better so thank you 🙏 if you don't mind me asking; what advice would you give for managing calorie counting/ fear? its currently one of my biggest struggles",
      "created_utc": 1742675429.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mj7d914",
      "author": "Actual_Concern_1342",
      "body": "AA YES! this is awesome so happy for u ur doing ittt congrats!!! 🩷🩷",
      "created_utc": 1742676233.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjaq5yx",
      "author": "Valkyria99",
      "body": "Being recovered and seeing all those ppl talk unstoppably about food and calories really puts it into perspective how obsessed EVERYONE is with food. We at least were the brave ones to admit it and try to become better. Whenever I hear someone talk about diets and steps and calories I just zone out because I honestly couldn’t care less!",
      "created_utc": 1742731451.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj9yowc",
      "author": "NZKhrushchev",
      "body": "This is so amazing to hear! You should be really proud of yourself.",
      "created_utc": 1742714852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjezucu",
      "author": "None",
      "body": "Isn’t that the best feeling?! I still have moments when I stop and marvel at what I can do without thought, guilt, or second guessing, and it’s awesome. Congratulations!",
      "created_utc": 1742783068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjga6va",
      "author": "fgyozo_02",
      "body": "of coursee its possible to recover!! Once you give your body full permission to eat everything, slowly, slowly, everything falls into place. Obviously you'll have ups and downs, but if you push through, it all pays off. Remember, the 'healthiest' people are those that don't restrict. Your mind is clearer and life becomes so much simpler, coming from someone who considers themselves recovered. :))",
      "created_utc": 1742808836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj7fzwu",
      "author": "chocolatecoveredcats",
      "body": "For the calorie counting:\n\nI tried eating foods, snacks and meals that I have never tried before. For me it was less stressful not to know then to be aware of the calories, but I know it’s different for everyone. I also covered up the nutritional information, had other people make my meals and instead of having a pre portioned amount I would pick it out randomly. (Like getting the big bag of chips instead of small bags). It gets harder to count, and it feels stressful at first but eventually I got used to it.\n\nAnd as for the fear, a huge help was having a support system (my parents, as an example) who would comfort me and help distract me. But another important thing I did when it got hard was to remember all the good times I’ve had when food was involved, like a slumber party with pizza & my friends or having hot chocolate when I was sad. It’s nice to remember what you’re fighting for, and the good that’ll come from feeling temporarily scared. Eventually, that fear will get weaker and weaker until it doesn’t affect you anymore. The most important thing in my opinion is just to keep pushing forward! And good luck! You got this ❤️",
      "created_utc": 1742677128.0,
      "score": 15,
      "context": [
        {
          "id": "mj7aqaf",
          "author": "None",
          "body": "heyy!!! so happy for you 🤍🤍🤍 posts like this give me hope that it does get better so thank you 🙏 if you don't mind me asking; what advice would you give for managing calorie counting/ fear? its currently one of my biggest struggles",
          "created_utc": 1742675429.0
        }
      ]
    },
    {
      "id": "mj7otlk",
      "author": "None",
      "body": "I think it's helpful to buy a big bag of something and pour it in a big container without labels. It also helps me to make recipes that don't have calorie counts and I eat the amount I want in a sitting without worrying about calories. If you are buying baked goods or things from a local store, they rarely list calorie information, so that could be helpful too. \n\nCalories don't give you information on how much you actually absorb and calorie counting is not really achieving what most people think it is. I've been in higher levels of care on 4,000+ calories and I wasn't gaining weight, so that shows that calories aren't the end-all-be-all diet culture wants us to think they are.",
      "created_utc": 1742680094.0,
      "score": 3,
      "context": [
        {
          "id": "mj7aqaf",
          "author": "None",
          "body": "heyy!!! so happy for you 🤍🤍🤍 posts like this give me hope that it does get better so thank you 🙏 if you don't mind me asking; what advice would you give for managing calorie counting/ fear? its currently one of my biggest struggles",
          "created_utc": 1742675429.0
        }
      ]
    },
    {
      "id": "mjaj5r0",
      "author": "None",
      "body": "thank you guys for all your precious advice 🥹🫶🏻 everyday we will keep fighting to be better because we deserve it 🤍",
      "created_utc": 1742727724.0,
      "score": 1,
      "context": [
        {
          "id": "mj7aqaf",
          "author": "None",
          "body": "heyy!!! so happy for you 🤍🤍🤍 posts like this give me hope that it does get better so thank you 🙏 if you don't mind me asking; what advice would you give for managing calorie counting/ fear? its currently one of my biggest struggles",
          "created_utc": 1742675429.0
        },
        {
          "id": "mj7fzwu",
          "author": "chocolatecoveredcats",
          "body": "For the calorie counting:\n\nI tried eating foods, snacks and meals that I have never tried before. For me it was less stressful not to know then to be aware of the calories, but I know it’s different for everyone. I also covered up the nutritional information, had other people make my meals and instead of having a pre portioned amount I would pick it out randomly. (Like getting the big bag of chips instead of small bags). It gets harder to count, and it feels stressful at first but eventually I got used to it.\n\nAnd as for the fear, a huge help was having a support system (my parents, as an example) who would comfort me and help distract me. But another important thing I did when it got hard was to remember all the good times I’ve had when food was involved, like a slumber party with pizza & my friends or having hot chocolate when I was sad. It’s nice to remember what you’re fighting for, and the good that’ll come from feeling temporarily scared. Eventually, that fear will get weaker and weaker until it doesn’t affect you anymore. The most important thing in my opinion is just to keep pushing forward! And good luck! You got this ❤️",
          "created_utc": 1742677128.0
        }
      ]
    }
  ]
}