{
  "id": "1jidkpz",
  "subreddit": "fuckeatingdisorders",
  "author": "WildeHilde00",
  "created_utc": 1742774297.0,
  "title": "Society is sick",
  "selftext": "Ever since i started recovery and therapy i slowly but surely started noticing just how disordered society is now days. It took me the LONGEST time to understand that i had a severe eating disorder, all because so many things regarding weight loss, messed up diets etc. are so normalized, that it felt almost unnatural to NOT want that. I barely know anyone who doesn’t sometimes mention that they should lose a little weight or they need to watch what they eat etc. and it makes me soso sad, because 9/10 times it’s clearly not coming from a place of concern or actual discomfort, but almost feels like a promise that they’ll try to fit the standard better so they don’t have to fear people’s judgement. \nTruth is- so many people do the absolute most to be something that we’re clearly (naturally) not meant to be, it feels almost silly when you think about it.\nBut you don’t have to let other people’s internalized fears and disordered thinking determine YOUR life. \nLosing the weight of other peoples opinions was honestly the best weight i’ve ever lost. \nRemember that it’s HEALTHY to have a certain amount of body fat. It’s NECESSARY for weight to fluctuate. It’s NORMAL for bodies to change over the years. You are NOT your body & your body will NEVER determine your worth!!\nPlease know that your people love you - for sooo much more than your body or the food you eat to feel happy and energized!\n(and keep in mind that you probably don’t even want those superficial people in your life anyway lol)\nLet this be your reminder that it’s okay to eat your favorite food. It’s okay to snack until you’re happy and satisfied. It’s okay to go for seconds. It’s okay to want takeaways. \nEVERYTHING on this planet is so much better than a failing heart and a self destructing body, i promise.\nPlease go fuel your body, everyone deserves it!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jidkpz/society_is_sick/",
  "score": 111,
  "num_comments": 13,
  "comments": [
    {
      "id": "mjebs1s",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1742774298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjedi2u",
      "author": "_AintThatJustTheWay_",
      "body": "> Losing the weight of other peoples opinions was honestly the best weight i’ve ever lost.  \n\nStanding ovation for this line right here. So proud of the progress you've made and it's wonderful you've come back to share some positivity here with us this evening.",
      "created_utc": 1742774892.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mjed6ot",
      "author": "Cy8909",
      "body": "I really needed to see this. I’m gonna have that pizza I’ve been thinking about all day ❤️",
      "created_utc": 1742774782.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mjf76gj",
      "author": "shield_maiden0910",
      "body": "I just spent a week (spring break) with people living in Diet / Wellness Culture. When I explained that I eat all foods and consider sugar a 4th food group (lol!), they looked at me askance. This was AFTER I explained I was in recovery from Anorexia. To their disbelief I said, I'd rather eat sugar than die of an ED. It's a recovery superpower - to see Diet Culture for what it is.",
      "created_utc": 1742786003.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mjeeroo",
      "author": "Electrical_Cookie416",
      "body": "i gained some weight and really needed to see this",
      "created_utc": 1742775337.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjh34r4",
      "author": "Valkyria99",
      "body": "It’s just so stupid and honestly sad. People with all the money in the world choosing to starve to death, not eat what they enjoy, spend their day being miserable in gyms and counting artificial numbers, and all of that for what? Life is just too short for that hustle. Let’s enjoy things now that we are allowed to.",
      "created_utc": 1742822779.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjiiwv2",
      "author": "Jaded-Banana6205",
      "body": "\"It is no measure of health to be well adjusted to a sick society\"",
      "created_utc": 1742838482.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjfyq96",
      "author": "NZKhrushchev",
      "body": "Yes. Yes it is.",
      "created_utc": 1742801027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjf0p29",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742783398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjf6g7a",
      "author": "shield_maiden0910",
      "body": "That should be a t-shirt!!",
      "created_utc": 1742785698.0,
      "score": 7,
      "context": [
        {
          "id": "mjedi2u",
          "author": "_AintThatJustTheWay_",
          "body": "> Losing the weight of other peoples opinions was honestly the best weight i’ve ever lost.  \n\nStanding ovation for this line right here. So proud of the progress you've made and it's wonderful you've come back to share some positivity here with us this evening.",
          "created_utc": 1742774892.0
        }
      ]
    },
    {
      "id": "mjehdbd",
      "author": "WildeHilde00",
      "body": "So proud of you stranger! I also had Pizza today 😋♥️",
      "created_utc": 1742776268.0,
      "score": 5,
      "context": [
        {
          "id": "mjed6ot",
          "author": "Cy8909",
          "body": "I really needed to see this. I’m gonna have that pizza I’ve been thinking about all day ❤️",
          "created_utc": 1742774782.0
        }
      ]
    },
    {
      "id": "mjk9gdy",
      "author": "_AintThatJustTheWay_",
      "body": "That’s some Uncle Iroh level wisdom right there.",
      "created_utc": 1742856990.0,
      "score": 2,
      "context": [
        {
          "id": "mjiiwv2",
          "author": "Jaded-Banana6205",
          "body": "\"It is no measure of health to be well adjusted to a sick society\"",
          "created_utc": 1742838482.0
        }
      ]
    },
    {
      "id": "mjfb9tq",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking rule 2 (no weight numbers). Please contact the mods if you have any doubts.",
      "created_utc": 1742787748.0,
      "score": 2,
      "context": [
        {
          "id": "mjf0p29",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742783398.0
        }
      ]
    },
    {
      "id": "mjm3751",
      "author": "Jaded-Banana6205",
      "body": "My mannnnn!\nBut in truth it's from a stunning poem called \"the nutritionist\" by Andrea Gibson!",
      "created_utc": 1742882992.0,
      "score": 1,
      "context": [
        {
          "id": "mjiiwv2",
          "author": "Jaded-Banana6205",
          "body": "\"It is no measure of health to be well adjusted to a sick society\"",
          "created_utc": 1742838482.0
        },
        {
          "id": "mjk9gdy",
          "author": "_AintThatJustTheWay_",
          "body": "That’s some Uncle Iroh level wisdom right there.",
          "created_utc": 1742856990.0
        }
      ]
    }
  ]
}