{
  "id": "1jizvqo",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1742845499.0,
  "title": "Mod Post: enough is enough.",
  "selftext": "I’m just gonna get straight to the point—we have seen way too many posts lately bashing the mods, and frankly, it’s gotten ridiculous. So let me lay things out clearly—because apparently, some people still don’t get it.\n\n##1. The rules are non-negotiable.\n\nIt doesn’t matter whether you agree with them or not. The rules are there to keep this community safe and functional. Mods enforce them. Members follow them. If you break the rules, you’ll get a temporary or permanent ban, depending on how severe or repetitive the issue is.\n\nIf you’re confused about a rule or why your content was removed, that’s fine—**ask us**. We’re more than willing to clarify or even reinstate posts/comments when there’s a genuine misunderstanding. Plenty of users can confirm that reaching out via modmail often leads to a resolution, especially if you’re willing to edit your post to follow the rules. But if you choose to complain publicly instead of reaching out, that’s on you.\n\n\n##2. Moderator discretion applies to everything.\n\nYes, **everything**. Every post. Every comment. No exceptions. If a mod decides your content isn’t appropriate, it’s not staying up. Period. You don’t have to like it, but that’s the way it is.\n\nIf a post isn’t approved or re-approved after review, it’s because we decided it wasn’t safe or appropriate for the sub. This isn’t a democracy—it’s a community we work hard to manage for free, for your benefit. If that’s a problem for you? There are countless other subs. No one’s forcing you to stay here.\n\nWe’re not here to cater to people who just want to stir up drama, promote harmful behavior, or dodge the rules under the guise of “just expressing themselves.” If you actually care about the community and feel a removal was unfair, you’d contact modmail like a reasonable person. But the ones who skip that and go straight to public whining or harassing us? Yeah, you know who you are.\n\n##3. Public mod-bashing = permanent ban.\n\nLet me be clear: if you make a post or comment complaining about the mods instead of taking it to modmail, you’re getting permanently banned. No warnings. I’m done. We’re done.\n\nThe mod team puts in an absurd amount of unpaid time and energy to keep this space safe, and the reward lately has been nonstop harassment, insults, and even threats. It’s disgusting. You don’t have to like us, but you will respect the work we do to keep this place from turning into a dumpster fire.\n\nIf that’s too much to ask, then seriously—go find a different sub.\n\nThis community exists because people work hard to keep it functioning. If you can’t handle that, maybe the problem isn’t the mods.\n\nThanks for coming to my TED Talk, have the day yall deserve. 🥰",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jizvqo/mod_post_enough_is_enough/",
  "score": 105,
  "num_comments": 15,
  "comments": [
    {
      "id": "mjj77eb",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1742845499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjjqvo5",
      "author": "Minimum_Win_5312",
      "body": "Thank you for keeping this a safe/non triggering space.",
      "created_utc": 1742851123.0,
      "score": 47,
      "context": []
    },
    {
      "id": "mjm7vz4",
      "author": "Jaded-Banana6205",
      "body": "I'm so disappointed that y'all are getting so much pushback. Like....i get it, EDs are scary, and frustrating, and folks are used to  \"recovery spaces\" that are really just poorly disguised, pro ED cesspools. I'm very active on this sub as a recovered person and I've had lots of comments removed! Guess what? That's an opportunity to learn. To do better.\n\nI hate the growing trend of bashing and abusing group moderators. I've been seeing a big uptick in other subs. \n\nI appreciate you all so much.",
      "created_utc": 1742885982.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mjjlvja",
      "author": "SisiIsInSerenity",
      "body": "Thank you mods for all your vigilant work and for wanting the best for us individually and as a community. Actually I had a post removed the other day and it gave me pause to reflect and really redirect myself. You are promoting a place and space for healing, health, and hope, and I hope that is seen and realized. ",
      "created_utc": 1742849620.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mjjyse9",
      "author": "PrimordialGooose",
      "body": "Thank you guys for your service. I'm sure it is A LOT of thankless work. I am grateful for this sub. \n\nI have had some things removed that surprised (and initially frustrated) me, but I'm aware that I probably have blind spots, and keeping this space safe is what's most important. Cool to know we can email yall through mod mail - wasn't sure how to reach out in the event of being confused about something being taken down.\n\nThanks again 🙏 this space has been a life saver, for real.",
      "created_utc": 1742853613.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mjm9yi7",
      "author": "NZKhrushchev",
      "body": "I’ve said it before and I’ll say it again, you guys are fantastic. Sometimes I get overly irritated with posters here and you do the right thing and call me out on it. You’re awesome.",
      "created_utc": 1742887347.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mjmx5gm",
      "author": "verytiredandwired",
      "body": "Such a shame to hear you've had such negativity. I've had a post deleted as I didn't realise at the time but it actually broke one of the rules. I just accepted that I had made a mistake and the post couldn't be left up and got on with it. I'd rather know that mods were keeping everyone safe by sticking to rules than me unknowingly causing issues or big triggers for someone else. Thanks to the mods for their hard work 😊",
      "created_utc": 1742901738.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mjlty6t",
      "author": "Wrong-Tell8996",
      "body": "Hear, hear!  \nThank you mods for the work you do.  \nI followed another subreddit where the mods don't do jack shit and it's devolved into a bunch of triggering posts, dieting details, literally turning into pro-ED content and people going on about their numbers. They think putting, \"TW,\" in the title excuses it. It's toxic and I feel badly for anyone struggling that follows it hoping for help and support. Appreciate you guys staying vigilant and actually enforcing the rules.",
      "created_utc": 1742877769.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mk3x8yq",
      "author": "Admeus11",
      "body": "thank yall you make this a great place to discuss and keep things safe and welcoming. love what yall do",
      "created_utc": 1743123840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjls620",
      "author": "shield_maiden0910",
      "body": "🙏🙏💕",
      "created_utc": 1742876879.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjmov4d",
      "author": "OkStatistician6396",
      "body": "i’m so grateful for this space. thank you so much for your work.",
      "created_utc": 1742897230.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjk3lt9",
      "author": "PlaugeNurse333",
      "body": "thank you guys for all your work!",
      "created_utc": 1742855135.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjtdvig",
      "author": "Accurate-Youth-3902",
      "body": "thank you for working hard to keep this place so safe 🤍",
      "created_utc": 1742988608.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mkhbe5g",
      "author": "Cromsearchthrowaway",
      "body": "I know my reply is a bit off-topic, but I wanted to let you know that I love ur Shiki from TWEWY pfp!",
      "created_utc": 1743315902.0,
      "score": 2,
      "context": [
        {
          "id": "mk3x8yq",
          "author": "Admeus11",
          "body": "thank yall you make this a great place to discuss and keep things safe and welcoming. love what yall do",
          "created_utc": 1743123840.0
        }
      ]
    },
    {
      "id": "mki6wup",
      "author": "Admeus11",
      "body": "Aw, thank you so much! It's awesome to find TWEWY fans.",
      "created_utc": 1743335675.0,
      "score": 2,
      "context": [
        {
          "id": "mk3x8yq",
          "author": "Admeus11",
          "body": "thank yall you make this a great place to discuss and keep things safe and welcoming. love what yall do",
          "created_utc": 1743123840.0
        },
        {
          "id": "mkhbe5g",
          "author": "Cromsearchthrowaway",
          "body": "I know my reply is a bit off-topic, but I wanted to let you know that I love ur Shiki from TWEWY pfp!",
          "created_utc": 1743315902.0
        }
      ]
    }
  ]
}