{
  "id": "1jtdmu9",
  "subreddit": "fuckeatingdisorders",
  "author": "Ill-Fox-6007",
  "created_utc": 1744002606.0,
  "title": "My therapists advice about guilt around not eating \"healthy\"",
  "selftext": "I was talking with my therapist about feeling guilty or worried I wasn't eating enough fruits and vegetables and she said this. \n\nFruits and vegetables provide micronutrients, antioxidants and fiber. But those things only work if your body already feels fed, stable, and safe. Think of them as the paint and decorations on a house, not the foundation. You can’t fix a broken foundation by painting the walls.\nDuring recovery, bread matters more than broccoli. Calories matter more than variety. Comfort matters more than perfection.\n\nI asked her to type in in my notes so I can look at it whenever I feel guilty for not eating in the way my brain thinks is \"healthy\". ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1jtdmu9/my_therapists_advice_about_guilt_around_not/",
  "score": 102,
  "num_comments": 12,
  "comments": [
    {
      "id": "mltfzgu",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1744002606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlto58s",
      "author": "NZKhrushchev",
      "body": "Not to during recovery. Not restricting foods is always important.",
      "created_utc": 1744007355.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mlth512",
      "author": "Minimum_Win_5312",
      "body": "Yes! Needed this! I had a challenging dinner..and this is just what I needed!",
      "created_utc": 1744003232.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mlthill",
      "author": "Halaros",
      "body": "This is very good advice; thank you for sharing!",
      "created_utc": 1744003441.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mly97sw",
      "author": "Dizzy_Bother",
      "body": "you got a good therapist",
      "created_utc": 1744070144.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mltluuf",
      "author": "Parking_Pineapple440",
      "body": "Needed this. I’m always stressed about this.",
      "created_utc": 1744005955.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mltio6s",
      "author": "Subject-Algae-9881",
      "body": "thank you for this, this makes so much sense!",
      "created_utc": 1744004095.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mltsi58",
      "author": "Shae_was_here",
      "body": "This is so beautiful",
      "created_utc": 1744009792.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlzdlku",
      "author": "shield_maiden0910",
      "body": "I'm so grateful there are wise therapists out there. After so many horror stories...maybe she can recommend a good psychiatrist?? Or if you find a new one she could talk to them first to fill them in on your situation and what would be considered fat phobic, etc.",
      "created_utc": 1744085700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm4j7qr",
      "author": "Great-Will-1521",
      "body": "this is exactly what I need to hear/actually DO right now. thank you",
      "created_utc": 1744156111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm1wqoo",
      "author": "Extra-Blueberry-4320",
      "body": "My dietitian also uses the analogy of credit card debt with me—my body has basically maxed out every card there is and is making minimum payments to squeak by. But I need to think of calories as money and I have a lot of debt to pay off before I can operate on cash again. So I have to put a lot of food into my body to overcome the debt I’ve incurred. It helps me to realize that “healthy” is for me, pure calories that I can use easily. Helps me to frame it in my head that a peanut butter and jelly sandwich on thick bread is a better lunch choice than a salad.",
      "created_utc": 1744127604.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mlya6po",
      "author": "Ill-Fox-6007",
      "body": "Yeah she does a good job to give me pretty practical advice even tho she doesn't specialize in EDs. I wanna find a good psych to match (my current one is very indoctrinated in diet culture) but it's hard to find...",
      "created_utc": 1744070493.0,
      "score": 1,
      "context": [
        {
          "id": "mly97sw",
          "author": "Dizzy_Bother",
          "body": "you got a good therapist",
          "created_utc": 1744070144.0
        }
      ]
    }
  ]
}