{
  "id": "1k7ceci",
  "subreddit": "fuckeatingdisorders",
  "author": "Next_Consideration86",
  "created_utc": 1745555496.0,
  "title": "not eating enough actually makes u crazy lol",
  "selftext": "I am \\*mostly\\* recovered but recently I had to get oral surgery so I couldn't eat that much for the past week because it hurt like mf and let me tell you. AT LEAST 4 MENTAL BREAKDOWNS A DAY. just from having a low calorie intake for 3 days. im weight restored, my period is back, etc, but just 3 days of wayyyy less food than I normally have now to avoid pain, made me literally insane. I sat on my  couch and cried about how I was worse than everyone else, everything triggered me, self deprecating, suicidal ideations, and a bunch of stuff that doesn't even seem relevant to me now that I was finally able to 3 meals for the past 2 days, and I felt my mood improve as I could gradually eat more. idk that kinda blew my mind I thought id share. though it is the most obvious thing, like of course not eating would make you hangry and depressed but ya EDs can convince you otherwise and all I learned from this experience is I'M NEVER RESTRICTING AGAIN CAUSE ITS NOT WORTH IT I BECOME LITERALLY INSANE AND NOT MYSELF",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1k7ceci/not_eating_enough_actually_makes_u_crazy_lol/",
  "score": 140,
  "num_comments": 11,
  "comments": [
    {
      "id": "mox1vv3",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1745555496.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moxdejk",
      "author": "NZKhrushchev",
      "body": "I remember how angry my eating disorder made me, I was paranoid, scared of everything and so incredibly aggressive. I am so glad I am not that person anymore.",
      "created_utc": 1745561380.0,
      "score": 55,
      "context": []
    },
    {
      "id": "mox7ko1",
      "author": "Jaded-Banana6205",
      "body": "Every once in a while I'll have a stomach flu, or when I had COVID, etc where I really can't eat much.  And man, when I feel how confused and irritable and disassociated I get, even a decade into recovery, I feel so damn sad that I felt the need to hurt myself like that.  That I committed such an act of violence against myself.",
      "created_utc": 1745558254.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mox41o9",
      "author": "monsterintheuniverse",
      "body": "Needed to hear this today",
      "created_utc": 1745556503.0,
      "score": 22,
      "context": []
    },
    {
      "id": "moypl13",
      "author": "None",
      "body": "this is so true!! in the midst of my disorder and during lapses i always got SO irritated and uncontrollably snappy that i didn’t feel like myself anymore; it felt like it was automatic though i tried to “keep my emotions under control”. i was also much more susceptible to stress despite telling myself that it’d be the opposite. now, i actually feel significantly more stable and can navigate stressful situations in a collected manner! who knew that proper nutrition is indispensable 😭 /s",
      "created_utc": 1745586406.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mp0bhxq",
      "author": "girlinthetrees",
      "body": "Seriously!!!!! I had a clean my closet day about a month ago and I put off eating when my body was clearly telling me it was hungry.  I ended up having a full blown panic attack and it did not settle until I ate. I ate, and I was completely fine. My recovering body is not messing around! It's like feed me now or I'm gonna lose it!!",
      "created_utc": 1745603648.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mp0ccng",
      "author": "notmybaggage",
      "body": "This past week I’ve been feeling the same. I have found myself unintentionally eating less due to a lack of appetite and it’s so easy how quickly the negative thoughts and the ed rears its nasty head when you find yourself in energy deficit 😭 food is truly the medicine of life",
      "created_utc": 1745603891.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mp0dam7",
      "author": "Short_Bed2499",
      "body": "oh my gosh I relate to this so much. I feel like a shell of myself when I don't eat now. It's kind of intense and makes it difficult when I am sick. Like this week one morning I threw up my breakfast because I felt nauseous from my medication and it totally threw off the next few days because I missed out on those calories. It's crazy how much difference it makes!!",
      "created_utc": 1745604162.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mq23cqt",
      "author": "Jumpy_Designer_9548",
      "body": "BESTIE THIS IS INCREDIBLE \n\ncan I please ask you how you did it!? get to *almost* recovered I mean?",
      "created_utc": 1746122497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp1396j",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1745611984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp1399g",
      "author": "AutoModerator",
      "body": "This post has been removed because our automoderator detected it as spam. If you believe this action was made in error, please **report** this comment to bring it to the attention of the moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1745611984.0,
      "score": 1,
      "context": [
        {
          "id": "mp1396j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1745611984.0
        }
      ]
    }
  ]
}