{
  "id": "1l0vokf",
  "subreddit": "fuckeatingdisorders",
  "author": "AlliteraryAnalysis",
  "created_utc": 1748801490.0,
  "title": "I've never been happier to be fat",
  "selftext": "As the title said, I am so happy right now. I finally got to the point where my weight is just a number to me. I don't know how. I'm the heaviest ive been in four years and I've never been happier about it. I'm very visibly overweight as of right now, and I started recovery right when I hit a \"\"normal\"\" BMI (ugh, stupid scale). \nIt just goes to show: If you start hating your body, you'll never end up loving it for what it is by forcing it to change. Take that, eating disorder.\nMy fiance and I are getting married next month (if all things go well). We affectionately call me fat and chubby and I've never felt cuter before in my LIFE (I'm sorry if it's cheesy or cringey to say hsjfkg).\n\nI'm still pretty early in recovery and I know I'll have more ups and downs. I just really REALLY wanted to share this with someone because all of my friends are asleep.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1l0vokf/ive_never_been_happier_to_be_fat/",
  "score": 136,
  "num_comments": 16,
  "comments": [
    {
      "id": "mvgdk4d",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1748801490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvh1vxv",
      "author": "None",
      "body": "this is such a cute post i’m so happy for you 🩷🩷🩷",
      "created_utc": 1748808872.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mvgreou",
      "author": "molbrae435",
      "body": "this made me smile.",
      "created_utc": 1748805659.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mvi3r0u",
      "author": "skatemon3y",
      "body": "This post gave me hope lol thank you🥹",
      "created_utc": 1748821435.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mvhxo5v",
      "author": "feeblelittlehorse",
      "body": "❤️❤️❤️",
      "created_utc": 1748819319.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvj4woq",
      "author": "girlinthetrees",
      "body": "Congratulations!!!!!! I'm getting closer everyday to that freedom. I can't wait!!",
      "created_utc": 1748835779.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mvjnj6k",
      "author": "pumpkin_g92",
      "body": "Thanks so much for this post, you are a blessing!\n\nCan I ask you how you started the recovery journey, if and only you want to share?\n\nI'm 32, and suffer since 15 years and I'm not underweight... I want so much to go all in, but I'm also so so much scared.\n\nThanks again from the bottom of my soul!",
      "created_utc": 1748845109.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvj73pn",
      "author": "weightgainjournal",
      "body": "congratulation on both your recovery and future marriage. Wish you all the best",
      "created_utc": 1748836763.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvjmrj3",
      "author": "NZKhrushchev",
      "body": "I’m so happy for you. Life is immensely better once you start to fight the ED.",
      "created_utc": 1748844676.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mvkcmq0",
      "author": "Maximum-Flamingo-976",
      "body": "Aw good for you, as you should! Hoping to get here too - any top tips?",
      "created_utc": 1748860039.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mvmoeht",
      "author": "among_flowers",
      "body": "u/Current-Table-660\n\nus in 10 years?",
      "created_utc": 1748887792.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvmq7ga",
      "author": "lumpy_space_queenie",
      "body": "I hope I can be this way someday",
      "created_utc": 1748888309.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mw1jmwu",
      "author": "still-rising",
      "body": "This gives me so much hope. Thank you and congratulations 🥹",
      "created_utc": 1749079448.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mzafnpm",
      "author": "Illustrious_Joke1949",
      "body": "this makes me feel so comforted you don't even know how much this helped me. I hope you only get happier in life mwah",
      "created_utc": 1750662241.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvkqt5n",
      "author": "AlliteraryAnalysis",
      "body": "I had a moment where I was so fed up with my ED that I felt I had to recover because I was miserable and sick. I had fainting episodes and I had cuts that would never heal.\n\n That gave me the courage to start, and finally feeling some sort of peace gave me the courage to keep going. It took a little to be able to accept my  new body and that it was going to keep changing, so I stayed away from mirrors and tried to keep myself off of social media and the scale. It's all internal work when it comes to being okay with weight gain and I was scared for a while.\n\nI say do it, go all in. You are worth living a life that you want to live. Do it scared, and the fear will go away eventually",
      "created_utc": 1748866556.0,
      "score": 8,
      "context": [
        {
          "id": "mvjnj6k",
          "author": "pumpkin_g92",
          "body": "Thanks so much for this post, you are a blessing!\n\nCan I ask you how you started the recovery journey, if and only you want to share?\n\nI'm 32, and suffer since 15 years and I'm not underweight... I want so much to go all in, but I'm also so so much scared.\n\nThanks again from the bottom of my soul!",
          "created_utc": 1748845109.0
        }
      ]
    },
    {
      "id": "mvkrtkz",
      "author": "AlliteraryAnalysis",
      "body": "My biggest one is staying away from social media because I would be so inclined to compare myself and even my journey and what I ate with random people. \"Recovery\" content isn't recovery oriented outside of people like Emily Spence who puts out reassuring content (e.g. \"honor your extreme hunger even if it means attacking a cake with a fork\" (not a direct quote)), I've found. \n\nAnother thing: Give yourself grace. The \"All or nothing\" kept me relapsing and stuck mentally. When I realized that a mess up was just a mess up and I could keep going with recovery, I actually began to heal because I no longer punished myself for going against recovery, helping me stop the guilt of being in recovery because what kept me stuck in the ED was guilt",
      "created_utc": 1748866959.0,
      "score": 3,
      "context": [
        {
          "id": "mvkcmq0",
          "author": "Maximum-Flamingo-976",
          "body": "Aw good for you, as you should! Hoping to get here too - any top tips?",
          "created_utc": 1748860039.0
        }
      ]
    }
  ]
}