{
  "id": "1lyp86q",
  "subreddit": "fuckeatingdisorders",
  "author": "chococrepedreams",
  "created_utc": 1752401119.0,
  "title": "Hard Facts for Recovery",
  "selftext": "(in case you needed to get slapped with it today.)\n\n- No, it will *not* go away by itself. That’s like just waking up to find your garden suddenly void of all weeds and parasites. Nope. You have to get out there and *weed.* I don’t care if it’s tiny steps or huge bounds. In fact tiny steps are underrated. IDC if it’s pulling one root or dropping a chemical bomb on the bugs, you have to do *something.*\n\n- No, you probably won’t get praise and applause for every victory, and maybe that sucks. But also consider that this is a journey. The prize of love and respect comes at the end when you prove that, yes, you *can* do it.\n\n- No, your suffering is not cool and holy and deserved. You are impressing no one by making it harder on yourself to recover. You are making no one proud by your intentional suffering from something you really shouldn’t be suffering from. And/Or have been suffering from a long time. If anything you impress people more by doing recovery, because that takes mad resilience and strength.\n\n- Stop procrastinating. Tomorrow is already here and you are running out of time. The longer this goes on the worse your body gets, the harder it becomes to recover. Do it while it’s easier before it’s too hard to handle.\n\n- Shaming and self-hating yourself into recovering doesn’t work in the long run. You have to learn *some* self-care along the way. Call it what you want, self-care, self-love, etc, but it is *not* sappy and selfish to do the bare minimum. Literally who are you impressing by hating yourself? Who?? Be a little nicer, even just a *little* (I mean like use your favorite emojis. Wink at yourself in the mirror. Dance), and things get a little better. \n\n- Little steps, scared steps, quiet steps are still steps. Take them before they take you.\n\n- Change is scary yeah but it’ll happen anyway. Might as well make it a good change.\n\n\nAn add on for those that feel ashamed:\n\nYes. There will be shame. There will be regret, and there will be sadness and anger that you just can’t be better. It is OK to feel this. It is normal, even. Allow yourself to feel it. But do not let it saturate you. Let the shame have its stay, and then see it out. It may hurt. It may not feel right. But shame is an occupant that too often overstays its welcome.\n\nFeelings are weird and hard and they hurt sometimes. One of the most challenging parts of recovery is facing yourself and choosing to be better. So yes, you may feel ashamed right now, and I say again that is normal. Just be careful not to let it overwhelm you. Take the shame gently with your hands and mold it into determination to improve, into an all-the-more reason to recover so you never have to feel it again.\n\nIt’s ok if this is hard for you right now. It was never supposed to be easy. But when you do overcome that shame, that hurt—it will be all the more glorious. And I am already so happy for you.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1lyp86q/hard_facts_for_recovery/",
  "score": 111,
  "num_comments": 17,
  "comments": [
    {
      "id": "n2vhmzj",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1752401119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2xk54g",
      "author": "mmasusername",
      "body": "Oof. I needed this. Especially the 3rd bullet. Why do I feel the need to suffer to be seen as special / worth paying attention to? Why do I need to be “the girl with the ED”?",
      "created_utc": 1752428159.0,
      "score": 21,
      "context": []
    },
    {
      "id": "n2x4i9p",
      "author": "Purple-Judgment-1370",
      "body": "This should be pinned in this sub 🙌",
      "created_utc": 1752423531.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n2x31nb",
      "author": "americano-enthusiast",
      "body": "Thank you so much for this! I needed someone to slap me with some hard truths today 🫡\n\n> No, your suffering is not cool and holy and deserved. You are impressing no one by making it harder on yourself to recover.\n\nThis especially. The victim complex my ED tries to get me to grasp onto is such bullshit. Looking back on the way I used to act makes me cringe horribly. God bless my friends for not leaving my ass in the dust 😭\n \nI’m getting better everyday, bit by bit, and these posts really help me—so thank you!!🤍",
      "created_utc": 1752423086.0,
      "score": 11,
      "context": []
    },
    {
      "id": "n2xikcz",
      "author": "luaissad",
      "body": "I seriously needed this today (and maybe every day if I’m entirely honest with myself and how I’ve been recently). Thank you for this post, I really appreciate it.",
      "created_utc": 1752427710.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n2xww8a",
      "author": "Resident-Question440",
      "body": "I LOVE YOU",
      "created_utc": 1752431907.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2zao5f",
      "author": "shiny99Goatie",
      "body": "These are very true.  Especially the 3rd to last one Ab self-shaming",
      "created_utc": 1752447234.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3bnxz7",
      "author": "sorcerers_apprentice",
      "body": "Big emphasis on point #2. Recovering in silence, and largely alone, is one of the hardest things I’ve done. Most people don’t care - you need internal motivation.",
      "created_utc": 1752610162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3nyuwo",
      "author": "MeiowleN",
      "body": "Reading this kinda got my head out of the mental trashcan for today. Ima go eat the handful nuts I’ve been considering about for an hour now.",
      "created_utc": 1752772693.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n303nar",
      "author": "turnipkitty112",
      "body": "I really, really needed this. Thank you. I love the garden analogy, as an avid gardener myself!",
      "created_utc": 1752457382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n30wa08",
      "author": "Beck_bo",
      "body": "Love this. Needed it and just so true!! Just a reminder...YOU ALL GOT THIS!!! We are stronger than we realize!!!",
      "created_utc": 1752469009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n333383",
      "author": "applesandpebbles",
      "body": "thank you so much for this. i hope you’re taking some of this advice for yourself, too. you deserve it :)",
      "created_utc": 1752504743.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2yeepz",
      "author": "Jaded-Banana6205",
      "body": "Because EDs are controlling and manipulative. For a lot of people, there's an element of \"any attention, even bad attention, is better than none.\" Because pro ED bullshit tries to romanticize your suffering, when in actuality the majority of people are just confused as to why you're not eating.",
      "created_utc": 1752437154.0,
      "score": 9,
      "context": [
        {
          "id": "n2xk54g",
          "author": "mmasusername",
          "body": "Oof. I needed this. Especially the 3rd bullet. Why do I feel the need to suffer to be seen as special / worth paying attention to? Why do I need to be “the girl with the ED”?",
          "created_utc": 1752428159.0
        }
      ]
    },
    {
      "id": "n30zzsc",
      "author": "AlliteraryAnalysis",
      "body": "I've personally always been the one in my friend group who loved being sick because then I'd be cared for. EDs love latching onto that wish to be cared about",
      "created_utc": 1752470841.0,
      "score": 5,
      "context": [
        {
          "id": "n2xk54g",
          "author": "mmasusername",
          "body": "Oof. I needed this. Especially the 3rd bullet. Why do I feel the need to suffer to be seen as special / worth paying attention to? Why do I need to be “the girl with the ED”?",
          "created_utc": 1752428159.0
        }
      ]
    },
    {
      "id": "n30r820",
      "author": "NovaaStarrr",
      "body": "Felt this sm like why is my brain happy when I’m at my sickest",
      "created_utc": 1752466671.0,
      "score": 2,
      "context": [
        {
          "id": "n2xk54g",
          "author": "mmasusername",
          "body": "Oof. I needed this. Especially the 3rd bullet. Why do I feel the need to suffer to be seen as special / worth paying attention to? Why do I need to be “the girl with the ED”?",
          "created_utc": 1752428159.0
        }
      ]
    },
    {
      "id": "n2y381q",
      "author": "Hot-Algae1324",
      "body": "pls don’t be so hard on yourself… your body and mind were starved. of course your body is going to biologically make you crave care from other people because this is its last-ditch effort to keep you alive and safe. i hope you can forgive yourself ❤️",
      "created_utc": 1752433798.0,
      "score": 6,
      "context": [
        {
          "id": "n2x31nb",
          "author": "americano-enthusiast",
          "body": "Thank you so much for this! I needed someone to slap me with some hard truths today 🫡\n\n> No, your suffering is not cool and holy and deserved. You are impressing no one by making it harder on yourself to recover.\n\nThis especially. The victim complex my ED tries to get me to grasp onto is such bullshit. Looking back on the way I used to act makes me cringe horribly. God bless my friends for not leaving my ass in the dust 😭\n \nI’m getting better everyday, bit by bit, and these posts really help me—so thank you!!🤍",
          "created_utc": 1752423086.0
        }
      ]
    },
    {
      "id": "n2y3rzc",
      "author": "americano-enthusiast",
      "body": "This is so sweet—thank you! You’re absolutely right though, we need to remember to be gentle with ourselves and forgive our past behaviors. 🤍🤍",
      "created_utc": 1752433965.0,
      "score": 4,
      "context": [
        {
          "id": "n2x31nb",
          "author": "americano-enthusiast",
          "body": "Thank you so much for this! I needed someone to slap me with some hard truths today 🫡\n\n> No, your suffering is not cool and holy and deserved. You are impressing no one by making it harder on yourself to recover.\n\nThis especially. The victim complex my ED tries to get me to grasp onto is such bullshit. Looking back on the way I used to act makes me cringe horribly. God bless my friends for not leaving my ass in the dust 😭\n \nI’m getting better everyday, bit by bit, and these posts really help me—so thank you!!🤍",
          "created_utc": 1752423086.0
        },
        {
          "id": "n2y381q",
          "author": "Hot-Algae1324",
          "body": "pls don’t be so hard on yourself… your body and mind were starved. of course your body is going to biologically make you crave care from other people because this is its last-ditch effort to keep you alive and safe. i hope you can forgive yourself ❤️",
          "created_utc": 1752433798.0
        }
      ]
    }
  ]
}