{
  "id": "1m1gzmn",
  "subreddit": "fuckeatingdisorders",
  "author": "ExistingWallflower",
  "created_utc": 1752682777.0,
  "title": "Don't wait",
  "selftext": "For a long time I convinced myself that I needed to hit \"rock bottom\" to deserve to recover- that one day, I would have a dramatic revelation and suddenly believe that I'm worth the effort. That mindset kept me sick for years. \n\nWhen I finally did enter recovery it was for no other reason aside from being utterly fed up with my life. I made the decision on a random Monday; no hospitalization, no come-to-jesus with a loved one, no arbitrary \"sick enough\" goal met. If you have a part of you that wants to live, no matter how small, that is more than enough. I desperately wish I could go back to the version of myself who spent so long postponing that initial leap and tell her that it is SO WORTH IT. \n\nThere is no perfect time to start recovery, and there is no wrong time either. You don't need to prove your suffering to anyone- ESPECIALLY not your eating disorder- before you deserve to take action. You are worthy of so much more than this life. I hope each and every one of us is able to find peace.\n\n(Sorry if this was overly preachy- I was just reflecting on my progress today and feeling sappy 🥹)  ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/1m1gzmn/dont_wait/",
  "score": 89,
  "num_comments": 5,
  "comments": [
    {
      "id": "n3gu2p5",
      "author": "AutoModerator",
      "body": "Thank you for posting in r/fuckeatingdisorders! To access recovery worksheets, articles, and other resources, visit our[Wiki!](https://www.reddit.com/r/fuckeatingdisorders/wiki/index/). You can also find our rules and links to help lines on our sidebar widget.\n\nIf you haven't done so already, try utilizing the search bar for commonly posted topics including extreme hunger or periods/menstruation. We have an active community who frequently share their experiences and suggestions. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1752682778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3h8dur",
      "author": "BenjitheHerd",
      "body": "I've hit rock bottom a few times, and it helped, but it wasn't as much of an epiphany as I wanted it to be. OP, your message is strong. There isn't a use in waiting to start recovery, because even something like rock bottom might not be enough for some folks.\n\nWish I had half your strength, stay well!",
      "created_utc": 1752686796.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n3hri9p",
      "author": "Double_Network_2573",
      "body": "So proud of you and you are so right. I realized nobody's gonna do this for me and I was tired of fighting my body, frankly I COULDNT fight it anymore. There is so much more to life, friends",
      "created_utc": 1752692010.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n3m4q8n",
      "author": "annie104",
      "body": "This is great and extremely true. Some of the most important choices are made on some random Monday",
      "created_utc": 1752752932.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n3h1lmz",
      "author": "pumpkin_g92",
      "body": "Thanks for this. I’m “fine”, weight restored I’m saying like an excuse but I’m in a deep deep deep sorrow for more than 15 years.",
      "created_utc": 1752684964.0,
      "score": 13,
      "context": []
    }
  ]
}