{
  "id": "a3rm8s",
  "subreddit": "fuckeatingdisorders",
  "author": "avoao",
  "created_utc": 1544126307.0,
  "title": "Realizing something really funny",
  "selftext": "I've been making a real effort to recover now for about a week, after a half-assed attempt that was just disguising a relapse. I'm realizing that my eating, exercise, and emotional habits have not been normal since I was a very small child, and that alone is really striking. Over breakfast, while I was trying out intuitive eating for the 3rd day in a row, I thought about something that almost made me laugh out loud.\n\nNeeding to eat is as natural as needing to pee. However:\n\n* I do not strictly regulate and measure my urination like I do with my food\n* I do not feel guilty for indulging in my biological need to pee \n* I do not refuse to honor my urge to pee, I pee as soon as I first need to\n* If I pee more one day, I do not compensate by drinking less water or punish myself by making myself pee again\n* I know that if I tried to restrict my peeing behaviors, I would die\n* I do not obsess over what I'm drinking and how my kidneys are functioning and when I'm next going to pee\n* I do not use peeing to cope with feeling sad, lonely, angry, or stressed, and I do not celebrate something happy with going to pee\n* I do not mindlessly pee, or force myself to pee even when my bladder is empty\n\nYou get the picture. It's now amazing to me how out of touch I have become with my hunger and fullness, these natural bodily functions that should be as intuitive and effortless as peeing. I wouldn't imagine trying to reduce my water intake so I could pee less, but somehow that is okay with food and eating. I'm starting to see how messed up I've been for so long, and while it feels like such a long way to being better, I know I can do it. If I can pee, I can eat. Intuitively, effortlessly, healthily. I'll get there someday.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/a3rm8s/realizing_something_really_funny/",
  "score": 93,
  "num_comments": 5,
  "comments": [
    {
      "id": "eb90p43",
      "author": "viviann1027",
      "body": "This is a great post. Thanks! ",
      "created_utc": 1544137920.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eb94j77",
      "author": "ThatOnePotential",
      "body": "This! I've heard this analogy before but it's really important to bring up. None of us was born with ED behaviors; infants and small children know when their hungry and when they are full. It's just we get our brains and society involved and get so out of touch with our normal, natural, animal impulses. \n\nYou might enjoy the following video which touches on this and really helped me realize that we all have hope to get ourselves back to where we started [https://www.youtube.com/watch?v=Pf1j8\\_584hY](https://www.youtube.com/watch?v=Pf1j8_584hY) I hope it's useful to you too.",
      "created_utc": 1544140686.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eb9vahz",
      "author": "None",
      "body": "This analogy is wonderful and reminds me of an encounter I had with a college classmate:\n\nShe and I had been studying for hours, and she said she needed to pee. There was a nice bathroom within ten steps of us. But she said, \"No no, we have the finish these [very long] problems first!\" \n\nA little while later, I noticed how distracted she was and said, \"Dude, shouldn't you go?\" \n\n\"No!! I need to have *control* over my body!\" \n\nIt was so absurd and surprising that I started laughing (then I felt bad and stopped.) I told her, \"Hey, it's your choice. You just seem distracted by it, and I also think you might get a UTI if you don't go.\" She finally did. \n\n(I just realized I must sound that way to my boyfriend, when I tell him I've been fasting or restricting or eating food I dislike for no real reason.)",
      "created_utc": 1544164484.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eba57eu",
      "author": "quincess912",
      "body": "This is actually amazing, and a really interesting perspective. Thank you!",
      "created_utc": 1544181702.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ebh1k6v",
      "author": "pretty-precocious",
      "body": "Lmao \\^\\_\\^ thanks for the reality check. ",
      "created_utc": 1544410269.0,
      "score": 1,
      "context": []
    }
  ]
}