{
  "id": "a9fno7",
  "subreddit": "fuckeatingdisorders",
  "author": "PizzaIsASuperfood",
  "created_utc": 1545751918.0,
  "title": "For the Asian women out there (if you are out there)",
  "selftext": "**For Asian women out there (if you are out there)**:\nI do not think that there is enough media or conversation about disordered eating in the Asian diaspora. Asian women ages 18-24 have one of the highest suicide rates, and I believe that this rate is only magnified when you narrow this pool to firstborn Asian women. This is for a number of reasons that I can't go into here, but I say this to underscore the need to acknowledge that Asian women are under a lot of pressure and have underserved mental health needs. \n\n**I found it incredibly difficult to find any therapist** who would understand the complicated family dynamics in an Asian family-- particularly because there are a number of cultural norms in Asian culture that could easily be pathologized under the Western lens. (For example, even the notion that you are not a full adult until you get married or have children - that plays out in a number of ways in an Asian household, but could be construed as lack of \"individuation\" in Western psychoanalytic theory). Revealing my story to a well-intending but uninformed White therapist constantly put me at risk of feeling like Amy Tan. Yes, my parents did encourage me to finish all the food in my bowl. No, I do not think this made me feel that I lacked control over food in my childhood years. No, they did not admonish me and say that the number of rice grains I left in my bowl would be each a pockmark on my future husband's face. (I think that's a different generation or a different region...) But what I am saying is that there are a number of stereotypes about any minority group that the majority group will have, whether they are aware of it or not, and so the risk I felt I was taking with explaining my story to any White mental health professional was that I'd reveal one thing in a session, and spend the next two defending my parents or clarifying / contextualizing everything. This makes it very challenging to move forward in therapy, and probably another reason why I felt that psychodynamic or analytic therapy was not going to be useful to me for eating disorder recovery. I do not want to go to therapy, spend time and money, only to be reminded that I am perpetually perceived as a foreigner. \n\nFrequently comorbid with any form of disordered eating is the diagnosis of borderline personality disorder. You may be familiar with the diagnostic criteria - a chronic sense of emptiness, lack of sense of self, sensitivity to rejection. Even if ED sufferers fall short of meeting the diagnostic criteria, eating disorders are frequently conceptualized in the Western discourse as manifestations of low self-esteem and/or an underdeveloped sense of self and comfort in one's needs and wants. \n\nI do not think that I have borderline PD, but what I am saying is that **Asian women are frequently brought up _to be sensitive to everybody else's needs, and to put others first_.** My one job (ha, okay, that is not true - I had many jobs) would be to anticipate what other people in my household wanted. Trained to practice piano and do the dishes without being asked. Trained to know when I could and could not ask for something from my parents. Trained to know that my parents did not want to hear about my boyfriend. Is that a pathology? Has that led to a fractured or stunted sense of self? Or is that a cultural norm? There is a reason, after all, that many of my Asian friends are well aware of what their parents expect of them, without their parents ever saying anything directly to them at all. Their parents might sigh loudly, or bring up a highly successful family friend's daughter or whatever, and your job as an Asian child is to take the hint and understand that these are standards and goals being set, and act accordingly. The household is imbued and guided by aversion to these invisible force fields of shame and loss of face. No direct requests verbalized. I visited Japan last year and remember reading a quote that went something along the lines of this: \"Japanese people can say one word, and ten things would have been communicated. Foreigners will say ten words, only to communicate one idea.\" Asian culture is far less direct and explicit, and so much of that gets lost, if not problematized, when examined under the Western lens. \n\nI have frequently been disappointed with the Asian American discourse on mental health. So much of it talks about pervasive \"stigma\", makes some statement about how diverse Asians are within the \"Asian\" label, and drops the ball beyond that. Sometimes it will talk about how Asians tend to \"somaticize\" their psychological symptoms because physical symptoms are more socially acceptable than psychiatric symptoms. I have always wondered, what if it's just that Westerners are on a different wavelength when it comes to expressing distress and deem that the only \"civilized\" way to express psychological distress is verbally? Is it stigma, when the fact is my parents and grandparents and generations before endured years of famine, and so they do not have a word to describe anorexia nervosa, and sincerely find it hard to imagine that somebody would compulsively refuse food? I once asked my parents why they didn't consider psychotherapy, and saw my own answer staring me in the face: \"We grew up in a totally different society. Our parents were orphans, and we never knew our own parents (due to the political turmoil going on at the time). Propaganda, starvation, labor camps. Even if I could overcome the language barrier, how am I going to find a therapist who can even begin to understand?\"\n\nThe conversation on Asian mental health also doesn't talk nearly as much about how Asian women are brought up and encouraged to behave, and the side effects they face when they have been raised to hone that interpersonal sensitivity -- to pick up on what everybody else in the room wants and expects, to have an innate sense of hierarchy, and, in the academic/professional realm, to rapidly adapt to and excel an educational system that one's parents are completely unfamiliar with-- with this comes a sensitivity and awareness of other cultural expectations -- for example, with regards to appearance and diet and expectations on how a woman should be eating; with what is considered \"healthy\". Women in Western society are already in that position, with objectification and media and beauty standards as they are, but it becomes much more challenging when a minority identity (particularly a visible minority identity) is thrown into the mix. \n\nThe fact of being a minority is that you are going to be grouped in and compared to the stereotype. If the stereotype of an Asian woman is that she is cute, quiet, docile, nonconfrontational, academically high-achieving, and tiny, then any Asian woman who falls outside of that outline will be seen as brash, loud, defiant / a \"Dragon Lady\", and \"fat for an Asian\". Both are dehumanizing. I know I have struggled with trying to reconcile what is truly me, what is expected of me from my Asian community and family as well as the majority / Caucasian community.\n\nAnother aspect that eating-disordered patients are typically thought of as experiencing is that they grew up in households in which they felt \"unseen\" and their needs and wants, and their inner worlds unacknowledged. I want to point out here that being a child of immigrants or living in an immigrant household, especially when your parent culture is a non-Western one, is a set-up for misunderstandings and a significant possibility of feeling \"unseen\" in the household. How could my parents really \"see\" me when they don't understand the US educational system, don't understand what it is like to grow up in relative material security, don't understand dating and social norms in this country? It's not that it is not a problem, but I guess what I'm trying to say is that it is not as much of a psychopathology as it is a mere collateral effect of moving halfway across the world. It is hard to leapfrog up from basal levels of Maslow's hierarchy up to self-actualization (or even love and acceptance) in a mere generation. \n\n**Regarding parents with their lack of filter** - I have this feeling that if I complain about the insensitive remarks my parents make (especially on the internet), this will be met with vitriolic outrage about how cruel my parents are, how I should avoid \"toxic\" people. Telling an Asian woman that her parents are definitely negative influences, without looking deeper into where these comments are coming from, is a divisive and unnuanced approach. I do not think my parents are necessarily toxic people. I think that many Asian parents, mine included, love their children dearly and generally see their children as extensions of themselves (which again makes \"individuation\" less straightforward). My parents have spewed tons of tone-deaf, insensitive remarks, but I also think that they have a different relationship to food and their bodies, (or they might be speaking out of concern for body conformity, since I do think that Asians have a narrower range of what is considered 'acceptable' weight, and fitting in is so important to Asians), so even if the comments come off as reeking of judgement, I think that when people have more neutral relationships to their food and to their bodies, comments that may be seen as \"insensitive\" are, in reality, simply comments. My parents may not hesitate to come up to me and tell me, point blank, that I have put on weight, because in their minds, having put on weight is not associated with the same moral shortcomings and devaluation that it might be in Western society. It doesn't feel great, but I think that helps me put it into perspective and also reminds me of an alternate relationship with one's body that I too someday might be able to espouse. I once asked my dad about his commenting, and he shrugged and said, \"bodies change over time.\" I think that is one of the strengths or protective factors that I feel fortunate to have had as an Asian American -- that is, I've had a good amount of exposure to a \"traditional\" way of eating and movement that is not susceptible to fad diets and superfoods. \n\nThis brings me to another point: the pink, rah-rah, \"love yourself, ignore the haters, HAES\" instagram community of recovery warriors, is culturally White. It does not resonate at all with my own sense of how self-esteem is cultivated. If anything, I feel that the overt emphasis of needing to \"love oneself\" hints at an underlying insecurity -- as if it is trying to compensate for something missing. This is why I think the neutrality I described above is, actually, a wiser and more sustainable attitude. Call me Asian or too hard on myself or whatever, but growing up, I was always nonplussed at how everybody got a certificate for participation, and at how much grade inflation there was. I do find myself sometimes wishing that people would be okay with giving honest feedback about things instead of having to deliver them in the form of \"feedback sandwiches\" (start off with one good thing, give them one negative thing, and end with another compliment). My ego can take it. \n\n**For those who are \"fat for an Asian\":** This is definitely a thing. You can be skinny for an American (or a Brit, Canadian, or Aussie, or whatever you are), but feel ginormous when visiting your parents' home country in Asia. It is easy to feel stuck and invisible in this in-between gray zone haze. In my case, throughout my disordered eating, I knew that although my ED had led me to gain weight, I knew I was still well within the officially \"healthy\" range. I still wore XS clothing sizes in the US. This had the effect of making me feel like I had \"no right\" to voice concern about my increasing weight to my American physician, because I would still be seen as \"normal\" and perhaps even told that I had undue body-image anxiety, which was not personally the case for me in my disordered eating. But I felt sluggish and uncomfortable from the weight I had gained from my disordered eating patterns, and I felt that the weight really was too much for my frame. \n\nThere are multiple challenges here and I don't know if I can adequately capture this in one post, but one aspect of this is that although the medical research on Asian populations is relatively sparse, research has suggested that Asians _do_ have a different biology than the Caucasian majority in the West. We metabolize certain medications differently; we also have a different body composition determined by genetics. This has been slowly recognized in the medical community, but I do not think that this is recognized by many doctors. Asians have, across the board, an elevated risk of developing Type 2 diabetes, even at normal or low BMIs. The BMI cut off for \"overweight\" in Asians has been determined by the World Health Organization to be 23, not 25. A \"natural\", normal BMI (while a flawed measure) for an Asian woman (depending on her ancestry within Asia) may well be 18 or 19. So, it is not entirely false that Asians are, on average, smaller than their Caucasian counterparts, and that if you feel that your body size is over what is healthy for your frame (and if it is not the body dysmorphia or Asian parent talking) this may well come with real health risks that ideally should be recognized and worked on with your physician. I say this with the caveat that **I strongly believe that these health risks (of diabetes, for example) should be addressed _only after eating disorder recovery is well underway_.** It will be impossible to make dietary modifications or lifestyle changes when one is mired by disordered eating behaviors. \n\nAnother reflection I offer here on being \"America skinny but China fat\" is that humans... organisms... respond to their environments. You may have read that Japan and Korea were able to increase the average height of their population by improving available nutrition in their respective countries. The gut microbiome actually changes with each generation after immigration to a Western country. Well, your body is going to respond to growing up in a Western country in kind. I find myself wondering if I would be shorter than my current height (which is still short, but taller than my mother) if I had not grown up with dairy milk in my refrigerator growing up. I have a cousin who grew up in Germany, and she is taller and larger than anybody in my family, and we attribute that to the meat she ate growing up (as well as the relative dearth of Asian food in Germany). Organisms respond to their environment. Seeds will flourish differently depending on the soil they are planted in. No surprise there. Not a moral shortcoming or flaw. \n\nIf anybody wants to talk, feel free to PM me or post here. Or, if you think anybody you know would relate to this post, you can also share it with them. ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/a9fno7/for_the_asian_women_out_there_if_you_are_out_there/",
  "score": 228,
  "num_comments": 12,
  "comments": [
    {
      "id": "ecj1f9c",
      "author": "HolyCrepe215",
      "body": "First generation Chinese American woman here (moved to the US when I was 11). I hear what you are saying about the added layer of complexity you have to deal with in your recovery I.e. explaining to your therapist about intricacies of Asian culture. For that reason, when I was in therapy (not ED, but for a myriad of other issues) I specified that I wanted an Asian American female therapist. Ended up with a Korean American woman in her 40s/50s. While my therapy only lasted a few months due to other issues, having someone who could understand where I am coming from culturally saved a lot of time and frustrations. Might be worthwhile to look into if there are therapists in that demographic where you are - I’m in NYC so it may be more readily available here than elsewhere.\n\nOne thing I will challenge you on is the idea that some aspects of Asian culture are “pathologized” in the Western point of view without any merit. Honestly I can name countless instances of Asian customs/practices/cultural norms that are throughly toxic, objectively. I think it’s important to call a spade a spade - there’s a reason why the suicide rate for young Asian women is so high. If a culture is leading otherwise healthy individuals to kill themselves, it’s time to re-examine the culture.",
      "created_utc": 1545757973.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ecjav8e",
      "author": "None",
      "body": "It’s so rare to read this kind of critical writing on Reddit from Asian American women (and people of color in general). So this is refreshing. I’m Chinese American and I’m very thankful that you took the time to share. I am always afraid to share something race related on reddit because there are a lot of white people who will get defensive or will say thinking in terms of race “creates division” or is shallow. Race definitely drives power dynamics and social expectations in different directions and it needs to be evaluated and discussed rather than ignored.",
      "created_utc": 1545765620.0,
      "score": 30,
      "context": []
    },
    {
      "id": "ecizwg0",
      "author": "CozyJumpers",
      "body": "This was such a good read. It's so important to discuss the intersection between race and eating disorders, and it's a conversation that isn't had often enough. Thank you so much for posting this! Please keep discussing this if you find anything else coming to mind in the future! ",
      "created_utc": 1545756702.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ecj7oza",
      "author": "Kemfox",
      "body": "My God man this was such a wonderful and in-depth read. I appreciate the effort you put in to conveying a different perspective here.",
      "created_utc": 1545763030.0,
      "score": 18,
      "context": []
    },
    {
      "id": "eclafrm",
      "author": "None",
      "body": "Thank you for writing this, it sheds a lot of light on my mom who is 1st generation Thai. Her mom came over during the Vietnam War (married to an American GI). She (my mother) has a really bad eating disorder but won't talk about it with anyone, to the point that I only recently realized it after my own experiences with Anorexia.My grandma disowned Thai culture when she came to the US, because of that my mom is fully integrated, so I don't have any real connection to Thailand.\n\nFood as a cultural aspect is what gets me. My mom never cooked thai food, and because of her disorder she would typically cook basic meals. My grandma lived far away due to my dad being in the military. When she is over she cooks, but my mom complains that the cooking makes her \"house smell like a Chinese restaurant\". On the flip side, my mom never cooked traditional American meals. I don't understand why food is a group activity, or why there is such an importance to be polite and eat everything. I've made friends upset when I declined Turkey at thanksgiving, or they don't understand why I don't like spicy food.\n\nI feel like I'll always be a bit lost because of my families military background. I feel uncomfortable in Thai/SEA spaces because I'm white passing and have so little connection that I feel like an interloper.",
      "created_utc": 1545839266.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ecvpa1f",
      "author": "zhangover",
      "body": "coming home for holidays is always a source of conflict- my family enjoys strict meal times, whereas I try to eat whenever I am hungry (which usually doesn’t line up well with their engrained sense of routine)- thank you for this read, helped my frustrations out ",
      "created_utc": 1546187353.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiz048t",
      "author": "TotesMessenger",
      "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/asianamerican] [Really resonated with me](https://www.reddit.com/r/asianamerican/comments/b3eqr0/really_resonated_with_me/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "created_utc": 1553102772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eizsqmm",
      "author": "None",
      "body": "> Eh, even for the general population, most “psychoanalytic and/or psychodynamic psychotherapists” are a wash and suck. Not specific to Chinese/Asian American issues.\n\nhttps://www.reddit.com/r/asianamerican/comments/b3eqr0/comment/eizsoe5",
      "created_utc": 1553120716.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ecjbslc",
      "author": "warrior_princess",
      "body": ">Honestly I can name countless instances of Asian customs/practices/cultural norm that is throughly toxic, objectively.\n\nFirst-generation Chinese woman here. (29 years old) This deeply resonated with me. I'm not sure if this extends beyond my mom's social circle, but the fact that \"aunties' were encouraged to grab my arm and comment about how fat it was, or how almost every conversation they had in front of us kids were a conversation about who has the \"laziest\" or \"most embarrassing\" child while praising each other's children for their achievements was definitely not great for our self esteems. Just because I was used to it and learned how Jimmy was slow in finishing his homework, it didn't mean that listening to my mom as she lamented about how everyone else's children were at least thin and how she had the fattest daughter of the group didn't still hurt. When I was a teenager I wasn't asked IF I wanted plastic surgery, but told how much better i'd look for it. Again, just because plastic surgery is so common in Asia and that it's often a graduation present (or so I was told by my plastic surgeon), constantly being told you're not good enough is hard for anyone of any culture to tolerate. \n\nI will agree with OP in that in treatment I do often feel overlooked. I'm currently in a partial hospitalization program and I find myself unable to participate in conversations about how grilled cheese with tomato soup brings us back to our childhoods or what our holiday traditions are. When others would hear that my friends and I often spoke about how we were \"jealous of white people's families\" they tend to give me looks of sympathy without realizing that it was fun to have commiserators. On the bright side, while it can be tiring to explain customs and exceptions over and over again to others, most therapists, professionals, and others in my group recognize that the complexity is there and are open to listening. ",
      "created_utc": 1545766410.0,
      "score": 16,
      "context": [
        {
          "id": "ecj1f9c",
          "author": "HolyCrepe215",
          "body": "First generation Chinese American woman here (moved to the US when I was 11). I hear what you are saying about the added layer of complexity you have to deal with in your recovery I.e. explaining to your therapist about intricacies of Asian culture. For that reason, when I was in therapy (not ED, but for a myriad of other issues) I specified that I wanted an Asian American female therapist. Ended up with a Korean American woman in her 40s/50s. While my therapy only lasted a few months due to other issues, having someone who could understand where I am coming from culturally saved a lot of time and frustrations. Might be worthwhile to look into if there are therapists in that demographic where you are - I’m in NYC so it may be more readily available here than elsewhere.\n\nOne thing I will challenge you on is the idea that some aspects of Asian culture are “pathologized” in the Western point of view without any merit. Honestly I can name countless instances of Asian customs/practices/cultural norms that are throughly toxic, objectively. I think it’s important to call a spade a spade - there’s a reason why the suicide rate for young Asian women is so high. If a culture is leading otherwise healthy individuals to kill themselves, it’s time to re-examine the culture.",
          "created_utc": 1545757973.0
        }
      ]
    },
    {
      "id": "ecj2cwv",
      "author": "PizzaIsASuperfood",
      "body": "Yeah, I agree. It's been hard for me to honestly examine the problems within Asian culture because so much of my energy goes towards defending various aspects of it, but I do think that there are real issues within the culture. I'm also in a major city and initially thought that finding a therapist would be easy enough... but so far no luck. :(",
      "created_utc": 1545758707.0,
      "score": 14,
      "context": [
        {
          "id": "ecj1f9c",
          "author": "HolyCrepe215",
          "body": "First generation Chinese American woman here (moved to the US when I was 11). I hear what you are saying about the added layer of complexity you have to deal with in your recovery I.e. explaining to your therapist about intricacies of Asian culture. For that reason, when I was in therapy (not ED, but for a myriad of other issues) I specified that I wanted an Asian American female therapist. Ended up with a Korean American woman in her 40s/50s. While my therapy only lasted a few months due to other issues, having someone who could understand where I am coming from culturally saved a lot of time and frustrations. Might be worthwhile to look into if there are therapists in that demographic where you are - I’m in NYC so it may be more readily available here than elsewhere.\n\nOne thing I will challenge you on is the idea that some aspects of Asian culture are “pathologized” in the Western point of view without any merit. Honestly I can name countless instances of Asian customs/practices/cultural norms that are throughly toxic, objectively. I think it’s important to call a spade a spade - there’s a reason why the suicide rate for young Asian women is so high. If a culture is leading otherwise healthy individuals to kill themselves, it’s time to re-examine the culture.",
          "created_utc": 1545757973.0
        }
      ]
    },
    {
      "id": "ecjny1g",
      "author": "pokipokitoki",
      "body": "Which area are you in, if you don't mind me asking? I live in Boston and it took me YEARS before I finally found someone.",
      "created_utc": 1545775851.0,
      "score": 5,
      "context": [
        {
          "id": "ecj1f9c",
          "author": "HolyCrepe215",
          "body": "First generation Chinese American woman here (moved to the US when I was 11). I hear what you are saying about the added layer of complexity you have to deal with in your recovery I.e. explaining to your therapist about intricacies of Asian culture. For that reason, when I was in therapy (not ED, but for a myriad of other issues) I specified that I wanted an Asian American female therapist. Ended up with a Korean American woman in her 40s/50s. While my therapy only lasted a few months due to other issues, having someone who could understand where I am coming from culturally saved a lot of time and frustrations. Might be worthwhile to look into if there are therapists in that demographic where you are - I’m in NYC so it may be more readily available here than elsewhere.\n\nOne thing I will challenge you on is the idea that some aspects of Asian culture are “pathologized” in the Western point of view without any merit. Honestly I can name countless instances of Asian customs/practices/cultural norms that are throughly toxic, objectively. I think it’s important to call a spade a spade - there’s a reason why the suicide rate for young Asian women is so high. If a culture is leading otherwise healthy individuals to kill themselves, it’s time to re-examine the culture.",
          "created_utc": 1545757973.0
        },
        {
          "id": "ecj2cwv",
          "author": "PizzaIsASuperfood",
          "body": "Yeah, I agree. It's been hard for me to honestly examine the problems within Asian culture because so much of my energy goes towards defending various aspects of it, but I do think that there are real issues within the culture. I'm also in a major city and initially thought that finding a therapist would be easy enough... but so far no luck. :(",
          "created_utc": 1545758707.0
        }
      ]
    },
    {
      "id": "eiztrkx",
      "author": "None",
      "body": "Eh, not a woman or have ED, but I have a lot to say about the mental health and psychotherapy community here as a 26YO AM. Fortunately for me, I got lucky on the first try having just left my session; we’ve been at it continually for nearly 6 years come this May. The auxiliary MH treatment I received in Boston was definitely lackluster and oftentimes ‘invalidating’ underwhelming—especially when you feel you are a engaging in reverse therapy by recontextualizing and understanding them and their biases.\n\nIn an oversimplified case, their pedagogy is full of Western ‘egalitarianism/liberal/PC” reductionism.. or reductive objections filled with M.S.W. cliched CBT platitudes—who are also rife with countertransference issues and inadequate management. From a theoretical clinical level, I don’t dispute psychoanalytic/psychodynamic psychotherapy. Obviously there’s clinician bias, and just because someone touts the listicle of therapeutic modalities and specialities they engage in on their Psychology Today profile doesn’t make them a competent clinician, especially in such clinical practice which is highly contextual and intersubjective. (no therapist-clinician dyad is alike nor is the treatment as well or the efficacy; so the therapy outcomes studies are biased and never conclusive rife with sampling/selection biases)",
      "created_utc": 1553121431.0,
      "score": 1,
      "context": [
        {
          "id": "ecj1f9c",
          "author": "HolyCrepe215",
          "body": "First generation Chinese American woman here (moved to the US when I was 11). I hear what you are saying about the added layer of complexity you have to deal with in your recovery I.e. explaining to your therapist about intricacies of Asian culture. For that reason, when I was in therapy (not ED, but for a myriad of other issues) I specified that I wanted an Asian American female therapist. Ended up with a Korean American woman in her 40s/50s. While my therapy only lasted a few months due to other issues, having someone who could understand where I am coming from culturally saved a lot of time and frustrations. Might be worthwhile to look into if there are therapists in that demographic where you are - I’m in NYC so it may be more readily available here than elsewhere.\n\nOne thing I will challenge you on is the idea that some aspects of Asian culture are “pathologized” in the Western point of view without any merit. Honestly I can name countless instances of Asian customs/practices/cultural norms that are throughly toxic, objectively. I think it’s important to call a spade a spade - there’s a reason why the suicide rate for young Asian women is so high. If a culture is leading otherwise healthy individuals to kill themselves, it’s time to re-examine the culture.",
          "created_utc": 1545757973.0
        },
        {
          "id": "ecj2cwv",
          "author": "PizzaIsASuperfood",
          "body": "Yeah, I agree. It's been hard for me to honestly examine the problems within Asian culture because so much of my energy goes towards defending various aspects of it, but I do think that there are real issues within the culture. I'm also in a major city and initially thought that finding a therapist would be easy enough... but so far no luck. :(",
          "created_utc": 1545758707.0
        },
        {
          "id": "ecjny1g",
          "author": "pokipokitoki",
          "body": "Which area are you in, if you don't mind me asking? I live in Boston and it took me YEARS before I finally found someone.",
          "created_utc": 1545775851.0
        }
      ]
    }
  ]
}