{
  "id": "aesuar",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1547190323.0,
  "title": "I AM GOING TO EAT.",
  "selftext": "Today I've had a bowl of oatmeal, two low-calorie breakfast drinks, and an English muffin with bacon and an egg. Just finished a regular-calorie breakfast drink. I've gained 1/2 pound total in my two\nweeks of recovery so far. Well, GUESS WHAT ED, I'M GONNA GO OUT FOR DINNER WITH OLD FRIENDS AND YOU BET YOUR ASS I'M GONNA HAVE FRIES. AND I'M GONNA HAVE A PINT OF BEN & JERRY'S LATER, BECAUSE I AM LITERALLY STARVING AND MY BODY NEEDS THAT FUEL. And if I don't finish it, that's okay too. And if I want salad tomorrow, I'm gonna have that, because my body needs nutrients from plants. And then tomorrow I'm going on the ferry and you bet your ass I'm gonna have the salmon and potatoes and grilled pak choi. Because it's delicious and it will help heal my organs and shit. I'm starving. Can't wait for dinner! \n\nAnd if I feel bad after that, and I want to purge, then I'll use my superior anti-purge technique of getting myself off and vaping. Because I deserve to eat. You do too. It's okay to eat and it's okay to eat \"junk\" from time to time.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/aesuar/i_am_going_to_eat/",
  "score": 115,
  "num_comments": 8,
  "comments": [
    {
      "id": "edsaqd5",
      "author": "phantasmagorica1",
      "body": "Yes! All of this! So proud of you and all that food sounds incredibly delicious!",
      "created_utc": 1547192263.0,
      "score": 18,
      "context": []
    },
    {
      "id": "edsilun",
      "author": "oldpaintunderthenew",
      "body": "Haha I love the getting off and vaping part. Best of luck to you, hun!",
      "created_utc": 1547200596.0,
      "score": 12,
      "context": []
    },
    {
      "id": "edtam1z",
      "author": "Grace_Lace",
      "body": "You’re doing amazing!! Fuck yeah! Just listen to your body and try to enjoy getting the proper nutrition that your body needs and deserves to function. You may get second thoughts mid-recovery, but stay strong. You deserve recovering more than anything. Whenever I have the really bad urge to purge, I try my best to distract myself too. I play video games, read, draw, call a friend, take a nap, scroll through social media. . .anything to stop me from engaging in self-destructive behavior. What your eating disorder might think is “junk” food serves a purpose for your body and gives it the fuel you need when necessary. Keep trusting it’s needs and everything will fall into place. ",
      "created_utc": 1547221070.0,
      "score": 9,
      "context": []
    },
    {
      "id": "edsrzyo",
      "author": "standsure",
      "body": "Good. \n\nI am so proud of you right now. ",
      "created_utc": 1547208392.0,
      "score": 3,
      "context": []
    },
    {
      "id": "edthn3k",
      "author": "eva1588",
      "body": "So good! ",
      "created_utc": 1547225395.0,
      "score": 5,
      "context": []
    },
    {
      "id": "edu8b6w",
      "author": "viviann1027",
      "body": "Excellent. I love this and support you all the way!",
      "created_utc": 1547240664.0,
      "score": 3,
      "context": []
    },
    {
      "id": "edwyawl",
      "author": "ThatOnePotential",
      "body": "Good for you; it sounds like you have the right attitude for recovery. I don't think it's an accident that this sub is called \"Fuck Eating Disorders\"; you have to be a little defiant to start making recovery gains. You got this--good luck <3 ",
      "created_utc": 1547321500.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eg3um37",
      "author": "clementinedancer",
      "body": "I used to smoke cigs and vape to keep me from eating, but they’ve become one of the best tools in keeping me from purging. It adds like a final end to my meals and is just enough to keep me from running to the bathroom. ",
      "created_utc": 1549740406.0,
      "score": 2,
      "context": [
        {
          "id": "edsilun",
          "author": "oldpaintunderthenew",
          "body": "Haha I love the getting off and vaping part. Best of luck to you, hun!",
          "created_utc": 1547200596.0
        }
      ]
    }
  ]
}