{
  "id": "akktiy",
  "subreddit": "fuckeatingdisorders",
  "author": "CozyJumpers",
  "created_utc": 1548657413.0,
  "title": "I've been eating dessert every night lately and it's been the best decision of my life.",
  "selftext": "Breaking News: Did you know that dessert is actually *not* poison and won't kill you if you eat it every night? I, personally, was shocked and bewildered by this discovery.\n\nBut seriously though, I've been eating the most delicious desserts lately, more or less every night for the past 2 weeks I think, and two discoveries have come from this. 1) Absolutely no negative consequences arose from my doing this. Nothing. Like, not a single bad thing happened. I didn't gain a million pounds, or have any change in appearance whatsoever actually now that I'm weight restored. And 2) I discovered that dessert is actually the best thing in the world and makes me look forward to dinner like nothing else. It's fun deciding what I'm going to have for dessert that night, sometimes it's super decadent like delicious chocolate babka from my favourite jewish bakery or some apple cake, sometimes it's simple like a few biscuits and some dark chocolate, but either way, it's such a nice sweet end to the day.\n\nI used to view dessert for a long time as this super \\~indulgent\\~ thing that would be dangerous to consume on a regular basis, because in my ED brain, any type of eating that was *that* satisfying and filling must be inherently dangerous. So being able to eat dessert every single night lately and have no negative consequences to it has been a really empowering reminder that ED brain is entirely irrational, makes completely incorrect assumptions about likely outcomes to events, and overall not worth listening to.\n\nHope you're all having a good week so far, and go eat some dessert next time you can, it's delicious! x",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/akktiy/ive_been_eating_dessert_every_night_lately_and/",
  "score": 106,
  "num_comments": 7,
  "comments": [
    {
      "id": "ef5zk0v",
      "author": "None",
      "body": "Congratulations on winning and keep enjoying those desserts! ",
      "created_utc": 1548673509.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ef6cy4c",
      "author": "nelbells8",
      "body": "Eat all the desserts I mean it's the exact opposite of stressed! I felt the same way early into to my recovery!",
      "created_utc": 1548687101.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ef7gc50",
      "author": "Idunnoking",
      "body": "Omg thank u for sharing this!!! I’ve been eating dessert every night for months now, as I have this habitual craving for something sweet after  savoury meals :-) ",
      "created_utc": 1548711480.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ef6q240",
      "author": "eva1588",
      "body": "I too am starting to discover this. I would eat dinner and be full but a couple hour later have a very unsatisfied feeling like I needed something more but wasn’t necessarily hungry. So I tried having a little sugar (all I had was molasses ) and it fixed the feeling. Just a small but if it! So now I have been buying ice cream and having that at night. I’m going to try all my favorite flavors. It’s really nice to treat yourself and not feel bad about it. ",
      "created_utc": 1548695659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "efdg0b5",
      "author": "arbitrarypoop",
      "body": "This is so encouraging. Thank you ❤️",
      "created_utc": 1548868959.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ef8w7i2",
      "author": "CozyJumpers",
      "body": "Yes!!! Team 'Dessert every night' forever!! Honestly it's the best end to a day! x",
      "created_utc": 1548751241.0,
      "score": 6,
      "context": [
        {
          "id": "ef7gc50",
          "author": "Idunnoking",
          "body": "Omg thank u for sharing this!!! I’ve been eating dessert every night for months now, as I have this habitual craving for something sweet after  savoury meals :-) ",
          "created_utc": 1548711480.0
        }
      ]
    },
    {
      "id": "ef8w57g",
      "author": "CozyJumpers",
      "body": "YES, Ice cream is the best! Don't know if you're a coffee fan, but if you are, coffee ice cream + brownie = actual heaven. ",
      "created_utc": 1548751167.0,
      "score": 2,
      "context": [
        {
          "id": "ef6q240",
          "author": "eva1588",
          "body": "I too am starting to discover this. I would eat dinner and be full but a couple hour later have a very unsatisfied feeling like I needed something more but wasn’t necessarily hungry. So I tried having a little sugar (all I had was molasses ) and it fixed the feeling. Just a small but if it! So now I have been buying ice cream and having that at night. I’m going to try all my favorite flavors. It’s really nice to treat yourself and not feel bad about it. ",
          "created_utc": 1548695659.0
        }
      ]
    }
  ]
}