{
  "id": "apdhqu",
  "subreddit": "fuckeatingdisorders",
  "author": "CassTheUltimateBA",
  "created_utc": 1549866741.0,
  "title": "Body language around food",
  "selftext": "So I hate pictures of myself like many of us, but my mom looooves taking candid random photos whenever we’re doing family stuff.\n\nI was looking through old photos of me. My weights fluctuates often it’s kinda shitty.\n\nI came across [this.](https://imgur.com/a/GzLbUCc) Which is from my 19th birthday party during that time I was in a fucking awful place with my ed. \n\nIs it just me or does this not perfectly shows the internal conflict I had with food.\n\nMy body language when I’m talking myself out of eating is to wrap my arms around my stomach and remind myself why I don’t need food bc I can wrap my arms around my whole torso basically. I’m looking so longingly at the cake because I want to eat it all but am scared of calories or how I’ll eat it all then throw it up. \n\nThat’s all the emotions in this picture. ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/apdhqu/body_language_around_food/",
  "score": 93,
  "num_comments": 4,
  "comments": [
    {
      "id": "eg7vbti",
      "author": "queenofbo0ks",
      "body": "You have given the perfect description! Thank you for sharing this picture with us. ",
      "created_utc": 1549886191.0,
      "score": 22,
      "context": []
    },
    {
      "id": "eg7wwxf",
      "author": "Idunnoking",
      "body": "It’s always mind boggling to realize just how invasive EDs can be, even in relation to what seems to be the most “arbitrary” behaviours. ",
      "created_utc": 1549888286.0,
      "score": 16,
      "context": []
    },
    {
      "id": "egc1mhz",
      "author": "CassTheUltimateBA",
      "body": "Thank you for being so accepting of it :)\n\nI miss r/proed so much because it was the only space people understood our struggle. ",
      "created_utc": 1550006053.0,
      "score": 3,
      "context": [
        {
          "id": "eg7vbti",
          "author": "queenofbo0ks",
          "body": "You have given the perfect description! Thank you for sharing this picture with us. ",
          "created_utc": 1549886191.0
        }
      ]
    },
    {
      "id": "egc1jlt",
      "author": "CassTheUltimateBA",
      "body": "It’s even worse when these behaviors are called out. No one that’s done it to be did it maliciously I know that, but saying “hey you REALLY don’t like eating in front of people do you? “Then then normally point out how I involuntarily cover my mouth when I eat, if I’m standing I’m swaying/rocking myself/pacing around every.fucking.bite. \n\nI used to have a rubber band on my wrist when I first got an Ed that I’d snap whenever I felt hungry. No one noticed that to so idfk ",
      "created_utc": 1550006000.0,
      "score": 2,
      "context": [
        {
          "id": "eg7wwxf",
          "author": "Idunnoking",
          "body": "It’s always mind boggling to realize just how invasive EDs can be, even in relation to what seems to be the most “arbitrary” behaviours. ",
          "created_utc": 1549888286.0
        }
      ]
    }
  ]
}