{
  "id": "asf3bp",
  "subreddit": "fuckeatingdisorders",
  "author": "problematicbeing",
  "created_utc": 1550608708.0,
  "title": "[rant] The rise of the Instagram body is infuriating",
  "selftext": "The 90's gave us lovely heroin chic, stick thinness as a trend. Luckily I was only a baby back then so I wasn't terribly effected by that. The early 2000's was the age of low rise pants and crop tops with flat stomachs.  \n\n\nNow we're somehow almost done with the 2010's and we have the new body standard, the Instagram body. Big boobs, impossibly tiny waists, huge squat booties, and legs that are curvy yet somehow still thin. People act like it's empowering that the  a e s t h e t i c is now a bit thiccer and more strength focused but it is just another way that society is telling us to manipulate our bodies into something they don't naturally look like.   \n\n\nTo get Instagram bodies, women are getting Brazilian butt lifts (which btw can be dangerous and have bad health effects) and fat transfers from their midsection to their hips and butt and thighs. They're facetuning their waists to look unnaturally tiny compared to their \"squat booties\" which they claim are empowering cause going to the gym and weightlifting is a man's world. Going to the gym and squating heavy weight to have a nicer butt is no different than crash dieting to try to have the 90 heroin chic look. It's just trying to fit the mold of what is attractive right now.  \n\n\nHuman bodies are not fucking trends. No one can be expected to completely change the shape and size of their body every 10 years to meet what is currently considered attractive.  \n\n\nIt just makes me so mad because right now the body type that is \"in style\" is often not even physically possible. If you want to have enough fat to have an insta-booty your waist gets bigger too, which is absolutely fine, however, instagram models facetune their waists smaller to make up for it. Or have the small waist from surgery.  \n\n\n  \nRecovering from an eating disorder is hard enough without getting bombarded by #strongnotskinny #instafit #fitfam posts every 2 seconds. (For the record, I deleted instagram about a month ago and it's made these feelings less intense but I still get mad) ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/asf3bp/rant_the_rise_of_the_instagram_body_is_infuriating/",
  "score": 276,
  "num_comments": 26,
  "comments": [
    {
      "id": "egtvkgv",
      "author": "thebitchybulimic",
      "body": "Fuck I hate this. Like I’ve been thin, the societal standard of thin, and I’ve been thin but had a butt, but looking like this? I would have had to add serious lifting to my already extremely disorders habits. Now I’m bigger, and I can “easily” become thin again, but trying to shape my body as “big, tiny, big, shapely, thin” is a fucking nightmare to even think about. Fuck it all. ",
      "created_utc": 1550610314.0,
      "score": 63,
      "context": []
    },
    {
      "id": "egu6zmd",
      "author": "mothtrail",
      "body": "true. just makes me wonder what the standard of a beautiful body will be in 20 years",
      "created_utc": 1550618192.0,
      "score": 31,
      "context": []
    },
    {
      "id": "egu8c5l",
      "author": "Schneeballschlacht",
      "body": "I’m not on any social media (does linked in count?) and still notice this. I like /r/instagramreality. It’s helped me to recognize photoshops and point out various surgeries etc. ",
      "created_utc": 1550619195.0,
      "score": 25,
      "context": []
    },
    {
      "id": "egu8slq",
      "author": "None",
      "body": "That's why I don't follow most recovery accounts on IG.",
      "created_utc": 1550619542.0,
      "score": 11,
      "context": []
    },
    {
      "id": "eguam6u",
      "author": "None",
      "body": "No one has to diet or exercise anymore, cheap photoshop/facetune apps are everywhere. We always knew the images in the magazines and billboards were altered. But now we our comparing our bodies to pictures of our friends and seemingly \"real people\" that are just as digitally altered as ads. I'm so glad my preteens and teens didn't have Instagram. Idk how I'd be functioning.",
      "created_utc": 1550620942.0,
      "score": 8,
      "context": []
    },
    {
      "id": "egubeh8",
      "author": "sh00p842",
      "body": "My sister has the insta body. She posts all about her cross fit and shit. She goes through regular cycles of \"eating clean\" and then binging on junk food. Terribly unhealthy relationship with food and her body, masked as body positivity and strength. Her bf literally requires that she stay fit. But I was puking so mine's worse 😏 it's better now that I live out of state, but it used to be really triggering.",
      "created_utc": 1550621556.0,
      "score": 20,
      "context": []
    },
    {
      "id": "eguby1a",
      "author": "None",
      "body": "I agree wholeheartedly. And good for you for deleting the app, get that ridiculousness and negativity the FUCK out of here!",
      "created_utc": 1550621973.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eguoxus",
      "author": "theHBIC",
      "body": "And here I am, still fat and very fucked up. ",
      "created_utc": 1550632039.0,
      "score": 5,
      "context": []
    },
    {
      "id": "egxkfnm",
      "author": "None",
      "body": "Yeah, it's easy to say 'Oh well we all know it's photoshopped/good angles!' etc, but without seeing the insta posts with the originals side-by-side, it's hard to realise the extent. \n\nIt also seems that most of those who *are* comfortable with releasing untouched photos of their body are those who are super-fit to the point of it being a full time job anyway... and it's great that they do of course. It's just that isn't really a realistic situation the average human can be in, or can be in healthily. Yet I still find that dark place of my mind thinking 'Okay, that's the maximum amount of jiggle your body can have.'\n\nAnd don't even get me started on ED recovery inspo accounts, heh ¬_¬ It seems to either be... 'fit' people who are possibly-maybe-kinda-not even recovered from obsessive eating habits and exercise habits who are also posting pics of their food all the time instead of just eating it, or plus sized ladies who still naturally have big boobs and hips and stuff. And pretty faces and good make-up skills and all that, of course.\n\nMy body doesn't look anything like any of that. I find myself obsessing over whether I still have this 'recovery tummy/shape' I hear about a lot where all the fat goes to your trunk and face at first, or whether my body is just shaped like this and I really am just a monster for not recovering into either a fit-beautiful or plus-size-beautiful type of body. \n\nAnd somehow I'm supposed to stop caring. Like shit, people without EDs find it hard to stop caring, how am *I* supposed to stop caring? :( I don't even have insta and avoid places where pics like that are shared, but it's still everywhere! (Insert frustrated flailing motions here)\n\nWow I ranted :D \n",
      "created_utc": 1550722674.0,
      "score": 6,
      "context": []
    },
    {
      "id": "egzd8r3",
      "author": "beetlesandeggs",
      "body": "Yes, I hate it. It used to be that previous body trends, while still harmful, were bodies that at least existed in the real world to some extent. I could never have a 20's flapper girl body, but there are women who look like that naturally. The Instagram body could only be achieved via invasive plastic surgery procedures and/or photoshop. I don't know any woman irl who has naturally skinny legs and huge butt; women with huge butts usually have legs that are in proportion. And even the Instagram face isn't one that exists in the real world. I find that looking like a real human being makes you plain looking at this point. And if you look like one of the Instagram models, you aren't special because there are millions of them and they all look the same. \n\n",
      "created_utc": 1550783600.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eguvgvm",
      "author": "PoisonErin",
      "body": "It is soo messed up how body shapes and parts  go through trends! ",
      "created_utc": 1550637557.0,
      "score": 4,
      "context": []
    },
    {
      "id": "elprzil",
      "author": "None",
      "body": "Okay I agree with a lot of what you’re saying, but I have to disagree about the squatting being equal to crash dieting. Even when I was deep in my eating disorder, I had big legs. I was insecure about them. I have come to accept they will always be the biggest part of my body. I discovered power squatting about a year ago, and it has been the most positive experience for me. It’s a hobby with a goal. I’ve never hurt myself doing it. If I can’t do a higher weight I unload. Instead of being insecure about my big legs, I’m proud of the weight they can squat. Im focusing on being strong, and not on being ultra thin.",
      "created_utc": 1556162470.0,
      "score": 4,
      "context": []
    },
    {
      "id": "egupzde",
      "author": "throwaway862153",
      "body": "Thank you for this.",
      "created_utc": 1550632865.0,
      "score": 3,
      "context": []
    },
    {
      "id": "egvvlaz",
      "author": "thepeelofanorange",
      "body": "Thank you so much for this, it’s so true and powerful.",
      "created_utc": 1550679347.0,
      "score": 3,
      "context": []
    },
    {
      "id": "egv8bs6",
      "author": "throwawayferret88",
      "body": "That’s okay, the next trend is gearing up to be obesity. I have nothing against body positivity and larger people, but for a whole movement to publicly shame plus size women for not being “plus size enough” to represent them is toxic and pushing people to get bigger and bigger to stay included. \n\nBut it’s what is to be expected as out-lash for the impossible tiny waist big butt era. ",
      "created_utc": 1550654246.0,
      "score": -2,
      "context": []
    },
    {
      "id": "egvpcr2",
      "author": "problematicbeing",
      "body": "Honestly me too... I was watching the TV show Lost. Kate, the main woman character, has this very thin not very curvy body, but the show started in 2004 when that body type was considered the most attractive. Watching the show in 2018, I was like... dang this girl flat as heck.... then i realized I'm just used to the 2016 instagram kim-k body types that are popular right now.  \n\n\nIt seems so absurd to me that women's bodies can be trends. Also angry because while an ideal man body, ultra muscular, tall, fit, is also hard to achieve, it is not a moving target. Strong men are always in style, versus women's bodies where you just got to deal when your body type isn't the flavor of the decade lol",
      "created_utc": 1550674828.0,
      "score": 26,
      "context": [
        {
          "id": "egu6zmd",
          "author": "mothtrail",
          "body": "true. just makes me wonder what the standard of a beautiful body will be in 20 years",
          "created_utc": 1550618192.0
        }
      ]
    },
    {
      "id": "eguzt6t",
      "author": "None",
      "body": "I’m on social media and that sub has helped me so so much. You forget that the things we see online aren’t always real. \n\nIt also inspired me to unfollow people known for doing that, and follow body positive IG influencers instead. ",
      "created_utc": 1550642003.0,
      "score": 8,
      "context": [
        {
          "id": "egu8c5l",
          "author": "Schneeballschlacht",
          "body": "I’m not on any social media (does linked in count?) and still notice this. I like /r/instagramreality. It’s helped me to recognize photoshops and point out various surgeries etc. ",
          "created_utc": 1550619195.0
        }
      ]
    },
    {
      "id": "egvo67l",
      "author": "problematicbeing",
      "body": "Recovery accounts on IG are kinda weird. Like posting a picture of everything you eat is a pretty disordered behavior. Plus in order to post pictures of what they eat they have to carefully stage a photo and eat visually appealing food, I imagine when the picture is finally done the food is cold and this poor girl in ED recovery has just spent 5-10 mins staring at her food and arranging it instead of eating it.  \n\n\nAlso when people post their hot recovered bodies.... like your ED was the thing telling you that you need external validation about your body so if you keep posting your body once recovered, you will never learn to internally validate.",
      "created_utc": 1550673925.0,
      "score": 14,
      "context": [
        {
          "id": "egu8slq",
          "author": "None",
          "body": "That's why I don't follow most recovery accounts on IG.",
          "created_utc": 1550619542.0
        }
      ]
    },
    {
      "id": "egvwtns",
      "author": "None",
      "body": "Lmao your use of the smirk emoji killed me ",
      "created_utc": 1550680201.0,
      "score": 5,
      "context": [
        {
          "id": "egubeh8",
          "author": "sh00p842",
          "body": "My sister has the insta body. She posts all about her cross fit and shit. She goes through regular cycles of \"eating clean\" and then binging on junk food. Terribly unhealthy relationship with food and her body, masked as body positivity and strength. Her bf literally requires that she stay fit. But I was puking so mine's worse 😏 it's better now that I live out of state, but it used to be really triggering.",
          "created_utc": 1550621556.0
        }
      ]
    },
    {
      "id": "egvp08v",
      "author": "problematicbeing",
      "body": "If were hanging out on r/fuckeatingdisorders we are all a bit fucked up :)  \n\n\nTry to not be harsh on yourself, we are our own worst critics. Fat is not a curse word, and being fat is not a bad thing(and many people affected by eating disorders tend to overestimate the size of their body)  \n\n\nYou deserve recovery and to love yourself. Stay strong darling.",
      "created_utc": 1550674564.0,
      "score": 7,
      "context": [
        {
          "id": "eguoxus",
          "author": "theHBIC",
          "body": "And here I am, still fat and very fucked up. ",
          "created_utc": 1550632039.0
        }
      ]
    },
    {
      "id": "egvos01",
      "author": "problematicbeing",
      "body": "It's a weird dynamic of people judging plus size models for not being plus sized enough. I believe it is because for people in larger bodies, they don't have a lot of positive media representation.  \n\n\n  \nI don't think obesity will ever be trendy(in the near future). Fat-phobia is real and many people, especially men on reddit, will not hold back on their cruel comments about fat people. ",
      "created_utc": 1550674391.0,
      "score": 7,
      "context": [
        {
          "id": "egv8bs6",
          "author": "throwawayferret88",
          "body": "That’s okay, the next trend is gearing up to be obesity. I have nothing against body positivity and larger people, but for a whole movement to publicly shame plus size women for not being “plus size enough” to represent them is toxic and pushing people to get bigger and bigger to stay included. \n\nBut it’s what is to be expected as out-lash for the impossible tiny waist big butt era. ",
          "created_utc": 1550654246.0
        }
      ]
    },
    {
      "id": "ehhiv5q",
      "author": "LunaticYoureLooking4",
      "body": "I'ts not that they're not \"plus size enough\" it's that most \"plus size\" models aren't actually plus size at all. They're mostly US 8-10, which is pretty average. Plus sizes don't start until 14. \n\n&#x200B;\n\nSo yeah, most \"plus size\" models don't represent plus size people, they really represent average, normal people who just happen to have an idealized curvy figure.\n\n&#x200B;",
      "created_utc": 1551373717.0,
      "score": 5,
      "context": [
        {
          "id": "egv8bs6",
          "author": "throwawayferret88",
          "body": "That’s okay, the next trend is gearing up to be obesity. I have nothing against body positivity and larger people, but for a whole movement to publicly shame plus size women for not being “plus size enough” to represent them is toxic and pushing people to get bigger and bigger to stay included. \n\nBut it’s what is to be expected as out-lash for the impossible tiny waist big butt era. ",
          "created_utc": 1550654246.0
        }
      ]
    },
    {
      "id": "egwjbu7",
      "author": "hauntedbean",
      "body": "\"It seems so absurd to me that women's bodies can be trends\" YES! instead of being able to have a goal more related to general health (like many men), we regard our bodies as some hateful, stubborn clay that 'should' be ok with how often we change our expectations. i feel so bad for my body.. she just wants to be nourished and listened to, and im out here absorbing all the crap about body trends and applying it to myself  ",
      "created_utc": 1550695130.0,
      "score": 11,
      "context": [
        {
          "id": "egu6zmd",
          "author": "mothtrail",
          "body": "true. just makes me wonder what the standard of a beautiful body will be in 20 years",
          "created_utc": 1550618192.0
        },
        {
          "id": "egvpcr2",
          "author": "problematicbeing",
          "body": "Honestly me too... I was watching the TV show Lost. Kate, the main woman character, has this very thin not very curvy body, but the show started in 2004 when that body type was considered the most attractive. Watching the show in 2018, I was like... dang this girl flat as heck.... then i realized I'm just used to the 2016 instagram kim-k body types that are popular right now.  \n\n\nIt seems so absurd to me that women's bodies can be trends. Also angry because while an ideal man body, ultra muscular, tall, fit, is also hard to achieve, it is not a moving target. Strong men are always in style, versus women's bodies where you just got to deal when your body type isn't the flavor of the decade lol",
          "created_utc": 1550674828.0
        }
      ]
    },
    {
      "id": "egvt5bb",
      "author": "mothtrail",
      "body": "absolutely! hopefully the “standard of beauty” in 20 years is just being healthy and confident!",
      "created_utc": 1550677620.0,
      "score": 6,
      "context": [
        {
          "id": "egu6zmd",
          "author": "mothtrail",
          "body": "true. just makes me wonder what the standard of a beautiful body will be in 20 years",
          "created_utc": 1550618192.0
        },
        {
          "id": "egvpcr2",
          "author": "problematicbeing",
          "body": "Honestly me too... I was watching the TV show Lost. Kate, the main woman character, has this very thin not very curvy body, but the show started in 2004 when that body type was considered the most attractive. Watching the show in 2018, I was like... dang this girl flat as heck.... then i realized I'm just used to the 2016 instagram kim-k body types that are popular right now.  \n\n\nIt seems so absurd to me that women's bodies can be trends. Also angry because while an ideal man body, ultra muscular, tall, fit, is also hard to achieve, it is not a moving target. Strong men are always in style, versus women's bodies where you just got to deal when your body type isn't the flavor of the decade lol",
          "created_utc": 1550674828.0
        }
      ]
    },
    {
      "id": "egvny5e",
      "author": "problematicbeing",
      "body": "Yeah same, it made me realize that literally anyone can be editing and manipulating their photos. It also made me realize that those crazy small waists are facetune the majority of the time.  \n\n\nI deleted Instagram entirely, but there were some really nice body positive people posting there which are much more positive to follow.",
      "created_utc": 1550673749.0,
      "score": 3,
      "context": [
        {
          "id": "egu8c5l",
          "author": "Schneeballschlacht",
          "body": "I’m not on any social media (does linked in count?) and still notice this. I like /r/instagramreality. It’s helped me to recognize photoshops and point out various surgeries etc. ",
          "created_utc": 1550619195.0
        },
        {
          "id": "eguzt6t",
          "author": "None",
          "body": "I’m on social media and that sub has helped me so so much. You forget that the things we see online aren’t always real. \n\nIt also inspired me to unfollow people known for doing that, and follow body positive IG influencers instead. ",
          "created_utc": 1550642003.0
        }
      ]
    },
    {
      "id": "egzekch",
      "author": "beetlesandeggs",
      "body": "My brother was complaining about Tess Holliday being on the cover of Cosmopolitan because \"having a 300 pound woman on the cover is encouraging unhealthy lifestyles.\" Like yes, Cosmo does encourage unhealthy lifestyles, but I think that having a larger woman on the cover is not what encourages unhealthy lifestyles. Does he think that someone will see that and say \n\"I feel so inadequate that I don't weigh as much as she does. I should go buy a whole box of donuts and eat them in one sitting so I could look like her someday\"?  People who say that plus size models \"encourage obesity\" just hate fat people. \n\n",
      "created_utc": 1550784486.0,
      "score": 4,
      "context": [
        {
          "id": "egv8bs6",
          "author": "throwawayferret88",
          "body": "That’s okay, the next trend is gearing up to be obesity. I have nothing against body positivity and larger people, but for a whole movement to publicly shame plus size women for not being “plus size enough” to represent them is toxic and pushing people to get bigger and bigger to stay included. \n\nBut it’s what is to be expected as out-lash for the impossible tiny waist big butt era. ",
          "created_utc": 1550654246.0
        },
        {
          "id": "egvos01",
          "author": "problematicbeing",
          "body": "It's a weird dynamic of people judging plus size models for not being plus sized enough. I believe it is because for people in larger bodies, they don't have a lot of positive media representation.  \n\n\n  \nI don't think obesity will ever be trendy(in the near future). Fat-phobia is real and many people, especially men on reddit, will not hold back on their cruel comments about fat people. ",
          "created_utc": 1550674391.0
        }
      ]
    }
  ]
}