{
  "id": "atdq18",
  "subreddit": "fuckeatingdisorders",
  "author": "CozyJumpers",
  "created_utc": 1550814090.0,
  "title": "\"Financial Anorexia\"",
  "selftext": "This is a term that honestly perfectly verbalised things that I didn't even realise I was struggling with in my eating disorder. The obsession that those with EDs (especially restrictive EDs) have with restricting financially as well, due to the belief that spending less money = good and proper, spending more money = greedy and wasteful, to the point that anything that isn't a 100% necessity is considered an indulgent purchase that we're undeserving of and foolish to spend money on, in a similar fashion to how food is viewed in that black-and-white light as well.\n\nI find the phenomenon of financial anorexia interesting because it really shows how complex eating disorders can be and the kind of mental strain they can have on the rest of your life, and how it's rarely ever just about \\~fitting into a smaller pair of jeans\\~ or aesthetics, but rather a deep-seated obsessive mentality on what makes one \"good and worthy\" and what makes one \"impure and worthless\".\n\nI'm sitting here writing my grocery list for the week and realising I was feeling bad for wanting a jar of raspberry jam that I don't \"really need\" and it's a useful reminder that anorexic mentalities work in more ways than one. Anyway, curious to hear others thoughts on the phenomenon.\n\nAlso: [A good article on Financial Anorexia and how it works](http://eatingdisorderspecialists.com/eating-disordered-behaviors-manifest-money/)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/atdq18/financial_anorexia/",
  "score": 148,
  "num_comments": 41,
  "comments": [
    {
      "id": "eh0ibte",
      "author": "TreatmentTime",
      "body": "I struggle with this a bit when I was seriously into my bulimic period. I was literally flushing money down the toilet with BP food and ended up coming up with an insane system of spreadsheets, budgeting, and coupon clipping so I could purge in peace knowing I'd at least spent the minimum possible for an enjoyable (lol) purge.\n\nNow that I'm back in restriction land, I'm a lot more cavalier about spending on food. If I dialed back my coffee habit I would easily be <200/mo – a ton by r/frugal standards, but eating basically whatever I want and even getting take out every once in a while is worth it to me as long as I'm still maxing out retirement accounts and investing. If you're only eating ~1000ish a day and don't spend too much on proteins it's a cheap way to live.",
      "created_utc": 1550816162.0,
      "score": 29,
      "context": []
    },
    {
      "id": "eh0m0bd",
      "author": "None",
      "body": "I was diagnosed but don't really see myself as a true anorexic/disordered.\n\nBut during treatment one of my greatest guilts was the money being dumped on medical bills. It consumed me. I would see the insurance send the bill and what they covered and tally up how much money was being wasted on me, which I would then add to an estimated total money spent on me as a person by my parents, which I hoped to save up and give back to relieve the guilt I felt. It made treatment so much worse because every appointment felt like I was digging a deeper grave for myself. It drove me to try to \"recover\" as fast as possible, which meant my actual mental aspects got worse as I started binging until I was in pain or at least nauseated, several times a week. The binges also brought me guilt as I was a healthy eater type, and only binged on high-fat \"healthy\" things like hummus, peanut butter, nuts, the last of which I knew were expensive and brought me guilt as well (which is why I opted for PB - much cheaper!)\n\nNow I struggle with spending on things for myself. I need to justify what I eat, what I own, ECT. I got into minimalism and \"purged\" my belongings multiple times and it helped since I owned less and could stop looking at the evidence of waste in my room. When I used to own a Nintendo, it plagued me at night as I knew its cost and how it was a waste on me. \n\nI'm also a really big fan of shopping in discount stores and clearance aisles. It's basically my hobby to tour the clearance section of the supermarket, looking at things, buying near expired goods for myself, like beaten up cans of soup, browned bananas, misshapen and off color vegetables and fruit. I've calculated the costs of my meals and my daily intake over and over.\n\nAnyways, I guess it all fits. I knew that money restriction and just overall self-denial is part of all this- sleeping little, working lots, spending little, no social life, little food- all for a pure spirit in a way",
      "created_utc": 1550820994.0,
      "score": 20,
      "context": []
    },
    {
      "id": "eh0uyvi",
      "author": "_UnderTheBridge_",
      "body": "Holy crap, I always just considered myself a good saver but this makes complete sense. I rarely spend money on something unless I absolutely need it, food or otherwise.\n\nIt is interesting though: does anyone else find they don't spend frivolously on themselves but are willing to do so for others?",
      "created_utc": 1550835755.0,
      "score": 20,
      "context": []
    },
    {
      "id": "eh1147g",
      "author": "kalianda",
      "body": "I have financial bulimia then😂\n\nme: fuck no I don't want to spend $10 on an improv class, why would anyone do that, that would stress me out\n\nalso me: ooh this $500 custom corset looks amaaaaaaaazing ((thinks for 5 seconds)) ((buys it))\n\nalso me: damn I really wish I could return this $500 corset, why on earth did i buy that",
      "created_utc": 1550842662.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eh0oqvc",
      "author": "juniorasparagus13",
      "body": "I had no clue this was a thing, but I can see it in myself. I hate spending money on things and will have panic attacks over spending money on things of if the money in my bank account drops below $300.",
      "created_utc": 1550825349.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eh2ixnr",
      "author": "ThatOnePotential",
      "body": "Thank you for posting about this. Tabitha Farrar talks a bit about this on her YouTube channel as well.\n\nI totally have this, but in my case I know it's tied to growing up really poor. Actually, I suspect a lot of my less food=good thoughts are rooted in trying not t be a \"burden\" to my family. \n\nI think it's true a lot of us carry the black and white thinking into a lot of our lives. There's a quote, \"How you do one thing is how you do everything\" definitely applies to the way ED thinking infiltrates all of our lives.",
      "created_utc": 1550881560.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eh0vs68",
      "author": "llovemybrick_",
      "body": "...holy shit. It makes so much sense.\n\nI learn so much about myself in this sub (and previously proed).\n\nThank you for posting this!",
      "created_utc": 1550836867.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eh0wvwr",
      "author": "None",
      "body": "I am so unable to buy food in the right proportions. I will go shopping when I'm hungry and buy enough for a home with 4 people when it's just me. Then, it will take me weeks to eat all of it. Half of it will go bad and I will either eat it as it's bad because I feel guilty or throw it away and feel guilty. And then I refuse to buy food because I don't want to waste...\n\nI currently own one pack of konjac rice, 12 litres of cactus water and some sauces that I can't put on anything. I feel this post so much :( ",
      "created_utc": 1550838245.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eh1igp4",
      "author": "YukiHase",
      "body": "What the hell... I had no idea these things could even BE connected. This explains a lot",
      "created_utc": 1550855814.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eh1ryka",
      "author": "MadLassWithABox",
      "body": "This is a really interesting concept.\n\nI used to be stingy with my money to a point of obsession. I would think about something I needed or wanted for weeks... months... sometimes years before committing to buying. And I often felt wasteful for purchasing things I didn’t truly need.\n\nI never go shopping without a list and never really understood the concept of impulse shopping. How did people just see something and throw it in their basket without agonizing over the decision?\n\nI’ve gotten better about it over time. I can talk myself into buying things easier, but it is definitely never without thought.\n\nI never linked this to my eating habits, but now that the link has been suggested, I’d bet I’m at my most frugal when I’m most restrictive on my diet and least frugal when I’m on a binge phase.",
      "created_utc": 1550862271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eh0x8sj",
      "author": "cinnamonbicycle",
      "body": "Wow. I struggle with this intensely. I never knew there was a name for it. Thanks for sharing, OP.",
      "created_utc": 1550838663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh1fol3",
      "author": "snake_pod",
      "body": "> the belief that spending less money = good and proper, spending more money = greedy and wasteful\n\nThis is crazy because I was the complete opposite, my mindset was if it's more expensive (I only really shop at a local farmers market and obviously some *organic* items are pricey) that means it was good food and better for me, and if it was cheap that means it was bad for me and I shouldn't be eating it. So I'd go and spend $70 on food for the week when realistically I absolutely did not need to spend that much, then not even eat it all and instead binge on junk food. I still kind of do this but not nearly as bad as I was. ",
      "created_utc": 1550853913.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh1vxbr",
      "author": "None",
      "body": "Oh! A sneak attack. Good vs. bad definitely factors into my entire life, not just my eating. Hence disordered, I guess.",
      "created_utc": 1550864941.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh2311q",
      "author": "None",
      "body": "ugh yes this!!\n\ni was obsessed with saving money last year because a friend told me he manages to only spend £3 a day on average so i restricted to £10 food shop and 5-£10 for miscellaneous (but usually spent 0). a £10 food shop is practically impossible for me but i also justified eating less bc less food eaten =less money buying food.... i also never took the bus to uni because i could get more exercise walking/cycling anyway.\n\njust restriction in general made me feel better, i would restrict any kind of pleasure tbh food, sex, money, going out with friends even if it wasnt food related and free i would think i had to stay home and study more idk any excuse ",
      "created_utc": 1550869844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh244v5",
      "author": "None",
      "body": "this absolutely makes sense. thank you for posting about it. there is this weird moral dichotomy in an ED... just the things we equate with worthiness. I know a lot of men and women who have struggled with their ED and have also had issues with over/underspending, having a lot of sex with multiple partners/never having sex for fear of body judgement, being intense overachievers in school or failing every class. it's very interesting, and also really shitty. ",
      "created_utc": 1550870610.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh2bwtf",
      "author": "Heartfr0st",
      "body": "I didn’t realize it, but it makes so much sense.  My spending, for the most part, mimics my eating habits.  When I’m in a binge eating or b/p cycle, I’m 20x more likely to go online shopping. When I’m restricting, I have to justify every single item on my shopping list, and will not buy something (even kinda essentials) if my brain thinks it’s expensive for what it is (or if it’s over $15).  15 seems to be my anxiety limit for spending money actually, unless it’s a bigger ticket item. Other than that, I’ll buy the cheapest shit out there XD",
      "created_utc": 1550876095.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh303be",
      "author": "None",
      "body": "oh man i feel this so much",
      "created_utc": 1550896721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh32i5w",
      "author": "leneay",
      "body": "Wow thank you for giving me the words to describe my situation. I have felt this way since my young teens and got more severe as I started making money and managing my own finances. I thought I was just a cheap person and didn’t realize other people experienced this too",
      "created_utc": 1550899147.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh3wzfm",
      "author": "fight-me-grrm",
      "body": "For anyone who wants to learn more about this, the Eating Disorder Foundation will be hosting a webinar about it on March 6th",
      "created_utc": 1550937700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh5jwx5",
      "author": "pudding18",
      "body": "A little late but, I really appreciate this post. Its nice to see my similar thoughts being put into words! This sort of mentality helps justify restricting my eating... If I don't absolutely need a food, then I feel like I'm being gluttonous or excessive if I decide to purchase it. This seems to be another outlet for evaluating self-worth, and for people who think like this, there is a high value placed on ability to not spend money. I like how you described it as 'indulgent' - it really feels like I'm being quite lavish when eating or spending more than the bare minimum to get through the day.\n\nI've actually been thinking a lot recently about my finances and how my friends/family say I always tend to not spend my money on things for myself and I should buy more... But I can never really justify many purchases - especially food-wise. If I won't remember eating something in a couple weeks, is it truly worth it? I still tend to think of things like this. (Especially while in the grocery store!!) Thanks once again for sharing thoughts and the article!",
      "created_utc": 1550984455.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eh12dz5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1550843812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eh38lbm",
      "author": "Pollyhotpocketposts",
      "body": "I find this and the link between the hoarding mentality super relatable\n\nTabitha Farrar had a good post on it also",
      "created_utc": 1550906560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eh38zpf",
      "author": "TotesMessenger",
      "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/exproed] [\"Financial Anorexia\"](https://www.reddit.com/r/exproed/comments/atsuhi/financial_anorexia/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "created_utc": 1550907144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ehoqzw4",
      "author": "SleepyClam",
      "body": "Fascinating! Thanks for sharing. ",
      "created_utc": 1551598933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eptfoez",
      "author": "forestfairy23",
      "body": "WOW!!! I had honestly never made the connection to this part of my life. So so Interesting",
      "created_utc": 1559489212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eucufmd",
      "author": "so_much_volume",
      "body": "This is exactly how mine flared back up. My life basically fell apart a few months ago and with that came a significant financial burden. I guess I didn’t see grocery shopping and food as a necessity and I fell back into restricting, which came easy as my life has been insanely busy. Now I’m just... never hungry and seeing a lower number on the scale each morning has added fuel to the fire.",
      "created_utc": 1563687247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llyykpo",
      "author": "Present-Literature-9",
      "body": "after two weeks of paycheck go to rent, phone bill, electricity, (No car). I usually have $200 a month for groceries, I buy groceries once a month. I usually run out by my third week. $40 on transportation occasionally when I am medically unwell, as I'm disabled. the past three months I'm usually living off $40-$2.35 for over a week. i make $2015 avg a month. I buy less and less groceries each time. I've lost too much weight.",
      "created_utc": 1725724552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eh1bkqz",
      "author": "problematicbeing",
      "body": "Lmao literally me. I hate spending money on myself but as a gift for friends or loved ones I don't think twice. I am painfully frugal then when it is gift giving time that all goes out the window. ",
      "created_utc": 1550850995.0,
      "score": 4,
      "context": [
        {
          "id": "eh0uyvi",
          "author": "_UnderTheBridge_",
          "body": "Holy crap, I always just considered myself a good saver but this makes complete sense. I rarely spend money on something unless I absolutely need it, food or otherwise.\n\nIt is interesting though: does anyone else find they don't spend frivolously on themselves but are willing to do so for others?",
          "created_utc": 1550835755.0
        }
      ]
    },
    {
      "id": "eh0v8i2",
      "author": "RichardStarrkey",
      "body": "Oh fuck but that could just be my bipolar behavior saying hello though. Buying guys drinks, paying for food, movie tickets whenever it's unnecessary",
      "created_utc": 1550836125.0,
      "score": 4,
      "context": [
        {
          "id": "eh0uyvi",
          "author": "_UnderTheBridge_",
          "body": "Holy crap, I always just considered myself a good saver but this makes complete sense. I rarely spend money on something unless I absolutely need it, food or otherwise.\n\nIt is interesting though: does anyone else find they don't spend frivolously on themselves but are willing to do so for others?",
          "created_utc": 1550835755.0
        }
      ]
    },
    {
      "id": "eh2mqvl",
      "author": "CozyJumpers",
      "body": "Definitely, there's a quote from the article above that says, \"\\[Those struggling with EDs\\] do not feel they deserve or are worthy of good things, whether that is food, clothing, love, or acceptance.\" and that really hit the nail on the head for me. You can have no problem spending money on others, because you view them as deserving of that, but you don't view yourself as deserving of it, so it's harder for you to spend that same money on yourself. ",
      "created_utc": 1550884738.0,
      "score": 2,
      "context": [
        {
          "id": "eh0uyvi",
          "author": "_UnderTheBridge_",
          "body": "Holy crap, I always just considered myself a good saver but this makes complete sense. I rarely spend money on something unless I absolutely need it, food or otherwise.\n\nIt is interesting though: does anyone else find they don't spend frivolously on themselves but are willing to do so for others?",
          "created_utc": 1550835755.0
        }
      ]
    },
    {
      "id": "eh38ncj",
      "author": "Pollyhotpocketposts",
      "body": "willing and generous with others, but rationalize that i never *need* anything myself.",
      "created_utc": 1550906642.0,
      "score": 1,
      "context": [
        {
          "id": "eh0uyvi",
          "author": "_UnderTheBridge_",
          "body": "Holy crap, I always just considered myself a good saver but this makes complete sense. I rarely spend money on something unless I absolutely need it, food or otherwise.\n\nIt is interesting though: does anyone else find they don't spend frivolously on themselves but are willing to do so for others?",
          "created_utc": 1550835755.0
        }
      ]
    },
    {
      "id": "eh2mdon",
      "author": "CozyJumpers",
      "body": "Absolutely. There are so many amazing works out there on the (very strong) tie between poverty and eating disorders. \"Thinness\" as a general concept is often marketed by diet companies as something that's glamourous, high-end, care-free, etc, and that reels in a lot of people struggling from poverty. Not to mention how the whole \"obesity epidemic\" ~~propaganda~~ rhetoric relied heavily on targeting people who ate at cheap fast food places and bought cheap easy-to-consume food at supermarkets and convenience stores, i.e.: something that less financially stable people often have to rely on. \n\nSociety's widespread hatred of bigger bodies is in a lot of ways tied with classism and society's hatred of the poor, so it's absolutely no surprise that a lot of people who grew up poor end up developing eating disorders as a way to escape that. Not to mention, like you stated, the complex relationship people can generally have with food when food was so scarce and a source of financial stress in their past. ",
      "created_utc": 1550884425.0,
      "score": 1,
      "context": [
        {
          "id": "eh2ixnr",
          "author": "ThatOnePotential",
          "body": "Thank you for posting about this. Tabitha Farrar talks a bit about this on her YouTube channel as well.\n\nI totally have this, but in my case I know it's tied to growing up really poor. Actually, I suspect a lot of my less food=good thoughts are rooted in trying not t be a \"burden\" to my family. \n\nI think it's true a lot of us carry the black and white thinking into a lot of our lives. There's a quote, \"How you do one thing is how you do everything\" definitely applies to the way ED thinking infiltrates all of our lives.",
          "created_utc": 1550881560.0
        }
      ]
    },
    {
      "id": "eh1bpw2",
      "author": "problematicbeing",
      "body": "I get similar in over-buying food because I don't want to give myself any excuse to restrict, so I end up having tons of food in the house and it sometimes goes bad and gets tossed.  \n\n\nLuckily, since I'm eating unrestricted, I do manage to eat most of the food I buy even when I buy 'too much' haha",
      "created_utc": 1550851094.0,
      "score": 2,
      "context": [
        {
          "id": "eh0wvwr",
          "author": "None",
          "body": "I am so unable to buy food in the right proportions. I will go shopping when I'm hungry and buy enough for a home with 4 people when it's just me. Then, it will take me weeks to eat all of it. Half of it will go bad and I will either eat it as it's bad because I feel guilty or throw it away and feel guilty. And then I refuse to buy food because I don't want to waste...\n\nI currently own one pack of konjac rice, 12 litres of cactus water and some sauces that I can't put on anything. I feel this post so much :( ",
          "created_utc": 1550838245.0
        }
      ]
    },
    {
      "id": "eh2na9a",
      "author": "CozyJumpers",
      "body": "Actually I wouldn't call that the complete opposite! I had (and am still working on healing from) the same mentality towards food in the sense that it was always imperative to buy food that was organic and healthy, no matter the cost, this was a \"justified\" expense, because in my ED brain, this food was \"good\" and \"pure\" and therefore, worth it -not even just worth it, but moreso necessary, because if I didn't spend that money on this 'superior' food, then I was bad and didn't care about my body, however spending even a fraction of that money on something that wasn't \"good\" or necessary to me didn't come so easily. \n\n&#x200B;",
      "created_utc": 1550885198.0,
      "score": 2,
      "context": [
        {
          "id": "eh1fol3",
          "author": "snake_pod",
          "body": "> the belief that spending less money = good and proper, spending more money = greedy and wasteful\n\nThis is crazy because I was the complete opposite, my mindset was if it's more expensive (I only really shop at a local farmers market and obviously some *organic* items are pricey) that means it was good food and better for me, and if it was cheap that means it was bad for me and I shouldn't be eating it. So I'd go and spend $70 on food for the week when realistically I absolutely did not need to spend that much, then not even eat it all and instead binge on junk food. I still kind of do this but not nearly as bad as I was. ",
          "created_utc": 1550853913.0
        }
      ]
    },
    {
      "id": "eh2nnjh",
      "author": "CozyJumpers",
      "body": "> i would restrict any kind of pleasure tbh food, sex, money, going out with friends even if it wasnt food related and free i would think i had to stay home and study more idk any excuse\n\nYes! I completely relate to this, any form of pleasure whatsoever was seen to me as greedy. ",
      "created_utc": 1550885521.0,
      "score": 2,
      "context": [
        {
          "id": "eh2311q",
          "author": "None",
          "body": "ugh yes this!!\n\ni was obsessed with saving money last year because a friend told me he manages to only spend £3 a day on average so i restricted to £10 food shop and 5-£10 for miscellaneous (but usually spent 0). a £10 food shop is practically impossible for me but i also justified eating less bc less food eaten =less money buying food.... i also never took the bus to uni because i could get more exercise walking/cycling anyway.\n\njust restriction in general made me feel better, i would restrict any kind of pleasure tbh food, sex, money, going out with friends even if it wasnt food related and free i would think i had to stay home and study more idk any excuse ",
          "created_utc": 1550869844.0
        }
      ]
    },
    {
      "id": "eh2nv3j",
      "author": "CozyJumpers",
      "body": "'Moral dichotomy' is a great way of putting it, and that's so true. People fall on either side of the scale a lot of the time, overspending vs. underspending, overachieving vs. underachieving, etc, but they're two sides of the same coin as they both stem from a place of wanting some sort of relief, those who tend to overspend do so out of a desire to numb themselves and distract themselves from the problem, and those who underspend do so out of a desire to be in control and feel worthy and good (and distract themselves from whatever is making them feel unworthy and bad), it's really quite heartbreaking how it works that way. ",
      "created_utc": 1550885705.0,
      "score": 1,
      "context": [
        {
          "id": "eh244v5",
          "author": "None",
          "body": "this absolutely makes sense. thank you for posting about it. there is this weird moral dichotomy in an ED... just the things we equate with worthiness. I know a lot of men and women who have struggled with their ED and have also had issues with over/underspending, having a lot of sex with multiple partners/never having sex for fear of body judgement, being intense overachievers in school or failing every class. it's very interesting, and also really shitty. ",
          "created_utc": 1550870610.0
        }
      ]
    },
    {
      "id": "eh5ptrz",
      "author": "CozyJumpers",
      "body": "Absolutely. Everything you said is like you were describing my life. It's funny how we always feel so alone in these feelings, yet it's something nearly all of us struggle with!\nIt's so telling how intertwined disordered eating thoughts are with money, and it truly shows how it ultimately stems from a place of feeling undeserving, undeserving of food, undeserving of buying things for ourselves, etc etc.  \nI hope you manage to feel more comfortable spending on yourself <3 It's a hard process, and one that I'm still deeeeeeeep into, but it's worth it to eventually understand that we *do* deserve good things, just like everyone else does. ",
      "created_utc": 1550990890.0,
      "score": 1,
      "context": [
        {
          "id": "eh5jwx5",
          "author": "pudding18",
          "body": "A little late but, I really appreciate this post. Its nice to see my similar thoughts being put into words! This sort of mentality helps justify restricting my eating... If I don't absolutely need a food, then I feel like I'm being gluttonous or excessive if I decide to purchase it. This seems to be another outlet for evaluating self-worth, and for people who think like this, there is a high value placed on ability to not spend money. I like how you described it as 'indulgent' - it really feels like I'm being quite lavish when eating or spending more than the bare minimum to get through the day.\n\nI've actually been thinking a lot recently about my finances and how my friends/family say I always tend to not spend my money on things for myself and I should buy more... But I can never really justify many purchases - especially food-wise. If I won't remember eating something in a couple weeks, is it truly worth it? I still tend to think of things like this. (Especially while in the grocery store!!) Thanks once again for sharing thoughts and the article!",
          "created_utc": 1550984455.0
        }
      ]
    },
    {
      "id": "eh1byl3",
      "author": "problematicbeing",
      "body": "It can go both ways. I tend to be overly frugal but when my depression is bad, shopping is the only thing I look forward too and the short-lived feeling of buying something nice was my only source of joy.  \n\n\nIt doesn't mean your disorder is any less legitimate :) You wouldn't be chilling on r/fuckeatingdisorders if you didn't have an ED ",
      "created_utc": 1550851266.0,
      "score": 2,
      "context": [
        {
          "id": "eh12dz5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1550843812.0
        }
      ]
    },
    {
      "id": "llyysj6",
      "author": "Present-Literature-9",
      "body": "the weeks where I only have two dollars have sucked my savings dry. there's usually ten or so days where I have 25 dollars in all my bank accounts combined.",
      "created_utc": 1725724624.0,
      "score": 1,
      "context": [
        {
          "id": "llyykpo",
          "author": "Present-Literature-9",
          "body": "after two weeks of paycheck go to rent, phone bill, electricity, (No car). I usually have $200 a month for groceries, I buy groceries once a month. I usually run out by my third week. $40 on transportation occasionally when I am medically unwell, as I'm disabled. the past three months I'm usually living off $40-$2.35 for over a week. i make $2015 avg a month. I buy less and less groceries each time. I've lost too much weight.",
          "created_utc": 1725724552.0
        }
      ]
    },
    {
      "id": "eh4vaq7",
      "author": "ThatOnePotential",
      "body": "Thank you for acknowledging the links between classism the presentation of the obesity epidemic. I see so many examples of how this plays out in our society. No one really discusses the links between the incredible daily stress of living in poverty and poor health; all you hear is the \"bad/cheap\" food and sedentary (read: lazy) lifestyles as culprits. Never mind the assumption that poor health always means bigger bodies. It drives me crazy, as I was a complete mental and physical mess when I was underweight, but no one gave me a hard time about it.\n\nThank you also for acknowledging that thinness (in my case EDs) can give poor people a way to better fit in to the larger society. I think a lot about how my underweight body might have influenced my ability to take part in some of the opportunities I've had in my life. That's not to say that I haven't worked really hard to earn things, but I do wonder how much the thinness factored into even getting my foot in the door. It really leads to a lot ruminating about the dysfunctional nature of our society :/",
      "created_utc": 1550963588.0,
      "score": 2,
      "context": [
        {
          "id": "eh2ixnr",
          "author": "ThatOnePotential",
          "body": "Thank you for posting about this. Tabitha Farrar talks a bit about this on her YouTube channel as well.\n\nI totally have this, but in my case I know it's tied to growing up really poor. Actually, I suspect a lot of my less food=good thoughts are rooted in trying not t be a \"burden\" to my family. \n\nI think it's true a lot of us carry the black and white thinking into a lot of our lives. There's a quote, \"How you do one thing is how you do everything\" definitely applies to the way ED thinking infiltrates all of our lives.",
          "created_utc": 1550881560.0
        },
        {
          "id": "eh2mdon",
          "author": "CozyJumpers",
          "body": "Absolutely. There are so many amazing works out there on the (very strong) tie between poverty and eating disorders. \"Thinness\" as a general concept is often marketed by diet companies as something that's glamourous, high-end, care-free, etc, and that reels in a lot of people struggling from poverty. Not to mention how the whole \"obesity epidemic\" ~~propaganda~~ rhetoric relied heavily on targeting people who ate at cheap fast food places and bought cheap easy-to-consume food at supermarkets and convenience stores, i.e.: something that less financially stable people often have to rely on. \n\nSociety's widespread hatred of bigger bodies is in a lot of ways tied with classism and society's hatred of the poor, so it's absolutely no surprise that a lot of people who grew up poor end up developing eating disorders as a way to escape that. Not to mention, like you stated, the complex relationship people can generally have with food when food was so scarce and a source of financial stress in their past. ",
          "created_utc": 1550884425.0
        }
      ]
    },
    {
      "id": "eh55or5",
      "author": "CozyJumpers",
      "body": "That's a very good point, and incredibly infuriating, right?! There's a lot of privilege in thinness, and a lot of preconcieved notions around it, as well as the assumption that you automatically have better health if thin; someone being in the depths of an eating disorder could be seen as healthier than someone who's slightly overweight but in good health, despite the fact that the former is far more likely to experience health complications (both physical and mental) than the latter.\n\nThe cognitive dissonance is messed up and infuriating, but the silver lining is that we get to live in a time with a lot of pushback to that, like with the HAES movement, anti-diet movements, and general body positivity. It's far from perfect and far from where it needs to be, but the fact that something \\*is\\* being done about it is at least somewhat fostering a healthier environment and conversation on how food and our bodies should be viewed.",
      "created_utc": 1550972112.0,
      "score": 1,
      "context": [
        {
          "id": "eh2ixnr",
          "author": "ThatOnePotential",
          "body": "Thank you for posting about this. Tabitha Farrar talks a bit about this on her YouTube channel as well.\n\nI totally have this, but in my case I know it's tied to growing up really poor. Actually, I suspect a lot of my less food=good thoughts are rooted in trying not t be a \"burden\" to my family. \n\nI think it's true a lot of us carry the black and white thinking into a lot of our lives. There's a quote, \"How you do one thing is how you do everything\" definitely applies to the way ED thinking infiltrates all of our lives.",
          "created_utc": 1550881560.0
        },
        {
          "id": "eh2mdon",
          "author": "CozyJumpers",
          "body": "Absolutely. There are so many amazing works out there on the (very strong) tie between poverty and eating disorders. \"Thinness\" as a general concept is often marketed by diet companies as something that's glamourous, high-end, care-free, etc, and that reels in a lot of people struggling from poverty. Not to mention how the whole \"obesity epidemic\" ~~propaganda~~ rhetoric relied heavily on targeting people who ate at cheap fast food places and bought cheap easy-to-consume food at supermarkets and convenience stores, i.e.: something that less financially stable people often have to rely on. \n\nSociety's widespread hatred of bigger bodies is in a lot of ways tied with classism and society's hatred of the poor, so it's absolutely no surprise that a lot of people who grew up poor end up developing eating disorders as a way to escape that. Not to mention, like you stated, the complex relationship people can generally have with food when food was so scarce and a source of financial stress in their past. ",
          "created_utc": 1550884425.0
        },
        {
          "id": "eh4vaq7",
          "author": "ThatOnePotential",
          "body": "Thank you for acknowledging the links between classism the presentation of the obesity epidemic. I see so many examples of how this plays out in our society. No one really discusses the links between the incredible daily stress of living in poverty and poor health; all you hear is the \"bad/cheap\" food and sedentary (read: lazy) lifestyles as culprits. Never mind the assumption that poor health always means bigger bodies. It drives me crazy, as I was a complete mental and physical mess when I was underweight, but no one gave me a hard time about it.\n\nThank you also for acknowledging that thinness (in my case EDs) can give poor people a way to better fit in to the larger society. I think a lot about how my underweight body might have influenced my ability to take part in some of the opportunities I've had in my life. That's not to say that I haven't worked really hard to earn things, but I do wonder how much the thinness factored into even getting my foot in the door. It really leads to a lot ruminating about the dysfunctional nature of our society :/",
          "created_utc": 1550963588.0
        }
      ]
    }
  ]
}