{
  "id": "b9i560",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1554410770.0,
  "title": "You guys, holy knuckles, I think I've finally recovered",
  "selftext": "First of all, I just realised as I am typing now that I've wasted HALF A YEAR OF MY LIFE fighting with my anorexia relapse.\n\nFOR. F@#K'S. SAKE. God dammit, now I am a bit pissed. It's my final year in law school and I should've been having heck of a good time, but this damn mental issue. It's made me a completely different person. And I ruined my chance with a potentially great guy too (thank god we're still good friends).\n\nBut it was difficult. Not being able to tell anybody who actually understands it was difficult. Went from normal weight to underweight, and now back to normal weight again. I did all the things I never imagined I would've done. Sparing you the details, but I was not me at all.\n\nWhat sucks is that I know all it took was a mental switch. Letting go of control was all it took. All in my brain. That's why I couldn't admit it to anybody. I was suffering alone and trying my best to function normally.\n\nRecovery took about two months - loads of ups and downs, you guys know the gist of it.\n\n***But today, today. I finally let it all go.***\n\nMy final moment was feeding my mental hunger, and let me tell you this, it's got to be all or nothing. No half ass with this, it's unlike physical hunger. Go all out.\n\nI ate whatever I wanted, but it wasn’t binging. So many oat protein pancakes (I really like them), oranges and bananas, chicken, chips and popcorn. Whew, I loved it. And I'm glad to learn I honestly have no taste for processed sugary foods or carbs as well! That's a bonus!\n\nAll it took for me was 3000 calories - yes I still calculated, but no I no longer feel fear or guilt! Also, not even at my highest weight (again, noticed but don't care).\n\nI feel like a rock star, you guys. I can do whatever I want again without being bothered by something so trivial as food. I can focus on my studies again. I'll have to crunch at my dissertation and studies (because of that stupid m\\*\\*\\*\\*\\*fker of course of course I never brought myself to do my work because all I could think about is food), but I have a month's break. I will do this. Damage control, whatever - I will try my best.\n\nI am free from this cage. Free. **FREE.** ***FREE***. free.\n\n&#x200B;\n\nLots of love for everyone out there. Recovery ***is*** worth it. But take your time, and know that it should be on your own terms. Stay safe x",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/b9i560/you_guys_holy_knuckles_i_think_ive_finally/",
  "score": 89,
  "num_comments": 4,
  "comments": [
    {
      "id": "ek4palz",
      "author": "heyy240",
      "body": "Awwww this makes me so happy, I sometimes feel like I will never recover, I'm actually trying harder now after going on and off since October. I'm so proud of u!! Its hard to beat this, you're doing great!",
      "created_utc": 1554411755.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ek4tgbj",
      "author": "None",
      "body": "Congratulations fam 👏🏽👏🏽 so happy for you 😊",
      "created_utc": 1554414756.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ek4vkgr",
      "author": "BlovesCat",
      "body": "I am also in law school and the stress of it all really makes it so much harder to stay in recovery!!!! I’m so happy for you! Good luck on your bar exam (if you’re in US) and enjoy your final semester!!!!!!",
      "created_utc": 1554416335.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ek5v7ps",
      "author": "pretty-precocious",
      "body": "I have sooo much enjoyed rediscovering the joys of pb&j sandwiches lol",
      "created_utc": 1554450505.0,
      "score": 1,
      "context": []
    }
  ]
}