{
  "id": "b9zu49",
  "subreddit": "fuckeatingdisorders",
  "author": "clarelandis",
  "created_utc": 1554517990.0,
  "title": "The \"Café\"",
  "selftext": "I have eaten in the Pine Cone Café 426 times. How? You might ask, is it possible for someone to enjoy a restaurant so much that they eat there 426 times? Well, you haven’t tried the Pine Cone Café and experienced its extraordinary ambiance. It is a place that keeps you coming back for more. The food is exquisite and the staff are there to meet your every need. It’s so fancy that the meals are served covered dish and everyone’s dish is slightly different to meet their particular palate. \n\nAt least, that’s what I tell people. In truth, the Pine Cone Café is the room where we have to eat. The food is mediocre, and it’s super awkward in there because some grown-ass person is usually crying. It’s kind of dismal. It’s the room where people face their toughest demons, which might sound like an exaggeration, but it’s not. It’s a difficult place. So, what do you do when there’s something mildly traumatizing in your life that makes you question your existence? You put it on the internet. That’s kind of the point of the whole internet thing. I wrote a Yelp review to add to those made by my predecessors for the Pine Cone Café so that people show up at the eating disorder nuthouse thinking it’s an actual restaurant. I made a menu as well that is also on Yelp. And, it’s great, random people show up and try to eat at the Pine Cone Café. They ignore the sign out front and the lettering on the building that clearly say it’s eating disorder rehab and march right in, trying to find the restaurant. The lady at the front desk has to turn them away and say that there isn’t actually a restaurant open to the public. At that point, people get very confused. Two businessmen came in their suits and ties to dine with us, and were genuinely disappointed when they learned they couldn’t eat there. But, not my problem. I just write the reviews. I was actually quite honest in my review from several weeks back, I just inflated a few of the perks of the Café: \n\n*Wow. What a unique dining experience. I have eaten here 6 times per day for the past 5 weeks; it's just that compulsory. The menu here is different every day, but repeats itself every 3 weeks to allow for a perfect balance of variety and familiarity. As for the food, it is the crème de la crème. Options vary from the world famous Asian-inspired soba noodle salad to Colorado's finest carrot ginger soup. For the less adventurous eater, the Pine Cone Café offers grilled cheese with cheese made from the tears of past customers and panko-encrusted chicken tenders with a sweet and savory honey mustard sauce. However, you can only order each of these delicacies once every 3 weeks. But, not to worry, if you don't enjoy the explosive flavors, the staff will offer you a liquid replacement for your food that comes in strawberry, chocolate, or vanilla. The magic liquid is stored in a special wine cellar in mahogany boxes. They will provide you with encouragement until you complete it. In fact, they are so insistent that you get adequate nutrition that you have to fill out an official form should you not complete the liquid food.* \n\n*While the food is incredible, what really sets this place apart is its distinct culture. The intimate café usually seats just 4 tables of 6. The waitstaff sit with you whilst you dine and encourage games to be played at the table. If you choose to immerse yourself in this sensory experience, be aware that it is considered rude here at the Pine Cone Café to put your napkin in your lap. Should you make the grave mistake of putting your napkin in your lap, or even worse, putting your hands below the table, you shall receive a stern glare from a staff member and, in the most extreme cases, chastising from fellow diners.* \n\n*Don't worry, your dining experience doesn't end with the meal. The party continues into the night! Following dinner, you are invited to the resort's second floor which boasts private state rooms and a spa. The spa specializes in the ancient art of Japanese urinary analysis. Spa attendants analyze a silver cup of your urine each day to ensure adequate hydration. Should your urine not pass the test, you will be given a special ruby-encrusted goblet full of water at the next meal.* \n\n*Overall, I give this place an 11/10 which is why I have no intention of leaving anytime soon and even brought many of my favorite things from home to keep in my private state room.*\n\nSo, now, for the rest of my life, whenever I see a pine cone, I’m going to have the weirdest flashbacks. I’ll be 35 years old and making one of those pine cone bird feeders with my kid, and all I’ll be able to think about is someone dropping a single blueberry at snack and getting it replaced. You drop one little blueberry and have to get a new one because we don’t restrict at the Pine Cone Café. Or, I’ll be walking down the street and step on a pine cone and the crunch will bring me right back to the millions of bags of pita chips I had to eat in the café. ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/b9zu49/the_café/",
  "score": 299,
  "num_comments": 13,
  "comments": [
    {
      "id": "ek8hq7w",
      "author": "somegenerichandle",
      "body": "surreal.",
      "created_utc": 1554536946.0,
      "score": 38,
      "context": []
    },
    {
      "id": "ek8px26",
      "author": "BigAbbott",
      "body": "nose license thought fertile workable adjoining bow books abundant voiceless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1554551376.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ek8u4ce",
      "author": "smmcg1123",
      "body": "You’re a fantastic writer. I hope your recovery is going well! I’ve been reading your blog after you posted the link last week. Keep up the great writing and ED recovery work! I’m pulling for you!",
      "created_utc": 1554556603.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ek8z7r2",
      "author": "None",
      "body": "Holy fuck this is epic.",
      "created_utc": 1554561619.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ek97uhs",
      "author": "None",
      "body": "Amazing.",
      "created_utc": 1554568428.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ek9eogb",
      "author": "limi4am",
      "body": "please keep writing!! this was so nice to read you really know what you're doing with words ",
      "created_utc": 1554573241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ekblgbm",
      "author": "LotusCakee",
      "body": "Absolute madlad",
      "created_utc": 1554654168.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ekefkxs",
      "author": "None",
      "body": "This is the content I like.",
      "created_utc": 1554743634.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ekh39yw",
      "author": "annacanhavefun",
      "body": "i love your writing",
      "created_utc": 1554823190.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ekoruky",
      "author": "clarelandis",
      "body": "[https://thiscrazybeautifullife.home.blog](https://thiscrazybeautifullife.home.blog)",
      "created_utc": 1555041600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ekorwol",
      "author": "clarelandis",
      "body": "Thank you!",
      "created_utc": 1555041658.0,
      "score": 5,
      "context": [
        {
          "id": "ek8u4ce",
          "author": "smmcg1123",
          "body": "You’re a fantastic writer. I hope your recovery is going well! I’ve been reading your blog after you posted the link last week. Keep up the great writing and ED recovery work! I’m pulling for you!",
          "created_utc": 1554556603.0
        }
      ]
    },
    {
      "id": "ekorxh0",
      "author": "clarelandis",
      "body": "Thank you so much!",
      "created_utc": 1555041681.0,
      "score": 1,
      "context": [
        {
          "id": "ek9eogb",
          "author": "limi4am",
          "body": "please keep writing!! this was so nice to read you really know what you're doing with words ",
          "created_utc": 1554573241.0
        }
      ]
    },
    {
      "id": "ekh3a95",
      "author": "agree-with-you",
      "body": "I love you both",
      "created_utc": 1554823195.0,
      "score": 2,
      "context": [
        {
          "id": "ekh39yw",
          "author": "annacanhavefun",
          "body": "i love your writing",
          "created_utc": 1554823190.0
        }
      ]
    }
  ]
}