{
  "id": "bc65mu",
  "subreddit": "fuckeatingdisorders",
  "author": "PleaseDontGoMom",
  "created_utc": 1555022035.0,
  "title": "From the daughter of a purger..",
  "selftext": "Hi you guys. I found this sub a while ago and quickly joined. I’m sorry if this is weird or out of the norm but I am 23 years old. My mom is in her forty’s. I created a new act because I would hate for anyone to link me to it and see this post. My moms bulimia has always been an unspoken word of trust. But I’m just going to dive right in. \n\nI remember hearing my mom throwing up at night after dinner. And every night before bed I would hear the popping of laxatives.. almost 20 a night and as I grew older that number grew too. I never said anything. Even when she asked me to send her some when she wasn’t able to get them, as I got older, I would. And never said anything still. She is the most gorgeous person to me. Not only on the inside but on the outside as well. \n\nEventually I got older and realized what was happening. I was however struggling with self harm and understood, in a way, her pain. So I didn’t say anything. Just like she didn’t for a while. \n\nI remember the first time she went to the hospital I was 16. I was high and tired and she texted me but I went to bed. When I woke up I found her in a puddle of vomit.. that is my biggest regret. I took her to the ER. \n\nHer kidneys are failing. \n\nThis became a pattern for a few years. And then more frequent. But I’m always there and I always try. And it is so hard and exhausting. She has lost her teeth.. she is so fragile but still so beautiful. The wear and tear on her body after over 30 years of abuse is devastating. Her joints are crippled with gout because of the build up of uric acid in her body..\n\nI don’t want to lose my mom.. but I’m afraid I’m going to soon. \n\nI don’t want to lose my mom. I want her to be strong and happy and full.. \n\nI want her to be strong enough to stop taking laxatives and puking. I don’t want to spend the remainder of our time in hospital room after hospital room.\n\nI am losing my mom to an eating disorder. \n\nPlease be strong fellow redditors and get help. Don’t do it for your family. Don’t do it for anyone but yourself. It is such a long painful path.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bc65mu/from_the_daughter_of_a_purger/",
  "score": 333,
  "num_comments": 13,
  "comments": [
    {
      "id": "ekogvum",
      "author": "thomascaticus",
      "body": "Thank you for sharing your story, I truly wish you and your mom the best of luck, eating disorders are incredibly difficult to deal with",
      "created_utc": 1555032346.0,
      "score": 41,
      "context": []
    },
    {
      "id": "ekop4pn",
      "author": "CrumbKitten",
      "body": "Thank you for saying this. This really hits home with me, and makes me want to be stronger for those around me. Stronger, to hold on to the potential of a life.",
      "created_utc": 1555039026.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ekopw4q",
      "author": "thirdocean",
      "body": "I think you should tell her. Let her know how you feel. Maybe show her this post. She has to decide for herself to recover, but I dont think you should keep this in and I think she should hear it.",
      "created_utc": 1555039716.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ekplmru",
      "author": "ThatOnePotential",
      "body": "Thank you so much for being so brave and sharing your perspective. I am sorry your mother is not doing well and you, as a consequence, are suffering as well. \n\nWhile you mother does have to want to get better on her own, having your support will help her if she ever decides to make the decision to get better. When I was sick, it really helped to learn about other people who had suffered long-term who got better--my go to example is Jane Fonda (an old school example, I know). After 20 something years, she stopped purging in her late 30s. While her recovery might be questionable in light of what I now know about full recovery, it is hopeful to realize that long-term EDs can be recovered from.\n\nMy own severe bouts of bulimia (and a host of other ED behaviors for the majority of my life) has really influenced my decision to hold off on child bearing. My mother had a severely dysfunctional relationship with food, which, of course, influenced my own series of disordered behaviors. \n\nBecause the ED convinces you that you are able to hide it, it's easy to think your behavior is only hurting you. Your story is a necessary reminder that that is not so. Thank you again for sharing; sending you and your mother lots of love and support <3",
      "created_utc": 1555073135.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ekq00un",
      "author": "problematicbeing",
      "body": "I am so sorry, having to be a parent to your parent is something that should never be expected out of a child. When your parent suffers from an eating disorder though, it becomes your reality. I'm in recovery and only 22, but I've considered since I was 16, not having children so I wouldn't pass my insecurities, disordered eating, anxieties, or perfectionism on to them, it just feels irresponsible to have a child and put them at risk of becoming like me. Luckily, I am on the path to healing, I am mentally stronger than ever and addressing everything that I feared I could pass to my kids. I still might not have kids, cause I'm a selfish mofo, but that's just where I am right now.  \n\n\nEating disorders are deadly and pervasive, they should never be taken lightly or go untreated at first signs. I have heard stories of people who have recovered after 20-30+ years of suffering, it is possible, but it isn't as common as succumbing to your illness. I hope more than anything your mom is able to find something to make her change. And I hope you are able to heal as well.",
      "created_utc": 1555082197.0,
      "score": 3,
      "context": []
    },
    {
      "id": "empdlzz",
      "author": "lizard2380",
      "body": "at a time when I feel so close to relapsing, this is moving enough to remind me why I fight. If not for me, then for those in my life, and those that love me, and those that think I'm beautiful even when I'm convinced I'm not. \n\nSending my best wishes to your family.",
      "created_utc": 1557197985.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ekpvrum",
      "author": "None",
      "body": "Losing my teeth is what scares me the most... It's been less than a year, but I can already feel and see the damage. I hope your mom wins the fight against the ED. Better now than never! Stay strong 💖",
      "created_utc": 1555079715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ekoprcg",
      "author": "PleaseDontGoMom",
      "body": "Thank you <3",
      "created_utc": 1555039594.0,
      "score": 16,
      "context": [
        {
          "id": "ekogvum",
          "author": "thomascaticus",
          "body": "Thank you for sharing your story, I truly wish you and your mom the best of luck, eating disorders are incredibly difficult to deal with",
          "created_utc": 1555032346.0
        }
      ]
    },
    {
      "id": "ekopng8",
      "author": "PleaseDontGoMom",
      "body": "You are beautiful. And know that those who surround you see this beauty. Be strong for whoever you need to be strong for but most importantly yourself <3 life is so short. Enjoy the simple pleasures and live it full.",
      "created_utc": 1555039497.0,
      "score": 14,
      "context": [
        {
          "id": "ekop4pn",
          "author": "CrumbKitten",
          "body": "Thank you for saying this. This really hits home with me, and makes me want to be stronger for those around me. Stronger, to hold on to the potential of a life.",
          "created_utc": 1555039026.0
        }
      ]
    },
    {
      "id": "ekoqdzq",
      "author": "PleaseDontGoMom",
      "body": "I’ve seen her push everyone closest to her away because they confronted her.. I would much rather have her as she is.. as weak or selfish that may seem :/ I’m not sure.",
      "created_utc": 1555040175.0,
      "score": 18,
      "context": [
        {
          "id": "ekopw4q",
          "author": "thirdocean",
          "body": "I think you should tell her. Let her know how you feel. Maybe show her this post. She has to decide for herself to recover, but I dont think you should keep this in and I think she should hear it.",
          "created_utc": 1555039716.0
        }
      ]
    },
    {
      "id": "ekpt8ud",
      "author": "somegenerichandle",
      "body": "Sorry if this is off topic. But, it reminds me of some drunk guy on a bus who started telling me about Karen Carpenter. It didn't help that i was incredibly nauseous and on a bus christmas eve. But, i felt like he was telling me for a reason.",
      "created_utc": 1555078177.0,
      "score": 2,
      "context": [
        {
          "id": "ekplmru",
          "author": "ThatOnePotential",
          "body": "Thank you so much for being so brave and sharing your perspective. I am sorry your mother is not doing well and you, as a consequence, are suffering as well. \n\nWhile you mother does have to want to get better on her own, having your support will help her if she ever decides to make the decision to get better. When I was sick, it really helped to learn about other people who had suffered long-term who got better--my go to example is Jane Fonda (an old school example, I know). After 20 something years, she stopped purging in her late 30s. While her recovery might be questionable in light of what I now know about full recovery, it is hopeful to realize that long-term EDs can be recovered from.\n\nMy own severe bouts of bulimia (and a host of other ED behaviors for the majority of my life) has really influenced my decision to hold off on child bearing. My mother had a severely dysfunctional relationship with food, which, of course, influenced my own series of disordered behaviors. \n\nBecause the ED convinces you that you are able to hide it, it's easy to think your behavior is only hurting you. Your story is a necessary reminder that that is not so. Thank you again for sharing; sending you and your mother lots of love and support <3",
          "created_utc": 1555073135.0
        }
      ]
    },
    {
      "id": "ekr7cay",
      "author": "PleaseDontGoMom",
      "body": "I appreciate your reply..\n\nI understand my mom. I get it. But it’s hard. Understanding doesn’t make it easier. And I feel like most people would much rather not. \n\nAll I can say is - don’t have kids because you feel that you truly don’t want them. My mom, if she wasn’t mine, I wouldn’t believe to be a mom. She I’m sure felt the same ways you do and has actually said as much. But i am her best friend. I saw all those awful bits growing up.. not just the bulimia. But the self loathing, the insecurities, and so much anger towards not only herself but me.. But I grew up and understand now. She is my best friend too. And although no one is the same, I know she is so glad she had me. Even though she never wanted kids. And I was indeed an accident. \n\nI wouldn’t trade her for the world.",
      "created_utc": 1555107860.0,
      "score": 4,
      "context": [
        {
          "id": "ekq00un",
          "author": "problematicbeing",
          "body": "I am so sorry, having to be a parent to your parent is something that should never be expected out of a child. When your parent suffers from an eating disorder though, it becomes your reality. I'm in recovery and only 22, but I've considered since I was 16, not having children so I wouldn't pass my insecurities, disordered eating, anxieties, or perfectionism on to them, it just feels irresponsible to have a child and put them at risk of becoming like me. Luckily, I am on the path to healing, I am mentally stronger than ever and addressing everything that I feared I could pass to my kids. I still might not have kids, cause I'm a selfish mofo, but that's just where I am right now.  \n\n\nEating disorders are deadly and pervasive, they should never be taken lightly or go untreated at first signs. I have heard stories of people who have recovered after 20-30+ years of suffering, it is possible, but it isn't as common as succumbing to your illness. I hope more than anything your mom is able to find something to make her change. And I hope you are able to heal as well.",
          "created_utc": 1555082197.0
        }
      ]
    },
    {
      "id": "ekr7w3q",
      "author": "PleaseDontGoMom",
      "body": "Her teeth were the hardest part to go I think for her. Once your teeth are removed, even with dentures, your face is different and not as full because of bone structure. Not only is the whole thing painful, it usually transpires over a period of time. And then after eating isn’t the same. She can’t chew gum or eat her favorite candies. It breaks my heart whenever she sees something she wants but can’t have. \n\nBut on another note \n\nYou have this. You are strong and beautiful. And strong is what you make it. You will find it within yourself one day to make the first step. You may take many first steps, but that’s okay. I’ve taken so many first steps. But all that matters is that you tried. \n\nSending you positive thoughts <3 you are beautiful.",
      "created_utc": 1555108238.0,
      "score": 6,
      "context": [
        {
          "id": "ekpvrum",
          "author": "None",
          "body": "Losing my teeth is what scares me the most... It's been less than a year, but I can already feel and see the damage. I hope your mom wins the fight against the ED. Better now than never! Stay strong 💖",
          "created_utc": 1555079715.0
        }
      ]
    }
  ]
}