{
  "id": "bcm9gm",
  "subreddit": "fuckeatingdisorders",
  "author": "CozyJumpers",
  "created_utc": 1555124675.0,
  "title": "Weird Realisations: Seeing how disordered society was as a whole with eating made me feel better about recovering",
  "selftext": "Today I randomly saw a woman whom I have a tremendous amount of respect for, a woman who is incredibly smart, empathetic, and just all around amazing, talk about going on a paleo diet. And it made me feel super sad for her that she was entangled in all of that, but as I heard her talk about how happy she was to be losing weight \"the healthy way\", and seeing her falling into the wellness trap that things like paleo and whatnot try to sell people, it also made me be able to step back and feel almost... reassured? In my recovery process. \n\nBecause if people who are that smart, perceptive, and knowledgeable can fall into the trap of diet culture, then it's clearly something that is so deeply ingrained and normalised in society. And being able to see that rhetoric from the outside in, it made me realise how much bullshit it all was. The lie that cutting out \\[certain type of food\\] will make you \"just feel soooo much better!\" and the lie that constantly trying to eat as \"clean\" (read: perfect) as possible was a good and worthy goal to strive for, made me realise just how utterly fucked up it all was. \n\nIt also reassured me in the sense that it made me realise that the reason everyone and their grandma is constantly obsessing over their food and bodies is not because that's a normal thing to do, but because of how society as a whole is deeply disordered and encourages disordered behaviour around food. Fighting this thought process is an uphill battle but it gets a little easier when realising that it's a good fight to fight, and that you're not the crazy one in the room for not wanting to talk about calories, even if you're the only one who feels that way.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bcm9gm/weird_realisations_seeing_how_disordered_society/",
  "score": 126,
  "num_comments": 7,
  "comments": [
    {
      "id": "eku5ocj",
      "author": "ThatOnePotential",
      "body": "Thank you for sharing this realization. It's really hard to un-see the society's collective eating disorder and fatphobia, once you start your journey towards healing.\n\nI know one factor in helping me chose recovery has been working with a few women who are older and intelligent, and whom I respect, but I noticed they spend a *lot* of time making negative comments about their bodies and their diets (or inability to stick to their diets). I started thinking, \"I *do not* want to still be talking about this shit when I'm their ages.\"",
      "created_utc": 1555201606.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eksymz8",
      "author": "lyricalmasterflash",
      "body": "This was a great read. You are right, and you said it so dead on! Thank you, this helps me in my recovery as I (we as all people) need to realize this, use radical acceptance, and then change societies \"norms.\"",
      "created_utc": 1555171654.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ekvdeh0",
      "author": "BrokenPaintedLady",
      "body": "Thank you for saying this. Bravo.\n\nAt one point in my journey of recovering from my ED, I decided to join one of those diet programs. You know, the one with retail locations in little strip malls all across this country (US), starts with a Slim and ends with a Genics. The program itself was quite restrictive, and the foods on the \"can't eat\" list far outnumbered the foods on the \"can eat\" list. I really tried, gave it a valiant effort because I thought eating SOMETHING on a regular basis was better than starving myself, or binging on candy and then starving myself. Anyway - sure enough, it only took a couple weeks on that plan before my ED was nearly in full-blown raging active status again. That little voice in my head came right back to the front and nearly took over again. I (fortunately) had enough wherewithal to realize what was happening, and I promptly called the place up to cancel. \n\nWhen I explained why I was doing so and what was going on, she didn't believe me. She said, \"but we've had tremendous results with people using our program to treat an eating disorder! What do you mean it made it worse??\" She just couldn't fathom that a \"diet\" could have a terribly detrimental outcome like that - and this revealed she didn't have any real health experience and shouldn't be coaching people about their diets/nutrition without at least being aware of such things. \n\nSo yeah, our culture is screwed up for sure. We're not crazy for calling it what it is.",
      "created_utc": 1555251417.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eptfhid",
      "author": "forestfairy23",
      "body": "I just came to your profile after your recent post in the ED sub and your posts are just brilliant. You have amazing insight!!!! I am so happy recovery is going well for you ❤️❤️❤️",
      "created_utc": 1559489095.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ekuhlpb",
      "author": "CozyJumpers",
      "body": "Right?! It's seriously so messed up and heartbreaking seeing older women talk about their bodies this way, because it makes you realise that the disordered messages society sends out don't discriminate based on age. Anorexia doesn't just target 13-17 year old suburban girls, it targets the new mothers who are pressured to lose their \"baby weight\" (weight they physically needed to gain in order to grow a literal human inside of them!) as well as the middle aged women whose fridges are full of diet coke and diet ice cream and still check their reflection a little too often in airport mirrors, etc.\n\nI definitely don't want to end up like that, but my heart also breaks for them that they did, and I hope more than anything that they'll find peace and support one day to not feel obligated to hate their bodies in order to feel worthy of just existing in the world.",
      "created_utc": 1555211290.0,
      "score": 4,
      "context": [
        {
          "id": "eku5ocj",
          "author": "ThatOnePotential",
          "body": "Thank you for sharing this realization. It's really hard to un-see the society's collective eating disorder and fatphobia, once you start your journey towards healing.\n\nI know one factor in helping me chose recovery has been working with a few women who are older and intelligent, and whom I respect, but I noticed they spend a *lot* of time making negative comments about their bodies and their diets (or inability to stick to their diets). I started thinking, \"I *do not* want to still be talking about this shit when I'm their ages.\"",
          "created_utc": 1555201606.0
        }
      ]
    },
    {
      "id": "epu2i8v",
      "author": "CozyJumpers",
      "body": "Aw, you're so sweet! Thank you so much gorgeous!! I hope your recovery process is going well too xx",
      "created_utc": 1559502436.0,
      "score": 1,
      "context": [
        {
          "id": "eptfhid",
          "author": "forestfairy23",
          "body": "I just came to your profile after your recent post in the ED sub and your posts are just brilliant. You have amazing insight!!!! I am so happy recovery is going well for you ❤️❤️❤️",
          "created_utc": 1559489095.0
        }
      ]
    },
    {
      "id": "ekvoixx",
      "author": "ThatOnePotential",
      "body": "Before working with these women, I just assumed things would get better when you get older. Like, you wouldn't have the play that game. When I started hearing all the diet talk from these ladies, it just made me so sad.",
      "created_utc": 1555260109.0,
      "score": 4,
      "context": [
        {
          "id": "eku5ocj",
          "author": "ThatOnePotential",
          "body": "Thank you for sharing this realization. It's really hard to un-see the society's collective eating disorder and fatphobia, once you start your journey towards healing.\n\nI know one factor in helping me chose recovery has been working with a few women who are older and intelligent, and whom I respect, but I noticed they spend a *lot* of time making negative comments about their bodies and their diets (or inability to stick to their diets). I started thinking, \"I *do not* want to still be talking about this shit when I'm their ages.\"",
          "created_utc": 1555201606.0
        },
        {
          "id": "ekuhlpb",
          "author": "CozyJumpers",
          "body": "Right?! It's seriously so messed up and heartbreaking seeing older women talk about their bodies this way, because it makes you realise that the disordered messages society sends out don't discriminate based on age. Anorexia doesn't just target 13-17 year old suburban girls, it targets the new mothers who are pressured to lose their \"baby weight\" (weight they physically needed to gain in order to grow a literal human inside of them!) as well as the middle aged women whose fridges are full of diet coke and diet ice cream and still check their reflection a little too often in airport mirrors, etc.\n\nI definitely don't want to end up like that, but my heart also breaks for them that they did, and I hope more than anything that they'll find peace and support one day to not feel obligated to hate their bodies in order to feel worthy of just existing in the world.",
          "created_utc": 1555211290.0
        }
      ]
    }
  ]
}