{
  "id": "bd478h",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1555257642.0,
  "title": "I'm determined to make my new coworkers see me as \"normal\"",
  "selftext": "Posting here because no one in my social circle would really understand...\n\nI'm starting a new job tomorrow that I'm really excited about, and I want to use this opportunity as a fresh start.  All of my former coworkers realized I had an eating disorder (well, I'm \"in recovery,\" but I still have little giveaways) and it became an uncomfortably common topic of conversation in the office.  I don't think non-ED people realize how excruciatingly embarrassing it is to be called out for what you're eating (or not eating), but my god, I used to dread lunch at my old work.  I'd try to sneak the meal a few hours early or late, when no one was socializing and would notice me, but inevitably someone would see.  I can't begin to count the number of \"oh, she's eating!!!!\" or \"I've never actually seen you eat anything!!!\" or \"You're just eating a handful of almonds?  Where's the rest of your lunch?!?!?!!\" comments I'd get.  I felt embarrassed to bring or be seen eating anything, really, because having food in my vicinity always seemed to make me the center of attention.  Again, I don't think non-ED people can really understand the stress of eating, much less eating in an uncomfortable atmosphere where you're the center of attention.\n\nANYWAY, rant over, because tomorrow is a new beginning!  I'm determined to pack a variety of \"normal\" lunches and snacks that won't raise any red flags.  I never, ever, ever want to be The Weird Girl In the Office Who Doesn't Eat.  I'm hoping that, from tomorrow forward, nobody feels the need to do a double-take of what I'm eating or put me in the spotlight for it :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bd478h/im_determined_to_make_my_new_coworkers_see_me_as/",
  "score": 91,
  "num_comments": 5,
  "comments": [
    {
      "id": "ekvml8u",
      "author": "TheDrunkenGiraffe",
      "body": "yay for you! making lunches for work is so much fun because you get to hide little happy things in your lunches. I used to bring fancy yogurt because it made me feel good. You can always pick things to bring that will bring you a little bit of joy in the day.",
      "created_utc": 1555258665.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ekvnj9k",
      "author": "None",
      "body": "I'm so happy for you! Best of luck at your new job, hopefully it keeps you motivated to stay in recovery. :)",
      "created_utc": 1555259367.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ekvvjbm",
      "author": "Sir_holy_bears",
      "body": "Congrats and enjoy taking the first steps to your fresh start!! Triggers like these are so annoying and hard to escape, but it sounds like your determination will evade them:)",
      "created_utc": 1555265133.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ekwkfis",
      "author": "yamiryukia330",
      "body": "You can just have little things to make it a snacky lunch or use it to give yourself something yummy to make the day better.",
      "created_utc": 1555284793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ekyroln",
      "author": "MoosieGoose",
      "body": "I've been in your place, and the comments were very uncool. I have a co-worker who I think may be in this position now (I haven't officially discussed the topic w/ her, but she's dropped some hints) and I've been trying my best to be only supportive/real about anything she says. \n\nPeople really shouldn't comment on what others eat, unless they want them to comment.",
      "created_utc": 1555357600.0,
      "score": 2,
      "context": []
    }
  ]
}