{
  "id": "bfh3bl",
  "subreddit": "fuckeatingdisorders",
  "author": "phantasmagorica1",
  "created_utc": 1555794389.0,
  "title": "Is it me or are there a lot of non-recovery focused posts?",
  "selftext": "Edit: I wanted to clarify this isn't about people talking about the challenges in recovery. The choice to recover is a hard one and there are lots of tough aspects to cope with during the process! I am specifically talking about posts that ask for advice on restricting, weight loss, perpetuating ED behaviours with no intention of recovery.\n\nNot just off topic stuff but posts actively about restricting, food shame, etc. It's making this space incredibly challenging to deal with especially as someone actively working on recovery.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bfh3bl/is_it_me_or_are_there_a_lot_of_nonrecovery/",
  "score": 93,
  "num_comments": 13,
  "comments": [
    {
      "id": "eldr1iw",
      "author": "None",
      "body": "There are stages to behavior changes. Forums like this catch a lot of people in the contemplation stage -- thinking about making a change - because there is relatively little investment in making an anonymous post on a website.\n\nI don't think there is anything wrong with politely or constructively challenging posts that seem more disordered-focused than recovery-focused, especially if you can speak from the \"I.\" Even if you can't necessarily change others' behavior, it may keep you from internalizing/rationalizing harmful thoughts and behaviors by actively working against them.",
      "created_utc": 1555798503.0,
      "score": 46,
      "context": []
    },
    {
      "id": "eldpir3",
      "author": "None",
      "body": "Yup. Lots of it.",
      "created_utc": 1555797356.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eldln0k",
      "author": "swtmadness",
      "body": "there are a lot of triggering posts.",
      "created_utc": 1555794583.0,
      "score": 23,
      "context": []
    },
    {
      "id": "eldt8uz",
      "author": "ThatOnePotential",
      "body": "It's not just you'; there seem to be a lot of posts that are drenched in ED voice/thoughts. I agree that they can be challenging, but mostly they do help remind me what I do not want to return to. \n\nI think when you are in recovery it can be easy to have thoughts like, \"Maybe things weren't so bad before, I could probably start to 'eat healthier' with no problem.\" But then I read some of the non-recovery posts, and am like, \"Right. That's what I turning away from. No thanks.\"",
      "created_utc": 1555800120.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eldu1bc",
      "author": "CozyJumpers",
      "body": "Yep. It was REALLY bad a few months ago, a pro-ana-ish subreddit got shut down by reddit back then and so all of it's users flocked here and started making the worst posts and making the space super toxic, like super anti-recovery, derogatory remarks about food, eating, bodies, etc. Some of them giving literal tips (or asking for tips) on fasting/ED behaviours and having absolutely no respect or regard to the fact that this is a recovery space. It's died down quite a bit since then, especially since a lot of us here were like adamantly telling them that this wasn't ok when they posted those things, but every once in a while you still see it.\n\nSome of them are definitely just clueless to the nature of this space and aren't intending to make the space negative, while others honestly seem to just feel entitled and like they should be allowed to say whatever they want (regardless of who it hurts), but at the end of the day, regardless of intent, the impact is definitely the same and these posts are incredibly insidious in a space that's meant to foster an environment of healing and recovery.\n\nIt makes me really upset seeing those posts, but all I can say is if you see them, try to report them to the mods, it makes a huge difference and it deters people from thinking that this kind of thing is ok to post here. Additionally, like another commenter mentioned, politely/constructively challenging that rhetoric when you see it can be a helpful way to keep this space positive and also prevent non-recovery rhetoric like that from getting normalised.",
      "created_utc": 1555800693.0,
      "score": 16,
      "context": []
    },
    {
      "id": "eldr2gi",
      "author": "robotsintrees",
      "body": "Agreed.",
      "created_utc": 1555798523.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eldujvr",
      "author": "lassiemav3n",
      "body": "I have actually noticed a sudden jump in this in the past week - posts where I end up checking what sub I’m reading. Thanks for posting about this, I was feeling a bit confused about it.",
      "created_utc": 1555801079.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eleq3z5",
      "author": "Lorria",
      "body": "The difficult part here is knowing where to draw the line: there are people at all stages of recovery, including just acknowledging that something might be wrong (which is huge, at least it was for me). And yeah, there are some posts that are concerning, but what I see is that in the comment replies the good people of this sub will be compassionate and speak against the ED thoughts expressed. And I hope that it's helpful to the OP (and those reading) to be able to write the thoughts down and see the arguments/discussion that counter the ED thoughts. I worry that if we really crack down, people who have these thoughts won't feel safe to post them and they will go unchallenged.\n\nWe (= mod team) have agreed we should think of a way to help readers navigate the place a bit better and we'll hopefully get that sorted out soon.\n\nIf you do spot something that's really out of line, use the report button to call it to moderator attention.",
      "created_utc": 1555831043.0,
      "score": 5,
      "context": []
    },
    {
      "id": "elf4x4l",
      "author": "aceshighsays",
      "body": "Is that not part of recovery? Having to deal with restricting, food shame etc?",
      "created_utc": 1555852990.0,
      "score": 3,
      "context": []
    },
    {
      "id": "elef6qn",
      "author": "None",
      "body": "Honestly, just followed this sub about a week ago and just about to unfollow...I feel like being here will do nothing but make my ED worse based on recent posts",
      "created_utc": 1555817966.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eleqwm5",
      "author": "RichardStarrkey",
      "body": "Sometimes I make posts that perpetuate my own emotions about these problems, it's a very unhealthy thing to do but in mania or when I'm black out drunk I don't really know how to control myself. \n\nSorry about that, I've been thinking of unsubscribing to these subs just to get a better lead on life. Just like how I only visit /r/cripplingalcoholism to post funny or artistic stories, and I never read the other posts because that's what I did while drinking all day at the worst time with my addiction. If I read them I'll start drinking and read all the bad shit and relate to it, striking up these negative emotions.",
      "created_utc": 1555832288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eldzmph",
      "author": "phantasmagorica1",
      "body": "Thank you, this helps. I understand that making that change can be really tough (even for myself it took multiple goes for it to stick) so I should really respond with compassion while pushing back against normalizing those behaviours.",
      "created_utc": 1555804785.0,
      "score": 9,
      "context": [
        {
          "id": "eldr1iw",
          "author": "None",
          "body": "There are stages to behavior changes. Forums like this catch a lot of people in the contemplation stage -- thinking about making a change - because there is relatively little investment in making an anonymous post on a website.\n\nI don't think there is anything wrong with politely or constructively challenging posts that seem more disordered-focused than recovery-focused, especially if you can speak from the \"I.\" Even if you can't necessarily change others' behavior, it may keep you from internalizing/rationalizing harmful thoughts and behaviors by actively working against them.",
          "created_utc": 1555798503.0
        }
      ]
    },
    {
      "id": "elgwvn9",
      "author": "phantasmagorica1",
      "body": "I definitely recognize the challenges in recovery! I am not referring to those posts. I didn't want to name specific ones but I was thinking of one where someone wanted suggestions on hiding their ED habits, another which talked about restricting because they ate too much, etc. Posts that are not \"recovery is hard and these are the challenges that come with it\", rather more like \"how can others help me perpetuate or support my ED behaviours\".",
      "created_utc": 1555900969.0,
      "score": 2,
      "context": [
        {
          "id": "elf4x4l",
          "author": "aceshighsays",
          "body": "Is that not part of recovery? Having to deal with restricting, food shame etc?",
          "created_utc": 1555852990.0
        }
      ]
    }
  ]
}