{
  "id": "bn6yxv",
  "subreddit": "fuckeatingdisorders",
  "author": "Wigforfire",
  "created_utc": 1557541247.0,
  "title": "The meaningfulness of a post it note",
  "selftext": "I wander groggily up the stairs, battling my lower level movement urges, fighting myself against OCD urges to walk around the block 3 times before breakfast. I pace up and down the stairs, finding some comfort in it before getting aggravated at myself and stopping again.\n\nThis shit is hard. Compensatory behaviors are a bitch and the thoughts of eating a cookie right after eating pizza for dinner because I decided to ‘extra challenge’ myself swarm in my head. I still have to eat breakfast though and I know that. I just have to forget. Eat and forget. But first coffee.\n\nUp the stairs again to the kurieg which is already set up for me, pod in place, cup under spout. My fiance treats me so well, getting up at 4:30am for work and still finding time to get my shit in order (or at least the coffee portion of it). I smile and grip the handle, pulling down the lid of the coffee machine and as i do a post it note reveals itself on the top of the machine: ‘thank you for eating a cookie and having a sip of my soda with me last night. I love you. You’re doing great.’\n\nSometimes the things we do dont seem like they’re enough or it seems like we are the only ones who know the volume of the noise in our heads, but those notes remind me that no matter what, someone knows how hard it is and they’ll always be proud of me for trying",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bn6yxv/the_meaningfulness_of_a_post_it_note/",
  "score": 110,
  "num_comments": 6,
  "comments": [
    {
      "id": "en3inhm",
      "author": "tink053184",
      "body": "I love that. Thank you for sharing!",
      "created_utc": 1557558506.0,
      "score": 11,
      "context": []
    },
    {
      "id": "en3xuwx",
      "author": "1234delicatepear",
      "body": "Awwwww that’s so cute! Thank you for sharing and great job on your accomplishment!! Ik it’s hard but you’re doing great!",
      "created_utc": 1557573394.0,
      "score": 3,
      "context": []
    },
    {
      "id": "en4t4y4",
      "author": "pabstpumpkinbeer",
      "body": "This is lovely. Keep fighting <3",
      "created_utc": 1557595032.0,
      "score": 2,
      "context": []
    },
    {
      "id": "endyf32",
      "author": "Wigforfire",
      "body": "💚💚",
      "created_utc": 1557789593.0,
      "score": 1,
      "context": [
        {
          "id": "en3inhm",
          "author": "tink053184",
          "body": "I love that. Thank you for sharing!",
          "created_utc": 1557558506.0
        }
      ]
    },
    {
      "id": "endyiuw",
      "author": "Wigforfire",
      "body": "Thank you so much it means a lot. This is such a battle, especially on days when you cant feel good for yourself and i hope you are doing well in your battle too 💕",
      "created_utc": 1557789652.0,
      "score": 1,
      "context": [
        {
          "id": "en3xuwx",
          "author": "1234delicatepear",
          "body": "Awwwww that’s so cute! Thank you for sharing and great job on your accomplishment!! Ik it’s hard but you’re doing great!",
          "created_utc": 1557573394.0
        }
      ]
    },
    {
      "id": "endyjvv",
      "author": "Wigforfire",
      "body": "Thank you so so much 💕",
      "created_utc": 1557789668.0,
      "score": 2,
      "context": [
        {
          "id": "en4t4y4",
          "author": "pabstpumpkinbeer",
          "body": "This is lovely. Keep fighting <3",
          "created_utc": 1557595032.0
        }
      ]
    }
  ]
}