{
  "id": "bqp22l",
  "subreddit": "fuckeatingdisorders",
  "author": "CozyJumpers",
  "created_utc": 1558316860.0,
  "title": "'Eating Disorders as Coping Mechanisms to Trauma'",
  "selftext": "I'm reading this brilliant thesis by Alexa Riobueno-Naylor at Wellesley College about the intersection of Eating Disorders, Race, and Trauma, and I wanted to share this excerpt that resonated with me quite deeply: \n\n&#x200B;\n\n> *The ways that the women in this sample described their relationships to food said a lot about how they thought about themselves in relation to the world around them. According to the stories included in this sample, the relationships that women had to their EDs were representative of how they coped with experiences of trauma that disrupted their bodily autonomy and sense of self. As Becky Thompson explains, “appetites are often the metaphors girls and women use to speak about atrocities” (Thompson, 1994, p.12).*  \n>  \n> *The way that food entered and exited women’s bodies became the primary way through which they felt they could exert control over the way their bodies felt, especially after experiencing trauma and loss of control. Food became the ultimate coping mechanism. As Stephanie Covington Armstrong describes, “I needed my bulimia in order to survive, and no one and nothing could convince me to give up what had become my sole coping skill” (Covington Armstrong, 2009, pg. 178).* \n\n&#x200B;\n\nI personally really appreciate how much research is being done these days on the connections between Eating Disorders and traumas such as abuse, sexual assault, racism, etc, because as it (unsurprisingly!) turns out, the connection is extremely strong, and those who develop Eating Disorders as coping mechanisms to their trauma are much less of an outlier than most people think. \n\nIn some ways I think the reason this isn't talked about as often as it should (especially in mainstream circles that are perhaps somewhat ignorant about EDs) is that people really don't want to acknowledge the societal impact on ED sufferers, it's easier in a lot of ways to assume that it's just a few isolated incidents of people \"taking their diets a little too far\" than to view it as extremely traumatised victims who were put in disempowering positions with little external support that they had to turn to an eating disorder for a sense of autonomy, but I'm glad that this conversation shift is happening.  \n\nIf anyone's interested in the full thesis, [here you go!](https://repository.wellesley.edu/cgi/viewcontent.cgi?article=1682&context=thesiscollection)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bqp22l/eating_disorders_as_coping_mechanisms_to_trauma/",
  "score": 99,
  "num_comments": 18,
  "comments": [
    {
      "id": "eo7yekh",
      "author": "None",
      "body": "It's a great read but I feel like the trauma angle is pretty common actually within ED treatment circles? I had a lot of treatment when I was younger - so this was like late 90s, early aughts - and was constantly having therapeutic modalities for trauma pushed onto me although I didn't find them particularly helpful or applicable to my crazy thought processes. Simone De Beauvoir wrote a bit on the intersectionality of feminism and anorexia in a roundabout sort of way if that particularly interests you. I actually used to have several books of essays on eating disorders and feminism published in the 70s and 80s. I will see if I can cull more author names when I get home.",
      "created_utc": 1558351845.0,
      "score": 12,
      "context": []
    },
    {
      "id": "eo6nhp7",
      "author": "PM_ME_USEFUL_ADVICE",
      "body": "Love this. Interesting read. thanks for posting it!",
      "created_utc": 1558323115.0,
      "score": 10,
      "context": []
    },
    {
      "id": "eo7un5v",
      "author": "shezP90",
      "body": "My ED is def a way to cope with depression and trauma and taking control over my life.",
      "created_utc": 1558348406.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eo71n5u",
      "author": "standsure",
      "body": "Saved. Thanks for posting.",
      "created_utc": 1558330075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eo73yum",
      "author": "None",
      "body": "Thank you so much for sharing! Can’t wait to read this.",
      "created_utc": 1558331359.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eo80s9r",
      "author": "somegenerichandle",
      "body": "Thanks for bringing this to our attention. I remember liking Susan Bordo’s Anorexia essay, explaining how since plato and descartes we've had this mind over body mentality.",
      "created_utc": 1558354069.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eo8jdjv",
      "author": "batshit-quark",
      "body": "Using my throwaway account for the first time for this one. There’s also a section about this in the book *Lost Connections* by Johann Hari. My own restrictive ED appears to have been the result of trauma. I restrict what i put in m mouth.",
      "created_utc": 1558367892.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eo78rpu",
      "author": "chellemic",
      "body": "Thank you so much. I feel affirmed by this.",
      "created_utc": 1558334065.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo8nu0t",
      "author": "konmarimylife",
      "body": "Thank you for posting! I know I must sound like a broken record, but for more reading on this, I really do recommend *A Hunger So Wide and So Deep* By Becky Thompson. [I posted some excerpts from the book in another post.](https://old.reddit.com/r/EDAnonymous/comments/beceio/the_sociopolitical_context_of_eds_quotes_from_a/?st=jv5j788g&sh=4242ccd2)",
      "created_utc": 1558370923.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo99mzi",
      "author": "MoosieGoose",
      "body": "This is fantastic. Through a lot of self-work, I have discovered that my ED has 2 main roots; one being the loss of self due to early childhood trauma and the second being gender dysphoria. \n\nI think that it's pretty common for people to understand that many \"disorders\" of this nature are complex coping mechanisms, but sometimes, there can be many layers. One disorder may manifest simply as a coping mechanism for another, persisting disorder. \n\nIn my experience, ED has been an \"outer\" symptom of deeper issues that I may never have uncovered had I not developed the ED. Psychology is so fascinating!",
      "created_utc": 1558385827.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo9gprj",
      "author": "gertrude420",
      "body": "Thank you very much ! I went through ED in my teens, and worked my way out in 7 years. I also had theory that it must be connected with trauma or severe abuse. Thank you for the reading. For my BA thesis I conducted research on Transgenerational trauma and its impact on affective dysfunctionality among persons who are affected. For my MA thesis I would like to inquire link between transgenerational trauma and development of Eating disorders. Another thing I noticed, a pattern, among people striken by EDs ,is that many of them were raised in strong religious environment. \n\nI understand what you are saying about how EDs are misinterpreted among wide public as 'diet gone too far' or 'byproduct of superficial personality traits and inclinations' ; and how much that stigma prevents people with EDs to open up about their disorders due to fear of judgement from uneducated individuals and masses.",
      "created_utc": 1558390998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo9vu56",
      "author": "Sabrinaology",
      "body": "****TRIGGER WARNING!!!!! (sexual abuse and not so nice words)****\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\nWell, it makes sense (unfortunately). I know of a few women (myself included) who were severely overweight as children and into young adulthood. The reason for overeating? We were sexually abused and thought that if we were \"fat\" then we would no longer be attractive enough for anyone to abuse anymore. Because society teaches us that \"fat isn't pretty\" it was such an easy connection for a child to make. If I get \"fat\" then I'll be \"ugly\" and he won't touch me anymore. Sad reality.",
      "created_utc": 1558401390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo8rfi9",
      "author": "None",
      "body": "I love when studies don’t acknowledge that men get eating disorders, too. So validating. /s",
      "created_utc": 1558373183.0,
      "score": -4,
      "context": []
    },
    {
      "id": "eo8ljlt",
      "author": "CozyJumpers",
      "body": "In a way I feel like it's definitely gone in a weird circle around this. The trauma angle is (and historically has been) very common in ED treatment, but imo it's been moreso a \"Oh, you're starving yourself? Something must be \\*wrong\\* with you\" way, rather than a respectful understanding of how trauma affects people's relationships to their bodies.\n\nThen, at some point in the last 10 years or so, a lot of people started really pushing on the \"The trauma thing is just a stereotype, you can have an ED and not be traumatised!\" narrative, which, while definitely true that you can have an ED without trauma, that narrative of that being the norm is not really beneficial to the many people who do have trauma and EDs, but nevertheless that narrative really started pushing discussions of trauma and EDs away, and so it kind of became something a lot of people were perhaps unwilling to touch on. (This is still though moreso societally and less so in treatment spaces, which were still connecting the dots).\n\nI guess the way I view it is that discussions of trauma and ED have been broken from the very start, in how they were treated in more of a dehumanising/stigmatising way rather than a genuine understanding and empathy of how and why people feel that kind of pain and powerlessness that they resort to EDs, and it's only as of recently that I'm noticing that shift.",
      "created_utc": 1558369346.0,
      "score": 2,
      "context": [
        {
          "id": "eo7yekh",
          "author": "None",
          "body": "It's a great read but I feel like the trauma angle is pretty common actually within ED treatment circles? I had a lot of treatment when I was younger - so this was like late 90s, early aughts - and was constantly having therapeutic modalities for trauma pushed onto me although I didn't find them particularly helpful or applicable to my crazy thought processes. Simone De Beauvoir wrote a bit on the intersectionality of feminism and anorexia in a roundabout sort of way if that particularly interests you. I actually used to have several books of essays on eating disorders and feminism published in the 70s and 80s. I will see if I can cull more author names when I get home.",
          "created_utc": 1558351845.0
        }
      ]
    },
    {
      "id": "eo98xn1",
      "author": "CozyJumpers",
      "body": "Those excerpts are brilliant, it's mindblowing how deeply this ED bullshit runs into systemic oppression.",
      "created_utc": 1558385302.0,
      "score": 2,
      "context": [
        {
          "id": "eo8nu0t",
          "author": "konmarimylife",
          "body": "Thank you for posting! I know I must sound like a broken record, but for more reading on this, I really do recommend *A Hunger So Wide and So Deep* By Becky Thompson. [I posted some excerpts from the book in another post.](https://old.reddit.com/r/EDAnonymous/comments/beceio/the_sociopolitical_context_of_eds_quotes_from_a/?st=jv5j788g&sh=4242ccd2)",
          "created_utc": 1558370923.0
        }
      ]
    },
    {
      "id": "eo9yc56",
      "author": "CozyJumpers",
      "body": "This breaks my heart <3 From another survivor, I'm so sorry you went through that.",
      "created_utc": 1558403162.0,
      "score": 2,
      "context": [
        {
          "id": "eo9vu56",
          "author": "Sabrinaology",
          "body": "****TRIGGER WARNING!!!!! (sexual abuse and not so nice words)****\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\nWell, it makes sense (unfortunately). I know of a few women (myself included) who were severely overweight as children and into young adulthood. The reason for overeating? We were sexually abused and thought that if we were \"fat\" then we would no longer be attractive enough for anyone to abuse anymore. Because society teaches us that \"fat isn't pretty\" it was such an easy connection for a child to make. If I get \"fat\" then I'll be \"ugly\" and he won't touch me anymore. Sad reality.",
          "created_utc": 1558401390.0
        }
      ]
    },
    {
      "id": "eo8y5vl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1558377536.0,
      "score": 5,
      "context": [
        {
          "id": "eo8rfi9",
          "author": "None",
          "body": "I love when studies don’t acknowledge that men get eating disorders, too. So validating. /s",
          "created_utc": 1558373183.0
        }
      ]
    },
    {
      "id": "eo9h6yh",
      "author": "gertrude420",
      "body": "it doesn't have a single blow experience, trauma refers to prolonged exposure to abusive environment or conditions which are emotionally overwhelming for individual. It can be a form of emotional or verbal abuse that triggers the onset of EDs. In the end it is closely related to 'abnormal standards' and perfectionism. I always considered that my ED was a way to compensate for the Perfection in the area which I could handle and control.",
      "created_utc": 1558391327.0,
      "score": 1,
      "context": [
        {
          "id": "eo7yekh",
          "author": "None",
          "body": "It's a great read but I feel like the trauma angle is pretty common actually within ED treatment circles? I had a lot of treatment when I was younger - so this was like late 90s, early aughts - and was constantly having therapeutic modalities for trauma pushed onto me although I didn't find them particularly helpful or applicable to my crazy thought processes. Simone De Beauvoir wrote a bit on the intersectionality of feminism and anorexia in a roundabout sort of way if that particularly interests you. I actually used to have several books of essays on eating disorders and feminism published in the 70s and 80s. I will see if I can cull more author names when I get home.",
          "created_utc": 1558351845.0
        },
        {
          "id": "eo8ljlt",
          "author": "CozyJumpers",
          "body": "In a way I feel like it's definitely gone in a weird circle around this. The trauma angle is (and historically has been) very common in ED treatment, but imo it's been moreso a \"Oh, you're starving yourself? Something must be \\*wrong\\* with you\" way, rather than a respectful understanding of how trauma affects people's relationships to their bodies.\n\nThen, at some point in the last 10 years or so, a lot of people started really pushing on the \"The trauma thing is just a stereotype, you can have an ED and not be traumatised!\" narrative, which, while definitely true that you can have an ED without trauma, that narrative of that being the norm is not really beneficial to the many people who do have trauma and EDs, but nevertheless that narrative really started pushing discussions of trauma and EDs away, and so it kind of became something a lot of people were perhaps unwilling to touch on. (This is still though moreso societally and less so in treatment spaces, which were still connecting the dots).\n\nI guess the way I view it is that discussions of trauma and ED have been broken from the very start, in how they were treated in more of a dehumanising/stigmatising way rather than a genuine understanding and empathy of how and why people feel that kind of pain and powerlessness that they resort to EDs, and it's only as of recently that I'm noticing that shift.",
          "created_utc": 1558369346.0
        }
      ]
    },
    {
      "id": "eo92yk1",
      "author": "None",
      "body": "I didn’t read the whole thing, so that’s on me. Should’ve made sure my bitching was valid first. \n\nIt stuck out to me because I’m trans and oversensitive about the “eating disorders are for girls” myth, and it rubs me kinda like being misgendered. I’m not saying I was right, but does that make any sense?",
      "created_utc": 1558380856.0,
      "score": 1,
      "context": [
        {
          "id": "eo8rfi9",
          "author": "None",
          "body": "I love when studies don’t acknowledge that men get eating disorders, too. So validating. /s",
          "created_utc": 1558373183.0
        },
        {
          "id": "eo8y5vl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1558377536.0
        }
      ]
    }
  ]
}