{
  "id": "brcx91",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1558458125.0,
  "title": "Three. Thousand. Calories.",
  "selftext": "Recovering anorexic here and DOING GREAT. Finally not underweight; finally eating; finally introducing carbs and 'bad' foods. Last week I went back to the university ED counsellor (again) and we had our first productive meeting ever(!), probably because she knows I'm a 'no-fluffy-animal-bullshit' person who needs goals and who needs the cold, harsh truth. She set me two goals: 1. Increase calories (by introducing more carbs) 2. Stop planning foods and using calorie counting apps. \n\n&#x200B;\n\nToday I decided to run 16km; running is a great motivation for my recovery because 1 year ago I was too weak to run and now I'm running long distance again because my body is fuelled. 16km is the longest I've ever run (I'd only really done 10km about five times previously but another 6km on top of that didn't feel like much of an effort). \n\n&#x200B;\n\nDespite trying not to, I ended up counting how much I'll have eaten by the end of the day and it was 3200 calories. I don't think I've ever eaten that much knowingly. I thought it would panic me and stress me out and of course it has, just as much as not knowing would have done, however in a similar vein I'm feeling relatively okay with it - I need it to recover from the run and to keep slowly adding on weight. \n\n&#x200B;\n\nMy eating disorder has other ideas. Eating 3200 calories will make me fat (though I've just shown to myself I am actually extremely fit?); eating 3200 calories is a failure; no woman ever should eat 3200 calories. This mindset is difficult to challenge and I'm struggling - I'm a healthy weight, do I need to gain more? (The answer is yes). I know that I'm not going to gain stupid amounts of weight from eating 3000+ calories but y'know it's really hard. \n\n&#x200B;\n\nJust going to go and listen to ABBA before having a pizza",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/brcx91/three_thousand_calories/",
  "score": 104,
  "num_comments": 10,
  "comments": [
    {
      "id": "eocjdvo",
      "author": "carolinapenguin",
      "body": "I had the same thoughts. To me, eating more than 1000 calories a day seemed like a failure, so one day, when I decided (stupidly) to track my calories and I found out I had eaten around 2500 calories, my brain started ringing the alarms. Eventually it got better, and now I understand that a normal person eats in order to stay healthy (and in your case, in order to have the energy to run!). Probs to you for not letting your thoughts get the best of you!",
      "created_utc": 1558459139.0,
      "score": 36,
      "context": []
    },
    {
      "id": "eod7liw",
      "author": "luciehanes",
      "body": "So I’m in a very similar position to you: athlete (climber and runner) and recovering anorexic. I love that I can run and climb again now that I have the energy, fuel, muscle, and body strength to sustain it! However, this means that I (a 5’2” female) have to eat at least 2500-3000 calories a day just to maintain my weight. Sometimes it terrifies me because that high a number seems astronomical for a small girl and I feel like such an anomaly. I complain about it often to my dietitian, but at the same time I’m always hungry for that much and am not gaining like crazy on it! It’s hard to accept reality when it doesn’t line up with our disordered expectations but I promise I’m right there with you. We ultimately have to trust experience and truth rather than what we think “should” be right.",
      "created_utc": 1558469645.0,
      "score": 21,
      "context": []
    },
    {
      "id": "eodf1w4",
      "author": "MoosieGoose",
      "body": "I feel this! For years, I restricted severely (like -500/day calories for more than a year). After that it wasn't much better, and justified it with raw food and claiming that I was getting the right nutrients regardless of the amount.\n\nIt sounds trivial, but when I stopped counting calories (and other numbers), things got a lot easier. It was hard at first not to see food as a number (instead of a small apple, I see \"\\_\\_\\_\\_ cals, \\_\\_\\_\\_ fiber, etc\"). It took a lot of conscious effort, but before I knew it, I was willing to try new foods. If they were truly new, or a combination that I didn't know by heart, I just looked at it as \"healing medicine\". Even if eating \\_\\_\\_\\_\\_ made me cry, I did it, because it would help me heal. I started cooking for the first time in my life, because I wasn't afraid of oils and fats (did you know that those things are ESSENTIAL to your health?!?!) and I could actually cook something without it just being a complete failure. I had resorted to replacing every ingredient with just water....just food and water....soooooooo booorrrrrinnnngg. OMG I didn't even know what I was missing.\n\nAnd then, I ate my first piece of bread in over 2 years....and I felt fine! I ate every forbidden food I wanted...and I was fine. I was still safe.\n\nThat was 5 years ago that I started incorporating more foods, seeing them as the food that they are (not any numbers), and going from there. I am now trying to become aware of the numbers again, but in a healthy way. We'll see how it goes! I wish you well and I hope that something in this rambling response is helpful to you.",
      "created_utc": 1558472805.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eod6ut4",
      "author": "blink182mg",
      "body": "You should be so proud of yourself!!",
      "created_utc": 1558469324.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eoe1g8i",
      "author": "pabstpumpkinbeer",
      "body": "It *is* really hard. But girl, 3200 calories in a day where you ran 16 km is 100% okay, and 100% necessary. I don't think I need to tell you that running 16 km burns a lot of calories on top of what your body needs just to be alive. You're okay. You're gonna be absolutely fine. This is just teaching your body that it can trust you, that when you exert yourself you're going to fuel your body and not let it starve. And if you love running and would like to keep doing long distance, you absolutely need to be fueling yourself like this. You're doing great.",
      "created_utc": 1558485972.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eoea594",
      "author": "sintos-compa",
      "body": "I’m a cyclist, and I have to force myself to eat. I’ve bonked so many times it’s just dumb now. I even c/s my energy bars sometimes and lie they make my stomach upset, i even believe it myself.",
      "created_utc": 1558491594.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eoy8bjm",
      "author": "Texco_17",
      "body": "I was so happy to read this post! As someone who is struggling to be firm with my ED and bottom-lines, it made me feel good to see that there is light at the end of the tunnels even just a year out! Good luck, you sound like a bad-ass runner, and I hope you enjoy the pizza and ABBA!!",
      "created_utc": 1558936117.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eodqapa",
      "author": "None",
      "body": "I am so happy to see this post. \n\nI am also a short woman (5ft) and whilst quite a ways in to my recovery, still find I have to eat 'more than a short woman should' now that I've started running again. I've vaguely counted that as over 2000 calories per day on a usual week of relatively *light* running (I'm talking about 3x a week, usually 5k or less, 10k rarely if I feel it). If I *don't* eat that much whilst also trying to do my usual running, I am feeling really fatigued and struggling to function... even though I'm really not running that much *really*, and not doing any other activity at all! \n\nI'm not weighing myself currently so I am not sure if I am maintaining my weight on that amount, but I do know that A) I am this hungry if I run, and B) I need to eat to that hunger if I am running, unless I want to feel incredibly weak.\n\nI have been struggling with a 'wobble' recently, and denying a lot of hunger, and not eating those 2000 calories. Everything around me just tells me it's so wrong to eat this much as a very short woman, and that my relatively low activity doesn't 'justify' it, I am already just inside an 'overweight BMI', so I have gotten myself into a bit of a mess and leaning a bit restrictive again the past couple of weeks. As a result, I am struggling with my energy levels and certainly my running has tanked (in both my ability AND my enjoyment)... but seeing your post, hey, maybe this is normal. Maybe I should give eating as much as I know I need to keep me functioning and *happy* a go again, even though it's legit fucking terrifying heh.\n\nGosh I want a pizza D:",
      "created_utc": 1558478554.0,
      "score": 7,
      "context": [
        {
          "id": "eod7liw",
          "author": "luciehanes",
          "body": "So I’m in a very similar position to you: athlete (climber and runner) and recovering anorexic. I love that I can run and climb again now that I have the energy, fuel, muscle, and body strength to sustain it! However, this means that I (a 5’2” female) have to eat at least 2500-3000 calories a day just to maintain my weight. Sometimes it terrifies me because that high a number seems astronomical for a small girl and I feel like such an anomaly. I complain about it often to my dietitian, but at the same time I’m always hungry for that much and am not gaining like crazy on it! It’s hard to accept reality when it doesn’t line up with our disordered expectations but I promise I’m right there with you. We ultimately have to trust experience and truth rather than what we think “should” be right.",
          "created_utc": 1558469645.0
        }
      ]
    },
    {
      "id": "eoe7zpo",
      "author": "natts13",
      "body": "Thank you both for your posts. I am a runner and a climber as well, and toying with recovery for the first time after having an ED for 10 years. I know I am supposed to be increasing my intake if I want to keep running and climbing and actually see progress....it's just terrifying. Seeing your responses actually calmed me down and reminded me to trust the process, so thank you.",
      "created_utc": 1558490186.0,
      "score": 3,
      "context": [
        {
          "id": "eod7liw",
          "author": "luciehanes",
          "body": "So I’m in a very similar position to you: athlete (climber and runner) and recovering anorexic. I love that I can run and climb again now that I have the energy, fuel, muscle, and body strength to sustain it! However, this means that I (a 5’2” female) have to eat at least 2500-3000 calories a day just to maintain my weight. Sometimes it terrifies me because that high a number seems astronomical for a small girl and I feel like such an anomaly. I complain about it often to my dietitian, but at the same time I’m always hungry for that much and am not gaining like crazy on it! It’s hard to accept reality when it doesn’t line up with our disordered expectations but I promise I’m right there with you. We ultimately have to trust experience and truth rather than what we think “should” be right.",
          "created_utc": 1558469645.0
        }
      ]
    },
    {
      "id": "eoy8bo0",
      "author": "auto-xkcd37",
      "body": "> bad ass-runner\n\n***\n\n^(Bleep-bloop, I'm a bot. This comment was inspired by )^[xkcd#37](https://xkcd.com/37)",
      "created_utc": 1558936119.0,
      "score": 1,
      "context": [
        {
          "id": "eoy8bjm",
          "author": "Texco_17",
          "body": "I was so happy to read this post! As someone who is struggling to be firm with my ED and bottom-lines, it made me feel good to see that there is light at the end of the tunnels even just a year out! Good luck, you sound like a bad-ass runner, and I hope you enjoy the pizza and ABBA!!",
          "created_utc": 1558936117.0
        }
      ]
    }
  ]
}