{
  "id": "bu3z9c",
  "subreddit": "fuckeatingdisorders",
  "author": "freddybobeddy",
  "created_utc": 1559070036.0,
  "title": "my entire identity up until this point has been based on how i think others perceive me",
  "selftext": "growing up in an abusive environment conditioned me to think this way. i think it’s been one of the main catalysts for my eating disorder. \n\ni hurt and deprived myself just so that i could look like the girl who had her shit together. i was a people pleaser. i kept my apartment spotless, worked hard in school, and developed hobbies based on what i thought others would approve of. i had the ‘perfect’ routine, diet and exercise all carefully calculated. \ni hid what i thought were flaws well and acted like i was living this perfect example of life. nothing could go wrong as long as i held up this image. \n\nnow that i’m in recovery though, i’ve realized that no one actually cares. no one bats an eye at what my life looks like from the outside unless theyre going through some sort of identity crisis themselves. i know this because now that the i’m in a better place mentally, i don’t care about other people’s image either. not in a dismissive, mean way, but in a “what’s on the surface is only the tip of the iceberg” kind of way. \n\ni realize that living this superficial life really prevented me from realizing that wow, i’m a human being and i’m 1 in 7 billion. let’s go deeper into this whole life thing while i’m here and find peace in the fact that i’m just another living thing. i don’t have anything to prove. ive gained a lot of weight recently? who cares. i didn’t put in 110% effort into that class and my apartments been a mess all week? whatever. some idiot might give me a hard time about those things but maybe it’s them that needs to take a time out and get their ducks in a row. \n\nso yea, sorry if that didn’t make any sense. just venting.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bu3z9c/my_entire_identity_up_until_this_point_has_been/",
  "score": 83,
  "num_comments": 4,
  "comments": [
    {
      "id": "ep7aunl",
      "author": "drippingrubies",
      "body": "I feel this so hard. I grew up in an emotionally/verbally abusive environment, when nothing I did was ever good enough. I became such a perfectionist. I moved to the other end of the country, and my anxiety started making me so sick. I eventually dropped out of university and felt like I didn't have anything to base my worth on, and that's when I started starving myself.",
      "created_utc": 1559079474.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ep7j3zg",
      "author": "CozyJumpers",
      "body": "This is perfect, I love this. There is so much power in living your life solely for yourself and not giving a single care as to what others might think about that. I think there's such a big importance in getting rid of that \"invisible audience\" that you feel constantly judging you in your mind. Because truly, even if people \\*did\\* care (which 99.9% of the time they absolutely don't), why should their fleeting opinion dictate how you should live your life?",
      "created_utc": 1559082477.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ep84crl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1559090146.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ep8p06v",
      "author": "Winterobin",
      "body": "Wow I really needed to hear this",
      "created_utc": 1559097894.0,
      "score": 3,
      "context": []
    },
    {
      "id": "epcmceb",
      "author": "ThatOnePotential",
      "body": "Thank you for voicing this feeling. While it is hard when people do pay attention or criticize you in the short term, they usually are just nosy and giving attention in that moment. After the interactions are over, they forget about you.\n\n It is very helpful to remember that while you are special in a way (usually to the people who care about you), you are not *that* special. Meaning you are human like everyone else, and like everyone else you will struggle with something. It sucks that our particular struggles involve EDs, but no human gets by without facing some adversity. In a way, it is comforting.",
      "created_utc": 1559155861.0,
      "score": 1,
      "context": []
    }
  ]
}