{
  "id": "bxnv8u",
  "subreddit": "fuckeatingdisorders",
  "author": "jcsxx",
  "created_utc": 1559865519.0,
  "title": "Is anyone else very uncomfortable with the intermittent fasting posts that keep making it to the front page of reddit?",
  "selftext": "It’s very difficult for me to separate the idea of intermittent fasting from my own personal experience with an eating disorder. I’m doing my best, but I can’t help but feel triggered every time I see these kinds of posts. Now I’ve seen one that said “here’s my progress with intermittent fasting- starting one meal a day soon and attempting a 36 hour fast”. It’s shocking and alarming to me the amount of support these kinds of posts are met with... Is it really possible for people to lose weight in this way and not develop an eating disorder!? It seems to go completely unaddressed in that sub and really fucked up behaviors are normalized and encouraged. Am I projecting?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/bxnv8u/is_anyone_else_very_uncomfortable_with_the/",
  "score": 172,
  "num_comments": 33,
  "comments": [
    {
      "id": "eq8p2bt",
      "author": "None",
      "body": "Ehh, kinda relevant story. My husband was doing basically 16 hour intermittent fasts during Ramadan. He gained weight because he would shovel food before sunrise and after sunset which I guess is common. I was at an iftar and one of the ladies asked if I had considered trying to fast - you cant even drink water - \"to see what it's like.\" I was like \"actually I am a recovering anorexic so I know what it's like to go for long periods of time without food.\" \n\nMy N=3 coworkers who tried IF is that they all lost some weight but couldn't make it more than a few weeks because they hated being hungry all the time / not being able to socially eat etc. I know my experiences and thought processes would be different. Kinda like watching someone have a glass of wine with dinner and knowing that I can't do that because I am an alcoholic.",
      "created_utc": 1559871304.0,
      "score": 65,
      "context": []
    },
    {
      "id": "eq9lcje",
      "author": "rachelnessxo",
      "body": "This makes me cry reading this. I’m a recovered anorexic, now overweight, desperately clinging to IF and a certain calorie goal diet, and these subs have like tricked me. \n\nFor example on the IF sub recently, there was a progress pic of someone who “just stopped eating breakfast”. I used to NEVER eat breakfast until I went to treatment because they said it was important. So it’s like I did treatment for years and now I get out and read that everything they told me isn’t true?\n\nIt’s so confusing because I already feel betrayed by treatment because I got so freaking fat. And I can feel myself going down the rabbit hole as I was under my calories yesterday, but was terrified to have a small slice of pizza that my mom made. \n\nUgh help me Jesus.",
      "created_utc": 1559910881.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eq8pmuf",
      "author": "im-no-mountain",
      "body": "I've noticed these posts and also been uncomfortable, 1. with the fasting schedule/low calories 2. with the rapid weight loss and 'dramatic diet behavior'. I can't help but wonder ifmy anorexia treatment has strictly presented //normal eating behavior// and so we are suspicious of anything deviating from it, or if these posts really are as problematic as they seem.\n\nI also kind of look at it like this- sure, biologically it is entirely possible for a human to sustain a fast over a long period of time and that might even be healthy. Culturally, though, it's really antisocial and requires a lot of mental energy and focus on weight/diet to break social norms (ie eating and socializing together)",
      "created_utc": 1559871781.0,
      "score": 30,
      "context": []
    },
    {
      "id": "eq9076i",
      "author": "bohemian-chameleon",
      "body": "Today my therapist told me that for me, restriction will always be my eating disorder. I get so jealous that other people can “restrict” because I want to so badly but I know that means I’m letting my ed take over again",
      "created_utc": 1559881019.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eq8nf2w",
      "author": "Tambear",
      "body": "I’ve noticed more and more people around me talking about fasting, too, on top of it being on the front page. It’s definitely not great, and I keep thinking about doing it again.",
      "created_utc": 1559869928.0,
      "score": 22,
      "context": []
    },
    {
      "id": "eq8yd63",
      "author": "pabstpumpkinbeer",
      "body": "Yup. IF is really triggering for me as well. There is NOTHING special or magical about IF for fat loss. It is just another way of restricting calories. Diet culture parading around in yet another fancy suit.",
      "created_utc": 1559879208.0,
      "score": 15,
      "context": []
    },
    {
      "id": "eq9m8pb",
      "author": "None",
      "body": "I went out to eat with my partner the other day and was trying to eat foods that were hard for me, and the guy at the table next to us would not shut up telling his (politely bored) parents ALL ABOUT his new IF diet. I actually got the balls to ask the waiter to move us to another section, since the place was pretty empty. I don't know if it's unhealthy for them a lot, but hearing about other people's diets while I'm eating fucks me up.",
      "created_utc": 1559911713.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eqaqd86",
      "author": "None",
      "body": "No one here can really tell you if you're projecting or not, none of us are your therapist or know you well enough to make that call, but regardless, I think it's fair to say that your concern for the extreme dieting fad is legitimate. There is a lot of research surfacing (and more to come in 2020) that shows fasting-focused diets are harmful in a myriad of physiological and psychological ways. IF is still new and was taken up mostly after positive results following short term animal testing were released to the public. Maybe you have a personal, complicated relationship with dieting and disordered eating (as we all probably do in this sub,) that might make this a more emotionally charged topic for you, but that shouldn't mean you can't see some objective risks or harm that this kind of diet culture produces.\n\n&#x200B;\n\nThere is also a lot of research that shows calorie-restricting to lose weight is unsustainable. Some people can keep the weight off for  1-2 years if they continue to undereat for their age/gender/height, i.e. their 'maintenance' diet, but at about 2-5 years following initial weight loss, which weight loss studies DO NOT tend to follow up or track, most people regain the weight they lost, plus more. There is research that shows calorie restriction and resulting weight loss impacts metabolism and hormone production in a long term way. It messes with ghrelin and leptin levels potentially indefinitely, both of which impact preoccupation with food, increased hunger, fat storage, and disconnection with satiety cues. \n\n&#x200B;\n\nFURTHERMORE, the idea that there is an obesity epidemic is wildly over-stated and intentionally misleading, as is the research that suggests being overweight and obese always poses a significant mortality risk. There is a stronger link between being underweight, or in the lower end of the normal weight BMI spectrum, and mortality + other health risks than being in the overweight category. Cardiovascular health is actually a stronger predictor of health than body weight. When controlling for things like economic status, activity level, WEIGHT CYCLING (losing and gaining and losing and gaining...), drug use, family history and presence/absence of internalized weight stigma, the correlation between mortality risk and body weight either disappears or drops below statistical significance. \n\n&#x200B;\n\nThis research is not hard to find, especially if you have access to journal article databases through an academic institution. Here is one study that compiles a lot of the evidence I've referenced: https://academic.oup.com/ije/article/35/1/55/849914, called *The epidemiology of overweight and obesity: public health crisis or moral panic?* by Campos et al. Feel free to hit me up for more sources! I've been researching this stuff for years.",
      "created_utc": 1559937908.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eq8s3nn",
      "author": "None",
      "body": "It can definitely go too far and become an eating disorder; they're already restricting. When family members mention potentially doing this it freaks me the fuck out.",
      "created_utc": 1559873856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eqa1lyl",
      "author": "None",
      "body": "Same with 1200 is plenty.. People eat like 1.000 calories a day and are like hell yeah I lost 50 pounds in 3 months! I am 5'8\" and active. You need around 1600-1700 calories a day at that point. And I highly doubt everyone on the sub is 5' and sitting on the couch all day.",
      "created_utc": 1559923002.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eq8rh0k",
      "author": "doublefudgebrownies",
      "body": "It's because they are trying to work through their own issues with food. Most people are fat,  and rely on the dopamine rush that comes with food to cope with life the same way anorexics use control of base needs like nourishment to deal with stress.  They are metabolically and emotionally damaged,  and trying to find balance.  \nSome people take it too far,  and some don't take it far enough.  I know people who literally cannot go 2 hours without shoveling food in their face, and i know people who if they gave into the urge to not eat would end up in a dark place.  \n\nFood, eating,  survival,  hormones, biology.  It's a lot,  and sometimes people go to extremes trying to save themselves.",
      "created_utc": 1559873325.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eqauwww",
      "author": "WaterRacoon",
      "body": "I think that OMAD fasts and long-time fasts are thoroughly unhealthy and reflect a problematic relationship with food. On the other hand, I'm guilty of participating in 16/8 fasts so maybe I'm not the one to talk. IF has been easy for me but I'm not sure it promotes a healthy relationship with eating. Doing IF does make me focus a lot on food, which hours I'm allowed to eat and on what food I eat including calorie counting for that food. I don't do IF now, but when I did I would look forward to 11.30 am because that was when I could have my first meal of the day, up until then I was just attempting to avoid eating. It sometimes seems to me like just another version of  restriction hidden beyond the pretense of being healthy for you when the key point deep down still is to restrict.",
      "created_utc": 1559940368.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eq9oah7",
      "author": "LaVieGlamour",
      "body": "I neeeeeded this post. Im in \"recovery\" (aka trying daily to eat and not feel guilty) and Ive gained weight. On top of that, Im still only able to afford a poverty diet full of junk food. I tried IF purely for health reasons (reset my body of all the junk and try focusing on healthy foods when I do eat)  and realized it made my brain go back to my ED way of thinking. The hunger pangs are too triggering and I felt guilty when I did eat. So, IF is NOT for me.",
      "created_utc": 1559913500.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eq9m6ea",
      "author": "Ultimatedream",
      "body": "I don't think people here want to hear this, but yes, you are projecting.\n\nIt's all about the mindset. Normal people who are doing IF and fasting have a normal mindset. They need to lose some (a lot most of the time) weight and do just that. That's all there is, for most of them. Its just a way of restricting calories like diets. \n\nAnd than you have people like us, with ED's. We do it with a different mindset. We do it for controle, self deprivation and tons of other reasons, mostly not even really because we need to lose weight.",
      "created_utc": 1559911654.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eq8mpun",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1559869344.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3dcgw3",
      "author": "PinkLemonadezz",
      "body": "I know!! I'm so confused. To me, intermittent fasting feels it would develop into binge eating since I would use those few hours that I have to shove in all the food that I could. Is intermittent fasting supposed to be healthy?? Because it's advertised to be healthy but everytime I go to see a dietician they say skipping meals is unhealthy so what's up with IF being healthy??",
      "created_utc": 1570834704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eq9prde",
      "author": "TheDarchinator",
      "body": "I'm not uncomfortable. It actually got me started on it 3 weeks ago now and I've been making progress. I haven't binge eaten in 3 weeks which is saying a lot for me. I haven't overeaten either yet. To each their own experience though.",
      "created_utc": 1559914689.0,
      "score": 0,
      "context": []
    },
    {
      "id": "eq8w2ei",
      "author": "None",
      "body": "i resonate with this because my alcohol abuse co occurred with my eating disorder, so now a recovering alcoholic, i know how it feels sitting there knowing i can’t have something/ same with restricting my food",
      "created_utc": 1559877102.0,
      "score": 11,
      "context": [
        {
          "id": "eq8p2bt",
          "author": "None",
          "body": "Ehh, kinda relevant story. My husband was doing basically 16 hour intermittent fasts during Ramadan. He gained weight because he would shovel food before sunrise and after sunset which I guess is common. I was at an iftar and one of the ladies asked if I had considered trying to fast - you cant even drink water - \"to see what it's like.\" I was like \"actually I am a recovering anorexic so I know what it's like to go for long periods of time without food.\" \n\nMy N=3 coworkers who tried IF is that they all lost some weight but couldn't make it more than a few weeks because they hated being hungry all the time / not being able to socially eat etc. I know my experiences and thought processes would be different. Kinda like watching someone have a glass of wine with dinner and knowing that I can't do that because I am an alcoholic.",
          "created_utc": 1559871304.0
        }
      ]
    },
    {
      "id": "f3ddc10",
      "author": "PinkLemonadezz",
      "body": "I know this comment was a while ago but I feel you girl like I see all those posts about one meal a day or wtv and I feel shit cause I used to do that and when I don't, I'm considered to be recovering. But now the idea of one meal a day/fasting is popularised so is it suddenly healthy?? I iterally feel you sm rn",
      "created_utc": 1570835052.0,
      "score": 3,
      "context": [
        {
          "id": "eq9lcje",
          "author": "rachelnessxo",
          "body": "This makes me cry reading this. I’m a recovered anorexic, now overweight, desperately clinging to IF and a certain calorie goal diet, and these subs have like tricked me. \n\nFor example on the IF sub recently, there was a progress pic of someone who “just stopped eating breakfast”. I used to NEVER eat breakfast until I went to treatment because they said it was important. So it’s like I did treatment for years and now I get out and read that everything they told me isn’t true?\n\nIt’s so confusing because I already feel betrayed by treatment because I got so freaking fat. And I can feel myself going down the rabbit hole as I was under my calories yesterday, but was terrified to have a small slice of pizza that my mom made. \n\nUgh help me Jesus.",
          "created_utc": 1559910881.0
        }
      ]
    },
    {
      "id": "eq8y7nl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1559879061.0,
      "score": 8,
      "context": [
        {
          "id": "eq8nf2w",
          "author": "Tambear",
          "body": "I’ve noticed more and more people around me talking about fasting, too, on top of it being on the front page. It’s definitely not great, and I keep thinking about doing it again.",
          "created_utc": 1559869928.0
        }
      ]
    },
    {
      "id": "eq8scfm",
      "author": "jcsxx",
      "body": "Me too...",
      "created_utc": 1559874061.0,
      "score": 3,
      "context": [
        {
          "id": "eq8nf2w",
          "author": "Tambear",
          "body": "I’ve noticed more and more people around me talking about fasting, too, on top of it being on the front page. It’s definitely not great, and I keep thinking about doing it again.",
          "created_utc": 1559869928.0
        }
      ]
    },
    {
      "id": "eq908x2",
      "author": "jollyllamarama",
      "body": "Yep, for most people IF just equals skipping one meal a day = less calories",
      "created_utc": 1559881069.0,
      "score": 6,
      "context": [
        {
          "id": "eq8yd63",
          "author": "pabstpumpkinbeer",
          "body": "Yup. IF is really triggering for me as well. There is NOTHING special or magical about IF for fat loss. It is just another way of restricting calories. Diet culture parading around in yet another fancy suit.",
          "created_utc": 1559879208.0
        }
      ]
    },
    {
      "id": "eqbfl4q",
      "author": "ThatOnePotential",
      "body": "All of this! Thank you for writing this out. It is *really*  difficult to convince the general population about what you discuss here, but I am so glad I am not the only one who sees how much diet culture has blinded people, including doctors and researchers, to the path toward true health.",
      "created_utc": 1559948819.0,
      "score": 3,
      "context": [
        {
          "id": "eqaqd86",
          "author": "None",
          "body": "No one here can really tell you if you're projecting or not, none of us are your therapist or know you well enough to make that call, but regardless, I think it's fair to say that your concern for the extreme dieting fad is legitimate. There is a lot of research surfacing (and more to come in 2020) that shows fasting-focused diets are harmful in a myriad of physiological and psychological ways. IF is still new and was taken up mostly after positive results following short term animal testing were released to the public. Maybe you have a personal, complicated relationship with dieting and disordered eating (as we all probably do in this sub,) that might make this a more emotionally charged topic for you, but that shouldn't mean you can't see some objective risks or harm that this kind of diet culture produces.\n\n&#x200B;\n\nThere is also a lot of research that shows calorie-restricting to lose weight is unsustainable. Some people can keep the weight off for  1-2 years if they continue to undereat for their age/gender/height, i.e. their 'maintenance' diet, but at about 2-5 years following initial weight loss, which weight loss studies DO NOT tend to follow up or track, most people regain the weight they lost, plus more. There is research that shows calorie restriction and resulting weight loss impacts metabolism and hormone production in a long term way. It messes with ghrelin and leptin levels potentially indefinitely, both of which impact preoccupation with food, increased hunger, fat storage, and disconnection with satiety cues. \n\n&#x200B;\n\nFURTHERMORE, the idea that there is an obesity epidemic is wildly over-stated and intentionally misleading, as is the research that suggests being overweight and obese always poses a significant mortality risk. There is a stronger link between being underweight, or in the lower end of the normal weight BMI spectrum, and mortality + other health risks than being in the overweight category. Cardiovascular health is actually a stronger predictor of health than body weight. When controlling for things like economic status, activity level, WEIGHT CYCLING (losing and gaining and losing and gaining...), drug use, family history and presence/absence of internalized weight stigma, the correlation between mortality risk and body weight either disappears or drops below statistical significance. \n\n&#x200B;\n\nThis research is not hard to find, especially if you have access to journal article databases through an academic institution. Here is one study that compiles a lot of the evidence I've referenced: https://academic.oup.com/ije/article/35/1/55/849914, called *The epidemiology of overweight and obesity: public health crisis or moral panic?* by Campos et al. Feel free to hit me up for more sources! I've been researching this stuff for years.",
          "created_utc": 1559937908.0
        }
      ]
    },
    {
      "id": "eqbevx2",
      "author": "ThatOnePotential",
      "body": "Thank you for writing this! I also have tried IF and OMAD when I was in quasi-recovery, and it lead to so much physical and mental anguish that it helped push me into embracing full recovery. Maybe some people can do it and not wander down the path of disordered habits/eating, but I'm not super convinced most people can. \n\nIf you think about evolutionary biology, it goes against nature to actively suppress your body weight. Biology will fight you by making you obsessed with food and when you can eat, etc.",
      "created_utc": 1559948559.0,
      "score": 1,
      "context": [
        {
          "id": "eqauwww",
          "author": "WaterRacoon",
          "body": "I think that OMAD fasts and long-time fasts are thoroughly unhealthy and reflect a problematic relationship with food. On the other hand, I'm guilty of participating in 16/8 fasts so maybe I'm not the one to talk. IF has been easy for me but I'm not sure it promotes a healthy relationship with eating. Doing IF does make me focus a lot on food, which hours I'm allowed to eat and on what food I eat including calorie counting for that food. I don't do IF now, but when I did I would look forward to 11.30 am because that was when I could have my first meal of the day, up until then I was just attempting to avoid eating. It sometimes seems to me like just another version of  restriction hidden beyond the pretense of being healthy for you when the key point deep down still is to restrict.",
          "created_utc": 1559940368.0
        }
      ]
    },
    {
      "id": "eqahbs4",
      "author": "WookieRubbersmith",
      "body": "Poverty food doesn't have to be unhealthy! If you ever want some tips on how to eat SUPER FRUGALLY while also getting tons of fiber, protein and nutrients, shoot me a pm :)   \n\n\nGetting into cooking my own food was a really meaningful part of my recovery--it gave me an outlet for the control compulsion (via making things taste exactly how I want them to, not by making things super low cal--I use a LOT of butter in my cooking, tbh)  while ALSO helping me learn to love food and see it as an ally, not the enemy.   \n\n\nBut cooking at home has also been a LIFE SAVER at times when my budget has been super, super tight (I've lived on $75 a month for food for months at a time before).",
      "created_utc": 1559932929.0,
      "score": 2,
      "context": [
        {
          "id": "eq9oah7",
          "author": "LaVieGlamour",
          "body": "I neeeeeded this post. Im in \"recovery\" (aka trying daily to eat and not feel guilty) and Ive gained weight. On top of that, Im still only able to afford a poverty diet full of junk food. I tried IF purely for health reasons (reset my body of all the junk and try focusing on healthy foods when I do eat)  and realized it made my brain go back to my ED way of thinking. The hunger pangs are too triggering and I felt guilty when I did eat. So, IF is NOT for me.",
          "created_utc": 1559913500.0
        }
      ]
    },
    {
      "id": "eqawc8n",
      "author": "WaterRacoon",
      "body": "Just because people are not anorectic does not mean that they necessarily have a healthy relationship with food. I'm not sure IF and fasting reflect a normal behavior.",
      "created_utc": 1559941085.0,
      "score": 3,
      "context": [
        {
          "id": "eq9m6ea",
          "author": "Ultimatedream",
          "body": "I don't think people here want to hear this, but yes, you are projecting.\n\nIt's all about the mindset. Normal people who are doing IF and fasting have a normal mindset. They need to lose some (a lot most of the time) weight and do just that. That's all there is, for most of them. Its just a way of restricting calories like diets. \n\nAnd than you have people like us, with ED's. We do it with a different mindset. We do it for controle, self deprivation and tons of other reasons, mostly not even really because we need to lose weight.",
          "created_utc": 1559911654.0
        }
      ]
    },
    {
      "id": "eq9q1r0",
      "author": "jcsxx",
      "body": "That’s true, I can definitely get behind that. Someone else used the analogy of watching someone have a glass of wine at dinner but knowing you can’t because you’re an alcoholic.\n\nBut the thing is, it’s often not just “a glass of wine” (changing to healthy alternatives, cutting out soda, etc) it’s full on binge drinking (proud of not eating for days at a time, etc). And it’s encouraged because they don’t look the part?\n\nStill, I know I’m projecting. Maybe they are able to control themselves and stop once they reach a healthy weight, maybe it’s just temporary to help cut off extra weight before really starting to train or something. I wish I had their ability not to spiral...",
      "created_utc": 1559914920.0,
      "score": 2,
      "context": [
        {
          "id": "eq9m6ea",
          "author": "Ultimatedream",
          "body": "I don't think people here want to hear this, but yes, you are projecting.\n\nIt's all about the mindset. Normal people who are doing IF and fasting have a normal mindset. They need to lose some (a lot most of the time) weight and do just that. That's all there is, for most of them. Its just a way of restricting calories like diets. \n\nAnd than you have people like us, with ED's. We do it with a different mindset. We do it for controle, self deprivation and tons of other reasons, mostly not even really because we need to lose weight.",
          "created_utc": 1559911654.0
        }
      ]
    },
    {
      "id": "eq8oc97",
      "author": "I-swear-I-am-a-girl",
      "body": "Nah, not from this sub. There have been a few posts from the fasting sub about weight loss that have made it to the front page of general Reddit.",
      "created_utc": 1559870703.0,
      "score": 6,
      "context": [
        {
          "id": "eq8mpun",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1559869344.0
        }
      ]
    },
    {
      "id": "eq9qa30",
      "author": "jcsxx",
      "body": "I hadn’t even considered this perspective, thank you. Good luck on your recovery journey :)",
      "created_utc": 1559915101.0,
      "score": 2,
      "context": [
        {
          "id": "eq9prde",
          "author": "TheDarchinator",
          "body": "I'm not uncomfortable. It actually got me started on it 3 weeks ago now and I've been making progress. I haven't binge eaten in 3 weeks which is saying a lot for me. I haven't overeaten either yet. To each their own experience though.",
          "created_utc": 1559914689.0
        }
      ]
    },
    {
      "id": "eq9hd4o",
      "author": "None",
      "body": "Yeah-- I think my history of alcoholism and recovery from that makes it easier to delineate one set of rules for \"normies\" and another for myself. Although I definitely know recovering alcoholics who drink-count others like hawks and will insist that anyone who drinks at all probably has a problem...usually folks who aren't super secure in their own recovery or recover relying heavily on the \"alcohol is poison\" mantra found in some self help books.\n\nI do kinda agree with /u/im-no-mountain that I have read individual posts by IFers that seem disordered or a set up for disordered behavior and get uncomfortable. It's a bit like hanging out with that person who always seems to drink a little bit too much when out. I like to remind myself that what I see is just a snapshot of the person and also what they do has no bearing on what is working for me in my recovery.",
      "created_utc": 1559906725.0,
      "score": 7,
      "context": [
        {
          "id": "eq8p2bt",
          "author": "None",
          "body": "Ehh, kinda relevant story. My husband was doing basically 16 hour intermittent fasts during Ramadan. He gained weight because he would shovel food before sunrise and after sunset which I guess is common. I was at an iftar and one of the ladies asked if I had considered trying to fast - you cant even drink water - \"to see what it's like.\" I was like \"actually I am a recovering anorexic so I know what it's like to go for long periods of time without food.\" \n\nMy N=3 coworkers who tried IF is that they all lost some weight but couldn't make it more than a few weeks because they hated being hungry all the time / not being able to socially eat etc. I know my experiences and thought processes would be different. Kinda like watching someone have a glass of wine with dinner and knowing that I can't do that because I am an alcoholic.",
          "created_utc": 1559871304.0
        },
        {
          "id": "eq8w2ei",
          "author": "None",
          "body": "i resonate with this because my alcohol abuse co occurred with my eating disorder, so now a recovering alcoholic, i know how it feels sitting there knowing i can’t have something/ same with restricting my food",
          "created_utc": 1559877102.0
        }
      ]
    },
    {
      "id": "eqbhrkd",
      "author": "ThatOnePotential",
      "body": "As far as I can tell, I haven't heard any conclusive evidence that having calorie counts on menus actually helps people be healthier. Your comment reminded me of [this](https://eatingdisorderrecoverypodcast.podbean.com/?s=calorie+counts) podcast interview I thought was interesting.",
      "created_utc": 1559949600.0,
      "score": 3,
      "context": [
        {
          "id": "eq8nf2w",
          "author": "Tambear",
          "body": "I’ve noticed more and more people around me talking about fasting, too, on top of it being on the front page. It’s definitely not great, and I keep thinking about doing it again.",
          "created_utc": 1559869928.0
        },
        {
          "id": "eq8y7nl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1559879061.0
        }
      ]
    },
    {
      "id": "eq91mpc",
      "author": "pabstpumpkinbeer",
      "body": "It's kind of hilarious to me that this is such a fad now. Like wow what a revolutionary concept",
      "created_utc": 1559882563.0,
      "score": 8,
      "context": [
        {
          "id": "eq8yd63",
          "author": "pabstpumpkinbeer",
          "body": "Yup. IF is really triggering for me as well. There is NOTHING special or magical about IF for fat loss. It is just another way of restricting calories. Diet culture parading around in yet another fancy suit.",
          "created_utc": 1559879208.0
        },
        {
          "id": "eq908x2",
          "author": "jollyllamarama",
          "body": "Yep, for most people IF just equals skipping one meal a day = less calories",
          "created_utc": 1559881069.0
        }
      ]
    },
    {
      "id": "eqayqtv",
      "author": "Ultimatedream",
      "body": "Most people who need to lose weight don't have a healthy relationship with food. Overeating is also not 'normal' behavior. But we live in a period of abundance and its easier to gain access to high calorie, cheap foods. \n\nThat doesn't mean that all people on those subs are normal, some people may take it too far, or have an unhealthy relationship with IF and fasting. They might be spiraling, who knows. But just because it's not 3 meals and a snack, it doesn't mean it's not normal.",
      "created_utc": 1559942288.0,
      "score": 2,
      "context": [
        {
          "id": "eq9m6ea",
          "author": "Ultimatedream",
          "body": "I don't think people here want to hear this, but yes, you are projecting.\n\nIt's all about the mindset. Normal people who are doing IF and fasting have a normal mindset. They need to lose some (a lot most of the time) weight and do just that. That's all there is, for most of them. Its just a way of restricting calories like diets. \n\nAnd than you have people like us, with ED's. We do it with a different mindset. We do it for controle, self deprivation and tons of other reasons, mostly not even really because we need to lose weight.",
          "created_utc": 1559911654.0
        },
        {
          "id": "eqawc8n",
          "author": "WaterRacoon",
          "body": "Just because people are not anorectic does not mean that they necessarily have a healthy relationship with food. I'm not sure IF and fasting reflect a normal behavior.",
          "created_utc": 1559941085.0
        }
      ]
    },
    {
      "id": "eqbgvln",
      "author": "ThatOnePotential",
      "body": "I don't think you are projecting. Linda Bacon's research, and many others in the HAES community, discuss the damage that weight suppressing does to people, not matter their size. When you are fighting your body's natural impulses the rebounds (as you point out) become severe. When people restrict food intake they are setting themselves up  for reactive eating (i.e. binges)--it's why diets do not work in the long term. It makes me mad that societal fatphobia celebrates behaviors it would condemn in people living in smaller bodies.",
      "created_utc": 1559949283.0,
      "score": 3,
      "context": [
        {
          "id": "eq9m6ea",
          "author": "Ultimatedream",
          "body": "I don't think people here want to hear this, but yes, you are projecting.\n\nIt's all about the mindset. Normal people who are doing IF and fasting have a normal mindset. They need to lose some (a lot most of the time) weight and do just that. That's all there is, for most of them. Its just a way of restricting calories like diets. \n\nAnd than you have people like us, with ED's. We do it with a different mindset. We do it for controle, self deprivation and tons of other reasons, mostly not even really because we need to lose weight.",
          "created_utc": 1559911654.0
        },
        {
          "id": "eq9q1r0",
          "author": "jcsxx",
          "body": "That’s true, I can definitely get behind that. Someone else used the analogy of watching someone have a glass of wine at dinner but knowing you can’t because you’re an alcoholic.\n\nBut the thing is, it’s often not just “a glass of wine” (changing to healthy alternatives, cutting out soda, etc) it’s full on binge drinking (proud of not eating for days at a time, etc). And it’s encouraged because they don’t look the part?\n\nStill, I know I’m projecting. Maybe they are able to control themselves and stop once they reach a healthy weight, maybe it’s just temporary to help cut off extra weight before really starting to train or something. I wish I had their ability not to spiral...",
          "created_utc": 1559914920.0
        }
      ]
    },
    {
      "id": "eq9t9i9",
      "author": "TheDarchinator",
      "body": "Thank you! :D",
      "created_utc": 1559917322.0,
      "score": 2,
      "context": [
        {
          "id": "eq9prde",
          "author": "TheDarchinator",
          "body": "I'm not uncomfortable. It actually got me started on it 3 weeks ago now and I've been making progress. I haven't binge eaten in 3 weeks which is saying a lot for me. I haven't overeaten either yet. To each their own experience though.",
          "created_utc": 1559914689.0
        },
        {
          "id": "eq9qa30",
          "author": "jcsxx",
          "body": "I hadn’t even considered this perspective, thank you. Good luck on your recovery journey :)",
          "created_utc": 1559915101.0
        }
      ]
    }
  ]
}