{
  "id": "c3sgb2",
  "subreddit": "fuckeatingdisorders",
  "author": "clarelandis",
  "created_utc": 1561224769.0,
  "title": "Why do we feel like we have to do our eating disorders \"right?\"",
  "selftext": "My friend said she feels like she has to do her eating disorder all the way. That might sound insignificant to someone who hasn’t struggled with an eating disorder, but I got goosebumps when I heard her say it because I felt that way and had just never verbalized it. She went on and explained: it’s like there are two options in your head, you feel like you can either be successful at your disorder or be successful at life. It’s really hard to be successful in life. It’s uncertain, it’s scary, you can’t control all the pieces. It is also hard to be successful in your eating disorder; it is challenging to deprive yourself of food, force yourself to throw up, and hurt yourself in other ways. But, when that success in life isn’t working out, it feels like you have another option. There is another way to feel that same success. And, believe me, that eating disorder can give a great false sense of success. It doesn’t make sense, but that drive for success is so strong, and doing “well” in your eating disorder actually does feel like an accomplishment which is one of the things that makes eating disorders so evil. \n\nThe success from the disorder really resonated with me, and I’m sure it does with a lot of people since eating disorders do have some perfectionistic qualities. It also brought up a similar thought I’d been struggling with: that I needed to do my eating disorder right so I could move on. From October through December of last year, I was tormented by that thought. I was obsessed with doing my disorder right, I literally dreamed about it every night; there was no escaping it. If I could do my eating disorder right, then I could move on with my life. I thought it would be possible to really get rid of it if I could appease the monster just once. So, that’s what I tried to do. I started acting on behaviors like crazy and drove myself deep into the disorder. My disorder that had been mostly chronic in the past suddenly became much more acute. I thought if I could do it “right,” then the disorder would relinquish control of me. And by some external standards, I did do my disorder “right.” I ended up with a tube, being lectured about organ failure, and had to go back to treatment for the millionth time after I got out of the hospital. \n\nBut, it still wasn’t enough for my disorder to be satisfied. Even though I almost died, I hadn’t gone far enough. I was still a failure. The only time you can satisfy the disorder is if you’re dead, and I couldn’t see it at the time. I thought if I just took it a little further I could be done for good. It was to the point where I was turning off my kangaroo pump when no one was looking just so I could avoid a few more calories. I was so angry at myself for not losing enough weight even though I had lost weight so quickly that my body was shutting down. I was angry at myself for eating one meal so I could be stable enough for the flight to treatment. I had failed yet again at being anorexic, so I couldn’t let go of the disorder. I genuinely thought this would be the last time I did anything disordered, and I could get rid of it for good. \n\nIt’s like playing a game with a referee who always changes their mind. At first, doing x things will keep you in the game and keep you on the winning team. Then, you have to do x and restrict a little more to stay winning. Then, you have to over-exercise or start purging too. Then, you have to eat no more than a tiny number of calories in a day. It just keeps going. And the worst part is, you trust this referee. This referee is a part of you, and every time they change the rules, you genuinely believe these are the new rules of the game. That if you follow the new rules, you can eventually win and stop playing. What is hard to understand about this game is that you can’t win it. You can die for it, but that’s the closest you can come to winning. \n\nSo, to my people who are struggling: get out of the game. I know it feels like you can win, but you can’t. It’s impossible. That referee will never be satisfied. So, beat them up. Get a red card, and get kicked out of the game for good. It’s not that easy and a red card won’t fix it. But, getting out of the game is better than staying in.\n\n&#x200B;\n\n[https://thiscrazybeautifullife.home.blog/2019/06/19/do-it-right/](https://thiscrazybeautifullife.home.blog/2019/06/19/do-it-right/)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/c3sgb2/why_do_we_feel_like_we_have_to_do_our_eating/",
  "score": 115,
  "num_comments": 8,
  "comments": [
    {
      "id": "ersyo7k",
      "author": "None",
      "body": "I feel this so much. It's so very, very true. And knowing this is... it doesn't always help, to be honest. Knowing that I have chosen the disorder for so long, and let life go by, highlights just how much work I have to do to get back to even a passable life standard. And, I suppose that right there is where DBT and therapy comes in to help. The feeling of needing to meet a \"standard\" of being alive is the biggest cosmic lie ever. And one that keeps me returning to all the work I've put in with my ED. I'm so much further along with my ED than with a healthy life, it seems to extraordinarily daunting to focus on picking up the pieces of my \"wasted\" time and life. The ED is comfortable in it's struggle and so immediately rewarding in it's fucked up bullshittery. But, the idea that any life is wasted and terrible and needs such drastic picking up to be \"worthy\" or \"passable\" is sick thinking, and an attitude that becomes a blanket that the ED wraps itself up in, justifies itself with. But it's shit. There is no standard and there is no \"aha! I am successful!\" because success is a lie.\n\nHappiness is the only true measure. And happiness is subjective and we need to learn to stop fucking playing a game in our heads of comparisons and measurements and numbers and qualifiers in GENERAL, not just with food and weight and miles. Winning is being fucking happy in your own day and life and not using the rest of the world, social media, weight, or any of it to justify your existence. Life IS complicated and hard, but it's doubly so when we decide to live for any reason or standard but our own subjective happiness. And if we don't know what makes us happy, I guarantee we won't figure it out being too tired or isolated to function and try things. Waiting until you're a certain pant size or BF% to have friends or try hobbies is an excuse born of anxiety and fear. That excuse is not one that will ever leave. It's just a \"not right now\" with no ending. It's just a denail-born, \"no, I can't, ever\" without those words.\n\nBut we can. And we must. And that's it. EDs are copouts and I'm not trying to invalidate anyone or myself. I'm just angry and I want to burn down the bullshit. Thank you for writing. I may have veered wildly off-subject, but I'm mad at these behaviors and I like it, and it's necessary. Thanks for getting me aimed in a better direction today. You are a friend and a light in the dark. Please, never stop fighting to keep yourself lit up and spreading the warmth. <3",
      "created_utc": 1561227687.0,
      "score": 16,
      "context": []
    },
    {
      "id": "eruaiku",
      "author": "pinkribbon007",
      "body": "You have captured this perfectly, I could never explain to anyone, sometimes even myself what my eating disorder was all about, but the concept of winning in the disorder when you're not winning in life is the perfect phrase. Thank you for taking the time to write this",
      "created_utc": 1561269586.0,
      "score": 5,
      "context": []
    },
    {
      "id": "erub7ic",
      "author": "None",
      "body": "Ouch, this is so true...\n\nMy co-workers and especially that guy I like always want me to eat 'just a little'. It's so hard to explain to them that I can't. If I start eating, I open the bottomless pit. 0 calories is perfect. No food, no worries and I can go with my day.\n\nIt's tormenting me and I don't want people to notice but at the same time I want them to stop inviting me for lunch. I want people to stop commenting about my weight but I want them to notice that I lost weight.\n\nI'm definitely ready to talk to someone about it but I want to lose just a little bit more... 😭",
      "created_utc": 1561270499.0,
      "score": 3,
      "context": []
    },
    {
      "id": "erwwssr",
      "author": "orryvsworld",
      "body": "it weirds me out so much to think that my brain, like the one thing i’ve felt like i could trust in life, is now wired to self destruct. like rationally i know this but i’m still living with the reality of it. it’s so frightening to think that this illness destroys you from the inside out and you don’t even fully believe it like i feel like i’m possessed or something from an outside perspective it’s so disturbing",
      "created_utc": 1561359835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eru32uc",
      "author": "clarelandis",
      "body": "Thank you so much for your kind words. It makes me angry too, and I think you're absolutely right, it is a good thing. I like being mad at my disorder. Happiness is such a better measure, and it's a much harder one than the number on the scale.",
      "created_utc": 1561261433.0,
      "score": 3,
      "context": [
        {
          "id": "ersyo7k",
          "author": "None",
          "body": "I feel this so much. It's so very, very true. And knowing this is... it doesn't always help, to be honest. Knowing that I have chosen the disorder for so long, and let life go by, highlights just how much work I have to do to get back to even a passable life standard. And, I suppose that right there is where DBT and therapy comes in to help. The feeling of needing to meet a \"standard\" of being alive is the biggest cosmic lie ever. And one that keeps me returning to all the work I've put in with my ED. I'm so much further along with my ED than with a healthy life, it seems to extraordinarily daunting to focus on picking up the pieces of my \"wasted\" time and life. The ED is comfortable in it's struggle and so immediately rewarding in it's fucked up bullshittery. But, the idea that any life is wasted and terrible and needs such drastic picking up to be \"worthy\" or \"passable\" is sick thinking, and an attitude that becomes a blanket that the ED wraps itself up in, justifies itself with. But it's shit. There is no standard and there is no \"aha! I am successful!\" because success is a lie.\n\nHappiness is the only true measure. And happiness is subjective and we need to learn to stop fucking playing a game in our heads of comparisons and measurements and numbers and qualifiers in GENERAL, not just with food and weight and miles. Winning is being fucking happy in your own day and life and not using the rest of the world, social media, weight, or any of it to justify your existence. Life IS complicated and hard, but it's doubly so when we decide to live for any reason or standard but our own subjective happiness. And if we don't know what makes us happy, I guarantee we won't figure it out being too tired or isolated to function and try things. Waiting until you're a certain pant size or BF% to have friends or try hobbies is an excuse born of anxiety and fear. That excuse is not one that will ever leave. It's just a \"not right now\" with no ending. It's just a denail-born, \"no, I can't, ever\" without those words.\n\nBut we can. And we must. And that's it. EDs are copouts and I'm not trying to invalidate anyone or myself. I'm just angry and I want to burn down the bullshit. Thank you for writing. I may have veered wildly off-subject, but I'm mad at these behaviors and I like it, and it's necessary. Thanks for getting me aimed in a better direction today. You are a friend and a light in the dark. Please, never stop fighting to keep yourself lit up and spreading the warmth. <3",
          "created_utc": 1561227687.0
        }
      ]
    },
    {
      "id": "ervz9ze",
      "author": "clarelandis",
      "body": "So glad you can relate! It's such a hard thing.",
      "created_utc": 1561328910.0,
      "score": 1,
      "context": [
        {
          "id": "eruaiku",
          "author": "pinkribbon007",
          "body": "You have captured this perfectly, I could never explain to anyone, sometimes even myself what my eating disorder was all about, but the concept of winning in the disorder when you're not winning in life is the perfect phrase. Thank you for taking the time to write this",
          "created_utc": 1561269586.0
        }
      ]
    },
    {
      "id": "erwwygs",
      "author": "orryvsworld",
      "body": "omg you captured that perfectly, when people comment about my weight i get so uncomfortable and i like cringe but the other part of me loves it so much and CRAVES it like i have specific clothes i will wear when i want people to notice weight loss, but i also have clothes that make me look bigger, and when i look big in them i’m like ???? wtf everyone thinks i’m fat now and i get sad like i’m so annoyed with all of this",
      "created_utc": 1561360050.0,
      "score": 2,
      "context": [
        {
          "id": "erub7ic",
          "author": "None",
          "body": "Ouch, this is so true...\n\nMy co-workers and especially that guy I like always want me to eat 'just a little'. It's so hard to explain to them that I can't. If I start eating, I open the bottomless pit. 0 calories is perfect. No food, no worries and I can go with my day.\n\nIt's tormenting me and I don't want people to notice but at the same time I want them to stop inviting me for lunch. I want people to stop commenting about my weight but I want them to notice that I lost weight.\n\nI'm definitely ready to talk to someone about it but I want to lose just a little bit more... 😭",
          "created_utc": 1561270499.0
        }
      ]
    },
    {
      "id": "erwzsyt",
      "author": "None",
      "body": "Haha I know what you mean. There is a pair of jeans I wear when I don't want people to notice that I lost weight, I call them 'the padded jeans'. The worst part is that some co-workers ask other people about my health like \"she's gotten skinnier is she OK?!\", bitch if you worry come and ask me, don't ask that other person who has no idea 😅",
      "created_utc": 1561364246.0,
      "score": 1,
      "context": [
        {
          "id": "erub7ic",
          "author": "None",
          "body": "Ouch, this is so true...\n\nMy co-workers and especially that guy I like always want me to eat 'just a little'. It's so hard to explain to them that I can't. If I start eating, I open the bottomless pit. 0 calories is perfect. No food, no worries and I can go with my day.\n\nIt's tormenting me and I don't want people to notice but at the same time I want them to stop inviting me for lunch. I want people to stop commenting about my weight but I want them to notice that I lost weight.\n\nI'm definitely ready to talk to someone about it but I want to lose just a little bit more... 😭",
          "created_utc": 1561270499.0
        },
        {
          "id": "erwwygs",
          "author": "orryvsworld",
          "body": "omg you captured that perfectly, when people comment about my weight i get so uncomfortable and i like cringe but the other part of me loves it so much and CRAVES it like i have specific clothes i will wear when i want people to notice weight loss, but i also have clothes that make me look bigger, and when i look big in them i’m like ???? wtf everyone thinks i’m fat now and i get sad like i’m so annoyed with all of this",
          "created_utc": 1561360050.0
        }
      ]
    }
  ]
}