{
  "id": "c5wccv",
  "subreddit": "fuckeatingdisorders",
  "author": "vlameopotato",
  "created_utc": 1561584913.0,
  "title": "my boyfriend said he wouldn’t love me anymore if I gained 30lbs",
  "selftext": "This came about after he (24m) ate dinner one night when I (22f) was over.  He commented on how much he ate and (jokingly) said “I feel like I just gained 15lbs from that one meal, you aren’t gunna love me anymore.” So I said, “Babe, you could gain 100lbs and I’d still love you.” He said “Gross, I wouldn’t want you to.” I said “Your weight doesn’t matter to me, I’m into your personality.” He responded “If I gained 100lbs I would be unhealthy and would hope you wouldn’t love me.” I came back with “What, so if I gained 100lbs you wouldn’t love me?” And he goes “Nah, I would tap out at like 30lbs.” Like, not at all joking at this point. I’m 5’4 and weigh 95lbs, which technically makes me underweight, so I said (trying to bring a little humor back into this) “Good god! If I gained 30lbs I would be at a healthy weight. Babe, that’s kind of the worst thing you’ve ever said.” He said “Okay fine, like 60lbs then.” I told him most women gain 50lbs from a pregnancy easily and he was SHOCKED. (I’m not pregnant, thank GOD, but we’ve talked about marriage and kids). We have not, however, ever had the eating disorder talk, but there’s no way he doesn’t suspect that I’m anorexic. I basically never eat around him even when we’re together for days in a row and when we go to restaurants I only get drinks. Even the meal he ate that started the conversation was one that I didn’t partake in at all. I don’t know, am I making too much of this? I’m annoyed he said that at all. This happened like a month ago but I can’t stop thinking about it.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/c5wccv/my_boyfriend_said_he_wouldnt_love_me_anymore_if_i/",
  "score": 138,
  "num_comments": 38,
  "comments": [
    {
      "id": "es4kf0z",
      "author": "Aleph0-4",
      "body": "i think the fact that he didn't notice something was off when he's never seen you eat meals with him is problematic. it shows that at best, he's not observant at all - when you care about someone you always want to make sure they're eating properly. that said, it's to be expected then that he would say insensitive things such as this. don't think you should tolerate people who hurt you with their ignorance",
      "created_utc": 1561586903.0,
      "score": 87,
      "context": []
    },
    {
      "id": "es4jrzk",
      "author": "CannonEyes",
      "body": "Your boyfriend sucks.",
      "created_utc": 1561586463.0,
      "score": 240,
      "context": []
    },
    {
      "id": "es4k2pj",
      "author": "None",
      "body": "You aren’t making a big deal out of this. This is a big deal. Your partner should want you to be healthy and if that means an ‘extra’ 30 pounds he should WANT you to gain that weight. Looks aren’t everything, it’s OK to have preferences but it’s not ok for your boyfriend to passively encourage you to engage in your disorder. I’m sorry you are going through this 😞",
      "created_utc": 1561586666.0,
      "score": 50,
      "context": []
    },
    {
      "id": "es4kkdl",
      "author": "SpikyLady",
      "body": "I think you should have the Eating Disorder talk before engaging in more serious business with him. He needs to support you and your recovery, not nourishing your anxiety towards food.\n\nYou’re worth being loved no matter your weight.",
      "created_utc": 1561587006.0,
      "score": 45,
      "context": []
    },
    {
      "id": "es4jztt",
      "author": "None",
      "body": "I'd be pretty sad, too.\n\nI suspect that either, a.) he fetishizes very thin girls and is therefore not interested in dating you if you gain any weight, or b.) he doesn't realize that 30 lbs. on a very thin girl isn't going to make you look \"fat.\" (Whereas 30 lbs. on someone average or a bit chubby might not have as much leeway.)\n\nFor what it's worth, I used to be 90 lbs. and I gained about 30 lbs. My boyfriend loves me and is even more attracted to me.",
      "created_utc": 1561586611.0,
      "score": 115,
      "context": []
    },
    {
      "id": "es4o3js",
      "author": "None",
      "body": "Yoooooo you should leave him lmao. Not healthy.",
      "created_utc": 1561589470.0,
      "score": 33,
      "context": []
    },
    {
      "id": "es4mlk2",
      "author": "jellyfishfresh",
      "body": "You are not at all making a big deal about it. Honestly that's a really shitty thing for him to have said. Weight is something that comes and goes naturally and you can't always control it.\nTbh I'd drop my bf fast if he said that to me, or at least have a serious talk about it. If he didn't understand and adjust his view after the talk, THEN I'd drop him.",
      "created_utc": 1561588418.0,
      "score": 25,
      "context": []
    },
    {
      "id": "es4n4dh",
      "author": "None",
      "body": "Fuck you boyfriend.",
      "created_utc": 1561588781.0,
      "score": 22,
      "context": []
    },
    {
      "id": "es4m1kb",
      "author": "pabstpumpkinbeer",
      "body": "This is awful. I cannot dream of my fiance EVER saying shit like that to me. What a superficial jerk. You deserve so much better. I promise you, plenty of men are NOT like this.",
      "created_utc": 1561588035.0,
      "score": 17,
      "context": []
    },
    {
      "id": "es4ojma",
      "author": "standsure",
      "body": "I'd be annoyed if a lover said that to me. Heck I'd probably be single not long after they said it too. \n\nI have some real dealbreakers in my dating boundaries - my mental health is not negotiable. I've worked too damn hard to let toxic people take a shit on it.",
      "created_utc": 1561589786.0,
      "score": 17,
      "context": []
    },
    {
      "id": "es59zuo",
      "author": "None",
      "body": "This might sound bad but this is legit the worst thing I've ever heard a dude say. FUCKING DUMP HIM PLEASE",
      "created_utc": 1561605411.0,
      "score": 16,
      "context": []
    },
    {
      "id": "es4qjxa",
      "author": "None",
      "body": "what a jerk. do you rly want to be with someone that replies with “gross!” to the mere idea of someone gaining weight? it’d be bad enough if he was w someone that doesn’t have an ED but for someone who does? that’s a disaster waiting to happen.",
      "created_utc": 1561591267.0,
      "score": 9,
      "context": []
    },
    {
      "id": "es4yl0p",
      "author": "AustralasianRoll",
      "body": "I’m so sorry that someone is in this mindset around someone like you that’s in a bad area dealing with weight. None of this could possibly help. There are some people on this Earth that fantasize and idolize very skinny figures. I’ve dealt with those kinds of people and they’ll always look down upon overweight people. I don’t know if your bf will change, but he sounds exactly like my brother who’s been a “fataphobe” all of his life even after me trying to convince him otherwise. Try and see if you can gage if your boyfriend could be persuaded differently to a new mindset or if he’s.. sorry to be rude but a piece of trash.",
      "created_utc": 1561597310.0,
      "score": 6,
      "context": []
    },
    {
      "id": "es54vxn",
      "author": "None",
      "body": "I think you need to seriously ask yourself if this is the kind of man you want to marry one day. Sometimes life gets in the way and weight gain happens. Pregnancy, hormonal changes, medication. These can all cause weight gain. \n\nPeople age. Men lose their hair. Pregnancy changes a woman's body forever. People gain weight. It's all apart of the deal when you make a life commitment to someone. I would never be with someone who could not handle a bit of weight gain. \n\nAnd the fact that he has never mentioned you not eating with him is the biggest red flag ever. He doesn't sound like a very caring person. You stay with this douchebag and you are just feeding your eating disorder further. All the best to you.",
      "created_utc": 1561601748.0,
      "score": 7,
      "context": []
    },
    {
      "id": "es50a9x",
      "author": "None",
      "body": "I’m in recovery for anorexia and if my boyfriend ever said that I would not be at the point I am today, he does not seem to have your health in his best interests therefore personally I would dump him- if you ever want to get better and live a happy life- being with him won’t ever have you see that. Best of luck x",
      "created_utc": 1561598546.0,
      "score": 6,
      "context": []
    },
    {
      "id": "es5at3i",
      "author": "superthotty",
      "body": "Your boyfriend sucks. I gained 50lbs during my relationship with my boyfriend and he always treated me with love and compassion, and supported me when I worked to lose weight in a healthy way (nearly at a normal BMI now). You deserve someone that will love you no matter what, you're worth so much more than a number on a scale",
      "created_utc": 1561606053.0,
      "score": 6,
      "context": []
    },
    {
      "id": "es5opbz",
      "author": "misterladybug",
      "body": "Yea I hate to say this but your bf is just like your ED incarnate \n\nLike that’s not good boo",
      "created_utc": 1561620573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es4yaah",
      "author": "None",
      "body": "From what I know about dating men, is that they have no idea what weight looks like on women. A lot of us in the ED community can guess someone’s BMI just by looking at them, but typical guys definitely cannot. My entire family and my BF think I’m a healthy weight right now and I'm technically slightly overweight currently. They all also thought I was a healthy weight when I was underweight they just thought I was maybe ten pounds slimmer. But anyways your bf sounds a bit immature.. If youre in it for the long haul you're going to go through tough times and you need to be there for each other and based off of  what he said it was quite shitty and uninformed.",
      "created_utc": 1561597086.0,
      "score": 8,
      "context": []
    },
    {
      "id": "es5rlmz",
      "author": "swaggysalamander",
      "body": "i don’t have to read more than the first few sentences to see how toxic this relationship is. girl you gotta get out now",
      "created_utc": 1561624695.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es528h5",
      "author": "None",
      "body": "I'm sorry OP, but this guy sounds like a self absorbed asshole. How could he NOT notice you not eating for days at a time? Or not notice how the mood changed when he said that?\n\nHe sounds very shallow, and like he will not be helpful to you in recovery or in the long run of things. I'm sorry he is unable to see past himself and his unrealistic expectations, and doesn't realize that you need help and that he needs to support you. \n\n\nBasically put: DROP HIS ASS. You deserve better than *him*, AND you deserve to be healthy and love yourself. Don't let this guy ruin your life.\n\nGood luck ❤",
      "created_utc": 1561599919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es52ub7",
      "author": "lebresar0013",
      "body": "I honestly think he might not know that you have anorexia and if he does know I don't think he understands. What he said sounds vary ignorant",
      "created_utc": 1561600333.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es5mp38",
      "author": "boopbop19176218",
      "body": "He is fat-phobic, he is insensitive and an idiot that speaks and believes by him speaking it it must be worthwhile Nd necessary to share. We all have internalized hatred of fat but he doesn’t truly love you with his point of view of you being displayed and it being you have worth that isn’t unconditional and that is AWFUL to be around for ED. My first bf lovingly helped me into laxative addiction and anorexia. My bf won’t say he is full around me because he respects my life experience and honors me at minute one not contingent on my physicality. If he loves you more at 30 pounds heavier it is no better! He is just an idiot living with the consequences of his perceived slight of a fat gf and enjoying them. He still believes fat people don’t deserve love and that is evil. Fat people are human and are one of the most maligned group where it is okay to say the best strategy to help is to judge fatness as laziness and to shame. He is going to hurt you even if he isn’t deliberately trying. His behavior is misogynistic and disgusting. You don’t deserve to not know if your loved ones will support and stay dependent on your weight. WEIGHT GAIN IS A STRUGGLE FOR US BUT IT SHOULD ALWAYS  BE CRYSTAL CLEAR TO OUR SUPPORT THAT IT IS NEVER A CAUSE FOR CONCERN! WEIGHT GAIN IS A NEUTRAL. Self criticism and loathing and judgement fueled by a boyfriend ARE ALWAYS A DETRIMENTAL NEGATIVE. I have been down that hole and I know you don’t deserve it. You are fucking beautiful and you are to be respected and admired for your resilience in struggling with ED.",
      "created_utc": 1561618028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es5uc4z",
      "author": "None",
      "body": "That's not healthy...",
      "created_utc": 1561628840.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es61571",
      "author": "Stairowl",
      "body": "I looked at your post history. Between your ed, your bp and his adhd and the issues these have caused you..... I think you would do better to spend sometime single and working on yourself. Seems like you have a fair amount to process and I don't think that being in a relationship (any of the relationships you've mentioned on reddit) makes that any easier.\n\nEdit - also I don't think your boyfriend is a deliberate asshole.  The way you describe him in a post 17 days ago makes him sound like he's got his own serious issues and he's probably wholey oblivious. He just doesn't seem like the right person for you.",
      "created_utc": 1561637178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es6fgks",
      "author": "Elle241",
      "body": "I don’t know what’s more disturbing about his attitude, his vanity or his complete unawareness of his girlfriend’s struggles. I would think long and hard about being in a relationship with this person and whether or not it will be conducive to your long term recovery and mental health.",
      "created_utc": 1561648101.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es4vsjl",
      "author": "0912841",
      "body": "Don't underestimate men's ability to be oblivious to our problems. Yes, some guys are more sensitive and are better at detecting/understanding our feelings and thoughts. On the other hand, some are totally unaware of things that seem ridiculously obvious to us - like an ED or ED-related behaviours for example. \n\n\n\nFor us, people living with an ED, talking about weight is a big deal. His comments are not taken lightly by our community as we can see from the responses you've received. However, for other people, saying you would break up if your SO put on 100 pounds would not have a profound effect on them. \n\n\nMy point being, he seems like he is unaware of the deeper impact of his words on you. I, too, can say things that sound cold-hearted or judgmental or totally out of line. I hope you find the strength to open up a dialogue with him and help him understand what you are going through and what you've been thinking about since that situation happened. \n\nMaybe you'll discover a more thoughtful and sensitive side to your bf, maybe not. But I think you deserve some peace of mind, whether the outcome may affect your relationship or not. \nWhat do you think?",
      "created_utc": 1561595211.0,
      "score": 5,
      "context": []
    },
    {
      "id": "es4z5zf",
      "author": "perspica",
      "body": "honestly, i obviously dont know your boyfriend and that situation totally sucks, but its possible he just has.. no concept of what 30 lbs looks like. people dont like, know what weight actually looks like. im 5’5 and people guess my weight from 110 to 140",
      "created_utc": 1561597740.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es6sbqx",
      "author": "eva1588",
      "body": "Time to say bye bye!",
      "created_utc": 1561656246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "es6zswi",
      "author": "orryvsworld",
      "body": "yea... time for a new boyfriend",
      "created_utc": 1561660885.0,
      "score": 1,
      "context": []
    },
    {
      "id": "es4o332",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1561589460.0,
      "score": -16,
      "context": []
    },
    {
      "id": "es4yuvl",
      "author": "a_farewell",
      "body": "I just want to say that this sub calls out shitty partners more than like any other sub, so thank you for being part of the solution.",
      "created_utc": 1561597511.0,
      "score": 37,
      "context": [
        {
          "id": "es4jrzk",
          "author": "CannonEyes",
          "body": "Your boyfriend sucks.",
          "created_utc": 1561586463.0
        }
      ]
    },
    {
      "id": "esxk018",
      "author": "moniquepier",
      "body": "absolutely, u dont want to neglect yourself and your health to be an ideal for him. its bad enough youre going through it in your own head without pressure from him.",
      "created_utc": 1562331613.0,
      "score": 3,
      "context": [
        {
          "id": "es4kkdl",
          "author": "SpikyLady",
          "body": "I think you should have the Eating Disorder talk before engaging in more serious business with him. He needs to support you and your recovery, not nourishing your anxiety towards food.\n\nYou’re worth being loved no matter your weight.",
          "created_utc": 1561587006.0
        }
      ]
    },
    {
      "id": "es4kigz",
      "author": "vlameopotato",
      "body": "Thank you, that really makes me feel a lot better.",
      "created_utc": 1561586969.0,
      "score": 31,
      "context": [
        {
          "id": "es4jztt",
          "author": "None",
          "body": "I'd be pretty sad, too.\n\nI suspect that either, a.) he fetishizes very thin girls and is therefore not interested in dating you if you gain any weight, or b.) he doesn't realize that 30 lbs. on a very thin girl isn't going to make you look \"fat.\" (Whereas 30 lbs. on someone average or a bit chubby might not have as much leeway.)\n\nFor what it's worth, I used to be 90 lbs. and I gained about 30 lbs. My boyfriend loves me and is even more attracted to me.",
          "created_utc": 1561586611.0
        }
      ]
    },
    {
      "id": "es51uwk",
      "author": "None",
      "body": "Same! I've gained approximately 30 lbs. since recovering 5 years ago, and my husband (then boyfriend) loves my body more now then ever. He feels like he can actually hug me and touch me without hurting me - lol.",
      "created_utc": 1561599658.0,
      "score": 17,
      "context": [
        {
          "id": "es4jztt",
          "author": "None",
          "body": "I'd be pretty sad, too.\n\nI suspect that either, a.) he fetishizes very thin girls and is therefore not interested in dating you if you gain any weight, or b.) he doesn't realize that 30 lbs. on a very thin girl isn't going to make you look \"fat.\" (Whereas 30 lbs. on someone average or a bit chubby might not have as much leeway.)\n\nFor what it's worth, I used to be 90 lbs. and I gained about 30 lbs. My boyfriend loves me and is even more attracted to me.",
          "created_utc": 1561586611.0
        }
      ]
    },
    {
      "id": "es5a4g6",
      "author": "None",
      "body": "Honestly. My boyfriend tells me daily that I could be 300 pounds and he would still love me. YOU DESERVE BETTER. PLEASE THIS HURTS SO MUCH TO HERE. fuck that guy",
      "created_utc": 1561605513.0,
      "score": 13,
      "context": [
        {
          "id": "es59zuo",
          "author": "None",
          "body": "This might sound bad but this is legit the worst thing I've ever heard a dude say. FUCKING DUMP HIM PLEASE",
          "created_utc": 1561605411.0
        }
      ]
    },
    {
      "id": "es4oafi",
      "author": "vlameopotato",
      "body": "People my height and weight should gain about 40lbs during a pregnancy, so granted I was 10lbs over the mark, but whatever.",
      "created_utc": 1561589604.0,
      "score": 8,
      "context": [
        {
          "id": "es4o332",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1561589460.0
        }
      ]
    },
    {
      "id": "es694t7",
      "author": "CannonEyes",
      "body": "I think unfortunately lots of us in this community are more prone to putting up with terrible behaviours of partners due to a perceived lower self worth. Everybody deserves to be with somebody who makes them feel good about themselves and doesn't make them fear what will happen if their body changes.",
      "created_utc": 1561643775.0,
      "score": 10,
      "context": [
        {
          "id": "es4jrzk",
          "author": "CannonEyes",
          "body": "Your boyfriend sucks.",
          "created_utc": 1561586463.0
        },
        {
          "id": "es4yuvl",
          "author": "a_farewell",
          "body": "I just want to say that this sub calls out shitty partners more than like any other sub, so thank you for being part of the solution.",
          "created_utc": 1561597511.0
        }
      ]
    },
    {
      "id": "es55o07",
      "author": "None",
      "body": "My boyfriend says the same thing but I'm scared to gain more or to even be where I am rn I'm up +28 and absolutely terrified every meal to eat",
      "created_utc": 1561602292.0,
      "score": 5,
      "context": [
        {
          "id": "es4jztt",
          "author": "None",
          "body": "I'd be pretty sad, too.\n\nI suspect that either, a.) he fetishizes very thin girls and is therefore not interested in dating you if you gain any weight, or b.) he doesn't realize that 30 lbs. on a very thin girl isn't going to make you look \"fat.\" (Whereas 30 lbs. on someone average or a bit chubby might not have as much leeway.)\n\nFor what it's worth, I used to be 90 lbs. and I gained about 30 lbs. My boyfriend loves me and is even more attracted to me.",
          "created_utc": 1561586611.0
        },
        {
          "id": "es51uwk",
          "author": "None",
          "body": "Same! I've gained approximately 30 lbs. since recovering 5 years ago, and my husband (then boyfriend) loves my body more now then ever. He feels like he can actually hug me and touch me without hurting me - lol.",
          "created_utc": 1561599658.0
        }
      ]
    },
    {
      "id": "es4q2pf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1561590911.0,
      "score": -11,
      "context": [
        {
          "id": "es4o332",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1561589460.0
        },
        {
          "id": "es4oafi",
          "author": "vlameopotato",
          "body": "People my height and weight should gain about 40lbs during a pregnancy, so granted I was 10lbs over the mark, but whatever.",
          "created_utc": 1561589604.0
        }
      ]
    },
    {
      "id": "es4q7bp",
      "author": "vlameopotato",
      "body": "Not sure where the hostility is coming from, but thanks. Have a nice day.",
      "created_utc": 1561591006.0,
      "score": 7,
      "context": [
        {
          "id": "es4o332",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1561589460.0
        },
        {
          "id": "es4oafi",
          "author": "vlameopotato",
          "body": "People my height and weight should gain about 40lbs during a pregnancy, so granted I was 10lbs over the mark, but whatever.",
          "created_utc": 1561589604.0
        },
        {
          "id": "es4q2pf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1561590911.0
        }
      ]
    }
  ]
}