{
  "id": "c9owy2",
  "subreddit": "fuckeatingdisorders",
  "author": "Theo_dore",
  "created_utc": 1562383140.0,
  "title": "Recovery: from Halo Top to Ben & Jerry's",
  "selftext": "Ice cream was my biggest binge food, my biggest fear food, my biggest \"I'll never be able to control myself around it\" food. Even when I felt very much recovered from binge eating (which had been caused by restricting), I still bought low-cal ice cream: off-brand Halo Top, almond milk mousse, and greek yogurt bars.\n\nEarlier today, I bought two pints of Ben and Jerry's. And not the lowish-cal moophoria, either. **THE REAL STUFF** with cookie dough chunks, brownie chunks, and two kinds of ice cream in one pint. This is the stuff my mom wouldn't even let me buy when I was a kid because it was so full of junk.\n\nTonight, I scooped out some ice cream into a bowl (probs 1/4 of the container, about 300 cals), and I ate it. Wow, it was so goddamn good. I finished my small portion and it felt like a lot. I didn't want more, and the rest of the night has passed by and I haven't thought once about going back for more ice cream. It was so much more filling than eating a whole pint of Halo Top (and let's be honest, I never ate less than one pint--usually, I ate two). And I won't have those truly disgusting sugar alcohol farts tonight and tomorrow.\n\n**I didn't think I would ever be able to eat ice cream like a normal person.** I thought that even if I controlled my binging, I'd still have urges to eat full pints of ice cream, and I thought I'd spend the rest of my life just trying to fight intense desires to eat. I'm so proud of how far I've come.\n\nA brief synopsis of how I stopped binging, if anyone is interested:\n\n* I stopped counting calories **and** I stopped weighing myself **and I stopped worrying about my weight at all, even if I thought I was gaining,** The goal now was to stop binging, not to lose weight. You will keep binging if you don't give your body enough food.\n* I listened to my body (not to a calorie counter, not to the time of day, and not to other people around me) to decide when I was hungry and when I was full. I ate when I was hungry, whenever I was hungry. At first, I couldn't even tell when I was hungry and when I was full, but my hunger signals slowly returned.\n* I ate what I wanted to eat, even if it was too much food or it wasn't healthy food. **I didn't beat myself up** about anything relating to food: eating too much, eating something \"bad,\" eating out, feeling bloated or fat, not exercising as much as I thought I should, etc.\n* I re-introduced foods I had stopped eating in my restriction or things I only ate during a binge, like real butter (salted Kerrygold is an absolute tongue orgasm on toast), full-fat cheese, pizza, and **actual fucking PB&amp;J sandwiches with normal bread, normal jelly, and normal peanut butter.**\n* I didn't give up, even when recovery wasn't feeling good, like when I was gaining weight and wanting so badly to restrict to counteract it. I moved past binges. A binge doesn't equal a failure; stopping binge eating doesn't happen overnight or even in a week or two. Commit for the long haul to feed your body what it needs, no restriction.\n\nOne thing they don't tell you about recovery: I poop so much, you guys. I poop every day, sometimes twice a day! It's such a joy, tbh. And it's normal poop, not massive gross binge logs or tiny restriction deer nuggets. I love it.\n\nEDIT: another thing I did when I started my recovery was I STOPPED LOOKING AT 1200isplenty because it’s hella NOT plenty for me and was encouraging me to restrict and then binge. I stopped reading most of the eating disorder subs, actually.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/c9owy2/recovery_from_halo_top_to_ben_jerrys/",
  "score": 124,
  "num_comments": 22,
  "comments": [
    {
      "id": "et1b4ch",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1562394575.0,
      "score": 15,
      "context": []
    },
    {
      "id": "et1h3dj",
      "author": "anniekeepsontrying",
      "body": "This was so nice to read! Congratulations on your journey and it‘s similar to mine. I don‘t quite trust having multiple servings of say Ice cream or crisps inthe house but I‘m getting there!",
      "created_utc": 1562397262.0,
      "score": 7,
      "context": []
    },
    {
      "id": "et1ma8q",
      "author": "blu_thunderr",
      "body": "HELL YEAH this is amazing progress honey!!!!",
      "created_utc": 1562399699.0,
      "score": 6,
      "context": []
    },
    {
      "id": "et2gowt",
      "author": "gracelandtin",
      "body": "The real stuff is so much better and more satisfying!",
      "created_utc": 1562416593.0,
      "score": 4,
      "context": []
    },
    {
      "id": "et3v1he",
      "author": "MuchoMarsupial",
      "body": "Well done! Ben and Jerrys is so much better anyway. I've also had to unsub to 1200isplenty and a bunch of other subs because there's just a shitton of ED or borderline-ED stuff on there.",
      "created_utc": 1562439582.0,
      "score": 3,
      "context": []
    },
    {
      "id": "et9fwpa",
      "author": "ThatOnePotential",
      "body": "I am so in love with this post :) Thank you so much for taking the time to write it. It's so  important for people to understand the importance of your points. It was a huge revelation to me that restriction, and obsession with weight loss, was the root of my craziness around food. For years I thought I was just a broken person. \n\nGoing all in, taking opposite action, having blind faith that the body will work things out, and leaning into the fears is the only way. It's not easy, but it is possible. Thank you gain for summing up the key mindset shifts that have to happen for recovery to really begin--this will be so helpful to those looking to start recovery.",
      "created_utc": 1562595904.0,
      "score": 3,
      "context": []
    },
    {
      "id": "et2todf",
      "author": "Samboidy",
      "body": "That's amazing to hear! We're all so happy for you.\n\nAnd thank you for the post. It was pretty helpful. :)",
      "created_utc": 1562422517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et2wh4n",
      "author": "sintos-compa",
      "body": "From someone wearing latex gloves trying to assist my ass in pooping rn I envy you",
      "created_utc": 1562423927.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et3jly0",
      "author": "fishonthesun",
      "body": "God I'm struggling so badly right now. Crying every night whether or not I felt like I ate too much. Crying even if I was fasting because everything in my life feels like it is falling apart. I so badly want to be able to eat without worrying. But at the same time it feels physically painful to even think about letting this go.\n\nCongratulations. I hope I can get to where you are 🤗",
      "created_utc": 1562434501.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et6f92g",
      "author": "lily89kitty",
      "body": "So proud of you, I will get there one day (as someone who went to 3 shops today searching for halotop) I miss Ben and Jerry's and one day I will be able to eat a little like you rather than 2 tubs. Your post is inspiring and so nice you listed what you did too, it's really helpful. Keep being amazing x",
      "created_utc": 1562511425.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et2jqhf",
      "author": "None",
      "body": "Same!!! Thank u :*",
      "created_utc": 1562417898.0,
      "score": 4,
      "context": [
        {
          "id": "et1b4ch",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1562394575.0
        }
      ]
    },
    {
      "id": "et2suhh",
      "author": "Theo_dore",
      "body": "Oh my god yes, those three are so incredibly hard; don’t worry that you still have trouble with them! Years in recovery is amazing, even if it hasn’t been a smooth ride.\n\nThank you so much for your support! I’m so proud of you for how far you’ve come. Send me a message in the future if you want to talk about anything; I’m here for you!",
      "created_utc": 1562422090.0,
      "score": 2,
      "context": [
        {
          "id": "et1b4ch",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1562394575.0
        }
      ]
    },
    {
      "id": "et2s90s",
      "author": "Theo_dore",
      "body": "I’m so happy for you! Yes, having multiple servings was a challenge for a while. Peanut butter was hard—for a long time, I stole single serving PB things from my work cafeteria because I kept binging on jars of PB when I bought them. Crackers were also really hard for me, things like cheez-it’s and wheat thins. Oh, and I bought popsicles or ice cream bars instead of pints. \n\nI’m proud of you, though! It sounds like you’re doing so great! I don’t think there’s any tip or trick to be able to have a pint of ice cream in the house; it just takes time in recovery for your brain and body to change and normalize. You’ll get there!",
      "created_utc": 1562421776.0,
      "score": 3,
      "context": [
        {
          "id": "et1h3dj",
          "author": "anniekeepsontrying",
          "body": "This was so nice to read! Congratulations on your journey and it‘s similar to mine. I don‘t quite trust having multiple servings of say Ice cream or crisps inthe house but I‘m getting there!",
          "created_utc": 1562397262.0
        }
      ]
    },
    {
      "id": "et2rj48",
      "author": "Theo_dore",
      "body": "Thank you so much! I feel very stable in my recovery at this point; it doesn’t feel precarious like it did in the past.",
      "created_utc": 1562421398.0,
      "score": 2,
      "context": [
        {
          "id": "et1ma8q",
          "author": "blu_thunderr",
          "body": "HELL YEAH this is amazing progress honey!!!!",
          "created_utc": 1562399699.0
        }
      ]
    },
    {
      "id": "et420p7",
      "author": "Theo_dore",
      "body": "I'm glad that helped you, too! 1200isplenty was the worst for me, but the other ED subreddits were iffy too. It seemed like everyone else was so good at restricting calories and losing weight, and I felt like a failure for binging instead.\n\nI also got a fitbit a while ago, and it really opened my eyes to how much I can actually eat. \"Set your TDEE calculator to sedentary\" and \"only eat back half of your workout calories\" is terrible, horrible advice. \n\nI don't pay much attention to the calorie counter on my fitbit (and I read that it overestimates), but I think my TDEE  averages around 2,500 cals (with a goal of 12,000 steps a day). And I was trying to eat half of that! Absolute insanity.",
      "created_utc": 1562442832.0,
      "score": 2,
      "context": [
        {
          "id": "et3v1he",
          "author": "MuchoMarsupial",
          "body": "Well done! Ben and Jerrys is so much better anyway. I've also had to unsub to 1200isplenty and a bunch of other subs because there's just a shitton of ED or borderline-ED stuff on there.",
          "created_utc": 1562439582.0
        }
      ]
    },
    {
      "id": "et9ngv2",
      "author": "Theo_dore",
      "body": "Yes, yes to everything in your comment! \n\nFeeling like a broken person is something I will never forget. Even when I have more difficult days in my partly recovered relationship with food, I never feel like the out of control, living to eat, slave to food that I used to feel like. And yes, it was all because I was so determined to lose weight! That was really a silly idea because my restricting and binging was only causing weight gain in the long term, even though I had short-term victories. Insanity is doing the same thing over and over again expecting different results.... that was totally me.\n\nYou’re so right about the importance of the mindset change! For me, it was definitely a breaking point—I couldn’t keep living in this binge-eating hell, and I had already tried every other restriction-based diet change, so the only other thing I could do was to stop trying to diet. I had known for a long time that I needed to do that, but I finally reached a point where my desire to stop binging/obsessing about food was greater than my fear of gaining weight.\n\n“Going all in, taking opposite action, having blind faith that the body will work things out, and leaning into the fears is the only way.”\n\nWow. I want that quote framed on my wall where I can read it every day. I’ve worked in substance abuse treatment as well, and those ideas showed up a lot with our clients. Those are words to live by.\n\nThank you so, so much for your comment ❤️ it seems like you’re doing really well in your recovery, too—congrats! I’m so happy to see that these ideas resonated with you, too.",
      "created_utc": 1562601122.0,
      "score": 1,
      "context": [
        {
          "id": "et9fwpa",
          "author": "ThatOnePotential",
          "body": "I am so in love with this post :) Thank you so much for taking the time to write it. It's so  important for people to understand the importance of your points. It was a huge revelation to me that restriction, and obsession with weight loss, was the root of my craziness around food. For years I thought I was just a broken person. \n\nGoing all in, taking opposite action, having blind faith that the body will work things out, and leaning into the fears is the only way. It's not easy, but it is possible. Thank you gain for summing up the key mindset shifts that have to happen for recovery to really begin--this will be so helpful to those looking to start recovery.",
          "created_utc": 1562595904.0
        }
      ]
    },
    {
      "id": "et44sd4",
      "author": "Theo_dore",
      "body": "I hope you achieved your pooping goals today! I didn't know I had pooping goals until recently, but here we are.",
      "created_utc": 1562444108.0,
      "score": 2,
      "context": [
        {
          "id": "et2wh4n",
          "author": "sintos-compa",
          "body": "From someone wearing latex gloves trying to assist my ass in pooping rn I envy you",
          "created_utc": 1562423927.0
        }
      ]
    },
    {
      "id": "et448d4",
      "author": "Theo_dore",
      "body": "That sounds really, really hard. I remember that feeling very well.\n\nThe fact that you're thinking about changing or doing something different (even if you're not sure what would be) is really good. I'm proud of you for thinking about what it would be like to let some of the disordered eating habits go. \n\nI had those feelings, too--abandoning my weight loss goals was one of the hardest things for me to do. It was painful to think about, like you said. But it got less painful the more I thought about it, and eventually, it didn't seem so hard to let go.\n\nMaybe it would be interesting to try having an emotionally detached outlook toward food. Like, no matter what you ate, you just thought about it as food, not good or bad. Not too much or too little, not healthy or unhealthy. Just food for your body. Same goes for your actual physical body--it's not too fat or too skinny, not too tall or too short, not too lean or too muscly. It's just you. \n\nMaybe that helps, maybe it doesn't--just something to think about. Another thing to think about: if it's within your means, therapy can be a life-changer, especially if you can find a therapist who specializes in eating disorders. You also said that it feels like everything is falling apart, and a therapist can help you with that feeling, too.\n\nI totally empathize with you, though. Crying is okay; I cried a lot, too. I'm just glad that you're thinking about doing things differently; even if it doesn't feel like you've done anything, that's a big step! Thanks for posting here. I'm sure this post wasn't the easiest thing to read; I remember reading people's success stories and just wanting to scream because I felt like such a failure; why couldn't I do what they were doing? It's a really hard journey, but I really wish you the best of luck. I'm already proud of you for moving forward even though so many hard things are happening in your life.",
      "created_utc": 1562443841.0,
      "score": 2,
      "context": [
        {
          "id": "et3jly0",
          "author": "fishonthesun",
          "body": "God I'm struggling so badly right now. Crying every night whether or not I felt like I ate too much. Crying even if I was fasting because everything in my life feels like it is falling apart. I so badly want to be able to eat without worrying. But at the same time it feels physically painful to even think about letting this go.\n\nCongratulations. I hope I can get to where you are 🤗",
          "created_utc": 1562434501.0
        }
      ]
    },
    {
      "id": "et6low3",
      "author": "Theo_dore",
      "body": "You're so kind, thank you! Yes, you will get there. I'm glad my explanation of what I did was helpful! It's still a work in progress, too, but just having time in recovery is what I'm working on now. It feels like how addicts talk about accumulating clean time, and it just gets easier as time goes by.\n\nI hope you found the halo top you were looking for today! And I wish you the best of luck in your recovery.",
      "created_utc": 1562515108.0,
      "score": 2,
      "context": [
        {
          "id": "et6f92g",
          "author": "lily89kitty",
          "body": "So proud of you, I will get there one day (as someone who went to 3 shops today searching for halotop) I miss Ben and Jerry's and one day I will be able to eat a little like you rather than 2 tubs. Your post is inspiring and so nice you listed what you did too, it's really helpful. Keep being amazing x",
          "created_utc": 1562511425.0
        }
      ]
    },
    {
      "id": "et3dvsc",
      "author": "blu_thunderr",
      "body": "I totally understand. I was diagnosed with EDNOS which was later renamed OSFED. I am still struggling. This isnt even something I can do. \nSo proud of you!\nLots of love!",
      "created_utc": 1562431968.0,
      "score": 2,
      "context": [
        {
          "id": "et1ma8q",
          "author": "blu_thunderr",
          "body": "HELL YEAH this is amazing progress honey!!!!",
          "created_utc": 1562399699.0
        },
        {
          "id": "et2rj48",
          "author": "Theo_dore",
          "body": "Thank you so much! I feel very stable in my recovery at this point; it doesn’t feel precarious like it did in the past.",
          "created_utc": 1562421398.0
        }
      ]
    },
    {
      "id": "et9x0vo",
      "author": "ThatOnePotential",
      "body": "You are so kind! I feel like your post is the basic guideline to getting better from a restrictive ED.  So much about recovery is surrender--just as you found, I had gotten to the point where the living hell of an ED was worse than anything that might happen in recovery, even weight gain (my worst fear).\n\nYou and I seem to be on the same wavelength about recovery. I feel so committed to helping others turn the light on with this issue. Once you realize what it takes and remain committed, the path becomes clear. It's definitely not an easy path, but it helps to know there are other out there who are walking it with me <3 \n\nI am glad you are in a solidly good place in your recovery, too. I wish you well on your journey, friend.",
      "created_utc": 1562607266.0,
      "score": 2,
      "context": [
        {
          "id": "et9fwpa",
          "author": "ThatOnePotential",
          "body": "I am so in love with this post :) Thank you so much for taking the time to write it. It's so  important for people to understand the importance of your points. It was a huge revelation to me that restriction, and obsession with weight loss, was the root of my craziness around food. For years I thought I was just a broken person. \n\nGoing all in, taking opposite action, having blind faith that the body will work things out, and leaning into the fears is the only way. It's not easy, but it is possible. Thank you gain for summing up the key mindset shifts that have to happen for recovery to really begin--this will be so helpful to those looking to start recovery.",
          "created_utc": 1562595904.0
        },
        {
          "id": "et9ngv2",
          "author": "Theo_dore",
          "body": "Yes, yes to everything in your comment! \n\nFeeling like a broken person is something I will never forget. Even when I have more difficult days in my partly recovered relationship with food, I never feel like the out of control, living to eat, slave to food that I used to feel like. And yes, it was all because I was so determined to lose weight! That was really a silly idea because my restricting and binging was only causing weight gain in the long term, even though I had short-term victories. Insanity is doing the same thing over and over again expecting different results.... that was totally me.\n\nYou’re so right about the importance of the mindset change! For me, it was definitely a breaking point—I couldn’t keep living in this binge-eating hell, and I had already tried every other restriction-based diet change, so the only other thing I could do was to stop trying to diet. I had known for a long time that I needed to do that, but I finally reached a point where my desire to stop binging/obsessing about food was greater than my fear of gaining weight.\n\n“Going all in, taking opposite action, having blind faith that the body will work things out, and leaning into the fears is the only way.”\n\nWow. I want that quote framed on my wall where I can read it every day. I’ve worked in substance abuse treatment as well, and those ideas showed up a lot with our clients. Those are words to live by.\n\nThank you so, so much for your comment ❤️ it seems like you’re doing really well in your recovery, too—congrats! I’m so happy to see that these ideas resonated with you, too.",
          "created_utc": 1562601122.0
        }
      ]
    },
    {
      "id": "et4dmlo",
      "author": "fishonthesun",
      "body": "I think maybe thinking about my body in a detached way is the only way to proceed forward- my dysmorphia is very severe.However, food-wise I do have to put some thought into it due to hypoglycemia and lactose intolerance. But it would probably help to try to let go of some of those fears",
      "created_utc": 1562448323.0,
      "score": 2,
      "context": [
        {
          "id": "et3jly0",
          "author": "fishonthesun",
          "body": "God I'm struggling so badly right now. Crying every night whether or not I felt like I ate too much. Crying even if I was fasting because everything in my life feels like it is falling apart. I so badly want to be able to eat without worrying. But at the same time it feels physically painful to even think about letting this go.\n\nCongratulations. I hope I can get to where you are 🤗",
          "created_utc": 1562434501.0
        },
        {
          "id": "et448d4",
          "author": "Theo_dore",
          "body": "That sounds really, really hard. I remember that feeling very well.\n\nThe fact that you're thinking about changing or doing something different (even if you're not sure what would be) is really good. I'm proud of you for thinking about what it would be like to let some of the disordered eating habits go. \n\nI had those feelings, too--abandoning my weight loss goals was one of the hardest things for me to do. It was painful to think about, like you said. But it got less painful the more I thought about it, and eventually, it didn't seem so hard to let go.\n\nMaybe it would be interesting to try having an emotionally detached outlook toward food. Like, no matter what you ate, you just thought about it as food, not good or bad. Not too much or too little, not healthy or unhealthy. Just food for your body. Same goes for your actual physical body--it's not too fat or too skinny, not too tall or too short, not too lean or too muscly. It's just you. \n\nMaybe that helps, maybe it doesn't--just something to think about. Another thing to think about: if it's within your means, therapy can be a life-changer, especially if you can find a therapist who specializes in eating disorders. You also said that it feels like everything is falling apart, and a therapist can help you with that feeling, too.\n\nI totally empathize with you, though. Crying is okay; I cried a lot, too. I'm just glad that you're thinking about doing things differently; even if it doesn't feel like you've done anything, that's a big step! Thanks for posting here. I'm sure this post wasn't the easiest thing to read; I remember reading people's success stories and just wanting to scream because I felt like such a failure; why couldn't I do what they were doing? It's a really hard journey, but I really wish you the best of luck. I'm already proud of you for moving forward even though so many hard things are happening in your life.",
          "created_utc": 1562443841.0
        }
      ]
    },
    {
      "id": "et4dsut",
      "author": "fishonthesun",
      "body": "But thank you for the support it really means a lot. I want to get better at lifting- I can already lift stronger than a lot of guys at my gym, even when I'm literally about to pass out. So I'd love to see how strong I could be if I nourished myself. And I want to run a marathon but I dont want it to be a disordered thing. So recovery has to be done but I just ack fucking hate myself",
      "created_utc": 1562448414.0,
      "score": 2,
      "context": [
        {
          "id": "et3jly0",
          "author": "fishonthesun",
          "body": "God I'm struggling so badly right now. Crying every night whether or not I felt like I ate too much. Crying even if I was fasting because everything in my life feels like it is falling apart. I so badly want to be able to eat without worrying. But at the same time it feels physically painful to even think about letting this go.\n\nCongratulations. I hope I can get to where you are 🤗",
          "created_utc": 1562434501.0
        },
        {
          "id": "et448d4",
          "author": "Theo_dore",
          "body": "That sounds really, really hard. I remember that feeling very well.\n\nThe fact that you're thinking about changing or doing something different (even if you're not sure what would be) is really good. I'm proud of you for thinking about what it would be like to let some of the disordered eating habits go. \n\nI had those feelings, too--abandoning my weight loss goals was one of the hardest things for me to do. It was painful to think about, like you said. But it got less painful the more I thought about it, and eventually, it didn't seem so hard to let go.\n\nMaybe it would be interesting to try having an emotionally detached outlook toward food. Like, no matter what you ate, you just thought about it as food, not good or bad. Not too much or too little, not healthy or unhealthy. Just food for your body. Same goes for your actual physical body--it's not too fat or too skinny, not too tall or too short, not too lean or too muscly. It's just you. \n\nMaybe that helps, maybe it doesn't--just something to think about. Another thing to think about: if it's within your means, therapy can be a life-changer, especially if you can find a therapist who specializes in eating disorders. You also said that it feels like everything is falling apart, and a therapist can help you with that feeling, too.\n\nI totally empathize with you, though. Crying is okay; I cried a lot, too. I'm just glad that you're thinking about doing things differently; even if it doesn't feel like you've done anything, that's a big step! Thanks for posting here. I'm sure this post wasn't the easiest thing to read; I remember reading people's success stories and just wanting to scream because I felt like such a failure; why couldn't I do what they were doing? It's a really hard journey, but I really wish you the best of luck. I'm already proud of you for moving forward even though so many hard things are happening in your life.",
          "created_utc": 1562443841.0
        }
      ]
    }
  ]
}