{
  "id": "caf37w",
  "subreddit": "fuckeatingdisorders",
  "author": "PizzaIsASuperfood",
  "created_utc": 1562551438.0,
  "title": "random non-food-related things that helped me recover",
  "selftext": "- Having a house plant was really helpful. The process of reading and learning about how plants too need nutrition and certain sunlight, soil requirements... somehow got me feeling more compassionate towards myself and my basic nutrient needs. \n\n- Also, did you know that trees store energy? They do! Even if it's not visible in the form of leaves and stuff, they store energy to get through the winter. Trees (and other plants) also won't germinate or grow if they don't sense that the environment is right-- not enough water, warmth, sun -- even if they have the energy storage. The plant needs to be reassured that the environment has the necessary ingredients, and consistently so. This kind of helped me think about all the internal repairs that my body had to do -- even if I had already gotten my period back and felt fine, I had little bouts of increased hunger at night and it was helpful for me to think about it as my body still trying to build up its internal energy reserves, and that my body was also trying to \"see\" if it could get whatever food it wanted, any time it wanted.\n\n- I've written this before, but getting rid of my step counter on my phone (which had been installed automatically on newer iPhones... but [there is a way to disable it](https://www.idownloadblog.com/2016/05/18/how-to-stop-iphone-tracking-steps-fitness-activity/)) was super helpful and now I never even think about the number of steps I am taking per day. I used to walk everywhere and check my steps every .... 2000 steps or so. It was annoying. I was never present; I never enjoyed or really took my surroundings in when chained to the step counter. The only time I use a step counter is sometimes when I'm on vacation or a hike and get curious about how far I'll walk in a day. \n\n- Reading and watching videos about what elderly people regret: such as this video: https://www.youtube.com/watch?v=9AThycGCakk\n\n- Other sobering statistics, like [the average woman spends 17 years of her life on a diet](https://www.medicaldaily.com/average-woman-spends-17-years-her-life-diets-242601), coupled with [this chart of your life in weeks](https://waitbutwhy.com/2014/05/life-weeks.html). \n\n- The thought that, ... if I was worrying that it was \"too late\" for me to recover, the fact is, I am always going to be younger than somebody else. I am always young enough to be somebody's \"younger sister,\" seen as somebody who still has all the time in the world to rebound and change and grow. \n\n- I kept a document/email thread of little quotes/snippets of scientific information/etc about the recovery process. Things like data on the time it took for hormones to get back into sync after an eating disorder, anecdotes from people who had been through the process... it helped me get through some times that I had doubts about the process. I referred to it whenever I felt I wanted that extra support. \n\n- Not exactly related, but investing in your sleep is always a good idea and can be helpful in the recovery process: black-out curtains, a good eye mask, figuring out a good sleep/nighttime routine, keeping your sleeping space clean and clutter-free, a dim light bulb to read rather than reading on screens, audiobooks or relaxing music instead of reading on screens, etc.\n\n- I have some amazing friends who have some of the mentally healthiest eating habits. (This sounds creepy, but I don't mean it in a creepy way lol). Observing them for a little while and initially trying to channel their zest in eating a good, generous meal was helpful. I remember hanging out with one of my friends late at night when I was still early on in recovery, and she offered me some dinner, and I declined, because it was later than my normal meal time. She said, \"yeah, it is late, and I'm not super hungry, but I try to make myself eat regular meals.\" That really stuck with me, and throughout my recovery I have reflected on the body's desire for predictability, regular daily rhythms, and how, especially in recovery, predictability can take not only the form of eating at a certain time, as popularized by the intermittent fasting folks, but actually in eating something at all to show your body that there are predictable sources of energy in the environment. \n\n- I kept a vlog (really just a series of videos on my phone - I don't post them anywhere) of my thoughts, reflections, progress. I would make a video about once a month. It was like doing therapy for myself. I used it as a time to be honest about things I was still struggling with and what I hoped to achieve in the coming weeks, like hanging out with a friend, or feeling more comfortable with looking at myself in a mirror, etc.\n\n- Some reflections I did make: [\"Once I'm finally attractive, I'll be a happier, calmer person\"](https://www.reddit.com/r/fuckeatingdisorders/comments/c15gjr/once_im_finally_attractive_ill_be_a_happier/)\n\n- When I first started recovery, I felt like I needed to write down a list of all the things that I did that were really dragging me down. I had a sense of what sorts of things I did when things were most severe, and things I was able to do when my behaviors were less severe... I ranked them all and it kind of helped me get a sense of how to at least start moving things towards the \"less severe\" end of behaviors. Now I have a list of shit I used to do when I was disordered (like buy all these teas from grocery stores, eat an abnormal amount of carrots and hummus, cut cakes into ridiculously thin slices) and it's more just something that I laugh at and use to remind myself of how far I've come. \n\n- I made a pie chart of things I spent thinking about and also charted that through recovery. Before, I would spend easily 80 or 90% of my day thinking about food, grocery shopping, saving money. Later on I estimated I spent about 20% of my day about when my overshoot would dissipate. Since then, things have evolved to thinking more about the latest book I am reading, or when I am going to hang out with friends, or how to get more sleep. Kind of nice to have it out there on a pie chart-- a concrete indicator of how much life the disordered eating is sucking away.\n\n- Early in recovery, tupperware was helpful because it allowed me to eat a full meal. Especially when I struggled with inhaling all these snack-y foods in my kitchen right when I got home instead of practicing how to sit down and eat a full meal... having tupperware and ready-made meals in my fridge was a good bridge. Now, 1+ year into recovery, I don't have such extreme hunger so I can wait without any issue or urges to snack, and I can cook myself a meal if I need to, so there's less of a need to depend on the tupperware. But I remember the tupperware being an important bridge towards getting to where I am now.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/caf37w/random_nonfoodrelated_things_that_helped_me/",
  "score": 97,
  "num_comments": 10,
  "comments": [
    {
      "id": "et8icpw",
      "author": "wanderlustcub",
      "body": "These are really good tactics. Thank you so much for sharing. \n\n&#x200B;\n\nI know that for me, part of my recovery process was to start by Giving my Eating Disorder a name (Phi Phi), and at first, I was angry with her, but with time, my therapist and I worked on treating Phi Phi like I would with other people (Since I tend to have a lot of empathy for others, just not for myself.\" and that has helped me a lot.",
      "created_utc": 1562557353.0,
      "score": 15,
      "context": []
    },
    {
      "id": "et8mat1",
      "author": "pabstpumpkinbeer",
      "body": "I love these. Thanks so much for sharing. Do you have any body image/body checking related advice or anything you found helpful?",
      "created_utc": 1562561068.0,
      "score": 5,
      "context": []
    },
    {
      "id": "et959xw",
      "author": "throwthediary",
      "body": "Thank you. Life really is is bigger than our EDs.",
      "created_utc": 1562586391.0,
      "score": 3,
      "context": []
    },
    {
      "id": "et9epg5",
      "author": "fionahb",
      "body": "The thought of regretting the fact that I've spent most of my life like this makes me so sad. Unfortunately, it's not enough to stop me though. ED has a powerful grip :(",
      "created_utc": 1562595002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "et9lsgd",
      "author": "ThatOnePotential",
      "body": "Thank you so much for taking the time to write this list. It's really helpful <3",
      "created_utc": 1562599987.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et925rf",
      "author": "leighwick",
      "body": "Thank you so much for this. I’ve been eating more and healthier lately and felt like I was failing myself by gaining weight. I resonate with so many of the things you’ve listed and have been doing some myself, and just reading this has helped me realise I’m not failing myself at all.",
      "created_utc": 1562582431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eta70t1",
      "author": "thegreatfeline",
      "body": "thank you so much for sharing. we really need this positivity <3",
      "created_utc": 1562613635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "etd3x5o",
      "author": "avocadotoastt",
      "body": "I started a journal the day before I began treatment, and I regularly write in it every few days. There are no rules or expectations - the journal is filled with whatever I want. I reflect on the slip-ups and celebrate the little victories. It is really shocking to go back and get a glimpse into my completely different mindset that I was in just a few months ago. I highly recommend that you document your recovery journey because it can be very helpful to look back and see how far you've come, especially when you feel like you are backsliding or aren't making progress.",
      "created_utc": 1562698598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "etd37tl",
      "author": "avocadotoastt",
      "body": "I named mine, too! It has really helped me to identify \"ED thoughts\" versus my own thoughts. This was really common with the other girls that I was in treatment with as well.",
      "created_utc": 1562698169.0,
      "score": 3,
      "context": [
        {
          "id": "et8icpw",
          "author": "wanderlustcub",
          "body": "These are really good tactics. Thank you so much for sharing. \n\n&#x200B;\n\nI know that for me, part of my recovery process was to start by Giving my Eating Disorder a name (Phi Phi), and at first, I was angry with her, but with time, my therapist and I worked on treating Phi Phi like I would with other people (Since I tend to have a lot of empathy for others, just not for myself.\" and that has helped me a lot.",
          "created_utc": 1562557353.0
        }
      ]
    },
    {
      "id": "etd3i8r",
      "author": "wanderlustcub",
      "body": "That’s awesome. It has really helped me a lot.\n\nSome days I’m like “Phi Phi is a fucking bitch” and everyone in my support group totally gets it.",
      "created_utc": 1562698347.0,
      "score": 3,
      "context": [
        {
          "id": "et8icpw",
          "author": "wanderlustcub",
          "body": "These are really good tactics. Thank you so much for sharing. \n\n&#x200B;\n\nI know that for me, part of my recovery process was to start by Giving my Eating Disorder a name (Phi Phi), and at first, I was angry with her, but with time, my therapist and I worked on treating Phi Phi like I would with other people (Since I tend to have a lot of empathy for others, just not for myself.\" and that has helped me a lot.",
          "created_utc": 1562557353.0
        },
        {
          "id": "etd37tl",
          "author": "avocadotoastt",
          "body": "I named mine, too! It has really helped me to identify \"ED thoughts\" versus my own thoughts. This was really common with the other girls that I was in treatment with as well.",
          "created_utc": 1562698169.0
        }
      ]
    }
  ]
}