{
  "id": "cbzys1",
  "subreddit": "fuckeatingdisorders",
  "author": "rachelway82",
  "created_utc": 1562872840.0,
  "title": "Woke up to a \"then and now\" picture from Google photos this morning",
  "selftext": "I woke up to a notification from Google photos this morning. It was a \"then and now\" photo of me and my niece from 4th of July 2 years ago, and last week. At first I was mortified and started to panic. I had collar bones then, I was actually really thin (but still felt fat). I met my current boyfriend around that time. When we first met I wasn't really eating, and threw up what I did eat. I refused to eat on our first date, I refused to eat in front of him for a few months. I explained to him that if I started eating I wouldn't stop and I would get fat again. He didn't push me but encouraged me to eat. Flash forward 2 years, I was right. I did start eating, and I did get fat. Obese actually. I legit gained 100 pounds in a year. It is really upsetting actually, but the world didn't actually end. I am not at a healthy weight now, and I know I need to get it under control for my health. I've been beating myself up about my weight for months. But I actually noticed something in that picture this morning. I looked so much happier in the \"now\" photo. I hate my appearance in it, and really do miss the collar bones, but I look alive. My smile looks real. In the \"thin\" photo my eyes look dead, I'm smiling but it looks like such a fake smile. I was starving. I was really afraid if I gained weight no one would love me. I showed the pictures to my boyfriend this morning and he agreed that I looked much happier in the pic from last week. He said \"for what it's worth, I would much rather have you be happy than skinny\". I actually think I believe him.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cbzys1/woke_up_to_a_then_and_now_picture_from_google/",
  "score": 139,
  "num_comments": 12,
  "comments": [
    {
      "id": "etjlup9",
      "author": "HissandVinegar",
      "body": "I'm not crying, you're crying.\n\n(I'm crying a little).",
      "created_utc": 1562876335.0,
      "score": 37,
      "context": []
    },
    {
      "id": "etk0sd1",
      "author": "PM_ME_USEFUL_ADVICE",
      "body": "He sounds like a keeper 🤗",
      "created_utc": 1562886041.0,
      "score": 26,
      "context": []
    },
    {
      "id": "etk5hrz",
      "author": "nobodysaynothing",
      "body": "I love everything about this. Thank you for sharing.",
      "created_utc": 1562889407.0,
      "score": 14,
      "context": []
    },
    {
      "id": "etk9wqz",
      "author": "rachelnessxo",
      "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
      "created_utc": 1562892624.0,
      "score": 11,
      "context": []
    },
    {
      "id": "etkx146",
      "author": "Bromley-Contingent",
      "body": "Wow, congratulations on taking the initiative to overcome this! I know how easy it can be to slip back into the mindset, and that repairing self-image and \"ED brain\" advances well beyond weight restoration, but the fact that you're able to acknowledge this and prioritize your well-being is an incredible milestone.\n\n\nI had a similar revelation while deep into my ED. I was going through old flash drives and found a video of myself from when I was at my highest weight, and I was laughing in the video. It was a genuine laugh, and I was so envious of the version of myself in the video. Why couldn't I be that happy? The girl in the video can't count her ribs, how is she just so content with simply enjoying the moment? \"Fatter\"? Yeah. \"Uglier\"? Whatever, maybe to somebody. Thing was, I already considered myself ugly. Even with all my pokey bits, gaunt face, and yellowed skin I had \"fought\" to preserve.\n\n\nIt was the start of a major turning point for me. It was either remain stuck in a body I would never be satisfied with until the LW killed me, or live in a body that may not be satisfying, may still suffer depression and feelings of negative self-image, but at the very least could function at the minimum capacity expected to perform mentally without obsessing over what my next meal will be, assess myself and react to things appropriately, and most importantly, be able to experience genuine happiness--something that had been absent in the peak of my disorder.\n\n\nA work in progress, always a work in progress, but at least I can feel genuine happiness in all the ups and downs. I'm so glad you have reached a similar place. And your boyfriend's words are most definitely coming from a place of sincerity.",
      "created_utc": 1562911817.0,
      "score": 6,
      "context": []
    },
    {
      "id": "etlu25g",
      "author": "Business_Clerk",
      "body": "Happy>skinny always <3",
      "created_utc": 1562945321.0,
      "score": 2,
      "context": []
    },
    {
      "id": "etlgzef",
      "author": "guap_getter",
      "body": "How did u gain 100lbs in s year tho? No offense I’m just curious",
      "created_utc": 1562936124.0,
      "score": -2,
      "context": []
    },
    {
      "id": "etkb9ph",
      "author": "rachelway82",
      "body": "I am absolutely uglier physically now that I've gained back the weight, and I wouldn't go so far as to say I'm \"happy\". There are still days that I can't leave the house because I don't want anyone to see me. But for the longest time I thought gaining weight would literally be the end of the world. But I am almost 40 now, and I've wasted enough time torturing myself. I am slowly learning that there are more important things than how I look, or if I was strict enough with myself to feel \"worthy\". I am worthy, and so are you.",
      "created_utc": 1562893607.0,
      "score": 15,
      "context": [
        {
          "id": "etk9wqz",
          "author": "rachelnessxo",
          "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
          "created_utc": 1562892624.0
        }
      ]
    },
    {
      "id": "etluitu",
      "author": "Business_Clerk",
      "body": "Happy=Healthy, not skinny!\n\n&#x200B;\n\nA good pair of spanks and good friends help starting out! \n\nI went from 100lbs to 120, back down to 90 and now I am 160. The bouncing around is just as unhealthy as sustaining a calorie deficit for years and purging. \n\nDon't put off buying clothes for your new body! Dress it to rock and build back up your confidence!",
      "created_utc": 1562945615.0,
      "score": 3,
      "context": [
        {
          "id": "etk9wqz",
          "author": "rachelnessxo",
          "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
          "created_utc": 1562892624.0
        }
      ]
    },
    {
      "id": "etkbkcw",
      "author": "rachelnessxo",
      "body": "That’s so true - I always said I was gonna kill my self if I got over a certain number. Well. I passed it, and I’m still here. I feel like I don’t hear stories about weight gain like mine, so thank you for posting. It makes me feel less alone. \n\nMy mom recently said that what I looked like doesn’t matter, but rather that I liked the person I am. And I do, I love who I am - I’m kind and compassionate and I love helping others - but the stupid self esteem and body issues feel like too much sometimes. It almost overpowers it.",
      "created_utc": 1562893815.0,
      "score": 12,
      "context": [
        {
          "id": "etk9wqz",
          "author": "rachelnessxo",
          "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
          "created_utc": 1562892624.0
        },
        {
          "id": "etkb9ph",
          "author": "rachelway82",
          "body": "I am absolutely uglier physically now that I've gained back the weight, and I wouldn't go so far as to say I'm \"happy\". There are still days that I can't leave the house because I don't want anyone to see me. But for the longest time I thought gaining weight would literally be the end of the world. But I am almost 40 now, and I've wasted enough time torturing myself. I am slowly learning that there are more important things than how I look, or if I was strict enough with myself to feel \"worthy\". I am worthy, and so are you.",
          "created_utc": 1562893607.0
        }
      ]
    },
    {
      "id": "etm317t",
      "author": "rachelnessxo",
      "body": "Thank you! I don’t know why but my thoughts just kill me because of the weight gain. And it’s been probably 5 years since I was at my lowest weight. I didn’t think it would be this hard.\n\nI’m trying to lose ~30 lbs, just to get back in the “healthy” range. But it’s so hard to not get back into restricting and being obsessive.",
      "created_utc": 1562950954.0,
      "score": 1,
      "context": [
        {
          "id": "etk9wqz",
          "author": "rachelnessxo",
          "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
          "created_utc": 1562892624.0
        },
        {
          "id": "etluitu",
          "author": "Business_Clerk",
          "body": "Happy=Healthy, not skinny!\n\n&#x200B;\n\nA good pair of spanks and good friends help starting out! \n\nI went from 100lbs to 120, back down to 90 and now I am 160. The bouncing around is just as unhealthy as sustaining a calorie deficit for years and purging. \n\nDon't put off buying clothes for your new body! Dress it to rock and build back up your confidence!",
          "created_utc": 1562945615.0
        }
      ]
    },
    {
      "id": "etmb4r0",
      "author": "Business_Clerk",
      "body": "I am in the same boat! Work with a dietitian, or at least talk to someone, it is so easy to backslide. \n\nI found personally that just getting active with no changes to diet helps. Calories are not the enemy, food is not a crutch or \"bad\"... its fuel. And only that.\n\nYou've got this!",
      "created_utc": 1562956007.0,
      "score": 2,
      "context": [
        {
          "id": "etk9wqz",
          "author": "rachelnessxo",
          "body": "I gained a lot as well, but I feel like I’m much uglier at this higher weight. So now I’m constantly restricting/binging cycling. \n\nI would do anything to be happy.",
          "created_utc": 1562892624.0
        },
        {
          "id": "etluitu",
          "author": "Business_Clerk",
          "body": "Happy=Healthy, not skinny!\n\n&#x200B;\n\nA good pair of spanks and good friends help starting out! \n\nI went from 100lbs to 120, back down to 90 and now I am 160. The bouncing around is just as unhealthy as sustaining a calorie deficit for years and purging. \n\nDon't put off buying clothes for your new body! Dress it to rock and build back up your confidence!",
          "created_utc": 1562945615.0
        },
        {
          "id": "etm317t",
          "author": "rachelnessxo",
          "body": "Thank you! I don’t know why but my thoughts just kill me because of the weight gain. And it’s been probably 5 years since I was at my lowest weight. I didn’t think it would be this hard.\n\nI’m trying to lose ~30 lbs, just to get back in the “healthy” range. But it’s so hard to not get back into restricting and being obsessive.",
          "created_utc": 1562950954.0
        }
      ]
    }
  ]
}