{
  "id": "ccdf31",
  "subreddit": "fuckeatingdisorders",
  "author": "numberonehowdareyou",
  "created_utc": 1562950470.0,
  "title": "Found out my weight for the first time in 2 years and had my worst ever panic attack.",
  "selftext": "My therapist and I have been talking about exposing me to my weight. We approached it as a phobia - that I am so afraid of finding out the number that I constantly engage in \"safety behaviours\" to avoid knowing it. So exposure therapy is the approach. We did a lot of talking and reading and imagination experiments for weeks and then finally last night I stepped on the scale in her office. \n\nThe number was much higher than I expected. It was my highest weight, higher than when I first started trying to lose weight which led to my ED.\n\nI completely spiraled. Was hyperventilating. My ED voice came back fully fledged. I immediately had thoughts of going home and exercising, monitoring calories, and I've already engaged in body checking behaviours several times (in mirror and tried on a dress that I knew would be too small). I was panicking for so long and crying so hard, for the entire rest of the session - I felt like I had dissociated. I couldn't even hear what the therapist was saying. I had to go home and take Ativan and go to bed. I caused my sinuses and jaw to sieze up from crying so hard.\n\nI feel ashamed that after all the work I've put into my recovery and changing the way I see self worth and weight in our society. I honestly thought I was going to walk out of therapy feeling proud of myself and one step closer to freedom from ED. But for once my worst case scenario actually came true, and I fell apart.\n\nI feel pissed that this is still a part of me, was just a dormant part of my brain all along, and that all of my symptomatic thoughts just clicked on instantly as soon as I saw that number.\nI am so fucking angry that that number still has power over me.\n\nI know all my progress still matters. I know that it was a good thing to see that clearly this is where my body wants to be, this is its set point. \n\nI just don't know how to relax or calm down. I feel like a recovery failure.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ccdf31/found_out_my_weight_for_the_first_time_in_2_years/",
  "score": 99,
  "num_comments": 13,
  "comments": [
    {
      "id": "etm9kot",
      "author": "disorderedthoughts",
      "body": "First off, props for even taking this step, that is huge. I can understand how tough this must be. I have been avoiding my weight since I started seeking recovery. I used to weigh myself every single day, at it's worst, multiple times a day. I avoid weighing myself or knowing my weight now because I know it'll set me off. I think it makes complete sense that you had the reaction you did. Even though a panic attack is completely and utterly exhausting, you survived! From personal experience, I can say exposure therapy sucks ass. But just know that your reaction, or the intensity of your reaction, will gradually get better or lessen. It just takes time. \n\n&#x200B;\n\nI have not mustered up the courage to do this yet because it is absolutely terrifying, you're a strong person for deciding to do this. Really.",
      "created_utc": 1562955027.0,
      "score": 14,
      "context": []
    },
    {
      "id": "etmd2ax",
      "author": "WookieRubbersmith",
      "body": "Hello! I had a similar thing happen a few months ago, where I hadn't weighed myself in about..8 months? And so stepped on the scale mostly out of curiosity, and was *two pounds shy of my all time highest weight*. \n\nNot gonna lie, I spiraled for a bit, mentally. The voice came back. But I did NOT actually engage in any restricting or purging. I stopped myself short of the behaviors before I had an actual, full-blown relapse. And, a couple of months later, I am back to feeling steady and stable. This panic state will pass. You are not a recovery failure. This is just an intense reaction to a very reasonable trigger.  \n\n\nI also got rid of my scale. I totally appreciate your therapist's perspective here, that it had become a phobia, but I also have decided that it is OK for me to not weigh myself, and have been supported in that choice by my therapist. I feel like there is no reason for me to know that number, given that I have never, not since I was maybe 12, had a healthy relationship with it. We will never be friends.   \n\n\nMy therapist and doctor (not specifically for ED, but they know my history) actually specifically advised that I turn my back to the monitor and ask the nurse not to read the number out loud during weigh-ins, and we agreed that we would only discuss weight *loss*, unless there was a medical necessity to discuss weight gain. I'll admit that I'm perhaps a little *skeptical* of your therapists approach with this, but I might just be feeling overly defensive on your behalf because this sounds like such a shitty, traumatic experience :(   \n\n\nSimilarly, I know that I will NEVER be able to count calories and maintain a healthy mindset. It's intuitive, mindful eating or BUST for me.   \n\n\nThis is just to say--maybe you just found a trigger that is too powerful to tackle right now, while your recovery is so fresh. And if that's the case, maybe you can talk to your therapist about pressing pause on the exposure therapy until you feel like your recovery foundation has settled a bit.  \n\n\n(I also want to say--remember that when you first became sick with your ED, you perspective of yourself was already unhealthy. I'm sure you, like most of us, prepped with disordered thoughts before they turned into disordered behaviors. The fact that you weigh more now than you did then does not mean that you are \"worse\" than you were before the ED. Remember, your weight is value-neutral. It is not good or bad. It does not make you good or bad. You are in a BETTER place than you were then, because you are on your way *out* of the tunnel--not on your way in.   \n\n\nIt is SUPER SUPER normal to gain a startling amount of weight towards the beginning of your recovery. You are literally re-learning how to feed yourself, and after restriction, it can be SO EASY to feed yourself more than your body will use in one day, because for the first time in a long time, you are not actively focused on denying your body the things that it asks for. It will get better, and it will get easier to eat when youre hungry and stop when youre full. This is just a stage in the process. Trust the process, and give yourself permission to love your body, and tell it it is a GOOD BODY for surviving all of this, and that it is OK if right now, it carries a bit more cushion. That this weight gain is actually evidence that your recovery is *working.)*",
      "created_utc": 1562957206.0,
      "score": 12,
      "context": []
    },
    {
      "id": "etmc2fj",
      "author": "novelle",
      "body": "Good For You! You are a recovery champion. \n\nIt sounds like doing the exposure therapy is one of the necessary pieces for your recovery. AND you are doing weight exposure on your terms. Don't back away from it. \n\nYou'll need to know your weight in your lifetime - if not now, then for future.  Health care providers, medical devices, so much. So much uses that number as 1 reference point. How amazing that in the future it won't be something that matters. \n\nThe trick with exposure is repetition and finding strategies that help you calm down a little faster, or panic a little less each time you do it. Over time, the exposure will change your thoughts and you will be a champion.",
      "created_utc": 1562956596.0,
      "score": 9,
      "context": []
    },
    {
      "id": "etmcovs",
      "author": "queener_beaner",
      "body": "That's so amazing you had the courage to confront your fear — what a huge step. Don't beat yourself up for spiraling, I think it was probably a completely natural reaction...and the good news is it will only get easier and more manageable.  :)\n\nI haven't weighed myself in YEARS, and have been on the positive side of a 10 year recovery for almost a year now. I went to the doctor today and silently panicked when they asked me to step on the scale, the numbers (I weighed more than I thought) right there where I could see them. It brought back EVERYTHING regarding my ED and how much I should have to exercise/restrict to \"get back down.\" \n\nIt's not easy to move on with your day after something sends your brain into a tailspin. I came home, told myself I was a babe — it's still bothering me, yet hasn't derailed me. I think your first time confronting that is going to be TOUGH, but it will only get better if you keep working on it and yourself. :)",
      "created_utc": 1562956979.0,
      "score": 5,
      "context": []
    },
    {
      "id": "etmy9nc",
      "author": "fionahb",
      "body": "Try to accept that you may always have these feelings but understand that's all they are - just feelings. And you have the choice whether you're going to let them defeat you or forge ahead in spite of them. You're not a failure! You've made it to this point which is fucking amazing.",
      "created_utc": 1562971667.0,
      "score": 4,
      "context": []
    },
    {
      "id": "etmls6c",
      "author": "None",
      "body": "Thank you for sharing. I’ve been through similar, my second recovery strategy was not weighing, but then I had to get weighed bc I was pregnant. I relapsed after the birth, but I got better and even watched my weight go back up when I got pregnant again, I stayed well for years after that. Try to fight it and keep with the therapy program, it will help a lot support against relapse. Wish you all the best 💚",
      "created_utc": 1562962851.0,
      "score": 3,
      "context": []
    },
    {
      "id": "etnd2fd",
      "author": "directly_observable",
      "body": "I'm sorry that you were shaken up a bit. I think you managed well for how difficult something like that is though. I'm a bit of a weirdo because I am in the process of gaining weight and am actually weighing myself every 1-2wks to ensure I'm gaining at a good rate. I really understand the dress/clothing situation, I am avoiding trying anything fitted on for fear that it won't fit and I'll break down.",
      "created_utc": 1562983573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "etnk51n",
      "author": "None",
      "body": "Recovery does not mean perfect health, a lack of struggle, and 0 bad days for life. No one is capable any of those things in any capacity about any body, mind, or life journey. Recovery means never giving up on yourself. Recovery is not black and white, and neither are you. I'm so sorry that you're hurting. I've been struggling with recovery in the same way. But, you have done so well for yourself. Try to be gentle and let yourself mourn something that used to bring you quick comfort, even if it was harmful. Taking care of ourselves can be very hard in this crazy world, but every coin has two sides and to feel so upset you must have done so much better for yourself and your life. Your therapist was proud of you and respected your mind and soul enough to test the waters further. Don't forget that. She's seen what you can do, how you can adapt, how you can survive and how strong you really are.\n\nIt's okay to hurt. It's okay to miss it. Hell, would you call someone who misses their shitty ex, a breakup/independency failure? Hell no! You would call them human. I can't say what will help you calm down or fight, because we are all so so different. But, I know you will get through this. I know you are worth more than the putdown at the end of your post. You are not a failure. You are infinite. I hope you can feel better soon. It's going to be okay.",
      "created_utc": 1562989790.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ettv5pz",
      "author": "numberonehowdareyou",
      "body": "Thank you everyone for the really positive feedback. It actually helped so much to read all your kind words and validations. After a few days I am feeling much more calm. I am glad that what happened was the \"worst case\" (in my head, anyway) because at least that can't happen again. If it had been a number I liked, I would have still been protected from the actual fear and probably would have experienced it later.\n\nI know my life doesn't change now that I know the number. I know I'm the same person. \n\nThank you all <3 and please DM me if you ever want to talk.",
      "created_utc": 1563196970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "etmqcht",
      "author": "numberonehowdareyou",
      "body": "Thanks for your kind words :) In defense of my therapist, this decision was not made lightly. The \"exposure therapy\" was essentially meant to be a one and done thing. She won't be weighing me again and she discourages me from weighing myself. It was more exposure to that split moment where I learn my weight. We spent weeks going over the pros and cons and reading research articles, most of which overwhelmingly support knowing your weight as opposed to avoiding it, which is a \"safety behaviour\" that holds you back from recovery.",
      "created_utc": 1562965955.0,
      "score": 6,
      "context": [
        {
          "id": "etmd2ax",
          "author": "WookieRubbersmith",
          "body": "Hello! I had a similar thing happen a few months ago, where I hadn't weighed myself in about..8 months? And so stepped on the scale mostly out of curiosity, and was *two pounds shy of my all time highest weight*. \n\nNot gonna lie, I spiraled for a bit, mentally. The voice came back. But I did NOT actually engage in any restricting or purging. I stopped myself short of the behaviors before I had an actual, full-blown relapse. And, a couple of months later, I am back to feeling steady and stable. This panic state will pass. You are not a recovery failure. This is just an intense reaction to a very reasonable trigger.  \n\n\nI also got rid of my scale. I totally appreciate your therapist's perspective here, that it had become a phobia, but I also have decided that it is OK for me to not weigh myself, and have been supported in that choice by my therapist. I feel like there is no reason for me to know that number, given that I have never, not since I was maybe 12, had a healthy relationship with it. We will never be friends.   \n\n\nMy therapist and doctor (not specifically for ED, but they know my history) actually specifically advised that I turn my back to the monitor and ask the nurse not to read the number out loud during weigh-ins, and we agreed that we would only discuss weight *loss*, unless there was a medical necessity to discuss weight gain. I'll admit that I'm perhaps a little *skeptical* of your therapists approach with this, but I might just be feeling overly defensive on your behalf because this sounds like such a shitty, traumatic experience :(   \n\n\nSimilarly, I know that I will NEVER be able to count calories and maintain a healthy mindset. It's intuitive, mindful eating or BUST for me.   \n\n\nThis is just to say--maybe you just found a trigger that is too powerful to tackle right now, while your recovery is so fresh. And if that's the case, maybe you can talk to your therapist about pressing pause on the exposure therapy until you feel like your recovery foundation has settled a bit.  \n\n\n(I also want to say--remember that when you first became sick with your ED, you perspective of yourself was already unhealthy. I'm sure you, like most of us, prepped with disordered thoughts before they turned into disordered behaviors. The fact that you weigh more now than you did then does not mean that you are \"worse\" than you were before the ED. Remember, your weight is value-neutral. It is not good or bad. It does not make you good or bad. You are in a BETTER place than you were then, because you are on your way *out* of the tunnel--not on your way in.   \n\n\nIt is SUPER SUPER normal to gain a startling amount of weight towards the beginning of your recovery. You are literally re-learning how to feed yourself, and after restriction, it can be SO EASY to feed yourself more than your body will use in one day, because for the first time in a long time, you are not actively focused on denying your body the things that it asks for. It will get better, and it will get easier to eat when youre hungry and stop when youre full. This is just a stage in the process. Trust the process, and give yourself permission to love your body, and tell it it is a GOOD BODY for surviving all of this, and that it is OK if right now, it carries a bit more cushion. That this weight gain is actually evidence that your recovery is *working.)*",
          "created_utc": 1562957206.0
        }
      ]
    },
    {
      "id": "etmzd0k",
      "author": "fionahb",
      "body": "This may be helpful\n\n[http://www.dbtselfhelp.com/html/turning\\_the\\_mind.html](http://www.dbtselfhelp.com/html/turning_the_mind.html)",
      "created_utc": 1562972494.0,
      "score": 3,
      "context": [
        {
          "id": "etmy9nc",
          "author": "fionahb",
          "body": "Try to accept that you may always have these feelings but understand that's all they are - just feelings. And you have the choice whether you're going to let them defeat you or forge ahead in spite of them. You're not a failure! You've made it to this point which is fucking amazing.",
          "created_utc": 1562971667.0
        }
      ]
    },
    {
      "id": "ettv7cd",
      "author": "numberonehowdareyou",
      "body": "that is a really lovely way of looking at it. thank you <3",
      "created_utc": 1563197008.0,
      "score": 1,
      "context": [
        {
          "id": "etnk51n",
          "author": "None",
          "body": "Recovery does not mean perfect health, a lack of struggle, and 0 bad days for life. No one is capable any of those things in any capacity about any body, mind, or life journey. Recovery means never giving up on yourself. Recovery is not black and white, and neither are you. I'm so sorry that you're hurting. I've been struggling with recovery in the same way. But, you have done so well for yourself. Try to be gentle and let yourself mourn something that used to bring you quick comfort, even if it was harmful. Taking care of ourselves can be very hard in this crazy world, but every coin has two sides and to feel so upset you must have done so much better for yourself and your life. Your therapist was proud of you and respected your mind and soul enough to test the waters further. Don't forget that. She's seen what you can do, how you can adapt, how you can survive and how strong you really are.\n\nIt's okay to hurt. It's okay to miss it. Hell, would you call someone who misses their shitty ex, a breakup/independency failure? Hell no! You would call them human. I can't say what will help you calm down or fight, because we are all so so different. But, I know you will get through this. I know you are worth more than the putdown at the end of your post. You are not a failure. You are infinite. I hope you can feel better soon. It's going to be okay.",
          "created_utc": 1562989790.0
        }
      ]
    },
    {
      "id": "etom1c0",
      "author": "WookieRubbersmith",
      "body": "That makes a lot of sense, and actually makes me feel like maybe I SHOULD try to get to a place where that number is neutral to me. I want to have kids in the next few years, and I know that weight monitoring is an important part of prenatal tracking.",
      "created_utc": 1563031476.0,
      "score": 2,
      "context": [
        {
          "id": "etmd2ax",
          "author": "WookieRubbersmith",
          "body": "Hello! I had a similar thing happen a few months ago, where I hadn't weighed myself in about..8 months? And so stepped on the scale mostly out of curiosity, and was *two pounds shy of my all time highest weight*. \n\nNot gonna lie, I spiraled for a bit, mentally. The voice came back. But I did NOT actually engage in any restricting or purging. I stopped myself short of the behaviors before I had an actual, full-blown relapse. And, a couple of months later, I am back to feeling steady and stable. This panic state will pass. You are not a recovery failure. This is just an intense reaction to a very reasonable trigger.  \n\n\nI also got rid of my scale. I totally appreciate your therapist's perspective here, that it had become a phobia, but I also have decided that it is OK for me to not weigh myself, and have been supported in that choice by my therapist. I feel like there is no reason for me to know that number, given that I have never, not since I was maybe 12, had a healthy relationship with it. We will never be friends.   \n\n\nMy therapist and doctor (not specifically for ED, but they know my history) actually specifically advised that I turn my back to the monitor and ask the nurse not to read the number out loud during weigh-ins, and we agreed that we would only discuss weight *loss*, unless there was a medical necessity to discuss weight gain. I'll admit that I'm perhaps a little *skeptical* of your therapists approach with this, but I might just be feeling overly defensive on your behalf because this sounds like such a shitty, traumatic experience :(   \n\n\nSimilarly, I know that I will NEVER be able to count calories and maintain a healthy mindset. It's intuitive, mindful eating or BUST for me.   \n\n\nThis is just to say--maybe you just found a trigger that is too powerful to tackle right now, while your recovery is so fresh. And if that's the case, maybe you can talk to your therapist about pressing pause on the exposure therapy until you feel like your recovery foundation has settled a bit.  \n\n\n(I also want to say--remember that when you first became sick with your ED, you perspective of yourself was already unhealthy. I'm sure you, like most of us, prepped with disordered thoughts before they turned into disordered behaviors. The fact that you weigh more now than you did then does not mean that you are \"worse\" than you were before the ED. Remember, your weight is value-neutral. It is not good or bad. It does not make you good or bad. You are in a BETTER place than you were then, because you are on your way *out* of the tunnel--not on your way in.   \n\n\nIt is SUPER SUPER normal to gain a startling amount of weight towards the beginning of your recovery. You are literally re-learning how to feed yourself, and after restriction, it can be SO EASY to feed yourself more than your body will use in one day, because for the first time in a long time, you are not actively focused on denying your body the things that it asks for. It will get better, and it will get easier to eat when youre hungry and stop when youre full. This is just a stage in the process. Trust the process, and give yourself permission to love your body, and tell it it is a GOOD BODY for surviving all of this, and that it is OK if right now, it carries a bit more cushion. That this weight gain is actually evidence that your recovery is *working.)*",
          "created_utc": 1562957206.0
        },
        {
          "id": "etmqcht",
          "author": "numberonehowdareyou",
          "body": "Thanks for your kind words :) In defense of my therapist, this decision was not made lightly. The \"exposure therapy\" was essentially meant to be a one and done thing. She won't be weighing me again and she discourages me from weighing myself. It was more exposure to that split moment where I learn my weight. We spent weeks going over the pros and cons and reading research articles, most of which overwhelmingly support knowing your weight as opposed to avoiding it, which is a \"safety behaviour\" that holds you back from recovery.",
          "created_utc": 1562965955.0
        }
      ]
    }
  ]
}