{
  "id": "cd97rk",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1563143305.0,
  "title": "when no one believes you because your almost 170 lbs",
  "selftext": "i've transitioned into more binge eating. a lot. 30+ pounds a lot. i was 135 in the winter, and now i'm at the heaviest i've ever been. i got a dm from a person saying i was a 'wanna-be-anorexic' and that they hate when people fake it. they didn't even know how much i weighed. \n\nguess what i'm gonna do know. hit the gym :/",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cd97rk/when_no_one_believes_you_because_your_almost_170/",
  "score": 89,
  "num_comments": 12,
  "comments": [
    {
      "id": "etsnwjs",
      "author": "Samboidy",
      "body": "People honestly suck and can be huge assholes at times. Try not to let them get to you. It's not up to a random person to decide whether you have a problem or not. It can hurt when they try to though. Stay strong. You can get through this.",
      "created_utc": 1563150657.0,
      "score": 23,
      "context": []
    },
    {
      "id": "etsnrup",
      "author": "ThatOnePotential",
      "body": "EDs are a mental disorder that manifest differently physically for different people. Part of the disorder is feeling like you are not sick enough to get help or even have the disorder. Whoever DMed you has no idea how much you are suffering day to day & cannot know whether you are sick or not. Try not to let the uninformed opinion of a stranger on the internet feed into the the disorder. You are worth recovery & it is possible. I hope you can find your way to recovery ❤️",
      "created_utc": 1563150553.0,
      "score": 15,
      "context": []
    },
    {
      "id": "etsob02",
      "author": "peezuhparty",
      "body": "Im sorry. I used to struggle with this idea and my binge eating disorder. Like you I went from 135 to 170 in a span of 8 months and after talking to my therapist he asked if I thought I had BED and I said it didn’t feel right saying I had that because I worried that I was trivializing what other people go through. The truth of the matter was that I was massively unhappy and depressed and eating 2-3K calories every night and hating myself immediately after. \n\nJust know that every ED or mental health disorder manifests itself differently in everyone and also that people can be assholes. But just keep trying to do better for yourself, because that’s all you can do. ❤️",
      "created_utc": 1563150970.0,
      "score": 10,
      "context": []
    },
    {
      "id": "etsumt5",
      "author": "standsure",
      "body": "I remember I got such a boost in my perceived self worth when I 'finally' got anorexia. \n\n\nHurt people, hurt people.",
      "created_utc": 1563155994.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ett0jxf",
      "author": "karrierpigeon",
      "body": "Same. I ballooned up 30 pounds. I used to starve myself and still have a very unhealthy relationship with food. So people are genuinely surprised when I actually mention it to the few people that I have.",
      "created_utc": 1563160797.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ettanhd",
      "author": "reddideddi",
      "body": "I’m so sorry. Why are people like this? I think that everyone who doesn’t look completely slender will be told such bs by assholes who think they have a spark of idea of what’s actually going on. Either they think you can ‘just eat’ or that you don’t deserve support because you aren’t slim enough. Who the fuck are they to say such crap?? \nAnd that’s why subreddits for mental health are so important. We got your back. Please stay strong, I know it’s hard but you don’t deserve to have to do this to yourself :( <3",
      "created_utc": 1563170853.0,
      "score": 5,
      "context": []
    },
    {
      "id": "etty5jq",
      "author": "unfrtntlyemily",
      "body": "Anyone who ever thinks ANYONE wants to be anorexic is sick. It’s awful and no one wants to have an eating disorder (be it anorexia, bulimia, binge eating, what have you). Your ED and disordered thinking might want that, but no person does. It’s a terrible life.",
      "created_utc": 1563199403.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ettbkpe",
      "author": "blu_thunderr",
      "body": "I am so sorry. I have been in your shoes. EDs are not a body type or shape they are a mental illness. It is purely a mental game of your inner self telling you things or making you see things not how they truly are. Disregard those people. They are gross and add to the poor stigma. Lots of love to you. You can do this. Recovery is hard but you can do it. \n\nI have had disordered eating since I was 8 years old. Last year I started finally trying to get treatment for it. It becomes comfortable and then when you step outside of your ED you might get scared. Take the leap, honey. You will be grateful you did. ❤\n\nEdit:I would like to add that I'm 20. Almost 21. It took me over 12 years to get help.",
      "created_utc": 1563171986.0,
      "score": 2,
      "context": []
    },
    {
      "id": "etteqr4",
      "author": "kiselozele",
      "body": "Yeah, people always think they know everything... makes me sick.",
      "created_utc": 1563176105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ettp06j",
      "author": "mixedmediamess",
      "body": "I'm so sorry. I really feel this. I've always been bigger which has made it feel impossible to talk about my eating disorder. I was finally officially diagnosed this past year when I finally entered treatment, but honestly even with that indisputable proof of ED, I haven't spoken to anyone about it except my husband and my mother. I've spent half my life suffering with something that everyone told me wasn't there, that I was making up for attention, that I was too fat to have. It is so damaging",
      "created_utc": 1563190935.0,
      "score": 2,
      "context": []
    },
    {
      "id": "etv67e8",
      "author": "danimarie82",
      "body": "I'm so sorry that people are giving you shit about something you don't have control over. No one wants to be anorexic, I don't care what anyone says. \n\nI feel you. I was big almost my entire life and dealt with disordered eating pretty much since I was about 5. I remember sneaking junk food ALL the time and basically binge eating in secret. Last summer I really started restricting and over exercising and fell into a full blown ED around Thanksgiving. I reached my lowest weight in March and after many concerned comments from family and friends, it was like a switch flipped and now I can't stop eating. I've gained 22 pounds in 4 months and it's terrible in a whole different way.\n\nLike others have said, eating disorders are a mental illness and there are a spectrum of behaviors and symptoms. Not every person experiences anorexia, bulimia, BED, etc. the same way. But you are still valid and worthy of treatment. I finally started therapy at 37 years old. Stay safe. ❤",
      "created_utc": 1563227338.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eu23qt8",
      "author": "numberonehowdareyou",
      "body": "That is so hurtful and I'm sorry they said that to you. EDs come with enough self-doubt and impostor syndrome to begin with, let alone comments like this. I don't even like the term \"atypical anorexia\" because the ED is psychological with the same behaviours regardless of weight and affects people physically in different ways.",
      "created_utc": 1563381669.0,
      "score": 1,
      "context": []
    }
  ]
}