{
  "id": "ce1ct2",
  "subreddit": "fuckeatingdisorders",
  "author": "TalkingLed",
  "created_utc": 1563303468.0,
  "title": "Can the media PLEASE stop doing this?!",
  "selftext": "So going from one day of praising the media coverage of EDs ([here](https://www.youtube.com/watch?v=_xbHnQj60yQ&t=8s)) to completely turning me back to bad old habits. I've had a few up/down days last week but got myself back on track, sticking to my food plan. I was in the shop buying a magazine when I saw on the cover of ELLE the story \"Breaking up with thinness\". I thought it might be at least mildly interesting so I flicked to the full article. \n\n&#x200B;\n\nUnfortunately the journalist opened the article describing herself at her \"worst state\": how her friends, family etc. would all beg her to eat before going on to also disclose her weight, height and indirectly her BMI at the time. Instantly I had phone out, googling her weight in kilograms, checking against her \"worst\" her stats to make sure I was thinner. \n\nI know this stuff might help provide shock value to the majority of readers but anorexia is a numbers game to a lot of people. Anyone who has gone through it would know. I was surprised how angry it made me. I had been doing ok but for the rest of the weekend and even yesterday I feel like the anorexia parasite is back and invading my every thought. :/\n\nSorry for the rant but I'm really annoyed with journalism like this, especially in fashion magazines. Just lazy sometimes.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ce1ct2/can_the_media_please_stop_doing_this/",
  "score": 111,
  "num_comments": 4,
  "comments": [
    {
      "id": "etxoewf",
      "author": "None",
      "body": "The media does a pretty poor job of taking mental health impact on readers/viewers into account in a wide range of topics, including mass violence, natural disasters, etc. I’m sure the NEDA or other awareness groups puts out advisories and reporting guidelines, but they’re often ignored. This is an important issue, because I agree that unless they actively want to trigger readers they shouldn’t include numbers.",
      "created_utc": 1563303784.0,
      "score": 38,
      "context": []
    },
    {
      "id": "etyttng",
      "author": "Ives_Oleander",
      "body": "Dude yeah. Somebody needs to fucking explain to the media how the hell to manage their shit. Annoys me too",
      "created_utc": 1563322619.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eu1p97m",
      "author": "TalkingLed",
      "body": "Yeah - I think it's even worse in the whole eating disorder side of things too because the people writing in these kinds of articles are often past-suffers themselves and will be aware of the triggers. I reckon in the case of mass violence etc. journalists can feel at times a bit removed from it. Man i have no idea though how people manage to get through events like that though. It's a good point though - I have no idea if we have those sorts of guidelines here...might be worth checking thanks",
      "created_utc": 1563372163.0,
      "score": 3,
      "context": [
        {
          "id": "etxoewf",
          "author": "None",
          "body": "The media does a pretty poor job of taking mental health impact on readers/viewers into account in a wide range of topics, including mass violence, natural disasters, etc. I’m sure the NEDA or other awareness groups puts out advisories and reporting guidelines, but they’re often ignored. This is an important issue, because I agree that unless they actively want to trigger readers they shouldn’t include numbers.",
          "created_utc": 1563303784.0
        }
      ]
    },
    {
      "id": "eu1pseo",
      "author": "TalkingLed",
      "body": "Well especially since I grew up in the age of \"Size Zero\" and all that fucking shit. In no way do I think these sorts of images actually cause anorexia but they sure do an accelerate a downward spiral. I actually already mentioned it a bit in that video but might do a whole thing on it lol but I feel like the same media and protagonists seem to have completely done a 180 and left the rest of us behind. Nicole Ritchie, Paris Hilton...it's all good now...nothing to see here, move along. Nobody seems to have fertility issues, hair loss, all the other bs.",
      "created_utc": 1563372541.0,
      "score": 5,
      "context": [
        {
          "id": "etyttng",
          "author": "Ives_Oleander",
          "body": "Dude yeah. Somebody needs to fucking explain to the media how the hell to manage their shit. Annoys me too",
          "created_utc": 1563322619.0
        }
      ]
    }
  ]
}