{
  "id": "cgyodz",
  "subreddit": "fuckeatingdisorders",
  "author": "SpaghettiAndWatches",
  "created_utc": 1563916848.0,
  "title": "I am so fat now that I had a panic attack.",
  "selftext": "Went to Walmart to get some groceries. None of my clothes fit me. Figured I’d try a few dresses on since it’s summer. They where all too small and fit weird, made my stomach look horrible. I just stared at myself in the mirror. I looked so big. I started breathing heavy. Managed to hold most of it in until I got to the car where I had a full blown panic attack. After settling down I drove home in tears.\n\nBinge eating disorder sucks and I am so tired of hating myself. I’m getting married in September and my mom and sister are all over me about my weight. This is the largest I’ve ever been and I don’t know how to stop.\n\nI’d give anything to be normal, have normal coping mechanisms. My brain can suck it for always sabotaging me.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cgyodz/i_am_so_fat_now_that_i_had_a_panic_attack/",
  "score": 137,
  "num_comments": 8,
  "comments": [
    {
      "id": "eun42qi",
      "author": "Sydneydanielle23",
      "body": "I’m so sorry. This is the worst feeling. Especially having your wedding date hanging over your head. It’s almost like when we know we have to lose weight and have X amount of time, it creates more stress and more binging. \nYou’re not alone.",
      "created_utc": 1563923979.0,
      "score": 47,
      "context": []
    },
    {
      "id": "euok7fz",
      "author": "prairiepoppins",
      "body": "I don’t have any solutions but want to tell you that you’re not alone - whenever I try to lose ## lbs by xx date, I end up gaining weight because my brain panics and is like “nope, not that restricting shit again!” and I end up eating MORE than my usual listening-to-my-body amount.\n\nIt’s so difficult.",
      "created_utc": 1563942816.0,
      "score": 10,
      "context": []
    },
    {
      "id": "euq71qy",
      "author": "daggers4",
      "body": "I completely understand how overwhelming all of this will be feeling for you, and sorry to hear you're struggling with it.\n\nI know first-hand how defining any ED can be, but it's so important to start re-learning that your ED isn't your identity. There is so much more to you than that.\n\nI'm working through issues myself, and have found that the first stage is to forgive yourself, and try to start catching those self-destructive thoughts that feed the cycle. Why are you thinking like this? What has brought it on? Try to start recognising your behaviours so you can identify patterns and diffuse their intensity.\n\nNext stage is to try to rediscover yourself beyond your ED. What are you good at? What would your friends, family, and partner say are your best qualities? What do YOU (not your ED) like to do? What makes you happy?These are the things that define you. You are NOT your body. I saw a quote recently that's helped me massively: \"Your body is the least interesting thing about you\".\n\nI can understand how difficult and painful it is to visibly see the symptoms of something that has invaded your thoughts, but changing your body will not fix this. Your body will change when you've given yourself unconditional permission to heal your mind first. Have you tried speaking to your mom and sister about how their comments are affecting you?\n\nYou're getting married, that's wonderful and beautiful, and you deserve to enjoy the process. I hope you can see that.",
      "created_utc": 1563972268.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eupot3p",
      "author": "SpikyLady",
      "body": "I’m sorry you have to deal with this. Getting recovery and losing weight is not something you have to do for September, maybe it will take more time, or maybe less. The time recovery takes is not something important, as long as you keep holding on during that path. Putting a final date in your head to get to a goal is just a way of putting more stress in an anxious situation. \n\nYour marriage will be wonderful, you do not need to lose weight for September. It’s going to be okay. You have the right to focus on yourself, and take your own time to recover. Nobody has the right to say otherwise. Not even your family.\n\nTake care !",
      "created_utc": 1563961025.0,
      "score": 4,
      "context": []
    },
    {
      "id": "euwpa6v",
      "author": "None",
      "body": "Reading this made me so emotional, it's like you wrote it from my own brain. I recently have been trying to eat healthy, avoid fast food and such. I went out one day with my boyfriend to get a dress for a party. I must have tried on 15 dresses and absolutely nothing fit. I was so fed up and sad I just left the dressing room and tried desperately not to cry in public or make a scene.   \nAnytime i try clothing on it leads to some really frustrating anxiety and often a panic attack.  \nYou are not alone",
      "created_utc": 1564077927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "euq23t1",
      "author": "None",
      "body": "Last time, I cried when I couldn't fit in a child pants I liked. You can't have it either way, eating disorders suck at all sizes :(\n\nI hope you're feeling better now! Have you looked into inpatient/outpatient programs?",
      "created_utc": 1563969159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ev5mwv9",
      "author": "budqueen12",
      "body": "This is so true. You'd think that with a weight loss deadline coming up we'd be able to handle the urges better but they fuck you up even more with the stress of knowing you need to lose weight. I feel this so much. Good luck to everyone struggling. You're not alone.",
      "created_utc": 1564236143.0,
      "score": 2,
      "context": [
        {
          "id": "eun42qi",
          "author": "Sydneydanielle23",
          "body": "I’m so sorry. This is the worst feeling. Especially having your wedding date hanging over your head. It’s almost like when we know we have to lose weight and have X amount of time, it creates more stress and more binging. \nYou’re not alone.",
          "created_utc": 1563923979.0
        }
      ]
    },
    {
      "id": "euqo1mz",
      "author": "SpaghettiAndWatches",
      "body": "Thank you for this. Reading this comment really made me feel calm. I wrote down some of your suggestions to keep with me.",
      "created_utc": 1563982280.0,
      "score": 2,
      "context": [
        {
          "id": "euq71qy",
          "author": "daggers4",
          "body": "I completely understand how overwhelming all of this will be feeling for you, and sorry to hear you're struggling with it.\n\nI know first-hand how defining any ED can be, but it's so important to start re-learning that your ED isn't your identity. There is so much more to you than that.\n\nI'm working through issues myself, and have found that the first stage is to forgive yourself, and try to start catching those self-destructive thoughts that feed the cycle. Why are you thinking like this? What has brought it on? Try to start recognising your behaviours so you can identify patterns and diffuse their intensity.\n\nNext stage is to try to rediscover yourself beyond your ED. What are you good at? What would your friends, family, and partner say are your best qualities? What do YOU (not your ED) like to do? What makes you happy?These are the things that define you. You are NOT your body. I saw a quote recently that's helped me massively: \"Your body is the least interesting thing about you\".\n\nI can understand how difficult and painful it is to visibly see the symptoms of something that has invaded your thoughts, but changing your body will not fix this. Your body will change when you've given yourself unconditional permission to heal your mind first. Have you tried speaking to your mom and sister about how their comments are affecting you?\n\nYou're getting married, that's wonderful and beautiful, and you deserve to enjoy the process. I hope you can see that.",
          "created_utc": 1563972268.0
        }
      ]
    }
  ]
}