{
  "id": "ch8btt",
  "subreddit": "fuckeatingdisorders",
  "author": "xxjage",
  "created_utc": 1563975655.0,
  "title": "I ate cereal today",
  "selftext": "This morning I got up and was insanely hungry. I’m currently in recovery from restricting and I’m weight restored but still dealing with extreme hunger and restricting from time to time. However, lately it’s been different, I’ve been eating way more and even though I still feel guilty about it, it’s a lot less guilt. I’m becoming happier. Today I’m going to meet up with a friend and not isolating myself from the real world anymore. I’m repairing the relationships I broke due to anorexia. And today I had cereal for breakfast, the full fat milk and not just unsweetened almond milk. I took my most sugary cereal and ate it because that’s what my body was craving. Not egg whites. Not bland oatmeal. Sugary cereal. And I ate it and it was so good. Don’t get me wrong, it was so difficult. I was so tempted to throw it away with each spoonful I put in my mouth. But I didn’t. I ate what I wanted and how much I wanted and that was it. Today was a win and it’s only 9am. Recovery is so hard and if you’re going through it right now, you are so strong. You will have a win. Just yesterday I was crying over the amount of ice cream and chips I consumed but guess what, that’s irrelevant today. I’m not even craving those anymore. You have got to let your body repair the damages you have caused, if your body is craving it, indulge. Restricting what your body truly needs, what it’s been lacking for so long is only going to cause you harm. I did that yesterday with the ice cream and chips, I ate all the healthy meals I could come up with and I was still so ravenous and had the biggest headache ever. So I indulged, my headache went away, and I was happier. \n\nI know I kinda diverted from the whole I ate cereal this morning. But holy it’s such a huge victory for me that I cried. And I just want anyone who’s going through recovery right now to just keep going and fighting. Yesterday was such an awful day for me, but I kept fighting and I woke up today feeling so amazing. It’s the first day in my recovery where I feel somewhat pre ed me. I never thought I could feel this way again, I didn’t even remember what it felt like. So today I’m choosing recovery. And I’m going to continue to choose recovery. I know there will be setbacks and negative feelings but I’ll just have to remember the days like this during those times. \n\nSo just to end this weird sort of rant/motivational chat, just let yourself have that cereal.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ch8btt/i_ate_cereal_today/",
  "score": 118,
  "num_comments": 14,
  "comments": [
    {
      "id": "euqjnvs",
      "author": "vaultdwellermay",
      "body": "People never understand when I tell them cereal is one of the scariest foods for me. This post made me so happy. I’m glad you’re doing well. Wishing you the happiest recovery.",
      "created_utc": 1563979818.0,
      "score": 29,
      "context": []
    },
    {
      "id": "euqlu96",
      "author": "disorderedthoughts",
      "body": "THIS IS AMAZING. Fear foods are real and recovery is fucking hard. \n\n>Today was a win and it’s only 9am  \n>  \n>but guess what, that’s irrelevant today.\n\n\\^\\^ The small reminders to stick with recovery and appreciate the small wins as HUGE wins. Today I had a MOCHA with MILK, not that bullshit \"skinny mocha\" or a mocha with almond milk. But a mocha with whole milk. Thank you for the reminder that this a big win for myself in my own recovery.",
      "created_utc": 1563981050.0,
      "score": 6,
      "context": []
    },
    {
      "id": "euqkd42",
      "author": "None",
      "body": "cereal is a HUGE fear food of mine!!! but last weekend i ate cap n crunch!!!! WITHOUT FEELING BAD!! granted it was with cashew milk bc lower calories so i really need to work up to the higher calorie rice milk but still!! we are making strides and progress sis i’m here for it i love you i support you",
      "created_utc": 1563980219.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eurn1rh",
      "author": "bflowry",
      "body": "I needed this reminder today. Thank you for being vulnerable with your process. Every win deserves to be recognize and celebrated for what it is: a win AGAINST the life-sucking monster that is an eating disorder.",
      "created_utc": 1563996253.0,
      "score": 2,
      "context": []
    },
    {
      "id": "euqv34a",
      "author": "dd_recovery",
      "body": "Wow I completely resonate with all of this and it's exactly what I needed to hear as someone trying to get through recovery. I am so happy for you!!",
      "created_utc": 1563985722.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eur1w7d",
      "author": "robotsintrees",
      "body": "It's so awesome how all these \"small\" things mean so much during recovery. It really opens your eyes to like, \"What the fuck have I been doing to myself?\" and how free life can be without ED.",
      "created_utc": 1563988480.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eurrpij",
      "author": "ThatOnePotential",
      "body": "Thank you for posting this. It's so easy to forget to celebrate these wins. You are right to point out that something that upset you yesterday, matters not at all today. Everyday we have the opportunity to get better :)",
      "created_utc": 1563998051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "euru4mi",
      "author": "MoosieGoose",
      "body": "I love this!\n\nI remember being about 1 year into recovery, and being soooo hungry, and I decided I was going to make myself an egg. I was like 23 at the time, had lived on my own for 5+ years, and didn't know how to make an egg (fried/scrambled/boiled) at all. I literally googled it, went & bought some eggs & butter, and made myself an egg! It was delicious, and I was so proud of myself for listening to my body, for trying something new, for making an effort to eat something I wanted, and for actually eating it! It sounds so silly to some, but that was one of my favorite moments of recovery. \n\nI've been at this \"recovery\" thing for like 6 years now, and yesterday was a bad day. Today is a good day. Tomorrow is a new day!",
      "created_utc": 1563998981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eus65wi",
      "author": "sintos-compa",
      "body": "Weirdest thing for me when I discovered plain Cheerios to be like crack cocaine to me. I sat in a grocery store parking lot with a mega-box of Cheerios and a jug of milk and just had a total foodgasm eating that shit with my hands.\n\nNever been able to eat cereal since.",
      "created_utc": 1564003772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eus8vs2",
      "author": "None",
      "body": "I’m so proud of you!!",
      "created_utc": 1564004815.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eusa5vl",
      "author": "None",
      "body": "that’s amazing 💙",
      "created_utc": 1564005312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "euse6tg",
      "author": "kristmastree",
      "body": "Congrats!! Going through extreme hunger right now and it’s so hard, but also so gratifying!",
      "created_utc": 1564006886.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eusqu4x",
      "author": "CherBear35",
      "body": "Congratulations and thankyou! Recovery is so hard but food freedom is amazing! Win win. You are so brave and strong.",
      "created_utc": 1564012386.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eut8ncu",
      "author": "KingGarem",
      "body": "Congrats! Cereal was also one of my fear foods, partly because it was always so hard to measure. Now that I am not measuring, I go all out on my bowl! The important thing is that your body and mind is happy. That's what counts :)",
      "created_utc": 1564021946.0,
      "score": 1,
      "context": []
    }
  ]
}