{
  "id": "cl89sh",
  "subreddit": "fuckeatingdisorders",
  "author": "nobodysaynothing",
  "created_utc": 1564772072.0,
  "title": "If you feel hungry, you need to eat more",
  "selftext": "I've seen so many posts from so many struggling people on this sub whose question is, essentially, \"what do I do if I feel hungry?\"\n\nAnd it's one of those things where it's like elementary school type shit, except that when you have an eating disorder, you truly do not know the answer to this question.\n\nSo I'm writing to remind us all of the answer, which is: **If you are hungry, that means you need to eat more.** It's not \"binging\" to eat a lot of food because you're really really hungry. Even if your tummy already feels \"full\" (your body needs more nutrition than usual, it makes sense that your stomach is going to be fuller than usual while you're getting that extra nutrition — plus, the anxiety from defying ED can make you experience heightened discomfort even when objectively your system is totally capable of handling what you've eaten. You can totally feel \"full\" and hungry at the same time, and that's ok). Even if you already ate as much as your friend/boyfriend/girlfriend/mom/dad/whatever. Even if your TDEE calculator says you've already hit ten times your \"maintenance\" (whatever that means).\n\nYour TDEE calculator does not know your body. Your mom/dad/girlfriend/boyfriend does not know your body. Your ED brain doesn't know your body (ED brain willfully ignores your body). Your BODY knows your body. Your body knows what it needs. It is wise, good, and on your side. It knows what it needs, and if you are hungry, that is your body telling you it needs food. If recovery is what you desire (no judgment if it's not), then you need to do what your body says, and eat. more. food. That's really the only way forward.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cl89sh/if_you_feel_hungry_you_need_to_eat_more/",
  "score": 107,
  "num_comments": 51,
  "comments": [
    {
      "id": "evu4gb3",
      "author": "rhymeswithpanda1987",
      "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
      "created_utc": 1564785417.0,
      "score": 57,
      "context": []
    },
    {
      "id": "evtmnwq",
      "author": "None",
      "body": "Needed to see this, thank you",
      "created_utc": 1564773676.0,
      "score": 9,
      "context": []
    },
    {
      "id": "evu99nl",
      "author": "KingGarem",
      "body": "Protein bars helped me at first. They are filling. Protein in general helps but I know people sometimes can’t stomach food at first so a bar might help. As I started getting comfortable with eating I slowly got off the bars and started eating solid stuff. Shakes are helpful too I heard but I don’t like drinking stuff. I like to chew :)",
      "created_utc": 1564788948.0,
      "score": 7,
      "context": []
    },
    {
      "id": "evtmpbs",
      "author": "currents-",
      "body": "Thank you I needed to hear this after the week I had. Anxiety was coming in HARD.",
      "created_utc": 1564773702.0,
      "score": 7,
      "context": []
    },
    {
      "id": "evumr04",
      "author": "cysticamnesia",
      "body": "saving the last paragraph to read every day like scripture",
      "created_utc": 1564799696.0,
      "score": 4,
      "context": []
    },
    {
      "id": "evuick5",
      "author": "Theo_dore",
      "body": ">Your body . . . . is wise, good, and on your side.\n\nThanks for this--it was nice to think of my body as being on my side. I often feel like I'm fighting against my body, even though I feel mostly recovered. I'll remember in the future that my body knows best, and I don't need to fight it or even understand why it sometimes tells me to eat more: I'll just listen.",
      "created_utc": 1564796098.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ew73t4w",
      "author": "ThatOnePotential",
      "body": "I just wanted to take a moment to thank you for posting this. The advice to eat more is a tough pill for those of use with restrictive EDs to take, but, in my experience, it proved the only way to end binging. Like you, I spent most days trying to starve/restrict/diet and it would inevitably end in eating the whole house. Over time, my ability to restrict got worse and worse and I could not last more than a day or two without falling into a binge. I just thought I was a food addict, etc. but it was actually restriction at the root of my problem--just as people like Tabitha Farrar, Kayla Kotecki, and Isabel Foxen Duke talk about. \n\nPeople get really upset about this idea because they are still under the delusion that people are actually able control their food intake forever. That is a diet culture/ED misapprehension--humans are not designed to be able to do this. Thank you, again, for taking the time to post about this--taking your advice could save some readers years of suffering in ED hell.",
      "created_utc": 1565185690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "evut92t",
      "author": "robotsintrees",
      "body": "But... I had a **massive** scone for breakfast, **plus** a meal replacement shake, **and** went out for dinner, consuming more deep fried tofu and noodles and peanut sauce and oil than anyone ought to. How can I possibly be hungry?!",
      "created_utc": 1564805516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "evvsagx",
      "author": "ChristySueBarnes",
      "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
      "created_utc": 1564846064.0,
      "score": 2,
      "context": []
    },
    {
      "id": "evv420e",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564818358.0,
      "score": 0,
      "context": []
    },
    {
      "id": "evuakm1",
      "author": "nobodysaynothing",
      "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
      "created_utc": 1564789945.0,
      "score": 27,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        }
      ]
    },
    {
      "id": "evv3r4f",
      "author": "None",
      "body": "I have the kind of eating disorder where I never feel hungry but I tend to binge because I obsess about one specific thing and can't get it out of my head for days. Especially damn chocolate.",
      "created_utc": 1564817929.0,
      "score": 3,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        }
      ]
    },
    {
      "id": "evu9ka6",
      "author": "KingGarem",
      "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
      "created_utc": 1564789170.0,
      "score": 5,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        }
      ]
    },
    {
      "id": "evun7id",
      "author": "nobodysaynothing",
      "body": "Embracing your body's inherent wisdom is absolutely transformative. But it does take practice.",
      "created_utc": 1564800083.0,
      "score": 6,
      "context": [
        {
          "id": "evuick5",
          "author": "Theo_dore",
          "body": ">Your body . . . . is wise, good, and on your side.\n\nThanks for this--it was nice to think of my body as being on my side. I often feel like I'm fighting against my body, even though I feel mostly recovered. I'll remember in the future that my body knows best, and I don't need to fight it or even understand why it sometimes tells me to eat more: I'll just listen.",
          "created_utc": 1564796098.0
        }
      ]
    },
    {
      "id": "ew7wgwm",
      "author": "nobodysaynothing",
      "body": "Part of it at least for me is giving up the fantasy that I can control things like my weight. It's a seductive fantasy because it boils the deep work of life down to a simple equation. But the equation doesn't work.",
      "created_utc": 1565198583.0,
      "score": 1,
      "context": [
        {
          "id": "ew73t4w",
          "author": "ThatOnePotential",
          "body": "I just wanted to take a moment to thank you for posting this. The advice to eat more is a tough pill for those of use with restrictive EDs to take, but, in my experience, it proved the only way to end binging. Like you, I spent most days trying to starve/restrict/diet and it would inevitably end in eating the whole house. Over time, my ability to restrict got worse and worse and I could not last more than a day or two without falling into a binge. I just thought I was a food addict, etc. but it was actually restriction at the root of my problem--just as people like Tabitha Farrar, Kayla Kotecki, and Isabel Foxen Duke talk about. \n\nPeople get really upset about this idea because they are still under the delusion that people are actually able control their food intake forever. That is a diet culture/ED misapprehension--humans are not designed to be able to do this. Thank you, again, for taking the time to post about this--taking your advice could save some readers years of suffering in ED hell.",
          "created_utc": 1565185690.0
        }
      ]
    },
    {
      "id": "evuucro",
      "author": "nobodysaynothing",
      "body": "Your body doesn't know about your brain's food rules. There's an amount of noodles and tofu that your brain says is more than anyone ought to eat. Your body doesn't think so. Your body thinks it's a good start but it needs more.\n\nYour brain says it should be a scone OR a meal replacement shake, but not both. Your body doesn't think so. Your body says bring it on, we desperately need the energy and the protein, and more besides.\n\nYour brain says, if I ate all that already, it should be enough. Bad body for wanting more! Your body says, look, I've got a bunch of shit to do to keep us alive and I need more fuel. I don't care about these food rules, I am hungry.\n\nIt's going to go against every fiber of your being. Your brain is going to scream every objection it can think of, and even ones you never heard of before. That's ok. Brain doesn't have to like it. But if you are going to recover, you are going to have to listen to your body on things like this. Your body never got the memo about life-giving food being bad. Your body is just trying to stay alive. When your body is hungry, you must eat. Period. Even if you feel like the anxiety is going to make you jump out of your fucking skin. Because you already know that the suffering of starvation gets you nowhere. Why not see where the suffering of defying your ED gets you?",
      "created_utc": 1564806618.0,
      "score": 11,
      "context": [
        {
          "id": "evut92t",
          "author": "robotsintrees",
          "body": "But... I had a **massive** scone for breakfast, **plus** a meal replacement shake, **and** went out for dinner, consuming more deep fried tofu and noodles and peanut sauce and oil than anyone ought to. How can I possibly be hungry?!",
          "created_utc": 1564805516.0
        }
      ]
    },
    {
      "id": "evxr8g8",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564903805.0,
      "score": -2,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        }
      ]
    },
    {
      "id": "evvji24",
      "author": "nobodysaynothing",
      "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
      "created_utc": 1564838977.0,
      "score": 3,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        }
      ]
    },
    {
      "id": "evv4ssp",
      "author": "Recoveryviacoffee",
      "body": "Do you watch your macros or is it purely calorie control? I find hitting my TDEE hell (and it can be quite high from 5x HIIT) because I bloat and distend like hell, so I end up always falling short the other days (I have loose skin and I feel like I look obese when I bloat because it swells like fat) and ultimately started losing weight again - mind you, far slower than before, but 8/9kg within 4 months when it's unintentional and within a healthy BMI is ..oops. My kidneys failed so not been to the gym for a few weeks but I debated cutting the exercise back.\n\nAlso, one thing is something like a leptin resistance could mean someone could eat thousands of thousands of calories and not feel full. There can be a lack of a physical feeling of fullness, so one's stomach is incredibly swollen with food but they are able to continue to eat. I think IF can be a dangerous road for some people, but I'm glad it worked for you. I tried IF and OMAD but I found myself just using it as a justification to end up straight fasting or continuing on sub 400-500 kcal again \nSadly we live in a society where highly processed, calorie dense foods are available at every corner, so as much as I'd love to be able to trust intuitive eating.. Well, I was obese before I was underweight for a reason, right? \n\nSorry for the tangent I just found your comment interesting.",
      "created_utc": 1564819426.0,
      "score": 0,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        }
      ]
    },
    {
      "id": "evuhur2",
      "author": "Theo_dore",
      "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
      "created_utc": 1564795709.0,
      "score": 10,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        }
      ]
    },
    {
      "id": "evuekqo",
      "author": "yinneo",
      "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
      "created_utc": 1564793072.0,
      "score": 8,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        }
      ]
    },
    {
      "id": "evuucv9",
      "author": "icarebot",
      "body": "I care",
      "created_utc": 1564806621.0,
      "score": 3,
      "context": [
        {
          "id": "evut92t",
          "author": "robotsintrees",
          "body": "But... I had a **massive** scone for breakfast, **plus** a meal replacement shake, **and** went out for dinner, consuming more deep fried tofu and noodles and peanut sauce and oil than anyone ought to. How can I possibly be hungry?!",
          "created_utc": 1564805516.0
        },
        {
          "id": "evuucro",
          "author": "nobodysaynothing",
          "body": "Your body doesn't know about your brain's food rules. There's an amount of noodles and tofu that your brain says is more than anyone ought to eat. Your body doesn't think so. Your body thinks it's a good start but it needs more.\n\nYour brain says it should be a scone OR a meal replacement shake, but not both. Your body doesn't think so. Your body says bring it on, we desperately need the energy and the protein, and more besides.\n\nYour brain says, if I ate all that already, it should be enough. Bad body for wanting more! Your body says, look, I've got a bunch of shit to do to keep us alive and I need more fuel. I don't care about these food rules, I am hungry.\n\nIt's going to go against every fiber of your being. Your brain is going to scream every objection it can think of, and even ones you never heard of before. That's ok. Brain doesn't have to like it. But if you are going to recover, you are going to have to listen to your body on things like this. Your body never got the memo about life-giving food being bad. Your body is just trying to stay alive. When your body is hungry, you must eat. Period. Even if you feel like the anxiety is going to make you jump out of your fucking skin. Because you already know that the suffering of starvation gets you nowhere. Why not see where the suffering of defying your ED gets you?",
          "created_utc": 1564806618.0
        }
      ]
    },
    {
      "id": "evvowzu",
      "author": "robotsintrees",
      "body": "Wow, I needed to read that. My partner has been telling me the same thing, and I resist and resist and resist, for what? To see a literal fucking skeleton in the mirror and feel like shit? Fuuuuck.",
      "created_utc": 1564843485.0,
      "score": 3,
      "context": [
        {
          "id": "evut92t",
          "author": "robotsintrees",
          "body": "But... I had a **massive** scone for breakfast, **plus** a meal replacement shake, **and** went out for dinner, consuming more deep fried tofu and noodles and peanut sauce and oil than anyone ought to. How can I possibly be hungry?!",
          "created_utc": 1564805516.0
        },
        {
          "id": "evuucro",
          "author": "nobodysaynothing",
          "body": "Your body doesn't know about your brain's food rules. There's an amount of noodles and tofu that your brain says is more than anyone ought to eat. Your body doesn't think so. Your body thinks it's a good start but it needs more.\n\nYour brain says it should be a scone OR a meal replacement shake, but not both. Your body doesn't think so. Your body says bring it on, we desperately need the energy and the protein, and more besides.\n\nYour brain says, if I ate all that already, it should be enough. Bad body for wanting more! Your body says, look, I've got a bunch of shit to do to keep us alive and I need more fuel. I don't care about these food rules, I am hungry.\n\nIt's going to go against every fiber of your being. Your brain is going to scream every objection it can think of, and even ones you never heard of before. That's ok. Brain doesn't have to like it. But if you are going to recover, you are going to have to listen to your body on things like this. Your body never got the memo about life-giving food being bad. Your body is just trying to stay alive. When your body is hungry, you must eat. Period. Even if you feel like the anxiety is going to make you jump out of your fucking skin. Because you already know that the suffering of starvation gets you nowhere. Why not see where the suffering of defying your ED gets you?",
          "created_utc": 1564806618.0
        }
      ]
    },
    {
      "id": "evy7aif",
      "author": "ChristySueBarnes",
      "body": "This came from Tabitha Farrar. She is a recovered anorexic. She has a lot of YouTube videos and has written many books. I liked it. She is in no way promoting obesity. She by no means encourages gorging or a “pig diet”. YOU can eat anyway you like for “fucks sake” as you put it.",
      "created_utc": 1564924856.0,
      "score": 4,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        },
        {
          "id": "evxr8g8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564903805.0
        }
      ]
    },
    {
      "id": "evvow4z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564843467.0,
      "score": -4,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        }
      ]
    },
    {
      "id": "evvchfr",
      "author": "None",
      "body": "I personally try to eat a lot of protein but I don’t really count macros. Another VERY important thing to eat is omega 3 fats. You want to eat healthy fats so you don’t become constipated.\nMy TDEE is ~1700 so I can’t really eat a lot, which is why intermittent fasting works so well for me. For someone with a TDEE of 3000 it would be a lot harder to eat so much in a short amount of time though. No diet is going to work for everyone obviously but intermittent fasting is a good thing to try out if you have a low TDEE and struggle with hunger a lot like me. Eating only 400-500 calories on intermittent fasting is obviously not recommended because you’ll lose too much muscle. I stick to 1000-1200 calories when I try to lose some weight.",
      "created_utc": 1564831160.0,
      "score": -2,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evv4ssp",
          "author": "Recoveryviacoffee",
          "body": "Do you watch your macros or is it purely calorie control? I find hitting my TDEE hell (and it can be quite high from 5x HIIT) because I bloat and distend like hell, so I end up always falling short the other days (I have loose skin and I feel like I look obese when I bloat because it swells like fat) and ultimately started losing weight again - mind you, far slower than before, but 8/9kg within 4 months when it's unintentional and within a healthy BMI is ..oops. My kidneys failed so not been to the gym for a few weeks but I debated cutting the exercise back.\n\nAlso, one thing is something like a leptin resistance could mean someone could eat thousands of thousands of calories and not feel full. There can be a lack of a physical feeling of fullness, so one's stomach is incredibly swollen with food but they are able to continue to eat. I think IF can be a dangerous road for some people, but I'm glad it worked for you. I tried IF and OMAD but I found myself just using it as a justification to end up straight fasting or continuing on sub 400-500 kcal again \nSadly we live in a society where highly processed, calorie dense foods are available at every corner, so as much as I'd love to be able to trust intuitive eating.. Well, I was obese before I was underweight for a reason, right? \n\nSorry for the tangent I just found your comment interesting.",
          "created_utc": 1564819426.0
        }
      ]
    },
    {
      "id": "evumy44",
      "author": "nobodysaynothing",
      "body": "Yes! I also didn't realize all the ways that I was restricting. Overall during that time I was at a surplus (gaining weight), but on a day to day basis, I would start every day off as a diet, like today I'm going to \"be healthy.\" It would last till like 6pm and then I would consume like 800 million calories between 6pm and midnight. If you had asked me at the time, I would have said, are you kidding me? Restricting? I used to restrict but now I can't anymore and my problem is eating too MUCH! \n\nBut it wasn't. My problem was still eating too little during the day. Eating more actually fixed it. (Though I never again got back to the size I was before and thought I wanted to be again.) Eating less (which I attempted literally every single day for two years) just made it worse.\n\nBut yeah, it sounds like our stories are really similar.",
      "created_utc": 1564799863.0,
      "score": 8,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        }
      ]
    },
    {
      "id": "evv74co",
      "author": "MuchoMarsupial",
      "body": "I'm trying to do this too. I try to listen to my body and if I'm still hungry I can eat more as long as what I eat is actual food and not just a ton of chocolate (I don't prohibit chocolate entirely though, if I REALLY want chocolate I get chocolate). I'm thinking that regardless of where I fall on the \"binge\" spectrum or what it does weight-wise at least I get nutrients instead of empty calories and my body feels full and content.",
      "created_utc": 1564823001.0,
      "score": 5,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        }
      ]
    },
    {
      "id": "evuez3g",
      "author": "KingGarem",
      "body": "I mean the guy above me explains it very well. Restriction is the root so pretty much go all in and you’re body will back off.",
      "created_utc": 1564793386.0,
      "score": 6,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        },
        {
          "id": "evuekqo",
          "author": "yinneo",
          "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
          "created_utc": 1564793072.0
        }
      ]
    },
    {
      "id": "evuesrr",
      "author": "KingGarem",
      "body": "Your body will ask what it needs. One way or another it’s going to get its energy. After that you’re body will resume normal operation.",
      "created_utc": 1564793248.0,
      "score": 4,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        },
        {
          "id": "evuekqo",
          "author": "yinneo",
          "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
          "created_utc": 1564793072.0
        }
      ]
    },
    {
      "id": "ew09v2z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564980455.0,
      "score": 0,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        },
        {
          "id": "evxr8g8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564903805.0
        },
        {
          "id": "evy7aif",
          "author": "ChristySueBarnes",
          "body": "This came from Tabitha Farrar. She is a recovered anorexic. She has a lot of YouTube videos and has written many books. I liked it. She is in no way promoting obesity. She by no means encourages gorging or a “pig diet”. YOU can eat anyway you like for “fucks sake” as you put it.",
          "created_utc": 1564924856.0
        }
      ]
    },
    {
      "id": "evvs1ot",
      "author": "nobodysaynothing",
      "body": "This is psueudo science BS. I'm sorry to say it, you seem like a nice person. But all that IF stuff is the biggest load of disordered crap I've ever heard. If it's working for you, great, more power to you. But you are not going to convince me that intermittent fasting is ok advice for eating disorder recovery.",
      "created_utc": 1564845877.0,
      "score": 4,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        },
        {
          "id": "evvow4z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564843467.0
        }
      ]
    },
    {
      "id": "evvelu9",
      "author": "Recoveryviacoffee",
      "body": "I suppose, I struggle with hunger don't get me wrong haha, but my TDEE ((when exercising)) is about 2.5k a day. My problem is, some times I end up being ravenous and fed up with my anorexia and I get sick of the restrictions and rules. End up eating idk say 3.5k and then I see how swollen and distended I am and then fast the day after, even if I had had a bad day before the 3.5k day (say I went 500 -> 3.5k -> 250) which is of course a net deficit. It's like a twisted recovery relapse loop, not binging and purging because I don't do it from a psychological compulsion or even bodily hunger, but more than I know I'm giving into my anorexia and I need to tell it to go fucks itself sometimes. It's like the willpower to fight it just dissipates and then I start back at square 1. (To people who are gonna call 3.5k a binge, A. That's only 1k above my maintenance. B. It happens very rarely, but I go that high at times if I was relapsing hard and sometimes you need a day like that and then you feel a lot freer again and eating 2k feels a bit easier.)",
      "created_utc": 1564833860.0,
      "score": 2,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evv4ssp",
          "author": "Recoveryviacoffee",
          "body": "Do you watch your macros or is it purely calorie control? I find hitting my TDEE hell (and it can be quite high from 5x HIIT) because I bloat and distend like hell, so I end up always falling short the other days (I have loose skin and I feel like I look obese when I bloat because it swells like fat) and ultimately started losing weight again - mind you, far slower than before, but 8/9kg within 4 months when it's unintentional and within a healthy BMI is ..oops. My kidneys failed so not been to the gym for a few weeks but I debated cutting the exercise back.\n\nAlso, one thing is something like a leptin resistance could mean someone could eat thousands of thousands of calories and not feel full. There can be a lack of a physical feeling of fullness, so one's stomach is incredibly swollen with food but they are able to continue to eat. I think IF can be a dangerous road for some people, but I'm glad it worked for you. I tried IF and OMAD but I found myself just using it as a justification to end up straight fasting or continuing on sub 400-500 kcal again \nSadly we live in a society where highly processed, calorie dense foods are available at every corner, so as much as I'd love to be able to trust intuitive eating.. Well, I was obese before I was underweight for a reason, right? \n\nSorry for the tangent I just found your comment interesting.",
          "created_utc": 1564819426.0
        },
        {
          "id": "evvchfr",
          "author": "None",
          "body": "I personally try to eat a lot of protein but I don’t really count macros. Another VERY important thing to eat is omega 3 fats. You want to eat healthy fats so you don’t become constipated.\nMy TDEE is ~1700 so I can’t really eat a lot, which is why intermittent fasting works so well for me. For someone with a TDEE of 3000 it would be a lot harder to eat so much in a short amount of time though. No diet is going to work for everyone obviously but intermittent fasting is a good thing to try out if you have a low TDEE and struggle with hunger a lot like me. Eating only 400-500 calories on intermittent fasting is obviously not recommended because you’ll lose too much muscle. I stick to 1000-1200 calories when I try to lose some weight.",
          "created_utc": 1564831160.0
        }
      ]
    },
    {
      "id": "evura3l",
      "author": "Theo_dore",
      "body": "YES wow we do have a lot in common! I would also start every day on a diet, and end on a binge, feeling like a failure at restricting. I couldn’t see the binge -> restrict cycle at all!\n\nI had a similar timeline, too: about two years. I had a lot of great experiences during those two years, but my disordered eating and misery because of it definitely cast a shadow.\n\nI also don’t think I’ll ever be back to the size I was before! My disordered eating started when I began trying to lose weight, but I realize now that I always had disordered thoughts about my body and my weight.\n\nI’m at a point now where I do want to lose a tiny bit to feel more comfortable and confident, but it’s not worth risking this amazing feeling of enjoying food and not binging. I have no clue how to lose weight in a healthy way anymore. I’ve thought a lot about going to a therapist who specializes in eating disorders. Maybe in the future if I still want to lose weight, I’ll try that!",
      "created_utc": 1564803664.0,
      "score": 6,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        },
        {
          "id": "evumy44",
          "author": "nobodysaynothing",
          "body": "Yes! I also didn't realize all the ways that I was restricting. Overall during that time I was at a surplus (gaining weight), but on a day to day basis, I would start every day off as a diet, like today I'm going to \"be healthy.\" It would last till like 6pm and then I would consume like 800 million calories between 6pm and midnight. If you had asked me at the time, I would have said, are you kidding me? Restricting? I used to restrict but now I can't anymore and my problem is eating too MUCH! \n\nBut it wasn't. My problem was still eating too little during the day. Eating more actually fixed it. (Though I never again got back to the size I was before and thought I wanted to be again.) Eating less (which I attempted literally every single day for two years) just made it worse.\n\nBut yeah, it sounds like our stories are really similar.",
          "created_utc": 1564799863.0
        }
      ]
    },
    {
      "id": "evuggb6",
      "author": "yinneo",
      "body": "That's simply not true. I'm not sure if you've ever suffered from BED, but for a lot of us binge eating  is a coping mechanism to deal with difficult emotions and trauma. It has 0 to do with nutrition or actual physical feelings of hunger. I'm not denying binge eating can appear in recovery from AN because of restriction, but that's not its sole cause. That misses the whole point of BED.",
      "created_utc": 1564794579.0,
      "score": 6,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        },
        {
          "id": "evuekqo",
          "author": "yinneo",
          "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
          "created_utc": 1564793072.0
        },
        {
          "id": "evuez3g",
          "author": "KingGarem",
          "body": "I mean the guy above me explains it very well. Restriction is the root so pretty much go all in and you’re body will back off.",
          "created_utc": 1564793386.0
        }
      ]
    },
    {
      "id": "evxrp3k",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564904425.0,
      "score": 2,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        },
        {
          "id": "evuekqo",
          "author": "yinneo",
          "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
          "created_utc": 1564793072.0
        },
        {
          "id": "evuez3g",
          "author": "KingGarem",
          "body": "I mean the guy above me explains it very well. Restriction is the root so pretty much go all in and you’re body will back off.",
          "created_utc": 1564793386.0
        }
      ]
    },
    {
      "id": "ew0p5ws",
      "author": "ChristySueBarnes",
      "body": "Good for you.",
      "created_utc": 1565000190.0,
      "score": 3,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        },
        {
          "id": "evxr8g8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564903805.0
        },
        {
          "id": "evy7aif",
          "author": "ChristySueBarnes",
          "body": "This came from Tabitha Farrar. She is a recovered anorexic. She has a lot of YouTube videos and has written many books. I liked it. She is in no way promoting obesity. She by no means encourages gorging or a “pig diet”. YOU can eat anyway you like for “fucks sake” as you put it.",
          "created_utc": 1564924856.0
        },
        {
          "id": "ew09v2z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564980455.0
        }
      ]
    },
    {
      "id": "evw3gay",
      "author": "None",
      "body": "I give it as advice to people who struggle with hunger while eating maintenance. Not to people who have an ongoing struggle with anorexia. Like I said, anorexia isn't the only eating disorder that exists. Are people with other eating disorders not allowed here?",
      "created_utc": 1564854161.0,
      "score": 1,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        },
        {
          "id": "evvow4z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564843467.0
        },
        {
          "id": "evvs1ot",
          "author": "nobodysaynothing",
          "body": "This is psueudo science BS. I'm sorry to say it, you seem like a nice person. But all that IF stuff is the biggest load of disordered crap I've ever heard. If it's working for you, great, more power to you. But you are not going to convince me that intermittent fasting is ok advice for eating disorder recovery.",
          "created_utc": 1564845877.0
        }
      ]
    },
    {
      "id": "evw8m58",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564857868.0,
      "score": -2,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        },
        {
          "id": "evvow4z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564843467.0
        },
        {
          "id": "evvs1ot",
          "author": "nobodysaynothing",
          "body": "This is psueudo science BS. I'm sorry to say it, you seem like a nice person. But all that IF stuff is the biggest load of disordered crap I've ever heard. If it's working for you, great, more power to you. But you are not going to convince me that intermittent fasting is ok advice for eating disorder recovery.",
          "created_utc": 1564845877.0
        }
      ]
    },
    {
      "id": "evvppnc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564844087.0,
      "score": -2,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evv4ssp",
          "author": "Recoveryviacoffee",
          "body": "Do you watch your macros or is it purely calorie control? I find hitting my TDEE hell (and it can be quite high from 5x HIIT) because I bloat and distend like hell, so I end up always falling short the other days (I have loose skin and I feel like I look obese when I bloat because it swells like fat) and ultimately started losing weight again - mind you, far slower than before, but 8/9kg within 4 months when it's unintentional and within a healthy BMI is ..oops. My kidneys failed so not been to the gym for a few weeks but I debated cutting the exercise back.\n\nAlso, one thing is something like a leptin resistance could mean someone could eat thousands of thousands of calories and not feel full. There can be a lack of a physical feeling of fullness, so one's stomach is incredibly swollen with food but they are able to continue to eat. I think IF can be a dangerous road for some people, but I'm glad it worked for you. I tried IF and OMAD but I found myself just using it as a justification to end up straight fasting or continuing on sub 400-500 kcal again \nSadly we live in a society where highly processed, calorie dense foods are available at every corner, so as much as I'd love to be able to trust intuitive eating.. Well, I was obese before I was underweight for a reason, right? \n\nSorry for the tangent I just found your comment interesting.",
          "created_utc": 1564819426.0
        },
        {
          "id": "evvchfr",
          "author": "None",
          "body": "I personally try to eat a lot of protein but I don’t really count macros. Another VERY important thing to eat is omega 3 fats. You want to eat healthy fats so you don’t become constipated.\nMy TDEE is ~1700 so I can’t really eat a lot, which is why intermittent fasting works so well for me. For someone with a TDEE of 3000 it would be a lot harder to eat so much in a short amount of time though. No diet is going to work for everyone obviously but intermittent fasting is a good thing to try out if you have a low TDEE and struggle with hunger a lot like me. Eating only 400-500 calories on intermittent fasting is obviously not recommended because you’ll lose too much muscle. I stick to 1000-1200 calories when I try to lose some weight.",
          "created_utc": 1564831160.0
        },
        {
          "id": "evvelu9",
          "author": "Recoveryviacoffee",
          "body": "I suppose, I struggle with hunger don't get me wrong haha, but my TDEE ((when exercising)) is about 2.5k a day. My problem is, some times I end up being ravenous and fed up with my anorexia and I get sick of the restrictions and rules. End up eating idk say 3.5k and then I see how swollen and distended I am and then fast the day after, even if I had had a bad day before the 3.5k day (say I went 500 -> 3.5k -> 250) which is of course a net deficit. It's like a twisted recovery relapse loop, not binging and purging because I don't do it from a psychological compulsion or even bodily hunger, but more than I know I'm giving into my anorexia and I need to tell it to go fucks itself sometimes. It's like the willpower to fight it just dissipates and then I start back at square 1. (To people who are gonna call 3.5k a binge, A. That's only 1k above my maintenance. B. It happens very rarely, but I go that high at times if I was relapsing hard and sometimes you need a day like that and then you feel a lot freer again and eating 2k feels a bit easier.)",
          "created_utc": 1564833860.0
        }
      ]
    },
    {
      "id": "evxs6ws",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564905096.0,
      "score": -1,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        },
        {
          "id": "evumy44",
          "author": "nobodysaynothing",
          "body": "Yes! I also didn't realize all the ways that I was restricting. Overall during that time I was at a surplus (gaining weight), but on a day to day basis, I would start every day off as a diet, like today I'm going to \"be healthy.\" It would last till like 6pm and then I would consume like 800 million calories between 6pm and midnight. If you had asked me at the time, I would have said, are you kidding me? Restricting? I used to restrict but now I can't anymore and my problem is eating too MUCH! \n\nBut it wasn't. My problem was still eating too little during the day. Eating more actually fixed it. (Though I never again got back to the size I was before and thought I wanted to be again.) Eating less (which I attempted literally every single day for two years) just made it worse.\n\nBut yeah, it sounds like our stories are really similar.",
          "created_utc": 1564799863.0
        },
        {
          "id": "evura3l",
          "author": "Theo_dore",
          "body": "YES wow we do have a lot in common! I would also start every day on a diet, and end on a binge, feeling like a failure at restricting. I couldn’t see the binge -> restrict cycle at all!\n\nI had a similar timeline, too: about two years. I had a lot of great experiences during those two years, but my disordered eating and misery because of it definitely cast a shadow.\n\nI also don’t think I’ll ever be back to the size I was before! My disordered eating started when I began trying to lose weight, but I realize now that I always had disordered thoughts about my body and my weight.\n\nI’m at a point now where I do want to lose a tiny bit to feel more comfortable and confident, but it’s not worth risking this amazing feeling of enjoying food and not binging. I have no clue how to lose weight in a healthy way anymore. I’ve thought a lot about going to a therapist who specializes in eating disorders. Maybe in the future if I still want to lose weight, I’ll try that!",
          "created_utc": 1564803664.0
        }
      ]
    },
    {
      "id": "evy3rta",
      "author": "KingGarem",
      "body": "Sorry to break it to you but people do eat cake and ice cream and donuts. People will also have 3 scoops, two slices of cake, etc. So if you like veggies and fruit by all means go ahead but I’m saying that normal people don’t eat super healthy and they’re fine.",
      "created_utc": 1564921308.0,
      "score": 5,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evu9ka6",
          "author": "KingGarem",
          "body": "Some people are like that. It just means you’re body needs extra nourishing. Also mental hunger is important to respond to. Protein bars are yummy and good. (“One”) makes really good bars and flavors that I enjoy like birthday cake among others. Going up and down is a normal thing too btw so don’t worry too much!",
          "created_utc": 1564789170.0
        },
        {
          "id": "evuekqo",
          "author": "yinneo",
          "body": "If you struggle with emotional binge eating, that's not at all your body needing anything. Why would you encourage that kind of unhealthy coping mechanism? :/ Idk if we understand mental hunger the same way, but I'd say learning to control your urges and address your problems directly is what you should actually do if you binge eat instead of giving in for no reason whatsoever. That sounds like the opposite of a solution to me...",
          "created_utc": 1564793072.0
        },
        {
          "id": "evuez3g",
          "author": "KingGarem",
          "body": "I mean the guy above me explains it very well. Restriction is the root so pretty much go all in and you’re body will back off.",
          "created_utc": 1564793386.0
        },
        {
          "id": "evxrp3k",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564904425.0
        }
      ]
    },
    {
      "id": "ew0xpxw",
      "author": "None",
      "body": "Why do I feel like you’re also a HAES activist...",
      "created_utc": 1565009631.0,
      "score": 0,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        },
        {
          "id": "evxr8g8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564903805.0
        },
        {
          "id": "evy7aif",
          "author": "ChristySueBarnes",
          "body": "This came from Tabitha Farrar. She is a recovered anorexic. She has a lot of YouTube videos and has written many books. I liked it. She is in no way promoting obesity. She by no means encourages gorging or a “pig diet”. YOU can eat anyway you like for “fucks sake” as you put it.",
          "created_utc": 1564924856.0
        },
        {
          "id": "ew09v2z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564980455.0
        },
        {
          "id": "ew0p5ws",
          "author": "ChristySueBarnes",
          "body": "Good for you.",
          "created_utc": 1565000190.0
        }
      ]
    },
    {
      "id": "evwguxc",
      "author": "nobodysaynothing",
      "body": "Look, I think we're just going to have to agree to disagree.",
      "created_utc": 1564863761.0,
      "score": 4,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        },
        {
          "id": "evvow4z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564843467.0
        },
        {
          "id": "evvs1ot",
          "author": "nobodysaynothing",
          "body": "This is psueudo science BS. I'm sorry to say it, you seem like a nice person. But all that IF stuff is the biggest load of disordered crap I've ever heard. If it's working for you, great, more power to you. But you are not going to convince me that intermittent fasting is ok advice for eating disorder recovery.",
          "created_utc": 1564845877.0
        },
        {
          "id": "evw8m58",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564857868.0
        }
      ]
    },
    {
      "id": "evw7c3n",
      "author": "Recoveryviacoffee",
      "body": "Well I was lifting 5x a week and still struggling with not depriving myself. Some weeks would be super 400 all week with -600 burnt with cardio + an hour of lifting 5x a week. I have an incredible amount of loose skin, so even with all that and a bf of 18%, I still look flabby and will unless I get surgery.\n\nAre you suggesting that I'm a binge eater? I'm literally close to being underweight again and was a BMI of 14 at my lowest.",
      "created_utc": 1564856957.0,
      "score": 2,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evv4ssp",
          "author": "Recoveryviacoffee",
          "body": "Do you watch your macros or is it purely calorie control? I find hitting my TDEE hell (and it can be quite high from 5x HIIT) because I bloat and distend like hell, so I end up always falling short the other days (I have loose skin and I feel like I look obese when I bloat because it swells like fat) and ultimately started losing weight again - mind you, far slower than before, but 8/9kg within 4 months when it's unintentional and within a healthy BMI is ..oops. My kidneys failed so not been to the gym for a few weeks but I debated cutting the exercise back.\n\nAlso, one thing is something like a leptin resistance could mean someone could eat thousands of thousands of calories and not feel full. There can be a lack of a physical feeling of fullness, so one's stomach is incredibly swollen with food but they are able to continue to eat. I think IF can be a dangerous road for some people, but I'm glad it worked for you. I tried IF and OMAD but I found myself just using it as a justification to end up straight fasting or continuing on sub 400-500 kcal again \nSadly we live in a society where highly processed, calorie dense foods are available at every corner, so as much as I'd love to be able to trust intuitive eating.. Well, I was obese before I was underweight for a reason, right? \n\nSorry for the tangent I just found your comment interesting.",
          "created_utc": 1564819426.0
        },
        {
          "id": "evvchfr",
          "author": "None",
          "body": "I personally try to eat a lot of protein but I don’t really count macros. Another VERY important thing to eat is omega 3 fats. You want to eat healthy fats so you don’t become constipated.\nMy TDEE is ~1700 so I can’t really eat a lot, which is why intermittent fasting works so well for me. For someone with a TDEE of 3000 it would be a lot harder to eat so much in a short amount of time though. No diet is going to work for everyone obviously but intermittent fasting is a good thing to try out if you have a low TDEE and struggle with hunger a lot like me. Eating only 400-500 calories on intermittent fasting is obviously not recommended because you’ll lose too much muscle. I stick to 1000-1200 calories when I try to lose some weight.",
          "created_utc": 1564831160.0
        },
        {
          "id": "evvelu9",
          "author": "Recoveryviacoffee",
          "body": "I suppose, I struggle with hunger don't get me wrong haha, but my TDEE ((when exercising)) is about 2.5k a day. My problem is, some times I end up being ravenous and fed up with my anorexia and I get sick of the restrictions and rules. End up eating idk say 3.5k and then I see how swollen and distended I am and then fast the day after, even if I had had a bad day before the 3.5k day (say I went 500 -> 3.5k -> 250) which is of course a net deficit. It's like a twisted recovery relapse loop, not binging and purging because I don't do it from a psychological compulsion or even bodily hunger, but more than I know I'm giving into my anorexia and I need to tell it to go fucks itself sometimes. It's like the willpower to fight it just dissipates and then I start back at square 1. (To people who are gonna call 3.5k a binge, A. That's only 1k above my maintenance. B. It happens very rarely, but I go that high at times if I was relapsing hard and sometimes you need a day like that and then you feel a lot freer again and eating 2k feels a bit easier.)",
          "created_utc": 1564833860.0
        },
        {
          "id": "evvppnc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564844087.0
        }
      ]
    },
    {
      "id": "evy16oa",
      "author": "Theo_dore",
      "body": "Thanks for your advice! Maybe I should have explained what I meant a little bit. For me, counting calories isn’t a good thing. It causes me to stress over what I’m eating, it causes me to not enjoy food, and it worsens my disordered eating. The first major step I took in my recovery was ceasing to count calories. \n\nMost eating disorder treatment programs/therapists strongly discourage counting calories. I think your advice is really good for someone who doesn’t have a history of disordered eating! Actually, I think someone wanting to lose weight would benefit a lot from hearing you say that a small deficit is all they need; a lot of people take weight loss too fast!\n\nI know that I need to eat at a calorie deficit to lose weight, but it’s not beneficial for me to count that deficit. People successfully lost weight before calorie counters were available and before they even knew what a calorie was, so I know that it’s doable for me!",
      "created_utc": 1564918203.0,
      "score": 5,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        },
        {
          "id": "evumy44",
          "author": "nobodysaynothing",
          "body": "Yes! I also didn't realize all the ways that I was restricting. Overall during that time I was at a surplus (gaining weight), but on a day to day basis, I would start every day off as a diet, like today I'm going to \"be healthy.\" It would last till like 6pm and then I would consume like 800 million calories between 6pm and midnight. If you had asked me at the time, I would have said, are you kidding me? Restricting? I used to restrict but now I can't anymore and my problem is eating too MUCH! \n\nBut it wasn't. My problem was still eating too little during the day. Eating more actually fixed it. (Though I never again got back to the size I was before and thought I wanted to be again.) Eating less (which I attempted literally every single day for two years) just made it worse.\n\nBut yeah, it sounds like our stories are really similar.",
          "created_utc": 1564799863.0
        },
        {
          "id": "evura3l",
          "author": "Theo_dore",
          "body": "YES wow we do have a lot in common! I would also start every day on a diet, and end on a binge, feeling like a failure at restricting. I couldn’t see the binge -> restrict cycle at all!\n\nI had a similar timeline, too: about two years. I had a lot of great experiences during those two years, but my disordered eating and misery because of it definitely cast a shadow.\n\nI also don’t think I’ll ever be back to the size I was before! My disordered eating started when I began trying to lose weight, but I realize now that I always had disordered thoughts about my body and my weight.\n\nI’m at a point now where I do want to lose a tiny bit to feel more comfortable and confident, but it’s not worth risking this amazing feeling of enjoying food and not binging. I have no clue how to lose weight in a healthy way anymore. I’ve thought a lot about going to a therapist who specializes in eating disorders. Maybe in the future if I still want to lose weight, I’ll try that!",
          "created_utc": 1564803664.0
        },
        {
          "id": "evxs6ws",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564905096.0
        }
      ]
    },
    {
      "id": "ew1fp60",
      "author": "ChristySueBarnes",
      "body": "I find conversing with you not productive. I would like to be more polite, but I have no interest in your views.\nBye!",
      "created_utc": 1565022427.0,
      "score": 5,
      "context": [
        {
          "id": "evvsagx",
          "author": "ChristySueBarnes",
          "body": "Nobody has to give you permission to eat. Eating is messy. That’s okay. \nEat what you want, when you want it, in the quantity that you want it in. Without judgement.\nYour body is the expert here. Listen to it. If your body asks for chocolate donuts and sausages for breakfast that is what you eat. Your body knows what it needs.\nRecovery can be enjoyable. Eating is enjoyable\n-Tabitha Farrar",
          "created_utc": 1564846064.0
        },
        {
          "id": "evxr8g8",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564903805.0
        },
        {
          "id": "evy7aif",
          "author": "ChristySueBarnes",
          "body": "This came from Tabitha Farrar. She is a recovered anorexic. She has a lot of YouTube videos and has written many books. I liked it. She is in no way promoting obesity. She by no means encourages gorging or a “pig diet”. YOU can eat anyway you like for “fucks sake” as you put it.",
          "created_utc": 1564924856.0
        },
        {
          "id": "ew09v2z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564980455.0
        },
        {
          "id": "ew0p5ws",
          "author": "ChristySueBarnes",
          "body": "Good for you.",
          "created_utc": 1565000190.0
        },
        {
          "id": "ew0xpxw",
          "author": "None",
          "body": "Why do I feel like you’re also a HAES activist...",
          "created_utc": 1565009631.0
        }
      ]
    },
    {
      "id": "evwh2ar",
      "author": "None",
      "body": "Could you explain to me why you disagree?",
      "created_utc": 1564863908.0,
      "score": -1,
      "context": [
        {
          "id": "evv420e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564818358.0
        },
        {
          "id": "evvji24",
          "author": "nobodysaynothing",
          "body": "I absolutely 100% do NOT endorse intermittent fasting or any other kind of restriction during eating disorder recovery.\n\nI suggest you post stuff like this on a different sub. There are lots of subs for this sort of thing.",
          "created_utc": 1564838977.0
        },
        {
          "id": "evvow4z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564843467.0
        },
        {
          "id": "evvs1ot",
          "author": "nobodysaynothing",
          "body": "This is psueudo science BS. I'm sorry to say it, you seem like a nice person. But all that IF stuff is the biggest load of disordered crap I've ever heard. If it's working for you, great, more power to you. But you are not going to convince me that intermittent fasting is ok advice for eating disorder recovery.",
          "created_utc": 1564845877.0
        },
        {
          "id": "evw8m58",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564857868.0
        },
        {
          "id": "evwguxc",
          "author": "nobodysaynothing",
          "body": "Look, I think we're just going to have to agree to disagree.",
          "created_utc": 1564863761.0
        }
      ]
    },
    {
      "id": "ew0cgab",
      "author": "None",
      "body": " For me it brought me freedom because I no longer have to have anxiety attacks over thinking I ate too much. It depends on how comfortable you are with not knowing if you eat too much. I personally lose my shit if I eat too much for more than 1-2 days and staying within my maintenance TDEE with the occasional shoot out gives me peace of mind. I also count far from obsessively, I take vague estimates.",
      "created_utc": 1564983160.0,
      "score": 0,
      "context": [
        {
          "id": "evu4gb3",
          "author": "rhymeswithpanda1987",
          "body": "I have the kind of eating disorder where I could eat 4,000 calories and still be hungry.\n\n  \nThis isn't true for emotional eaters, especially people who have a lifetime of yo-yo dieting under their belts--no pun intended.\n\nGoing up and down for years in weight and always controlling what you eat messes with your hunger signals. Put that on top of food addiction, and for a person like me, you cannot trust when you're \"hungry.\" I NEVER can tell the difference between emotional and physical hunger. I'm literally always hungry.",
          "created_utc": 1564785417.0
        },
        {
          "id": "evuakm1",
          "author": "nobodysaynothing",
          "body": "On the one hand, I can definitely see how this advice could be more straightforwardly relevant to folks closer to the \"restrict\" end of the continuum.\n\nOn the other hand...my own experience with binge/restrict cycling completely validates the Tabitha Farrar/Christy Harrington type view that restriction is what causes binging. I've lived the fact that the only thing that ever finally straightened out my hunger signals was eating a massive amount of food for several years without trying not to gain weight (and in fact, I gained substantial weight). Before that, I was a hot-mess depraved food goblin. I probably could have been diagnosed with BED at that time...but eating was exactly what I needed to do, even though I wasn't at a \"low weight\" anymore.\n\nI also think the binge/restrict distinction is somewhat of a false dichotomy. Because I truly believe that restriction causes binging. I think it's extremely rare to restrict long-term without engaging in some form of \"binging\" (restorative eating).\n\nThat said, I'm not on here to shoehorn my experiences on to anyone else if they don't fit. Only you can judge whether the view I'm presenting makes sense to you in your life.",
          "created_utc": 1564789945.0
        },
        {
          "id": "evuhur2",
          "author": "Theo_dore",
          "body": "This is what my personal experience felt like! I don't know what it's like for other people, but I also thought that my hunger signals were so fucked up from binging. It turned out that they were actually fucked up from restricting. I usually didn't even realize that I was restricting, so I thought all I had was a binge eating disorder. My disordered thoughts stopped me from seeing how I was restricting (skipping breakfast, taking long walks or runs, using low-cal ingredients, small portions, trying to compensate for binges by eating less)\n\nAfter a few weeks of eating intuitively (aka eating a shit ton more than I thought I should eat), my hunger signals started coming back. I started to feel full when I ate. After two months, I was even able to leave food on my plate when I felt full (whaaaaaat?!?!). \n\nIt's been a few more months now, and I'm seeing what you wrote in my own life--sometimes you just need more food! Your body doesn't burn the same number of calories every day. I ate more tonight than I thought I would; even when my stomach felt full, my mind wanted more food. So I ate it! Not a binge, not a pack of oreos, just more of what I'd made for dinner. I've noticed that if I deny myself the extra food over and over again, I will eventually have a mini-binge (nothing like my huge binges before started doing intuitive eating, though).\n\nThank you for posting this! It was very validating for me to read. I struggle with intuitive eating sometimes (occasionally I reeaaalllly want to go back to counting calories), but reading this helped me see that I *am* doing the right thing, even if I'm gaining weight or not feeling confident in my diet.",
          "created_utc": 1564795709.0
        },
        {
          "id": "evumy44",
          "author": "nobodysaynothing",
          "body": "Yes! I also didn't realize all the ways that I was restricting. Overall during that time I was at a surplus (gaining weight), but on a day to day basis, I would start every day off as a diet, like today I'm going to \"be healthy.\" It would last till like 6pm and then I would consume like 800 million calories between 6pm and midnight. If you had asked me at the time, I would have said, are you kidding me? Restricting? I used to restrict but now I can't anymore and my problem is eating too MUCH! \n\nBut it wasn't. My problem was still eating too little during the day. Eating more actually fixed it. (Though I never again got back to the size I was before and thought I wanted to be again.) Eating less (which I attempted literally every single day for two years) just made it worse.\n\nBut yeah, it sounds like our stories are really similar.",
          "created_utc": 1564799863.0
        },
        {
          "id": "evura3l",
          "author": "Theo_dore",
          "body": "YES wow we do have a lot in common! I would also start every day on a diet, and end on a binge, feeling like a failure at restricting. I couldn’t see the binge -> restrict cycle at all!\n\nI had a similar timeline, too: about two years. I had a lot of great experiences during those two years, but my disordered eating and misery because of it definitely cast a shadow.\n\nI also don’t think I’ll ever be back to the size I was before! My disordered eating started when I began trying to lose weight, but I realize now that I always had disordered thoughts about my body and my weight.\n\nI’m at a point now where I do want to lose a tiny bit to feel more comfortable and confident, but it’s not worth risking this amazing feeling of enjoying food and not binging. I have no clue how to lose weight in a healthy way anymore. I’ve thought a lot about going to a therapist who specializes in eating disorders. Maybe in the future if I still want to lose weight, I’ll try that!",
          "created_utc": 1564803664.0
        },
        {
          "id": "evxs6ws",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564905096.0
        },
        {
          "id": "evy16oa",
          "author": "Theo_dore",
          "body": "Thanks for your advice! Maybe I should have explained what I meant a little bit. For me, counting calories isn’t a good thing. It causes me to stress over what I’m eating, it causes me to not enjoy food, and it worsens my disordered eating. The first major step I took in my recovery was ceasing to count calories. \n\nMost eating disorder treatment programs/therapists strongly discourage counting calories. I think your advice is really good for someone who doesn’t have a history of disordered eating! Actually, I think someone wanting to lose weight would benefit a lot from hearing you say that a small deficit is all they need; a lot of people take weight loss too fast!\n\nI know that I need to eat at a calorie deficit to lose weight, but it’s not beneficial for me to count that deficit. People successfully lost weight before calorie counters were available and before they even knew what a calorie was, so I know that it’s doable for me!",
          "created_utc": 1564918203.0
        }
      ]
    }
  ]
}