{
  "id": "cn5rpt",
  "subreddit": "fuckeatingdisorders",
  "author": "xxjage",
  "created_utc": 1565184371.0,
  "title": "What helped me recover and stay recovered",
  "selftext": "I’ve only been in recovery for a couple months but it’s the first time after a couple of quasi attempts that I’ve actually stuck to it and now feel like it was the absolute right thing to do. I want other people to experience the amazing things I have since being in recovery. so here are some things that helped me in my restrictive eating. feel free to add things that helped you!\n\n1. Have a routine. This helps especially in the beginning. Follow your meal plan. Eat 3 times a day with 2 snacks even if you’re not hungry. You need it. \n2. Everything uncomfortable  is temporary and it will pass. You will feel insanely bloated. Your stomach will distend. The first few days or weeks in recovery may feel worse than when you are restricting but that will pass. Trust me, I was getting such awful headaches which passed after about a week and a half. Bloating may take a little longer but it will go down, your digestive system needs to get used to eating a regular amount of food after being inactive for so long. \n3. Baggy clothes are everything. I’m recovering in summer so while everyone is walking around in skimpy tanks and shorts, I wear my mom jeans and hoodies. Wear what makes you feel comfortable and you’ll feel so much better. \n4. Take time for yourself. I spent pretty much all summer with my dog and learning how to cook before I go out to university. I now have the energy to go out on huge hiking trips with my dog and run around with her without worrying about the calories I am burning and feeling like I have to sit down every couple hundred steps. Find something you love to do, try new things, do things to distract yourself from your healing body.\n5. Learn to forgive yourself. Forgive yourself for the damage you’ve done to your body, your relationships, your past. Allow yourself to heal and begin to open up and let love and happiness into your life. Start your day with those hearty pancakes you had as a kid that remind you of the best Sundays you had as a child. Or maybe do some yoga to get more in tune  with your amazing body. Forgive, let go and live. \n6. Take risks. Challenge yourself with your fear foods or do something you never thought you would ever do. In my first few days in recovery, I was feeling so down but then just spontaneously decided to get a nose piercing and holy I can’t even describe to you how quickly my mood changed. I remembered this when I finally had beaten my fear of liquid calories and had a freaking milkshake that I was craving for so long. It was amazing and guess what, now having had it after years, I now no longer crave it or even feel an incline to get it again, \n7. Set point is real. Your body is smarter than you think and will not gain an absurd amount in recovery. It will recover to a healthy point that your body needs to be at and it will maintain. You will at first gain more than your set point due to bloating and weight distribution but if you continue with recovery than you will return to your set point in no time. \n8. Recognize your disordered eating habits and work to break them. Stop body checking and get rid of the scale. Let go of exercise for a little while. Don’t chop up your food into tiny little parts and don’t just pick the low calorie food options. Only way to recover is to go all in to it.\n9. Don’t try to intuitively eat until you can actually recognize your hunger and fullness cues. I’ve tried to get off my meal plan several times due to fear of gaining too much weight and intuitively eat. The thing is I can’t do that just yet because I’ve damaged my body for too long and those signals haven’t returned just yet. I have to let my body to do its thing and let it trust me. Each time I try to intuitively eat, I stall my recovery. I’ve come to terms that I need to continue to work the program and trust my body will return to normal in time. \n10. Remember your negative times in your eating disorder. The times you fainted, refused to hang out with friends, and when you were so light headed and unfocused that you couldn’t finish that test in the class you used to be so good at. Now remember the positive times in recovery, the energy racing through your bones that you haven’t felt in months, being able to keep up with your dog or being able to go out to a dinner with your friends. Your worst days in recovery will always beat out your best day with your eating disorder. \n11. Your eating disorder thoughts are not your thoughts. Fight them and challenge them. Replace them with happier, more positive thoughts. Recognize them for what they are, a compilation of unrealistic ideals brought on from social media and disgusting cultural expectations.\n\nPlease add on to what helps you recover. I’m still having to constantly choose recovery and it is still extremely difficult. It really helps to know that there are so many people out there going through the same thing. Recovery doesn’t come easy but nothing good or worth having ever does. I think about that every day when things start to get hard.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cn5rpt/what_helped_me_recover_and_stay_recovered/",
  "score": 86,
  "num_comments": 12,
  "comments": [
    {
      "id": "ew7in38",
      "author": "nicolecherryb",
      "body": "Thank you for this!",
      "created_utc": 1565192415.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ew7vgjn",
      "author": "ElfjeTinkerBell",
      "body": "As an addition to number 11: for me it helped tremendously to literally separate my eating disorder from myself in how I speak. I have given my eating disorder an identity.\n\nInstead of saying \"I don't want dessert\" I now say \"Miss eating disorder wants me to restrict\". From there I can analyze what I think of that.\n\nSometimes I agree with her. In those cases, I still make the decision myself. Most of the time however, I do not agree with her. I then acknowledge her opinion just like I acknowledge there are people who like to watch tennis for fun - it's allowed to be there, it's the truth, there's nothing inherently wrong with it, I'm not going to try to change it, but I don't agree. And I'll do what I want (we're talking food here of course, I'm not about to hurt anyone).",
      "created_utc": 1565197992.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ew7yfpg",
      "author": "forestfairy23",
      "body": "This is absolutely amazing. Thank you so much for sharing and writing all of these. My biggest tip for people in recovery is to remember that every single time you say no to your eating disorder, it losses power. Say no as much as you can ❤️",
      "created_utc": 1565199709.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ew9p9nx",
      "author": "sintos-compa",
      "body": "This is awesome. I’m in the dumps over bloating. This gave me some hope.",
      "created_utc": 1565228927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ew7vcgg",
      "author": "Eva-Lee",
      "body": "This is beautiful <3",
      "created_utc": 1565197925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ew7veun",
      "author": "Auror3413924",
      "body": "Thank you for these tips! There’s not enough upvotes to give for this!",
      "created_utc": 1565197965.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ew7x5p4",
      "author": "vaultdwellermay",
      "body": "Thank you so much for this",
      "created_utc": 1565198992.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ew8r3yf",
      "author": "InNeeedOfSavin",
      "body": "Im struggling with number 9 i have no other issue other then i have no appetite i never get hungry everrr..",
      "created_utc": 1565213893.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewaq6ka",
      "author": "nishikikiyama",
      "body": "“Remember when you were too light headed to finish that test”. This this this this. I failed my teaching exams because I almost passed out getting to the venue and still refused to eat. It costed me $150 and I remember being physically incapable of writing down the answers because I was so out of it.\n\nI adore teaching. I ended up deferring all my other teaching exams to recover. I was so livid at myself - how can I be a role model for future students if I am struggling with ED? My students will be entering puberty, they can’t learn the habits off me. Why am I doing something to myself I don’t want my students to do?\n\nAnd you know what? I thought deferring was stupid. I just thought, maybe I’m a bad teacher. But I ate. And now, looking back at that exam, it’s clicking and I know that if I had eaten I would have aced it.\n\nIt’s important to remember - your future is more important than your eating disorder. If you continue with this habit, you’ll come dangerously close to throwing it away.. or you won’t live to see it.",
      "created_utc": 1565249289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewb7y6f",
      "author": "Little-Rexy",
      "body": "\\*a re-post from an earlier conversation) I find when I start to focus on my disordered behaviors, I buy the craziest of spices.  Like Curry from India, Wes Indies, or [***ethiopia*** ***burberry***](https://www.google.com/search?client=firefox-b-1-d&q=ethiopia+burberry&spell=1&sa=X&ved=0ahUKEwi1-qyv-vfiAhXumuAKHefwD_UQBQgrKAA) , cinnamon, star anise, prickly ash and long pepper. Crushed dried chillies etc....(Amazon).\n\nI  then go on Pinterest and make recipes from all over the world. Most importantly I listen to the traditional music from the country I am cooking- It makes it more immersive! continue to stay strong, your post about recovery is inspiring.",
      "created_utc": 1565261238.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewc0d0b",
      "author": "lily89kitty",
      "body": "Thank you, I don't know what else to say but thank you for this",
      "created_utc": 1565275341.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewc12m0",
      "author": "ThatOnePotential",
      "body": "Thank you so much for writing this out. I do have to say that you are right about recovery being a daily choice, some days more than others. I try to think about it as being committed to over actually *wanting* recovery. Commitment, to me, means I will continue even on the hard days, even when everything around me says no.\n\nI would also add that listening to recovery podcasts and watching recovery YT videos has also been really helpful during difficult times.",
      "created_utc": 1565275782.0,
      "score": 1,
      "context": []
    }
  ]
}