{
  "id": "cnjylt",
  "subreddit": "fuckeatingdisorders",
  "author": "Wigforfire",
  "created_utc": 1565260935.0,
  "title": "The Sudden Realization that its possible to make plans without the input of anorexia",
  "selftext": "Two weeks ago I received a text message from my grandmother who is now visiting from Florida, requesting for me to take a day off of work, not only to spend with her but to spend with her at a dinner theater, to which I gleefully agreed.\n\n\nFor two weeks I have been anticipating my day off, wondering what we’ll see, excited at the prospect that we could possibly be doing something after, and it wasn’t until yesterday morning that it struck me, in a similar situation no less 6 months ago I never would have agreed. When I was in the jaws of anorexia even just the suggestion of changing my routine would have sent me into an anxiety fueled rage accompanied by sorrow. It wouldn’t have been an instant yes! but a begrudged ‘ok’ only after analyzing what would be on the menu to eat and determining whether I had time to exercise before the show and after if my fiance wasnt home yet.... but it wasnt like that, not at all, and after realizing, yeah, the anxiety was there but it was quickly replaced by pride and confidence: ‘I have done it, I have come far, and I will keep going’. \n\n\nIt’s crazy and scary to start but despite everything the anorexia told me about recovery, moments like these, where I realize that I made a challenging dinner without scrutinizing over my snack later, or where I can go out with my favorite people without a second thought, right now they may come few and far between but I know they’ll happen more often and I know that each time they do, if and when I realize I can and will feel pride. Recovery has been the hardest journey I’ve taken, recovery on my own without a program I or therapy seemed impossible, and yet I stand here today, preparing for a day at the theater, feeling more in love with myself, not just for how I look, but for my accomplishments and for how far I’ve come, and I hope that anyone struggling knows that the first steps are clumsy and miserable, they’re scary and they feel huge (because they are) but the peaks on this uphill battle are gorgeous when you reach them, and I can only imagine what the summit will be.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cnjylt/the_sudden_realization_that_its_possible_to_make/",
  "score": 107,
  "num_comments": 7,
  "comments": [
    {
      "id": "ewbixsp",
      "author": "None",
      "body": "❤️❤️❤️❤️❤️❤️❤️",
      "created_utc": 1565267246.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ewbwgdw",
      "author": "Bubbly_Comparison",
      "body": "Congrats :)",
      "created_utc": 1565273377.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewgekh9",
      "author": "darkettecs",
      "body": "‘I have done it, I have come far, and I will keep going’.\n\nThis is such a powerful affirmation! You have definitely come far and I'm proud of you. Years from now you probably won't even remember what you ate or did but the fact that you were able to enjoy quality time with your grandma/loved one. Making memories & living life to the fullest. Keep it up, friend. (And congrats on your engagement :) ) <3",
      "created_utc": 1565380088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewbwzez",
      "author": "Wigforfire",
      "body": "💚💚💚💚💚💚💚",
      "created_utc": 1565273606.0,
      "score": 3,
      "context": [
        {
          "id": "ewbixsp",
          "author": "None",
          "body": "❤️❤️❤️❤️❤️❤️❤️",
          "created_utc": 1565267246.0
        }
      ]
    },
    {
      "id": "ewbwxt9",
      "author": "Wigforfire",
      "body": "Thank you so much!! Its such a relief to be able to have an inkling of a normal life again and its the best I can wish to anyone else",
      "created_utc": 1565273587.0,
      "score": 4,
      "context": [
        {
          "id": "ewbwgdw",
          "author": "Bubbly_Comparison",
          "body": "Congrats :)",
          "created_utc": 1565273377.0
        }
      ]
    },
    {
      "id": "ewgpubv",
      "author": "Wigforfire",
      "body": "Thank you so much for all your kindness!!",
      "created_utc": 1565387520.0,
      "score": 2,
      "context": [
        {
          "id": "ewgekh9",
          "author": "darkettecs",
          "body": "‘I have done it, I have come far, and I will keep going’.\n\nThis is such a powerful affirmation! You have definitely come far and I'm proud of you. Years from now you probably won't even remember what you ate or did but the fact that you were able to enjoy quality time with your grandma/loved one. Making memories & living life to the fullest. Keep it up, friend. (And congrats on your engagement :) ) <3",
          "created_utc": 1565380088.0
        }
      ]
    },
    {
      "id": "ewbwzg3",
      "author": "Bubbly_Comparison",
      "body": "It really is, and it only gets better.",
      "created_utc": 1565273606.0,
      "score": 2,
      "context": [
        {
          "id": "ewbwgdw",
          "author": "Bubbly_Comparison",
          "body": "Congrats :)",
          "created_utc": 1565273377.0
        },
        {
          "id": "ewbwxt9",
          "author": "Wigforfire",
          "body": "Thank you so much!! Its such a relief to be able to have an inkling of a normal life again and its the best I can wish to anyone else",
          "created_utc": 1565273587.0
        }
      ]
    }
  ]
}