{
  "id": "coj83s",
  "subreddit": "fuckeatingdisorders",
  "author": "reddideddi",
  "created_utc": 1565449949.0,
  "title": "I just ate a Boston cream donut",
  "selftext": "I won’t say that I don’t feel bad at all because that would be a lie but I’m proud of myself for standing my ground against my ed while waiting in the queue. \nI’m currently trying to eat just normally again without these periods of undereating and overeating. I honestly have no idea how much food my body needs because I sadly got out of touch with my feeling of satiety again so I now mostly eat according to a meal plan. But today I decided to eat freely. My ed basically now can sneak in wherever it wants and already made me feel like I already ate way too much for breakfast and I can’t really estimate if I did so but I stood my grounds against potential undereating and got this donut! I am beautiful the way I am!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/coj83s/i_just_ate_a_boston_cream_donut/",
  "score": 96,
  "num_comments": 7,
  "comments": [
    {
      "id": "ewirq33",
      "author": "evathebeaver33",
      "body": "Woo Woo! You goooo! Relate to this heavy! It really helped me out to eat whatever and like......... you don't explode on weight, I'm actually lookin' hella good and eating more of what I want than ever",
      "created_utc": 1565455460.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ewjg3uu",
      "author": "ezer13",
      "body": "Yessss so proud of you!! One step closer to food freedom! Eating freely is scary at first, but it becomes easier and easier the more you stand up against those disordered thoughts. Congrats!!",
      "created_utc": 1565466140.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewjowtx",
      "author": "None",
      "body": "Hell yeah!! That's awesome ❤",
      "created_utc": 1565469841.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewkec5g",
      "author": "Boosey0910",
      "body": "Good job.  It's a donut. Not bad or good. It's a donut.",
      "created_utc": 1565482194.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewm87dn",
      "author": "ramentobi",
      "body": "Fuck yeah!! I understand how hard it can be to eat something like a donut. But it was delicious. And you enjoyed it - hang on to that feeling!! \n\nYou’re a person. You deserve to enjoy delicious food, including donuts, just like anybody else. Your ED might disagree. But it was delicious and that’s a wonderful thing!!",
      "created_utc": 1565545444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewka04z",
      "author": "reddideddi",
      "body": "I gotta get used to that fact too haha :)",
      "created_utc": 1565479055.0,
      "score": 2,
      "context": [
        {
          "id": "ewirq33",
          "author": "evathebeaver33",
          "body": "Woo Woo! You goooo! Relate to this heavy! It really helped me out to eat whatever and like......... you don't explode on weight, I'm actually lookin' hella good and eating more of what I want than ever",
          "created_utc": 1565455460.0
        }
      ]
    },
    {
      "id": "ewo52lz",
      "author": "reddideddi",
      "body": "Oh my... this sounds so simple but lately I’ve stopped thinking about it that way. You shouldn’t say that food is either universally good or bad. It’s good if it makes you feel good but I’ll have to learn to listen to my body again. Thank you for bringing me back to that thought :)",
      "created_utc": 1565606160.0,
      "score": 1,
      "context": [
        {
          "id": "ewkec5g",
          "author": "Boosey0910",
          "body": "Good job.  It's a donut. Not bad or good. It's a donut.",
          "created_utc": 1565482194.0
        }
      ]
    }
  ]
}