{
  "id": "couuru",
  "subreddit": "fuckeatingdisorders",
  "author": "evacia",
  "created_utc": 1565516406.0,
  "title": "GLOW trigger warning in episode 3",
  "selftext": "hey guys. there’s a new season of GLOW out on Netflix and it tackles some hard questions in it. i’m only on episode 3, and there may be more down the line, but there’s a major trigger in it. \n\nLIGHT SPOILERS & TRIGGER WARNING:\none of the main characters was exercising a lot. it was implied that she was skipping out of almost every (if not *actually* every) opportunity to eat either on her own or with her friends. in episode 3, one of her friends notices and sits her down in the hotel kitchen to enjoy a cheeseburger and a milkshake while bonding. the character struggling confessed that ever since she was 14, she realised that she’d only get noticed for her body so she better make it a good one. after this scene, she goes upstairs to her room and purges. \n\ni cried during this scene bc even tho i kinda thought it was headed in that direction, i didn’t think it would go that far. her purging happens off screen but you can still hear it and you see her afterwards. the song “disorder” by Joy Division plays during that. \n\ni just wanted to give you guys a heads up. you may not even watch the show but it kinda came out of left field so i wanted to make sure everyone stays safe out there. lots of love xx",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/couuru/glow_trigger_warning_in_episode_3/",
  "score": 100,
  "num_comments": 4,
  "comments": [
    {
      "id": "ewlf343",
      "author": "None",
      "body": "thanks for telling us 💙",
      "created_utc": 1565521174.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ewmboos",
      "author": "hardhatraza",
      "body": "Gosh this scene hit me so hard. It was brutal to watch since that’s something I used to do all the damn time.",
      "created_utc": 1565547793.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ewmfmpx",
      "author": "toritxtornado",
      "body": "thank you! i just finished the first ep of the new season. i’ll still watch but it’s really good to have a heads up.",
      "created_utc": 1565550487.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ewnajzm",
      "author": "bluebandicute",
      "body": "I was totally blindsided by that whole episode! It’s a good idea to post it here. I didn’t even think about it!",
      "created_utc": 1565572988.0,
      "score": 2,
      "context": []
    }
  ]
}