{
  "id": "cpth7j",
  "subreddit": "fuckeatingdisorders",
  "author": "nishikikiyama",
  "created_utc": 1565704524.0,
  "title": "From people complaining you don't eat enough to complaining you ate 'too much' of something in recovery..",
  "selftext": "I dropped to an insanely low weight. The number doesn't matter - the only thing that matters is I was surely on my way to an early grave.\n\nI began to eat again. I'm still in recovery, I'm still battling the dreadful thoughts and I've only been in the fight for 4-5 weeks. I went from one sandwich a day to lunch and a dinner + pickles as snacks. Pretty good, better than nothing. I still can't eat certain foods, in fact, many things are still off limits for me.\n\nI did develop a strong love for... well, carrots! I love carrots! I could eat them endlessly. They became a staple in my diet, sometimes consuming 1-2 carrots a day and using them to snack. I'd use them as a base for my fear foods. Hummus? Have it on a carrot! Smoothie? Chuck in some carrot! I absolutely love them raw.\n\nMy brain screams at me. \"You're fat, you're morbidly obese, congrats!\". It repeats that, every single bite of the carrot I take. However, I continue.\n\nMy family has started complaining I'm costing them too much on carrots, that they just bought me some, I'm eating them too fast! Well, yeah, I've been starving myself to an almost fatal extent for the past... year and a half? A girl is hungry.\n\nBut every time they make that comment, the passive \"oh, we're out of carrots AGAIN...\" or \"didn't I just buy you those?\"... it kills me. It kills me so bad. It feeds my anorexia, it makes me feel like a fake anorexic. Like all my experiences are invalidated because I ate two carrots as a snack + lunch and dinner.\n\nIf I ask them to stop, I get in trouble. I don't want to stop eating my carrots, I don't want to restrict anymore. But it's making me feel like I need to. Like everyone forgot I was in hospital with bradycardia after not eating this time last month, like I'm so fat from these carrots, like I'm just a nuisance.\n\nFunny thing is, they wanted to get a milkshake with me tomorrow right after complaining about my carrot addiction. They also do this with capsicums and pickles. Anything I feel comfy eating in large amounts... they don't even eat capsicum, carrots or pickles.\n\nI'm tempted to start buying my own carrot stash, honestly. I hate how these comments spoonfeed my body dysmorphia and anorexia. I can't function, really. Maybe I was never truly anorexic, seeing that I feel mildly okay downing carrots like they're water.\n\nCarrots, man.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cpth7j/from_people_complaining_you_dont_eat_enough_to/",
  "score": 93,
  "num_comments": 18,
  "comments": [
    {
      "id": "ewrihh4",
      "author": "a_farewell",
      "body": "Wow. Your family sounds, uh...well, I’ll reserve my judgement.\n\nFirst, I’m really proud of you for working so hard to recover. Second, I know you know this, but it bears repeating: we can’t choose our safe foods. And you know that vegetables have basically zero calories. Considering that they’re shaming you for eating veg then asked if you wanted to get milkshakes...I think sometimes you have to accept (and remind yourself) that they’re speaking on things they don’t understand. Your struggle is valid no matter what stage of this you’re in!",
      "created_utc": 1565706253.0,
      "score": 41,
      "context": []
    },
    {
      "id": "ewrjmeu",
      "author": "Wigforfire",
      "body": "First off, here are some internet hugs for you, not only for what you're going through but for support in how far you are coming! The fact that you can sit here and write out that you don't want to restrict anymore, and the fact that you're battling through all of this by finding ways to make yourself more comfortable with your fear foods is phenomenal and you deserve so much support and congratulations on doing it!\n\n&#x200B;\n\nSecond off, I know how hard it is to deal with family and to have people who don't understand what it's like to be in the situations we're in, and although I wouldn't wish these issues on anyone else, I wish that my family or friends could know, just a small amount, how much the things they say and do affect our perception of ourselves. Please just know that you are NOT doing anything wrong, you are NOT eating too much, what you are doing is fighting and getting stronger, you are repairing your heart and your brain, you are growing your muscles again. You are doing exactly the right things and even if it's hard for your family to see that, you know deep down that what you're doing is right, you know that despite the ED voice in your head you are walking yourself into a better life, so you eat those carrots!! Keep dipping them in things that scare you, keep mixing them into things, because carrots are your weapon of ED destruction and rightfully so you need to arm yourself with them!! Please keep fighting for yourself and please keep up your hard work, because even if your family doesn't understand, we do and we know you are doing great",
      "created_utc": 1565707027.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ewrnamo",
      "author": "None",
      "body": "buy the carrots 🧡 you don’t ever need to restrict anymore.",
      "created_utc": 1565709443.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ewrzvm1",
      "author": "absolutenobodyy",
      "body": "I eat so many carrots my hands turned orange. But at least we're eating. Heck with everyone's opinions. Your health and recovery comes first.",
      "created_utc": 1565717312.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ewrtpol",
      "author": "reavers-reapers",
      "body": "Yo fuck 'em. My family's like that, I can't tell you how many times I heard \"you ate ALL of it!?!\" the past few weeks. Uh yeah bitch, I ate all of it. You're not gonna tell me what to eat or how much of it. \n\nDon't let their assholishness make you feel a certain type of way. Clearly they're only thinking of themselves and how THEY are affected when they make such comments. You did a good thing by reaching out and talking about it. You're doing better, keep it up. ♡",
      "created_utc": 1565713549.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ewtjn2k",
      "author": "auamethyst",
      "body": "WTF. That is the strangest story. Who the fuck shames a person for eating a lot of carrots? A very cheap and nutritious food? \nI don’t know if it makes you feel any better, but if you like carrots eat those carrots and tell your family to fuck off!",
      "created_utc": 1565746726.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ewu04xd",
      "author": "None",
      "body": "I can't understand what's going on in your family's head... Carrots are so good and a great snack. I love them raw too. I usually eat around 1kg a week without even counting the weekend. Please, do not restrict and continue with carrots. If you have to buy them yourself, feel free to do it so they really can't fucking complain. \n\nCarrots are dirt cheap too. You could buy like 5 or 6 kg of carrots with what 1 milkshake costs so really your family is the problem there.",
      "created_utc": 1565759315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewu44av",
      "author": "aceshighsays",
      "body": "Your family sounds a lot like mine. I try to not see them often. The both of them have this magic gift of ruining days and days of my life after I see them. My condolences.",
      "created_utc": 1565763602.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewwp1gt",
      "author": "None",
      "body": "Ignore them. Keep doing it. If they say stupid stuff like that, reply with \"yup! Outta carrots again. Glad you noticed!\" \"Yep I'm a burden when I'm healthy, that's why I stopped eating til I almost died.\" It kinda points out their stupid complaining and indirectly shows them how they \"feed\" your unwellness. As hard as it is, stand up to them. Fight for your life. You are worth more than fucking carrots!! Good luck!! You're WORTHY of health. Stick it to them. It will help you!!!",
      "created_utc": 1565831893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewrj8qu",
      "author": "nishikikiyama",
      "body": "Thank you so much!\n\nMy lovely sister (who lives out of home) told me \"they don't mean any harm, sometimes they don't even think before they speak. Don't let it get to you\". She told me how her fiance complains that she eats so much bread! He isn't calling her fat, he's just making a bit of a comment - and in the end, she continues to eat heaps of bread because she loves it. I think that's a good way to look at it! My sister survived anorexia herself, so when I complain to her, I can see the cogs working in her brain. However, the rest of my family has no experience with ED.\n\nI really do love carrots! Pickles and capsicum, too. I snack on them throughout the day. I try to hide it sometimes from my family, though. But a safe food is a safe food - I shouldn't rip it away. I also love bananas and apple, but I can't eat them in the amounts of carrots I do.\n\nIt feels so reassuring to hear that my struggles are valid and that a carrot doesn't throw away a year and a half of battles. It's such a weird feeling - to get a grip on what you're doing and take back control, but to second guess yourself like, \"did I ever lose control in the first place?\". ED is weird like that.\n\nYou're so sweet. Thank you!",
      "created_utc": 1565706766.0,
      "score": 14,
      "context": [
        {
          "id": "ewrihh4",
          "author": "a_farewell",
          "body": "Wow. Your family sounds, uh...well, I’ll reserve my judgement.\n\nFirst, I’m really proud of you for working so hard to recover. Second, I know you know this, but it bears repeating: we can’t choose our safe foods. And you know that vegetables have basically zero calories. Considering that they’re shaming you for eating veg then asked if you wanted to get milkshakes...I think sometimes you have to accept (and remind yourself) that they’re speaking on things they don’t understand. Your struggle is valid no matter what stage of this you’re in!",
          "created_utc": 1565706253.0
        }
      ]
    },
    {
      "id": "ewrk9j2",
      "author": "nishikikiyama",
      "body": "Maybe I'm tired, or that it is quite late, but I actually teared up reading this. The line on carrots being a weapon in my arsenal to destroy ED really, really touched my heart and made me feel better about things. I ate two whole carrots today, I felt... awful! But reading that really helped.\n\nI'll keep dipping them in things. Even chocolate, believe it or not! Carrots are truly able to best anything (and taste great while I'm at it). I agree wholeheartedly. I wouldn't wish anorexia on my worst enemy, but I wouldn't mind people popping on a VR headset and living a day in my shoes. The days of restriction, fatigue and pain. That would make so many people realise that recovery is beyond 'sitting down and eating' and make them check their words just a bit closer...\n\nI'm honestly so touched by this heartfelt message. Thank you so much - I'll repeat that mantra of carrots being my weapon in this fight whenever I hear a comment!",
      "created_utc": 1565707458.0,
      "score": 7,
      "context": [
        {
          "id": "ewrjmeu",
          "author": "Wigforfire",
          "body": "First off, here are some internet hugs for you, not only for what you're going through but for support in how far you are coming! The fact that you can sit here and write out that you don't want to restrict anymore, and the fact that you're battling through all of this by finding ways to make yourself more comfortable with your fear foods is phenomenal and you deserve so much support and congratulations on doing it!\n\n&#x200B;\n\nSecond off, I know how hard it is to deal with family and to have people who don't understand what it's like to be in the situations we're in, and although I wouldn't wish these issues on anyone else, I wish that my family or friends could know, just a small amount, how much the things they say and do affect our perception of ourselves. Please just know that you are NOT doing anything wrong, you are NOT eating too much, what you are doing is fighting and getting stronger, you are repairing your heart and your brain, you are growing your muscles again. You are doing exactly the right things and even if it's hard for your family to see that, you know deep down that what you're doing is right, you know that despite the ED voice in your head you are walking yourself into a better life, so you eat those carrots!! Keep dipping them in things that scare you, keep mixing them into things, because carrots are your weapon of ED destruction and rightfully so you need to arm yourself with them!! Please keep fighting for yourself and please keep up your hard work, because even if your family doesn't understand, we do and we know you are doing great",
          "created_utc": 1565707027.0
        }
      ]
    },
    {
      "id": "ex5kfr3",
      "author": "nishikikiyama",
      "body": "This is so reassuring. Thank you! I bought three carrots today! Stocking up. ;)",
      "created_utc": 1566025787.0,
      "score": 1,
      "context": [
        {
          "id": "ewrnamo",
          "author": "None",
          "body": "buy the carrots 🧡 you don’t ever need to restrict anymore.",
          "created_utc": 1565709443.0
        }
      ]
    },
    {
      "id": "eww2aqn",
      "author": "problematicbeing",
      "body": "Lol i had my feet turn orange for like a year when I was eating a bowl of carrots everyday. I got mad teased by my friends cause I was like 12(pre-ED, just loved some carrots and salad dressing)",
      "created_utc": 1565818942.0,
      "score": 2,
      "context": [
        {
          "id": "ewrzvm1",
          "author": "absolutenobodyy",
          "body": "I eat so many carrots my hands turned orange. But at least we're eating. Heck with everyone's opinions. Your health and recovery comes first.",
          "created_utc": 1565717312.0
        }
      ]
    },
    {
      "id": "ex5khul",
      "author": "nishikikiyama",
      "body": "Haha, my friends sometimes joke I'm a ginger because the amount of carrots I eat show in my hair! Carrots are a gift from the heavens, honestly.",
      "created_utc": 1566025821.0,
      "score": 1,
      "context": [
        {
          "id": "ewrzvm1",
          "author": "absolutenobodyy",
          "body": "I eat so many carrots my hands turned orange. But at least we're eating. Heck with everyone's opinions. Your health and recovery comes first.",
          "created_utc": 1565717312.0
        }
      ]
    },
    {
      "id": "ex5kjsy",
      "author": "nishikikiyama",
      "body": "Yes!! I love your kick ass attitude! Hell yeah, I ate all of it. Tasted good, too.\n\nIt feels good to get it off my chest. This subreddit has so much kind and wholesome advice.",
      "created_utc": 1566025857.0,
      "score": 2,
      "context": [
        {
          "id": "ewrtpol",
          "author": "reavers-reapers",
          "body": "Yo fuck 'em. My family's like that, I can't tell you how many times I heard \"you ate ALL of it!?!\" the past few weeks. Uh yeah bitch, I ate all of it. You're not gonna tell me what to eat or how much of it. \n\nDon't let their assholishness make you feel a certain type of way. Clearly they're only thinking of themselves and how THEY are affected when they make such comments. You did a good thing by reaching out and talking about it. You're doing better, keep it up. ♡",
          "created_utc": 1565713549.0
        }
      ]
    },
    {
      "id": "ex5nuh6",
      "author": "nishikikiyama",
      "body": "Yeah, it honestly was really odd. Thankfully, they've toned down the comments, but I was really shocked! I'll stay strong, thank you!",
      "created_utc": 1566027967.0,
      "score": 1,
      "context": [
        {
          "id": "ewtjn2k",
          "author": "auamethyst",
          "body": "WTF. That is the strangest story. Who the fuck shames a person for eating a lot of carrots? A very cheap and nutritious food? \nI don’t know if it makes you feel any better, but if you like carrots eat those carrots and tell your family to fuck off!",
          "created_utc": 1565746726.0
        }
      ]
    },
    {
      "id": "ewsm4ho",
      "author": "laetitiabranchi",
      "body": "I am so extremely proud of you. Maybe it helps to look at it like a science projekt: how did i let commentd like those in my head, while they mean nothing to normal people.\n\ni am astonished every time my family talks about  me and them being fag while eating freshlx homebaked cake. they dont want me to purge, and they dont want me to not eat cake, or not eat. \nthey just dont really think about it.\n\nstay strong, you are awesome",
      "created_utc": 1565730378.0,
      "score": 1,
      "context": [
        {
          "id": "ewrihh4",
          "author": "a_farewell",
          "body": "Wow. Your family sounds, uh...well, I’ll reserve my judgement.\n\nFirst, I’m really proud of you for working so hard to recover. Second, I know you know this, but it bears repeating: we can’t choose our safe foods. And you know that vegetables have basically zero calories. Considering that they’re shaming you for eating veg then asked if you wanted to get milkshakes...I think sometimes you have to accept (and remind yourself) that they’re speaking on things they don’t understand. Your struggle is valid no matter what stage of this you’re in!",
          "created_utc": 1565706253.0
        },
        {
          "id": "ewrj8qu",
          "author": "nishikikiyama",
          "body": "Thank you so much!\n\nMy lovely sister (who lives out of home) told me \"they don't mean any harm, sometimes they don't even think before they speak. Don't let it get to you\". She told me how her fiance complains that she eats so much bread! He isn't calling her fat, he's just making a bit of a comment - and in the end, she continues to eat heaps of bread because she loves it. I think that's a good way to look at it! My sister survived anorexia herself, so when I complain to her, I can see the cogs working in her brain. However, the rest of my family has no experience with ED.\n\nI really do love carrots! Pickles and capsicum, too. I snack on them throughout the day. I try to hide it sometimes from my family, though. But a safe food is a safe food - I shouldn't rip it away. I also love bananas and apple, but I can't eat them in the amounts of carrots I do.\n\nIt feels so reassuring to hear that my struggles are valid and that a carrot doesn't throw away a year and a half of battles. It's such a weird feeling - to get a grip on what you're doing and take back control, but to second guess yourself like, \"did I ever lose control in the first place?\". ED is weird like that.\n\nYou're so sweet. Thank you!",
          "created_utc": 1565706766.0
        }
      ]
    },
    {
      "id": "ewrlwt0",
      "author": "Wigforfire",
      "body": "\nIm so glad! The fight is so tough but its so worth it and you are doing great. When I was fresh out of treatment carrots were my go to snack too and I would use them as a vessel for nut butter! I’ve never tried them with chocolate but im thoroughly intrigued and feel like I have to try it now!\n\n\nYou are doing something so amazing for yourself despite those who may not understand 💚 keep fighting",
      "created_utc": 1565708538.0,
      "score": 3,
      "context": [
        {
          "id": "ewrjmeu",
          "author": "Wigforfire",
          "body": "First off, here are some internet hugs for you, not only for what you're going through but for support in how far you are coming! The fact that you can sit here and write out that you don't want to restrict anymore, and the fact that you're battling through all of this by finding ways to make yourself more comfortable with your fear foods is phenomenal and you deserve so much support and congratulations on doing it!\n\n&#x200B;\n\nSecond off, I know how hard it is to deal with family and to have people who don't understand what it's like to be in the situations we're in, and although I wouldn't wish these issues on anyone else, I wish that my family or friends could know, just a small amount, how much the things they say and do affect our perception of ourselves. Please just know that you are NOT doing anything wrong, you are NOT eating too much, what you are doing is fighting and getting stronger, you are repairing your heart and your brain, you are growing your muscles again. You are doing exactly the right things and even if it's hard for your family to see that, you know deep down that what you're doing is right, you know that despite the ED voice in your head you are walking yourself into a better life, so you eat those carrots!! Keep dipping them in things that scare you, keep mixing them into things, because carrots are your weapon of ED destruction and rightfully so you need to arm yourself with them!! Please keep fighting for yourself and please keep up your hard work, because even if your family doesn't understand, we do and we know you are doing great",
          "created_utc": 1565707027.0
        },
        {
          "id": "ewrk9j2",
          "author": "nishikikiyama",
          "body": "Maybe I'm tired, or that it is quite late, but I actually teared up reading this. The line on carrots being a weapon in my arsenal to destroy ED really, really touched my heart and made me feel better about things. I ate two whole carrots today, I felt... awful! But reading that really helped.\n\nI'll keep dipping them in things. Even chocolate, believe it or not! Carrots are truly able to best anything (and taste great while I'm at it). I agree wholeheartedly. I wouldn't wish anorexia on my worst enemy, but I wouldn't mind people popping on a VR headset and living a day in my shoes. The days of restriction, fatigue and pain. That would make so many people realise that recovery is beyond 'sitting down and eating' and make them check their words just a bit closer...\n\nI'm honestly so touched by this heartfelt message. Thank you so much - I'll repeat that mantra of carrots being my weapon in this fight whenever I hear a comment!",
          "created_utc": 1565707458.0
        }
      ]
    }
  ]
}