{
  "id": "cqijhu",
  "subreddit": "fuckeatingdisorders",
  "author": "freddybobeddy",
  "created_utc": 1565829302.0,
  "title": "Today i’m 1 year into recovery: an honest update",
  "selftext": "I didn’t really choose recovery tbh, one day i just snapped. Things aren’t great yet honestly. My ED completely destroyed my social life, health and financial state. I’m still dealing with physical consequences and ruined relationships. The debt that came with no longer being able to work still haunts me. I have underlying depression/PTSD that’s difficult to cope with.\n\nYet... it’s been so worth it? Yes life still sucks, but not in the way my ED made me feel. I felt completely trapped in my ED. Every day was the same and the sense of happiness I gained from it was so tiny and pointless. \n\nFacing life and its problems is shitty but at least feels more satisfying to me nowadays. Picking up the pieces after my ED has been exhausting but I feel damn strong doing it. I’m looking out for my future self now. That feels really good. \n\nRecovery fucking sucks though, sorry to be blunt. However it’s nothing compared to life stuck in an ED. Anyone who’s trying to recover right now, I feel you and I’m so proud of you. Prying the parasite that is an eating disorder off your brain takes incredible strength, especially on top of life’s other stresses. \n\nAfter the mid recovery clusterfuck (aka the worst depression of my life) things started getting better. I thought i’d be miserable forever but just as promised, I started feeling better. \n\nSo yea, you’re not the exception to recovery (trust me, i thought i was 100% an exception). Even if your life’s a mess like mine. I feel like a cheese ball saying that but I seriously sympathize with you guys. \n\nCheers to another year. ❤️",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cqijhu/today_im_1_year_into_recovery_an_honest_update/",
  "score": 113,
  "num_comments": 8,
  "comments": [
    {
      "id": "ewwoo55",
      "author": "spelonberry",
      "body": "Good for you!\n\n\"As promised, I started feeling better.\"\n\n^^ THIS. It is so true but so hard to believe in during the hard times. Keep it up.",
      "created_utc": 1565831643.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ewwoys3",
      "author": "summerbandicoot",
      "body": "Recovery does indeed suck ass, but it sounds like you’re doing a damn good job and I’m proud of you too 💛",
      "created_utc": 1565831842.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ewwq81u",
      "author": "marmotacaligata84",
      "body": "Thank you for sharing. It means a lot to hear from other people going through recovery. \n\nTake care out there <3",
      "created_utc": 1565832686.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ewx105v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1565840793.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ewx4644",
      "author": "None",
      "body": "Needed to read this. I'm on the edge of starting to recover but I am struggling so much to take the step in the right direction rather than falling back into my worst habits and just staying in my 'comfort zone'.\nI keep coming here to read success stories because I feel like my ED is ruining my relationship and I couldn't live with that so I need as much motivation as possible to recover.\nCongrats on 1 year!",
      "created_utc": 1565843749.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewxubte",
      "author": "Little-Rexy",
      "body": "Thank you for sharing a real view of recovery and how ED's effect every part of a person. I too am struggling to repair and hold onto relationships that my ED has stolen from me. Continue to stay strong and proud, because you deserve it.\n\nWith Love-",
      "created_utc": 1565868544.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewyub4q",
      "author": "misterladybug",
      "body": "Thank you for posting this.\n\nI'm in such a slump right now, feeling hopeless and depressed, after getting out of treatment a couple weeks ago and now I'm left sitting with all the debt I've gotten myself into from hospital bills to just daily living expenses, on top of trying to deal with the emotional pain of living in my body the way it is now, and trying to re-assimilate into normal every day life. \n\nThis gives me hope.",
      "created_utc": 1565886885.0,
      "score": 2,
      "context": []
    },
    {
      "id": "excount",
      "author": "deena812044",
      "body": "Congratulations!! That is fantastic and so encouraging to hear!!  I wonder if you could share anything about physical improvements at 1 year in?  I've had 2 good months, 1 with a few slip-ups, and am now over 4 more months good with an ED team that's awesome.  I feel solid in my recovery now (though I know I still have lots to get through). My period has returned to normal, but my legs are still sore/achey most days and I get exhausted really easily (I ran and over-exercised during my ED).  Just looking for some hope I guess, that I'll be able to ride a bike or go for a hike sometime in the future... Thank you for sharing <3<3<3",
      "created_utc": 1566155928.0,
      "score": 2,
      "context": []
    },
    {
      "id": "exwb72c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1566616767.0,
      "score": 2,
      "context": [
        {
          "id": "excount",
          "author": "deena812044",
          "body": "Congratulations!! That is fantastic and so encouraging to hear!!  I wonder if you could share anything about physical improvements at 1 year in?  I've had 2 good months, 1 with a few slip-ups, and am now over 4 more months good with an ED team that's awesome.  I feel solid in my recovery now (though I know I still have lots to get through). My period has returned to normal, but my legs are still sore/achey most days and I get exhausted really easily (I ran and over-exercised during my ED).  Just looking for some hope I guess, that I'll be able to ride a bike or go for a hike sometime in the future... Thank you for sharing <3<3<3",
          "created_utc": 1566155928.0
        }
      ]
    },
    {
      "id": "exyhfbp",
      "author": "deena812044",
      "body": "Thank you for responding, it's really helpful for me to know that I'm not alone in continued physical symptoms.   So I don't feel like I'm failing or start questioning my treatment / eating (ex. *it's bc I'm not eating every superfood every day!*).  I'm moving from more structured eating to more intuitive eating, but sometimes the energy/pain makes me start second guessing myself.\n\nExpecting possible continued fatigue/soreness also helps plan for the next year, since friends/colleagues (not close ones who know) are wondering why I'm not going out for massive runs or bike rides.  I'm beyond that period of the excuse of \"recovering from an injury\" so now I don't know how to deflect the invites (I am *really* an outdoorsy person).\n\nThen there's travel-  I have big goals, both personal and work, but I probably need to keep things in the very-low-activity range for awhile.  I recently went on an overseas trip, thinking (back when I bought tickets) that I *should* be ready for some action at 3 months clean & feeding, but the long days of walking on concrete and carrying backpacks (which I wouldn't have even noticed before) truly \\*kicked my ass\\*.  I don't regret going bc it was amazing, but my partner did have to experience some breakdowns of frustration and ruminations on *why is my body not working  yet?!?*  So looks like we should plan something relaxing and spa-type for our next trip :)\n\nI feel you about needing to eat more, or for me, it's more often (since I don't really enjoy very big meals anymore).  My partner never eats breakfast, can skip any meal without consequence and just eat more later, and sometimes I feel like I should be able to do this, but of course I quickly fall apart! (and always did, but even moreso to almost passing out during my ED).  He is so kind and supportive, and he's always been good about us finding a snack or meal even if he's not hungry.  I just have to own it and not feel self-conscious about always having snacks in my purse or needing to stop for a bite.\n\nI wish you all the best in your continued recovery!! There is so much pain and sadness on this reddit sub, so it's wonderful to hear a voice of reason and hope from the other side of the battlefield :)",
      "created_utc": 1566652217.0,
      "score": 1,
      "context": [
        {
          "id": "excount",
          "author": "deena812044",
          "body": "Congratulations!! That is fantastic and so encouraging to hear!!  I wonder if you could share anything about physical improvements at 1 year in?  I've had 2 good months, 1 with a few slip-ups, and am now over 4 more months good with an ED team that's awesome.  I feel solid in my recovery now (though I know I still have lots to get through). My period has returned to normal, but my legs are still sore/achey most days and I get exhausted really easily (I ran and over-exercised during my ED).  Just looking for some hope I guess, that I'll be able to ride a bike or go for a hike sometime in the future... Thank you for sharing <3<3<3",
          "created_utc": 1566155928.0
        },
        {
          "id": "exwb72c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1566616767.0
        }
      ]
    }
  ]
}