{
  "id": "ctx1us",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1566478557.0,
  "title": "6 months of eating",
  "selftext": "Let's cut the whole back story and preface this with acknowledging that I was very ill and disordered for years. At the beginning of 2018 I suffered a terrible relapse and almost died; it was pretty bad and I was far too stubborn to accept help from counsellors and I (and many others) thought I was going to die. I had some great friends who would literally force-feed me and try to help me however they could, they were on the brink of an intervention to pull me out of uni and call a hospital.\n\nThe something happened. In February I realised I didn't want to live not eating bread and having my pals shove 600kcal flapjacks down my throat; I hated looking sick and being weak and cold and having brittle hair. So I decided to brave it and eat something. It began with a two protein shakes and an evening snack. Slowly, I added more foods and dealt with the horrendously uncomfortable but essential bloat; I challenged chocolate, cake, hummus, bread - all of the other foods I'd rejected. Every. Single. Day. I was very open about my challenges and encouraged discussion on social media which was useful.\n\nI worked a physically demanding job and have always been quite active in running, and shortly afterwards realised there was a direct correlation between the amount of food in my body, and my ability to lift heavy boxes at work or run faster/longer (I'm a scientist and knew this, but doubted the trends y'know).  I still struggled to eat some things but my (then) exceedingly slow metabolism meant that I was gaining weight on well below 2000 calories per day. Shopping was still a challenge, eating out was unthinkable, dessert had to be meticulously planned but I was no longer at risk. \n\nOne day, I decided to try running 15km (when two months previously, I couldn't even make 5km). I managed, and bumped into my pals when I returned and exclaimed \"I'm dying\". Their response: \"No, you're the exact opposite of dying. For once\". They remarked how alive and energetic I was, much more fun to be around, intelligent, insightful, and loving.\n\nThen I kept going. My pals encouraged me to see a counsellor again who was relieved she could help me, slowly my weight plateaued, my hair and nails started growing, the hilarious bloating subsided, the constant aches left, and I began running 40km each week and lifting weights. That's where I am now only 6 months later. I now eat 1900-2300kcal per day, dependent on exercise, mostly of nutritious foods but I always eat some chocolate and wine and if I want ice cream (which I'm craving quite a lot right now) I'm going to eat ice cream.\n\nI've never looked better, I've never felt better, and I've never been better. That doesn't mean I'm cured - I broke down over a pear in the supermarket last week, I panicked about cocktails recently, and I can't stop buying unsweetened almond milk when it takes like watery mud. I can deal with these things and I will challenge them.\n\n6 months ago, I thought I was going to die. Seeing what this new and improved bod can do and feel makes recovery totally worth it; not just for oneself, but for everyone.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ctx1us/6_months_of_eating/",
  "score": 105,
  "num_comments": 9,
  "comments": [
    {
      "id": "exovp56",
      "author": "humbl-bii",
      "body": "I just wanted to say that, as a stranger, I'm so proud of you! Keep fighting and don't let little challenges stop you. Also, i love your friends and the fact that they too, are cheering you on. Wow, I'm so happy that i read your story, it made my day! Cheers and good luck \n💛💛💛",
      "created_utc": 1566482421.0,
      "score": 12,
      "context": []
    },
    {
      "id": "exp86p3",
      "author": "Little-Rexy",
      "body": "GRIT! You have lots of it! Keep inspiring, thank you. \n\nHUGS!",
      "created_utc": 1566487156.0,
      "score": 7,
      "context": []
    },
    {
      "id": "exozbl7",
      "author": "None",
      "body": "so proud of you!! keep doing food challenges! i recently challenged cereal and it’s gone so so well! not sure what’s next but i’ll come up with something and we’ll battle this thing together",
      "created_utc": 1566483883.0,
      "score": 4,
      "context": []
    },
    {
      "id": "exozyul",
      "author": "darkettecs",
      "body": "This is amazing! I'm so proud of you! Thank you for sharing your story. Please keep choosing life. You are so so so worth it! 🙏💕",
      "created_utc": 1566484147.0,
      "score": 5,
      "context": []
    },
    {
      "id": "exp3rf3",
      "author": "sintos-compa",
      "body": "Thanks for sharing this.",
      "created_utc": 1566485544.0,
      "score": 3,
      "context": []
    },
    {
      "id": "expvpkr",
      "author": "forestfairy23",
      "body": "You are an inspiration ❤️❤️❤️",
      "created_utc": 1566494897.0,
      "score": 4,
      "context": []
    },
    {
      "id": "exqmcyl",
      "author": "None",
      "body": "My heart 😭❤️",
      "created_utc": 1566504324.0,
      "score": 3,
      "context": []
    },
    {
      "id": "exs92tt",
      "author": "None",
      "body": "This is amazing and so inspiring. Congratulations! You are awesome! I think I will save this post to keep for future motivation. I hope I can get to that point one day. 💙",
      "created_utc": 1566536266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "exsb71j",
      "author": "evacia",
      "body": "fuck yeah! that’s awesome! what a great post to read, friend. you’re doing fantastic.",
      "created_utc": 1566538430.0,
      "score": 1,
      "context": []
    }
  ]
}