{
  "id": "cugpgv",
  "subreddit": "fuckeatingdisorders",
  "author": "problematicbeing",
  "created_utc": 1566579867.0,
  "title": "To the loved u/inthewillows",
  "selftext": "One of our frequent contributers to this subreddit, u/inthewillows, has deleted their account after mentioning that they were struggling again.   \n\n\nI wanted to sticky this post in case they ever come back and visit. You selflessly offered brilliant advice to anyone struggling. You were caring and helpful. You helped people that needed to hear what you had to say. You did beautiful work others even when things were hard for yourself.  \n\n\nI hope so much that you are doing okay, that you find strength to pull yourself out of this dark time. To u/inthewillows, and all the other precious members of this subreddit, we care for you! You are always welcome here and we will always offer support.   \n\n\nTo everyone- stay strong! Recovery is hard, but you are all strong enough to do hard things.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cugpgv/to_the_loved_uinthewillows/",
  "score": 394,
  "num_comments": 3,
  "comments": [
    {
      "id": "f0tfsg2",
      "author": "inthewillowsii",
      "body": "You guys <3 I love you guys, truly. \n\nI actually saw this post a few days after I deleted my account when I popped back. I felt so bad, so appreciative of you guys caring so much and then so bad and felt like I didn't deserve so much care, and guilty that you guys showed me so much love when I wasn't worth it... so I didn't say anything. I came back now and it's still here, so I think I should say something.\n\nThings just got so hard. I deleted my account in a 'moment', if you get what I mean. I was angry, 'done', I hated and regretted ever going into recovery and felt it had 'ruined my life' and 'omg why did I ever think recovery was a good idea at all'.\n\nI've kept my head above water, physical health wise. I have carried on eating, tbh perhaps more than I did before because the only way I am keeping my head above water now is to respond to each and every hunger signal I *think* I get. If I think about it too much, like 'is this actual hunger or just a craving or am I tired or thirsty?' I get upset and spiral very quickly into that 'severely restrictive' type territory. It's like I'm walking on a cliff edge, one wrong move and I am right back to square one. I'm trying to not do that... So I feel hungry, I get something to eat. I admit I am mainly sticking to 'safe foods' which I know probably isn't helping matters but I am eating a lot of them, and many are substantial anyway (*Edit: Some of you may remember how I posted about wanting a dominos pizza for ages and not getting one... still want one, still havn't gotten one. Goddamnit*).\n\nThe difference is now, I am not happy about it. I actually super hate it. Before I was optimistic, happy about recovery as a general trend...  now I am not. Really not. Very much very not. It's an actual battle with my mind every single day, doing this eating thing, going through the horrible sad/depressed/angry feelings about how I am still making myself eat. It's exhausting.\n\nI am swinging wildly with my feelings regarding my bigger body too - one moment I feel I look super cute and healthy and great, next moment I don't want to leave the house because I am embarrassed at other people seeing 'how fat I am'. \n\nIt's for these reasons I wont be back on the subreddit right now, because I don't think I could post anything helpful to anyone with my current mental state. I am a ball of anger and sadness and hate and not good-ness.\n\nBut thank you, so so so much, for your really kind words about my previous posts on here. That really does mean such a lot to me <3 I want to be in that mindset again... I'm just going to keep trucking on, and hope I can push through this.\n\nAgain, love you guys. Thank you so much for this post. Stay safe everyone. See you soon <3 <3",
      "created_utc": 1568921335.0,
      "score": 64,
      "context": []
    },
    {
      "id": "eybz0un",
      "author": "Little-Rexy",
      "body": "It is a true testament to the caring here in this sub, signified by your post about [u/inthewillows](https://www.reddit.com/u/inthewillows/). Thank you! I hope they stay strong. I too will keep an eye out and an open heart.",
      "created_utc": 1566994061.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f1bsui8",
      "author": "problematicbeing",
      "body": "<3 Glad to hear from you and get an update. Don't ever worry about posting here or not, you are always welcome and it's completely fine when you need time away.\n\n&#x200B;\n\nYou are strong as hell and you will get through this. Get yo self a dominos pizza and fight this awful illness! You deserve happiness and recovery.",
      "created_utc": 1569342199.0,
      "score": 14,
      "context": [
        {
          "id": "f0tfsg2",
          "author": "inthewillowsii",
          "body": "You guys <3 I love you guys, truly. \n\nI actually saw this post a few days after I deleted my account when I popped back. I felt so bad, so appreciative of you guys caring so much and then so bad and felt like I didn't deserve so much care, and guilty that you guys showed me so much love when I wasn't worth it... so I didn't say anything. I came back now and it's still here, so I think I should say something.\n\nThings just got so hard. I deleted my account in a 'moment', if you get what I mean. I was angry, 'done', I hated and regretted ever going into recovery and felt it had 'ruined my life' and 'omg why did I ever think recovery was a good idea at all'.\n\nI've kept my head above water, physical health wise. I have carried on eating, tbh perhaps more than I did before because the only way I am keeping my head above water now is to respond to each and every hunger signal I *think* I get. If I think about it too much, like 'is this actual hunger or just a craving or am I tired or thirsty?' I get upset and spiral very quickly into that 'severely restrictive' type territory. It's like I'm walking on a cliff edge, one wrong move and I am right back to square one. I'm trying to not do that... So I feel hungry, I get something to eat. I admit I am mainly sticking to 'safe foods' which I know probably isn't helping matters but I am eating a lot of them, and many are substantial anyway (*Edit: Some of you may remember how I posted about wanting a dominos pizza for ages and not getting one... still want one, still havn't gotten one. Goddamnit*).\n\nThe difference is now, I am not happy about it. I actually super hate it. Before I was optimistic, happy about recovery as a general trend...  now I am not. Really not. Very much very not. It's an actual battle with my mind every single day, doing this eating thing, going through the horrible sad/depressed/angry feelings about how I am still making myself eat. It's exhausting.\n\nI am swinging wildly with my feelings regarding my bigger body too - one moment I feel I look super cute and healthy and great, next moment I don't want to leave the house because I am embarrassed at other people seeing 'how fat I am'. \n\nIt's for these reasons I wont be back on the subreddit right now, because I don't think I could post anything helpful to anyone with my current mental state. I am a ball of anger and sadness and hate and not good-ness.\n\nBut thank you, so so so much, for your really kind words about my previous posts on here. That really does mean such a lot to me <3 I want to be in that mindset again... I'm just going to keep trucking on, and hope I can push through this.\n\nAgain, love you guys. Thank you so much for this post. Stay safe everyone. See you soon <3 <3",
          "created_utc": 1568921335.0
        }
      ]
    }
  ]
}