{
  "id": "cxdz62",
  "subreddit": "fuckeatingdisorders",
  "author": "study_boi",
  "created_utc": 1567153018.0,
  "title": "my weight is soaring",
  "selftext": "... and I LOVE IT\n\nI started recovering by myself just 3 weeks ago at a BMI of 13 and now I’m up to around 15.5.\n\nI haven’t really noticed any changes physically in my appearance, but since my whole motivation to recover is under the guise of self improvement and becoming my best self, it wouldn’t matter anyway.\n\nFor those out there in recovery trying to accept their new body, just remember the real reason you’re doing this. Self improvement. You are becoming the best possible version of yourself and every day you are one step closer to living your best and healthiest life possible.\n\nI hope you all have a great day and allow yourself to take another step towards becoming a better version of yourself, you deserve it :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cxdz62/my_weight_is_soaring/",
  "score": 104,
  "num_comments": 9,
  "comments": [
    {
      "id": "eyklpqs",
      "author": "endormimi",
      "body": "That's amazing!!!! Well done!",
      "created_utc": 1567158510.0,
      "score": 8,
      "context": []
    },
    {
      "id": "eykq756",
      "author": "cuntry-girl",
      "body": "Yes babyyy!!!!!!!! Congrats ❤️",
      "created_utc": 1567164357.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eykvz1u",
      "author": "Boosey0910",
      "body": "In my recovery I just ATE LOTS OF FOOD.  It was medicine in my mind.  I'm so proud of you as it is not easy but you are so worth it and there is such a great life on the other side of an eating disorder!  Go for it!",
      "created_utc": 1567169696.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eyl9dz0",
      "author": "problematicbeing",
      "body": "Great job my dude! And remember that even when you're passed the bmi of 18 or 18.5 or whatever that arbitrary minimum is, you will likely need to keep gaining to maintain health and recovery. There has been studies that say if you can recover to a BMI of 23+ then you are more likely to sustain recovery <3 Overall, the number's don't matter, your body will gain to where it needs to be for optimal health as long as you are eating and not suppressing it.",
      "created_utc": 1567179260.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eyla76e",
      "author": "violetgay",
      "body": "So proud of uuuu!!! 💕💕💕💕",
      "created_utc": 1567179794.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eylynrt",
      "author": "elsacouchnaps",
      "body": "YAAAAY!",
      "created_utc": 1567195161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eylz9zj",
      "author": "bflowry",
      "body": "Isn’t it amazing how our thoughts get clearer and more rational with a better-nourished brain?\nThis is so inspiring. Keep it up, brave one! ♥️",
      "created_utc": 1567195595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eylzzy8",
      "author": "None",
      "body": "woow you go girl! you got this, keep it up. I'm so proud of you! good luck with your recovery 🍀",
      "created_utc": 1567196097.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eyljdou",
      "author": "crankyhedgiebutt",
      "body": "Congrats! I’m glad you’re enjoying your progress and are proud. I hope you keep getting stronger and feeling better.\n\nI deff needed to read this today. My weight hasn’t budged since recovery (and I’m on a cut, so I want to go down a little healthily). I’ve been down because my body won’t respond the way I want it to.\n\nBut you make me think about all the muscle I’ve gained and how every day tasks are so much easier. It’s nice to have energy to do things!\n\nWhile I still don’t have the stomach of my dreams, I’ve got my health and strength.",
      "created_utc": 1567185839.0,
      "score": 1,
      "context": []
    }
  ]
}