{
  "id": "cy4mm5",
  "subreddit": "fuckeatingdisorders",
  "author": "xxjage",
  "created_utc": 1567305573.0,
  "title": "I wish people would stop commenting on eating habits and such",
  "selftext": "I literally just started working at a new job and I have heard some stuff from my coworkers that are really triggering and just unnecessary. \n\n“You have an amazing body” - unwarranted, I don’t need you to comment on my body. It may come from a good place but It’s really none of your business. \n\n“Have this cookie. No really, I won’t let you leave until you have at least one” - a fear food of mine. Was already feeling down and this almost made me have an anxiety attack at work. I kept refusing it but alas was forced one. No means no. :( \n\nand just so many questions about “what did i have for lunch/break?” I leave my workplace for a reason during break, I feel more comfortable by myself. I know all of these questions come from a genuine and good place but it’s so hard to recover when you have already have food and this disorder plaguing you and then society bombarding you with more triggers.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/cy4mm5/i_wish_people_would_stop_commenting_on_eating/",
  "score": 117,
  "num_comments": 9,
  "comments": [
    {
      "id": "eyprwza",
      "author": "None",
      "body": "You can just put a hard stop on it, like the cookie thing. If you have to, be angry. Forcing you to eat is incredibly disrespectful and disturbing... What if you had an allergy or were sick?! Seriously I feel uncomfortable just reading that and you have all the right to stop them.\n\nAnd the comment on your body is totally inappropriate and can be reported.",
      "created_utc": 1567309228.0,
      "score": 40,
      "context": []
    },
    {
      "id": "eyptxps",
      "author": "hollysykes",
      "body": "Thank you for posting this today. I needed it. I, too, just started a new job. Conveniently I always forget that new situations may present new opportunities for comments on my body, food, etc. It always catches me off guard. I’ve learned to discern well-meaning comments and brush them off. But the brash comments from other women about my body still upsets me so much. It upsets me that they are thinking about weight so much that it’s the first thing they comment on when meeting me and it makes me feel like I’m being reduced to merely a body. I try to pause and have empathy, knowing how much body image and weight have been at the forefront of my mind most of my life, but it’s hard to understand why people think it’s okay to say it OUT LOUD (especially very loudly, in front of other people.) It seems like common sense to me but I’m proved wrong all the time!",
      "created_utc": 1567311193.0,
      "score": 14,
      "context": []
    },
    {
      "id": "eyqec64",
      "author": "DifferentIsPossble",
      "body": "The cookie thing is legitimate harassment. Either report it to someone, or put your foot down next time.\n\nNO, I won't. This isn't funny. Leave me alone.\n\nIf they try again, tell them openly: this is harassment. Leave me alone.\n\nKeep escalating your firmness, but don't laugh it off at the beginning. That makes them think it's a joke.\n\nNO.",
      "created_utc": 1567339731.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eyq6vs9",
      "author": "ItchyElderberry",
      "body": "Holy shit, your coworkers are assholes!\n\nCommenting on your body is inappropriate in the work place, no matter how they meant it. It could even be considered sexual harassment.\n\nA coworker said you couldn't leave until you did what they wanted? Oh HELL no! 😠\n\nThis isn't a problem of your coworkers unknowingly triggering you. They are bullies. Is there someone above them you can talk to? Or is that the culture of the whole business?",
      "created_utc": 1567328358.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eyq87mh",
      "author": "Alvion_",
      "body": "i'll never understand why people think it's ok to comment on what others are doing, just mind your own business, nobody's asking for your opinion.",
      "created_utc": 1567330514.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eyqujwn",
      "author": "brainsandb00bs",
      "body": "Next time someone pushes food on you, take it then throw it away right in front of them and let them know that when you say no it means NO it doesn’t mean CONVINCE ME. If people are being rude and disrespecting your boundaries don’t worry about being polite. \n\nI personally do this and now everyone leaves me alone the first time I say No.",
      "created_utc": 1567353932.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eyqeiuy",
      "author": "None",
      "body": "what the hell. I never understand why are people so pushy and especially about food. I'm sorry you have to deal with that. what I usually do is that I look them in the eyes and say 'i don't want that' very clearly. that usually helps.. it's stressful to be like this for me though 😅 maybe you can try it. good luck in there and I wish you the best in recovery 😊",
      "created_utc": 1567339957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eyqg7jn",
      "author": "MatsyPats",
      "body": "thank you for posting this, you’ve made me feel less alone. i’m experiencing the same thing and i completely understand! ❤️",
      "created_utc": 1567341881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eyr6zfi",
      "author": "None",
      "body": ":( all i can say is you are not alone. i hear and see it too. im not always sure how to handle it. thanks for sharing. hugs <3",
      "created_utc": 1567361932.0,
      "score": 1,
      "context": []
    }
  ]
}