{
  "id": "czr22n",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1567632383.0,
  "title": "when you're eating a \"normal\" amount of calories and you can feel yourself gradually gaining weight",
  "selftext": "\"this is okay\" I tell myself as I poke my tummy again. \n\n\"the squish and give is probably mostly water weight anyways\"\n\nbut I'm also hitting the point where I can't restrict any longer. my body is fighting me. I used to do 1100-1300 easily now 1500 is agonizing.\n\nI close my eyes in a brief prayer. \"God has afflicted me thus for abusing my poor, hungry body. a land of plenty He has bequeathed and all I cared about was my vanity.\"",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/czr22n/when_youre_eating_a_normal_amount_of_calories_and/",
  "score": 133,
  "num_comments": 5,
  "comments": [
    {
      "id": "ez0w04b",
      "author": "crankyhedgiebutt",
      "body": "Every word is just perfect. I can relate to every single word of this.\n\nWas feeling guilty earlier about eating pizza and eating way more than one of my guy friends. But my bf reminded me that I exercise a lot so I’m hungry, and that my guy friend doesn’t do a lot physically. It’s scary though knowing I might be eating enough where I don’t lose weight and that I might even gain. \n\nYou’re right about the restricting part, it’s gotten way too hard.",
      "created_utc": 1567642694.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ez11jb2",
      "author": "None",
      "body": "We have to learn to listen to our bodies again. A little squish is 100% necessary to signal to your body that you're done starving it.\n\nSelf-love is beautiful. You're beautiful.",
      "created_utc": 1567644481.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ez3m0mj",
      "author": "None",
      "body": "a little bit of squish is super normal and literally everyone except for crazy bodybuilders in their show days (where they're incredibly dehydrated and starved, so far from ever sustainable) have it. Your body is amazing and healing itself, and it's you who accomplished it :)",
      "created_utc": 1567670187.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ez4qsao",
      "author": "somegenerichandle",
      "body": "It's good that you are grasping your own role in the treatment of your body. But, God loves us unconditionally and will help if you seek it.",
      "created_utc": 1567690801.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ez5pdex",
      "author": "None",
      "body": "When I was bad my body was maintaining on 1000 calories per day, with exercise, and I'm 5'7\". Once I began to recover I was gaining weight on anything above that but I learned to live with it and continue eating until now - I've gained 13kg (about 29lbs for all you imperial unit users) in 8 months and I'm maintaining on about 2100 calories. On days of strenuous exercise I eat up to 2600 calories and it is fine; sure there's a little jiggle around my stomach but that is absolutely not a problem because at least I can eat normal amounts of food now AND I have energy. Keep eating, listen to your hunger cues and your metabolism will catch up and weight gain will plateau.",
      "created_utc": 1567702588.0,
      "score": 2,
      "context": []
    }
  ]
}