{
  "id": "d1h41m",
  "subreddit": "fuckeatingdisorders",
  "author": "ellavator_",
  "created_utc": 1567977522.0,
  "title": "“You don’t choose an eating disorder, but you do choose recovery”",
  "selftext": "A year ago today, I received a call from my GP urging me to go to the ER right away. I rolled my eyes over the phone, feeling frustrated and misunderstood. Did I *really* need to go? I *felt* fine. As soon as she hung up, my thoughts and emotions froze, leaving only one thing on my mind: “You need to exercise if you’re going to sit in a waiting room”. I obeyed.\n\nA few hours later I was admitted for cardiac abnormalities secondary to my eating disorder.\n\nThe voice that told me to exercise when my heart was in critical condition is the same voice that follows me around every day. When I take transit, it tells me not to sit down, and god forbid I take the escalators. When I follow my meal-plan it tells me I’m greedy and failing. When I’m invited for lunch it tells me not to go, insisting that others around me are trying to make me fat.\n\nI am now eight months into recovery, and still argue with this voice thousands of times every day. The only way to completely shut it off is by doing what it says. As enticing as it sounds to have this constant battle with yourself every day, I didn’t choose this. It is absolutely exhausting, and at times I feel so drained from the chatter that I end up giving in and doing what it wants me to do. For me it’s not a matter of just “choosing recovery”, as so many people prescribe it to be.\n\nIgnoring the thoughts and choosing to go out for lunch is tremendously hard. At times I find myself paralyzed when ordering, feeling incapable of “choosing recovery” and I end up getting what my eating disorder voice deems “safe”. I decided I wanted a life without anorexia when I put myself on treatment waiting lists. Wanting a life outside of an eating disorder doesn’t mean making a single choice to recover, it means having to make thousands of choices every day while ignoring the screaming in your head.\n\nThe idea that you can choose recovery minimizes how difficult it is to stop eating disorder behaviours. I told myself over and over: *tomorrow is going to be different, I don’t want to feel like this anymore*, but I wasn’t able to change much without specialized treatment. Even within the eating disorder community, I have been shamed for having slips because I’m not “choosing recovery”. If it was as simple as choosing recovery, there wouldn’t be millions of people suffering from eating disorders. People wouldn’t need to return to treatment, and eating disorders wouldn’t have the highest mortality rate of any psychiatric illness.\n\nI wish it was as simple as choosing recovery. It would make it a hell of a lot easier for me and all of my supports if I could simply make the choice to get better.\n\nI am trying.\n\nIf someone you love is struggling with an eating disorder, be patient with them. Don’t get angry with them when they’re struggling, instead channel that anger towards their illness. Recovery is a process that takes years, and it’s never linear. We're all doing our best.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/d1h41m/you_dont_choose_an_eating_disorder_but_you_do/",
  "score": 133,
  "num_comments": 12,
  "comments": [
    {
      "id": "ezlwy0r",
      "author": "None",
      "body": "I really needed to read this. Thank you.",
      "created_utc": 1567982828.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ezm8x9n",
      "author": "dtonas",
      "body": "Thanks for taking the time to write this. It rings so true.",
      "created_utc": 1567988500.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ezmkggo",
      "author": "None",
      "body": "This is a fabulous post. Thank you.",
      "created_utc": 1567993364.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eznjcce",
      "author": "None",
      "body": "So true 🙌🏽 you don’t just choose it once. You have to keep choosing it every moment of every waking day, and I always use the same word to describe recovery: EXHAUSTING. Good luck with your ongoing recovery 🌸",
      "created_utc": 1568006814.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ezncqwk",
      "author": "ri-ri",
      "body": "Beautifully written and very familiar to how I feel. \n\nStay strong. ❤️",
      "created_utc": 1568004035.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eznydm6",
      "author": "datantdupaleozoique",
      "body": "Very proud of you.",
      "created_utc": 1568013523.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ezolmt4",
      "author": "lily89kitty",
      "body": "Goodness you expressed that so well, I totally relate. Especially the tomorrow if will X thing, I'm always promising myself stuff rather than doing it now.\n I thought I would chose recovery and then recover but like you say it's a fight every hour of every day. I'm sorry you ever felt shamed by the community, I don't think anyone has perfect recovery where they never again let their ED dictate their behaviour just for a moment's peace in their soul because they are exhausted, that's unicorn recovery not real recovery. Only thing to do it try again tomorrow. Stay strong x",
      "created_utc": 1568024536.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ezpt9qk",
      "author": "Little-Rexy",
      "body": "Thank you- It is a staff luncheon today I was avoiding it all together. I went and got two pieces of cheese and 4 slices of tomato and two slices of onion and put hot sauce of them and ate them in my office. No I didn't eat with others, but I am taking one step at a time. \n\nHugs",
      "created_utc": 1568048024.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ezphgyn",
      "author": "theactualliz",
      "body": "Thank you for sharing this. Having trouble sitting through lunch with my family now. Your words helped.",
      "created_utc": 1568040732.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezqjj6z",
      "author": "daybeforetheday",
      "body": "  \nThank you for sharing this wonderful post.",
      "created_utc": 1568060099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezpugj9",
      "author": "ellavator_",
      "body": "thank you so much. yes- i make a million promises to myself that feel impossible to implement most days. we're all doing our best.",
      "created_utc": 1568048815.0,
      "score": 1,
      "context": [
        {
          "id": "ezolmt4",
          "author": "lily89kitty",
          "body": "Goodness you expressed that so well, I totally relate. Especially the tomorrow if will X thing, I'm always promising myself stuff rather than doing it now.\n I thought I would chose recovery and then recover but like you say it's a fight every hour of every day. I'm sorry you ever felt shamed by the community, I don't think anyone has perfect recovery where they never again let their ED dictate their behaviour just for a moment's peace in their soul because they are exhausted, that's unicorn recovery not real recovery. Only thing to do it try again tomorrow. Stay strong x",
          "created_utc": 1568024536.0
        }
      ]
    },
    {
      "id": "ezpuikd",
      "author": "ellavator_",
      "body": "good on you for showing up. i find that to be the biggest and hardest step. stay strong!",
      "created_utc": 1568048853.0,
      "score": 1,
      "context": [
        {
          "id": "ezpt9qk",
          "author": "Little-Rexy",
          "body": "Thank you- It is a staff luncheon today I was avoiding it all together. I went and got two pieces of cheese and 4 slices of tomato and two slices of onion and put hot sauce of them and ate them in my office. No I didn't eat with others, but I am taking one step at a time. \n\nHugs",
          "created_utc": 1568048024.0
        }
      ]
    }
  ]
}