{
  "id": "d1wyam",
  "subreddit": "fuckeatingdisorders",
  "author": "FuckyouHydra",
  "created_utc": 1568062521.0,
  "title": "From obese to anorexic. [Worth reading]",
  "selftext": "Hey, same Op Here. If you scroll down my profile you probably saw that I made a reddit text a few months ago describing my healthy weight loss. \n\nHaha. I wish. Or more like, I thought it was. \n\nToday, right now, 5 minutes after it happened I'm writing this now. I had a 20.000 calorie binge today. 20 f-ing thousand calories. I gained nearly 16 pounds from all the food weight inside me right now. \n\nMaybe you have seen my former post, I'm 5'7-5'8. I was in the 200+ pounds weight range for a large portion (pun) in my life. But since December I've decided to change. From 200 to 119 pounds in a mere 8 months. I thought I was healthy, I truly did. But since last month I've seen that I'm anorexic. I am afraid of over 400+ calories. I weigh every single thing, I fast for 3+ days at a time, and since last week I've binged on 3k calories every day and today 20k now. It devastates me. I weigh 135 pound in this very moment, probably from food weight but I know that I must have gained after this week long binge.  And I'm shaken up. I want to be on the 2-Numbers weight range till Halloween. I'm fucked up\n\n\"Mimimi but Op why are you making this post?\" To spread awareness. Now that I'm a lot skinnier I still feel like shit. I feel disgusting. I'm never thin enough. \n\n\"What about a doctor?\" You see, I'm not underweight yet for them. My hands look like sticks but my torso and legs aren't bad yet. I lose weight in the upper part of my body so fast, my eyes are sunken in, my collar bones are cup holders, my hair is falling out, my hands are bones. But my stomach and hips and thighs? Phew boy. Those are chunky and those are usually where they meassure your BMI. My doctor even told me I can lose some more weight just a few weeks ago. So no and yes. Yes I'm going to a doctor. No I'm apparently not getting help.\n\nRight now I'm sitting crying on the floor, my stomach and face are bloated, there are 3 empty peanut butter jars here, 2 ramen packs, a nutella jar, 4 ice cream cups, 5 chocolate bars, candied nuts, a whole empty loaf of toast, 2 microwaveable spaghetti packages, a  cake slice, and some bread and so many sauces and pringles and energy drinks. And you know what? I can't remember most of it. I only remember eating as fast as I can. As if I'm being hunted or preparing for hibernation.\n\nI don't know what to do if I'm honest. I have body dysmorphia. I can't see myself. I want to have a thigh gap I want this or that or those and ahhh. I totally lost the point of why I'm writing this. My mind is still foggy and weird. My doctors won't take seriously. All I want to say is... please stay safe. \n\nYou will NOT be happy once you're thin. It will NOT be a magical cure to your problems. Get a therapist. Don't end up like me. Eating disorders are scary. They control you. And now I experienced both ends of the spectrum. \n\nStay safe. Don't end up like me.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/d1wyam/from_obese_to_anorexic_worth_reading/",
  "score": 94,
  "num_comments": 16,
  "comments": [
    {
      "id": "ezqskd2",
      "author": "None",
      "body": "i’m so sorry you’ve been through all of this and that your doctors don’t seem to take you seriously. are you at all able to find new ones? just off the top of my head [this website ](https://www.sizediversityandhealth.org/content.asp?id=32&action=searchResults&do=search) has a list of counselors that specialize in ED recovery and many of them have online consultation. you deserve to be taken seriously and to have support from your medical team. \n\nthere’s hope for recovery 💙",
      "created_utc": 1568063445.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ezqz94w",
      "author": "TeatothewhY",
      "body": "I weighed my lowest last week at 171, and I started at 245 eight months ago as well. I also have been stuck in a mostly restrictive binge/fast cycle. My therapist just last week told me I have a food addiction. My primary doctor refers to everything I do as binging. Those all encompassing labels have put me into such a downward spiral I can’t even think straight. I actually just posted about this. But even though I can’t relate to you on being underweight and not getting help, I feel like I can relate to the frustration of not feeling/being told you’re not sick enough. Because honestly I truly can’t tell if I’m sick or not anymore. So sorry you’re going through this. I wish I had something helpful to offer, but all I have for you is to say you’re not alone.",
      "created_utc": 1568065763.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ezruzaw",
      "author": "None",
      "body": "Eating disorders are like 6x more common in the trans community. It doesn’t matter that you’re not an “underweight” BMI, the symptoms you describe here are severe, life threatening, and are causing tremendous suffering. I highly recommend you seek out a doctor or therapist that specializes in eating disorders ASAP. Many of them are LGBTQ friendly due to the above statistic I mentioned.",
      "created_utc": 1568079153.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ezrl8hz",
      "author": "None",
      "body": "I'm so sorry you are suffering like this, and doctors are not helping you in the way you need them to. I was anorexic, then became overweight due to antipsychotics, and now I'm losing weight again after stopping the antipsychotics. This post made me realize a lot.\n\nI have been so happy I was losing weight recently. People have been complimenting me, telling me how I am getting \"healthy\". I was losing weight healthily, slowly (1.5 pounds a week). ..But recently things have gotten darker. I'm no longer hungry, I skip meals and eat small portions. I feel like I did back when I was underweight, with such an aversion to food. Last week I was excited to see another 1.5 pound loss, but I lost 4.5 pounds. In a week. I know I can lose more quickly, I've lost much more than that before..but I know I am falling back into old ways.\n\nI keep thinking: I just need to lose the extra weight, then I'll be happy. Then, I'll stop. It doesn't matter how fast I lose it. I am getting compliments! but suddenly my psychiatrist wants to moniter my weight again. Suddenly, I am not \"recovered\" but \"struggling\". I hate that my doctors are good enough people that they notice I am suffering. I hate it, because I can't continue in my dream any longer. \n\nI wish doctors would recognize your suffering. You're right: I will never lose enough weight to satisfy my eating disorder. With eating disorders, it is never enough. I think that it is good you are able to recognize that things aren't okay with you.  Hopefully healthcare providers can understand your suffering too.",
      "created_utc": 1568075427.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ezr0ndl",
      "author": "Hahhahahhohno",
      "body": "I hate to say it, but even medical professionals sometimes take eating disorders in men less seriously. That might be why your doctors are dismissing your symptoms and experiences.\n\nI'm really sorry. Your disorder is real. I'm sorry you're struggling",
      "created_utc": 1568066324.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ezrx9in",
      "author": "ItalicSlope",
      "body": "very similar story here - i didn’t realize i had a problem until i started binging/purging after losing a bunch of weight. hang in there, friend. i went to treatment earlier this year and it helped but it’s still really, really hard. ❤️",
      "created_utc": 1568080027.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezs87ef",
      "author": "Spectrachic311311",
      "body": "I started off obese and I thought I was losing weight the healthy way. But I became anorexic and no one took me seriously because I wasn’t under weight yet. I even had doctors congratulate me on losing the weight so fast. I’m slowly getting back to normal but it’s a hard journey and I wish I would’ve never gone down this road.",
      "created_utc": 1568084622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezsvojm",
      "author": "None",
      "body": "I’d suggest you to first of all change your doctor. Appointment with therapist would be good idea too if you can afford that. \n\nIf you’re not better, please consider inpatient ED treatment.",
      "created_utc": 1568112019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ezs0svv",
      "author": "andy-23-0",
      "body": "Hey, you said a pretty important thing there:\n\n\"Get a therapist\"\n\nWhy don't you? Maybe a psicologist\n\nI started seen a therapist in order to recover, and i wasn't even that skinny yet (tho i realised i fucked up when some nurses told me my blood pressure was way to low, that i shouldn't even be walking right now, not even for a person with natural low pressure. I would also faint, and then i also lost my period but i didn't give a shit, hair was falling too, and that was really scary so i would closed my eyes and pretend i didn't see, and way more things)\n\njust\n\nfind a therapist\n\nor one of those people who do \"coaching\", it actually helps (and it's way cheaper)",
      "created_utc": 1568081311.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezs6zlf",
      "author": "None",
      "body": "I don't know how to help, but I hope you will find something that makes you feel better 💕 I'm sorry you went through this.\n\nBMI is not the sole factor in eating disorders. EDNOS and BED don't have a weight factor in them, so you might still want to insist on those with ED specialists. Good luck!",
      "created_utc": 1568083838.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezsoeos",
      "author": "None",
      "body": "THANK YOU FOR SHARING. I relate so much to this. You're not alone.",
      "created_utc": 1568100509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezt5pzs",
      "author": "Itotsight",
      "body": "I was obese too, then underweight and now who knows what, maybe normal or over. I had bulimia that morphed into restricting. That turned into occasionally b/p. Tried to recover almost 2 years. It's fucking hard to try to learn eating normally(not binging, purging or restricting)",
      "created_utc": 1568122020.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezqu2z4",
      "author": "FuckyouHydra",
      "body": "I hope that one day I will be able to eat a meal without the nagging feeling of guilt",
      "created_utc": 1568063966.0,
      "score": 10,
      "context": [
        {
          "id": "ezqskd2",
          "author": "None",
          "body": "i’m so sorry you’ve been through all of this and that your doctors don’t seem to take you seriously. are you at all able to find new ones? just off the top of my head [this website ](https://www.sizediversityandhealth.org/content.asp?id=32&action=searchResults&do=search) has a list of counselors that specialize in ED recovery and many of them have online consultation. you deserve to be taken seriously and to have support from your medical team. \n\nthere’s hope for recovery 💙",
          "created_utc": 1568063445.0
        }
      ]
    },
    {
      "id": "ezqzn4s",
      "author": "FuckyouHydra",
      "body": "The fact to know that I'm not alone is a comfort in itself and both a sharp pain knowing that others have to suffer the same like me. It's \"nice\" to know I'm not a freak. But it's hard to know that out there other people are going through the same. I wish I could cure it all, I don't want others to suffer",
      "created_utc": 1568065898.0,
      "score": 7,
      "context": [
        {
          "id": "ezqz94w",
          "author": "TeatothewhY",
          "body": "I weighed my lowest last week at 171, and I started at 245 eight months ago as well. I also have been stuck in a mostly restrictive binge/fast cycle. My therapist just last week told me I have a food addiction. My primary doctor refers to everything I do as binging. Those all encompassing labels have put me into such a downward spiral I can’t even think straight. I actually just posted about this. But even though I can’t relate to you on being underweight and not getting help, I feel like I can relate to the frustration of not feeling/being told you’re not sick enough. Because honestly I truly can’t tell if I’m sick or not anymore. So sorry you’re going through this. I wish I had something helpful to offer, but all I have for you is to say you’re not alone.",
          "created_utc": 1568065763.0
        }
      ]
    },
    {
      "id": "ezr1a82",
      "author": "FuckyouHydra",
      "body": "[If you're transphobic please just move along, I don't want another chain of transphobic comments again, not in the headspace to deal with it rn]\n\nI mean yes, that's true but I'm ftm. (Female to male) and I don't even know what they see me as, I mean my doctor is a transphobe, my therapist is not, he probably still sees me as a girl (he = doctor), she sees me as a man (she = therapist) but they both just make fun of my disorder",
      "created_utc": 1568066738.0,
      "score": 5,
      "context": [
        {
          "id": "ezr0ndl",
          "author": "Hahhahahhohno",
          "body": "I hate to say it, but even medical professionals sometimes take eating disorders in men less seriously. That might be why your doctors are dismissing your symptoms and experiences.\n\nI'm really sorry. Your disorder is real. I'm sorry you're struggling",
          "created_utc": 1568066324.0
        }
      ]
    },
    {
      "id": "ezrvcjz",
      "author": "Hahhahahhohno",
      "body": "That's so awful and ugly for you to be dealing with. Your doctor is particular sounds worthless and like he shouldn't be practicing. And ANYONE who is making fun of your disorder is not a competent therapist. You deserve a healthcare team that respects you and takes care of your ACTUAL needs as you express them.\n\nAlso, fuck transphobes, man. I'm sorry you've had to deal with them too.",
      "created_utc": 1568079295.0,
      "score": 4,
      "context": [
        {
          "id": "ezr0ndl",
          "author": "Hahhahahhohno",
          "body": "I hate to say it, but even medical professionals sometimes take eating disorders in men less seriously. That might be why your doctors are dismissing your symptoms and experiences.\n\nI'm really sorry. Your disorder is real. I'm sorry you're struggling",
          "created_utc": 1568066324.0
        },
        {
          "id": "ezr1a82",
          "author": "FuckyouHydra",
          "body": "[If you're transphobic please just move along, I don't want another chain of transphobic comments again, not in the headspace to deal with it rn]\n\nI mean yes, that's true but I'm ftm. (Female to male) and I don't even know what they see me as, I mean my doctor is a transphobe, my therapist is not, he probably still sees me as a girl (he = doctor), she sees me as a man (she = therapist) but they both just make fun of my disorder",
          "created_utc": 1568066738.0
        }
      ]
    }
  ]
}