{
  "id": "d3i26u",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1568338985.0,
  "title": "Is what we think of as \"binging\" really just the natural reaction to restriction",
  "selftext": "I think for people with restrictive eating disorders like myself, they are just in a constant state of restriction until they're not when they eat. Whenever I eat something, I usually instantly feel the need to eat more and always thought this was a \"binge\" instinct. Now I'm starting to think that's just my ED brain that's calling it binging - I find when I'm restricting it's always \"how long can I go without food\" until I break. So when I do eat food it's like my real brain is like \"oh shit, now is my chance to actually get food before the restriction starts again\". Is it really \"binging\" to act on that? Is it really this horrible bad thing I've made it out to be? \n\nHonestly just typing it out and seeing it as words on a screen is showing me how stupid the ED thoughts are. No it's not binging to eat more than planned. To even have a \"planned\" amount of shit to eat is honestly kind of an eating disorder thing for me at least. Like \"oh I'm ONLY going to eat x amount of this\", that's why if I eat more it's seen as a \"binge\".",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/d3i26u/is_what_we_think_of_as_binging_really_just_the/",
  "score": 105,
  "num_comments": 9,
  "comments": [
    {
      "id": "f02zohb",
      "author": "wanderlustcub",
      "body": "Think of restricting and binging as a pendulum. the more you restrict, the more your body will want to \"binge\" to get you back to normal. the harder you swing in one direction, the larger you will swing in the other direction\n\n&#x200B;\n\nThat is why regular eating is good, because it helps even out the swings.\n\n&#x200B;\n\nI remember when I was first in recovery, and I tearfully told my therapist that I \"binged\" three pieces of pizza and how horrible I was... and she was like \"wanderlust cub, three pieces is absolutely not binging\"\n\nSo I totally get where you are coming from.",
      "created_utc": 1568341428.0,
      "score": 61,
      "context": []
    },
    {
      "id": "f03by44",
      "author": "None",
      "body": "I would call this \"reactive eating\" in which you 'over' eat in reaction to undereating.",
      "created_utc": 1568350976.0,
      "score": 20,
      "context": []
    },
    {
      "id": "f03y0ei",
      "author": "doctorslacker",
      "body": "You are absolutely correct. Even the definition of binge eating disorder doesn’t allow it to be diagnosed during the course of anorexia nervosa, because prolonged periods of extreme restriction DEFINITELY cause physiological responses like extreme hunger, food focus, etc. that are there because the body NEEDS the sufferer to overeat to replenish energy stores and lost tissue. Eventually eating should level out rather than having peaks and valleys, but a period of eating significantly over maintenance calories can actually be tremendously physically and psychologically beneficial. I strongly recommend Kayla Rose on YouTube for those who are open to non-standard methods of recovery and willing to accept weight gain. Before I found her, this was the method I used to FINALLY recover myself, because it helped SO much more than eating 2000 calories a day and STILL being food focused on top of being body-conscious. Once the extra food got my brain right, it was like I was a completely different person.",
      "created_utc": 1568374239.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f044973",
      "author": "Elle241",
      "body": "Yes. Binging is the body’s natural response to starvation (to put it simply).",
      "created_utc": 1568379252.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f04wo9t",
      "author": "cocoakobra",
      "body": "I once had an ED specialized therapist tell me there’s no such thing as a binge with restrictive anorexic because when you do eat a lot, it’s your body just struggling to play catch up with missing nutrients. That sticks with me a lot.\n\nI think of it similarly to how if you starve an animal, the moment they get food they’re going to eat ALL of it as soon as possible and then seek more.",
      "created_utc": 1568397347.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f04wjee",
      "author": "kellsybellsy",
      "body": "Have you ever read the book Brain Over Binge by Kathryn Hansen? She writes about binging as a survival instinct/reaction to dieting and restriction. I consider it a miracle of sorts and can’t say it was only this book but I read it and my binging episodes stopped soon after and haven’t returned!",
      "created_utc": 1568397258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f03891j",
      "author": "None",
      "body": "I was told by my therapist there are two forms of binging. I called myself bulimic but she diagnosed me with anorexia...and that is because I would purge after what is called a \"subjective\" binge. Eating a 550 calorie meal is NOT a binge. Restrictive eaters consider it a binge, making it subjective in name. An objective binge is one where any normal person could/would not attempt to consume that number of calories in one sitting...say 2,000 or 5k, who knows- but some larger number. \n\nSo, perhaps sometimes you are feeling as if you binged, but technically that's not the case. \n\nAlso I entirely agree that your body has preservation instinct and it is enticing you to do what you need to do you function optimally. Restrictive behaviors force conservation of energy physically, mentally, emotionally. You're body's ability to adapt and adjust is compromised...so yeah, you're body wants to get out of the calorie deficit. Which is why anorexia is much less common than binge eating disorder.",
      "created_utc": 1568347545.0,
      "score": 23,
      "context": [
        {
          "id": "f02zohb",
          "author": "wanderlustcub",
          "body": "Think of restricting and binging as a pendulum. the more you restrict, the more your body will want to \"binge\" to get you back to normal. the harder you swing in one direction, the larger you will swing in the other direction\n\n&#x200B;\n\nThat is why regular eating is good, because it helps even out the swings.\n\n&#x200B;\n\nI remember when I was first in recovery, and I tearfully told my therapist that I \"binged\" three pieces of pizza and how horrible I was... and she was like \"wanderlust cub, three pieces is absolutely not binging\"\n\nSo I totally get where you are coming from.",
          "created_utc": 1568341428.0
        }
      ]
    },
    {
      "id": "f03etpk",
      "author": "None",
      "body": "Do you think “binging” is necessary in recovery? I mean, binging for us and others with EDs pretty much just comes down to unrestricted eating, and the reason that people eat as much as they do is because of the restriction. \n\nBasically, is eating thousands of calories multiple times a week necessary on the path to recovery?",
      "created_utc": 1568353753.0,
      "score": 7,
      "context": [
        {
          "id": "f02zohb",
          "author": "wanderlustcub",
          "body": "Think of restricting and binging as a pendulum. the more you restrict, the more your body will want to \"binge\" to get you back to normal. the harder you swing in one direction, the larger you will swing in the other direction\n\n&#x200B;\n\nThat is why regular eating is good, because it helps even out the swings.\n\n&#x200B;\n\nI remember when I was first in recovery, and I tearfully told my therapist that I \"binged\" three pieces of pizza and how horrible I was... and she was like \"wanderlust cub, three pieces is absolutely not binging\"\n\nSo I totally get where you are coming from.",
          "created_utc": 1568341428.0
        }
      ]
    },
    {
      "id": "f03ggiq",
      "author": "None",
      "body": "I've found it very necessary to consult with a dietician. I've been told that often times one ED can precede another, meaning that often times people with anorexia can become subsequently develop bulimia or binge eating habits. I think the problem centers around the unhealthy emotional connectivity that we displace on our relationship to food.\n\nI've seen people go from absolute restriction to full on sugar addiction with really high caloric intake. I think primarily the necessary alteration is observing your tendencies with kindness, compassion, understanding, and awareness that your body has been in a literal state of famine and believes that it will not obtain the amount of calories necessary to replenish itself before being starved again. There are many physiological changes, epigenetic changes that have taken place as a result of the behaviors.\n\nThere is a reason people are put on regimens in residency. The intake starts high in order to get your body initially out of a desert mindset, and there is science to support this. However, it is done in intervals with constituents of fat, protein, and carbs carefully balanced. Three meals, and three snacks. I find this necessary for me because otherwise when I start eating I sort of go into a sense of panic and eat an amount that I don't believe is even helpful to my body the intake is so high.\n\nI'm sure you've read stories about people who have been rescued from disaster zones or isolation that experienced starvation...they can't eat anything and everything immediately, it causes the body to go into shock. Instead, they go through a re-feeding process. Their body learns how to do peristalsis, extract nutrients, excrete waste, and ultimately rely on constant sources of nutrition for all the biological needs it has to meet.\n\nI don't think it's a behavior worth self-punishment which would further compromise your recovery, but I do think long term it will reinforce another pattern of behavior that demonstrates a strained relationship with food. This is why I really try to communicate and take advice from my nutritionist. She is highly educated, well thought of in ED specialty, and keeps up-to-date on the newest research.",
      "created_utc": 1568354905.0,
      "score": 6,
      "context": [
        {
          "id": "f02zohb",
          "author": "wanderlustcub",
          "body": "Think of restricting and binging as a pendulum. the more you restrict, the more your body will want to \"binge\" to get you back to normal. the harder you swing in one direction, the larger you will swing in the other direction\n\n&#x200B;\n\nThat is why regular eating is good, because it helps even out the swings.\n\n&#x200B;\n\nI remember when I was first in recovery, and I tearfully told my therapist that I \"binged\" three pieces of pizza and how horrible I was... and she was like \"wanderlust cub, three pieces is absolutely not binging\"\n\nSo I totally get where you are coming from.",
          "created_utc": 1568341428.0
        },
        {
          "id": "f03etpk",
          "author": "None",
          "body": "Do you think “binging” is necessary in recovery? I mean, binging for us and others with EDs pretty much just comes down to unrestricted eating, and the reason that people eat as much as they do is because of the restriction. \n\nBasically, is eating thousands of calories multiple times a week necessary on the path to recovery?",
          "created_utc": 1568353753.0
        }
      ]
    }
  ]
}