{
  "id": "d4dyjq",
  "subreddit": "fuckeatingdisorders",
  "author": "Sir_holy_bears",
  "created_utc": 1568510085.0,
  "title": "Finally talked about my disorder out loud, and I feel GREAT",
  "selftext": "Maybe nobody else will see this as a huge deal but I ACKNOWLEDGE MY ED TO SOMEONE!!\nAs a man with anorexia, I have a tough time talking about my ED. Of the four people who I have told in the past five years, most of them don't believe that it's a real problem since \"only girls are anorexic.\" They insist I'm just stressed or don't have a good appetite. For that reason and many more, I have not shared this with anyone new in four years.\nUntil yesterday.\nI've been falling for a girl (first time in years--basically since my ED took my freedom, libido, and trust in my own emotions from me), and we've been in that amazing stage of moving from small talk flirting to really getting to know each other. We both are really into running together, and I enjoy running with her because it isn't about speed or tracking calories. Together, we just do it for the runners' high and to clear our heads and admire the scenery around us. I told her that I often run for the wrong reasons on my own, and I could tell she truly cared when she asked me if I would be comfortable talking about what I meant. It led to an incredible conversation and many discoveries for both of us as we discussed the disorder (she has a history with anorexia as well, which I did not know before but I had suspected in subtle ways). I also told her I didn't want this to change anything between us because I love eating meals with her--the thoughts of calories and guilt are kept at bay by my happiness when we go out for lunch together. She isn't a crutch in my life, but she helps bring out the side of me that I love and haven't known for some time.\nI'm not sure why I'm sharing this, but I think I have just always been so afraid of sharing this side of me with people who I know care enough about me to try and help. I thought that it would somehow undo my identity. But I did it. And guess what? THE WORLD DIDN'T END! I feel so free and proud! I still have a lot to work through, but all of my recovery efforts so far over the years have come up short. Maybe choosing this first step will make this time different. I feel great:) if I can do it, so can you!!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/d4dyjq/finally_talked_about_my_disorder_out_loud_and_i/",
  "score": 111,
  "num_comments": 12,
  "comments": [
    {
      "id": "f0amzpj",
      "author": "None",
      "body": "that is amazing, thank you for sharing. 💜 it takes a lot of strength to open up abt this, and i’m so glad you found someone that you feel safe talking to.",
      "created_utc": 1568516567.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f0b2vze",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1568521852.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f0a540x",
      "author": "swtmadness",
      "body": "great.  i'm happy for you.  :)",
      "created_utc": 1568510725.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0baj9k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1568524514.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0bnxr8",
      "author": "annabel_182",
      "body": "this makes my heart feel so warm :)",
      "created_utc": 1568529581.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0de5zo",
      "author": "None",
      "body": "Awww this is so great to hear! I'm glad you were able to be honest with her AND have your issue be acknowledged and understood. How wonderful.\n\nYou can get better and be free of this disorder ❤ it just takes time and the right support.",
      "created_utc": 1568552999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0fnulz",
      "author": "Spectrachic311311",
      "body": "This is so great to hear. I know it was really hard for me to open up to my fiancé (now husband) about my issues with food and exercise. He was great about it and it sounds like your girlfriend is being supportive. That will really help in the long run.",
      "created_utc": 1568586401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0gvg7z",
      "author": "TheRealMrsMeeseeks",
      "body": "This is so wonderful to hear. I’m so happy when I read celebratory or uplifting posts like this.",
      "created_utc": 1568607042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0ihgpy",
      "author": "Little-Rexy",
      "body": "Continue to be proud brother! My wife brings the best out of me everyday, and she is my ROCK! I can completely understand! Stay Strong and keep sharing- Fuck Ana and her cold grasp! (Hugs)",
      "created_utc": 1568641806.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0g63hl",
      "author": "Sir_holy_bears",
      "body": "With this community's and now my own personal loved ones' support, I feel more confident than ever. Thank you ❤️",
      "created_utc": 1568594293.0,
      "score": 2,
      "context": [
        {
          "id": "f0b2vze",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1568521852.0
        }
      ]
    },
    {
      "id": "f0g5yvr",
      "author": "Sir_holy_bears",
      "body": "Something so simple is all it takes to turn my day around. Thank you:)",
      "created_utc": 1568594223.0,
      "score": 2,
      "context": [
        {
          "id": "f0baj9k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1568524514.0
        }
      ]
    },
    {
      "id": "f0g5zjt",
      "author": "Sir_holy_bears",
      "body": "Mine too:)",
      "created_utc": 1568594233.0,
      "score": 1,
      "context": [
        {
          "id": "f0bnxr8",
          "author": "annabel_182",
          "body": "this makes my heart feel so warm :)",
          "created_utc": 1568529581.0
        }
      ]
    },
    {
      "id": "f0g5wak",
      "author": "Sir_holy_bears",
      "body": "Thank you. This community has helped SO MUCH this year.",
      "created_utc": 1568594186.0,
      "score": 1,
      "context": [
        {
          "id": "f0de5zo",
          "author": "None",
          "body": "Awww this is so great to hear! I'm glad you were able to be honest with her AND have your issue be acknowledged and understood. How wonderful.\n\nYou can get better and be free of this disorder ❤ it just takes time and the right support.",
          "created_utc": 1568552999.0
        }
      ]
    },
    {
      "id": "f0g5tyu",
      "author": "Sir_holy_bears",
      "body": "Thank you! One of the greatest things is that she hasn't behaved differently around me since I told her. She normalizes food for me, unlike other loved ones who do more harm than good by constantly asking if I'm eating enough or insisting I eat more. It's incredibly helpful! Congrats on finding that in your marriage:)",
      "created_utc": 1568594154.0,
      "score": 1,
      "context": [
        {
          "id": "f0fnulz",
          "author": "Spectrachic311311",
          "body": "This is so great to hear. I know it was really hard for me to open up to my fiancé (now husband) about my issues with food and exercise. He was great about it and it sounds like your girlfriend is being supportive. That will really help in the long run.",
          "created_utc": 1568586401.0
        }
      ]
    }
  ]
}