{
  "id": "diovhf",
  "subreddit": "fuckeatingdisorders",
  "author": "freddybobeddy",
  "created_utc": 1571230260.0,
  "title": "I’ve started becoming comfortable with my weight restored body out of the blue",
  "selftext": "So for the last month i’ve suddenly become strangely comfortable with my body... It’s kinda crazy. It’s been kinda out of the blue, but it happened around the time I stopped working out completely. Obviously i’m not loving it and flaunting it at any opportunity haha, but I can live with this.\n\nI never thought I could make progress in this area. I thought I was the exception, that I’d forever hate my body and think its unacceptable. Now I realize that I look average, and thats ok. I used to think average wasn’t enough, that I had to prove that I’m a good, hard working person through being different somehow. \n\nI have an average body and an average life and that makes me feel pretty content. Maybe I seem uninteresting to some but honestly who cares, I’m the one who has to deal with chaos of fitting myself into some mould. \n\nIdk, maybe me posting this could help someone. Body image issues are a bitch and it felt like I wasn’t making progress for so long. There’s hope you guys :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/diovhf/ive_started_becoming_comfortable_with_my_weight/",
  "score": 91,
  "num_comments": 10,
  "comments": [
    {
      "id": "f3xacoa",
      "author": "sesimon8",
      "body": "This makes me so happy. It also makes me ask myself (again), are eating disorders fed by this idea that we are meant to be better than everyone else? What is so wrong with what some would call \"average\"? It's about finding the extraordinary in the mundane.\n\nCelebrate this time, but all the processes of a weight-restored body take some time to come back. For instance, this article talks about a process of starting to enjoy and find pleasure in sex while/after recovering from anorexia.\n\nhttps://medium.com/pulpmag/draft-ana-sex-on-eating-disorders-and-sex-and-why-poetry-is-the-only-real-way-to-talk-about-91751983ebc1",
      "created_utc": 1571234869.0,
      "score": 16,
      "context": []
    },
    {
      "id": "f3x93cz",
      "author": "None",
      "body": "Average doesn't mean boring, it just means you're part of a standard thing. You can live a very exciting life with an average-sized body. Probably even more than with a very deprived body, since you have more energy!\n\nI'm very happy that you are doing better both on the physical and mental aspects 💕",
      "created_utc": 1571234220.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f3x8opz",
      "author": "kmthyn95",
      "body": "I’m so happy for you!!\nI hope one day I feel the same way you!\nBest of luck and take care always!❤️",
      "created_utc": 1571234011.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f3x5ftk",
      "author": "None",
      "body": "yay <3",
      "created_utc": 1571232345.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3y1s0m",
      "author": "None",
      "body": "This reminded me that i have always felt the pressure to succeed in every aspect of my life. And when i hit 105 lbs i felt like i failed at something and so i lost weight and then it became an ED. Now im recovering and i am suprised that i am more comfortable with my body.",
      "created_utc": 1571247304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3ymlez",
      "author": "snake_pod",
      "body": "Aw man this post gives me hope. You're so strong, I hope I can get to this point too one day",
      "created_utc": 1571256259.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3yw54j",
      "author": "swingsurfer",
      "body": "Thanks for posting! This is the kind of stuff that needs to be posted here.",
      "created_utc": 1571260229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3zbuyy",
      "author": "WookieRubbersmith",
      "body": "CONGRATULATIONS!!!!\n\nI kinda know what you're talking about. I remember pretty clearly that sort of sudden sense of unfamiliar peace. I DO still have hard days or weeks every now and then where I feel myself sliding away from that sense of okay-ness, but they get less frequent all the time.\nMy life is small and comfortable and I'm very content the vast majority of the time.\n\n You dont sound uninteresting to me--you sound *happy.* Thank you for sharing this little ray of hope! What an awesome thing you've achieved :)",
      "created_utc": 1571265977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f405d11",
      "author": "forestfairy23",
      "body": "SAME!!! I am in my weight restored body now (as of 3 months) and I’m realizing that being able to ENJOY life, eat at restaurants, eat with my friends, live free from ED and having this body is MUCH better than the other reality of starving, depression, no friends/happiness and being skinny.",
      "created_utc": 1571285600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f41zxhq",
      "author": "ThatOnePotential",
      "body": "This is so great! I suspect that physical effects of restriction on the brain sort of fuels our inability to see things as they are. I know that once I got to a certain point of nourishment in recovery, I wasn't as harsh to myself about the weight gain. I'm not saying I still don't have bad days with it, but definitely isn't as bad as when I was  in the throes of my ED.",
      "created_utc": 1571325835.0,
      "score": 1,
      "context": []
    }
  ]
}