{
  "id": "dlghd8",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1571743247.0,
  "title": "My friend said I look \"thick\" and I'm losing it",
  "selftext": "I run a gym, he's a friend, and I know he was saying it as a compliment. I had been doing really really well in recovery after a bad breakdown a few years ago and the subsequent years of therapy. It's been harder recently for a variety of reasons, and I recognize that I've gone back to doing some things that I greatly enjoy but really serve ED.\n\n&#x200B;\n\nHe said that to me last night while I was teaching a (bootcamp style) class and I thought I was going to start crying right there. I'm 30 years old. I'm successful at work, I compete in a strength sport, I shouldn't be offended by a compliment like that, but now my appetite is completely gone again. I hate this. It never stops.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/dlghd8/my_friend_said_i_look_thick_and_im_losing_it/",
  "score": 92,
  "num_comments": 5,
  "comments": [
    {
      "id": "f4pw9tt",
      "author": "None",
      "body": "Fantastic opportunity for neural rewiring. What you are experiencing is an automatic response due to years of that being nurtured as the \"correct\" response in your brain. Obviously it is incorrect. So retrain it. Take this as an excellent lesson. Regardless of appetite, eat mechanically, your normal meals, snacks etc. & eventually this will teach your brain that you needn't \"lose appetite\" when the disorder twists a compliment like that.\n\nGood luck! It feels horrible at the time (I am well aware) but it really is a great opportunity for changing the way you think & any automatic, disordered behaviour that pops up.\n\nI hope I worded that in an understandable way. I'm not sure how I wrote it made sense but here's hoping you got the gist :)",
      "created_utc": 1571743988.0,
      "score": 73,
      "context": []
    },
    {
      "id": "f4q3toj",
      "author": "SemicolonButterfly",
      "body": "I think comments like that upset my emotional equilibrium so dramatically because they play right into deep fears about myself and about how I’m perceived by others. There’s a tsunami of old thoughts and feelings and action urges. I can’t really logic my way out of it, but there are some tools I can use to shape my response.\n\n\nSaying,  “Hey, that’s old thinking.” helps me separate myself from the thought. My unhelpful and unhealthy thoughts often *feel* true just because I’ve thought them so intensely for so long. And also because I’ve taught myself they’re true by acting as though they’re true. But it turns out thoughts that feel reallly true can still be total lies.\n\n\nThen I have to *act* on new healthier thoughts instead of the old. Whichever thought I choose to act on is the thought I will strengthen. So over and over and over the question arises...which will I choose? I don’t do it perfectly by any means. But even a small start is enough for a shift and I’m hopeful that momentum will build. <3",
      "created_utc": 1571747546.0,
      "score": 22,
      "context": []
    },
    {
      "id": "f4rjxrt",
      "author": "bflowry",
      "body": "Reiterating all of the comments by other posters. I couldn’t have said any of it better myself.\n\nBody comments are extremely triggering; it’s often a lose-lose situation. If someone says I look “good,” my mind spins, trying to put a definition to “good.” If someone says I look thin, my mind spins just as fast, again focusing solely on semantics (which will never be good enough to match what the eating disorder wants to hear/feel).\n\nIt would be extremely helpful if body comments, in general, weren’t so commonly exchanged in every day interactions. Unfortunately, it’s unavoidable. What we can do for ourselves is strengthen the voice of our true selves by working to actively rewire those outdated, negative neural pathways with new thoughts/beliefs. The work is hard, but trusting that the effort and time are worth it. You aren’t alone. 💛",
      "created_utc": 1571768465.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f4q3lzk",
      "author": "selfcontrolwya",
      "body": "this is such great advice! that losing appetite thing is so accurate but i’m working on it every day",
      "created_utc": 1571747448.0,
      "score": 8,
      "context": [
        {
          "id": "f4pw9tt",
          "author": "None",
          "body": "Fantastic opportunity for neural rewiring. What you are experiencing is an automatic response due to years of that being nurtured as the \"correct\" response in your brain. Obviously it is incorrect. So retrain it. Take this as an excellent lesson. Regardless of appetite, eat mechanically, your normal meals, snacks etc. & eventually this will teach your brain that you needn't \"lose appetite\" when the disorder twists a compliment like that.\n\nGood luck! It feels horrible at the time (I am well aware) but it really is a great opportunity for changing the way you think & any automatic, disordered behaviour that pops up.\n\nI hope I worded that in an understandable way. I'm not sure how I wrote it made sense but here's hoping you got the gist :)",
          "created_utc": 1571743988.0
        }
      ]
    }
  ]
}