{
  "id": "do3bag",
  "subreddit": "fuckeatingdisorders",
  "author": "sophiegarrettt",
  "created_utc": 1572232337.0,
  "title": "My boyfriend will love that I'm happy more than he'll care that I'm fat (mild Bojack Horseman S6 Spoiler)",
  "selftext": "It's kind of ridiculous that a Bojack Horseman episode gave me this moment of realization, but something about it just released so much tension for me. \n\nI've been trying not to log or restrict my eating so that I can destigmatize food for myself, which has predictably led to me gaining a visible amount of weight. I've been feeling awful about it but am keeping at it instead of giving into the (frequent, but decreasing) urge to purge or restrict again. \n\nMy boyfriend has been so supportive throughout all of this, but even though I believe him when he says he'll love me no matter my weight, it's hard to drill into my head, and my ED thoughts that fat makes me less worthy of living and being loved will not let up. \n\n(Spoilers)\nIn the new season of Bojack Horseman, one character, Diane, struggles with depression. When her boyfriend suggests that she at least try the antidepressant pills that her doctor recommended, one reason she gives for not wanting to take them is that she did once before, and she gained weight. Her depression is killing her though; she's miserable, unproductive, and disorganized. Much like I was in the depths of my ED.\n\nAnyway, her boyfriend has to travel for work, so they go long distance for a little while. The next time we see them, Diane is meeting her boyfriend at the airport to welcome him home. She's gained a significant amount of weight, but she's smiling. It's clearly implied that she took the antidepressants. The shot cuts to her boyfriend, and he doesn't even have a moment of hesitation. He just smiles.\n\nA real partner is going to care about my wellbeing more than if I have a double chin, if my stomach sticks out, if I have grabbable fat. It's still me, and just because I ate doesn't mean I'm taking up space I don't deserve. He wants me and he wants me to be happy. I believe it and seeing an example of it was just some nice reassurance. I know I'm not going to stop obsessing over my body, at least not in the foreseeable future, but seeing this example of love in the media just provided a little more affirmation in the right direction for me.\n\nThanks for reading, just wanted to get this off of my chest.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/do3bag/my_boyfriend_will_love_that_im_happy_more_than/",
  "score": 109,
  "num_comments": 15,
  "comments": [
    {
      "id": "f5jr4lm",
      "author": "None",
      "body": "i love you",
      "created_utc": 1572237380.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f5jpsfw",
      "author": "TeenageGingerTurtle",
      "body": "This was really beautiful to read, and so so true. Thank you so much for sharing <3",
      "created_utc": 1572235901.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f5js162",
      "author": "where__didyougo",
      "body": "Thank you. I needed this.",
      "created_utc": 1572238420.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f5k36mr",
      "author": "None",
      "body": "Hey, I've been watching Bojack Horseman too! That part also hit me hard and I ended up crying a bit when I was watching it.",
      "created_utc": 1572253583.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f5kgr4g",
      "author": "r-egress",
      "body": "I teared up a little.. :')",
      "created_utc": 1572262984.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5lvnup",
      "author": "Luckypenny4683",
      "body": "This is real af though. Nothing has helped my recovery more than knowing that my husband is attracted to me, and even more so when I’m happy and committed to recovery. Even when my body doesn’t look like *my* ideal.",
      "created_utc": 1572283832.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5lctij",
      "author": "problematicbeing",
      "body": "I just watched this episode and felt conflicted on that scene. It's beautiful that Guy accepted Diane and smiled at her and was so happy to see her doing better. But at the same time, the weight gain was really dramatic and it's like the audience was supposed to assume she was less worthy of love since her body was larger and that Guy loved her in spite of her size. It just seemed like subtle fat-phobia which I now notice in TV a ton. Plus most people who experience weight gain as a side effect of medicine only gain a marginally small amount of weight so Diane's case would be super fringe. \n\n&#x200B;\n\nThe people who care about you genuinely should care about you no matter your physical appearance <3 I think the scene definitely was beautiful and powerful. If you love someone, you want them happy and healthy and you will prioritize that over anything else.",
      "created_utc": 1572276889.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5lsgwo",
      "author": "Litcritter10",
      "body": "That is a beautiful insight.  Thank you for sharing.  I'm going to go track down that episode right now.",
      "created_utc": 1572282739.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5mlffz",
      "author": "None",
      "body": "I love this show. I just started season 6, and I can’t wait to get to this episode. It’s how I wanna feel in my relationship, that kind of security in my own body and how I’m perceived. Someday :)",
      "created_utc": 1572291139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f5mui3v",
      "author": "EastofEatin",
      "body": "Super duper proud of you ❤❤❤\n\nKeep up the good fight, you're doing amazing!",
      "created_utc": 1572293782.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f5js8jh",
      "author": "sophiegarrettt",
      "body": "❤️",
      "created_utc": 1572238666.0,
      "score": 5,
      "context": [
        {
          "id": "f5jr4lm",
          "author": "None",
          "body": "i love you",
          "created_utc": 1572237380.0
        }
      ]
    },
    {
      "id": "f5jsa7o",
      "author": "sophiegarrettt",
      "body": "thanks for reading ❤️",
      "created_utc": 1572238722.0,
      "score": 3,
      "context": [
        {
          "id": "f5jpsfw",
          "author": "TeenageGingerTurtle",
          "body": "This was really beautiful to read, and so so true. Thank you so much for sharing <3",
          "created_utc": 1572235901.0
        }
      ]
    },
    {
      "id": "f5jscef",
      "author": "sophiegarrettt",
      "body": "Thank you for reading. You're beautiful and you deserve to be happy too ❤️",
      "created_utc": 1572238795.0,
      "score": 6,
      "context": [
        {
          "id": "f5js162",
          "author": "where__didyougo",
          "body": "Thank you. I needed this.",
          "created_utc": 1572238420.0
        }
      ]
    },
    {
      "id": "f5p9bu9",
      "author": "jmhh2",
      "body": "This. It hit hard. Hard. \nAlso, his feeling like he belonged in treatment struck a million chords. I wish I could learn more about this. Believe institutionalization encapsulates inpatient ED/psych units. Would love to learn more...",
      "created_utc": 1572353193.0,
      "score": 2,
      "context": [
        {
          "id": "f5lctij",
          "author": "problematicbeing",
          "body": "I just watched this episode and felt conflicted on that scene. It's beautiful that Guy accepted Diane and smiled at her and was so happy to see her doing better. But at the same time, the weight gain was really dramatic and it's like the audience was supposed to assume she was less worthy of love since her body was larger and that Guy loved her in spite of her size. It just seemed like subtle fat-phobia which I now notice in TV a ton. Plus most people who experience weight gain as a side effect of medicine only gain a marginally small amount of weight so Diane's case would be super fringe. \n\n&#x200B;\n\nThe people who care about you genuinely should care about you no matter your physical appearance <3 I think the scene definitely was beautiful and powerful. If you love someone, you want them happy and healthy and you will prioritize that over anything else.",
          "created_utc": 1572276889.0
        }
      ]
    },
    {
      "id": "f5jsfnm",
      "author": "where__didyougo",
      "body": "No, thank you for writing it. It really touched me. You are also a beautiful person, and I believe you can beat this. You deserve recovery. You're not an exception to it, ever. Stay strong, take it one day at a time. You're doing fantastic.",
      "created_utc": 1572238904.0,
      "score": 6,
      "context": [
        {
          "id": "f5js162",
          "author": "where__didyougo",
          "body": "Thank you. I needed this.",
          "created_utc": 1572238420.0
        },
        {
          "id": "f5jscef",
          "author": "sophiegarrettt",
          "body": "Thank you for reading. You're beautiful and you deserve to be happy too ❤️",
          "created_utc": 1572238795.0
        }
      ]
    }
  ]
}