{
  "id": "dodgvi",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1572289415.0,
  "title": "My old body was my better body.",
  "selftext": "To mourn my old body is to eat and cry at the same time.\n\nIt didn't matter that I was tired all the time.\n\nIt didn't matter that I felt like shit, mentally and physically.\n\nIt didn't matter that I was irritable and moody and there were days where I could barely drag myself out of bed.\n\nWhat mattered is that I could look in the mirror and be satisfied with what I saw. I was finally *thin enough*.\n\nToday, my clothes fit differently. My size S shirt is riding right up against my belly. My gym shorts are snug.\n\nI ate today, and I regret it, and I miss the tapeworm-hunger in my belly, and I miss feeling delicate and small and laughing as my husband effortlessly scooped me up and told me how hot I was.\n\nThere's an evil, perverse part of me that wishes I were sick, hospital sick, so I would dwindle back into my old body, my better body, and instead I've eaten today.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/dodgvi/my_old_body_was_my_better_body/",
  "score": 101,
  "num_comments": 8,
  "comments": [
    {
      "id": "f5mly9i",
      "author": "forestfairy23",
      "body": "Yeah, but time to leave the romanticization behind. As much as your disorder is trying to trick you into thinking being sick to a point of hospitalization is the life that you want, I think that you need to spend some time remembering what your days were like. Watching your family cry and worry about you, putting your husband through hell, the mental pain the exhaustion, the hell on earth. Idk.",
      "created_utc": 1572291274.0,
      "score": 62,
      "context": []
    },
    {
      "id": "f5of7xu",
      "author": "donotresusciate",
      "body": "The old body that was always constipated \n\nThe old body that had haemorrhoids from that constipation \n\nThe old body that made people wince in the street with pity and turn to their friend and say ‘that’s so sad’. ‘Mmmhm. Sad way to live’. \n\nThe old body that made your husband feel sick to his stomach when he hugged you, wondering when he would have to plan your funeral \n\nThe old body that had lanugo in a pathetic attempt to keep itself warm \n\nThe old body that was constantly pale, washed out, with big dark circles under your eyes like a holocaust victim \n\nThe old body that plugged the shower with hair every time you washed it out or so much as brushed it, giving you the beginning looks of that creepy balding neighbour none of us trust \n\nThat old body that kept breaking out in acne and pimples \n\nThat old body that your husband felt sick to his soul about whenever he tried making love to you, because it was like being with a child. A sick, broken child \n\nThat old body which naturally hunched itself over to keep warm, and you could see when you needed to take a shit (which was always) because there was no tissue to hide the lumps and bumps of your organs \n\nYeah. That old body. \n\nI don’t know about you but let’s not go back to that body.",
      "created_utc": 1572316581.0,
      "score": 23,
      "context": []
    },
    {
      "id": "f5o6bk3",
      "author": "None",
      "body": "All bodies need food to be their best. A body that results from starvation is not and never will be a better body. All bodies need food to be their best.",
      "created_utc": 1572310942.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f5mk8dc",
      "author": "None",
      "body": "Me :(",
      "created_utc": 1572290792.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f5nlb49",
      "author": "shelleybean1",
      "body": "I understand the irony of wanting to be well but also sick. Of wanting to recover but wanting to hold on to the “good” body even though you know it’s unwell.",
      "created_utc": 1572301485.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f5ongpd",
      "author": "Criminalia",
      "body": "Beautifully written.",
      "created_utc": 1572323609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f5rfa4j",
      "author": "ZiggyStardustWasHere",
      "body": "This is what I needed to read. Thank you.",
      "created_utc": 1572393418.0,
      "score": 2,
      "context": [
        {
          "id": "f5o6bk3",
          "author": "None",
          "body": "All bodies need food to be their best. A body that results from starvation is not and never will be a better body. All bodies need food to be their best.",
          "created_utc": 1572310942.0
        }
      ]
    },
    {
      "id": "f5rj5cz",
      "author": "None",
      "body": "You’re welcome.",
      "created_utc": 1572395582.0,
      "score": 1,
      "context": [
        {
          "id": "f5o6bk3",
          "author": "None",
          "body": "All bodies need food to be their best. A body that results from starvation is not and never will be a better body. All bodies need food to be their best.",
          "created_utc": 1572310942.0
        },
        {
          "id": "f5rfa4j",
          "author": "ZiggyStardustWasHere",
          "body": "This is what I needed to read. Thank you.",
          "created_utc": 1572393418.0
        }
      ]
    }
  ]
}