{
  "id": "dufd29",
  "subreddit": "fuckeatingdisorders",
  "author": "hexual-frustration",
  "created_utc": 1573411328.0,
  "title": "Anyone else okay when they look in the mirror but pictures make them want to cry?",
  "selftext": "I could (and I have) simultaneously look in the mirror and take a photo of myself from the same vantage point. I look at myself in the mirror and am relatively okay with how I look these days. I look at the picture and I want to crawl under a rock and never be seen by humanity again.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/dufd29/anyone_else_okay_when_they_look_in_the_mirror_but/",
  "score": 143,
  "num_comments": 12,
  "comments": [
    {
      "id": "f75pzys",
      "author": "spelonberry",
      "body": "I saw this article on focal lengths and cameras and honestly, cameras distort reality. They can make a person look wildly different from in real life. The mirror is much more honest. Hope things get better for you 💝",
      "created_utc": 1573417882.0,
      "score": 31,
      "context": []
    },
    {
      "id": "f75tc0y",
      "author": "None",
      "body": "i’m literally having a near relapse and have cried (like actually sobbed) bc of pictures taken of me at a work event last thursday lol i feel that so hard 😔",
      "created_utc": 1573418886.0,
      "score": 14,
      "context": []
    },
    {
      "id": "f76qc3v",
      "author": "Millenial__Falcon",
      "body": "I'm pretty comfortable and confident in mirror me. I work in marketing though, and had to make a promotional video last week about my office, and I was in it. Went to go edit said video and literally thought to myself \"thats weird, that fat girl has the same blazer as me\".\n\nI feel you, OP.",
      "created_utc": 1573433033.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f77aqgp",
      "author": "SailorRose23",
      "body": "YEP. It makes me feel like I must have my mirror distorted or something. I don’t know which is the real me.",
      "created_utc": 1573449033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f77g4o3",
      "author": "None",
      "body": "For me it's the opposite 🙈",
      "created_utc": 1573455140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f77j7eg",
      "author": "phenomenalrocklady",
      "body": "Yes. I took a long period of time where I didn't look at any photos people took of me. Eventually it got easier when I was further in recovery.",
      "created_utc": 1573459321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f77t80n",
      "author": "Diggs9136",
      "body": "I go from thinking I look ok and not underweight, to actually seeing I am underweight",
      "created_utc": 1573474753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f784tn2",
      "author": "T_86",
      "body": "Honestly, I can’t walk by my reflection without looking and when I’m in front of an actual mirror I could stand there forever. It’s definitely not because I’m admiring myself like it probably seems though. Im picking apart every small detail I want to change and trying to figure out how. If I didn’t live with my bf I would seriously just throw a blanket over our huge bathroom mirror to avoid this, it’s so bad for my ED anxiety. \n\n\nTheir have been days when I’m wearing tight clothes that I actually think “Damn I look great, ppl are probably jealous”. Yet when my friends compliment me I get so awkward and don’t know what to say. It’s like if they only knew how I wish I could just be happy with an average body like them. They have no idea that when I’m at home I hide my body from myself by wearing loads of baggy clothes. They have no idea that every time I see myself in the mirror when coming out of the shower, my naked body makes me want to have a break down and cry on the floor. \n\nLong story short: mirrors are the devil! \n\nIf anyone knows of a good mirror that doesn’t distort and gives a more accurate reflection of our real shapes, PLEASE POST! \n\n^^see how messed up I am. I post a long rant of how bad mirrors are but I still want a good floor length mirror^^ wtf!!!!",
      "created_utc": 1573485252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f796343",
      "author": "auamethyst",
      "body": "Everybody looks differently in pictures! Haha Like you know when you have a selfie vs. tagged photos? It’s easy to distort what you look like when you look in the mirror. Don’t quote me on it, but I think your brain sees yourself differently than other people see you.",
      "created_utc": 1573503108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f77k8wo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1573460882.0,
      "score": 4,
      "context": [
        {
          "id": "f75pzys",
          "author": "spelonberry",
          "body": "I saw this article on focal lengths and cameras and honestly, cameras distort reality. They can make a person look wildly different from in real life. The mirror is much more honest. Hope things get better for you 💝",
          "created_utc": 1573417882.0
        }
      ]
    },
    {
      "id": "f780a5w",
      "author": "hexual-frustration",
      "body": "Looking back at pictures from high school when I thought I was fat, I can now see I was underweight. But now that I’m clinically overweight (my thyroid gave out in college) - it’s hard for me to even imagine that I’m okay when even doctors tell me I’m fat.",
      "created_utc": 1573481695.0,
      "score": 2,
      "context": [
        {
          "id": "f77t80n",
          "author": "Diggs9136",
          "body": "I go from thinking I look ok and not underweight, to actually seeing I am underweight",
          "created_utc": 1573474753.0
        }
      ]
    },
    {
      "id": "f77mgso",
      "author": "SlutForMarx",
      "body": "Because they spend ages getting the right pose and angle",
      "created_utc": 1573464432.0,
      "score": 3,
      "context": [
        {
          "id": "f75pzys",
          "author": "spelonberry",
          "body": "I saw this article on focal lengths and cameras and honestly, cameras distort reality. They can make a person look wildly different from in real life. The mirror is much more honest. Hope things get better for you 💝",
          "created_utc": 1573417882.0
        },
        {
          "id": "f77k8wo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1573460882.0
        }
      ]
    },
    {
      "id": "f77p8ay",
      "author": "None",
      "body": "Haha you anticipated exactly what I was thinking :)",
      "created_utc": 1573469053.0,
      "score": 2,
      "context": [
        {
          "id": "f75pzys",
          "author": "spelonberry",
          "body": "I saw this article on focal lengths and cameras and honestly, cameras distort reality. They can make a person look wildly different from in real life. The mirror is much more honest. Hope things get better for you 💝",
          "created_utc": 1573417882.0
        },
        {
          "id": "f77k8wo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1573460882.0
        }
      ]
    }
  ]
}