{
  "id": "dx1f3u",
  "subreddit": "fuckeatingdisorders",
  "author": "wastedoreos",
  "created_utc": 1573874069.0,
  "title": "“You don’t have to prove to me that you’re in pain”",
  "selftext": "Hey all. I found this this morning online and it resonated with me so I thought I’d share. \n\n\n\n“I remember one time when I was in an eating disorder treatment center and struggling to finish a particularly hard meal, a therapist kneeled down next to me and said, \n\n“You don’t need to prove to me that you’re in pain.” \n\nI could feel some emotion starting to come up and I tried to push it away. She said, “Tell me about the pain, Lindsay. Use you words, not your body.” That’s still one of the most powerful things I’ve been told when in my eating disorder. There have been times, even subconsciously, that I’ve used ED behaviors as a way of showing people how much pain I’m in, telling them that I am not okay inside.  There are still days when I’m tempted to take out my emotions on my body, to make my internal pain visible. But sometimes I think about this therapist and it makes me pause, even for a second, and remember that I don’t have to destroy myself to prove my pain to anyone. It is valid and real whether I look “sick enough” or not.”",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/dx1f3u/you_dont_have_to_prove_to_me_that_youre_in_pain/",
  "score": 166,
  "num_comments": 8,
  "comments": [
    {
      "id": "f7n4u7x",
      "author": "None",
      "body": "❤️❤️❤️",
      "created_utc": 1573884332.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f7n92oh",
      "author": "standsure",
      "body": "Use your words - that hits home for me today.",
      "created_utc": 1573890073.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f7nin8m",
      "author": "lemej",
      "body": "This is so revolutionary. Thanks for sharing this!",
      "created_utc": 1573905663.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f7ns39e",
      "author": "inftries",
      "body": "Thanks for sharing it. Somehow I needed to hear it today.",
      "created_utc": 1573914066.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f7o5irc",
      "author": "SailorRose23",
      "body": "Goddamn, that really resonated with me",
      "created_utc": 1573921222.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f7o6j9e",
      "author": "Lapamasa",
      "body": "Thank you for sharing.",
      "created_utc": 1573921771.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f7nu31t",
      "author": "eudaemonistic",
      "body": "I really needed this today, thank you for sharing.",
      "created_utc": 1573915209.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f7ocm7f",
      "author": "None",
      "body": "I love this. Thanks so much for sharing.",
      "created_utc": 1573925197.0,
      "score": 3,
      "context": []
    }
  ]
}