{
  "id": "e7i9p7",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1575745221.0,
  "title": "\"Wow, you lost a lot of weight! What's your secret?\"",
  "selftext": "Earlier today, I decided to grab a coffee with a good friend of mine and ran into a waitress who used to work at a local restaurant. I decided to say hi and ask her how she's doing. This innocuous question prompted her to comment on my weight loss and to ask what my *secret was*.\n\nI couldn't help myself and said, \"I actually just gained over 14 pounds and struggled with anorexia this year.\" Needless to say, that cut the conversation short, and while I'm okay with how I handled the situation, I'm beyond tired of the fact that people feel entitled to make comments about other people's bodies and tend to assume that any weight loss *must* be a good thing.  I spent most of my life as an overweight person and was underweight for the majority of 2019. I'm struggling with body dysmorphia and recovery, and relatively innocent (but invasive and impolite) comments like this one aren't exactly helpful.\n\nHow are we supposed to feel okay about ourselves when our bodies are subject to such scrutiny? I try to keep in mind that most, if not all of us have grown up in a society that's deeply fatphobic and obsessed with diets, and that we must try to be graceful when dealing with people who aren't far along their body positivity/neutrality journey, but it's so bloody effing difficult sometimes.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/e7i9p7/wow_you_lost_a_lot_of_weight_whats_your_secret/",
  "score": 122,
  "num_comments": 21,
  "comments": [
    {
      "id": "fa0jzdu",
      "author": "None",
      "body": "I answer in much the same way when people ask me how I've lost weight. Or \"how can you eat like that and stay thin?\" Well Linda I'm trying to recover from my obsessive thoughts over food and weight and you pointing out that you're noticing my food and body size sure isn't helping.  I never comment on anyone's weight loss or gain. When people tell me they've lost weight I usually ask \"on purpose?\" with a concerned look. If they're happy about their weight loss I say \"well I'm happy if you're happy. Congrats on your hard work.\" then change the subject.",
      "created_utc": 1575756181.0,
      "score": 57,
      "context": []
    },
    {
      "id": "fa0mgof",
      "author": "boba-boba",
      "body": "I have a client at my work who constantly asks me \"Oh, did you lose weight? You look great!\" and things like that. I've just started saying nope, same size! with a smile. It's hard enough out there for me, I don't need a stranger doing this...",
      "created_utc": 1575757312.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fa0qyhh",
      "author": "fvwne",
      "body": "When I was first beginning my recovery journey about five or six years ago, I was at a visitation for a funeral with my mom, who was aware that I was struggling with an eating disorder, and a distant relative that I hadn't seen in a LONG time had said to me \"oh my goodness you're so thin, what's your secret\" very enthusiastically and I had to bite my tongue and resist the urge to just say \"I don't eat and I am not doing well\". Not only that but I had to experience the horror on my mom's face when my relative asked that. I was also asked similar things in school, too. Its horrifying because you want to be brutally honest but also don't want people to worry or get the wrong impression you know? At least thats how I feel ¯\\\\\\_(ツ)\\_/¯",
      "created_utc": 1575758967.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fa0o5pj",
      "author": "amethystee",
      "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
      "created_utc": 1575757844.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fa157x5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1575764831.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fa1njdz",
      "author": "danimarie82",
      "body": "Those comments make me so uncomfortable. I usually brush it off but one day I snapped and said something about losing my appetite to severe anxiety. It wasn't a total lie, but I didn't want to out my eating disorder so that was the best I could come up with at the time. \n\nMy therapist recommended just saying the weight loss is \"because I'm hurting\". He said it makes the point without having to give out too much information and people usually feel uncomfortable and stop.",
      "created_utc": 1575772099.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fa3h5b0",
      "author": "tryinginliife",
      "body": "i feel you. when i was in my boarding school my housemates would ask me how i lost the weight and shit, i told them “i just eat healthier! you can do it too!” and every night i would skip school dinner and make my own at the house kitchen. people who asked me this would keep looking at my food and how little i was eating. it was so uncomfortable and i had to eat in the kitchen because we’re not allowed to bring hot food into our rooms. ugh.\nmy friend (who has an ED as well) and i were talking about how people would ask us questions like these and we laughed because we both know the truth is we just didn’t eat!",
      "created_utc": 1575794044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fa21rl0",
      "author": "EastofEatin",
      "body": "Way to handle the situation, and congrats on recovery thus far. I know weight gain can be hard to acknowledge and handle mentally, but it's all part of the process, and you are doing great.\n\n\nTonight during dinner my mother and aunt made comments about how great I look and how clear my skin is... little do they know I've been purging and restricting recently (after nearly 6 years of recovery) because of comments *they* have been making the past few weeks. They finally got to me.",
      "created_utc": 1575776837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff69wsc",
      "author": "gremsie",
      "body": "I can understand why you’d feel offended/attacked by the way our society is, perhaps that you are struggling but people are praising you in a way while seemingly blind to your pain/ill-health. \n\nI made the effort to get out a keyboard :P and post a comment perhaps because currently I’m a waitress at a local restaurant and also that my situation is more like yours in this scenario; I‘ve been at my lowest weight ever this year and my health has really tanked. \n\nI was finally able to see a doctor a few weeks ago because it was for an immigration thing so I could actually justify it in my budget (no insurance, yay....-\\_-). First of all, I picked a female doctor with good ratings because it’s a well known fact and personally experienced for me that getting male doctors to listen/understand is a whole headache sometimes.   \nLiterally the first thing she said to me when she met me and glanced at my chart was point to my weight and say, “I envy you\\~”.  (I grimaced.)  \nSecondly, they wouldn’t really help me with my health or do a real check up because it was strictly for the immigration exam (mostly checking vaccine records and STDs; side note, why the fuck is the US gov’t so concerned about my STD info...?) but I managed to bring up that I was VERY concerned about my health, and that I stopped menstruation for many months now. At this point the doctor said a bunch of stuff about the damage to health of anorexia like permanent loss of bone density, future osteoporosis, etc..\n\nIt wasn’t until I got home and let that whole situation process that I realised I was ”envied” for my weight AND told that my disorderly problems are deadly in the same 20 min experience. Although I think women are limited/crippled in greater quantities by our stupid culture, I also think men have their own equivalents, like how they are pressured to be big and strong, and people glorify say, NFL athletes who are sent out there to get permanent brain damage with devastating consequences (but of course very small number of men compared to the general population of men). Anyway I couldn’t, and I’m not trying to compare these things. Just some thoughts I had. \n\nWhat I REALLY wanted to say to you, was that, when I get those sorts of comments, I typically feel sorry for that person, for the fact that they too are being manipulated by diet culture to want to be thinner and doubly so for their struggle (with limited or no ‘success’ TONGUE IN CHEEK) to force their bodies that way. I generally don’t feel personally upset with these situations maybe because I don’t have any expectation for anyone to understand or recognise my ill-health on such superficial & momentary information.\\*\\*\\*\n\n\\*\\*\\*With two exceptions. This week I have come to the realisation that the ignorance/lack of understanding from the ’closest’ people in my life, my partner and my father (we have our issues but he’s the main point of contact between me and my dysfunctional family, plus HE IS A FREAKING DOCTOR), has been slowly upsetting me over the past few months. I have never really felt the need to discuss my ED problems with them because I didn’t expect much benefit from it combined with the fact that it feels super uncomfortable to talk about it with them (which is weird because I’m really quite open to talking about it with other most other people). As my health has declined steadily in the past year, I’d make comments or give updates about how my period skipped AGAIN, my constant exhaustion/pain, my severe insomnia, etc., even explaining that my low calorie intake is responsible for all of these problems, they just didn’t really seem to understand really how bad it is. I definitely look thin to most people but I don’t look “anorexia inpatient emaciated dying” thin, so actually I think mostly I’m upset because these two people closest to me, intelligent men who don’t think anything like that it’s important for women to be thin, don’t understand the amount of body fat that is normal for most women to have, and didn’t understand truly how damaging it is to our health in so many ways to be starving ourselves even “just a little” or even an amount that is not apparent/visible. I had an intense (but poorly timed, lol) conversation with my partner so I think he understands a lot better and I feel better too. I hope I articulated that OK and that you can understand what I said because I only really just came to these conclusions recently and I know my long ass run-on sentences aren’t the most eloquent, sorry 😅",
      "created_utc": 1579622540.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fa12x49",
      "author": "None",
      "body": "I think that's a sensible policy. I know in my heart of hearts that many people mean well - I try to assume good intent whenever possible, because I'm trying to become a bit less jaded and cynical - but strongly believe that unsolicited comments on people's bodies should simply not be made.",
      "created_utc": 1575763785.0,
      "score": 10,
      "context": [
        {
          "id": "fa0jzdu",
          "author": "None",
          "body": "I answer in much the same way when people ask me how I've lost weight. Or \"how can you eat like that and stay thin?\" Well Linda I'm trying to recover from my obsessive thoughts over food and weight and you pointing out that you're noticing my food and body size sure isn't helping.  I never comment on anyone's weight loss or gain. When people tell me they've lost weight I usually ask \"on purpose?\" with a concerned look. If they're happy about their weight loss I say \"well I'm happy if you're happy. Congrats on your hard work.\" then change the subject.",
          "created_utc": 1575756181.0
        }
      ]
    },
    {
      "id": "fa13grm",
      "author": "None",
      "body": "Exactly. Such remarks really tend to put one on the spot. Complimenting someone's outfit or groovy hairstyle is one thing, but making remarks about someone else's physique is a different kettle of fish altogether.",
      "created_utc": 1575763939.0,
      "score": 8,
      "context": [
        {
          "id": "fa0mgof",
          "author": "boba-boba",
          "body": "I have a client at my work who constantly asks me \"Oh, did you lose weight? You look great!\" and things like that. I've just started saying nope, same size! with a smile. It's hard enough out there for me, I don't need a stranger doing this...",
          "created_utc": 1575757312.0
        }
      ]
    },
    {
      "id": "fa14mxr",
      "author": "None",
      "body": "Yes! I've stopped giving a monkey's and tend to say things like, \"thanks! it's because of anorexia; I really wouldn't recommend it!\" in the most upbeat and chipper tone of voice I can muster, but doing so does have the unfortunate side effect of making me feel like a wanker.\n\nYou can't really win in these situations, can you? I hope your recovery journey is going well, by the way.",
      "created_utc": 1575764422.0,
      "score": 16,
      "context": [
        {
          "id": "fa0qyhh",
          "author": "fvwne",
          "body": "When I was first beginning my recovery journey about five or six years ago, I was at a visitation for a funeral with my mom, who was aware that I was struggling with an eating disorder, and a distant relative that I hadn't seen in a LONG time had said to me \"oh my goodness you're so thin, what's your secret\" very enthusiastically and I had to bite my tongue and resist the urge to just say \"I don't eat and I am not doing well\". Not only that but I had to experience the horror on my mom's face when my relative asked that. I was also asked similar things in school, too. Its horrifying because you want to be brutally honest but also don't want people to worry or get the wrong impression you know? At least thats how I feel ¯\\\\\\_(ツ)\\_/¯",
          "created_utc": 1575758967.0
        }
      ]
    },
    {
      "id": "fa13vk5",
      "author": "None",
      "body": "A cashier recently told me that my face looks much fuller & that I looked \"downright frightening\" before. People often mean well, and I know this (generally nice & pleasant) lady \nmeant to say I look healthier now, but I walked away from that exchange feeling confused and defeated.  \"Did I look *that* ill before? Does my face look like I'm the secret love child of Humpty Dumpty and Aunt Marge these days? If I 'look recovered', does that mean I shouldn't be struggling anymore? What even is life?\" And so on.\n\nI hope your recovery is going well so far and that these comments aren't impeding your progress. <3",
      "created_utc": 1575764208.0,
      "score": 14,
      "context": [
        {
          "id": "fa0o5pj",
          "author": "amethystee",
          "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
          "created_utc": 1575757844.0
        }
      ]
    },
    {
      "id": "fa16lj8",
      "author": "None",
      "body": "[This is what the kids call a Mood.](https://thumbs.gfycat.com/CluelessHarmlessAfricancivet-small.gif)",
      "created_utc": 1575765418.0,
      "score": 5,
      "context": [
        {
          "id": "fa157x5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1575764831.0
        }
      ]
    },
    {
      "id": "fa1or5h",
      "author": "None",
      "body": "That's a brilliant way of putting it. I hope you're making progress with the help of your therapist!",
      "created_utc": 1575772515.0,
      "score": 3,
      "context": [
        {
          "id": "fa1njdz",
          "author": "danimarie82",
          "body": "Those comments make me so uncomfortable. I usually brush it off but one day I snapped and said something about losing my appetite to severe anxiety. It wasn't a total lie, but I didn't want to out my eating disorder so that was the best I could come up with at the time. \n\nMy therapist recommended just saying the weight loss is \"because I'm hurting\". He said it makes the point without having to give out too much information and people usually feel uncomfortable and stop.",
          "created_utc": 1575772099.0
        }
      ]
    },
    {
      "id": "facech8",
      "author": "None",
      "body": "Throw some grapes of wrath and flat tortillas at these people! I'm really sorry to hear they got to you. Let me know if you'd like to talk or vent sometime - my inbox is always open :)",
      "created_utc": 1575937885.0,
      "score": 3,
      "context": [
        {
          "id": "fa21rl0",
          "author": "EastofEatin",
          "body": "Way to handle the situation, and congrats on recovery thus far. I know weight gain can be hard to acknowledge and handle mentally, but it's all part of the process, and you are doing great.\n\n\nTonight during dinner my mother and aunt made comments about how great I look and how clear my skin is... little do they know I've been purging and restricting recently (after nearly 6 years of recovery) because of comments *they* have been making the past few weeks. They finally got to me.",
          "created_utc": 1575776837.0
        }
      ]
    },
    {
      "id": "ff7hpy1",
      "author": "None",
      "body": "    Literally the first thing she said to me when she met me and glanced at my chart was point to my weight and say, “I envy you~”. (I grimaced.)\n\nThat's beyond unprofessional and uncalled for. I'm sorry you had to deal with that.  Thank you for sharing your story: it's so important to reflect on these issues! I'd write a more detailed response, but I am absolutely knackered (I'm administering palliative care to my father and have been on my feet all day). Never apologise for sharing something meaningful, please :) Your thoughts, reflections, and conclusions matter! Thank you again.",
      "created_utc": 1579649815.0,
      "score": 1,
      "context": [
        {
          "id": "ff69wsc",
          "author": "gremsie",
          "body": "I can understand why you’d feel offended/attacked by the way our society is, perhaps that you are struggling but people are praising you in a way while seemingly blind to your pain/ill-health. \n\nI made the effort to get out a keyboard :P and post a comment perhaps because currently I’m a waitress at a local restaurant and also that my situation is more like yours in this scenario; I‘ve been at my lowest weight ever this year and my health has really tanked. \n\nI was finally able to see a doctor a few weeks ago because it was for an immigration thing so I could actually justify it in my budget (no insurance, yay....-\\_-). First of all, I picked a female doctor with good ratings because it’s a well known fact and personally experienced for me that getting male doctors to listen/understand is a whole headache sometimes.   \nLiterally the first thing she said to me when she met me and glanced at my chart was point to my weight and say, “I envy you\\~”.  (I grimaced.)  \nSecondly, they wouldn’t really help me with my health or do a real check up because it was strictly for the immigration exam (mostly checking vaccine records and STDs; side note, why the fuck is the US gov’t so concerned about my STD info...?) but I managed to bring up that I was VERY concerned about my health, and that I stopped menstruation for many months now. At this point the doctor said a bunch of stuff about the damage to health of anorexia like permanent loss of bone density, future osteoporosis, etc..\n\nIt wasn’t until I got home and let that whole situation process that I realised I was ”envied” for my weight AND told that my disorderly problems are deadly in the same 20 min experience. Although I think women are limited/crippled in greater quantities by our stupid culture, I also think men have their own equivalents, like how they are pressured to be big and strong, and people glorify say, NFL athletes who are sent out there to get permanent brain damage with devastating consequences (but of course very small number of men compared to the general population of men). Anyway I couldn’t, and I’m not trying to compare these things. Just some thoughts I had. \n\nWhat I REALLY wanted to say to you, was that, when I get those sorts of comments, I typically feel sorry for that person, for the fact that they too are being manipulated by diet culture to want to be thinner and doubly so for their struggle (with limited or no ‘success’ TONGUE IN CHEEK) to force their bodies that way. I generally don’t feel personally upset with these situations maybe because I don’t have any expectation for anyone to understand or recognise my ill-health on such superficial & momentary information.\\*\\*\\*\n\n\\*\\*\\*With two exceptions. This week I have come to the realisation that the ignorance/lack of understanding from the ’closest’ people in my life, my partner and my father (we have our issues but he’s the main point of contact between me and my dysfunctional family, plus HE IS A FREAKING DOCTOR), has been slowly upsetting me over the past few months. I have never really felt the need to discuss my ED problems with them because I didn’t expect much benefit from it combined with the fact that it feels super uncomfortable to talk about it with them (which is weird because I’m really quite open to talking about it with other most other people). As my health has declined steadily in the past year, I’d make comments or give updates about how my period skipped AGAIN, my constant exhaustion/pain, my severe insomnia, etc., even explaining that my low calorie intake is responsible for all of these problems, they just didn’t really seem to understand really how bad it is. I definitely look thin to most people but I don’t look “anorexia inpatient emaciated dying” thin, so actually I think mostly I’m upset because these two people closest to me, intelligent men who don’t think anything like that it’s important for women to be thin, don’t understand the amount of body fat that is normal for most women to have, and didn’t understand truly how damaging it is to our health in so many ways to be starving ourselves even “just a little” or even an amount that is not apparent/visible. I had an intense (but poorly timed, lol) conversation with my partner so I think he understands a lot better and I feel better too. I hope I articulated that OK and that you can understand what I said because I only really just came to these conclusions recently and I know my long ass run-on sentences aren’t the most eloquent, sorry 😅",
          "created_utc": 1579622540.0
        }
      ]
    },
    {
      "id": "fa1lvca",
      "author": "amethystee",
      "body": "Man, I totally feel you. It’s like my brain forgets how shitty being underweight was and just focuses on how I miss feeling/looking thin :( I know lots of ppl w ED miss being “special” or different and honestly, I feel like being really thin made me “accomplished”/ visible. It’s a hard mentality to break out of but I’m definitely making progress. Thanks for your encouragement :) I hope you’re doing well too! ♥️",
      "created_utc": 1575771509.0,
      "score": 6,
      "context": [
        {
          "id": "fa0o5pj",
          "author": "amethystee",
          "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
          "created_utc": 1575757844.0
        },
        {
          "id": "fa13vk5",
          "author": "None",
          "body": "A cashier recently told me that my face looks much fuller & that I looked \"downright frightening\" before. People often mean well, and I know this (generally nice & pleasant) lady \nmeant to say I look healthier now, but I walked away from that exchange feeling confused and defeated.  \"Did I look *that* ill before? Does my face look like I'm the secret love child of Humpty Dumpty and Aunt Marge these days? If I 'look recovered', does that mean I shouldn't be struggling anymore? What even is life?\" And so on.\n\nI hope your recovery is going well so far and that these comments aren't impeding your progress. <3",
          "created_utc": 1575764208.0
        }
      ]
    },
    {
      "id": "fa8xp7i",
      "author": "danimarie82",
      "body": "Thank you! I'm actually in the process of trying to switch to an ED specialist because my current therapist didn't really understand where I was coming from, but he did have some good general advice. Onward and upward and I hope the same for you too!",
      "created_utc": 1575857272.0,
      "score": 2,
      "context": [
        {
          "id": "fa1njdz",
          "author": "danimarie82",
          "body": "Those comments make me so uncomfortable. I usually brush it off but one day I snapped and said something about losing my appetite to severe anxiety. It wasn't a total lie, but I didn't want to out my eating disorder so that was the best I could come up with at the time. \n\nMy therapist recommended just saying the weight loss is \"because I'm hurting\". He said it makes the point without having to give out too much information and people usually feel uncomfortable and stop.",
          "created_utc": 1575772099.0
        },
        {
          "id": "fa1or5h",
          "author": "None",
          "body": "That's a brilliant way of putting it. I hope you're making progress with the help of your therapist!",
          "created_utc": 1575772515.0
        }
      ]
    },
    {
      "id": "fa1ojrz",
      "author": "None",
      "body": "I'm genuinely pleased to hear you're making progress! We all deserve to feel happy with ourselves just the way we are, but it's definitely an uphill battle.\n\nI think you've hit the nail on the head there. I still vividly remember the way people treated me when I was overweight: my mother used to buy me clothes that were several sizes too big because I'd \"get fat anyway\" - as if that was the worst thing that could ever happen to me - and other gay men would openly mock me for not meeting their rigid standards. One time, I went on a dinner date with a seemingly nice and sensible guy. As I was happily eating my spaghetti carbonara without a care in the world, he started making oinking sounds and proceeded to tell me I'd be \"much more dateable if [I] were better at keeping my hands out of the cookie jar\". I then told him he'd be more dateable if he didn't have the emotional range of a malfunctioning Theremin,  but I digress.\n\nBeing underweight, on the other hand,  landed me a mixture of compliments and concern - both made me feel seen as a person. Men who had previously rejected me suddenly wanted to hang out with me (no thanks), and people who had previously ignored my existence started acting awfully pleasant. That entire (awful!) experience cemented in my mind the notion that a lot of people are truly, genuinely vapid and don't give a fig about fat people's feelings. It's saddening, maddening, and stark staring bonkers.\n\nSorry for the rant. I think we'd both do well to remember that being underweight was genuinely horrid and not nearly as satisfying as a nice peanut butter sandwich tends to be - there are so many better and less destructive ways to make oneself feel visible and accomplished.",
      "created_utc": 1575772446.0,
      "score": 6,
      "context": [
        {
          "id": "fa0o5pj",
          "author": "amethystee",
          "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
          "created_utc": 1575757844.0
        },
        {
          "id": "fa13vk5",
          "author": "None",
          "body": "A cashier recently told me that my face looks much fuller & that I looked \"downright frightening\" before. People often mean well, and I know this (generally nice & pleasant) lady \nmeant to say I look healthier now, but I walked away from that exchange feeling confused and defeated.  \"Did I look *that* ill before? Does my face look like I'm the secret love child of Humpty Dumpty and Aunt Marge these days? If I 'look recovered', does that mean I shouldn't be struggling anymore? What even is life?\" And so on.\n\nI hope your recovery is going well so far and that these comments aren't impeding your progress. <3",
          "created_utc": 1575764208.0
        },
        {
          "id": "fa1lvca",
          "author": "amethystee",
          "body": "Man, I totally feel you. It’s like my brain forgets how shitty being underweight was and just focuses on how I miss feeling/looking thin :( I know lots of ppl w ED miss being “special” or different and honestly, I feel like being really thin made me “accomplished”/ visible. It’s a hard mentality to break out of but I’m definitely making progress. Thanks for your encouragement :) I hope you’re doing well too! ♥️",
          "created_utc": 1575771509.0
        }
      ]
    },
    {
      "id": "fa1vaz4",
      "author": "amethystee",
      "body": "Don’t apologize for the rant! Honestly I don’t have many ppl in my life I can honestly discuss these things with so this sub def helps. You’re so right about standing out in a way that’s far more valuable that what your look like on the outside. It also makes me sad that I sort of fell into this spiral of weight loss because I started out with a really healthy positive approach to it, but became addicted to it as I continued to lose weight, without considering the negative effects of rapid weight loss. I started off slightly overweight/pretty muscular and wanted to feel more feminine/achieve that “runner’s body”. I got so many people who were like “how did you do it?,” “you look like a real “runner””, “teach me your ways” (my ways? Run like a maniac and eat 800 calories a day x_x). We’re so conditioned to diet culture/always wanting to lose weight that people’s perception of weight loss is always perceived as good, when it might be actually pretty negative.\n\nYou seem like you’ve really made a breakthrough in your recovery! And its funny that you mention peanut butter because it’s my favorite food :) Nothing like a good PB sammy!",
      "created_utc": 1575774722.0,
      "score": 4,
      "context": [
        {
          "id": "fa0o5pj",
          "author": "amethystee",
          "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
          "created_utc": 1575757844.0
        },
        {
          "id": "fa13vk5",
          "author": "None",
          "body": "A cashier recently told me that my face looks much fuller & that I looked \"downright frightening\" before. People often mean well, and I know this (generally nice & pleasant) lady \nmeant to say I look healthier now, but I walked away from that exchange feeling confused and defeated.  \"Did I look *that* ill before? Does my face look like I'm the secret love child of Humpty Dumpty and Aunt Marge these days? If I 'look recovered', does that mean I shouldn't be struggling anymore? What even is life?\" And so on.\n\nI hope your recovery is going well so far and that these comments aren't impeding your progress. <3",
          "created_utc": 1575764208.0
        },
        {
          "id": "fa1lvca",
          "author": "amethystee",
          "body": "Man, I totally feel you. It’s like my brain forgets how shitty being underweight was and just focuses on how I miss feeling/looking thin :( I know lots of ppl w ED miss being “special” or different and honestly, I feel like being really thin made me “accomplished”/ visible. It’s a hard mentality to break out of but I’m definitely making progress. Thanks for your encouragement :) I hope you’re doing well too! ♥️",
          "created_utc": 1575771509.0
        },
        {
          "id": "fa1ojrz",
          "author": "None",
          "body": "I'm genuinely pleased to hear you're making progress! We all deserve to feel happy with ourselves just the way we are, but it's definitely an uphill battle.\n\nI think you've hit the nail on the head there. I still vividly remember the way people treated me when I was overweight: my mother used to buy me clothes that were several sizes too big because I'd \"get fat anyway\" - as if that was the worst thing that could ever happen to me - and other gay men would openly mock me for not meeting their rigid standards. One time, I went on a dinner date with a seemingly nice and sensible guy. As I was happily eating my spaghetti carbonara without a care in the world, he started making oinking sounds and proceeded to tell me I'd be \"much more dateable if [I] were better at keeping my hands out of the cookie jar\". I then told him he'd be more dateable if he didn't have the emotional range of a malfunctioning Theremin,  but I digress.\n\nBeing underweight, on the other hand,  landed me a mixture of compliments and concern - both made me feel seen as a person. Men who had previously rejected me suddenly wanted to hang out with me (no thanks), and people who had previously ignored my existence started acting awfully pleasant. That entire (awful!) experience cemented in my mind the notion that a lot of people are truly, genuinely vapid and don't give a fig about fat people's feelings. It's saddening, maddening, and stark staring bonkers.\n\nSorry for the rant. I think we'd both do well to remember that being underweight was genuinely horrid and not nearly as satisfying as a nice peanut butter sandwich tends to be - there are so many better and less destructive ways to make oneself feel visible and accomplished.",
          "created_utc": 1575772446.0
        }
      ]
    },
    {
      "id": "fa4x6n9",
      "author": "None",
      "body": "That's exactly what it is, isn't it - a spiral, a kind of endless feedback loop of intrusive, fanatical thoughts. I've dealt with alcohol and nicotine dependence in the past; both were easier to address than the ED because people tend to congratulate us on losing weight without ever considering that we might have lost it in a disordered way. I think it's pretty damning that even reputable media outlets tend to promote awfully restrictive diets.\n\nI think it's perfectly okay to feel a bit sad: obviously, what we did wasn't helpful and didn't bring us the happiness we craved, but we probably wouldn't have embarked on this arduous journey if we hadn't initially thought it'd provide us with some modicum of fulfilment and joy, you know? After all, we're constantly being bombarded with \"uplifting\" headlines such as \"I Lost 100 Pounds By Only Eating Microwaved Wild-Caught Haddock And Stinking Out The Entire Office For A Whole Goddamn Year And Now I'm Living My Best Life In A Beach House In Maui With My Husband Robert-Ryan Gosling-Patterson Where We Spend Our Days Making Love Next To Our Brand-New Peloton™ Stationary Bicycle And Talk At Length About How Much We Miss Carbs (But Don't Really Because Carbs Are Satan's Favourite Party Trick)\".\n\nAnd yes! PB sarnies save lives. Let's get that printed on a t-shirt.",
      "created_utc": 1575809420.0,
      "score": 3,
      "context": [
        {
          "id": "fa0o5pj",
          "author": "amethystee",
          "body": "Oof, I feel this. I was borderline underweight this summer and got so many compliments, I’ve gained 10 lbs from my lowest since then and I feel like people are noticing who haven’t seen me since summer. It doesn’t help that my family says that I look “better” D:",
          "created_utc": 1575757844.0
        },
        {
          "id": "fa13vk5",
          "author": "None",
          "body": "A cashier recently told me that my face looks much fuller & that I looked \"downright frightening\" before. People often mean well, and I know this (generally nice & pleasant) lady \nmeant to say I look healthier now, but I walked away from that exchange feeling confused and defeated.  \"Did I look *that* ill before? Does my face look like I'm the secret love child of Humpty Dumpty and Aunt Marge these days? If I 'look recovered', does that mean I shouldn't be struggling anymore? What even is life?\" And so on.\n\nI hope your recovery is going well so far and that these comments aren't impeding your progress. <3",
          "created_utc": 1575764208.0
        },
        {
          "id": "fa1lvca",
          "author": "amethystee",
          "body": "Man, I totally feel you. It’s like my brain forgets how shitty being underweight was and just focuses on how I miss feeling/looking thin :( I know lots of ppl w ED miss being “special” or different and honestly, I feel like being really thin made me “accomplished”/ visible. It’s a hard mentality to break out of but I’m definitely making progress. Thanks for your encouragement :) I hope you’re doing well too! ♥️",
          "created_utc": 1575771509.0
        },
        {
          "id": "fa1ojrz",
          "author": "None",
          "body": "I'm genuinely pleased to hear you're making progress! We all deserve to feel happy with ourselves just the way we are, but it's definitely an uphill battle.\n\nI think you've hit the nail on the head there. I still vividly remember the way people treated me when I was overweight: my mother used to buy me clothes that were several sizes too big because I'd \"get fat anyway\" - as if that was the worst thing that could ever happen to me - and other gay men would openly mock me for not meeting their rigid standards. One time, I went on a dinner date with a seemingly nice and sensible guy. As I was happily eating my spaghetti carbonara without a care in the world, he started making oinking sounds and proceeded to tell me I'd be \"much more dateable if [I] were better at keeping my hands out of the cookie jar\". I then told him he'd be more dateable if he didn't have the emotional range of a malfunctioning Theremin,  but I digress.\n\nBeing underweight, on the other hand,  landed me a mixture of compliments and concern - both made me feel seen as a person. Men who had previously rejected me suddenly wanted to hang out with me (no thanks), and people who had previously ignored my existence started acting awfully pleasant. That entire (awful!) experience cemented in my mind the notion that a lot of people are truly, genuinely vapid and don't give a fig about fat people's feelings. It's saddening, maddening, and stark staring bonkers.\n\nSorry for the rant. I think we'd both do well to remember that being underweight was genuinely horrid and not nearly as satisfying as a nice peanut butter sandwich tends to be - there are so many better and less destructive ways to make oneself feel visible and accomplished.",
          "created_utc": 1575772446.0
        },
        {
          "id": "fa1vaz4",
          "author": "amethystee",
          "body": "Don’t apologize for the rant! Honestly I don’t have many ppl in my life I can honestly discuss these things with so this sub def helps. You’re so right about standing out in a way that’s far more valuable that what your look like on the outside. It also makes me sad that I sort of fell into this spiral of weight loss because I started out with a really healthy positive approach to it, but became addicted to it as I continued to lose weight, without considering the negative effects of rapid weight loss. I started off slightly overweight/pretty muscular and wanted to feel more feminine/achieve that “runner’s body”. I got so many people who were like “how did you do it?,” “you look like a real “runner””, “teach me your ways” (my ways? Run like a maniac and eat 800 calories a day x_x). We’re so conditioned to diet culture/always wanting to lose weight that people’s perception of weight loss is always perceived as good, when it might be actually pretty negative.\n\nYou seem like you’ve really made a breakthrough in your recovery! And its funny that you mention peanut butter because it’s my favorite food :) Nothing like a good PB sammy!",
          "created_utc": 1575774722.0
        }
      ]
    }
  ]
}