{
  "id": "ebcw06",
  "subreddit": "fuckeatingdisorders",
  "author": "alexshldshutup",
  "created_utc": 1576487903.0,
  "title": "whenever I'm hungry my brain darts to the logical thought of \"let's eat\" but immediately after swings to the complete opposite of \"let's not eat the entire day and the day after also\"",
  "selftext": "Additionally, why is being hungry so,,,, satisfying? Damn I need therapy before this gets worse lmao\n\nAnd I need this issue not to be ignored like it was by my psychiatrist, just because professionals here don't recognize EDs if they're no the classic \"I feel like I'm fat so I starve myself\" type. (Again, this is completely valid, but it's a little frustrating that it's the only recognized kind)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ebcw06/whenever_im_hungry_my_brain_darts_to_the_logical/",
  "score": 104,
  "num_comments": 2,
  "comments": [
    {
      "id": "fb51oxh",
      "author": "None",
      "body": "I feel this so hard. My E.D tells me the same thing. I don't like being hungry bc I want to fight the urge you eat. What you're going through now is how I started, and then went into full blown anorexia. Trying to dig myself out of that dark hole but it's hard. Getting support and recovery has helped encourage me to continue eating instead of restricting. What you feel is complete valid and shows that you're fighting a beast.  I hope you get adequate help and support through this war.",
      "created_utc": 1576519312.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fb53q9l",
      "author": "alexshldshutup",
      "body": "I really like being hungry because it makes me feel accomplished, it means I haven't eaten. But you're right, it's very annoying having to fight the urge to eat.\n\nI'm glad you're getting help! That's admirable and really great, I'm so proud of you!\n\nThank you for the comment",
      "created_utc": 1576520414.0,
      "score": 7,
      "context": [
        {
          "id": "fb51oxh",
          "author": "None",
          "body": "I feel this so hard. My E.D tells me the same thing. I don't like being hungry bc I want to fight the urge you eat. What you're going through now is how I started, and then went into full blown anorexia. Trying to dig myself out of that dark hole but it's hard. Getting support and recovery has helped encourage me to continue eating instead of restricting. What you feel is complete valid and shows that you're fighting a beast.  I hope you get adequate help and support through this war.",
          "created_utc": 1576519312.0
        }
      ]
    }
  ]
}