{
  "id": "ebkv7r",
  "subreddit": "fuckeatingdisorders",
  "author": "certASLshittalker",
  "created_utc": 1576529017.0,
  "title": "Like mother like daughter",
  "selftext": "I told myself I’d never let my mothers eating disorder influence me. I was so wrong. All the years I spent sitting in bed filled with fear and disgust at the sound of my mom’s nightly ritual I told myself, “I’ll never fucking do anything like that. How can she fucking shamelessly do this every night knowing that I can hear her?”. I was so fucking wrong. I told myself that no matter how much I hated my body I’d never take dangerous measures to lose weight... I was so so wrong. Unlike my mother, it’s not bullemia that I’m suffering from, it’s anorexia. Instead of hoarding food to save for a binge like she does, I hoard capacity for my body to gain weight that it probably never will (“Well, I should be 120, but I’m going to keep it at 110 just to save a little room in case I decide to eat a little more one day). As time goes on people have gone from congratulating me for my weight loss to making comments like, “jesus christ, are you sharpening your elbows every night?” or, “... are you okay? It seems like you’re getting sick.”. The other night when I was planning to lose a little more weight for what I call “weight gain insurance” all of this finally hit me. I started thinking about my life and all of the ways my mother influenced it. We never had food around the house. You always had to buy your own food and tons of it. Don’t forget to eat it quickly before the other bingers in the house get to it. I had to get used to food being a very aggressive and sensitive topic in the house. Every time I’d go to the fridge, no matter where my mother was in the house, she’d suddenly appear right behind me (the sound of the fridge opening would always trigger the same response from her, “What are you eating? What are you eating?”), and peer over my shoulder in disappointment as I got my meal and ate it (she still does this a lot). Recently, when I finally told her I fucking hate when she does that she just said, “But... you’re finally getting so thin, I don’t want you to mess this up.”. That’s another thing, she constantly comments on the status of my weight and others. Every single day she rants and raves about how thin and beautiful I am now, a stark contrast to when she used to call me on the phone when I was gaining weight and say, “I can’t have a fat kid, (my name), I just CANT!!!!”. All of these things, along with “sticky bathroom” (I’m sure most of you know what I’m talking about), are things that I’ve had to grow up with all of my life and is now drastically affecting me in my early adulthood. I’m losing weight very rapidly, if clothes don’t fit over my hip bones I want to kill myself, I’ve been working on training myself to feel rewarded by the sensation of my stomach growling and I don’t know if I’ll ever be able to stop. My mom has told me straight up that she is never going to stop throwing up and there’s nothing I can say that will stop her. She’s grown completely numb to the look on my face when I go into the bathroom and can smell and see that it’s been freshly vomited in and she still has the AUDACITY to lie to me and say she didn’t. \n\nThe main thing I want to say? Please, if you have  children, try to control your eating disorder at least for their sake. Please don’t project your body dysmorphia onto them. I’m starting to resent my mother for what she’s helped shape me to become and every time she’s called me “skinny girl” I just want to scream and cry.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ebkv7r/like_mother_like_daughter/",
  "score": 97,
  "num_comments": 16,
  "comments": [
    {
      "id": "fb5smqi",
      "author": "taoshka",
      "body": "Fellow daughter of a disordered mom here. I'm so sorry, it's a special kind of hell. It's honestly the reason I'm not having kids... I don't want to do this to another generation.",
      "created_utc": 1576533575.0,
      "score": 37,
      "context": []
    },
    {
      "id": "fb5z6kq",
      "author": "PM_ME_YER_SHIBA_INUS",
      "body": "> I’m starting to resent \n\nIf I were you, I'd have an asston of buried rage. Even just reading the details here sets my teeth on edge.\n\nBoth of my parents are/were stupidly fucking disordered. It killed one of them. One of my main motivations for doing better with food is reminding myself that eating normally moves me one more step away from their dysfunctional stress.\n\nDo I want to eat this meal? Nope. But if eating the meal means not being like them, then...a little, kinda, abstractly.\n\nDon't know if it'd help you to hack it out that way too, but either way, I'm sorry you grew up marinated in food-stress too.",
      "created_utc": 1576537446.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fb5u9pk",
      "author": "Rosethephoenix",
      "body": "My mom claims she is fine, but she is obviously physically underweight and I rarely see her eat. She also runs a diet bakery. During my worst times I compare myself to her and use her as inspiration. It’s fucked up.",
      "created_utc": 1576534462.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fb63r63",
      "author": "snake_pod",
      "body": "wow, the way you described your mother's ED and what it's like growing up in it is so grim but so accurate. I'm so sorry your mother has done this to you. No child deserves to grow up in such a toxic environment. And no child deserves to grow up hating any part of themselves :(. I can't imagine the pain that was passed onto you.\n\nI don't talk about it much, but my mom's ED was more hidden- but I think that made it worse for me, I didn't understand the severity of it and thought our eating patterns were normal. She would hide food in her room (\"goodies\") and would binge while skipping proper meals and sleep for days at a time. I would rarely see her up during the day, and her cooking anything was a rare sight. I still struggle with a lot of habits she helped create. I didn't even know I had an ED until a year after she died, and tbh, her death has made my recovery flourish, as fucked up as it sounds.",
      "created_utc": 1576540639.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fb6chkj",
      "author": "standsure",
      "body": "Babe I hear you and feel for you. \n\nMy ma started restricting my food when I was nine. Dad also had ED and so did G'ma. \n\nThere was no way I was going to get out of my childhood free from that. I made a deal with myself pretty early on - no kids until I can guarantee I won't pass on this baggage. It's cost me. \n\nWe've had some group therapy about it and communication is better, but it took years before mum could start to deal with her baggage. She still lies about dumb, stupid, small things. I've learned to let this go. \n\nIt's hard when you live together but you have some beautiful clarity in your post. Scream if you need to. Pillows are great, but it's ok to be upset. \n\nKids pick up on what we do, not what we tell them we do. \n\nYou might like to cross post to r/adultchildren, it was originally developed for adult children of alcoholics, but it's open to all folks who have mentally unwell parents. \n\nIt's ok for you to get help. Your recovery is not dependent on her doing the same. She may never get better, but you can. \n\nI'm always here if you need to chat.",
      "created_utc": 1576546887.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fb6ijo5",
      "author": "None",
      "body": "I am so sorry your mother has treated you this way. My mother had a lot of disordered eating and hated her body and I ended up with an ED in college. I sought therapy and advice and a trusted older woman told me to stop discussing food with my mother. She told me I was under no obligation to hear about food or diets or weight or any of it. She told me to tell my mom, “I am trying to change my relationship with food so I cannot discuss food and dieting with you anymore.” \n\nI needed that permission. \n\nYou need that permission. \n\nEntertain no food-related conversations with your mother. It’s as good as discussing a sobriety plan with an in-denial alcoholic who needs a drinking buddy. They will only make it worse. \n\nYou CAN break this cycle. I did. I have daughter who has never...\n\n-Heard me criticize my body \n\n-Heard me criticize ANY body \n\n-heard me chastise my food choices \n\nFight the disease and the cycle with your life, friend. Winning feels good, I promise. It’s freedom. \n\nEdit to add; no pressure to have kids, of course. But fight like hell, regardless.",
      "created_utc": 1576551152.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fb6ouza",
      "author": "Spectrachic311311",
      "body": "This is a big part of why I don’t have any kids. Sad but true.",
      "created_utc": 1576555749.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fb783bh",
      "author": "applecinnamonnn",
      "body": "I’m about to become a mother and this post summarises all of my fears regarding eating behaviours and how mine can possibly affect my daughter’s life. I don’t want her to remember mommy always eating a salad while everyone’s having pasta, I don’t want her to remember asking me if I want some of her ice cream and always telling her “no” because it’s not my designated day to eat “unsafe” food (just to give in and restrict days after). I don’t know how I’m gonna do it. But I’m gonna try.\nI’m sorry you have to go through this, but thank you for sharing your story.\nMy advice would be get out of your house as soon as you can (I don’t know how old you are though). You can’t fix your mother (not right now), and she doesn’t seem to want any sort of help unfortunately. Focus on yourself and YOUR story, your life; start thinking about how sustainable this type of life is (I used to think I could’ve kept going on forever after 10 years, but I’m starting to get so tired... and pregnancy opened my eyes even more) and most importantly, about the possibility of becoming more and more like her. Don’t become the thing you fear and despise the most. Create YOUR story. Live your life.\nBe happy. Please.",
      "created_utc": 1576579121.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fb6rj2x",
      "author": "OhCrumbs96",
      "body": "This illness is an absolute life-destroying, parasitic and all-encompassing monster. I am so sorry for everything you've suffered through. I can't even begin to imagine having this illness inflicted on me by the woman who is supposed to love and protect me during my early years. I really, really hope that you're able to break the pattern and find true freedom from this beast.",
      "created_utc": 1576558034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fb5t29f",
      "author": "certASLshittalker",
      "body": "I’m so sorry to hear that you’ve had a similar experience. You’re an absolutely wonderful and thoughtful person for not wanting to put this weight on a future generations shoulders. I’m doing the same, no child of mine is going to have to suffer through having a mother with an eating disorder.",
      "created_utc": 1576533804.0,
      "score": 17,
      "context": [
        {
          "id": "fb5smqi",
          "author": "taoshka",
          "body": "Fellow daughter of a disordered mom here. I'm so sorry, it's a special kind of hell. It's honestly the reason I'm not having kids... I don't want to do this to another generation.",
          "created_utc": 1576533575.0
        }
      ]
    },
    {
      "id": "fb66lqc",
      "author": "certASLshittalker",
      "body": "I honestly don’t think I could handle my moms reaction to me gaining weight, she’d constantly talk about it and I’d probably wind up worse than when I started.",
      "created_utc": 1576542669.0,
      "score": 3,
      "context": [
        {
          "id": "fb5z6kq",
          "author": "PM_ME_YER_SHIBA_INUS",
          "body": "> I’m starting to resent \n\nIf I were you, I'd have an asston of buried rage. Even just reading the details here sets my teeth on edge.\n\nBoth of my parents are/were stupidly fucking disordered. It killed one of them. One of my main motivations for doing better with food is reminding myself that eating normally moves me one more step away from their dysfunctional stress.\n\nDo I want to eat this meal? Nope. But if eating the meal means not being like them, then...a little, kinda, abstractly.\n\nDon't know if it'd help you to hack it out that way too, but either way, I'm sorry you grew up marinated in food-stress too.",
          "created_utc": 1576537446.0
        }
      ]
    },
    {
      "id": "fb5ut40",
      "author": "certASLshittalker",
      "body": "I’m so sorry that you’re going through that :( it breaks my heart how many others have to witness their parents going through eating disorders. And by inspiration what do you mean? Like, you’re inspired NOT to become like her or you feel weirdly obligated to be like her?",
      "created_utc": 1576534751.0,
      "score": 6,
      "context": [
        {
          "id": "fb5u9pk",
          "author": "Rosethephoenix",
          "body": "My mom claims she is fine, but she is obviously physically underweight and I rarely see her eat. She also runs a diet bakery. During my worst times I compare myself to her and use her as inspiration. It’s fucked up.",
          "created_utc": 1576534462.0
        }
      ]
    },
    {
      "id": "fb6cuvw",
      "author": "certASLshittalker",
      "body": "I’m so sorry to hear that happened to you :( that is beyond cruel. Thank you for showing me this new subreddit, I could really use it.",
      "created_utc": 1576547142.0,
      "score": 1,
      "context": [
        {
          "id": "fb6chkj",
          "author": "standsure",
          "body": "Babe I hear you and feel for you. \n\nMy ma started restricting my food when I was nine. Dad also had ED and so did G'ma. \n\nThere was no way I was going to get out of my childhood free from that. I made a deal with myself pretty early on - no kids until I can guarantee I won't pass on this baggage. It's cost me. \n\nWe've had some group therapy about it and communication is better, but it took years before mum could start to deal with her baggage. She still lies about dumb, stupid, small things. I've learned to let this go. \n\nIt's hard when you live together but you have some beautiful clarity in your post. Scream if you need to. Pillows are great, but it's ok to be upset. \n\nKids pick up on what we do, not what we tell them we do. \n\nYou might like to cross post to r/adultchildren, it was originally developed for adult children of alcoholics, but it's open to all folks who have mentally unwell parents. \n\nIt's ok for you to get help. Your recovery is not dependent on her doing the same. She may never get better, but you can. \n\nI'm always here if you need to chat.",
          "created_utc": 1576546887.0
        }
      ]
    },
    {
      "id": "fb5uwow",
      "author": "Rosethephoenix",
      "body": "Like my ED uses her behaviors/appearance as fuel. :(",
      "created_utc": 1576534807.0,
      "score": 5,
      "context": [
        {
          "id": "fb5u9pk",
          "author": "Rosethephoenix",
          "body": "My mom claims she is fine, but she is obviously physically underweight and I rarely see her eat. She also runs a diet bakery. During my worst times I compare myself to her and use her as inspiration. It’s fucked up.",
          "created_utc": 1576534462.0
        },
        {
          "id": "fb5ut40",
          "author": "certASLshittalker",
          "body": "I’m so sorry that you’re going through that :( it breaks my heart how many others have to witness their parents going through eating disorders. And by inspiration what do you mean? Like, you’re inspired NOT to become like her or you feel weirdly obligated to be like her?",
          "created_utc": 1576534751.0
        }
      ]
    },
    {
      "id": "fb6dahp",
      "author": "standsure",
      "body": "Likewise. \n\nIt's rough going with a parent with mental health issues.  We deserve better. The buck stops with me though. Recovery is my main driving force these days, some are better than others. \n\n\nIt's taken me a while to get to IRL meetings - I still find them super confronting. But folks there really get what it's like to have to not only parent yourself, but to basically relearn a bunch of things that 'normal' folks take for granted. \n\n\nYou are not alone. Hugs.",
      "created_utc": 1576547445.0,
      "score": 2,
      "context": [
        {
          "id": "fb6chkj",
          "author": "standsure",
          "body": "Babe I hear you and feel for you. \n\nMy ma started restricting my food when I was nine. Dad also had ED and so did G'ma. \n\nThere was no way I was going to get out of my childhood free from that. I made a deal with myself pretty early on - no kids until I can guarantee I won't pass on this baggage. It's cost me. \n\nWe've had some group therapy about it and communication is better, but it took years before mum could start to deal with her baggage. She still lies about dumb, stupid, small things. I've learned to let this go. \n\nIt's hard when you live together but you have some beautiful clarity in your post. Scream if you need to. Pillows are great, but it's ok to be upset. \n\nKids pick up on what we do, not what we tell them we do. \n\nYou might like to cross post to r/adultchildren, it was originally developed for adult children of alcoholics, but it's open to all folks who have mentally unwell parents. \n\nIt's ok for you to get help. Your recovery is not dependent on her doing the same. She may never get better, but you can. \n\nI'm always here if you need to chat.",
          "created_utc": 1576546887.0
        },
        {
          "id": "fb6cuvw",
          "author": "certASLshittalker",
          "body": "I’m so sorry to hear that happened to you :( that is beyond cruel. Thank you for showing me this new subreddit, I could really use it.",
          "created_utc": 1576547142.0
        }
      ]
    },
    {
      "id": "fb5vhpq",
      "author": "certASLshittalker",
      "body": "I do the exact same thing, it’s such a terrible mindset and it’s making it harder and harder to start with my recovery. I never even thought about this happening to others, it’s such a fucked up thought process and makes for such a sick, twisted dynamic with my mother.",
      "created_utc": 1576535126.0,
      "score": 4,
      "context": [
        {
          "id": "fb5u9pk",
          "author": "Rosethephoenix",
          "body": "My mom claims she is fine, but she is obviously physically underweight and I rarely see her eat. She also runs a diet bakery. During my worst times I compare myself to her and use her as inspiration. It’s fucked up.",
          "created_utc": 1576534462.0
        },
        {
          "id": "fb5ut40",
          "author": "certASLshittalker",
          "body": "I’m so sorry that you’re going through that :( it breaks my heart how many others have to witness their parents going through eating disorders. And by inspiration what do you mean? Like, you’re inspired NOT to become like her or you feel weirdly obligated to be like her?",
          "created_utc": 1576534751.0
        },
        {
          "id": "fb5uwow",
          "author": "Rosethephoenix",
          "body": "Like my ED uses her behaviors/appearance as fuel. :(",
          "created_utc": 1576534807.0
        }
      ]
    }
  ]
}