{
  "id": "ef4xd2",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1577211302.0,
  "title": "My friends haven't commented on my weight. This in my head means I'm fat and my ED is not valid.",
  "selftext": "So, I have seen a few friends today that I haven't seen for a while. I am underweight now and I have lost some weight, actually getting quite close to my lowest weight ever, but they haven't said anything even though in the past they did even when I was at a higher weight than now. This has triggered my worst ED feelings. I am fat, I need to lose more weight, I am a fraud, etc. \n\nI actually spoke to a friend about this and she simply replied \"I didn't even think about it, I was just happy to have you around\", which has done nothing but make me feel even worse. How dumb this illness is sometimes. :(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ef4xd2/my_friends_havent_commented_on_my_weight_this_in/",
  "score": 104,
  "num_comments": 4,
  "comments": [
    {
      "id": "fbyck03",
      "author": "Spectrachic311311",
      "body": "My friends stopped saying anything to me because they were worried. And they also figured they said something when I started losing so they didn’t feel the need to keep commenting.",
      "created_utc": 1577213499.0,
      "score": 41,
      "context": []
    },
    {
      "id": "fbypj00",
      "author": "MysticalWateryEye",
      "body": "This time of year some people are very focused on not mentioning food, especially when worried about someone, so they will avoid mentioning weight all together.For example, if you know a friend is struggling, most people know not to bring up weight/food etc.  Don't seek validation for your ED, recovery is hard around the holidays, but try to not go looking for Pro-ed comments.",
      "created_utc": 1577222937.0,
      "score": 28,
      "context": []
    },
    {
      "id": "fbyoau0",
      "author": "None",
      "body": "I have the same feelings bubble up when that happens. I wonder sometimes if it's out of envy, everyone is trying to lose weight and most people really struggle with doing that so they don't like to highlight others weight. I know I almost never comment on other people's weight, but I always notice.",
      "created_utc": 1577222022.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fc29sl0",
      "author": "disconnectedaliases",
      "body": "Dude, you're totally valid.  I struggled with a lot of the same feelings (\"I don't have a real ED, I'm just a fucking drama queen\") etc.  But I'm recovered now (at least I'm a normal BMI; mentally I'm still fucked), and I have a friend who's severely anorexic.  Being on the other side of it changed how I see things.  \n\nSo, to give you an idea, we work together at sort of a blue-collar labor intensive job (not fun when starving).  My coworkers are all really tight and so we all make fun of each other constantly.  There's lots of skinny dudes who are like, yknow, just...skinny young guys.  Built that way.  And everyone makes fun of them for being skinny (including themselves), and nobody's feelings get hurt and it's all in good fun.  But my one friend there, he's so so thin that he just looks ill; his face is all hollowed out and his skin is sort of grey, and I get nervous about him lifting heavy stuff or standing up too fast, and when he was really really bad, I was afraid I'd bump into him too hard and fucking injure the poor kid.  And even though he's very underweight and easily the thinnest one there, NOBODY comments on it.  All the other dudes get made fun of, but it's like this unspoken rule that we don't tease this one dude about his weight, and it's because we're all scared for him.  Like, sometimes I even get the vibe he's fishing for comments, and he'll say something like \"god, I need to start eating more, I'm so fucking skinny right now, it's bad\" or \"jesus, I need a new belt, I hate poking holes in them\", and even when he says stuff like that, we don't comment.  Everyone just sort of goes silent or someone will be like \"...yeah. yeah man.\"  Like, I guess what I'm trying to say is there's a line between \"gee, you've lost some weight\" and \"I'm concerned about this person and I'm not sure how to bring it up without making things weird so I'm just gonna keep my mouth shut\".  There's a point where people are worried, and at that point, usually they stop commenting.  Unless you've got an Italian grandma.  \n\nAlso, someone mentioned, once someone has commented, they often won't comment again.  They don't wanna seem nosy or make you uncomfortable.  So yeah dude, if you're legit underweight, then there's no way you're not skinny.  You're totally valid, and yeah, your friends probably just don't wanna make things weird.",
      "created_utc": 1577347498.0,
      "score": 2,
      "context": []
    }
  ]
}