{
  "id": "egsd7f",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1577548930.0,
  "title": "A list of the worst things my eating disorder made me do",
  "selftext": "So, I've been dealing with restricitve behaviour since the beginning of january this year, which slowly spiraled into horrible binge and restrict cycles and bulimia. As I started out overweight and haven't lost 'too much' weight because of not constantly restricitng, I don't look thin or like I have an eating disorder. The fact that I don't look like it and my diorder is invisible to everyone sometimes makes me feel like I'm not sick and forget about all the horrible things I've done and went through. I decided to somehow validate that yes there is definitly something wrong with me and this is not normal behaviour. Also to look back on and motivate me to not end up in those dark places again, as I'm trying my hardest to recover. Here we go.\n\n\\- went for a walk with my brother and we ate some apples picked straight from the tree which were delicious but I wasn't supposed to eat that afternoon so I spend the rest of the day crying in my bed - because i ate an apple??!\n\n\\- accepted some of my coworkers homemade cookies just to secretly throw them away a few seconds later, then proceeded to steal and eat like six more later when she left the box unattended\n\n\\- canceling plans with my then boyfriend all the time because i knew it would involve food\n\n\\- refusing to even let him hug me because I couldn't bear being touched and he would feel how fat I had gotten\n\n\\- breaking up with said boyfriend (over text because I am a horrible person) because I was in a horrible mental place and couldn't deal with the added stress of trying to maintain a relationship\n\n\\- eating an entire pack of sliced bread that was supposed to last my whole (finiancially unstable) family a week while my mom was with me in the kitchen yelling at me that I was just doing all of this to get back at her and make her life even worse (because sure mom, me literally destroying my body and being depressed and self harming for years is all about you, everything is just always about you, isn't it?)\n\n\\- not being able to make myself throw up with my finger when I first started purging, so I used my sisters' disposable razor and put it back afterwards WTF\n\n\\- being late to work because I went to  buy binge food \n\n\\- missing my last bus home because I went to the gas station to buy some chocolate and having to call my mum to pick me up in the middle of the night\n\n\\- binging on expired, already sorted out food in my work places stockroom, literally shoving disgusting stale chocolate down my throat while crouching in a corner, then hiding the empty wrappers under my shirt to throw away somewhere later to not raise suspicion\n\n\\- smuggling some of this expired food out of work to binge on later in a public bathroom\n\n\\- missing so much worktime because I was busy purging on the toilet (but my coworkers get cigarette breaks so its fine, right?)\n\n\\- stealing food that was clearly labeled with a name from our work places fridge and eating it hidden in the bathroom, generally taking sooo much food that was not particularily meant for me from everywhere\n\n\\- while looking for food in this fridge,  I dropped some tupperware on the floor with food going everywhere and I scooped it up from the dirty floor, and put it back in the container... i have no words\n\n\\- starting to smoke in a desperate attempt to surpress my hunger with nicotine (spoiler alert, it didn't work)\n\n\\- purging in the forest near my house in the freezing cold because I didn't want my family to hear me\n\n\\- using the sleeve of my jacket to clean up the vomit, snot and tears from my face and continuing to wear that same jacket for the rest of the day\n\n\\- being secretly happy when there's a stomach virus going around, because I want to catch it so I have an excuse to not eat and throw up\n\n\\- eating all the chocolate that was supposed to be a present for my sister\n\n\\- when i first went vegan, my sister went out of her way to get me some vegan sweets for my birthday and i felt like the worst person because just the day before, I binged on a shit load of non-vegan food because in \"binge-mode\" I just didn't give a fuck about the animals for a second\n\n\\- going on really long walks (4 hours+) with my brother, but not to spend time with him, just to burn calories and being a cranky, moody asshole the whole time because I hadn't eaten in forever\n\n\\- refusing to eat anything my mum cooked because she uses too much oil and \"unhealthy\" ingredients\n\n\\- ghosting my best friend and basically ruining our friendship because I just wanted to be alone and couldn't bear to explain what was going on \n\n\\- being stupidly proud of fitting in my sisters jeans when I secretly tried them on because I finally wasn't the fat one anymore\n\n\\- giving all the sweets I got as presents to my brother which is a shitty thing to do because he is overweight and has his own struggles with food and I shouldn't encourage him even more\n\n\\- forcing myself to go running, then tripping over a root in the forest and spraining my ankle which meant I couldn't run anymore for months\n\n\\- getting up in the middle of the night and binging on tons and tons of plain sliced bread, just sitting there alone in the kitchen in just my underwear, feeling so fucking disgusting\n\n\\- baking a cake and eating the entire thing myself later in the day, and yes it was fucking awkward to explain where the cake went that my whole family watched me make and was waiting to eat\n\nSo yeah, these are some of the shitty things that I did this year. I most definitly forgot about some specific things, but honestly, most of the last months are just a blur in my head, and lots of it feels far away and unreal, like it happened to a different person. As you can probably guess, I am more than ready to leave all of this mess behind and try my best to regain a normal relationship with food again, because it's just not worth it. If loosing weight means I lose myself and my values and become a horrible person in the process, then I guess I'll never be skinny. I don't know why I just confessed all of this shit to the entire internet, but it actually feels really good to get this of much chest, some of which I've not told a single person in my life and I am ready to keep fighting!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/egsd7f/a_list_of_the_worst_things_my_eating_disorder/",
  "score": 142,
  "num_comments": 36,
  "comments": [
    {
      "id": "fca80tk",
      "author": "None",
      "body": "I struggled with anorexia and bulimia and too be honest the bulimia was the worst. The things ive done, the money I've wasted, so much time that I'll never get back.",
      "created_utc": 1577564455.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fc9wt6k",
      "author": "currents-",
      "body": "I go through the exact same thing. I didn’t lose much weight when my disorder was at its worse. So I would constantly tell myself  “it’s not that bad” but my behaviors were so incredibly hurtful to myself that just thinking back on them now is painful. Therapy helps a lot but I think I need to make a list as well. Thank you for sharing",
      "created_utc": 1577559361.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fcafi2x",
      "author": "miquiztli323",
      "body": "Thank you for sharing, I know it was hard. Reading through these reminded me I’m not the only one out there that goes through weird behaviors as a result of disordered eating.\nThe thing I hate the most is when I restrict in public because I’m trying to be “good” then binge later in private because I felt sad/left out. \nExample: coworkers buy pizza and I decline but then secretly eat several slices and go on to binge the rest of the day. One slice with coworkers would NOT have derailed me but I went on to sabotage myself all alone. Why! Why?!",
      "created_utc": 1577568346.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fcagbk7",
      "author": "pabstpumpkinbeer",
      "body": "Thanks for sharing this list. It was really brave. I have done many similar things and worse things, things I'm so deeply ashamed of I can't even admit it anonymously on the internet. I remember those things when the siren song of my eating disorder is ringing. It helps to bring me back to reality, remembering that my eating disorder didn't ever make me happier, not really, and instead I did things that made me ashamed of myself.",
      "created_utc": 1577568734.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fcagbci",
      "author": "None",
      "body": "This hits so close to home. I ,for one, am actually really grateful that you shared it. It is a comfort to me to know I am not the only person in the world, isolated and alone feeling, to actually be isolated and alone. This disease can take away your sense of value, and is based on control, and the irony is there is a loss of control and even the control is in service to something that controls you. I really hope this year is a blessing to you, and you can find the moments that will help pull you through. I can tell you are a beautiful person, with dimension and things to offer.",
      "created_utc": 1577568731.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fcabc41",
      "author": "missyb",
      "body": "I do these kind of things too. You're not alone.",
      "created_utc": 1577566078.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fcakrb5",
      "author": "bingumarmar",
      "body": "I read this list and all I thought was how I would/could easily do all of those things. I also dont look underweight so I feel at times like my disorder isnt \"real\" or as bad as being anorexic. But the restrictive behaviors and guilt totally take over my life- it's an invisible disease...I feel you.",
      "created_utc": 1577571140.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fcba9sj",
      "author": "None",
      "body": "I’m 17, here’s my list so far\n\nStole laxatives from my 73 y/o gramma (sorry gramma)\n\nStole a whole bottle of diet pills from my mom (she never asked for them back and I was like 15, you would think if your diet pills go missing and you have a 15 year old daughter then you should ask for them back so she doesn’t die or something)\n\nFingerless purged with the door open so my mom would see me and I would get out of doing my homework that day. It worked\n\nMy cat once knocked over a picture frame that was holding a drawing my friend gave me, and I used the broken glass to cut myself. My friend never would have wanted that\n\nStealing caffeine pills \n\nMaking tea in English class (my teacher loves me so she gives permission) so I wouldn’t eat lunch. Bonus: her grand daughter is currently in treatment for anorexia and she is so scared for her, meanwhile I still don’t eat\n\nBeing so stressed because my teacher’s granddaughter was almost dying from anorexia that I didn’t eat for two days\n\nWhen a friend was talking to me within those two days I did something small wrong and felt guilty plus all the stress from the previously mentioned incident that I started crying and had to skip class for the day to stop\n\nLying to my friend and making a scene at a lunch table because she wanted me to eat. \n\nNot bringing money for lunch but the same friend wanted me to eat so she gave me money so I could buy food I didn’t even want\n\nBuying binge food with my dad’s money and purging it\n\nPurging in a school bathroom after a class party\n\nUsing my super tiny friend as thinspo\n\nUsing my 275 pound friend as reverse thinspo\n\nAccidentally introducing that friend to the proana movement (she ate 700 calories for one day and gave up)\n\nGhosted an “Ana buddy” when I was 14 (I contacted her this year to apologize)\n\nAnd probably more",
      "created_utc": 1577584402.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fcauxr1",
      "author": "elleareby",
      "body": "this was me in 2018. throwing up outside while walking my dog to hide it. always wondering what she thought of me lol. it fucking sucks. but guess what? you can get to a better mental place and move past this, no matter how erratic your actions become. it’s a process but i’ve been behavior free for months now despite some very strong urges. the longer you go without doing it the easier it gets. telling people in my life about it actually helped me, for what it’s worth. i’d hidden it for over a decade. don’t lose hope.",
      "created_utc": 1577577111.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fcatfnt",
      "author": "auamethyst",
      "body": "I’ve done all kinds of weird shit too. It’s very interesting to me what people’s ED behaviors are because a lot of them are different. \nBut the purging with the razor though...not the sharp end right? Please tell me not the sharp end",
      "created_utc": 1577576267.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fcay40g",
      "author": "None",
      "body": "I’m going through the same thing/feelings with my now boyfriend. He knows I’m dealing with this and he’s supportive but I’m pushing him away because of the added stress. I have also done a lot of those things on your list.  Time to be kind to ourselves and forgive ourselves. 😔",
      "created_utc": 1577578906.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fcbyoaz",
      "author": "None",
      "body": "Ugh, yeah. When I used to restrict a lot, I used to get drunk and eat my ex’s sister’s food at their apartment in the middle of the night. It got so bad she confronted him about it and told him I couldn’t stay over anymore. \n\nI feel terrible for every piece of food I binged and purged. So wasteful. Also, I drank a lot to get myself to stop feeling guilty about binging so there’s that. It really hurt my family to see that. \n\nI’ve freaked out at many boyfriends about eating/food/calories. I’ve sobbed drunk on the floor of a CVS at midnight because the ice cream I planned to eat had more calories than I thought it did. I screamed at my mom when she asked me to stay for dinner and I ate something I couldn’t find the calories for. \n\nRecovery involves forgiveness for all of those things you don’t love that you did. It sounds like you’re off to a good start. Good luck!!",
      "created_utc": 1577592439.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fckatue",
      "author": "Flesh-And-Bone",
      "body": ">- refusing to even let him hug me because I couldn't bear being touched and he would feel how fat I had gotten\n\n>- refusing to eat anything my mum cooked because she uses too much oil and \"unhealthy\" ingredients\n\n>- going on really long walks (4 hours+) with my brother, but not to spend time with him, just to burn calories and being a cranky, moody asshole the whole time because I hadn't eaten in forever\n\n\nI feel all of these really hard. I am sick and tired of the disordered bullshit damaging my relationships. Sometimes, I will become agitated when my husband tries to snuggle me because of how him touching my body feels, and there are times when I'm a moody shit at him because I've been fasting too long. I can't ever go over to my parents' for food because it's unhealthy. Then when I do finally allow myself to have treat food, it's a huge, embarrassing amount of it because it's been so long since I've allowed myself to eat how normal people do.\n\nIt's tiresome. I'm sick of it. I just want to be a normal, healthy person at a normal, healthy weight, but I'm already overweight and the amount of food I'm packing away is going to put me in the obese territory soon.",
      "created_utc": 1577721117.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fcbwpej",
      "author": "0912841",
      "body": "Sometimes it feels like I'm just a horrible, shitty person, but then I have to remind myself that it's not me, it's the ED that makes the worst of me come out.\n\nKeep this list as a reminder of all the reasons why you want to recover.\nBUT\nRemember and acknowledge all the good there is about you when you are healthy (mentally and physically).",
      "created_utc": 1577591811.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fccylqu",
      "author": "atworkkit",
      "body": "Wow, I’ve done SO MANY of these. Shame memories activated for sure, but it’s good to face. Thank you 💕",
      "created_utc": 1577604207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcdiktv",
      "author": "uhhhhhhhbro",
      "body": "I’ve been struggling with bulimia for a lot of this year (went from extremely heavy restricting early on in the year and i eventually got into purging) and I relate to so many of the things this disorder made you do. wishing you the best💛",
      "created_utc": 1577610331.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcaxo1x",
      "author": "None",
      "body": "That is so true! Despite losing my period, the physical effects of my disorder were never toooo bad, at least easy to ignore. The mental struggles, what was/is going on in my head and knowing how I'm wasting my life ist just the worst. Good luck to you too!",
      "created_utc": 1577578655.0,
      "score": 7,
      "context": [
        {
          "id": "fca80tk",
          "author": "None",
          "body": "I struggled with anorexia and bulimia and too be honest the bulimia was the worst. The things ive done, the money I've wasted, so much time that I'll never get back.",
          "created_utc": 1577564455.0
        }
      ]
    },
    {
      "id": "fcbfewg",
      "author": "toritxtornado",
      "body": "totally. purging is by far the worst part of my ed. i’m in recovery now but i know it can come back at any time.",
      "created_utc": 1577586191.0,
      "score": 4,
      "context": [
        {
          "id": "fca80tk",
          "author": "None",
          "body": "I struggled with anorexia and bulimia and too be honest the bulimia was the worst. The things ive done, the money I've wasted, so much time that I'll never get back.",
          "created_utc": 1577564455.0
        }
      ]
    },
    {
      "id": "fcctc1x",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1577602387.0,
      "score": 1,
      "context": [
        {
          "id": "fca80tk",
          "author": "None",
          "body": "I struggled with anorexia and bulimia and too be honest the bulimia was the worst. The things ive done, the money I've wasted, so much time that I'll never get back.",
          "created_utc": 1577564455.0
        }
      ]
    },
    {
      "id": "fcax8cl",
      "author": "None",
      "body": "Thank you for replying! You're right, it is so easy to dismiss your disorder because other people have it worse or take it further but we are still valid. Good luck for your own recovery!",
      "created_utc": 1577578410.0,
      "score": 8,
      "context": [
        {
          "id": "fc9wt6k",
          "author": "currents-",
          "body": "I go through the exact same thing. I didn’t lose much weight when my disorder was at its worse. So I would constantly tell myself  “it’s not that bad” but my behaviors were so incredibly hurtful to myself that just thinking back on them now is painful. Therapy helps a lot but I think I need to make a list as well. Thank you for sharing",
          "created_utc": 1577559361.0
        }
      ]
    },
    {
      "id": "fcaxxap",
      "author": "None",
      "body": "Oh I feel you, I sabotage myself like that all the time, it always seems so stupid afterwards. Thank you for replying, it's good to know there are people out there who understand.",
      "created_utc": 1577578799.0,
      "score": 3,
      "context": [
        {
          "id": "fcafi2x",
          "author": "miquiztli323",
          "body": "Thank you for sharing, I know it was hard. Reading through these reminded me I’m not the only one out there that goes through weird behaviors as a result of disordered eating.\nThe thing I hate the most is when I restrict in public because I’m trying to be “good” then binge later in private because I felt sad/left out. \nExample: coworkers buy pizza and I decline but then secretly eat several slices and go on to binge the rest of the day. One slice with coworkers would NOT have derailed me but I went on to sabotage myself all alone. Why! Why?!",
          "created_utc": 1577568346.0
        }
      ]
    },
    {
      "id": "fcaz2jo",
      "author": "None",
      "body": "Thanks for your reply! Yeah I feel like that too. That's why I compiled this list, to look back and remember how miserable this disorder made me and what shitty things I did and that chosing recovery although very hard sometimes will always be better than going back to this. Good luck to you!",
      "created_utc": 1577579447.0,
      "score": 3,
      "context": [
        {
          "id": "fcagbk7",
          "author": "pabstpumpkinbeer",
          "body": "Thanks for sharing this list. It was really brave. I have done many similar things and worse things, things I'm so deeply ashamed of I can't even admit it anonymously on the internet. I remember those things when the siren song of my eating disorder is ringing. It helps to bring me back to reality, remembering that my eating disorder didn't ever make me happier, not really, and instead I did things that made me ashamed of myself.",
          "created_utc": 1577568734.0
        }
      ]
    },
    {
      "id": "fcaygct",
      "author": "None",
      "body": "Thank you! This is such a well phrased reply, I really needed to hear some kind words. I wish you all the best aswell 💕",
      "created_utc": 1577579101.0,
      "score": 3,
      "context": [
        {
          "id": "fcagbci",
          "author": "None",
          "body": "This hits so close to home. I ,for one, am actually really grateful that you shared it. It is a comfort to me to know I am not the only person in the world, isolated and alone feeling, to actually be isolated and alone. This disease can take away your sense of value, and is based on control, and the irony is there is a loss of control and even the control is in service to something that controls you. I really hope this year is a blessing to you, and you can find the moments that will help pull you through. I can tell you are a beautiful person, with dimension and things to offer.",
          "created_utc": 1577568731.0
        }
      ]
    },
    {
      "id": "fcay5oc",
      "author": "None",
      "body": "Thank you! It's nice to feel less alone although I wish there was some happier reason for us to relate to eachother.",
      "created_utc": 1577578934.0,
      "score": 1,
      "context": [
        {
          "id": "fcabc41",
          "author": "missyb",
          "body": "I do these kind of things too. You're not alone.",
          "created_utc": 1577566078.0
        }
      ]
    },
    {
      "id": "fcazcy8",
      "author": "None",
      "body": "Thank you! If your disorder is causing you suffering like this it is definitly real. You are valid and not alone!",
      "created_utc": 1577579608.0,
      "score": 1,
      "context": [
        {
          "id": "fcakrb5",
          "author": "bingumarmar",
          "body": "I read this list and all I thought was how I would/could easily do all of those things. I also dont look underweight so I feel at times like my disorder isnt \"real\" or as bad as being anorexic. But the restrictive behaviors and guilt totally take over my life- it's an invisible disease...I feel you.",
          "created_utc": 1577571140.0
        }
      ]
    },
    {
      "id": "fcbjyay",
      "author": "None",
      "body": "I am so sorry you are going through this. Just know that you are not alone, I am right here with you and understand how hard it can be. Let's try our best to not make our lists any longer and focus on making better decisions in the future, for our own sanity and health. We can beat this and there will be better days!",
      "created_utc": 1577587743.0,
      "score": 2,
      "context": [
        {
          "id": "fcba9sj",
          "author": "None",
          "body": "I’m 17, here’s my list so far\n\nStole laxatives from my 73 y/o gramma (sorry gramma)\n\nStole a whole bottle of diet pills from my mom (she never asked for them back and I was like 15, you would think if your diet pills go missing and you have a 15 year old daughter then you should ask for them back so she doesn’t die or something)\n\nFingerless purged with the door open so my mom would see me and I would get out of doing my homework that day. It worked\n\nMy cat once knocked over a picture frame that was holding a drawing my friend gave me, and I used the broken glass to cut myself. My friend never would have wanted that\n\nStealing caffeine pills \n\nMaking tea in English class (my teacher loves me so she gives permission) so I wouldn’t eat lunch. Bonus: her grand daughter is currently in treatment for anorexia and she is so scared for her, meanwhile I still don’t eat\n\nBeing so stressed because my teacher’s granddaughter was almost dying from anorexia that I didn’t eat for two days\n\nWhen a friend was talking to me within those two days I did something small wrong and felt guilty plus all the stress from the previously mentioned incident that I started crying and had to skip class for the day to stop\n\nLying to my friend and making a scene at a lunch table because she wanted me to eat. \n\nNot bringing money for lunch but the same friend wanted me to eat so she gave me money so I could buy food I didn’t even want\n\nBuying binge food with my dad’s money and purging it\n\nPurging in a school bathroom after a class party\n\nUsing my super tiny friend as thinspo\n\nUsing my 275 pound friend as reverse thinspo\n\nAccidentally introducing that friend to the proana movement (she ate 700 calories for one day and gave up)\n\nGhosted an “Ana buddy” when I was 14 (I contacted her this year to apologize)\n\nAnd probably more",
          "created_utc": 1577584402.0
        }
      ]
    },
    {
      "id": "fcazjgp",
      "author": "None",
      "body": "Thank you so much! I will definitly give recovery my all and try to get to a better mental place.",
      "created_utc": 1577579710.0,
      "score": 1,
      "context": [
        {
          "id": "fcauxr1",
          "author": "elleareby",
          "body": "this was me in 2018. throwing up outside while walking my dog to hide it. always wondering what she thought of me lol. it fucking sucks. but guess what? you can get to a better mental place and move past this, no matter how erratic your actions become. it’s a process but i’ve been behavior free for months now despite some very strong urges. the longer you go without doing it the easier it gets. telling people in my life about it actually helped me, for what it’s worth. i’d hidden it for over a decade. don’t lose hope.",
          "created_utc": 1577577111.0
        }
      ]
    },
    {
      "id": "fcazu8q",
      "author": "None",
      "body": "Nooo not the sharp end! That would be pretty extreme even for my standards lol",
      "created_utc": 1577579878.0,
      "score": 1,
      "context": [
        {
          "id": "fcatfnt",
          "author": "auamethyst",
          "body": "I’ve done all kinds of weird shit too. It’s very interesting to me what people’s ED behaviors are because a lot of them are different. \nBut the purging with the razor though...not the sharp end right? Please tell me not the sharp end",
          "created_utc": 1577576267.0
        }
      ]
    },
    {
      "id": "fcbj5o7",
      "author": "None",
      "body": "I'm sorry you can relate. I find it so hard to let people in even of they're supportive and want to help because the whole disorder is just so shameful and the behaviours are just nearly impossible to explain to normal thinking people. But you are right, we deserve to forgive ourselves and to not feel like shit all the time. Good luck to you!",
      "created_utc": 1577587485.0,
      "score": 3,
      "context": [
        {
          "id": "fcay40g",
          "author": "None",
          "body": "I’m going through the same thing/feelings with my now boyfriend. He knows I’m dealing with this and he’s supportive but I’m pushing him away because of the added stress. I have also done a lot of those things on your list.  Time to be kind to ourselves and forgive ourselves. 😔",
          "created_utc": 1577578906.0
        }
      ]
    },
    {
      "id": "fcesja9",
      "author": "None",
      "body": "I relate so much to the crying over ice cream part, oh my god. The amount of time I've spend just wandering around supermarkets, comparing calories, taking food from the shelve just to put it back a few minutes later, eventually leaving with nothing but a diet soda because I'm too awkward to not buy anything at all, it's just ridiculous. Or just running past the people waiting at the cash register to go hide in a public bathroom because I'm having a panic attack... And yeah I've definitly yelled at my mom over food before which makes me feel horrible because despite having barely any understanding of my mental problems and eating disorder, she's always been there for me and trying her best. Anyway, thank you for replying and good luck to you too!",
      "created_utc": 1577623368.0,
      "score": 2,
      "context": [
        {
          "id": "fcbyoaz",
          "author": "None",
          "body": "Ugh, yeah. When I used to restrict a lot, I used to get drunk and eat my ex’s sister’s food at their apartment in the middle of the night. It got so bad she confronted him about it and told him I couldn’t stay over anymore. \n\nI feel terrible for every piece of food I binged and purged. So wasteful. Also, I drank a lot to get myself to stop feeling guilty about binging so there’s that. It really hurt my family to see that. \n\nI’ve freaked out at many boyfriends about eating/food/calories. I’ve sobbed drunk on the floor of a CVS at midnight because the ice cream I planned to eat had more calories than I thought it did. I screamed at my mom when she asked me to stay for dinner and I ate something I couldn’t find the calories for. \n\nRecovery involves forgiveness for all of those things you don’t love that you did. It sounds like you’re off to a good start. Good luck!!",
          "created_utc": 1577592439.0
        }
      ]
    },
    {
      "id": "fcll5q4",
      "author": "None",
      "body": "I am so sorry you can relate, I know how isolating and horrible this disorser can be. You've probably heard this a million times and I myself am still having trouble to come to terms with it, but I really think the only way to stop this stupid cycle is to stop restricting and eating intuitivly, like actually responding to your hunger and how certain foods make you feel and not completely illiminating any \"bad\" foods. Of course this isn't going to magically fix anything overnight and I still am at the very beginning of recovery, but it definitly helped me gain some sanity back and allowed me to be (slightly) less obsessive about food. Maybe you can try to make this journey less about losing weight and the way your body looks and more about the way you feel in it? Our bodies are meant to carry us through life, they should not be our entire life. I know it's hard, but you are not alone in this! Let's keep fighting!",
      "created_utc": 1577750349.0,
      "score": 2,
      "context": [
        {
          "id": "fckatue",
          "author": "Flesh-And-Bone",
          "body": ">- refusing to even let him hug me because I couldn't bear being touched and he would feel how fat I had gotten\n\n>- refusing to eat anything my mum cooked because she uses too much oil and \"unhealthy\" ingredients\n\n>- going on really long walks (4 hours+) with my brother, but not to spend time with him, just to burn calories and being a cranky, moody asshole the whole time because I hadn't eaten in forever\n\n\nI feel all of these really hard. I am sick and tired of the disordered bullshit damaging my relationships. Sometimes, I will become agitated when my husband tries to snuggle me because of how him touching my body feels, and there are times when I'm a moody shit at him because I've been fasting too long. I can't ever go over to my parents' for food because it's unhealthy. Then when I do finally allow myself to have treat food, it's a huge, embarrassing amount of it because it's been so long since I've allowed myself to eat how normal people do.\n\nIt's tiresome. I'm sick of it. I just want to be a normal, healthy person at a normal, healthy weight, but I'm already overweight and the amount of food I'm packing away is going to put me in the obese territory soon.",
          "created_utc": 1577721117.0
        }
      ]
    },
    {
      "id": "fcetp3l",
      "author": "None",
      "body": "Thank you so much! I will try my best, which sounds a bit hypocritical now knowing full well that I had another huge binge attack yesterday shortly after writing my post. But I guess revcovery doesn't just happen overnight. It took months, even years, for my body image and relationship with food to get this fucked up so I can't expect to magically fix it in day... I wish you all the best as well!",
      "created_utc": 1577623674.0,
      "score": 2,
      "context": [
        {
          "id": "fcbwpej",
          "author": "0912841",
          "body": "Sometimes it feels like I'm just a horrible, shitty person, but then I have to remind myself that it's not me, it's the ED that makes the worst of me come out.\n\nKeep this list as a reminder of all the reasons why you want to recover.\nBUT\nRemember and acknowledge all the good there is about you when you are healthy (mentally and physically).",
          "created_utc": 1577591811.0
        }
      ]
    },
    {
      "id": "fcettii",
      "author": "None",
      "body": "Thank you, too and good luck!",
      "created_utc": 1577623716.0,
      "score": 1,
      "context": [
        {
          "id": "fccylqu",
          "author": "atworkkit",
          "body": "Wow, I’ve done SO MANY of these. Shame memories activated for sure, but it’s good to face. Thank you 💕",
          "created_utc": 1577604207.0
        }
      ]
    },
    {
      "id": "fceu1wb",
      "author": "None",
      "body": "I wish you all the best aswell! Remember that you are not going through this alone, we got this!",
      "created_utc": 1577623784.0,
      "score": 2,
      "context": [
        {
          "id": "fcdiktv",
          "author": "uhhhhhhhbro",
          "body": "I’ve been struggling with bulimia for a lot of this year (went from extremely heavy restricting early on in the year and i eventually got into purging) and I relate to so many of the things this disorder made you do. wishing you the best💛",
          "created_utc": 1577610331.0
        }
      ]
    },
    {
      "id": "fcfc10j",
      "author": "0912841",
      "body": "Yeah you're not alone, it's addictive. Sugar IS my drug -_-",
      "created_utc": 1577628477.0,
      "score": 1,
      "context": [
        {
          "id": "fca80tk",
          "author": "None",
          "body": "I struggled with anorexia and bulimia and too be honest the bulimia was the worst. The things ive done, the money I've wasted, so much time that I'll never get back.",
          "created_utc": 1577564455.0
        },
        {
          "id": "fcctc1x",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1577602387.0
        }
      ]
    },
    {
      "id": "fccd4jp",
      "author": "None",
      "body": "Cheers to the new year",
      "created_utc": 1577597029.0,
      "score": 1,
      "context": [
        {
          "id": "fcba9sj",
          "author": "None",
          "body": "I’m 17, here’s my list so far\n\nStole laxatives from my 73 y/o gramma (sorry gramma)\n\nStole a whole bottle of diet pills from my mom (she never asked for them back and I was like 15, you would think if your diet pills go missing and you have a 15 year old daughter then you should ask for them back so she doesn’t die or something)\n\nFingerless purged with the door open so my mom would see me and I would get out of doing my homework that day. It worked\n\nMy cat once knocked over a picture frame that was holding a drawing my friend gave me, and I used the broken glass to cut myself. My friend never would have wanted that\n\nStealing caffeine pills \n\nMaking tea in English class (my teacher loves me so she gives permission) so I wouldn’t eat lunch. Bonus: her grand daughter is currently in treatment for anorexia and she is so scared for her, meanwhile I still don’t eat\n\nBeing so stressed because my teacher’s granddaughter was almost dying from anorexia that I didn’t eat for two days\n\nWhen a friend was talking to me within those two days I did something small wrong and felt guilty plus all the stress from the previously mentioned incident that I started crying and had to skip class for the day to stop\n\nLying to my friend and making a scene at a lunch table because she wanted me to eat. \n\nNot bringing money for lunch but the same friend wanted me to eat so she gave me money so I could buy food I didn’t even want\n\nBuying binge food with my dad’s money and purging it\n\nPurging in a school bathroom after a class party\n\nUsing my super tiny friend as thinspo\n\nUsing my 275 pound friend as reverse thinspo\n\nAccidentally introducing that friend to the proana movement (she ate 700 calories for one day and gave up)\n\nGhosted an “Ana buddy” when I was 14 (I contacted her this year to apologize)\n\nAnd probably more",
          "created_utc": 1577584402.0
        },
        {
          "id": "fcbjyay",
          "author": "None",
          "body": "I am so sorry you are going through this. Just know that you are not alone, I am right here with you and understand how hard it can be. Let's try our best to not make our lists any longer and focus on making better decisions in the future, for our own sanity and health. We can beat this and there will be better days!",
          "created_utc": 1577587743.0
        }
      ]
    },
    {
      "id": "fcfc788",
      "author": "0912841",
      "body": "Thanks :)",
      "created_utc": 1577628540.0,
      "score": 1,
      "context": [
        {
          "id": "fcbwpej",
          "author": "0912841",
          "body": "Sometimes it feels like I'm just a horrible, shitty person, but then I have to remind myself that it's not me, it's the ED that makes the worst of me come out.\n\nKeep this list as a reminder of all the reasons why you want to recover.\nBUT\nRemember and acknowledge all the good there is about you when you are healthy (mentally and physically).",
          "created_utc": 1577591811.0
        },
        {
          "id": "fcetp3l",
          "author": "None",
          "body": "Thank you so much! I will try my best, which sounds a bit hypocritical now knowing full well that I had another huge binge attack yesterday shortly after writing my post. But I guess revcovery doesn't just happen overnight. It took months, even years, for my body image and relationship with food to get this fucked up so I can't expect to magically fix it in day... I wish you all the best as well!",
          "created_utc": 1577623674.0
        }
      ]
    }
  ]
}