{
  "id": "ehn8gb",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1577718986.0,
  "title": "I was called fat (18 years of an ED with me)- excerpt:",
  "selftext": "Yesterday someone told me I had gained weight. \nIt broke a bit of my mind and took me again to those horrible days and years where ALL I could think about was the number of the scale, TERRIFIED of someone telling I had gained weight and longing for just compliments and specially just the ACCEPTANCE of the rest of the world, to be loved at least for something even if it was something as vacuous as external appearance.\nI can’t even imagine how I could do all the things I did and still, I’m here.\n\nThis person was not coming from a bad place when she told me that. She haven’t seen me in two years almost and last time we saw each other, I was having one of the worst times in my life. Struggling at work, family and in an awful relationship that almost killed me.\nMy face was sunken although I always keep a “healthy” weight for the past 10 years since I have  - almost - recovered.\nI am in no means in the best moment of my life but, I have decided to take everything with another perspective. I know ED Is going to be a part of my life for ever but, I don’t give him the time of day anymore.\n\nOne of my best friends died one month ago. Something clicked in my head. \nAs I strolled the streets with my earbuds and music, I stumbled upon a new person that teaches me to love food, enjoy life and, although it’s not easy and I don’t know really where I stand, I’m having the best weeks in years.\nWorking, dedicating my days to my pets and family and now, this new change.\n\nI realised yesterday that, I don’t want to go back to my 39 kilogram weight. I am short, I am old, I have had a pregnancy, I have millions of flaws but, I rather be at my weight right now, working out, eating new things, making love and feeling love even if I have been told I don’t deserve it and that I’m a monster.\n\nI’ll never be perfect. I can only be the best person for my own persona. Cos it’s my best companion and the first love I should have learned in life.\n\nThank you for calling me fat. Cos now I know I want to LIVE and don’t die anymore. Funny how things change.\nI don’t know what the future will bring and, I’m sure I’ll make a million of mistakes but, I have learned to like and even love? My recovered skin and rosy cheeks, my hair growing and my muscles and scars. \nI have lots of war marks from ED, specially my teeth but, I just want to keep on going and fix myself as best as I can when I feel like it.\n\nDear person who reads this, have an amazing day, YOU ARE LOVED, YOU ARE WORTHY AND YOU ARE NOT YOUR ED.\n\nI love you,\n\nHappy new year",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ehn8gb/i_was_called_fat_18_years_of_an_ed_with_me_excerpt/",
  "score": 119,
  "num_comments": 6,
  "comments": [
    {
      "id": "fckibp5",
      "author": "ScreamingWeevil",
      "body": "I thought I was going to need to wring out one more supportive essay at the start of this. It turns out things were the other way 'round.\n\nThank you. I love you too! Have a wonderful new year :)",
      "created_utc": 1577725965.0,
      "score": 31,
      "context": []
    },
    {
      "id": "fckiu45",
      "author": "applecinnamonnn",
      "body": "Loved reading this. Thank you so much, dear. Happy new year to you too and happy new life :)",
      "created_utc": 1577726282.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fckohlk",
      "author": "lifeofagirlonreddit",
      "body": "I love this and I love you\n\nYou are beautiful, so is your mind. I hope you can keep this mindset! \n\nLots of love !",
      "created_utc": 1577729766.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fckpdut",
      "author": "None",
      "body": "So proud of you! You have come so far and are doing fantastic, I wish you all the luck in the world. Stay strong and keep fighting ❤",
      "created_utc": 1577730316.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fclgoy0",
      "author": "pinkiepiekid",
      "body": "You have given out such a lovely message, I'll definitely be keeping this in mind. Thank you for sharing this story <3",
      "created_utc": 1577747371.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fcn4h7a",
      "author": "Raquelline",
      "body": "This is really encouraging. Know you are an inspiration to those struggling on this page, proving that it does get better. I know I really needed to hear this right now, and I'm sure many others on this page needed to as well. You are doing a great job, and I'm so glad you are in a better, healthier place.\nGod bless.",
      "created_utc": 1577803014.0,
      "score": 3,
      "context": []
    }
  ]
}