{
  "id": "ekhotc",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1578252429.0,
  "title": "Feeling like a failure because there are so many anorexics who just never binge while I constantly do.",
  "selftext": "Why can't I just recover in a \"pure\" way? Just eating meals, slowly gaining weight, enjoying eating again and opening myself to more and more foods every day?\n\nWhy do I always have to regain weight by binging messily and feeling like a greedy disgusting pig? Why do I always have to feel like recovery is giving me nothing besides fear, panic and fat on my belly?\n\nPeople keep saying this is normal. It's not. There are so many people who never binge in recovery.\n\nI honestly feel better when I restrict. At least I can relate to others' experience.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ekhotc/feeling_like_a_failure_because_there_are_so_many/",
  "score": 117,
  "num_comments": 15,
  "comments": [
    {
      "id": "fdbbtn5",
      "author": "wanderlustcub",
      "body": "Hello. \n\nI think you have been misled. \n\nBinging is a part of anorexia.  when you starve yourself, your body is built to binge when food is available, there is no getting around that. Part of the mental trauma is that our bodies are doing what our minds don't want it to do. \n\n. I have not met an anorexic person who hasn't binged. \n\nYou are not a failure, you are doing something that is absolutely normal for the situation you are currently in. I will repeat, you are not a failure.",
      "created_utc": 1578255855.0,
      "score": 66,
      "context": []
    },
    {
      "id": "fdb2vbh",
      "author": "rebekahlorraine",
      "body": "I do this. Went from 196 down to 129 within a year, I'm probably around 160 right now and fucking miserable. I haven't got on a scale since I hit 145 this past summer and my self esteem plummeted. I'm too scared to at this point. I got a job at a bakery in August and have had a huge issue with binging up until this past month when a coworker mentioned I looked thin on a day I felt huge. I've cut down a lot, but it's still been really hard not to when I'm up late and bored. I know it doesn't feel normal, but it really is. Everyone deals with their ED differently, try not to be too hard on yourself.",
      "created_utc": 1578253155.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fdb8ras",
      "author": "None",
      "body": "Hate to say it but I've never spoken to an anorexic who has never binged. I tend to alternate between restricting and then binging when I try to begin eating a more balanced diet. \n\nIt may not be fun, but for most it is a response to the starvation or anxiety. Do your best to balance your meals in recovery and establish healthy food patterns. It sucks, but please dont feel like you're the only one.",
      "created_utc": 1578254992.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fdbdkpw",
      "author": "TarHound",
      "body": "I definitely messily ate/binged myself all the way to weight restoration. Gained >!2-2.5!< kgs every week. I had extreme hunger pretty much from the week I started recovery until I gained my period back and then some. I’m still experiencing extreme hunger some days and end up binging. It only gets worse if I restrict in any way. You are not alone.",
      "created_utc": 1578256334.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fdbk7eq",
      "author": "cocoakobra",
      "body": "Allowing your body to eat what it’s craving and listening to your hunger cues, no matter how big and scary they are, IS normal. It’s a common occurrence for anorexics, if not something that happens to *every* anorexic. \n\nI went from underweight and eating a small amount of food 2-3 days a week to eating 3-5k calories every day, probably 4 or 5 meals on average, because of my extreme hunger. I felt out of control sometimes. It scared me and made me feel like I was absolutely repulsive, but it’s what my body needed. I knew I had to give my body what it was asking for if I ever wanted things to get better. The human body does not like being underweight and will fight back against starvation.\n\nI sat in bed with two pints of ice cream, a sleeve of Oreos, a box of bakery cookies, and a bag of chocolate covered cashews and inhaled them in record time the other day. Recovery can be messy and normal to nobody but you, and that’s okay.",
      "created_utc": 1578258176.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fdbco9k",
      "author": "twinkies2",
      "body": "This may sound a bit harsh but, recovery is recovery. No matter how many times you relapse, no matter how much you eat, recovery isn't just \"Yeah I was diagnosed with anorexia the other day and now I eat the amount you should with no problem!\" if anything it is often \"I was diagnosed with anorexia a couple years ago and I'm still trying to get better, I have relapsed countless times and binged lots but I'm trying\". \n\nRecovery is different for everyone!\n\nI am NOT saying anorexia is a diet or lightening the seriousness of it I am just using this as an example; \n\nPeople who do healthy diets or just eat healthy have cheat days where they eat a ton of junk and that's natural! Because afterall whoever you are , eating something even if its unhealthy af that is better than not eating at all!  \n\nyou said there are so many people who never binge in recovery, but there are so many people who **do**. Some people (like me) aren't even recovering or trying, you're making an effort. Life isn't a game, the progress you make doesn't go down the drain just because of something you may see as 'un-pure'.\n\nI understand the high you get when you restrict, I love the feeling of my stomach excruciating feeling in my stomach , I totally get it. But don't you miss the feeling of love and happiness you got when you had just ate loads of really nice stuff and felt like you were going to explode? \n\nSorry if this wasn't any help, wishing you the best :)",
      "created_utc": 1578256057.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fdc5aot",
      "author": "watch_earthlings",
      "body": "When I was at my lowest weight ever, around 68 pounds and in and out of the hospital, I was binging thousands of thousands upon thousands of calories at a time whenever I was left on my own in my family’s house. I could not control it and I would bloat worse than a 58 month pregnant woman with quadruplets lol that’s how much I would eat. The idea that you’re not or a “real” or “true” anorexic because you binge is fcking stupid and just not true or reality at all lol fuck anyone who says that.",
      "created_utc": 1578267383.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fdb8n0w",
      "author": "Elizabitch4848",
      "body": "It is normal. I’m guessing the people who say they don’t either are lying or aren’t really recovering. It’s a biological response. I did it after being bulimic. It goes away eventually as long as you don’t restrict yourself.",
      "created_utc": 1578254949.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fdbh419",
      "author": "ashley_at_clubmates",
      "body": "Sorry. Bingeing sucks but it’s your body’s survival technique. I think all anorexics have binged.",
      "created_utc": 1578257338.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fdbh6wt",
      "author": "None",
      "body": "I ate two jars of Biscoff, a jar of chocolate spread and a jar of peanut butter every week for four months straight. I got sick of it eventually and now eat normal portions of every food I want AND my weight's stabilised.\n\nEverybody's recover is different, trust your body.",
      "created_utc": 1578257368.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdbzfo3",
      "author": "None",
      "body": "Binging is normal as an anorexic, I have a few friends who had anorexia and they told me they’ve all binged and quite a lot too.\n\nYou are not greedy or disgusting or a pig. Your body doesn’t trust you yet as it is still in starvation mode and clearly you don’t trust your body, which results in binging. \n\nIf you wanna stop binging and start eating “normally” (what even is normal eating anyways?), it starts with using kinder words to yourself. I know they seem cheesy but positive affirmations WORK. Tell yourself, “I am not a greedy disgusting pig, I am an amazing lovely human being”. Seriously",
      "created_utc": 1578264262.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdbtg8i",
      "author": "None",
      "body": "I have never related so much!! But from what I’ve learned so far, it’s pretty normal but it’s so annoying and scary :/",
      "created_utc": 1578261782.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fddhkvd",
      "author": "auamethyst",
      "body": "It IS normal. Some people do it, some don’t, but either way is still normal.\n\nYour body is finally like HOLY SHIT THERE IS FOOD AROUND I MIGHT LIVE so of course you want to eat everything not nailed down. \n\nThe binging should start to calm down once you get more nutritionally balanced.",
      "created_utc": 1578312592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fdbvhde",
      "author": "None",
      "body": "This was the biggest eye opener in my anorexia and is something I struggle to communicate to my friends and family who support me. That I have anorexia and that I also binge eat. But I am not a binge eater.. the binging is a direct primal response to the anorexia.",
      "created_utc": 1578262615.0,
      "score": 24,
      "context": [
        {
          "id": "fdbbtn5",
          "author": "wanderlustcub",
          "body": "Hello. \n\nI think you have been misled. \n\nBinging is a part of anorexia.  when you starve yourself, your body is built to binge when food is available, there is no getting around that. Part of the mental trauma is that our bodies are doing what our minds don't want it to do. \n\n. I have not met an anorexic person who hasn't binged. \n\nYou are not a failure, you are doing something that is absolutely normal for the situation you are currently in. I will repeat, you are not a failure.",
          "created_utc": 1578255855.0
        }
      ]
    },
    {
      "id": "fdd974b",
      "author": "drywit_",
      "body": "I am anorexic, and I have never binged...",
      "created_utc": 1578300652.0,
      "score": 0,
      "context": [
        {
          "id": "fdbbtn5",
          "author": "wanderlustcub",
          "body": "Hello. \n\nI think you have been misled. \n\nBinging is a part of anorexia.  when you starve yourself, your body is built to binge when food is available, there is no getting around that. Part of the mental trauma is that our bodies are doing what our minds don't want it to do. \n\n. I have not met an anorexic person who hasn't binged. \n\nYou are not a failure, you are doing something that is absolutely normal for the situation you are currently in. I will repeat, you are not a failure.",
          "created_utc": 1578255855.0
        }
      ]
    }
  ]
}