{
  "id": "ept8zx",
  "subreddit": "fuckeatingdisorders",
  "author": "lothar42",
  "created_utc": 1579224707.0,
  "title": "That feeling of being a special unicorn - does anyone else struggle with it?",
  "selftext": "Everyone says that I should follow my hunger, that in my situation it is only normal to want to eat a lot of food and I should just do it because it won't last forever. But I am a special unicorn, therefore it will last forever.\n\nEveryone says that I will gain weight and then stabilize around my pre-ED weight, which was a very healthy weight. But I am a special unicorn, therefore I will just keep gaining and gaining to infinite obesity.\n\nEveryone says that my binges are mainly due to restriction. But I am a special unicorn, therefore my binges are totally unrelated to my restriction and restricting is a perfectly reasonable behaviour to compensate binges.\n\nEveryone says I should let go. But I am a special unicorn, therefore I should not let go because this and this will happen if I do it.\n\nEveryone says he/she has had the same experiences as me. But I am a special unicorn, therefore it can't be true.\n\nEveryone says you can have an eating disorder at any weight, you can eat unrestrictedly at any weight, being at a minimally healthy BMI doesn't mean you're fully recovered, and so on. But I am a special unicorn, therefore I can only be allowed to eat if I am super-ultra-underweight.\n\nEveryone says I will feel better mentally and physically once I will be at a healthier weight, and it won't be as shitty as I imagine it now. But I am a special unicorn, therefore this won't happen to me.\n\nEveryone says it won't just go away on its own and at some point I'll have to actively challenge it by doing scary things that I don't really want to do, and not just for one day but consistently over and over again until they are not scary anymore. But I am a special unicorn, therefore I can just sit here and wait for it to go away while I keep wasting my life with this stupid illness and not trying to change anything.\n\nNothing is valid for me. No scientific study, no previous lived experience, no medical advice, no suggestions from friends or family applies to my condition. I am different. I am a special unicorn.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ept8zx/that_feeling_of_being_a_special_unicorn_does/",
  "score": 86,
  "num_comments": 12,
  "comments": [
    {
      "id": "fem5y5g",
      "author": "someone52207",
      "body": "You might be calling yourself out, but I feel like you're actually mocking me.",
      "created_utc": 1579240921.0,
      "score": 26,
      "context": []
    },
    {
      "id": "femfgmo",
      "author": "None",
      "body": "how dare you break into my house, read my diary, and post its contents online?",
      "created_utc": 1579252734.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fem63vk",
      "author": "gin_in_teacups",
      "body": "Spot on. ED and anxiety is not a good combination.",
      "created_utc": 1579241080.0,
      "score": 10,
      "context": []
    },
    {
      "id": "femno4g",
      "author": "None",
      "body": "i obviously don't know every single person that's ever had an ed, but i can say with a great level of confidence that the overwhelming majority (i'm talking 99.999999%) of people with eds feel the exact same way. \n\n&#x200B;\n\nit sounds harsh to say it like that, but you (and by you i mean the general \"you,\" everyone with an ed) are not special. just the fact that you experience this exact symptom is proof that there are no special unicorns, because \\*everyone\\* feels like this.\n\n&#x200B;\n\nrecovery is a leap of faith in a lot of ways. you go from not trusting yourself at all to trying to trust your body and let \\*it\\* leads instead of the ed taking the reins, that is no easy feat. but it'll always be the better choice.",
      "created_utc": 1579263898.0,
      "score": 9,
      "context": []
    },
    {
      "id": "femf640",
      "author": "blacklabcoat",
      "body": "This actually stings.\n\nAlso: I have educated myself and can advise anyone about healthy vs disordered eating habits, but I'm a special unicorn and none of it applies to me.",
      "created_utc": 1579252298.0,
      "score": 8,
      "context": []
    },
    {
      "id": "femc8yu",
      "author": "krikein",
      "body": "wow I feel attacked",
      "created_utc": 1579248229.0,
      "score": 5,
      "context": []
    },
    {
      "id": "femg2vf",
      "author": "wheelsonthebusyeah",
      "body": "Honestly, if I can stablise at my preED weight I'll be extremely thankful. Now I'm either that or up 20 pounds every cycle.",
      "created_utc": 1579253662.0,
      "score": 3,
      "context": []
    },
    {
      "id": "feohklu",
      "author": "MoosieGoose",
      "body": "This happens with many, many things.\n\nIt is a very toxic thought pattern, and if anything, is very privileged. That's what gets me out of that thought pattern most of the time. IMHO it seems gross and arrogant of myself to assume that my problem is so different, somehow more complex or somehow more permanent that the problems of any other human. \n\nThere are billions of humans on earth, it simply doesn't make sense that I would be \"the one special unicorn\" with all these untouchable problems. Maybe it's just more shame, but shame of thinking that I'm special and not listening to people who have also struggled the same ways I have.",
      "created_utc": 1579300287.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fen2d53",
      "author": "Flesh-And-Bone",
      "body": ">But I am a special unicorn, therefore it will last forever.\n\n>But I am a special unicorn, therefore I will just keep gaining and gaining to infinite obesity.\n\n>But I am a special unicorn, therefore my binges are totally unrelated to my restriction and restricting is a perfectly reasonable behaviour to compensate binges.\n\nBIG FEELS",
      "created_utc": 1579275429.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fen6e1m",
      "author": "Zdena_Rose",
      "body": "I relate to everything on this post",
      "created_utc": 1579277976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fendcvr",
      "author": "None",
      "body": "Wow, I feel attacked lol. There wasn’t one word I disagreed with!",
      "created_utc": 1579282267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fes4n00",
      "author": "Itotsight",
      "body": "But i'm the special unicorn",
      "created_utc": 1579361391.0,
      "score": 1,
      "context": []
    }
  ]
}