{
  "id": "ermrmg",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1579567546.0,
  "title": "What are your most ridiculous examples of \"ED logic\"?",
  "selftext": "I think sharing them or even just writing them down might be helpful not only in trivializing and making fun of them, but also deconstructing them and devoiding them of power by exposing their utter meaninglessness.\n\nSo here are some of mine:\n\nHaving dinner at 8.30PM is okay. Having dinner at 8PM is crazy.\n\nOne large course is okay. Several smaller ones are forbidden, even if they add up to a lower amount of calories.\n\nIt's hard to go from lunch to dinner without eating anything. It's (relatively) easy to go from dinner to bedtime without eating anything even if the interval is just as long.\n\nI can stuff my face with the most random food ever during a binge. But GOD FORBID I even touch a single drop of regular soda or full fat milk. That would be insane.\n\nRice is okay. Sometimes. Pasta is scary. \n\nOil added raw is just a no no. Unseasoned veggies are fine, but if they are dressed with a drizzle of oil? I'd rather have a burger please.\n\nBread is okay. Rice crackers are not okay.\n\nHam alone is not allowed. Ham with bread is okay.\n\nPotatoes are never ever allowed in any shape, size or recipe. Even cheese is better. Even if it's higher calorie.\n\nEggs are fine when put into something else, like rice or a salad. Eggs alone are forbidden.\n\nPeppers and tomatoes are lovely. Carrots are risky and must be consumed with care.\n\nBeans are only okay if I can eat a whole can. Same goes for pizza, which is only okay if I can eat a whole one.\n\nCookies are fine when put into yogurt. I must never have them with milk.\n\nBread with things is okay (sort of). Bread alone is problematic.\n\nApples must be cut in 8 slices. Oranges should be peeled with perfect technique; if any inner slice is cut in the process the whole fruit must be thrown in the garbage.\n\nAnd those are just the very first ones that come off the top of my head right now. I could go on for literal ages. Of course there's an explanation for each and every one of them - a shitty, ED-driven, maybe food-scarcity-related explanation, but an explanation nonetheless.\n\n(note: when I say \"okay\", I generally mean \"I can eat this food more than once a month without being completely overwhelmed with utter desperate terror)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ermrmg/what_are_your_most_ridiculous_examples_of_ed_logic/",
  "score": 119,
  "num_comments": 81,
  "comments": [
    {
      "id": "ff4poit",
      "author": "ri-ri",
      "body": "Fruit and veggies are my best friends. But avocados are a huge fear food and they’re not ok for me. \n\nBreakfast is the devils meal. Never eat breakfast or the day is ruined. \n\nSugar is never ok. Cookies, donuts and cake are never ok. Unless binging. \n\nAlcohol is terrifying and adds calories. But so much fun.",
      "created_utc": 1579569439.0,
      "score": 75,
      "context": []
    },
    {
      "id": "ff4s9ew",
      "author": "None",
      "body": "1. If I feel hungry, I should have a glass of water first, and then wait at least 25 minutes. I must then drink a glass of coconut water with added potassium chloride to ensure that I am *actually* hungry and that it's not just my electrolyte levels being out of whack. After having a glass of coconut water, I must wait another 25 minutes and have a cup of coffee lest my body is tricking me.\n2. Idle hands are the devil's workshop, and so I must *only* eat if and when I have done my chores which include, but are not limited to, administering palliative care to my father. Of course, there's always something to do, so all meals - except dinner - must be postponed indefinitely.\n3. If I don't eat dinner at 9 PM on the dot, I might as well not have any, even if it's only ten past nine.\n4. If I binge/eat reactively, I can have *anything* but must wash it down with zero-calorie soda.\n5. Hot sauce is the only acceptable dressing for anything ever.\n6. I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n7. My oatmeal must be the perfect, creamy consistency. If it is not, it will be unceremoniously tossed into the bin.\n8. Scrambled eggs are allowed, but a single boiled egg is not.\n9. Chicken breast is the only acceptable protein source. It must be seasoned and grilled to perfection and served on a bed of spinach and roasted cherry tomatoes lest I do not consume enough iron and potassium.\n10. Sniffing peanut butter is just as good as eating it.",
      "created_utc": 1579571212.0,
      "score": 47,
      "context": []
    },
    {
      "id": "ff4vgog",
      "author": "standsure",
      "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
      "created_utc": 1579573406.0,
      "score": 30,
      "context": []
    },
    {
      "id": "ff4sm7w",
      "author": "Laprasrides",
      "body": "My boss mentioned he tried intermittent fasting once while I was at work that means nobody is eating regular meals and I should be fasting like everyone else\n\nAn old one for me was “you cannot drink any calories at all UNLESS it’s vodka vodka calories don’t count”",
      "created_utc": 1579571462.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ff4wduq",
      "author": "mermaidmagick",
      "body": "I refused to eat round foods- bagels, pizza, cookies, etc.\n\nSour patch kids and sprite had no calories and were a free food. \n\nIf no one sees me eat it, it doesn’t count.",
      "created_utc": 1579574043.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ff4p9iv",
      "author": "whoatherecourt",
      "body": "Lol love this. \n\nMy biggest one: never add sugar to anything. (Duh!) Instead, mash up a banana and use it as sweetener. But it must be the smallest banana you can find. And make sure to go through the entire banana shelf (?) at the supermarket to look for the bunch with the smallest ones. And once you use that one banana you are done for the day. \n\nTldr: one tiny baby banana is ok. More than one banana is a fear food.",
      "created_utc": 1579569153.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ff4vjyf",
      "author": "illygreen",
      "body": "Press everything before you eat it for oil.\n\nUse mustard over ketchup in all circumstances.\n\nPeanut butter on an apple slides. Peanut butter on a slice of bread for the same nutritional value is a binge food.\n\nDiet soda even when binging. It's a matter of habit.",
      "created_utc": 1579573470.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ff51mf0",
      "author": "TheShortGerman",
      "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
      "created_utc": 1579577784.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ff4ptf4",
      "author": "Upfish-Sinclair",
      "body": "At this point in my recovery I can eat most forms of potato and not have a panic attack. Baked, mashed, sometimes even hash browns. But not fries or potato chips. I can even eat chips that have more or less the same calories but aren’t potato based but obviously eating a single potato chip would instantly kill me.",
      "created_utc": 1579569532.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ff50s9b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1579577160.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ff59tm8",
      "author": "annielovesbacon",
      "body": "Egg yolks are the devil because of the fat but dark chocolate is fine. \n\nIf I’m eating with a group of people, i can’t finish first (either they think I’m a pig for eating so fast, or they realize I didn’t have very much to eat) but i also can’t finish last (everyone will look at me, or they might think I had way more food and that’s why it took longer for me to eat). \n\nBUT I take forever to eat anyway because I have to cut my food up into tiny pieces (somehow less calories??) and eat each food in a rotating order (eg one bite of green beans, then one bite of chicken, then one bite of rice, then green beans again etc etc). \n\nAny fruits that have tiny seeds in them (like strawberries, raspberries, etc) must be avoided.",
      "created_utc": 1579584594.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ff5ayc3",
      "author": "devon_price",
      "body": "It doesn't count as eating a cookie if you break every cookie in the package into tiny bits and eat dozens of those bits while hunched over the counter in the dark.\n\nIf I don't walk five miles a day, even when I'm sick, my body will be unrecognizable by morning.\n\nIf I'm bloated, constipated, or gassy, I am not allowed to eat again until the issue magically resolves itself and my stomach flattens back down. \n\nCereal is low calorie and has vitamins so you can binge a whole box and it's doesn't count. \n\nPizza is not acceptable but an entire box of breadsticks might be okay. \n\nMelted ice cream is okay but frozen ice cream is a ridiculous decadence. \n\nIf the only cooking oil you used was a thousand sprays of Pam, it's almost like you didn't use any oil at all.\n\nCalories ingested while currently exercising are okay. \n\nEat the least appetizing thing available first, until it is gone. That's the only way to trust you're actually eating because you're hungry and not bored or greedy.\n\nIf you have anything that's theoretically edible still in the house, you can't shop for groceries.\n\nIf you can fall asleep immediately after a binge it's like it never happened.",
      "created_utc": 1579585678.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ff4z6on",
      "author": "bingumarmar",
      "body": "I'm the same with pizza! If I eat a pizza, it's the whole one. \n\nIf I dont work out, I cant eat food. \n\nBreakfast is bad. If you eat breakfast, no lunch!\n\nI look down on/get upset with coworkers who order food for lunch at work. All I think about is how many calories it is.\n\nGoing off of that. I cant believe other people dont count calories. I cant imagine just eating food throughout the day and not worrying about it. \n\nCertain foods I will never eat. Bagels, butter as a toping, milk (only drink almond), olives, and more because the calorie content is so high for what you get.",
      "created_utc": 1579575988.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ff4xw7w",
      "author": "theHBIC",
      "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
      "created_utc": 1579575087.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ff4zamn",
      "author": "None",
      "body": "It's not okay to eat normal meals like breakfast and lunch. But it is okay to eat handfuls of snacks throughout the day even if I end up having more calories than I would eating a normal meal.\n\nProtein is not needed in my diet at all, why even waste calories on it.\n\nCarrots have 30 calories a piece no matter how big they are and I should eat one everytime I'm hungry no matter if something else sounds better.\n\nFruit is too many calories and too sugary but sucking on caramels throughout the day is A-OK!\n\nCalorie counts listed on the package are always true and never a lie I dont use a food scale and I wont listen to you telling me I'm eating more calories than I want to\n\nFood is optional throughout the day but my nightly vodka? That is necessary and calorie free",
      "created_utc": 1579576067.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ff55483",
      "author": "None",
      "body": "Refuse to ever give up almond milk in my oatmeal (even though I’ve made it with water and it tastes basically the same) but I will NEVER put almond milk/creamer in my coffee, no matter how bad it tastes\n\nIf I’m eating from a bag of chips/pretzels/any crunchy snack I can only have the crumbs at the bottom. I can’t have any whole pieces. \n\nAlways have to split packages up into more servings than it says on the label– Halo Top says 4 servings per container? I’m making sure it lasts 5 different days, minimum\n\nI do a few more that have already been mentioned, this was oddly satisfying to think about and write down. Didn’t even realize I did some of it.",
      "created_utc": 1579580495.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ff5kicj",
      "author": "None",
      "body": "1. Sandwiches are scary. But you can eat a couple slices of bread and sandwich filling separately. \n\n2. Don’t drink liquid calories. Unless it’s diet pop. \n\n3. Order only a small size. Only order large if you want to be large. \n\n4. Cereal bars make you fat. Unless you eat them as a meal, then they make you skinny. \n\n5. Foods containing lots of sugar and oil are bad. Unless they don’t taste nice, then they’re okay (so you won’t binge)\n\nEdit: 6. Just thought of another. Honestly there’s so many I forget half of them until they crop up. Always round up calories consumed and round down exercise calories burned.",
      "created_utc": 1579597251.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ff51sun",
      "author": "accordingtothelizard",
      "body": "No lettuce. Ever. Which you’d think would be the absolute opposite?",
      "created_utc": 1579577917.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ff5v8es",
      "author": "tiredanddisappointed",
      "body": "A whole can of tuna is never EVER permitted, give at least 1/3 to the cats \n\nIve been in recovery for a while yet this is the thing i still cant shake",
      "created_utc": 1579611413.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ff534hf",
      "author": "Spectrachic311311",
      "body": "Raw carrots are okay but cooked ones aren’t. Canned soup is fine if it’s less than 80 calories a serving but not fine if it’s 90.",
      "created_utc": 1579578928.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff53jbc",
      "author": "voDKaskoala2213",
      "body": "-I can drink anything I want. Eating half a Twinkie? Forbidden. Even if I drink a whole 2 liter of mountain dew. \n-chicken and rice? No. Meatloaf? Yeah.",
      "created_utc": 1579579244.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ff4px2l",
      "author": "fabioscrt",
      "body": "Haha I love this because I can relate to so many!",
      "created_utc": 1579569602.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff5fiz6",
      "author": "Skeletronz",
      "body": "If I can touch my pinky to my thumb around my left wrist I am ok \nRight wrist doesn’t count because my left hand is smaller",
      "created_utc": 1579590642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff5kq5c",
      "author": "TheDisappearingAct00",
      "body": "Drinking calories is never allowed unless you count it as a meal.",
      "created_utc": 1579597562.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff5kuzh",
      "author": "alanshorething",
      "body": "Bread with things is okay and bread alone is problematic? \n\nLMAO, it's the opposite for me.\n\nJust goes to show how wild ED logic is...",
      "created_utc": 1579597757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ff54pqw",
      "author": "Anaxiety1762",
      "body": "Drinking laxatives before workout then post workout and drinking water makes binging food bearable",
      "created_utc": 1579580171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff5m62a",
      "author": "None",
      "body": "Eating at the restaurant with someone else is scary. Eating at my desk, in the open space, is totally OK.",
      "created_utc": 1579599750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff63tdq",
      "author": "a_coco",
      "body": "Buying sweets or chocolate is a no-no, but eating sweets or chocolate that have fallen out of a busted open pack in the shop is just fine, even if they are on the ground..",
      "created_utc": 1579618436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff677ou",
      "author": "ohnobre",
      "body": "a small teaspoon of pb is okay but actual peanuts are an absolute no \n\ni am allowed to slightly go over my calories if the food i’m eating is high in protein but for no other reason \n\nnobody can touch my food \n\nif anyone comments on food around me even if it isn’t directed towards me i will stop eating \n\npasta, white potato, white rice, bagels and buns are all not safe \n but sweet potato, butternut squash, quinoa, and thin sliced bread are safe \n\nprotein needs to be a higher percentage than fat in my intake and carbs aren’t a big deal \n\ni could and have eaten more and increase my intake in attempts to get better, but only if i track my calories. if i try to stop tracking i will lose my mind and have a breakdown or just wont eat \n\ni’m terrified of being hungry",
      "created_utc": 1579620774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff687zz",
      "author": "fionahb",
      "body": "Too much variety is BAD!! If I’ve used ketchup on one thing then I can’t have mustard for something else because, you know, that’s WAY too greedy and indulgent - who knows where it may lead?? Lol\nAll foods that promote pooping are good (psyllium husk, bran, prunes) and can be eaten (relatively) freely whether you like them or not. You eat them for their ultimate outcome, not the taste!\nSoup must be constantly heated up which has 2 benefits - it means I eat it slower so it lasts longer plus I get in a bit of movement by getting up and going to the microwave.",
      "created_utc": 1579621443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6c114",
      "author": "throwawayitalltoday",
      "body": "Sugar free hard candies are the ultimate safe food. Even more safe when they come from dollar general. This one annoys me the most honestly because I know how illogical it is, like I can’t even reason why this is a rule but it fucking is! \n\nGrains are not allowed, unless it’s corn and especially if it’s Mexican street corn then it has no calories. \n\nFood consumed in the kitchen while cooking a “real” meal don’t count as calories either. \n\nNo carbonation ever. No liquid calories ever. No bread like things ever. \n\nIf I couldn’t reasonably make it at home I can’t eat it. \n\nUsing sauces over 10cals for 2T is forbidden.",
      "created_utc": 1579623900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6cvaw",
      "author": "carolinapenguin",
      "body": "Drinking calories is okay, but only if they're \"healthy\": that means smoothies and natural juices are ok but not regular coke or Pepsi or wtv.\n\nIt doesn't matter how many calories something is, if it has protein it's healthy and I can eat as much as I want.\n\nVeggies are all good, except potatoes. Those are the devil for some reason.\n\nI can eat more if I exercise, but the net calories need to be below 1000 otherwise I feel like a failure.\n\nAnd that's just to name a few.",
      "created_utc": 1579624432.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6gb1c",
      "author": "kgibson1211",
      "body": "I relate to far too many of these! Clearly I am not as bonkers as I feared :) \n\nAt restaurants, and only at restaurants, my food “bites” must be a prime number. The more naughty the food the lower the prime number. Something like French fries will be 2, 3, 5, or at the very most 7. But a salad would be 11, 13, 17...up to 31 but NEVER over 31 and NEVER a non-prime number....Clearly no logic but my brain is okay with eating but only in prime. Weird AF",
      "created_utc": 1579626572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6hzlm",
      "author": "_-_-AA_-_",
      "body": "nutella? okay\n\nsugar in drinks? nuts? i feel like the worst human on earth.\n\nso watch me eat nutella on toast but i’ll refuse to drink a glass of milk because it has calories.",
      "created_utc": 1579627610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6lkdf",
      "author": "finsandfangs",
      "body": "Irn Bru doesn't count, but every single jelly bean must be",
      "created_utc": 1579629785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6rqfq",
      "author": "fishonthesun",
      "body": "I can eat 1 small dessert with dinner if I didnt eat anything else all day. If I eat anything else throughout the day (even if only a single baby carrot!!!) I cannot.\n\nBread is only allowed as a sandwich but only if there is nothing else I want to eat. (Almost never)\n\nNever ever cheese unless its mac n cheese and that mac n cheese is the only thing i will eat that day.\n\nCookies are okay!! If I will be under 1000 for the day. If the amount I eat (3 at once always bc of OCD) puts me over 1000 I cannot have even one\n\nCant eat before 5pm unless I will pass out at work (this is only so I do not draw attention to myself)",
      "created_utc": 1579633499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6unrt",
      "author": "rutsuma",
      "body": "- bananas are never okay, even if you binge\n\n- so are pork, cheese and sugary drinks\n\n- you are not allowed to have breakfast unless its over 12 hours since your last meal yesterday\n\n- there must be at least 4 hour interval between meals or your a pig\n\n- oats are a waste of time and will only make you hungrier, so no-no\n\n- if you eat a ch*c*late bar, even if its calculated, you cant have it all or youre fatty \n\n- when binge-baking, using real sugar and fat milk is still too much\n\n- never consume anything over 170 kcal/100 g",
      "created_utc": 1579635236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff6yimf",
      "author": "KashimaYatsuto",
      "body": "If it’s over 200cal it’s coming back up.",
      "created_utc": 1579637510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff7y6qr",
      "author": "theHBIC",
      "body": "Also: Mac and cheese must never. stay. down. It’s my favorite food and I don’t know how it got so fucked up in my head but it’s a major compulsion. My animal brain goes MUST PURGE once it passes my lips.",
      "created_utc": 1579661169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff95bm2",
      "author": "None",
      "body": "I have lots, but my dumbest one is probably that I have to recover mentally and THEN I can recovery physically (weight gain). But apparently you can’t recover mentally until you recover physically. So I’m trying to recover mentally and later I’ll recover physically, but I can’t recover mentally without recovering physically. Brilliant logic.",
      "created_utc": 1579705199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffh1iud",
      "author": "auamethyst",
      "body": "You can eat fatty foods (pastries, mayonnaise, cake). You can’t eat large portions of food (even if it’s healthy food, like vegetables or salad)",
      "created_utc": 1579920609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fi6bjif",
      "author": "erasershavingz",
      "body": "I was going on a sleepover with my friends, and one of them put a LOAD of sweets into the basket that I was carrying. I nearly dropped it because my stupid dumb ED brain thought I could absorb the calories through my skin",
      "created_utc": 1582186811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff66mr9",
      "author": "raindropslikebullets",
      "body": "Breakfast is most definitely the devil’s meal, and it’s almost as if I’ve trained my body like pavlov’s dog. I get extremely nauseated when I eat too early.",
      "created_utc": 1579620391.0,
      "score": 12,
      "context": [
        {
          "id": "ff4poit",
          "author": "ri-ri",
          "body": "Fruit and veggies are my best friends. But avocados are a huge fear food and they’re not ok for me. \n\nBreakfast is the devils meal. Never eat breakfast or the day is ruined. \n\nSugar is never ok. Cookies, donuts and cake are never ok. Unless binging. \n\nAlcohol is terrifying and adds calories. But so much fun.",
          "created_utc": 1579569439.0
        }
      ]
    },
    {
      "id": "ff5mxm0",
      "author": "internerderner2",
      "body": ">I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n\nCripps Pink. Other apples do not even *exist*.",
      "created_utc": 1579600936.0,
      "score": 13,
      "context": [
        {
          "id": "ff4s9ew",
          "author": "None",
          "body": "1. If I feel hungry, I should have a glass of water first, and then wait at least 25 minutes. I must then drink a glass of coconut water with added potassium chloride to ensure that I am *actually* hungry and that it's not just my electrolyte levels being out of whack. After having a glass of coconut water, I must wait another 25 minutes and have a cup of coffee lest my body is tricking me.\n2. Idle hands are the devil's workshop, and so I must *only* eat if and when I have done my chores which include, but are not limited to, administering palliative care to my father. Of course, there's always something to do, so all meals - except dinner - must be postponed indefinitely.\n3. If I don't eat dinner at 9 PM on the dot, I might as well not have any, even if it's only ten past nine.\n4. If I binge/eat reactively, I can have *anything* but must wash it down with zero-calorie soda.\n5. Hot sauce is the only acceptable dressing for anything ever.\n6. I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n7. My oatmeal must be the perfect, creamy consistency. If it is not, it will be unceremoniously tossed into the bin.\n8. Scrambled eggs are allowed, but a single boiled egg is not.\n9. Chicken breast is the only acceptable protein source. It must be seasoned and grilled to perfection and served on a bed of spinach and roasted cherry tomatoes lest I do not consume enough iron and potassium.\n10. Sniffing peanut butter is just as good as eating it.",
          "created_utc": 1579571212.0
        }
      ]
    },
    {
      "id": "ff6c00s",
      "author": "None",
      "body": "the oatmeal one is so relatable lmao",
      "created_utc": 1579623882.0,
      "score": 2,
      "context": [
        {
          "id": "ff4s9ew",
          "author": "None",
          "body": "1. If I feel hungry, I should have a glass of water first, and then wait at least 25 minutes. I must then drink a glass of coconut water with added potassium chloride to ensure that I am *actually* hungry and that it's not just my electrolyte levels being out of whack. After having a glass of coconut water, I must wait another 25 minutes and have a cup of coffee lest my body is tricking me.\n2. Idle hands are the devil's workshop, and so I must *only* eat if and when I have done my chores which include, but are not limited to, administering palliative care to my father. Of course, there's always something to do, so all meals - except dinner - must be postponed indefinitely.\n3. If I don't eat dinner at 9 PM on the dot, I might as well not have any, even if it's only ten past nine.\n4. If I binge/eat reactively, I can have *anything* but must wash it down with zero-calorie soda.\n5. Hot sauce is the only acceptable dressing for anything ever.\n6. I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n7. My oatmeal must be the perfect, creamy consistency. If it is not, it will be unceremoniously tossed into the bin.\n8. Scrambled eggs are allowed, but a single boiled egg is not.\n9. Chicken breast is the only acceptable protein source. It must be seasoned and grilled to perfection and served on a bed of spinach and roasted cherry tomatoes lest I do not consume enough iron and potassium.\n10. Sniffing peanut butter is just as good as eating it.",
          "created_utc": 1579571212.0
        }
      ]
    },
    {
      "id": "ffh1oyt",
      "author": "auamethyst",
      "body": "I get the oatmeal thing. Often if the texture of food wasn’t exactly suitable to me, I wouldn’t eat it.",
      "created_utc": 1579920734.0,
      "score": 1,
      "context": [
        {
          "id": "ff4s9ew",
          "author": "None",
          "body": "1. If I feel hungry, I should have a glass of water first, and then wait at least 25 minutes. I must then drink a glass of coconut water with added potassium chloride to ensure that I am *actually* hungry and that it's not just my electrolyte levels being out of whack. After having a glass of coconut water, I must wait another 25 minutes and have a cup of coffee lest my body is tricking me.\n2. Idle hands are the devil's workshop, and so I must *only* eat if and when I have done my chores which include, but are not limited to, administering palliative care to my father. Of course, there's always something to do, so all meals - except dinner - must be postponed indefinitely.\n3. If I don't eat dinner at 9 PM on the dot, I might as well not have any, even if it's only ten past nine.\n4. If I binge/eat reactively, I can have *anything* but must wash it down with zero-calorie soda.\n5. Hot sauce is the only acceptable dressing for anything ever.\n6. I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n7. My oatmeal must be the perfect, creamy consistency. If it is not, it will be unceremoniously tossed into the bin.\n8. Scrambled eggs are allowed, but a single boiled egg is not.\n9. Chicken breast is the only acceptable protein source. It must be seasoned and grilled to perfection and served on a bed of spinach and roasted cherry tomatoes lest I do not consume enough iron and potassium.\n10. Sniffing peanut butter is just as good as eating it.",
          "created_utc": 1579571212.0
        }
      ]
    },
    {
      "id": "ff54v0c",
      "author": "miserylovescomputers",
      "body": "It’s so interesting how a lot of our ED brains are similar in some ways but opposite in others. I was nodding along to your whole post in complete agreement until your last point, because in my mind only thin people can have short hair, and that’s why I’m not allowed to cut my hair that’s 3/4 of the way down my back, enough though I hate it.",
      "created_utc": 1579580292.0,
      "score": 20,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        }
      ]
    },
    {
      "id": "ff5kpap",
      "author": "None",
      "body": "I agree with the scale thing. I’d move mine around the bathroom, recalibrate it, and weigh myself like 50 times. I’d secretly look for the lowest number but log the highest number",
      "created_utc": 1579597529.0,
      "score": 5,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        }
      ]
    },
    {
      "id": "ff51v5e",
      "author": "accordingtothelizard",
      "body": "SAME",
      "created_utc": 1579577963.0,
      "score": 7,
      "context": [
        {
          "id": "ff4sm7w",
          "author": "Laprasrides",
          "body": "My boss mentioned he tried intermittent fasting once while I was at work that means nobody is eating regular meals and I should be fasting like everyone else\n\nAn old one for me was “you cannot drink any calories at all UNLESS it’s vodka vodka calories don’t count”",
          "created_utc": 1579571462.0
        }
      ]
    },
    {
      "id": "ff7ku20",
      "author": "Numbskull79",
      "body": "Might I add if I throw it up it doesn't count.",
      "created_utc": 1579651935.0,
      "score": 2,
      "context": [
        {
          "id": "ff4wduq",
          "author": "mermaidmagick",
          "body": "I refused to eat round foods- bagels, pizza, cookies, etc.\n\nSour patch kids and sprite had no calories and were a free food. \n\nIf no one sees me eat it, it doesn’t count.",
          "created_utc": 1579574043.0
        }
      ]
    },
    {
      "id": "ff5ctsv",
      "author": "taystorm",
      "body": "this just reminded me of when i saw the biggest bananas today. i live with my sister and she got bananas and they are literally twice the length of the bananas i would pick out... i was like wow those would probably be delicious, but it would scare me very much to eat a whole one of those. i used to not let myself eat bananas at all, so sticking to small ones is progress",
      "created_utc": 1579587607.0,
      "score": 9,
      "context": [
        {
          "id": "ff4p9iv",
          "author": "whoatherecourt",
          "body": "Lol love this. \n\nMy biggest one: never add sugar to anything. (Duh!) Instead, mash up a banana and use it as sweetener. But it must be the smallest banana you can find. And make sure to go through the entire banana shelf (?) at the supermarket to look for the bunch with the smallest ones. And once you use that one banana you are done for the day. \n\nTldr: one tiny baby banana is ok. More than one banana is a fear food.",
          "created_utc": 1579569153.0
        }
      ]
    },
    {
      "id": "ff4zhur",
      "author": "None",
      "body": "God the pressing things for oil. When you're out at a restaurant and have to hide that you keep putting your roasted veggies into the napkin hidden in your lap before eating them...embarrassing stuff that I continue to di",
      "created_utc": 1579576213.0,
      "score": 9,
      "context": [
        {
          "id": "ff4vjyf",
          "author": "illygreen",
          "body": "Press everything before you eat it for oil.\n\nUse mustard over ketchup in all circumstances.\n\nPeanut butter on an apple slides. Peanut butter on a slice of bread for the same nutritional value is a binge food.\n\nDiet soda even when binging. It's a matter of habit.",
          "created_utc": 1579573470.0
        }
      ]
    },
    {
      "id": "ff62xr1",
      "author": "agriff1",
      "body": "I started drinking diet soda when I was 13 out of pre-ED type behavior and at this point I don't know if I \\*actually\\* like the taste of it better or if I've convinced myself for so long that it became true, but either way I'm ok with it",
      "created_utc": 1579617801.0,
      "score": 3,
      "context": [
        {
          "id": "ff4vjyf",
          "author": "illygreen",
          "body": "Press everything before you eat it for oil.\n\nUse mustard over ketchup in all circumstances.\n\nPeanut butter on an apple slides. Peanut butter on a slice of bread for the same nutritional value is a binge food.\n\nDiet soda even when binging. It's a matter of habit.",
          "created_utc": 1579573470.0
        }
      ]
    },
    {
      "id": "ff639vw",
      "author": "agriff1",
      "body": ">Behaviors  \n>  \n>make me feel skinny, not the specific weight\n\nThis is so real and also why I end up binging after restricting for a few weeks because \"I've earned it\". Bitch you're still way heavier than when you started your last binge!",
      "created_utc": 1579618048.0,
      "score": 7,
      "context": [
        {
          "id": "ff51mf0",
          "author": "TheShortGerman",
          "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
          "created_utc": 1579577784.0
        }
      ]
    },
    {
      "id": "ff73i1g",
      "author": "thegrimting",
      "body": "“BEHAVIORS MAKE ME FEEL SKINNY” :’) Thank u.. im smallest weight right now but still dont forgive myself for a binge last week & still mentally feel 20 pounds overweight",
      "created_utc": 1579640383.0,
      "score": 3,
      "context": [
        {
          "id": "ff51mf0",
          "author": "TheShortGerman",
          "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
          "created_utc": 1579577784.0
        }
      ]
    },
    {
      "id": "ff6ts6z",
      "author": "rhymeswithpanda1987",
      "body": "I relate so strongly to you.",
      "created_utc": 1579634722.0,
      "score": 2,
      "context": [
        {
          "id": "ff51mf0",
          "author": "TheShortGerman",
          "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
          "created_utc": 1579577784.0
        }
      ]
    },
    {
      "id": "ff5wgq6",
      "author": "Scolopendra12",
      "body": "> The best things in my life only happen because I've been restricting well.  The worst things in my life only happen because I'm a fat bitch that will never be skinny enough\n\nI felt that.",
      "created_utc": 1579612558.0,
      "score": 3,
      "context": [
        {
          "id": "ff50s9b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1579577160.0
        }
      ]
    },
    {
      "id": "ff5vyy7",
      "author": "unicorns-n-mermaids",
      "body": "I can’t eat bagels either! Went several years in a row without eating them and finally last year decided to save up my calories over several days to try one again since I feel like everyone eats them. I was like what’s all the hype about??? It was actually amazing but I still can’t get over the calorie density of it.....bread PLUS cream cheese AND likely in the morning? Nope too scared",
      "created_utc": 1579612101.0,
      "score": 5,
      "context": [
        {
          "id": "ff4z6on",
          "author": "bingumarmar",
          "body": "I'm the same with pizza! If I eat a pizza, it's the whole one. \n\nIf I dont work out, I cant eat food. \n\nBreakfast is bad. If you eat breakfast, no lunch!\n\nI look down on/get upset with coworkers who order food for lunch at work. All I think about is how many calories it is.\n\nGoing off of that. I cant believe other people dont count calories. I cant imagine just eating food throughout the day and not worrying about it. \n\nCertain foods I will never eat. Bagels, butter as a toping, milk (only drink almond), olives, and more because the calorie content is so high for what you get.",
          "created_utc": 1579575988.0
        }
      ]
    },
    {
      "id": "ff4ze3q",
      "author": "None",
      "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
      "created_utc": 1579576136.0,
      "score": 8,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        }
      ]
    },
    {
      "id": "ff5f7ol",
      "author": "mirandalsh",
      "body": "Oh the soda one is me. Especially since I read once that people will give you regular even if you order diet.",
      "created_utc": 1579590266.0,
      "score": 2,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        }
      ]
    },
    {
      "id": "ff4zm5r",
      "author": "None",
      "body": "Forgot a major one: I can be a size 0 and wear XS clothes and still be fat because I need to be 00 and XXS",
      "created_utc": 1579576301.0,
      "score": 8,
      "context": [
        {
          "id": "ff4zamn",
          "author": "None",
          "body": "It's not okay to eat normal meals like breakfast and lunch. But it is okay to eat handfuls of snacks throughout the day even if I end up having more calories than I would eating a normal meal.\n\nProtein is not needed in my diet at all, why even waste calories on it.\n\nCarrots have 30 calories a piece no matter how big they are and I should eat one everytime I'm hungry no matter if something else sounds better.\n\nFruit is too many calories and too sugary but sucking on caramels throughout the day is A-OK!\n\nCalorie counts listed on the package are always true and never a lie I dont use a food scale and I wont listen to you telling me I'm eating more calories than I want to\n\nFood is optional throughout the day but my nightly vodka? That is necessary and calorie free",
          "created_utc": 1579576067.0
        }
      ]
    },
    {
      "id": "ff641tf",
      "author": "MatsyPats",
      "body": "not eating the whole pieces but only eating the crumbs... I feel this so much. didn’t know anyone else did this too.",
      "created_utc": 1579618601.0,
      "score": 3,
      "context": [
        {
          "id": "ff55483",
          "author": "None",
          "body": "Refuse to ever give up almond milk in my oatmeal (even though I’ve made it with water and it tastes basically the same) but I will NEVER put almond milk/creamer in my coffee, no matter how bad it tastes\n\nIf I’m eating from a bag of chips/pretzels/any crunchy snack I can only have the crumbs at the bottom. I can’t have any whole pieces. \n\nAlways have to split packages up into more servings than it says on the label– Halo Top says 4 servings per container? I’m making sure it lasts 5 different days, minimum\n\nI do a few more that have already been mentioned, this was oddly satisfying to think about and write down. Didn’t even realize I did some of it.",
          "created_utc": 1579580495.0
        }
      ]
    },
    {
      "id": "ff60pe8",
      "author": "someone52207",
      "body": "I do/ did #1 with most things. Like combining foods so I can't taste them separately is a sin and should be avoided",
      "created_utc": 1579616127.0,
      "score": 3,
      "context": [
        {
          "id": "ff5kicj",
          "author": "None",
          "body": "1. Sandwiches are scary. But you can eat a couple slices of bread and sandwich filling separately. \n\n2. Don’t drink liquid calories. Unless it’s diet pop. \n\n3. Order only a small size. Only order large if you want to be large. \n\n4. Cereal bars make you fat. Unless you eat them as a meal, then they make you skinny. \n\n5. Foods containing lots of sugar and oil are bad. Unless they don’t taste nice, then they’re okay (so you won’t binge)\n\nEdit: 6. Just thought of another. Honestly there’s so many I forget half of them until they crop up. Always round up calories consumed and round down exercise calories burned.",
          "created_utc": 1579597251.0
        }
      ]
    },
    {
      "id": "ff72xm1",
      "author": "thegrimting",
      "body": "Dude same ! Trying to unlearn it",
      "created_utc": 1579640058.0,
      "score": 1,
      "context": [
        {
          "id": "ff4poit",
          "author": "ri-ri",
          "body": "Fruit and veggies are my best friends. But avocados are a huge fear food and they’re not ok for me. \n\nBreakfast is the devils meal. Never eat breakfast or the day is ruined. \n\nSugar is never ok. Cookies, donuts and cake are never ok. Unless binging. \n\nAlcohol is terrifying and adds calories. But so much fun.",
          "created_utc": 1579569439.0
        },
        {
          "id": "ff66mr9",
          "author": "raindropslikebullets",
          "body": "Breakfast is most definitely the devil’s meal, and it’s almost as if I’ve trained my body like pavlov’s dog. I get extremely nauseated when I eat too early.",
          "created_utc": 1579620391.0
        }
      ]
    },
    {
      "id": "ff5oaec",
      "author": "None",
      "body": "You, me. Same brain.",
      "created_utc": 1579602986.0,
      "score": 3,
      "context": [
        {
          "id": "ff4s9ew",
          "author": "None",
          "body": "1. If I feel hungry, I should have a glass of water first, and then wait at least 25 minutes. I must then drink a glass of coconut water with added potassium chloride to ensure that I am *actually* hungry and that it's not just my electrolyte levels being out of whack. After having a glass of coconut water, I must wait another 25 minutes and have a cup of coffee lest my body is tricking me.\n2. Idle hands are the devil's workshop, and so I must *only* eat if and when I have done my chores which include, but are not limited to, administering palliative care to my father. Of course, there's always something to do, so all meals - except dinner - must be postponed indefinitely.\n3. If I don't eat dinner at 9 PM on the dot, I might as well not have any, even if it's only ten past nine.\n4. If I binge/eat reactively, I can have *anything* but must wash it down with zero-calorie soda.\n5. Hot sauce is the only acceptable dressing for anything ever.\n6. I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n7. My oatmeal must be the perfect, creamy consistency. If it is not, it will be unceremoniously tossed into the bin.\n8. Scrambled eggs are allowed, but a single boiled egg is not.\n9. Chicken breast is the only acceptable protein source. It must be seasoned and grilled to perfection and served on a bed of spinach and roasted cherry tomatoes lest I do not consume enough iron and potassium.\n10. Sniffing peanut butter is just as good as eating it.",
          "created_utc": 1579571212.0
        },
        {
          "id": "ff5mxm0",
          "author": "internerderner2",
          "body": ">I can have two small apples, but not a large one. I will not waste my apple calories on inferior apples: only perfect Cox's Orange Pippin, Honeycrisp, or Kanzi specimens will do.\n\nCripps Pink. Other apples do not even *exist*.",
          "created_utc": 1579600936.0
        }
      ]
    },
    {
      "id": "ff56uxn",
      "author": "standsure",
      "body": "Oh honey. \n\nHugs in understanding.",
      "created_utc": 1579581927.0,
      "score": 8,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        },
        {
          "id": "ff54v0c",
          "author": "miserylovescomputers",
          "body": "It’s so interesting how a lot of our ED brains are similar in some ways but opposite in others. I was nodding along to your whole post in complete agreement until your last point, because in my mind only thin people can have short hair, and that’s why I’m not allowed to cut my hair that’s 3/4 of the way down my back, enough though I hate it.",
          "created_utc": 1579580292.0
        }
      ]
    },
    {
      "id": "ff66gbz",
      "author": "raindropslikebullets",
      "body": "It’s weird. I came to agree that only skinny ppl can have short hair, because I hold that rule for myself. I will never cut short again unless I have the perfect skinny face. \n\nBut sometimes I see it the other way around for other ppl. \n\n:( my ED just makes me feel like a judgmental asshole.",
      "created_utc": 1579620274.0,
      "score": 7,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        },
        {
          "id": "ff54v0c",
          "author": "miserylovescomputers",
          "body": "It’s so interesting how a lot of our ED brains are similar in some ways but opposite in others. I was nodding along to your whole post in complete agreement until your last point, because in my mind only thin people can have short hair, and that’s why I’m not allowed to cut my hair that’s 3/4 of the way down my back, enough though I hate it.",
          "created_utc": 1579580292.0
        }
      ]
    },
    {
      "id": "ff6t9hh",
      "author": "rhymeswithpanda1987",
      "body": "Agree. Long hair = hiding the fat on my face.\n\nShort hair = showing off how defined my jawline and cheekbones are.",
      "created_utc": 1579634418.0,
      "score": 5,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        },
        {
          "id": "ff54v0c",
          "author": "miserylovescomputers",
          "body": "It’s so interesting how a lot of our ED brains are similar in some ways but opposite in others. I was nodding along to your whole post in complete agreement until your last point, because in my mind only thin people can have short hair, and that’s why I’m not allowed to cut my hair that’s 3/4 of the way down my back, enough though I hate it.",
          "created_utc": 1579580292.0
        }
      ]
    },
    {
      "id": "ff5kx8n",
      "author": "standsure",
      "body": "Same. \n\nBefore and after toilet, with and without clothes.",
      "created_utc": 1579597850.0,
      "score": 5,
      "context": [
        {
          "id": "ff4vgog",
          "author": "standsure",
          "body": "All fruit is ok - as long as it's berries. \n\nSubterranean veggies convert *straight to sugar* and have no redeeming value. \n\nIf I recalculate imperial to metric *one more time* the numbers will change. \n\nMoving the scale around the bathroom to find a magic spot where it reads lowest is logical and based on deductive reasoning.  \n\nThere are no 'good' carbs. \n\nDrinking alcohol is a reasonable alternative to food. \n\nBingeing is made better with diet cola. Eat 18 donuts but heaven forfend I would drink a standard coke. \n\nThere is a dress size that will solve all my problems. If I reach that size the magic size immediately drops to the next lowest. \n\nFat people can't have long hair.",
          "created_utc": 1579573406.0
        },
        {
          "id": "ff5kpap",
          "author": "None",
          "body": "I agree with the scale thing. I’d move mine around the bathroom, recalibrate it, and weigh myself like 50 times. I’d secretly look for the lowest number but log the highest number",
          "created_utc": 1579597529.0
        }
      ]
    },
    {
      "id": "ff7wf1k",
      "author": "mermaidmagick",
      "body": "I used to chew/spit a lot and I factored in 10% of those calories which is so arbitrary.",
      "created_utc": 1579659965.0,
      "score": 2,
      "context": [
        {
          "id": "ff4wduq",
          "author": "mermaidmagick",
          "body": "I refused to eat round foods- bagels, pizza, cookies, etc.\n\nSour patch kids and sprite had no calories and were a free food. \n\nIf no one sees me eat it, it doesn’t count.",
          "created_utc": 1579574043.0
        },
        {
          "id": "ff7ku20",
          "author": "Numbskull79",
          "body": "Might I add if I throw it up it doesn't count.",
          "created_utc": 1579651935.0
        }
      ]
    },
    {
      "id": "ffgw4ab",
      "author": "whoatherecourt",
      "body": "Lol. I’m in ED treatment right now and during breakfasts when I have a hand fruit included in my meal I always pick a banana. And the ones they have at program are HUGE. Easily double the size of what I would get. It’s a struggle. It’s like the dietician knows that’s a fear food for me.",
      "created_utc": 1579916562.0,
      "score": 2,
      "context": [
        {
          "id": "ff4p9iv",
          "author": "whoatherecourt",
          "body": "Lol love this. \n\nMy biggest one: never add sugar to anything. (Duh!) Instead, mash up a banana and use it as sweetener. But it must be the smallest banana you can find. And make sure to go through the entire banana shelf (?) at the supermarket to look for the bunch with the smallest ones. And once you use that one banana you are done for the day. \n\nTldr: one tiny baby banana is ok. More than one banana is a fear food.",
          "created_utc": 1579569153.0
        },
        {
          "id": "ff5ctsv",
          "author": "taystorm",
          "body": "this just reminded me of when i saw the biggest bananas today. i live with my sister and she got bananas and they are literally twice the length of the bananas i would pick out... i was like wow those would probably be delicious, but it would scare me very much to eat a whole one of those. i used to not let myself eat bananas at all, so sticking to small ones is progress",
          "created_utc": 1579587607.0
        }
      ]
    },
    {
      "id": "ff522df",
      "author": "illygreen",
      "body": "I left a chewed up cheese curd in a napkin earlier today and im just praying that poor waitress didn't have to deal with it",
      "created_utc": 1579578116.0,
      "score": 5,
      "context": [
        {
          "id": "ff4vjyf",
          "author": "illygreen",
          "body": "Press everything before you eat it for oil.\n\nUse mustard over ketchup in all circumstances.\n\nPeanut butter on an apple slides. Peanut butter on a slice of bread for the same nutritional value is a binge food.\n\nDiet soda even when binging. It's a matter of habit.",
          "created_utc": 1579573470.0
        },
        {
          "id": "ff4zhur",
          "author": "None",
          "body": "God the pressing things for oil. When you're out at a restaurant and have to hide that you keep putting your roasted veggies into the napkin hidden in your lap before eating them...embarrassing stuff that I continue to di",
          "created_utc": 1579576213.0
        }
      ]
    },
    {
      "id": "ff70amq",
      "author": "illygreen",
      "body": "SAME. I've convinced myself I hate mayo. I don't know of I hate mayo but when I taste it I gag",
      "created_utc": 1579638551.0,
      "score": 2,
      "context": [
        {
          "id": "ff4vjyf",
          "author": "illygreen",
          "body": "Press everything before you eat it for oil.\n\nUse mustard over ketchup in all circumstances.\n\nPeanut butter on an apple slides. Peanut butter on a slice of bread for the same nutritional value is a binge food.\n\nDiet soda even when binging. It's a matter of habit.",
          "created_utc": 1579573470.0
        },
        {
          "id": "ff62xr1",
          "author": "agriff1",
          "body": "I started drinking diet soda when I was 13 out of pre-ED type behavior and at this point I don't know if I \\*actually\\* like the taste of it better or if I've convinced myself for so long that it became true, but either way I'm ok with it",
          "created_utc": 1579617801.0
        }
      ]
    },
    {
      "id": "ff7kmbm",
      "author": "TheShortGerman",
      "body": "On the one hand, I'm glad you don't feel alone! But on the other hand, man, I'm sorry.",
      "created_utc": 1579651784.0,
      "score": 2,
      "context": [
        {
          "id": "ff51mf0",
          "author": "TheShortGerman",
          "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
          "created_utc": 1579577784.0
        },
        {
          "id": "ff6ts6z",
          "author": "rhymeswithpanda1987",
          "body": "I relate so strongly to you.",
          "created_utc": 1579634722.0
        }
      ]
    },
    {
      "id": "ff512a3",
      "author": "ScreamingWeevil",
      "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
      "created_utc": 1579577362.0,
      "score": 4,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        }
      ]
    },
    {
      "id": "ff6nn9c",
      "author": "None",
      "body": "I’m the exact same! I had people taste test my diet pop to make sure it was actually diet, but tbh I feel a lot better if it’s just straight out of a bottle because then I can be absolutely certain",
      "created_utc": 1579631053.0,
      "score": 1,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff5f7ol",
          "author": "mirandalsh",
          "body": "Oh the soda one is me. Especially since I read once that people will give you regular even if you order diet.",
          "created_utc": 1579590266.0
        }
      ]
    },
    {
      "id": "ff7ps4u",
      "author": "rhymeswithpanda1987",
      "body": "Riiight? :/",
      "created_utc": 1579655390.0,
      "score": 1,
      "context": [
        {
          "id": "ff51mf0",
          "author": "TheShortGerman",
          "body": "Food ones:\n\nGrated parmesan and laughing cow are the only safe cheeses.\n\nIf I eat before 4-5 PM in the day, I will end up binging and purging.\n\nOnce I binge on a food, it is no longer safe and cannot be in the house.\n\nUnsweetened vanilla almond milk, flour, sugar, and cocoa powder aren't safe and can't be in the house because I can use them to bake or make waffles. Ditto for peanutbutter or butter. But powdered milk or PBFit are A-ok. \n\nEgg whites aren't safe because I can bake with them easily but whole eggs are safe.\n\nLow fat cottage cheese, sour cream, yogurt, and mayo. \n\nNo real sugar, only stevia and skinny syrups.\n\nNo bread or bread-like products (crackers, etc) are safe.\n\n20 calories per 2 cups of SF jello is safe, but when the store only has the 40 cals per 2 cups SF jello, I will cry in the aisle.\n\nOnly the Pinata apple hybrid is safe. No other apples will do.\n\nOnly foods that require prep (actual cooking) are safe. No chips, cereal, etc. Whole foods like beans, lean meats, vegetables, fruits, and specific cheeses are safe.\n\nBananas aren't worth the calories.\n\nI can't portion control anymore. So if I buy a box of pasta, bag of cereal, pretzels, and so on, I feel compelled to eat the whole thing in a binge. So i have to buy my unsafe foods in single or smaller servings because I will eat the entire thing in one go. \n\nSpice calories don't count, but gum calories do.\n\n&#x200B;\n\nOther:\n\nIf I eat maintenance one day, I feel fat and disgusting the next day even if I weigh the exact same. *Behaviors* make me feel skinny, not the specific weight.\n\nNo one will know I'm skinny unless I wear skinny jeans. They gotta see it or it doesn't exist.\n\nAny weight above my low weight is fat. Even if I was once ecstatic to be there.\n\nThings going wrong in my life (grades, family issues, etc) all come back to me being disgusting. Even if they have nothing to do with my weight.",
          "created_utc": 1579577784.0
        },
        {
          "id": "ff6ts6z",
          "author": "rhymeswithpanda1987",
          "body": "I relate so strongly to you.",
          "created_utc": 1579634722.0
        },
        {
          "id": "ff7kmbm",
          "author": "TheShortGerman",
          "body": "On the one hand, I'm glad you don't feel alone! But on the other hand, man, I'm sorry.",
          "created_utc": 1579651784.0
        }
      ]
    },
    {
      "id": "ff51gvt",
      "author": "None",
      "body": "Same! I even get suspicious of Coke Freestyle machines...like what if it's actually giving me full sugar instead of diet?",
      "created_utc": 1579577669.0,
      "score": 4,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        },
        {
          "id": "ff512a3",
          "author": "ScreamingWeevil",
          "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
          "created_utc": 1579577362.0
        }
      ]
    },
    {
      "id": "ff51oxl",
      "author": "ScreamingWeevil",
      "body": "WhAt iF tHeRe'S cALoriE pOwdEr iN tHe FoOd LiKe aN oLd PeRsoN hOmE?? CONSPIRACY!!!\n\nwhy am I like this. I make less sense than an antivaxxer.",
      "created_utc": 1579577836.0,
      "score": 10,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        },
        {
          "id": "ff512a3",
          "author": "ScreamingWeevil",
          "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
          "created_utc": 1579577362.0
        },
        {
          "id": "ff51gvt",
          "author": "None",
          "body": "Same! I even get suspicious of Coke Freestyle machines...like what if it's actually giving me full sugar instead of diet?",
          "created_utc": 1579577669.0
        }
      ]
    },
    {
      "id": "ff6er8q",
      "author": "None",
      "body": "our ed brains are malnourished anti-vaxxer soccer mums",
      "created_utc": 1579625607.0,
      "score": 3,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        },
        {
          "id": "ff512a3",
          "author": "ScreamingWeevil",
          "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
          "created_utc": 1579577362.0
        },
        {
          "id": "ff51gvt",
          "author": "None",
          "body": "Same! I even get suspicious of Coke Freestyle machines...like what if it's actually giving me full sugar instead of diet?",
          "created_utc": 1579577669.0
        },
        {
          "id": "ff51oxl",
          "author": "ScreamingWeevil",
          "body": "WhAt iF tHeRe'S cALoriE pOwdEr iN tHe FoOd LiKe aN oLd PeRsoN hOmE?? CONSPIRACY!!!\n\nwhy am I like this. I make less sense than an antivaxxer.",
          "created_utc": 1579577836.0
        }
      ]
    },
    {
      "id": "ff6lsny",
      "author": "ScreamingWeevil",
      "body": "Petition to infect the edbrains with smallpox",
      "created_utc": 1579629929.0,
      "score": 3,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        },
        {
          "id": "ff512a3",
          "author": "ScreamingWeevil",
          "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
          "created_utc": 1579577362.0
        },
        {
          "id": "ff51gvt",
          "author": "None",
          "body": "Same! I even get suspicious of Coke Freestyle machines...like what if it's actually giving me full sugar instead of diet?",
          "created_utc": 1579577669.0
        },
        {
          "id": "ff51oxl",
          "author": "ScreamingWeevil",
          "body": "WhAt iF tHeRe'S cALoriE pOwdEr iN tHe FoOd LiKe aN oLd PeRsoN hOmE?? CONSPIRACY!!!\n\nwhy am I like this. I make less sense than an antivaxxer.",
          "created_utc": 1579577836.0
        },
        {
          "id": "ff6er8q",
          "author": "None",
          "body": "our ed brains are malnourished anti-vaxxer soccer mums",
          "created_utc": 1579625607.0
        }
      ]
    },
    {
      "id": "ff6m6ly",
      "author": "None",
      "body": "signed. it's high time to bar karen from our weekly whine and cheese nights, ladies. let's get to work.",
      "created_utc": 1579630164.0,
      "score": 3,
      "context": [
        {
          "id": "ff4xw7w",
          "author": "theHBIC",
          "body": "Ouch, I felt that full fat milk/ regular soda rule. Same. A few days ago my bf and I went out to eat and when I verified to our server that I got Diet Dr Pepper she paused and was like “yeah I think so”. BF looked at me like I had three heads when I asked her to dump it out and bring me a for-sure DDP.",
          "created_utc": 1579575087.0
        },
        {
          "id": "ff4ze3q",
          "author": "None",
          "body": "Omg I make everyone taste test my sodas to be sure they are diet. Drinking non diet is a huge fear for me and sometimes I get a drink at a restaurant and wont drink it because it tastes a little too sweet...this is so relatable for me",
          "created_utc": 1579576136.0
        },
        {
          "id": "ff512a3",
          "author": "ScreamingWeevil",
          "body": "I'm like, ACTUALLY paranoid to the point where I can't drink it if I didn't SEE them make it a DIET soda. Like wtf. They're not trying to trick you, sis.",
          "created_utc": 1579577362.0
        },
        {
          "id": "ff51gvt",
          "author": "None",
          "body": "Same! I even get suspicious of Coke Freestyle machines...like what if it's actually giving me full sugar instead of diet?",
          "created_utc": 1579577669.0
        },
        {
          "id": "ff51oxl",
          "author": "ScreamingWeevil",
          "body": "WhAt iF tHeRe'S cALoriE pOwdEr iN tHe FoOd LiKe aN oLd PeRsoN hOmE?? CONSPIRACY!!!\n\nwhy am I like this. I make less sense than an antivaxxer.",
          "created_utc": 1579577836.0
        },
        {
          "id": "ff6er8q",
          "author": "None",
          "body": "our ed brains are malnourished anti-vaxxer soccer mums",
          "created_utc": 1579625607.0
        },
        {
          "id": "ff6lsny",
          "author": "ScreamingWeevil",
          "body": "Petition to infect the edbrains with smallpox",
          "created_utc": 1579629929.0
        }
      ]
    }
  ]
}