{
  "id": "evf62d",
  "subreddit": "fuckeatingdisorders",
  "author": "cranky-cricket",
  "created_utc": 1580259788.0,
  "title": "Small victories (stopped a binge before it happened)",
  "selftext": "It’s been a tough couple of months. Beginning of January was a big struggle. My husband was out of town for a week so I was home alone in the evenings. Prime opportunities for binging and purging. I was not 100% successful but I did a lot better than I would have a year ago. I also bought Brain over Binge book and have started working through that. \n\nAt this point, it’s been 3 good weeks in a row with only one minor slip up. I haven’t binged at all during this time and almost didn’t realize it until this past weekend. \n\nI almost fell into old patterns on Sunday. I was at the grocery store in the morning and decided to get a donut for my husband for breakfast. Naturally I should get myself one too. Well...what if I got myself an extra one to eat in the car and then I’ll only eat one at home. That extra “one” turned into a full *four* extra donuts. I sat in my car in the grocery store parking lot and normally would’ve eaten them all. Instead I looked at them and took one bite of each (so about 1 donut total) and threw the rest in the trash. I went home and ate normally the rest of the day. \n\nMaybe it’s small and insignificant but I need to count it as a win this week.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/evf62d/small_victories_stopped_a_binge_before_it_happened/",
  "score": 102,
  "num_comments": 5,
  "comments": [
    {
      "id": "ffvl365",
      "author": "mylessandovaldpt",
      "body": "Congratulations! It's always worth it to celebrate victories, big or small.",
      "created_utc": 1580266651.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ffvy0fg",
      "author": "standsure",
      "body": "Honey, that's not a small victory, that's ducking *huge*!\n\nGoos job!",
      "created_utc": 1580276791.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ffw32h7",
      "author": "alexshldshutup",
      "body": "Good job! It isn't insignificant or small at all, it's definitely something to be celebrated! I'm proud of you <3",
      "created_utc": 1580282193.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ffwmeq6",
      "author": "Boosey0910",
      "body": "Check out a book called Never Binge Again.  A new way of thinking about binging.  And .... CONGRATULATIONS!",
      "created_utc": 1580305461.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffwp56m",
      "author": "Flesh-And-Bone",
      "body": "That is a huge victory! Good for you. I struggle with this immensely as an all-or-nothing mentality: well, I've already eaten unhealthily, so I may as well eat garbage the rest of the day.\n\nExcept if I want another donut, I can have another donut later. And I can have one tomorrow, too. I can have a donut with breakfast, lunch, and dinner every single day if I want them. There's no reason to eat four at once--and if you're going to eat four donuts, there's nothing shameful about enjoying four donuts. It's not a secret. It's just food.",
      "created_utc": 1580307564.0,
      "score": 2,
      "context": []
    }
  ]
}