{
  "id": "ewdht6",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1580422897.0,
  "title": "I can't stop eating. The overpowering urge to eat and eat and eat is destroying me.",
  "selftext": "Everything goes fine up until lunchtime: I have breakfast then a snack then lunch hits and I start eating and eating and eating and it's impossible to stop. Same thing happens with dinner.\n\nI have no trouble whatsoever with breakfast, but lunch/dinner are murdering me, even when I eat a larger breakfast and snack. Today, I had three eggs and egg whites and avocado toast. Snack was protein powder, cottage cheese, and a bit of fruit. Lunch was beef stew...and a lot of it.\n\nI'm considering going back to intermittent fasting because at least if I'm out of control eating it's contained within 8 hours.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ewdht6/i_cant_stop_eating_the_overpowering_urge_to_eat/",
  "score": 98,
  "num_comments": 4,
  "comments": [
    {
      "id": "fg1bl3z",
      "author": "categoryischeesecake",
      "body": "That doesn't sound like that much to me. Do not go back to IF. I think we all know that is a slippery slope into full blown relapse.",
      "created_utc": 1580424242.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fg1j0do",
      "author": "ScreamingWeevil",
      "body": "DO. NOT. FAST.  \n\n\nStarvation like that is just disordered behavior under the mask of \"wellness\" bullshit.  \nYour urge to eat? Hunger. If you want to eat more food, and a lot of it, it is *because you need more food, and* ***a lot of it***.",
      "created_utc": 1580427976.0,
      "score": 40,
      "context": []
    },
    {
      "id": "fg20ueh",
      "author": "FancyForager",
      "body": "For me, when I have the urge to eat and never stop, it's a response to anxiety about something. When I was in an emotionally and financially abusive relationship, I could NOT STOP EATING. Within a week of leaving him, my appetite returned to normal.",
      "created_utc": 1580436168.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fg38ie8",
      "author": "DartInTheDark",
      "body": "This is me, too.\n\nMy years and years of chronic overeating / sometimes (often?) binging was, I only recently figured out, a way to soothe myself through various anxieties (including but not limited to autism related episodes, in my case). Figuring this out was a HUGE step to recovery for me.",
      "created_utc": 1580474346.0,
      "score": 5,
      "context": [
        {
          "id": "fg20ueh",
          "author": "FancyForager",
          "body": "For me, when I have the urge to eat and never stop, it's a response to anxiety about something. When I was in an emotionally and financially abusive relationship, I could NOT STOP EATING. Within a week of leaving him, my appetite returned to normal.",
          "created_utc": 1580436168.0
        }
      ]
    }
  ]
}