{
  "id": "ezhlro",
  "subreddit": "fuckeatingdisorders",
  "author": "robotsintrees",
  "created_utc": 1580941041.0,
  "title": "Legit proud of myself.",
  "selftext": "Bit of backstory: there's a cafe in my town that makes some pretty awesome muffins (one of those muffin du jour/different kinds every day things). They're huge; not from an eating disorder perspective, but objectively a \"normal person\" would split it with someone, or eat half and save the rest. In the event that I allowed myself to buy one, it would be a whole day. The only thing I ate, the only thing I did all day would be very slowly working on this giant muffin and feeling awful about it.\n\nI'm now at a point where I can't do that. I have no desire to do that. I haven't had a muffin from this cafe in over a year, because I was so scared of going back to that behaviour.\n\nA couple days ago, I caved, and got a pumpkin cranberry cream cheese muffin. This morning, I realized it didn't have to be all or nothing. I cut it into quarters, had a bit before having to catch the bus, had another piece with an egg white omelet for lunch, and I'm currently not feeling guilty, or like it was too much, or like I want to eat the rest of it and fuck the rest of the day. I feel okay about having a proper dinner later, and the muffin is just part of the day. \n\nI'm getting better at incorporating challenging foods into my meal plan and have them not be BIG DEALS. :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ezhlro/legit_proud_of_myself/",
  "score": 96,
  "num_comments": 8,
  "comments": [
    {
      "id": "fgndh1w",
      "author": "sunny__bob",
      "body": "Well done! I did a similar challenge recently, going to a cafe that I've been dreaming of for ages ALONE  and got a brownie and hot chocolate (originally planned on just the brownie but I wanted both so fuck the ED)\n\nCan't wait to go again, and I hope there are plenty of giant muffins in your future too x",
      "created_utc": 1580942544.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fgnbvwg",
      "author": "skeletonwannabe",
      "body": "Good job!!! (If that came off as sarcastic I’m so sorry, I didn’t mean to and I’m genuinely really happy for you!)",
      "created_utc": 1580941612.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fgnkurb",
      "author": "dieanywherelse",
      "body": "that's awesome! that muffin sounds delicious :) im glad you were able to enjoy it!",
      "created_utc": 1580946996.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fgoq2b3",
      "author": "yamiryukia330",
      "body": "Congratulations and I'm sure it's a wonderful muffin.",
      "created_utc": 1580980970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fgomyd4",
      "author": "hannasvip",
      "body": "I’m proud of you!!!",
      "created_utc": 1580976576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fgordh0",
      "author": "oldmenewme88",
      "body": "Congratulations :). It can be funny to type these things out because they seem so small. But we recognise this was an important moment. Sending you positive energy!",
      "created_utc": 1580982856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fgouliw",
      "author": "polenp",
      "body": "Congratulations! Its so amazing that you know your body and mentally at a state that you dont think about food that much. I dont even know you bur im so so proud of you and your progress♥️",
      "created_utc": 1580987330.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fgozutf",
      "author": "m3r3d1th_",
      "body": "Yay you!!!I’m so proud of you for overcoming your fear xxx",
      "created_utc": 1580993110.0,
      "score": 1,
      "context": []
    }
  ]
}