{
  "id": "f02vr1",
  "subreddit": "fuckeatingdisorders",
  "author": "sexyamphetamine",
  "created_utc": 1581038712.0,
  "title": "Gave myself a seizure",
  "selftext": "We finally did it gamers, after 2 years of purging daily I was able to make it 2 entire months without engaging in any eating disorder activities.  I threw away my scale, ate without checking the calories, and even found myself enjoying eating at restaurants with friends. Unfortunately, a week ago I cracked after giving into the temptation of weighing myself, I started purging 4-5 times a day and everything went to hell. My face swelled up, now it's super red + inflamed, my glands are fucked so i have no jaw definition which makes my esteem so much worse.  My lips got super cracked and developed a fungal infection from being constantly in contact with vomit and stomach acid, and three days ago after a 3 hour b/p episode, I hit rock bottom. I lost the ability to interact with my surroundings, started jerking and convulsing, hit the floor and pissed myself, and my jaw clamped shut; bruising my tongue and causing me to lose a decent amount of blood. All of this took place in my university's dining hall. Even worse, I had amnesia about the incident. I woke up hours later in my bed to dozens of texts telling me what happened. I am DONE with letting bulimia ruin my life. I made it 2 months and am determined to make it 2 more, again and again until I finally reach the healthy and normal existence that I deserve. To anyone even considering purging, don't even play around with the idea. At first, you may lose weight and feel invincible, but 2 years later and you'll find yourself tweaking out in a puddle of your own urine on a cafeteria floor. \n\n&#x200B;\n\nTDLR; 2 years after developing bulimia, had a tonic-clonic seizure due to dehydration and electrolyte imbalance. Lost control of bladder in front of dozens of peers :(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f02vr1/gave_myself_a_seizure/",
  "score": 114,
  "num_comments": 6,
  "comments": [
    {
      "id": "fgrd5o3",
      "author": "None",
      "body": "I’m so sorry you had to go through that. It sounds so traumatic. I purge very rarely now from about 3 times everyday simply due to the fear of the scary effects like these. I hope you recovered ok from the dehydration and are able to stop purging ❤️",
      "created_utc": 1581043913.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fgrmd6i",
      "author": "buffy-icecreamslayer",
      "body": "Stay strong, we believe in you!",
      "created_utc": 1581050618.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fgrogwz",
      "author": "lemmeseedattoof",
      "body": " I just want to tell you I love you and care about you.",
      "created_utc": 1581052368.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fgrrb4v",
      "author": "ghostbitch445",
      "body": "We all believe in you!! You can make it past 2 months eaaaasy :) recovery takes time and can be painful, but is incredibly worth it. Love you lots and am sending you a ton of positive healing energy <3",
      "created_utc": 1581054895.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fgsqhzx",
      "author": "None",
      "body": "This is scary, and I'm so sorry it happened to you! I really hope you're gonna get rid of the bulimia demons ❤️",
      "created_utc": 1581090488.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fguj21i",
      "author": "b_u_t_t_f_a_c_e",
      "body": "This really hits home because I've just been rolling the dice consistently b/ping since being put on meds that explicitly state this behavior can lead to seizures. \n\nI'm so sorry it came to this, but I'm hopeful for the hope it gave you to fight for recovery. Stay strong.",
      "created_utc": 1581122037.0,
      "score": 2,
      "context": []
    }
  ]
}