{
  "id": "f1s21z",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1581349353.0,
  "title": "why you don’t need to prove you’re sick and why doing so is problematic; in regards to instagram recovery communities",
  "selftext": "what is proving that you’re sick?\n\nproving you’re sick can look like:\nconstantly reminding others of your lowest bmi / weight\ntalking about numbers as a gauge for how sick you were / are (calories, sizes, pounds, etc.)\nreminding others of how much / how many times a day / how long you engaged in ED behaviors for  \nposting pictures of you at your lowest weight (!!!)\nflaunting your inpatient / hospital admissions \nflaunting a feeding tube\netc etc.\n\nwhy is this behavior problematic? because it reinforces the idea that you’re not sick / not sick enough if you haven’t been that low of a bmi, or if you haven’t been underweight, or if you have an eating disorder other than anorexia, if you haven’t been inpatient / hospitalized, etc etc. there is no need to prove you’re sick. the right people will believe you. i believe you. \n\n\nif you feel the need to prove you were / are sick ask yourself why. do you want to prove you’re sick, or does the eating disorder? would you benefit from this or would the eating disorder? practice self validation. don’t potentially trigger others for the sake of validating your eating disorder.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f1s21z/why_you_dont_need_to_prove_youre_sick_and_why/",
  "score": 172,
  "num_comments": 22,
  "comments": [
    {
      "id": "fh815d8",
      "author": "anonchicago7",
      "body": "This is exactly why in eating disorders anonymous and other eating disorder support groups you aren't allowed to mention specific foods behaviors calories weights ect. Its about the thoughts emotions and dealing with the true pain and suffering within.",
      "created_utc": 1581349693.0,
      "score": 71,
      "context": []
    },
    {
      "id": "fh89hnz",
      "author": "pabstpumpkinbeer",
      "body": "THIS x 1000000\n\nThis is also why \"progress pics\" (aka a before, emaciated pic and a healthier, after pic) shouldn't be shared ever. It just reinforces that you can tell that someone has an eating disorder by looking at them.",
      "created_utc": 1581354962.0,
      "score": 60,
      "context": []
    },
    {
      "id": "fh83zkz",
      "author": "finallyhappy1234",
      "body": "This is why I had to delete Instagram. I couldn't trust myself to not look at those pages. And the explore page was SOOO toxic it makes me sick",
      "created_utc": 1581351521.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fh86ott",
      "author": "None",
      "body": "This is so true. As someone who runs a recovery page, I see a lot of people mentioning how low they WERE in comparison to sharing how far they've come. I would much rather read about what you might be struggling with that day and how you don't want to slip back.\nI see photos of people at their lowest and think, \"fuck I never looked like that. Maybe I'm making this whole anorexia thing up\" knowing damn well almost 10 years later I still struggle",
      "created_utc": 1581353222.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fh8f59k",
      "author": "Enhanced_ByScience",
      "body": "This is a serious problem in the medical community as well, and I wish there were more advocacy for proper training to revise the criteria for diagnosing EDs beyond the cookie-cutter external/vital statistics model currently in place. \n\nI KNOW this approach misses an enormous percentage of the population suffering and makes it extremely difficult for insurance to cover the appropriate level of care (or any care at all) if BMI, weight, blood work, EKG and other external factors are within \"normal limits\". \n\nJust as one cannot look at another person and diagnose depression or diabetes from these criteria, weight and external appearance are NOT an accurate indication of the presence, or severity of an ED. \n\nAs a member of the field with a 20+-year ED history in various forms, as well as a parent, and sibling with long-standing EDs, it is absolutely appalling how little the vast majority of providers know or attempt to manage on an outpatient basis. \n\nAs an example, my sibling had to literally argue with her doctor to convince her that she was truly in need of returning to residential care, and was told \"you don't look like you have an ED\". \n\nApologies for the long text, but this topic is SO close to my heart and one of the most commonly misunderstood aspects of EDs I have to explain often. \n\nHopefully one day there will be more widespread education and awareness that EDs can occur at any age, gender, race and weight, etc. \n\nI could go on about why it's not about the food or numbers- those are symptoms of the underlying illness- but it's time to get off my soapbox ☺️\n\nThank you to all the beautiful people who took the time to read this.",
      "created_utc": 1581358424.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fh8kqnh",
      "author": "snisjxjsh",
      "body": "I think maybe part of the problem here is that most of the people posting about their recovery may be a reasonably way into their physical recovery but have a long way to go mentally (cos as we all know the physical side is the 'easy part'). And anorexia (I don't know about other EDs so don't want to speak for them) causes such excessive competitiveness if that's a word. So really when people are competing to show how far they've come, all they're proving is that they are still very sick.\nIDK that's just my take on it.",
      "created_utc": 1581361810.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fh8glzj",
      "author": "imokayjustfine",
      "body": "You know, I don’t have an Instagram account or anything, but I’m pretty sure I’m guilty of this in some ways. And you’re absolutely right. \n\nLike I go to groups led by clinicians through a local ED nonprofit (which provides low-cost therapy as well, woo), and it’s also against the rules to talk about specific behaviors, weights, calories, foods and so forth (in the groups, I mean, not individual therapy). It’s *very much* against the rules for the same reasons. \n\nBut people *do* talk about hospital stays and specific physical complications and stuff (?)...and there *can* be some absurdly competitive undertones...unintentionally (for the most part), but still. \n\nCan’t say I’ve never mentioned that kind of thing myself, there or even just right here on Reddit. :/ :/ \n\nI’m sure I could be better about it to some degree (in certain contexts at least), so I really appreciate you sharing your thoughts.\n\nBecause I’d never want to make anyone feel invalid or “not sick enough” or whatever (like I do clearly, lol :/)—but *shit*, it *does* raise those sorts of feelings for me when other people get like that! Often! So I should probably be more careful.\n\nYour closing paragraph is hitting me extra hard, and I’m going to think about it a lot. Thanks. 💛",
      "created_utc": 1581359301.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fh8z0p1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1581370285.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fh914dz",
      "author": "LowkeyMisomaniac",
      "body": "On top of that I feel like this is low key people romanticizing their ED. And I know I myself am guilty of it, although trying to unpack and unlearn it.",
      "created_utc": 1581371528.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fh8qv0f",
      "author": "catpicsorbust",
      "body": "I have this internal thought that I always have to be sick in order to receive treatment, so I think it keeps me out of recovery longer. Once I get the ball rolling, I do way better without the constant bombardment of eating disorder reminders from providers, Instagram, etc.",
      "created_utc": 1581365497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh8wsuj",
      "author": "snake_pod",
      "body": "I've never seen the recovery community on IG and now I'm really glad I haven't, and hopefully never will. Fuck that toxic shit.",
      "created_utc": 1581368980.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh9puyw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1581386909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh9q92n",
      "author": "mij3i",
      "body": "I hate it when people post before and after pictures. Like, who is this serving?",
      "created_utc": 1581387156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fha6ebx",
      "author": "humanskincalories",
      "body": "That's what I've been saying this entire time.\n\nUnrelated, but this reminds me that I had friends who fully knew about my ed and I knew them outside of the ed community, they would tell me about how underweight they were (They also weren't underweight but y'know still triggered me), how little they ate, how 'smol' they were (which bothers me to no end, by the way).\n\nI get it, you want to prove to me that YOU are the one sicker than me, and it hurts because I thought I could trust them.",
      "created_utc": 1581398526.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fha6v05",
      "author": "complexmariner",
      "body": "eating disorders are SO COMPETITIVE and even once we have recovered that competition stays, but you have to remember that people with eating disorders who listen to you talk about this stuff, theu are competitive and they will strive for even unhealthier limits. (i dont wanna flaunt being inpatient) but when i was i was in with this girl and we basically just made each other worse one upping each other talking about our habits and after i got out i started doing things i had never done before that she did cause i felt like i wasnt sick enough",
      "created_utc": 1581398918.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fha7wyz",
      "author": "PinkLemonadezz",
      "body": "I've been struggling with this for sooo long. I don't engage in behaviours as disordered as it used to be and I always feel invalidated and scared that others think I'm attention seeking because I don't have the typical look that people think a person with an Ed looks like and my behaviour isn't disordered enough. It's so ridiculous to even think this way, but it bothers me soo much. And yeah, I do tell people about my huge weight loss a lot. I realised it was a problem a while ago but I can't seem to stop.",
      "created_utc": 1581399843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh8b2ax",
      "author": "problematicbeing",
      "body": "Agreed! Even worse is that I'll see posts on a progress pic subreddit of before/after weight loss and look at the persons account and also see them posting in edanonymous and other ED subreddits... like they posted a pic of themselves having lost weight through their disorder. It's just horrifying because normal people will congratulate them based on the results of a deadly mental illness and possibly aspire for the same results.",
      "created_utc": 1581355933.0,
      "score": 29,
      "context": [
        {
          "id": "fh89hnz",
          "author": "pabstpumpkinbeer",
          "body": "THIS x 1000000\n\nThis is also why \"progress pics\" (aka a before, emaciated pic and a healthier, after pic) shouldn't be shared ever. It just reinforces that you can tell that someone has an eating disorder by looking at them.",
          "created_utc": 1581354962.0
        }
      ]
    },
    {
      "id": "fh93vlk",
      "author": "None",
      "body": "Also the fact that in many “recovered pictures” the person isn’t actually weight restored",
      "created_utc": 1581372953.0,
      "score": 20,
      "context": [
        {
          "id": "fh89hnz",
          "author": "pabstpumpkinbeer",
          "body": "THIS x 1000000\n\nThis is also why \"progress pics\" (aka a before, emaciated pic and a healthier, after pic) shouldn't be shared ever. It just reinforces that you can tell that someone has an eating disorder by looking at them.",
          "created_utc": 1581354962.0
        }
      ]
    },
    {
      "id": "fh9d00n",
      "author": "Samantha039",
      "body": "Thanks for spelling it out that way. I’m feeling very seen. I went to a doctor FOR my ED. I got the classic “you dont look like you have an eating disorder”  BEFORE she even asked what kind I was dealing with. Like, are you effing kidding me? This isnt the first doctor to dismiss me because I’m not thin enough to be bulimic, and not heavy enough to suffer with binge eating. Um, it’s called a f*cking cycle people! Jesus! This whole “you aren’t sick enough” thing, now being compounded with  “you don’t look sick enough”  makes for a very dangerous set of requirements for aid. By the time it meets *your* standards, doctors, it’s already reached the point of critical. It makes me want to just scream at the top of my lungs! Why can’t I just say “I’m sick. I need help” and be done. Why is my plea for help not the hell enough?!?\n\nEhem.. my apologies for getting rant-ee. This topic also hits close to home for me. I suffer every day, and it’s just so hard being so dismissed.",
      "created_utc": 1581378419.0,
      "score": 5,
      "context": [
        {
          "id": "fh8f59k",
          "author": "Enhanced_ByScience",
          "body": "This is a serious problem in the medical community as well, and I wish there were more advocacy for proper training to revise the criteria for diagnosing EDs beyond the cookie-cutter external/vital statistics model currently in place. \n\nI KNOW this approach misses an enormous percentage of the population suffering and makes it extremely difficult for insurance to cover the appropriate level of care (or any care at all) if BMI, weight, blood work, EKG and other external factors are within \"normal limits\". \n\nJust as one cannot look at another person and diagnose depression or diabetes from these criteria, weight and external appearance are NOT an accurate indication of the presence, or severity of an ED. \n\nAs a member of the field with a 20+-year ED history in various forms, as well as a parent, and sibling with long-standing EDs, it is absolutely appalling how little the vast majority of providers know or attempt to manage on an outpatient basis. \n\nAs an example, my sibling had to literally argue with her doctor to convince her that she was truly in need of returning to residential care, and was told \"you don't look like you have an ED\". \n\nApologies for the long text, but this topic is SO close to my heart and one of the most commonly misunderstood aspects of EDs I have to explain often. \n\nHopefully one day there will be more widespread education and awareness that EDs can occur at any age, gender, race and weight, etc. \n\nI could go on about why it's not about the food or numbers- those are symptoms of the underlying illness- but it's time to get off my soapbox ☺️\n\nThank you to all the beautiful people who took the time to read this.",
          "created_utc": 1581358424.0
        }
      ]
    },
    {
      "id": "fh9bo64",
      "author": "glokash",
      "body": "Agree 100%",
      "created_utc": 1581377538.0,
      "score": 2,
      "context": [
        {
          "id": "fh8f59k",
          "author": "Enhanced_ByScience",
          "body": "This is a serious problem in the medical community as well, and I wish there were more advocacy for proper training to revise the criteria for diagnosing EDs beyond the cookie-cutter external/vital statistics model currently in place. \n\nI KNOW this approach misses an enormous percentage of the population suffering and makes it extremely difficult for insurance to cover the appropriate level of care (or any care at all) if BMI, weight, blood work, EKG and other external factors are within \"normal limits\". \n\nJust as one cannot look at another person and diagnose depression or diabetes from these criteria, weight and external appearance are NOT an accurate indication of the presence, or severity of an ED. \n\nAs a member of the field with a 20+-year ED history in various forms, as well as a parent, and sibling with long-standing EDs, it is absolutely appalling how little the vast majority of providers know or attempt to manage on an outpatient basis. \n\nAs an example, my sibling had to literally argue with her doctor to convince her that she was truly in need of returning to residential care, and was told \"you don't look like you have an ED\". \n\nApologies for the long text, but this topic is SO close to my heart and one of the most commonly misunderstood aspects of EDs I have to explain often. \n\nHopefully one day there will be more widespread education and awareness that EDs can occur at any age, gender, race and weight, etc. \n\nI could go on about why it's not about the food or numbers- those are symptoms of the underlying illness- but it's time to get off my soapbox ☺️\n\nThank you to all the beautiful people who took the time to read this.",
          "created_utc": 1581358424.0
        }
      ]
    },
    {
      "id": "fh9pwr3",
      "author": "littlemissbones",
      "body": "Yupyupyup",
      "created_utc": 1581386940.0,
      "score": 1,
      "context": [
        {
          "id": "fh8z0p1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581370285.0
        }
      ]
    },
    {
      "id": "fhb5lzn",
      "author": "None",
      "body": "I’m in the same boat :( The “looks recovered, acts recovered, suffers immensely with feeling invalid and like a fraud” boat. Sometimes I feel the urge to let everyone know that I, indeed lost over xx pounds through my eating disorder and I was only xx pounds etc. and I have to stop myself and be like wait.. that’s not right..",
      "created_utc": 1581435298.0,
      "score": 1,
      "context": [
        {
          "id": "fha7wyz",
          "author": "PinkLemonadezz",
          "body": "I've been struggling with this for sooo long. I don't engage in behaviours as disordered as it used to be and I always feel invalidated and scared that others think I'm attention seeking because I don't have the typical look that people think a person with an Ed looks like and my behaviour isn't disordered enough. It's so ridiculous to even think this way, but it bothers me soo much. And yeah, I do tell people about my huge weight loss a lot. I realised it was a problem a while ago but I can't seem to stop.",
          "created_utc": 1581399843.0
        }
      ]
    },
    {
      "id": "fha8mmm",
      "author": "Hopeless-Cause",
      "body": "This is what irritates me about the before and after pictures on The IG ED community. Like, you used to be severely underweight, and now you’re slightly less severely underweight. Stop trying to make it seem like you stayed extremely underweight and are recovered.",
      "created_utc": 1581400490.0,
      "score": 10,
      "context": [
        {
          "id": "fh89hnz",
          "author": "pabstpumpkinbeer",
          "body": "THIS x 1000000\n\nThis is also why \"progress pics\" (aka a before, emaciated pic and a healthier, after pic) shouldn't be shared ever. It just reinforces that you can tell that someone has an eating disorder by looking at them.",
          "created_utc": 1581354962.0
        },
        {
          "id": "fh93vlk",
          "author": "None",
          "body": "Also the fact that in many “recovered pictures” the person isn’t actually weight restored",
          "created_utc": 1581372953.0
        }
      ]
    },
    {
      "id": "fhbefj7",
      "author": "PinkLemonadezz",
      "body": "I relate so much...and I don't know how to get over it. I don't know why I need to mention how much weight I lost just to prove to someone that I have an issue. And I don't even know why there's a need to prove something anyway. I think it's because of the stereotype that many people have  those with eds so those who don't fit the stereotype (which I'm pretty sure is actually the majority) feel invalid. Feeling like I'm attention seeking is the worst though.",
      "created_utc": 1581440593.0,
      "score": 2,
      "context": [
        {
          "id": "fha7wyz",
          "author": "PinkLemonadezz",
          "body": "I've been struggling with this for sooo long. I don't engage in behaviours as disordered as it used to be and I always feel invalidated and scared that others think I'm attention seeking because I don't have the typical look that people think a person with an Ed looks like and my behaviour isn't disordered enough. It's so ridiculous to even think this way, but it bothers me soo much. And yeah, I do tell people about my huge weight loss a lot. I realised it was a problem a while ago but I can't seem to stop.",
          "created_utc": 1581399843.0
        },
        {
          "id": "fhb5lzn",
          "author": "None",
          "body": "I’m in the same boat :( The “looks recovered, acts recovered, suffers immensely with feeling invalid and like a fraud” boat. Sometimes I feel the urge to let everyone know that I, indeed lost over xx pounds through my eating disorder and I was only xx pounds etc. and I have to stop myself and be like wait.. that’s not right..",
          "created_utc": 1581435298.0
        }
      ]
    }
  ]
}