{
  "id": "f3thzk",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1581693118.0,
  "title": "\"If I'm gaining weight eating safe foods, what will happen when I eat fear foods?\"",
  "selftext": "I was told this would stop. I was told that eating enough would reduce my obsession with food. I was told that my weight would stabilize.\n\n^(This post brought to you by last night's post-gym meltdown.)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f3thzk/if_im_gaining_weight_eating_safe_foods_what_will/",
  "score": 102,
  "num_comments": 3,
  "comments": [
    {
      "id": "fhl8h77",
      "author": "pizza_bath",
      "body": "from what I've read, you might actually gain more by sticking to safe foods because you're never really satisfying your mental cravings, so you just keep eating, and keep obsessing about what you really want",
      "created_utc": 1581696964.0,
      "score": 59,
      "context": []
    },
    {
      "id": "fhlplzp",
      "author": "None",
      "body": "It does stop though, genuinely. Your body has a natural weight at which it prefers to sit. Mine is at the heavier end; within 9 months i had gained 20kg and since then, no matter what I eat or how much I work out, my weight doesn't budge (aside from fluctuations). Even though I still sometimes have mental hunger around some foods at times (right now it's dark chocolate, cashews and frozen banana) I honour that hunger because it will pass and my weight doesn't budge.\n\nThis is the worst part of recovery, but if you keep listening to your body and your cravings it does eventually pass.",
      "created_utc": 1581703170.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fhmcveh",
      "author": "selfcontrolwya",
      "body": "wait this actually makes a lot of sense... i just realized that when i started eating fear foods, eating out, and not counting cals i gained barely any weight bc it was more intuitive",
      "created_utc": 1581711154.0,
      "score": 14,
      "context": [
        {
          "id": "fhl8h77",
          "author": "pizza_bath",
          "body": "from what I've read, you might actually gain more by sticking to safe foods because you're never really satisfying your mental cravings, so you just keep eating, and keep obsessing about what you really want",
          "created_utc": 1581696964.0
        }
      ]
    }
  ]
}