{
  "id": "f5aahm",
  "subreddit": "fuckeatingdisorders",
  "author": "freddybobeddy",
  "created_utc": 1581953264.0,
  "title": "A year and a half into recovery - an update :)",
  "selftext": "Hey guys, I'd figure I'd keep this update thing rolling in case it helps someone out!\n\nBasically I have a 5 year history of anorexia with b/p, orthorexia, and exercise addiction. I started recovery in summer 2018. It was awful, I went through some of the worst depression and anxiety of my life and I relapsed a bunch in the 1st year. At first, I genuinely thought I was failing recovery, but now I understand why they say it isn't linear lol.\n\nOh, side note, I didn't attend any inpatient/outpatient treatment (though I should have). I basically recovered at home and saw a therapist who knew nothing about eating disorders. I would strongly recommend actually going to treatment. I gave myself refeeding syndrome on accident and prolonged my recovery mentally and physically because idfk what I was doing.\n\nSo on the physical side of things, I'm weight restored and stable. My extreme hunger is gone (it look forever to go away), my periods back, my hair is thicker, and my teeth are healthy. I have the energy to actually do things now, be social and feel excited for things. My sense of humour has come back which has been so important. I generally feel stronger and more resilient, physically and mentally.\n\nOne thing thats really sucked was being diagnosed with arthritis and nerve damage, which my neurologist thinks was caused by my eating disorder. I'm not sure whether its from under eating or overexercising...  honestly I didn't even know that could happen (I'm only 23). Anyways, PSA, because my back and head hurt everyday and its absolute shit.\n\nI still have behaviours that I'm trying to weed out. I struggle with body checking and sometimes choosing safe foods on purpose. But, a lot of the things I used to struggle with are easy now. I can eat whatever I want with minimal guilt, I don't compulsively exercise anymore, I can wear tight clothes, and look in the mirror before showering without dying inside. I no longer feel as though everyone cares about my weight gain. Also, I don't get triggered nearly as easily. Before, even the mere sight of someone really thin could send me into a spiral.\n\nI'm not going to outright say I'm happy, healthy and thriving in recovery, because that would be a lie. I've been trying to work through some of the trauma that led to my ED, which has helped. Turns out a lot of my instilled beliefs stem from my childhood and contributed to my ED. I kind of had to reteach myself how to exist without self destructing, which hasn't been easy at all. I still deal with underlying depression and anxiety/OCD that makes daily life harder. Its a lot better than what it used to be though, and I have many days where I feel calm and content with life.\n\nSo yeah, sorry that was long, but it felt good to write. :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f5aahm/a_year_and_a_half_into_recovery_an_update/",
  "score": 91,
  "num_comments": 9,
  "comments": [
    {
      "id": "fhxh3mx",
      "author": "buffy-icecreamslayer",
      "body": "Ahhhh Congratulations!!!! I’m so happy for you!",
      "created_utc": 1581954224.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fhyyqxx",
      "author": "Kitty91998",
      "body": "I am genuinely overjoyed to hear that you have surpassed the confines of anorexia. An enormous congratulations to you, you deserve it more than anything <3 I genuinely needed this right now. I am actually in a decent enough headspace today to take this as you intended and use it as hope-so I just wanted to say thank you. Details and all. I needed to hear all of it. I am bookmarking this. Thank you thank you thank you.",
      "created_utc": 1581986876.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fhybyn4",
      "author": "Sir_holy_bears",
      "body": "I needed this. I always relapse this time of year and it's crippling atm. I'm getting back into overexercising even though I know it's wrong, but I really feel like I can't stop it. Thank you for your strength in sharing your story! I'm proud of you:)",
      "created_utc": 1581972811.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fhxzht9",
      "author": "aquagirl02041992",
      "body": "Thank you for sharing your story!! and I am so proud to hear how happy you are!! <3",
      "created_utc": 1581965470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fhy8itm",
      "author": "Kchillthanx",
      "body": "Congrats!  Needed to hear this today.  2018 was my bad year too.  Weight restored and food behaviors minimal but still dealing with the emotional stuff.",
      "created_utc": 1581970819.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fhyfrhn",
      "author": "scoutstail",
      "body": "I’m so happy to hear this! I’ve been in recovery for about the same amount of time and am in a similar place, but I always feel like I recovered “too quickly,” so I’m thankful for the reminder that I’m at the spot I need to be in.",
      "created_utc": 1581975011.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fhzkquq",
      "author": "Samantha039",
      "body": "I feel so seen. I have not recovered, and every day I decide that I’m done with the compulsive binging. One day.",
      "created_utc": 1582002275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fhzyy5y",
      "author": "isabloop",
      "body": "Thank you so much for sharing. I really relate to this and it gives me so much hope.",
      "created_utc": 1582018386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fiivcbe",
      "author": "None",
      "body": "You are so strong!! It must have been very difficult for you to do this all on your own without professional help. God bless you!! :)",
      "created_utc": 1582427817.0,
      "score": 1,
      "context": []
    }
  ]
}