{
  "id": "f76j2q",
  "subreddit": "fuckeatingdisorders",
  "author": "East-Hall",
  "created_utc": 1582263054.0,
  "title": "Fucking hate this stupid eating disorder shit lmao maybe trigger warning",
  "selftext": "It only took me this fucking long to realize how stupid eating disorders are lmao\n\nWouldn’t it be so nice? To be able to wrap your fingers around your arms, to not worry about your thighs chafing when you walk. \n\nIt would definitely make you a kinder and cooler and smarter and healthier person, and it would definitely not possibly cost you your fucking life. \n\nIsn’t spending time on pro-ana websites with the username “LittleAnaButterflyThinLittleUwUSmallBonesSpineDelicateDainty“, or whatever the fuck, picking up tips on how to slowly but surely kill yourself so much more productive than spending time with loved ones? Or drawing, or painting, or singing, or dancing, or cooking, or moving TF on with your life? \n\nIsn’t it so fun when you spend hours picking apart what’s wrong with you, what you shouldn’t have eaten today, how many more pounds you should lose, how disgusting and filthy you are for eating that slice of pizza yesterday, how you’re totally gonna make up for it today? Not feeling like you’ve destroyed yourself “enough” and idolizing girls on feeding tubes who are close to death? \n\nIsn’t it so fucking amazing when you shut out all your loved ones because you simply don’t have the energy to care anymore, you feel you’re too ugly to be looked at, you’re scared they may make you eat. And when you do talk to them, they only express concern for your health or anger at how you’ve been acting lately. But who cares. It doesn’t matter. \n\nIt’s made you happier, it’s filled the emotional void, it’s fulfilled all its promises, right?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f76j2q/fucking_hate_this_stupid_eating_disorder_shit/",
  "score": 106,
  "num_comments": 5,
  "comments": [
    {
      "id": "fi9lfgz",
      "author": "Liquid_Is_A_Paper",
      "body": "Tell me about it. This shit SUCKS\n\nLike... I COULD go out with my friends tonight because they're all going out and having a good time.... orrrrr I could spend 2-3 hours exercising because I ate \"over the limit\" today!\n\nI COULD go to this once-in-a-lifetime talk from someone who was inspirational to me... or I could miss it because they're going to a restaurant!\n\nI COULD eat this birthday cake that a loved one had sent to me as a really kind gesture... or I could bin it and not celebrate because cAlORiEs\n\nAnd so on and so on and so on and so on and\n\nugh.",
      "created_utc": 1582270484.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fiag0mr",
      "author": "None",
      "body": "I love being told by fourteen-year-olds that I shouldn't eat bread ever again!\n\nSeriously though, OP, I feel this in my bones. Thanks for writing this. Wishing you all the best.",
      "created_utc": 1582300269.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fic5m0c",
      "author": "sAm_I_Am77",
      "body": "Isn’t it the best feeling when your daughter is crying and you ask her what’s wrong and she says “you always tell me that I should love myself as I am but you don’t love yourself as you are” and that’s without the knowledge that I have an ED, or is it? 😒",
      "created_utc": 1582338198.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fib4e9a",
      "author": "None",
      "body": "Isn't it the best feeling in the world when your inner voice just constantly insults everything you do through the day?!",
      "created_utc": 1582314382.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiaoyd7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1582305540.0,
      "score": 1,
      "context": [
        {
          "id": "fiag0mr",
          "author": "None",
          "body": "I love being told by fourteen-year-olds that I shouldn't eat bread ever again!\n\nSeriously though, OP, I feel this in my bones. Thanks for writing this. Wishing you all the best.",
          "created_utc": 1582300269.0
        }
      ]
    },
    {
      "id": "fiapopz",
      "author": "None",
      "body": "welcome to my life",
      "created_utc": 1582305970.0,
      "score": 1,
      "context": [
        {
          "id": "fiag0mr",
          "author": "None",
          "body": "I love being told by fourteen-year-olds that I shouldn't eat bread ever again!\n\nSeriously though, OP, I feel this in my bones. Thanks for writing this. Wishing you all the best.",
          "created_utc": 1582300269.0
        },
        {
          "id": "fiaoyd7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582305540.0
        }
      ]
    }
  ]
}