{
  "id": "f7j0xj",
  "subreddit": "fuckeatingdisorders",
  "author": "Discalced-diapason",
  "created_utc": 1582324560.0,
  "title": "I miss my sick body",
  "selftext": "I’m currently trying the recovery thing... in IOP, seeing a dietician... the whole thing. And I’m thankful that I am feeling better physically and that my depression has lifted now that I’ve been eating more (still restricting some, but it’s much better than it has been in the recent past). \n\nBut one thing that has always stuck with me each time I’ve tried to recover (and I’ve been doing the revolving door of relapse/recover/relapse/recover... etc for many, many years now) is that when I weight restore, I struggle with accepting my body as it is in that moment. I’ve never gotten to the point of body acceptance or even body love. The best I’ve been able to manage is body apathy, which I guess is better than pure hatred, but still...\n\nI miss my body when it was sick. I don’t miss the misery, depression, isolation, anxiety attacks, suicidal ideation, obsessions, compulsions, hair falling out, heart arrhythmias, and all of the other cost that comes with getting that body back, but there is a part of me that forgets how terrible things were when I was no where near ready to recover. There is a part of me that is still willing to pay that cost, although thankfully, these days, the part of me that wants to try this recovery thing and work on accepting the body I have in recovery is louder on the majority of the days. \n\nI think it’s flared up because Facebook memories lately has been showing me pictures of me when my ED was more visible and I’ve also had a bit of unintentional weight loss due to a new medication and the ED voice has been  especially loud the past couple of weeks. I’ve talked to my therapist and dietician about this, but I still feel like I need to keep saying it just to keep trying to shine light on this darkness.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f7j0xj/i_miss_my_sick_body/",
  "score": 99,
  "num_comments": 5,
  "comments": [
    {
      "id": "fibwpxo",
      "author": "annabellagamboni",
      "body": "i get this. omg i get this! i’ve been weight restored for 2-3 yrs but i still loathe my body on the reg. what i find useful is ‘mourning’ my old body, yes, as if it is dead. there is no going back to that body - for better or for worse. also, it can help (for quick moments like FB memories, old pics) to think about how you felt in those pictures. were u miserable? did you have a panic attack an hour after this picture was taken? this also works for current pictures you don’t like - were you hanging out with someone you love? stay strong. x",
      "created_utc": 1582331933.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fidf2es",
      "author": "None",
      "body": "I talked to my therapist a lot about this. It's really interesting how this seems to be such a sticking point. I was surprised at my own inability to let go of it, when I normally, in therapy, just come in, say, 'ok what's normal eating?', my therapist says what to do and I go off and do it. Or I have a weird idea, she shows me a different way of looking at it and I go, ohhhh, of course and I change. This though, is a whole different thing and I can completely see how it leads to relapse for a lot of people. \n\nI  can hear it in my own head, while I'm eating well and looking after myself, there's a voice going, well, in  6 months, maybe you can look at scaling back breakfast portions, or train for a 10k, or start a light bit of calorie counting. And that is because in my head, I'm thinking, well maybe  now the eating disorder is sorted, you can finally, finally lose weight. I ultimately had the therapy because I felt it would long-term lead me to lose weight. Instead I gained 10lbs hahahahaa. \n\nThe stuff I have learned, however, that I find actually helpful are below:\n\n* Buying comfortable clothes that fit really well. If things are digging in, then it makes me feel bigger. I cut the labels out so I'm not reminded of the numbers. People would not have had numbers in the past when people sewed their own clothes. \n* Buy clothes that are genuinely flattering and make you feel confident. For me, I felt that when I was much smaller, anything would suit me. I also have really feminine and probably quite a young style. I feel that at my weight, the 'young' look doesn't work. So, I had to find other styles that aren't just frumpy, baggy clothes, that actually flatter me as I  am now. My therapist said about all the types of clothes that don't really suit her and she is very slim. It made me realise  that regardless of weight, we all have colours, styles and fits that work better or worse for us. It's not just a weight thing. \n* Avoiding triggers. For me, a lot of this is on Pinterest and Instagram. I got rid of Facebook, Twitter, Linkedin, Instagram and Pinterest for nearly a year. I now know how to use Instagram and Pinterest - to basically look at hot actors I like and nice homes. Also a couple of accounts that post things that are  totally in line with what I learnt in therapy. \n* Finding new beauty role models. I've got a very fixed beauty ideal in my head which is focused on cherubic, youthful, willowy, basically teens. I've had to learn that just because I am blown away by how beautiful people like this can look, it doesn't mean that other people aren't unbelievably beautiful too. I have a template of myself in my head that fits that mould, and I am constantly measuring my current self against that template. Well... I'm 34 hahaha, so I don't look like a teenager anyway. I take some bits from that aesthetic, but it's stuff like, I have really good skincare, feminine clothes that are fashionable and hint at this aesthetic but aren't full blown (e.g. like Japanese lolita fashions or something). I've sought out a broader variety of role models. Just because I find something beautiful doesn't mean I need to become it, or possess it. So I still admire Elle Fanning, but Sarina Nowak, to me is also captivating to look at. I also look up people who wear styles that are going to suit me better. Like Cate Blanchett wears a lot of highly tailored, minimal, elegant stuff. Or I look up people with my body type and see what they tend to wear to get inspiration. \n* With my therapist we also looked at what it means to be attractive. She asked me what I'm attracted to. It was a great question because I have a notoriously weird taste in men and like a lot of men who are actually fat, or could be considered objectively ugly (think Steve Buscemi, or Ray Winstone - these are very old crushes now). What I realised is I'm attracted to their confidence, or compassion, morals, sometimes if they have a dirty sense of humour or something a bit taboo about them and more often than not I like it when they're big and chunky. I really don't go for skinny guys. So the conclusion I drew was that I'm way more attractive as someone who is charismatic and confident and a good person, regardless of how I look. Hating my body and acting awkward and hiding, is less attractive. \n* Finally she got me to pay attention to how my husband sees me and what he's attracted to. This helped reinforce again that not only is it possible to find someone attractive based on things other than how they look, but also that physically, people find a lot of different stuff attractive anyway. \n\nI don't know if any of this helps, but I know for me, these kinds of reminders can really help snap me out of a spiral. \n\nAlso, it's ok to be in a place where you feel apathetic about your body. If that's what you can manage right now, that's fine. How your body looks, if you take all the above into account, is not that important in the scheme of things, so in a way, apathy and not being too bothered either way, is better than paying it too much mind. If I was you, for the time being, I would look up whether you can change a setting to stop Facebook bringing up old photos, or do some other thing to not see those images. It's not linear when you're recovering and sometimes you have to take extra precautions to care for yourself.",
      "created_utc": 1582366250.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fibzryd",
      "author": "danimarie82",
      "body": "I get it. I was never underweight but this time last year, I weighed a lot less than I do now and I miss it too. Like you, I don't miss having almost constant headaches, heart palpitations, and muscle cramps while feeling dizzy and shaky, but I miss my smaller clothes. Just feeling more comfortable in my body and clothes in general. The ED voice has been very loud for weeks now, and it wins out sometimes, but I'm trying to keep it at bay. I know I'm in trouble though because I almost had a breakdown at the thought of getting weighed at my yearly neurologist appointment and I am putting off a physical for the same reason...",
      "created_utc": 1582334061.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fibwm67",
      "author": "queenofshibs",
      "body": "I feel this so much. I can be so on board with recovery and taking care of my body until I start to gain weight and then I just start to fucking panic. I don’t know what to do about it or how to get past it but it’s the one thing really holding me back from recovery.",
      "created_utc": 1582331864.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fieistd",
      "author": "None",
      "body": "Wow. This hits close to home. Stay strong, my love. You’re not alone x",
      "created_utc": 1582379288.0,
      "score": 2,
      "context": []
    }
  ]
}