{
  "id": "f8kawn",
  "subreddit": "fuckeatingdisorders",
  "author": "TheTravelingChef",
  "created_utc": 1582511309.0,
  "title": "It's NEVER ok to make comments about someone else's body",
  "selftext": "Today I shared with my cousin that I was dedicating this year to getting fit. I corrected myself and said \"getting well, I want to be healthy\"\nHe decided it was ok to say \"yeah you were getting pretty big, it's ok to admit it\". \n\nThis is someone who knows I've been in treatment twice. I'm so fucking furious right now. It's been hours and I'm still hurt and angry. It's never ok to comment on someone's appearance, period.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f8kawn/its_never_ok_to_make_comments_about_someone_elses/",
  "score": 167,
  "num_comments": 5,
  "comments": [
    {
      "id": "filykih",
      "author": "directly_observable",
      "body": "Oh, I'm so sorry that your cousin was being such an asswipe. Sometimes people are just moronic about what they say and don't necessarily even get what they're saying. I have ADHD myself and have said some really stupid stuff (not related to other individuals bodies but still really dumb). \n\nI can definitely empathize though as my parents have made comments about my body when I've been seriously underweight and when I've gained weight. I've been in treatment twice and even well meaning comments can be really cutting (e.g. \"You look really good now\" or \"You're looking too thin how much do you weigh?\"). \n\nI'm actually visiting them this week and I'm so worried about comments because I've gained about 11lbs since I saw them. I was underweight before but now I'm at a normal weight and I'm just dreading it bc I already feel so uncomfortable about my body.\n\nI'm truly sorry though, that was really uncalled for and I hope that you can find a bit of relief from that asshole comment as time passes.\n\nAlso, if you ever need to talk you can always pm me.",
      "created_utc": 1582513497.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fim9i5n",
      "author": "insomniopath",
      "body": "I’m sorry. People are idiots. The other day my friend asked, “have you been working out?” I replied, “no” because I hadn’t been to the gym in weeks. And he said, “cause you used to be more puffy... I can tell in your arms and stuff.” Granted he was drunk so he didn’t have a filter but it was so uncomfortable.",
      "created_utc": 1582522171.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fimbm8c",
      "author": "standsure",
      "body": "What a fuckstick thing to say to someone. It's so seriously fucked up and not ok. \n\nI also hate when folks comment on food content or portion size. \n\nThose folks can burn in a fiery hell. Without sunblock.",
      "created_utc": 1582524118.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fims42k",
      "author": "AWhimsicalBee",
      "body": "Ugh, I'm sorry about this. If you can bear to, I think talking to him and telling him exactly why what he said was inappropriate and that you are really hurt and angry would be a good idea. It's one thing someone mindlessly making comments about weightloss, as that's a \"coveted\" thing in society and seen as a \"positive\" comment so understanding why it can be harmful is a bit more difficult for people to wrap their heads around, but making comments about someone gaining weight is far more socially taboo, so he should know better than to make comments like that to anyone, let alone someone who has been on your journey. What an idiot.",
      "created_utc": 1582544842.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fin0vw1",
      "author": "woodhorse2",
      "body": "Your cousin is an asshole and should stfu, period",
      "created_utc": 1582552933.0,
      "score": 7,
      "context": []
    }
  ]
}