{
  "id": "f9gspm",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1582663249.0,
  "title": "Today, I responded to my mental hunger in full.",
  "selftext": "It was one of Those Days, and I said, \"Fuck it.\" I ate a lot of things, and I ate them guilt free. I realized my brain wasn't going to shut up until I ate more, so I ate more. \n\nSuddenly, I didn't want more food. Suddenly, I could concentrate on things. Suddenly, I had energy to go about the day. \n\n^(WOW ALMOST AS IF EATING ENOUGH FOOD MAKES YOU NOT WANT MORE FOOD WHO WOULD'VE THOUGHT)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f9gspm/today_i_responded_to_my_mental_hunger_in_full/",
  "score": 156,
  "num_comments": 4,
  "comments": [
    {
      "id": "firgain",
      "author": "problematicbeing",
      "body": ":) if you do enough of these days, you body will trust you enough to not have to have every second of the day feel like it's about food.\n\nKeep it up! You did a great thing and you are strong!",
      "created_utc": 1582663834.0,
      "score": 24,
      "context": []
    },
    {
      "id": "firncpq",
      "author": "throwthistrashaway-",
      "body": "Eating regularly will work wonders in mental hunger. After restricting for so long, my first reaction to hunger is \"but I'm not supposed to eat!\" panic. Now, i can either a) respond to the hunger if i have food, or b) know it will be at most an hour or two until i can (if im in class, i cant exactly just get up and leave to buy a sandwich).",
      "created_utc": 1582667662.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fismsrn",
      "author": "OhCrumbs96",
      "body": "This is brilliant! Here's to many more days like this!\n\nThanks for the reminder that it *is* possible to get rid of the constant thoughts of food. It's easy to get swallowed up (haha 🙄) by them until they become the new normal.",
      "created_utc": 1582688067.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fisxboq",
      "author": "kimberlytheclown",
      "body": "<3 happy for u",
      "created_utc": 1582696179.0,
      "score": 1,
      "context": []
    }
  ]
}