{
  "id": "f9nhcd",
  "subreddit": "fuckeatingdisorders",
  "author": "dieanywherelse",
  "created_utc": 1582690470.0,
  "title": "i HATE hearing how long its been since people have eaten",
  "selftext": "today i went out with some friends of mine that i havent seen in a month or so. one friend is super busy and oftens talks about how little she eats. we were going to get food (which is a yikes regardless lol) and she starts talking about how she hasn’t eaten in over 24 hours because she forgot to have breakfast and then didn’t have time for lunch. it triggers me so fucking bad....it makes me want to not eat for a longer amount of time cause if she can do it, why cant i?\n\nim going to try and shoot her a text telling her to not say things like that around me but ugh ya know? :/",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/f9nhcd/i_hate_hearing_how_long_its_been_since_people/",
  "score": 150,
  "num_comments": 15,
  "comments": [
    {
      "id": "fistnkz",
      "author": "Moosycakes",
      "body": "Same here. If people don't have EDs though, they often exaggerate this stuff A LOT. They might be exaggerating the time period, or often they'll mean they didn't have any meals in that time period, but did snack or drink like, a couple lattes 😝 It's not always what it seems at face value, people tend to eat and forget 🤷 But definitely tell them you aren't comfortable talking about it anyway x",
      "created_utc": 1582693030.0,
      "score": 66,
      "context": []
    },
    {
      "id": "fit8vde",
      "author": "radioactivenoodler",
      "body": "My dad legit lost a ton of weight in like a couple weeks cause he was busy and stressed. He then carried on to tell me how he barely eats. I'm worried about him because he did a happy dance when his dinner I made him kept him under 1000 cals. I'm stressed y'all",
      "created_utc": 1582709933.0,
      "score": 35,
      "context": []
    },
    {
      "id": "fitb5rg",
      "author": "None",
      "body": "I can absolutely relate. That kind of talk stresses me the hell out, no matter if the person saying it doesn't think much about it, or is actively trying to show off. It really gets to me.\n\nThe best you can do is remind yourself, that glamourizing \"not eating because I'm soooo busy\", \"eating irregularly\" and \"lol forgot to eat\" is just about as disordered as any other ED. No one but yourself can ever be a correct reference for your own health and happiness.",
      "created_utc": 1582712998.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fitlzp2",
      "author": "standsure",
      "body": "I have boundaries in place with well meaning but really fucked up family. \"Permission to talk about food?\" \n\nBefore any conversation can happen. It's not ideal, but it's way better than it was before.",
      "created_utc": 1582723881.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fiudvdp",
      "author": "Working-Reaction",
      "body": "wow i LITERALLY logged on here to complain about the EXACT same thing! my friend is doing intermittent fasting and it almost makes me cry when she talks about it. she had a debate with another girl today and the other girl was talking about how eating 1 meal a day is ‘unhealthy and will make you fat because of starvation mode’. i literally had to put my fingers in my ears because i was panicking. is this normal for people with ed’s or am i just very sensitive?",
      "created_utc": 1582739532.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fitni6y",
      "author": "Boosey0910",
      "body": "What helps me is to try to remember ED's are not a competition.",
      "created_utc": 1582725001.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fitn4zk",
      "author": "I_own_18_penguins",
      "body": "Yeah I feel the same, especially when I get all proud for lasting 24 hours and then not eating very much when I eventually eat again",
      "created_utc": 1582724745.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fitklrw",
      "author": "DeathWish111",
      "body": "YES I really hate this. Like no one fucking cares if \"you forgot to eat.\"",
      "created_utc": 1582722797.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiusjz4",
      "author": "None",
      "body": "I get so cross when people casually mention their disordered behaviour and proceed to act like it's So Cute And Quirky :-)\n\nN O B O D Y  A S K E D  Y O U  P A T R I C E ! ! !",
      "created_utc": 1582747473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiuwozb",
      "author": "literal-_-throwaway",
      "body": "I feel this really hard. I'm trying to recover. Sometimes I really hate eating but I want to recover so I do it anyways! I get really bothered when people talk about barely eating because I would prefer to return to that lifestyle but like, I also want my body to heal from all the shit I did to it.",
      "created_utc": 1582749643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiuzdsd",
      "author": "all-mirrors",
      "body": "I know people who do this but they literally did eat loads of things and just don’t remember because it wasn’t in one full meal 🤷‍♀️",
      "created_utc": 1582751006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "five64l",
      "author": "None",
      "body": "Maybe it’s just me but it feels like people are bragging about these things when they say them and it makes me feel so upset",
      "created_utc": 1582758731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fivikoq",
      "author": "sAm_I_Am77",
      "body": "I find that people make comments like that to justify what they are about to do next...what they are going to order and/or consume. They are looking for praise for doing something that most of society idealizes. I would have said “yeah I’ve done that many times before but I had to go to treatment for it” checkmate bitch",
      "created_utc": 1582760996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiv6aql",
      "author": "SillyConnection4",
      "body": "Super normal. If you feel comfortable, it would be totally appropriate to talk to them about boundaries with diet or food talk around you.",
      "created_utc": 1582754588.0,
      "score": 2,
      "context": [
        {
          "id": "fiudvdp",
          "author": "Working-Reaction",
          "body": "wow i LITERALLY logged on here to complain about the EXACT same thing! my friend is doing intermittent fasting and it almost makes me cry when she talks about it. she had a debate with another girl today and the other girl was talking about how eating 1 meal a day is ‘unhealthy and will make you fat because of starvation mode’. i literally had to put my fingers in my ears because i was panicking. is this normal for people with ed’s or am i just very sensitive?",
          "created_utc": 1582739532.0
        }
      ]
    },
    {
      "id": "fiu4ql9",
      "author": "DedicatedtoDistance",
      "body": "Fair, but it often feels like they are. My brain convinces me other people don't eat anything and I am a fat failure when I hear things like \"I haven't eaten anything today\".",
      "created_utc": 1582735115.0,
      "score": 7,
      "context": [
        {
          "id": "fitni6y",
          "author": "Boosey0910",
          "body": "What helps me is to try to remember ED's are not a competition.",
          "created_utc": 1582725001.0
        }
      ]
    }
  ]
}