{
  "id": "fbgv2z",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1583001383.0,
  "title": "Bad body image day. Feeling bloated. Shirt isn't fitting how I like. I can either dwell on this or I can suck it up and deal.",
  "selftext": "I'm going to deal. Therapist has recommended ABT over standard CBT in my case because I'm, ahem, skeptical of standard CBT.\n\nAccept that I'm a bit bloated today. I had dessert last night (and a lot of green veggies loaded with fiber). That's okay.\n\nAccept that I'm going out to dinner tonight and the salt/carbs will result in bloating for a few days. That's okay.\n\nIt is okay to gain weight. It is hard to accept, but it is okay. Human worth is not defined by bodyfat percentage.  My husband does not care if I gain weight. My friends and family don't care if I gain weight. My pets don't care.\n\nI must accept that it is okay. I will be okay.\n\nYou too will be okay. Your body needs food. It needs nutrients to live.\n\nHave a nice day.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fbgv2z/bad_body_image_day_feeling_bloated_shirt_isnt/",
  "score": 105,
  "num_comments": 7,
  "comments": [
    {
      "id": "fj470m0",
      "author": "petitelinotte212",
      "body": "Right the f*ck on! \n\nBe gentle with yourself though, you can have compassion for the part of you that’s triggered by the normal fluctuations of your bod, maybe she just doesn’t understand your ED like you do. Maybe she’s coming from a younger, less self-aware place than you are now in. Just give her a big hug, internally, and invite her to sit in all of this okay-ness with you. Maybe she’ll feel the love ❤️",
      "created_utc": 1583001730.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fj513e1",
      "author": "sAm_I_Am77",
      "body": "Preach it sister~\nYou know how much my best friend weighed when we met? Me either.\nYou know how much my lab partner in chem class weighed? Me either.\nYou know how much my daughters best friend weighs?\nMe either.\nYou know how much my Dr, who has saved my life due to tough love weighs? Me either.\nYou know how much my favorite co-worker weighs?\nMe either\nDo they know how much I weigh? Probably not.\nDo they care? Absolutely not.\nWhy? Because it doesn’t FUCKING matter. It never has. We are the only ones that made our weight matter, no one else. We don’t ask people what they weigh before we decide if they deserve a place in our lives.\n\nI love this post so much. Thank you for the reminder. 💜",
      "created_utc": 1583021706.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fj4p208",
      "author": "Samantha039",
      "body": "I appreciate you expressing it this way! I have good days and bad and currently having a similar day to yours. We’re in this together and your an inspiration! Taking it day by day! 💖",
      "created_utc": 1583013466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj4pw7i",
      "author": "robotsintrees",
      "body": "Beautiful.",
      "created_utc": 1583014047.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj50qwd",
      "author": "yourfavoritevegan",
      "body": "This might not be helpful at all. But sometimes when I’m having these moments, I remind myself that THIS is our one chance at life and we deserve happiness as much as we wish happiness upon everyone else. In the grand scheme of things, weight doesn’t mean shit. And tight clothes don’t mean shit. I want to take advantage of my time on Earth so fuck those thoughts and fuck ED.  It takes up precious space in our minds AND in our day to day lives. Obviously these thoughts and behaviors are deep rooted and so so difficult to combat. But sometimes if I need a quick reminder, that’s what I tell myself. And it’s the truth! Our happiness is so much more important than what ED wants for us.",
      "created_utc": 1583021476.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj58awt",
      "author": "0912841",
      "body": "Beautiful thoughts OP. Proud of you for taking this challenge head-on. You are worth it, just like you said, no matter your weight. We all matter.\n\nLots of love",
      "created_utc": 1583026591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj55hg6",
      "author": "aryalaya",
      "body": "That's actually a really nice way to deal with the \"ED you\" that we all have in ourselves.. I never saw it that way, but I'll definitely try to put it like that in the future!",
      "created_utc": 1583024673.0,
      "score": 3,
      "context": [
        {
          "id": "fj470m0",
          "author": "petitelinotte212",
          "body": "Right the f*ck on! \n\nBe gentle with yourself though, you can have compassion for the part of you that’s triggered by the normal fluctuations of your bod, maybe she just doesn’t understand your ED like you do. Maybe she’s coming from a younger, less self-aware place than you are now in. Just give her a big hug, internally, and invite her to sit in all of this okay-ness with you. Maybe she’ll feel the love ❤️",
          "created_utc": 1583001730.0
        }
      ]
    }
  ]
}