{
  "id": "fcijmx",
  "subreddit": "fuckeatingdisorders",
  "author": "bumblebee-226",
  "created_utc": 1583181505.0,
  "title": "I hate that the easiest things trigger me",
  "selftext": "It’s 3:30pm, I haven’t eaten all day. I just went to open my pantry to make my 150 cal oatmeal that tastes like shit but it’s the only safe food I have rn, and my mom goes “don’t eat right now, you’ll spoil your appetite for dinner later” \n\nI’m so damn hungry but I won’t eat now. I hate my stubborn-ass disordered brain.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fcijmx/i_hate_that_the_easiest_things_trigger_me/",
  "score": 90,
  "num_comments": 6,
  "comments": [
    {
      "id": "fjawbds",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1583181840.0,
      "score": 50,
      "context": []
    },
    {
      "id": "fjbvk1d",
      "author": "Lapamasa",
      "body": "Your mom can fuck off.\n\n(I'm sorry.)",
      "created_utc": 1583202372.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fjbq1ok",
      "author": "None",
      "body": "This disease feels like an octopus that wraps around your brain sometimes. It’s so totalizing and it makes me embarrassingly fragile :(",
      "created_utc": 1583198915.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fjcj1vp",
      "author": "ImperatriceSaltea",
      "body": "First of all : don't pay attention to people like that. Unfortunately, they don't know what they're talking about and often say shit.\nSecond : I'm a master of oatmeal, this is my only safe food. You can make a lot of taste for 150 cal, other than prepackaged ones. 1 tbsp of dry oats is 20 cal. \nSo I often take 4 of them and then add any flavour I like.\nCrave tiramisu ? Add instant coffee and some cocoa powder with sweetener.\nNo ? Pistachio or Vanilla or any flavour with sweetener.\nMore creamy ?Low fat Coconut milk with shredded coconut and obviously, sweetener.",
      "created_utc": 1583222152.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fjcgtnu",
      "author": "None",
      "body": "150 calories in the afternoon is a perfectly good snack and helps prevent binges! I've started spreading my snacks in the afternoon rather than in the morning and I feel so much better. Tell your mom to mind her own food intakes instead!",
      "created_utc": 1583219563.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjc6jk9",
      "author": "whisperinglight",
      "body": "She doesn’t know what your going through. She doesn’t realize your not a child anymore. But you have to help her. When she says don’t eat that it will spoil your dinner - explain it to her. When you were a child she needed to tell you when to eat and what to eat help her to help you - this is just a snack there is no need for either of you to blow this out of proportion \nShe is looking for you to grow up but this means you talking rationally and not throwing a tantrum like the child she is treating you like it’s hard but you can do it",
      "created_utc": 1583209943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjaxanb",
      "author": "bumblebee-226",
      "body": "I appreciate this so much, thank you :)",
      "created_utc": 1583182376.0,
      "score": 15,
      "context": [
        {
          "id": "fjawbds",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1583181840.0
        }
      ]
    }
  ]
}