{
  "id": "fcu1g0",
  "subreddit": "fuckeatingdisorders",
  "author": "ketogirl98",
  "created_utc": 1583239526.0,
  "title": "Lady taking by blood triggered me, when I asked her not to",
  "selftext": "So here is the thing. Four years ago when I was greatly disordered, I weighted too little to give blood here in Sweden, which I didn’t know was a thing before I went to try to give blood. I had great blood, but since I weighted too little, they denied me. Since then I’ve gained some weight, and decided to give it another go today.\n\nThe lady asked me if I had given blood before, and I told her what I wrote above. I wrote what I thing I weight now on the form I had to fill out, and given my story she wanted t weight me there and then. She said she’d subtract about 4 lbs for my clothes and so on.\n\nI said that I don’t want to know what I weight, and asked her to allow me to weight myself with my back facing the screen. She allowed me. When I stepped down she said that it was way more than I had entered. I can’t really express how it made me feel. She then asked me if I didn’t want to know because I wanted it to be less or more than I had filled in, to which I just answered I don’t want to know, at all. She asked me how I do when I go to the doctor, and they are to prescribe a medicine based on my weight, and I just said that if that were to happen I’d just ask the doctor to not tell me my weight.\n\nI just feel very discouraged right now. Feeling like I want to prove her wrong, and lose a lot of weight to show her that I’m not that heavy. Of course my current weight is higher than my guessed morning weight, it’s the middle of the fucking day!!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fcu1g0/lady_taking_by_blood_triggered_me_when_i_asked/",
  "score": 192,
  "num_comments": 12,
  "comments": [
    {
      "id": "fjd5k2w",
      "author": "buffy-icecreamslayer",
      "body": "TALK TO HER SUPERVISOR. She’s a fucking medical professional and she should know how serious EDs are, this is unacceptable. You’re trying to help save lives and she pulls this shit!?!? I’m furious right now for you.",
      "created_utc": 1583246152.0,
      "score": 155,
      "context": []
    },
    {
      "id": "fjcx7nm",
      "author": "wheresyourheadatgirl",
      "body": "ugh fuck her thats so triggering, i'd be upset too. why did she feel the need to comment??? if you weigh enough to donate then that is fine.\n\nyou should complain! you told her you didnt want to know. sorry this happened to you. x",
      "created_utc": 1583239768.0,
      "score": 68,
      "context": []
    },
    {
      "id": "fjd5fir",
      "author": "Hotlikessauce69",
      "body": "People are fucking idiots sometimes. I cannot tell you how many times people have triggered.me because they couldn't be bothered to listen for 3 seconds.\n\nOne thing that helped me with dealing with people I didn't know very well who trigger me, is to assume they don't know how to act in public because they're family didn't raise them right. I know it's kinda mean back, but most people know that weight is a sensitive topic for some, even without having an eating disorder. Someone who draws blood should know better. \n\n\nYou would have every right to complain to her work to say that she didn't respect your health needs.",
      "created_utc": 1583246077.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fjd7xml",
      "author": "CookieCat3",
      "body": "So unprofessional. As a person who struggles with anorexia and works in medical field, I find this behaviour extremely rude. I would return and talk to her supervisor to notice this. Even if it was an \"innocent\" comment, imagine what this would have done on a much weaker person than you... binge, restricting, relapse.\n\nDon't even think about the weight and be proud you could donate the blood!",
      "created_utc": 1583247705.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fjd75a1",
      "author": "Blacknarcissa",
      "body": "She was absolutely fucking rude and you didn't deserve that at all and you should totally report her... but don't let your ED use it as an excuse to take hold.",
      "created_utc": 1583247203.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fjd7pky",
      "author": "imokayjustfine",
      "body": "That’s awful, God! There was NO NEED for her to make that sort of comment. 😤 \n\nHopefully it was thoughtlessness and not outright aggression. Either way though, I’m so sorry—and she absolutely should have known better. \n\n:( <3",
      "created_utc": 1583247566.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fjdgknb",
      "author": "Kale_n_Beets",
      "body": "I really advise you to contact blodcentralen with an email or something. When I tried first giving blood, the nurse couldn’t find a vein and told me I therefore wasn’t allowed to donate. She also added the totally unecessary comment that ”it’s probably because you’re so overweight, come back when you’ve lost 20 kg”. It was probably true but so triggering. I didn’t dare to try again until 3 years had passed. But when I went the second time, I told them the story and they really took it seriously and were sad that I hadn’t contacted them after it happened so that they could’ve spoken to the nurse.",
      "created_utc": 1583252505.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fjdfhgx",
      "author": "Firequeeeeeen",
      "body": "I’m so sorry. My ED support group all knows about that notorious PUNK IDIOT who read my weight out loud a few months ago while I donated blood and asked not to know. Here we are saving lives and they have the nerve and stupidity to trigger us!! All I can say is that your weight is gonna keep fluctuating through the hours and days and it’s just a stupid number (probably affected by how much you hydrated beforehand also) and someone out there who needed your blood is very happy that you were healthy enough to help them out. Let’s still keep donating and being amazing! ❤️❤️❤️",
      "created_utc": 1583252125.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fjdxf7i",
      "author": "petitelinotte212",
      "body": "Aaaaand this is why you were 1000% right in not. dealing. with. it. This should reinforce your resolve to strike these numbers and experiences from your life. Full stop. If people ask you questions about it, you are under no obligation to answer them. If they can't respect your request, than you can walk away. Seriously. Its not worth risking your recovery for somebody's lack of training and intrusive curiosity, even its coming from a genuine place.\n\nIts a shame that medical professionals aren't given any training and clearly don't understand ED recovery at all. I've had a million experiences like this, and its so maddening. ED's are both amongst the most prevalent mental disorders AND the most deadly. There's no excuse for her not respecting your wishes and questioning you about it. Just no excuse. Its really not hard to do. \n\nRemember your weight fluctuates throughout the day by several lbs. Your weight can fluctuate from week to week depending on hormones, water intake, all sorts of factors that have really no great effect on how you body looks. Its just a number. You're seeing a doctor who is actually trained for your ED and who knows you, medically - if you needed to lose weight to be on a healthy path, they would tell you and guide you through it. Please ignore this nurse, if you can, understand they're speaking from a place of just sheer ignorance and its no reflection on your weight or how you look. \n\nAlso, I might consider writing a letter to the blood bank and informing them how a patient like you should be treated in the future. Obviously no one there has dealt with someone with your request before, and this nurse just totally botched it. Maybe you can educate them and no one else will have to be put in this position. I'm so sorry you were.",
      "created_utc": 1583261104.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fjjq04z",
      "author": "ketogirl98",
      "body": "UPDATE: I called and got to talk to her manager yesterday. Described the situation, and I felt like she (the boss) understood, and she appologized for the way I've been treated.\n\nFun detail: I guess the boss had my file in front of her while talking to me, and could see what I weighted in at, because when I told her about what the woman had said, she said \"and that wasn't even true!\". I mean, that made me happier, but it was also triggering. I know they don't mean to make me upset, they clearly just don't understand what weight and body image can screw with an former ED-persons head.\n\nThank you all for your responses!",
      "created_utc": 1583408109.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fjfa6or",
      "author": "standsure",
      "body": "Absolutely report her. That is some fucked up shit. Seriously I don't blame you for having strong feelings, I would be all over the shop if someone said something like that to me. \n\nI won't allow myself on a scale now unless I am really confident that the person respects my boundaries. I learnt that the (very) hard way. The scale is not my friend and numbers are not allowed in any part of my consciousness.",
      "created_utc": 1583287552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjdxme0",
      "author": "petitelinotte212",
      "body": "for real, me too. Its traumatic enough to be weighed, they can't handle a simple request without giving you hassle? So unacceptable.",
      "created_utc": 1583261214.0,
      "score": 20,
      "context": [
        {
          "id": "fjd5k2w",
          "author": "buffy-icecreamslayer",
          "body": "TALK TO HER SUPERVISOR. She’s a fucking medical professional and she should know how serious EDs are, this is unacceptable. You’re trying to help save lives and she pulls this shit!?!? I’m furious right now for you.",
          "created_utc": 1583246152.0
        }
      ]
    }
  ]
}