{
  "id": "fhyfr2",
  "subreddit": "fuckeatingdisorders",
  "author": "Wigforfire",
  "created_utc": 1584100375.0,
  "title": "If you get sick you need to eat!",
  "selftext": "Just a friendly PSA —and more than anything a good mantra for myself— if you get sick, whether it be with Coronavirus, the flu, ANYTHING, you have to keep eating. I know that there’s been a lot of panic about stocking up on food and water, but remember that if any of you get sick you have to take care of your bodies. Your bodies will be fighting hard to fend off any virus you get, it will be working really hard for you, even if you’re not feeling like it is. Remember to treat your body kindly for working to keep you alive if you get sick. Don’t worry about exercising; don’t let a poor appetite become an excuse for your ED to wiggle its way into your head. You are stronger than your ED and you have to keep your body strong to fend off illness. All of you deserve to eat, all of you deserve to be healthy and stay healthy, and if you get sick all of you deserve to rest and get better.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fhyfr2/if_you_get_sick_you_need_to_eat/",
  "score": 148,
  "num_comments": 11,
  "comments": [
    {
      "id": "fke91ql",
      "author": "pokeupokeu",
      "body": "yes please! i got a really really bad case of this flu this winter and i only made it worse by restricting and then purging while i had a fever. Try and be kind to yourself when youre sick and remember you NEED food and water and electrolytes to keep your body to fight through this. The flu was the worst thing to happen to me in a long time and i only made it worse by not taking care of myself and it made me sick and miserable for weeks after when i was still weak and recovering from a sickness i didnt try and help myself get through the first time.",
      "created_utc": 1584108098.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fkf09pe",
      "author": "Discalced-diapason",
      "body": "Also, if the only way you can manage to fuel yourself for a short period of time is by drinking Boost, Ensure, or any other supplement drink like that, it’s OK. Do whatever you can to give your body fuel in whatever way it can handle it in that moment. \n\nI had a nasty sinus infection at the start of this year and the thought of food made me very nauseated, both because of being sick and then because of the antibiotics. I literally lived off of Orgain for a few days until I could manage other foods. But fueling myself in whatever way I could I think made my recovery quicker than it would’ve been had I not found a tolerable way to get nutrition.",
      "created_utc": 1584124394.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fke5ti9",
      "author": "Sareeee48",
      "body": "This is so important. I got sick with the stomach flu last week and couldn’t hold anything down other than liquids and bland foods that didn’t upset the stomach. It sucked but I knew I had to.",
      "created_utc": 1584105917.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fkfejyd",
      "author": "DisabledMuse",
      "body": "Yes yes yes. Have a bunch of chicken noodle soup or easy foods and do what you can when you are sick. I want you all to survive and thrive <3",
      "created_utc": 1584132666.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fkfvl4m",
      "author": "0912841",
      "body": "I hope everyone here is doing their best, taking care of themselves and asking for help if needed.\n\nStay healthy everyone 💜😘",
      "created_utc": 1584143579.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkg7uih",
      "author": "I_SAID_NO_CHEESE",
      "body": "SECOND THIS. \n\nWhen I got on my meal plan, one of the first things I noticed was that my immune system became super charged. I had a cold for maybe a day and half and never got over anything so quickly in my LIFE. \n\nEAT. IT MAKES YOU STRONGER. NOT EATING WILL INCREASE YOUR RISK OF GETTING SICK.",
      "created_utc": 1584152156.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkiojsu",
      "author": "LowkeyMisomaniac",
      "body": "My city is on lockdown and I’m really struggling with all the bad thoughts. I even had to force myself to stock up on some foods.",
      "created_utc": 1584224895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkf70a7",
      "author": "Wigforfire",
      "body": "Im so proud of you for doing that! Stay strong 💚 your body appreciates it",
      "created_utc": 1584128315.0,
      "score": 1,
      "context": [
        {
          "id": "fke5ti9",
          "author": "Sareeee48",
          "body": "This is so important. I got sick with the stomach flu last week and couldn’t hold anything down other than liquids and bland foods that didn’t upset the stomach. It sucked but I knew I had to.",
          "created_utc": 1584105917.0
        }
      ]
    },
    {
      "id": "fkj3lwp",
      "author": "Wigforfire",
      "body": "Its good you could stock up. Im proud of you. Stay safe!",
      "created_utc": 1584235344.0,
      "score": 2,
      "context": [
        {
          "id": "fkiojsu",
          "author": "LowkeyMisomaniac",
          "body": "My city is on lockdown and I’m really struggling with all the bad thoughts. I even had to force myself to stock up on some foods.",
          "created_utc": 1584224895.0
        }
      ]
    },
    {
      "id": "fkf7klu",
      "author": "Sareeee48",
      "body": "Hey thanks! It was actually the point where I hit my lowest weight to date and realized I had to make a change. So I’m pretty grateful for getting sick in a weird way lmao.",
      "created_utc": 1584128627.0,
      "score": 3,
      "context": [
        {
          "id": "fke5ti9",
          "author": "Sareeee48",
          "body": "This is so important. I got sick with the stomach flu last week and couldn’t hold anything down other than liquids and bland foods that didn’t upset the stomach. It sucked but I knew I had to.",
          "created_utc": 1584105917.0
        },
        {
          "id": "fkf70a7",
          "author": "Wigforfire",
          "body": "Im so proud of you for doing that! Stay strong 💚 your body appreciates it",
          "created_utc": 1584128315.0
        }
      ]
    },
    {
      "id": "fkf7tlq",
      "author": "Wigforfire",
      "body": "Sometimes blessings come in strange disguises, especially when it comes to realizing the reality of an ED. I wish you the best of luck with your recovery and with mending your body and your mind",
      "created_utc": 1584128767.0,
      "score": 1,
      "context": [
        {
          "id": "fke5ti9",
          "author": "Sareeee48",
          "body": "This is so important. I got sick with the stomach flu last week and couldn’t hold anything down other than liquids and bland foods that didn’t upset the stomach. It sucked but I knew I had to.",
          "created_utc": 1584105917.0
        },
        {
          "id": "fkf70a7",
          "author": "Wigforfire",
          "body": "Im so proud of you for doing that! Stay strong 💚 your body appreciates it",
          "created_utc": 1584128315.0
        },
        {
          "id": "fkf7klu",
          "author": "Sareeee48",
          "body": "Hey thanks! It was actually the point where I hit my lowest weight to date and realized I had to make a change. So I’m pretty grateful for getting sick in a weird way lmao.",
          "created_utc": 1584128627.0
        }
      ]
    }
  ]
}