{
  "id": "fibar1",
  "subreddit": "fuckeatingdisorders",
  "author": "anonymouseds",
  "created_utc": 1584151865.0,
  "title": "Everyone was right - my therapist is horrible and fuels my eating disorder.",
  "selftext": "I have previously shared some interactions I had with my therapist, I should have listened and cancelled my appointment with her. Instead of getting help, \"therapy\" has fueled my eating disorder. \n\nTW for weight, I am 5'4 and have been right around 112 lbs for the past 6 months. I religiously track calories and have a very unhealthy relationship with food, the scale, and my body. I have low self esteem and self worth. I went to therapy per the request of my physician after losing 70 lbs and still feeling the need to lose more weight. \n\nMy therapist had anorexia and is recovered and I feel our sessions are fueling my eating disorder. First she encouraged me to eat 1000 calories per day (less than what I was already consuming), then she told me I'm not ready to stop tracking calories and I need to keep tracking and show her at my weekly appointments. \n\nI decided to stop tracking anyways - I also was out of town and went out to eat for several meals (not my choice). I'm sure some of it is water weight, but the scale says 119 now - I am freaking out. I shared my anxiety of this in therapy today. My therapist recommended that I diet and get back to my lower weight if that helps my anxiety. She told me she would let me know if I get to a bad place with my weight, and as of right now she isn't concerned (I haven't shared my height or weight with her, she is going by looks). So now I feel fatter than I already did - my therapist who told me I have an eating disorder is encouraging me to lose weight based on the way I look. Obviously I have enough fat on me to lose more. I feel so triggered. Back to calorie counting, I'm so upset with myself for trying to eat normally.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fibar1/everyone_was_right_my_therapist_is_horrible_and/",
  "score": 136,
  "num_comments": 18,
  "comments": [
    {
      "id": "fkg7sr9",
      "author": "SillyConnection4",
      "body": "REPORT HER to her licensing board and the company she works for. This is so horrible. I’m so sorry this happened to you. Malpractice on so many levels.",
      "created_utc": 1584152119.0,
      "score": 151,
      "context": []
    },
    {
      "id": "fkghrc9",
      "author": "SecretIdentity8594",
      "body": "Honey, no, please don’t start tracking and dieting again!\n\nYour therapist sounds awful but I expect it’s mostly just her ED talking, much like how my mum still says disordered or similarly mean/stupid things sometimes despite recovering.\n\nPlease don’t go back to her, and find a new therapist instead. Please stay strong and try not to hurt yourself by losing weight.\n\nYou aren’t fat, I promise. ❤️\n\nYou don’t need to lose more weight. Trust me. 💕\n\nI promise you look lovely as you are and I support you in getting better. \\^\\_^\n\nEating normally was the best thing you could’ve done and I’ll be so proud of you if you continue. <3",
      "created_utc": 1584160132.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fkgl8vt",
      "author": "standsure",
      "body": "I think this shows how far your recovery has grown to be able to recognise what's going on without internalising other peoples toxicity. \n\nSo I think this is a win for you right now. \n\nI haven't been on a scale in over 10 years and I have to say staying free of the numbers is a huge relief for me. I know the power those numbers have over me - there is no magic number that can grant me the power of self acceptance. \n\nYou are doing amazing. I'm proud of you.",
      "created_utc": 1584163472.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fkgjd3l",
      "author": "basicallyaballerina",
      "body": "We are roughly the same height and for me 112 isn’t a healthy weight! I personally need to be more and I’m betting you do too. \nI’m questioning how recovered your therapist is at this point tbh",
      "created_utc": 1584161621.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fkgi903",
      "author": "watch_earthlings",
      "body": "Legit, nobody warns you how many BAD therapists there are out there. Find a new one, and please keep trying until you find a good one. & Don’t let her get to you. You deserve better!",
      "created_utc": 1584160579.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fkgh8ut",
      "author": "cottonvoile",
      "body": "Don't go back!! That's seriously terrible. I'm sorry that happened, it takes so much guts to go to a therapist and try to recover to begin with and you get hit with that. If you feel able to, maybe you can start seeing another therapist? I'm not from the US so I don't know how hard it is to get a refrrral to an ED specialist.",
      "created_utc": 1584159675.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fkh0taa",
      "author": "Working-Reaction",
      "body": "wow that is so disgusting. how can a therapist tell at ED patient to restrict, lose weight and count calories? she is beyond disgusting and you should never see her again!",
      "created_utc": 1584183849.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fkgumlg",
      "author": "None",
      "body": "Wow she shouldn't be a therapist for people with eating disorder.\n\nA 7lbs fluctuation is totally normal. Menstrual cycles hormone changes, a routine change (like going out of town) and anxiety are all triggers of weight changes. Do not beat yourself up on that. Instead focus on the good times you had when you didn't have to worry about tracking and obsessing over calories!\n\nAnd do NOT lower your calories, 1000 calories is likely to trigger more and more negative ED behaviour. Report her and find a therapist that will give you positive coping skills and that will listen to your concern instead of forcing something that you feel negatively about. Good luck and congratulations on seeking help for yourself, you totally deserve it ❤️",
      "created_utc": 1584175101.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fkh09ls",
      "author": "acousticbruises",
      "body": "Jfc. Report her, she should not have her license. When you report her you can also request a list of legit therapists. You can do this.",
      "created_utc": 1584183111.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fkgzrgm",
      "author": "daybeforetheday",
      "body": "I agree with the others- report her. You deserve the best care possible- and this is the opposite of that.",
      "created_utc": 1584182412.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fkh1b1b",
      "author": "pokeupokeu",
      "body": "What the fuck do not go back to this therapist please report her and find a therapist that specializes in ed and a nutritionist that is incredibly worrying and sounds so grating on your mental health",
      "created_utc": 1584184510.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fkhl13j",
      "author": "anonymouseds",
      "body": "Thank you everyone for the kind words, encouragement, and recommendations. I feel pretty broke right now and my unhealthy coping strategy seems to be restricting. I just want to feel normal again, hopefully I will get there. I feel like I'm struggling and no one cares, not even the therapist who I shared my feelings and struggles with, the professional that was supposed to help me feel normal again. It's a pretty crappy feeling.",
      "created_utc": 1584201097.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fkhikqt",
      "author": "None",
      "body": "This is wrong on so many levels. Therapist aren't supposed to give advice or tell you what to do EVEN with topics that are not sensitive. But telling an eating disorder patient to lose weight or restrict without proper supervision (like contacting your GP or treatment team) is dangerous as well, not just plain unprofessional.",
      "created_utc": 1584199676.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkhy0zb",
      "author": "itwastheoranges",
      "body": "Holy shit. No. Please, update with the results of you reporting her.\n\nOn the other hand, I hope you feel some pride in yourself. Even if you feel like you're freaking out about the few pounds you gained, the fact that you made this post shows that you actually have a good instinct that you are in no way at a high weight and that you should NOT be trying to restrict. That's pretty amazing.",
      "created_utc": 1584208106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkgdzjj",
      "author": "TinyRhymey",
      "body": "Seriously though! I went through your previous posts after just having seen this one and it’s an absolute nightmare the things she’s said. I’m happy to see that you’ve come to this realization, but if she goes unreported I’m worried about what she’s saying to other clients.",
      "created_utc": 1584156919.0,
      "score": 35,
      "context": [
        {
          "id": "fkg7sr9",
          "author": "SillyConnection4",
          "body": "REPORT HER to her licensing board and the company she works for. This is so horrible. I’m so sorry this happened to you. Malpractice on so many levels.",
          "created_utc": 1584152119.0
        }
      ]
    },
    {
      "id": "fkg8txp",
      "author": "robotsintrees",
      "body": "This! Holy shit, OP, please don't follow her advice.",
      "created_utc": 1584152891.0,
      "score": 17,
      "context": [
        {
          "id": "fkg7sr9",
          "author": "SillyConnection4",
          "body": "REPORT HER to her licensing board and the company she works for. This is so horrible. I’m so sorry this happened to you. Malpractice on so many levels.",
          "created_utc": 1584152119.0
        }
      ]
    },
    {
      "id": "fkgx5xr",
      "author": "sisIi3",
      "body": "This!\n\n\nOP, you’re doing amazing 💖",
      "created_utc": 1584178712.0,
      "score": 6,
      "context": [
        {
          "id": "fkg7sr9",
          "author": "SillyConnection4",
          "body": "REPORT HER to her licensing board and the company she works for. This is so horrible. I’m so sorry this happened to you. Malpractice on so many levels.",
          "created_utc": 1584152119.0
        }
      ]
    },
    {
      "id": "fkh4z3d",
      "author": "basicallyaballerina",
      "body": "It’s also okay to gain weight! And you need way more than 1000 bc that’s still restricting",
      "created_utc": 1584188758.0,
      "score": 3,
      "context": [
        {
          "id": "fkgumlg",
          "author": "None",
          "body": "Wow she shouldn't be a therapist for people with eating disorder.\n\nA 7lbs fluctuation is totally normal. Menstrual cycles hormone changes, a routine change (like going out of town) and anxiety are all triggers of weight changes. Do not beat yourself up on that. Instead focus on the good times you had when you didn't have to worry about tracking and obsessing over calories!\n\nAnd do NOT lower your calories, 1000 calories is likely to trigger more and more negative ED behaviour. Report her and find a therapist that will give you positive coping skills and that will listen to your concern instead of forcing something that you feel negatively about. Good luck and congratulations on seeking help for yourself, you totally deserve it ❤️",
          "created_utc": 1584175101.0
        }
      ]
    }
  ]
}