{
  "id": "fljd74",
  "subreddit": "fuckeatingdisorders",
  "author": "Thekisk",
  "created_utc": 1584657335.0,
  "title": "Do you ever have the desire to get worse not better?",
  "selftext": "Do you ever want to relapse? Do you ever want to end up in the hospital? Do you ever want to end up in a high level of care? What do you think the root cause of this is? Is it the eating disorder trying to pull us back into it?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fljd74/do_you_ever_have_the_desire_to_get_worse_not/",
  "score": 130,
  "num_comments": 16,
  "comments": [
    {
      "id": "fkzm5pz",
      "author": "standsure",
      "body": "Yes. \n\nYes. \n\nSometimes, yes. \n\n\nWhen I was in hospital it was the only time folks were kind to me. \n\nI got attention. My eating disorder is all about trying to win the approval of really unwell people who can't and never will. \n\nAlso to be invisible. \n\nAlso, to be so unattractive I would never be raped again. \n\nAlso, also, long buried anger.  \n\nThere's some other stuff in there too, but this is the skeleton. NPI. \n\nRecovery is not linear. It's like a tide, good days and less fun ones.",
      "created_utc": 1584674303.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fkz3xdp",
      "author": "robotsintrees",
      "body": "The eating disorder is absolutely trying to kill you, and it will stop at nothing to do so, like constantly grabbing at your heels and trying to drag you down and destroy you. It has an animalistic need to survive, and the irony is, it can't keep living without a host to feed off of, so it keeps you in a state of wanting to die but not.  \nI've been in and out of hospitals more times than I can remember, and nearly every time it's been \"well, I'm here now, might as well get as sick as possible and give up\". Currently in hospital AGAIN, and this time, I don't feel that way. I want to get out of here, and back to my life, so I'm not fighting my treatment team, not listening to ED, and finally moving forward.",
      "created_utc": 1584662229.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fkzkbnw",
      "author": "liketobeyou",
      "body": "absolutely. literally every single day. i pray to have a sudden relapse that’s awful and lands me in the hospital",
      "created_utc": 1584673034.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fkzociy",
      "author": "cocoakobra",
      "body": "Every single day I think about going back into my disorder. I think about being sickly and bony. I think about people being worried about me and doting on me because I’m ill. I think about lying in a hospital bed and having my only problem in life being my deadly illness.\n\nBut I don’t go back to it because it’s never been as idealistic as it seems in my head. I’ve been inpatient 3 times and each time it’s happened, it wasn’t what my disorder promised. It was misery in a way I didn’t want. It was isolation and heartbreak. It was hurting others more than I hurt myself. I don’t go back because I love the people in my life too much to put them through my hell again. I don’t go back because if I can’t do it for me, I’ll do it for them, and one day I’ll be able to do it for me. \n\nSorry to get kinda deep on ya but recovery is a precious thing to me.",
      "created_utc": 1584675878.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fkznep5",
      "author": "phosphatidylserine_",
      "body": "1000% yes. every single day. for every single fucking meal - especially now with my anxiety acting up because of the pandemic, I want to just dive right back into my shitty coping mechanisms. don't worry you're not alone.",
      "created_utc": 1584675193.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fkznw8b",
      "author": "Sareeee48",
      "body": "Today I read that anorexia is in a way, our desire to be a child above an adult because it’s a self centered illness in a way; and it’s so true too because I never had my shit together with my eating disorder, I was too worried about food and my body above my relationships and school and work. I needed to be taken care of and it has always been that way for as long as I’ve been sick (which is A REALLY LONG TIME). So for me, every time I’d try to get better in the past by slowly bumping up calories or reintroducing small amounts of trigger foods or exercising less, people always said I was doing a good job and worried less; to my sick brain, that made me think they were abandoning me in a sense. Like if people aren’t worried about me then they don’t love me  and won’t take care of me so the only thing to do is to get sicker. I mean, a lot of this was subconscious but I’ve been thinking about it a lot since I grew up extremely poor and in a toxic environment, and the only time I caught attention was when I acted out (which included bawling because I was so fucking hungry). If I’m too obsessed with my body, food and restriction, then I have no time to take responsibility for my own life, including delving into and resolving my own trauma.",
      "created_utc": 1584675544.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fkzmkog",
      "author": "Gees_sass",
      "body": "I meannn I constantly want to be smaller, and we all know how that goes",
      "created_utc": 1584674599.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkzwe6w",
      "author": "fabs1171",
      "body": "Yes!!! Because it is so comforting in these virus filled times",
      "created_utc": 1584682481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl0qr9l",
      "author": "MoosieGoose",
      "body": "Pretty much the entire time I've had an ED I felt like this. Recovery made it better, easier to ignore, but didn't take it away. When I was younger all I wanted was hospitalization, but as I grew up I realized how much they cost & felt too shitty even for that.  Mainly just deal with it at this point, it's part of my life. I can hide it pretty well, at least I think so.\n\nI recently went 5 years of solid recovery. Had hobbies and interests and actually took care of things I'd been ignoring forever. Very interesting, but I always felt like something was missing or that I wasn't doing what I should be doing. \n\nAnd then something bad happens and all you can think is \"this time I'll make it count\".\n\nIt ain't easy, friend.",
      "created_utc": 1584713633.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkzkjy5",
      "author": "None",
      "body": "It’s the reality in anorexia. AN is egosyntonic, unlike most other mental illnesses (e.g. depression, bulimia, schizophrenia). \n\nI also think we value being injured by restricting, as a sign of our success in a weird way? It’s very weird and hard to explain, especially to our family members.",
      "created_utc": 1584673191.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fl15ynu",
      "author": "lonleybottleofranch",
      "body": "Yea.",
      "created_utc": 1584722647.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fl20zro",
      "author": "Working-Reaction",
      "body": "i think there is an element of wanting to prove to others how sick you are. we live in a society where people who are thin are praised for their self-control, getting worse proves how much ‘control’ you have even though in reality, we have no control.",
      "created_utc": 1584740522.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fl0shtl",
      "author": "gretchenweinershair",
      "body": "\" Recovery is not linear. It's like a tide, good days and less fun ones. \"\n\nSo well said, thank you for articulating it that way.",
      "created_utc": 1584714761.0,
      "score": 4,
      "context": [
        {
          "id": "fkzm5pz",
          "author": "standsure",
          "body": "Yes. \n\nYes. \n\nSometimes, yes. \n\n\nWhen I was in hospital it was the only time folks were kind to me. \n\nI got attention. My eating disorder is all about trying to win the approval of really unwell people who can't and never will. \n\nAlso to be invisible. \n\nAlso, to be so unattractive I would never be raped again. \n\nAlso, also, long buried anger.  \n\nThere's some other stuff in there too, but this is the skeleton. NPI. \n\nRecovery is not linear. It's like a tide, good days and less fun ones.",
          "created_utc": 1584674303.0
        }
      ]
    },
    {
      "id": "fkz5yzp",
      "author": "Thekisk",
      "body": "Thank you for perfectly explaining this feeling for me. I wish you all the luck in the world. I know how hard it is but you can beat it.",
      "created_utc": 1584663527.0,
      "score": 9,
      "context": [
        {
          "id": "fkz3xdp",
          "author": "robotsintrees",
          "body": "The eating disorder is absolutely trying to kill you, and it will stop at nothing to do so, like constantly grabbing at your heels and trying to drag you down and destroy you. It has an animalistic need to survive, and the irony is, it can't keep living without a host to feed off of, so it keeps you in a state of wanting to die but not.  \nI've been in and out of hospitals more times than I can remember, and nearly every time it's been \"well, I'm here now, might as well get as sick as possible and give up\". Currently in hospital AGAIN, and this time, I don't feel that way. I want to get out of here, and back to my life, so I'm not fighting my treatment team, not listening to ED, and finally moving forward.",
          "created_utc": 1584662229.0
        }
      ]
    },
    {
      "id": "fl0ntis",
      "author": "CrawlingUpHerLeg",
      "body": "So well said. I’ll be using your metaphor to help explain this to my bf who doesn’t always understand the confusing desire to destroy myself, though he tries to. Thank you and all the best to you and your recovery process.",
      "created_utc": 1584711607.0,
      "score": 3,
      "context": [
        {
          "id": "fkz3xdp",
          "author": "robotsintrees",
          "body": "The eating disorder is absolutely trying to kill you, and it will stop at nothing to do so, like constantly grabbing at your heels and trying to drag you down and destroy you. It has an animalistic need to survive, and the irony is, it can't keep living without a host to feed off of, so it keeps you in a state of wanting to die but not.  \nI've been in and out of hospitals more times than I can remember, and nearly every time it's been \"well, I'm here now, might as well get as sick as possible and give up\". Currently in hospital AGAIN, and this time, I don't feel that way. I want to get out of here, and back to my life, so I'm not fighting my treatment team, not listening to ED, and finally moving forward.",
          "created_utc": 1584662229.0
        }
      ]
    },
    {
      "id": "fl16pav",
      "author": "Thekisk",
      "body": "With all these replies, It’s comforting to know i’m not alone.",
      "created_utc": 1584723058.0,
      "score": 2,
      "context": [
        {
          "id": "fkznep5",
          "author": "phosphatidylserine_",
          "body": "1000% yes. every single day. for every single fucking meal - especially now with my anxiety acting up because of the pandemic, I want to just dive right back into my shitty coping mechanisms. don't worry you're not alone.",
          "created_utc": 1584675193.0
        }
      ]
    }
  ]
}