{
  "id": "fmm400",
  "subreddit": "fuckeatingdisorders",
  "author": "olive_james",
  "created_utc": 1584823463.0,
  "title": "Is anybody else uncomfortable with this much food in the house?",
  "selftext": "I normally have very little food in the house because if it’s here I am scared I’ll eat it. Because of the virus, my boyfriend and I have stocked up a little in case we can’t leave. Does this make anybody else nervous and stressed out?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fmm400/is_anybody_else_uncomfortable_with_this_much_food/",
  "score": 143,
  "num_comments": 18,
  "comments": [
    {
      "id": "fl4z3df",
      "author": "eardingu",
      "body": "Yes, I already ate half of it because when there's food it has to go. Let's just say I'm not doing good these days.",
      "created_utc": 1584824808.0,
      "score": 43,
      "context": []
    },
    {
      "id": "fl534oe",
      "author": "None",
      "body": "Ridiculously stressed out. I went for a Diet Coke run a few hours ago and all the shelves were empty. I seriously planned on making a cake today, got butter out and everything, but the store was out of flour and bread. What if I need bread next week and have to make it myself? Should I waste flour and eggs on this? Should I skip dinner in case I can’t find food in a few months? \n\nIt’s such a downward spiral that I can barely enter my kitchen. Also I’m out of Diet Coke so what’s the point in anything?",
      "created_utc": 1584827415.0,
      "score": 30,
      "context": []
    },
    {
      "id": "fl544m3",
      "author": "jh1487",
      "body": "I missed the time to stock up, and I fucking hate doing it, so I’ve gotten down to almost nothing and avoiding what I do have.\n\nThis all blows ❤️",
      "created_utc": 1584828057.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fl59my0",
      "author": "bittersuccubus",
      "body": "YES OMG IT’S SO AWFUL",
      "created_utc": 1584831648.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fl5g86p",
      "author": "None",
      "body": "God, yes. I was at Dollarama with my roommate and dissociating hard while looking at the cookie section. Needless to say I didn’t buy anything there, even though I needed to.",
      "created_utc": 1584835991.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fl5qw4c",
      "author": "zerocaloriewater",
      "body": "yeah. after losing my job, i’ve just been staring at my pantry and fasting instead because the thought of emotionally eating (which usually brings me joy) makes me stomach churn in a really anxious way knowing at any moment it’ll run out and i will face food insecurity on top of my eating disorder so... one day i will have the courage to create and stick to a sustainable meal plan... but not today. BUT I AM EATING THREE MEALS TOMORROW AS A START TO THE NEW WEEK SO MAYBE??? stay tuned 👁👄👁🤚",
      "created_utc": 1584843413.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fl5vy8s",
      "author": "liketobeyou",
      "body": "yes. i’m 15 so still living with my parents, and it’s hard enough having so much food all the time but now that there’s not school i’m terrified being surrounded by calories all the time. i’ve been eating so so much and i know i’m gaining and i just feel horrible and disgusting",
      "created_utc": 1584847126.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fl5w8b8",
      "author": "lothloloki",
      "body": "Yes. This is a nightmare.",
      "created_utc": 1584847336.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl5yonv",
      "author": "thisisyourthrowaway",
      "body": "The only reason I'm even semi-managing is because most of the food that I bought has to be cooked and prepared.  I'm not a big fan of cooking. I did this on purpose, I knew I could very easily gain weight during this time.  I am eating the stuff that doesn't have to be cooked though....",
      "created_utc": 1584849241.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl61r57",
      "author": "None",
      "body": "Hard yes.",
      "created_utc": 1584851735.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl7ncg5",
      "author": "None",
      "body": "Hard yes. There’s so much food and I’m tempted to binge on it, but at the same time, I feel guilty for eating any of it because it’s like I need to hoard it in case I can’t get more. Growing up my family would eat all of something when I wasn’t home so I couldn’t have it, so I had to eat all of something if I wanted to get any. I have to keep buying things like steel cut oats and dried beans that are boring and take a long time to cook just so I can’t shovel them in at 2 A.M. and then feel guilty and waste it all purging.",
      "created_utc": 1584905320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl62sgr",
      "author": "weckyweckyonmyleggy",
      "body": "I literally sleep next to the fridge .-. The first few days I binged but I panicked thinking I would eat all the food and my mom would see and I don’t want to be fat returning to school so I got my shet together-ish 🤷🏻‍♀️",
      "created_utc": 1584852624.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fl6kapg",
      "author": "Wen-D-Torrence",
      "body": "My stash is for my teen - bagel bites, hot pockets, doritos. Those aren't my personal go-tos. The rest of what we have is practical: frozen proteins, rice, pasta...and I won't cook to b/p. I do have a rather HUGE stash of sugar free gum and am convinced that you can OD yourself into a headache/nausea from the stuff. If I die early it'll be from xylitol, not coronaV.",
      "created_utc": 1584872814.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fla1hcu",
      "author": "AustinDeepspace",
      "body": "I Feel weird, because it leads often to snacking and then non stop eating for horrible amount of time. Its mostly because I am used to not having access to food at school/ during my day unless its pre made meal to take with me and so I just have the need to stuff my face while I can. Of course we all know where all that food is gonna go.\n\n(It hasn´t happened yet, for now. But I know from past experiences, I will be tempted.)",
      "created_utc": 1584974529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fl68mwl",
      "author": "MuchoMarsupial",
      "body": "Idk. It's weird. Right now I'm hoarding food but not eating it. Essentially have to force myself to eat anything now. My fridge and pantry have never been this full.",
      "created_utc": 1584858272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl6jmdi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584871931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl6fvw8",
      "author": "None",
      "body": "Yeah I go from being too afraid to eat anything in case we need it to b/ping it.",
      "created_utc": 1584866998.0,
      "score": 4,
      "context": [
        {
          "id": "fl534oe",
          "author": "None",
          "body": "Ridiculously stressed out. I went for a Diet Coke run a few hours ago and all the shelves were empty. I seriously planned on making a cake today, got butter out and everything, but the store was out of flour and bread. What if I need bread next week and have to make it myself? Should I waste flour and eggs on this? Should I skip dinner in case I can’t find food in a few months? \n\nIt’s such a downward spiral that I can barely enter my kitchen. Also I’m out of Diet Coke so what’s the point in anything?",
          "created_utc": 1584827415.0
        }
      ]
    },
    {
      "id": "fl6jrlb",
      "author": "yogamommansb",
      "body": "W/out too much detail, where-bouts do you live that you can't stock up/refill regular foods? I'm in florida/east coast and our stores, disheveled as they are, still have food. \n\nBlows, indeed...agree.",
      "created_utc": 1584872120.0,
      "score": 1,
      "context": [
        {
          "id": "fl544m3",
          "author": "jh1487",
          "body": "I missed the time to stock up, and I fucking hate doing it, so I’ve gotten down to almost nothing and avoiding what I do have.\n\nThis all blows ❤️",
          "created_utc": 1584828057.0
        }
      ]
    },
    {
      "id": "fl6s2tx",
      "author": "jh1487",
      "body": "I’m in a major Texas city and whole aisles get decimated within the first hour or so and I haven’t made it in that timeframe (I start work the same time most stores open now). The supply chain hasn’t caught up yet (it’s been a little over a week since the panic buying started here), and people haven’t slowed down. I just ran out of some staple exchanges and tried two stores yesterday and came up empty because the aisles were empty. :/",
      "created_utc": 1584881573.0,
      "score": 1,
      "context": [
        {
          "id": "fl544m3",
          "author": "jh1487",
          "body": "I missed the time to stock up, and I fucking hate doing it, so I’ve gotten down to almost nothing and avoiding what I do have.\n\nThis all blows ❤️",
          "created_utc": 1584828057.0
        },
        {
          "id": "fl6jrlb",
          "author": "yogamommansb",
          "body": "W/out too much detail, where-bouts do you live that you can't stock up/refill regular foods? I'm in florida/east coast and our stores, disheveled as they are, still have food. \n\nBlows, indeed...agree.",
          "created_utc": 1584872120.0
        }
      ]
    }
  ]
}