{
  "id": "ft10vk",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1585752122.0,
  "title": "Took this week to face a couple of fear foods that I’ve been craving for far too long. Ham and cheese sandwiches and a full serving of PB on a sandwich. I’m kind of over them now and I thought I’d never see the day.",
  "selftext": "A couple weeks ago I was salivating at the thought of these favorite sandwiches of mine. This week I said fuck it, might as well TRY to recover in quarantine. First day I ate 3 sandwiches of each lol. The. The next day, just one. Then after, open faced sandwiches because I wanted to make room for more veggies and not just eat sandwiches all day. Now, I have them prepped in the freezer but I honestly want to make a frittata. I might just eat one though with the frittata.\n\nThis is great. The feeling of my body knowing it’s there and it isn’t “forbidden” which would make me eat all or nothing. \n\nMy next fear food to accomplish? Maybe donuts. That will definitely be a hard one though.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ft10vk/took_this_week_to_face_a_couple_of_fear_foods/",
  "score": 122,
  "num_comments": 8,
  "comments": [
    {
      "id": "fm53krd",
      "author": "boba-boba",
      "body": "It's so funny how that works. The one I can remember was english muffins. Tried them, survived, and then I couldn't stop eating them for a week. Now I enjoy them normally, but I can't believe I was so afraid of an english muffin.\n\nCongrats on the progress!",
      "created_utc": 1585765698.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fm4ti4b",
      "author": "None",
      "body": "haha amazing. This happened to me too. Crisps, cheesecake and chocolate... I realised they weren't actually that tasty. Like, 3 mouthfuls can be glorious and then it just becomes boring. I don't know who I am. :D It made some stuff more ok for me to really enjoy them. Once in a while a really stodgy pizza is just ace. Or a hot pudding with ice cream. But it's not like I go around constantly wanting it. It's a very weird experience!",
      "created_utc": 1585760515.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fm4soos",
      "author": "petitelinotte212",
      "body": "That is awesome! Damn, you breezed right through that in 3 days lol. I'd still take it slow, but it  sounds like this quarantine is affording you the time to make some great progress!",
      "created_utc": 1585760089.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fm55ol3",
      "author": "Wen-D-Torrence",
      "body": "Brilliant!",
      "created_utc": 1585766794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm5opvh",
      "author": "PM_ME_YER_SHIBA_INUS",
      "body": "Look at you, showing that anxiety who's boss.",
      "created_utc": 1585776967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm5t2qh",
      "author": "saccharinekitty",
      "body": "I just had a toasted ham and cheese sandwich today, probably the best part of my day honestly lol",
      "created_utc": 1585779399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm4uz8y",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1585761303.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fm50gdw",
      "author": "Brewzz95",
      "body": "Slow is okay too! For myself, I have found that I have maybe 3-5 \"challenge\" days per week where I have something that is scary and I let myself have as much as I want, very much listening to my body and not the ED part of my brain.  Sometimes on the following days I feel a bit overwhelmed so yeah, I may not want to challenge myself again. However, I also often no longer crave that particular food because I allowed myself to have it and I know it is not going anywhere (pop corn kernals really go a long way).",
      "created_utc": 1585764028.0,
      "score": 6,
      "context": [
        {
          "id": "fm4soos",
          "author": "petitelinotte212",
          "body": "That is awesome! Damn, you breezed right through that in 3 days lol. I'd still take it slow, but it  sounds like this quarantine is affording you the time to make some great progress!",
          "created_utc": 1585760089.0
        }
      ]
    },
    {
      "id": "fm5pzph",
      "author": "None",
      "body": "You are still very stuck in an eating disorder if you are weighing your peanut butter and jelly and only using thin bread. If you have a history of disordered eating, you should not be using Noom.",
      "created_utc": 1585777666.0,
      "score": 1,
      "context": [
        {
          "id": "fm4uz8y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1585761303.0
        }
      ]
    }
  ]
}