{
  "id": "ftdtk3",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1585793292.0,
  "title": "\"you looked AMAZING back then\"",
  "selftext": "said by my stepdad who knew I had an eating disorder \"back then\" and in fact I passed out on his stairwell once lol. This was like a week ago and it still bothers me, but you know, I'm done being someone only other people can enjoy. Just a vent, let me know how you guys have dealt with similar ignorance before :')",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ftdtk3/you_looked_amazing_back_then/",
  "score": 99,
  "num_comments": 8,
  "comments": [
    {
      "id": "fm6q3id",
      "author": "None",
      "body": "“Yeah, I fucking hated myself back then. Just a horrible time. So glad I’m away from that.”\n\nAnd maintain eye contact. Because he knows and he shouldn’t be saying that shit.\n\nStay strong, you don’t deserve that. Your body is beautiful when it’s healthy. Not when it’s sick.",
      "created_utc": 1585800138.0,
      "score": 63,
      "context": []
    },
    {
      "id": "fm6z0pe",
      "author": "PM_ME_YER_SHIBA_INUS",
      "body": "nobody asked for his musty opinion but ok\n\n> I'm done being someone only other people can enjoy.\n\ndamn straight.",
      "created_utc": 1585807573.0,
      "score": 40,
      "context": []
    },
    {
      "id": "fm71yl0",
      "author": "standsure",
      "body": "\"Are you being rude on purpose?\"\n\nIs my go to. But seriously. What a fuckstick.",
      "created_utc": 1585810371.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fm6y4xp",
      "author": "arooes",
      "body": "I feel this so much. It’s been especially hard lately being at home isolating, every conversation my mum has with me is how skinny I used to be and different diets I can’t try now I’m home and she can’t seem to grasp I had an eating disorder. The woman stood there in the doctors office and watched me sob as he told me how much I weighed when I was severely underweight and I still thought the number was too big. Hope things pick up for you soon, hang in there.",
      "created_utc": 1585806770.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fm7ds2c",
      "author": "isabloop",
      "body": "Shit if someone told me that I would be speechless... I’m so sorry he said that. Ur healthier now and u very likely look a million times better because of that! Sending love x",
      "created_utc": 1585823155.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fm7ua8r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1585836902.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fm89jsy",
      "author": "Lapamasa",
      "body": "What a rude comment, especially from a stepfather.\n\nPeople should really learn how to not comment on other people's bodies all the time. So rude.",
      "created_utc": 1585845331.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fm6rfgj",
      "author": "None",
      "body": "Wow that’s really ignorant. I’m sure he just doesn’t really understand the severity of an eating disorder or how that could hurt you. My mom is the opposite. She was the one who was pushing for treatment and got me recovered, which I am greatful for, but used to resent. She always talks about how unhealthy I was. I actually liked how I looked back then so it bugs me but I know she’s kinda right.",
      "created_utc": 1585801161.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fm8jkoq",
      "author": "Working-Reaction",
      "body": "that would has destroyed me. a big problem of mine is i can’t let things go, i hold onto every passing comment, things said about me 8/9 years ago i still use as fuel on the ED fire.",
      "created_utc": 1585850544.0,
      "score": 3,
      "context": []
    }
  ]
}