{
  "id": "fuhp07",
  "subreddit": "fuckeatingdisorders",
  "author": "indignan",
  "created_utc": 1585951943.0,
  "title": "I realised that recovery is gonna lead to a normal life",
  "selftext": "I get these weird little bursts of happiness when I think about how I’m gonna be almost fully recovered when quarantines over if I keep challenging my ED to the extent I have been lately.\n\nLike I’ll be able to go out with my friends to get food at places without calorie counts on their menus, and I can eat at my college cafeteria even though they don’t provide nutritional value, and I can go on holiday and eat more than usual without worrying about how I’m gonna torture myself getting back to my goal weight as soon as I return home. In the winter, I’m not gonna be freezing all the time, and I won’t spend every day huddled under my blankets wishing I had the energy to do something other than scroll through Reddit looking at pictures of food.\n\nThis is how non-eating-disordered people always live, holy shit. What a dream. Can’t believe that’s gonna be me. I’m just so happy, I feel like nothing can make me relapse now. \n\nAs hard as it was dealing with the bloat at the beginning, once I decided to recover I literally could not bring myself to restrict anymore. There’s something so beautiful in just listening to hunger cues instead of planning a month’s worth of carefully calculated meals.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fuhp07/i_realised_that_recovery_is_gonna_lead_to_a/",
  "score": 141,
  "num_comments": 6,
  "comments": [
    {
      "id": "fmcxr6z",
      "author": "WookieRubbersmith",
      "body": "I'm so happy for you! Congratulations on what sounds like a really significant breakthrough :)\n\nI also want to say that you're not wrong, and it WILL be as good as you're imagining (even if you have backslides on the way!). Several years into stable recovery, *my life is so sweet.* I still have occasional struggles with triggers, but they are rare and they are EPISODES,  not the default setting of my life. \n\nBeing able to truly enjoy food in social settings (and on my own!) again feels like such an enormous gift. Four years restriction-clean, and the shine still hasn't worn off :) now the only thing I worry about when I go out to eat is the bill lol",
      "created_utc": 1585954983.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fmcyn30",
      "author": "shinhwa_",
      "body": "This is really so nice, and I needed to read this. Sometimes during recovery you're tempted to go back to your old ways 'cause it's just easier, and reading posts like this reminds me that it's worth it. It's so much better to live a life without eating disorders :) \n\nCongrats to you OP, I'm so happy for you, and I hope I can reach that point soon, too :)",
      "created_utc": 1585955524.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fme2wj1",
      "author": "Jawzzy98",
      "body": "Hi, I'm also in recovery. May I ask how long you've been in recovery and if you're still bloated or how long the bloating lasted?",
      "created_utc": 1585987117.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmearv5",
      "author": "indignan",
      "body": "Thank you! That’s so exciting to hear ahhh. Your experience is really inspiring :’)))",
      "created_utc": 1585996694.0,
      "score": 1,
      "context": [
        {
          "id": "fmcxr6z",
          "author": "WookieRubbersmith",
          "body": "I'm so happy for you! Congratulations on what sounds like a really significant breakthrough :)\n\nI also want to say that you're not wrong, and it WILL be as good as you're imagining (even if you have backslides on the way!). Several years into stable recovery, *my life is so sweet.* I still have occasional struggles with triggers, but they are rare and they are EPISODES,  not the default setting of my life. \n\nBeing able to truly enjoy food in social settings (and on my own!) again feels like such an enormous gift. Four years restriction-clean, and the shine still hasn't worn off :) now the only thing I worry about when I go out to eat is the bill lol",
          "created_utc": 1585954983.0
        }
      ]
    },
    {
      "id": "fmeaw1i",
      "author": "indignan",
      "body": "Right?? You just feel so free when you let go of the ED, it’s incredible.\n\nI hope you can too!! Keep reminding yourself why you chose to recover, that’s what helps me on my worst days.",
      "created_utc": 1585996834.0,
      "score": 2,
      "context": [
        {
          "id": "fmcyn30",
          "author": "shinhwa_",
          "body": "This is really so nice, and I needed to read this. Sometimes during recovery you're tempted to go back to your old ways 'cause it's just easier, and reading posts like this reminds me that it's worth it. It's so much better to live a life without eating disorders :) \n\nCongrats to you OP, I'm so happy for you, and I hope I can reach that point soon, too :)",
          "created_utc": 1585955524.0
        }
      ]
    },
    {
      "id": "fmeaqln",
      "author": "indignan",
      "body": "Hey! I’ve only been serious about recovery for a month. \n\nI think it’s different for everyone with bloating. It got a lot better for me after a couple weeks of eating whenever I was hungry without tracking. \n\nI’m still somewhat bloated, so I think it takes a while to calm down completely, maybe a couple months. But from what I’ve read, eating normally and refusing to engage in any ED-type restriction is what will allow it to eventually get better. \n\nGood luck with recovery!",
      "created_utc": 1585996651.0,
      "score": 3,
      "context": [
        {
          "id": "fme2wj1",
          "author": "Jawzzy98",
          "body": "Hi, I'm also in recovery. May I ask how long you've been in recovery and if you're still bloated or how long the bloating lasted?",
          "created_utc": 1585987117.0
        }
      ]
    }
  ]
}