{
  "id": "fvevxp",
  "subreddit": "fuckeatingdisorders",
  "author": "FatFucx",
  "created_utc": 1586098628.0,
  "title": "Im Doing It.",
  "selftext": "Im Doing it. Im Done. Im Done Skipping dinner everysingle day. Im done not drinking water. Im done only eating 1 god damn cup of yogurt for lunch. Im going to Eat real food. When I say real I mean like eggs, Wheat Bread, Black Beans, Chicken. I just said to my little buddy in my head. \"Listen hear you little bastard. I dont care If I eat Ill get bloated. I dont care If I drink water your stomach will expand. Im going to eat. I dont care If I look big. Im going to eat. And If I do Gain lots of weight and go over weight. Im going to lose it the safe way. I dont care if you say, Dont eat dinner. You have to let your food digest or you will get fat.\"\n\nToday is the day I start changing things around. Today is the day where I take control of what I do. Yes you may still be there yelling at me to stop but im in controll now.\n\nIm done. As a child. I cant stand it. Im 11 years old and I get to do what I do.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fvevxp/im_doing_it/",
  "score": 221,
  "num_comments": 22,
  "comments": [
    {
      "id": "fmi6kzc",
      "author": "inkysoda",
      "body": "You fuckin GO bitch get that BREAD",
      "created_utc": 1586103460.0,
      "score": 46,
      "context": []
    },
    {
      "id": "fmiawta",
      "author": "winterfrogi",
      "body": "This is so inspiring you have made me feel like I should do the same. You’re only 11? :((( too young for this",
      "created_utc": 1586105924.0,
      "score": 46,
      "context": []
    },
    {
      "id": "fmi1kxk",
      "author": "None",
      "body": "Yes, you go do that. Real food is great. It's going to be difficult at first, but you will be brave and get through. Because eating is just that — not failure, not weakness, but bravery and willpower and health and (eventual, if not now) happiness. And you deserve all of that. Fuck your ED. Sending all the love <3",
      "created_utc": 1586100427.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fmi4szy",
      "author": "GalaxiasFeathers23",
      "body": "WAY TO GO, OP! We're all rooting for you!",
      "created_utc": 1586102430.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fmibzvi",
      "author": "zedem124",
      "body": "yes!!!! so so proud of you!!! REAL, delicious food won’t hurt you!! it’s so tasty and good for you ❤️❤️ just remember the feelings you felt when you wrote this and keep going!!",
      "created_utc": 1586106550.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fmiea5r",
      "author": "Deinonychus_A",
      "body": "I'm so proud of you! It's going to be hard at first but you can do it! I'm sorry you're going through this at 11 yo.",
      "created_utc": 1586107856.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fmipbcp",
      "author": "carinaarabella",
      "body": "You are SO STRONG and will come out of this with so much love and appreciation for yourself, inside and out. We are all rooting for you!\n\nIf I may share, something that has helped me personally when I am struggling is focusing on gratitude for all the wonderful things our bodies can do - from those that are able to dance, play, cuddle, to differently abled ones that have other magic - and recognizing that food is fuel to empower us. Your brain, body, heart, and mood will thank you. So much love to you dear 💜",
      "created_utc": 1586114165.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fmiwvvf",
      "author": "nightdreamerdaiseyz",
      "body": "I am LOVING this optimism!!!!!!! It can be so beneficial to hear others success and achievements, it makes the world a more positive place.",
      "created_utc": 1586118547.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fmkau5b",
      "author": "iwanttobedainty",
      "body": "Holy shit ur 11?! What age did u develop ur Ed? I started when I was 12 and I'm now 14, Just curious but congrats on starting ur recovery<3",
      "created_utc": 1586149151.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmkmypg",
      "author": "ollienugget",
      "body": "Good for fucking you!! I’m so sorry you’re dealing with this at 11, but the way you speak in this post shows years of wisdom beyond my own (and I’m more than half your age!) fight it, live, breathe, enjoy your life, you have so much time, don’t spend it trapped by your ED <3",
      "created_utc": 1586160695.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmihbva",
      "author": "whateverbruhwhatever",
      "body": "you got this!!!",
      "created_utc": 1586109575.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmill57",
      "author": "Wen-D-Torrence",
      "body": "BRAVO!",
      "created_utc": 1586112017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmiz8q3",
      "author": "F1sh1ngCr33k",
      "body": "Can confirm, it feels good to have strength and energy when eating good, nutritious food",
      "created_utc": 1586119890.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmj08cb",
      "author": "lurky_in_bezerkerly",
      "body": "YES!!! You can do it, you deserve it!! <33",
      "created_utc": 1586120422.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmjajpe",
      "author": "cocoakobra",
      "body": "Yes!!! We all have your back and we’re rooting for you! Enjoy life! Enjoy food!",
      "created_utc": 1586126373.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmjgq9f",
      "author": "EastofEatin",
      "body": "You got this!!! Good luck, love 💕",
      "created_utc": 1586129981.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmjor56",
      "author": "AFinePsycho",
      "body": "There you go! Get that food in and fuck your eating disorder. You are doing amazing, honey. Keep it up! 💪💪",
      "created_utc": 1586134630.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmjw0f0",
      "author": "sleepypwincess",
      "body": "You got this, dear!!! We're all very proud of you!",
      "created_utc": 1586138871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fml0pmq",
      "author": "Boosey0910",
      "body": "Yup make your ED your bitch!",
      "created_utc": 1586175376.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fml1cdt",
      "author": "pickledogdemon",
      "body": "Heck yes! You can do this! Get angry, yell at the stupid voice that tells you mean things about yourself when you are truly AMAZING. We are all here supporting you and we are all so proud that you have taken the hardest step and decided enough is enough.\n\nGo be free of this",
      "created_utc": 1586175920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmnk33m",
      "author": "preciousmonky",
      "body": "QUEEN SHIT!! You got this >:')",
      "created_utc": 1586227900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmia16g",
      "author": "lonleybottleofranch",
      "body": "Let's all get this bread!!! Hell yeah!",
      "created_utc": 1586105424.0,
      "score": 18,
      "context": [
        {
          "id": "fmi6kzc",
          "author": "inkysoda",
          "body": "You fuckin GO bitch get that BREAD",
          "created_utc": 1586103460.0
        }
      ]
    }
  ]
}