{
  "id": "fw81fx",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1586210627.0,
  "title": "I’m going to recover",
  "selftext": "Fuck being a killjoy, an irritable skinny legend. Fuck revolving my whole day around calories, being anxious about eating out, being hyper vigilant around the scent of forbidden foods. Fuck having low libido for my husband. Fuck the chest pains. Fuck the binge on peanut butter sandwiches and fast food one day, restrict for 6 days and hate life after. Fuck not being the person who can just grab a donut from the break room. Fuck counting calories and thinking too hard on my next meal and settling for a ok meal when I could have had a better tasting meal. Fuck taking out things like cheese and olive oil when I love them. Fuck getting cold as hell and taking my heater with me everywhere I go. Fuck almost feeling like passing out everytime I take a shower. Fuck not having a period and being at risk for osteoporosis. I feel like I’m getting dumber as the days go by, cant talk as well as I did before. Fuck a 16 BMI when I’ll never be satisfied. I’m almost 27 and I’m done. I’m letting myself gain to a healthy weight and just scheduled an appointment to my doctor next week to admit to her my lack of period and restrictive eating habits. I’m done with this bullshit.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fw81fx/im_going_to_recover/",
  "score": 164,
  "num_comments": 15,
  "comments": [
    {
      "id": "fmmshb4",
      "author": "MysticalWateryEye",
      "body": "YES!!!!!!!!!! YES!!!!!!! so happy that you are realizing this! hold onto this whenever the hard days appear, or whenever you begin to doubt! recovery is worth it!",
      "created_utc": 1586211213.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fmmx1er",
      "author": "zedem124",
      "body": "This makes me so happy to read and I am so proud of you! That’s such an amazing thing to consider but just remember this feeling because the restrictive tendencies will come back so fast and you want to restrict so badly but just continue to challenge yourself! One thing that helped me was having to eat every three hours to restore my hunger cues and make sure I’m feeding my body enough, and that’s not eating like a bag of 100 cal popcorn and half of string cheese every three hours, that’s like a sandwich or a serving of pasta or a smoothie! it was super hard to force myself to eat every three hours, especially if I wasn’t hungry, but in the end it was super worth it and I can start listening to my body better now.",
      "created_utc": 1586213711.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fmn4fzd",
      "author": "grafted_moom",
      "body": "Ayyyyyy yes ma'am fuck all that shit!!! \n\nHELLO to a clear head, less grogginess \n\nHELLO to fewer colds and headaches \n\nHELLO to feelings of joy untempered by starvation \n\nThe ways your life improves is so great and so unexpected 😭 for all the hard times, the work it takes to get through treatment, it's worth it as a new layer peels back and you're like 'holy shit this is how people have been living this whole time?' \n\nIt's the little things that I find so unexpected. My hair and nails grow faster. I get sick way less. I feel so much less hazy. My memory! My memory improved so much. I never realized how much it was fucking up my life until I started to make improvements. I cant wait for you to get those same feelings back too 🥺 it's a new lease on life truly",
      "created_utc": 1586217995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fmmu061",
      "author": "jh1487",
      "body": "You got this!!! I’m proud of you and you deserve recovery <3",
      "created_utc": 1586212057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmn61u1",
      "author": "standsure",
      "body": "Good job.",
      "created_utc": 1586218956.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmn8v7t",
      "author": "alliebbb",
      "body": "YES!!!!A MILLION TIMES YES!!! So so proud of you ❤️",
      "created_utc": 1586220669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmn9d4f",
      "author": "robotsintrees",
      "body": "You got this.",
      "created_utc": 1586220974.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmnnibk",
      "author": "EastofEatin",
      "body": "Yes!! You've got this 💪",
      "created_utc": 1586230285.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmo2cqv",
      "author": "minessa",
      "body": "I dont know if this could helps you. Sometimes when i'm stuck of doing these things  i gone crazy and dont give a fuck about anything and eat like a shit during 2 or 3 days (i eat everything i want, and i like it). After 2 or 3 days i start regret and thinking i eat TOO MUCH during the precedent days and this may make me gain at least 3kg because i feel really fat. When i weight myself i'm often surprise to see that i only gain 1.5kg ( or much less that i was imaginating). That makes me feel less anxious. And helps me to understand that i haven't to restrict so hard because even if i eat with more pleasures i can maintain my weight (and not become fat like my brain imagine)",
      "created_utc": 1586242846.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmoa0ae",
      "author": "Wen-D-Torrence",
      "body": "Go! Go! Go! You're my hero!",
      "created_utc": 1586251093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmofhzo",
      "author": "PM_ME_YER_SHIBA_INUS",
      "body": "Happy for you. Reread this topic  whenever you're on the brink of making a usual mistake.\n\nFuck the fear. Get the hell out of dodge.",
      "created_utc": 1586257124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmox5c1",
      "author": "molchat",
      "body": "i’m so so so happy for you!!! i’ve been thinking the same recently, today my first step was having a handful of almonds and thinking FUCK IT to logging it in mfp\n\ngo you !! 💛💛💛",
      "created_utc": 1586270235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmpbfa5",
      "author": "nourished-soul",
      "body": "YES YES YES!!! Fuck allll of that!! The fact that you're able to realize and say no more is INCREDIBLE and is the first step to true transformation. You deserve to live a happy and healthy life without extreme restrictions and pain, cheering you on love, this is amazing!",
      "created_utc": 1586277852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmmxfsl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586213930.0,
      "score": 5,
      "context": [
        {
          "id": "fmmshb4",
          "author": "MysticalWateryEye",
          "body": "YES!!!!!!!!!! YES!!!!!!! so happy that you are realizing this! hold onto this whenever the hard days appear, or whenever you begin to doubt! recovery is worth it!",
          "created_utc": 1586211213.0
        }
      ]
    },
    {
      "id": "fmobq5z",
      "author": "nika134",
      "body": "Happy cake day!",
      "created_utc": 1586252983.0,
      "score": 3,
      "context": [
        {
          "id": "fmmshb4",
          "author": "MysticalWateryEye",
          "body": "YES!!!!!!!!!! YES!!!!!!! so happy that you are realizing this! hold onto this whenever the hard days appear, or whenever you begin to doubt! recovery is worth it!",
          "created_utc": 1586211213.0
        }
      ]
    },
    {
      "id": "fmn8sqq",
      "author": "MysticalWateryEye",
      "body": "thank you so much :3",
      "created_utc": 1586220628.0,
      "score": 3,
      "context": [
        {
          "id": "fmmshb4",
          "author": "MysticalWateryEye",
          "body": "YES!!!!!!!!!! YES!!!!!!! so happy that you are realizing this! hold onto this whenever the hard days appear, or whenever you begin to doubt! recovery is worth it!",
          "created_utc": 1586211213.0
        },
        {
          "id": "fmmxfsl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586213930.0
        }
      ]
    }
  ]
}