{
  "id": "fzxp8t",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1586701898.0,
  "title": "Sometimes I think \"fuck it, I have to recover, I'm gonna eat whatever I want starting RIGHT NOW!\", so I eat a lot, but then...I panic, and purge.",
  "selftext": "It's like my will to recover lasts an hour or so.\n\nIt's Easter today, and there's abundant food in my house. Delicious food.\n\nI woke up, and I said to myself: I can't restrict anymore. I have to recover. I have to gain weight. I have to do it. No matter how shitty it feels. I have to do it. I have to dive into it face first.\n\nSo I \"binged\" - ate thousands upon thousands of calories from breakfast all the way over to lunch.\n\nUp until mid-lunch, I felt fine. I felt confident and in control. I felt free.\n\nThen, after lunch, panic ensued, and I purged. I knelt in front of the toilet and, well. It was horrible.\n\nThis has already happened multiple times over, and I don't know how to deal with it anymore.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/fzxp8t/sometimes_i_think_fuck_it_i_have_to_recover_im/",
  "score": 127,
  "num_comments": 6,
  "comments": [
    {
      "id": "fn6sl2o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586706516.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fn7fnad",
      "author": "lemoncandles",
      "body": "I've been dealing with this for a while and it's been... a struggle. But I think what has helped me is the way I go about it. Eating thousands more clapries than usual is much more likely to make me panic and have a breakdown and purge than eating just a few hundred more. More than anything, I focus on having normal eating habits (breakfast, snack, lunch, maybe snack, dinner, snack). It doesn't matter if lunch is half an oreo and 12 strawberries with a glass of cranberry juice, it's eating at that time that matters. It's just easing into the eating rather than forcing yourself to eat a ton",
      "created_utc": 1586719382.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn6so21",
      "author": "liketobeyou",
      "body": "yep, this happens to me too. i’ll think “i’m gonna give myself a pass/i cant do this forever/it doesn’t actually matter” and eat. and then i purge,",
      "created_utc": 1586706562.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn6urt4",
      "author": "youknowmeshutup",
      "body": "Omg yes, totally me",
      "created_utc": 1586707756.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn7f497",
      "author": "None",
      "body": "ayyyyup. \n\nMy well-meaning mom: “happy Easter guys!! Got y’all each a pack of easer egg Oreos :3”\n\nMe: “yes cool, I have control and can eat however many I want, thank you life giver”\n\nMe 20 mins and 9 cookies later: purge time baybeeeeee!!!\n\nthis shit’s fucked. Real fucked. I just want some normalcy but since I’ve started purging I can’t stop. Maybe for a few days, up to a week at best. But it always comes back to purging.",
      "created_utc": 1586719083.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn77x70",
      "author": "None",
      "body": "This. There are so many people on here that try to recover on their own. While I'm sure it works for some people, for most it does not. I could definitely not be where I am today without my treatment team. I've also been in every level of care (residential, inpatient, PHP, IOP, outpatient), but that was what I needed. It doesn't help to just \"go all in\" without support.",
      "created_utc": 1586715032.0,
      "score": 5,
      "context": [
        {
          "id": "fn6sl2o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586706516.0
        }
      ]
    },
    {
      "id": "fn7co87",
      "author": "internerderner2",
      "body": "I've tried so many times with the meal plan. I've never been outpatient but I did have a personal dietitian (actually multiple ones) who prescribed me a meal plan. I also tried with self-prescribed ones. Every time, it never worked as it would always feel both too much (for the ED brain) and too little :(",
      "created_utc": 1586717719.0,
      "score": 2,
      "context": [
        {
          "id": "fn6sl2o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586706516.0
        }
      ]
    }
  ]
}