{
  "id": "g14mqs",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1586867321.0,
  "title": "In quasi/self recovery, and as much as I hate the slight weight gain, it’s been so fucking peaceful in my head. I’ve never felt at peace like this in a long time and that alone makes me never want to get super UW anymore.",
  "selftext": "Tw: numbers\n\n\nIn quasi/self recovery for a month. So still weighing myself here and there (not obsessively tho, maybe once every two days), but I’m hardly weighing or tracking my food. If you need more info on that feel free to look at my post history. Gained 6 lbs (95-101 at 5’4”) and for once, I haven’t been starving in the morning. I haven’t been obsessively looking at recipes in the last 3-4 days. I’ve been feeling FULL after having two slices of pizza with my husband rather than forcing all of me to not grab more slices (I usually would end up eating way more and restricting though 🙃). I’m haven’t been thinking of my next meal every minute and wishing it would be 12pm already so I could eat. Yeah I gained weight, still a little UW, but honestly at this point I don’t even care because experiencing extreme hunger and not acting upon it felt like torture. I can’t even describe it. It went on for years. I averaged 10k steps a day, went to the gym 3-4x a week, and still ate less than 1100 calories at a 16 BMI. \n\nI know it’s only been 3-4 days of peace and quiet, but just knowing the slight feeling of fullness and not being food obsessed 24/7, not being hypersensitive to the scent of any fucking food, being able to listen to my husband without adding up calories in my head, etc has been such an eye opener. Its more than just “all I could think about was food.” Now I can understand why healthy people don’t need to eat crazy amounts of food, because they aren’t fucking starved and their body isn’t yelling at them to eat! I always wondered how people only had one plate of food at parties, bbqs, etc. where I was eating like 3 hamburgers and could still go for more, but didn’t wanna look weird. I’ll probably still experience extreme hunger at some point again, but for now just knowing the feeling of peace and being able to be present in the moment and doing more things with my time in quarantine rather than calculating my fucking calories has been such a wake up call.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/g14mqs/in_quasiself_recovery_and_as_much_as_i_hate_the/",
  "score": 114,
  "num_comments": 4,
  "comments": [
    {
      "id": "fndf1ng",
      "author": "Boosey0910",
      "body": "This is great.  Use this quarantine time to your advantage.  Keep it up.  Your body is the best guide as to when to eat and how much.",
      "created_utc": 1586868403.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fndgh1s",
      "author": "None",
      "body": "It sounds like you have made a lot of progress. I hope you know that you still need to keep working towards weight gain though. I'm in the same boat. I have felt so much freedom after I went to residential treatment for two months and I don't have any desire to go back. Recovery is worth it, even when every day isn't amazing.",
      "created_utc": 1586869418.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fne51po",
      "author": "nourished-soul",
      "body": "The part where you say you understand put a smile on my face, that is the key to healing and moving forward. Having that peace and being present is amazing and using this time to your advantage is the best thing you can do for yourself! This is just the beginning but from reading what you've said and your acknowledgements already, you're headed in the right direction :)",
      "created_utc": 1586883187.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnfxc7r",
      "author": "itmeonetwothree",
      "body": "Proud of you for working so hard!",
      "created_utc": 1586917478.0,
      "score": 1,
      "context": []
    }
  ]
}