{
  "id": "g2ftvp",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1587046998.0,
  "title": "The world just seems so different when you see it through a non-starved lens. Now that I’ve experienced a little bit of it, nothing will ever make me go back.",
  "selftext": "I’m in quasi/self recovery. It’s been about a month and a 5-6lb weight gain after absolutely uncontrollable extreme hunger (see my post history). \n\nWho knew I actually didn’t have a “never satiated” problem, but I was just fucking starved? \n\nTabitha Farrar states, “you cant ignore your hunger forever just like how you can’t ignore your need to pee.” \n\nIt’s common sense but I could never accept the truth. Like no shit, you’re thinking about food, recipes, and looking up restaurant photos on yelp every second I could. I thought i was just being a fatass but my brain was just sending me signals to fucking eat!\n\nI couldn’t focus on my work (I’m a graphic designer) because I was sneaking on my phone looking for low calorie recipes on Pinterest. My work started looking lazy. Now that I’m not thinking of food all fucking day, I have energy to put towards my creativity. This is a big one.\n\nI’m not having secret mini night binges while my husband takes his shower because I’m so hungry.\n\nMy hunger and fullness cues have started to come back. Yesterday I was getting full during the middle of my lunch (sweet potato, brocolli, chicken) and I swear I haven’t felt that way in years that it was so foreign. Usually I’d finish my meal, then think of what I could have next and after that. \n\nI know I still have a lot of work to do, but for now I’m reminding myself of these things and holding myself accountable if I ever have doubts.\n\nI don’t want to live that way in 10, 20, 30 years from now. I don’t want to isolate myself from friends anymore. I don’t want to rob the remaining years of my 20’s anymore when this is supposed to be one of the best years of my life.\n\nWhen this quarantine is over, I’m hitting up all my friends that I keep bailing out on to go and eat some food and have some fun. Bless my friends who still want to hang out even though I’ve made excuses to not go when it revolved food.\n\nI don’t want to look back in my life at how “skinny” i was in exchange for having a sad life that consisted of counting calories, staying home and missing out on events because I didn’t want to eat, not making meaningful connections with people, etc.\n\nI want to be that spontaneous girl who doesn’t give af about what she ate during the day and will still go out when her friends ask her to grab drinks at night. I want to have nights to remember like I did before my ED fucked me up. I want to have energy to put worth in my passions and work. I want to be able to have a nice date night for once with my husband at an Italian restaurant and eat one of my greatest fear foods but also one of the foods I love, pasta and garlic bread. Or just get pizza and eat it at 9pm with him while watching Netflix. I don’t want to only put my worth on how skinny I am because what a sad life that is when that’s all I’ve got when I reach 50. Fuck anorexia.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/g2ftvp/the_world_just_seems_so_different_when_you_see_it/",
  "score": 181,
  "num_comments": 10,
  "comments": [
    {
      "id": "fnl628m",
      "author": "Istanbullsh1t",
      "body": "Thank you so much for taking the time to share this. \n\n\nI don’t have access to resources for recovery. If I want to do it I have to do it on my own. I wish I didn’t but I do. I think I’ve made some small steps but I’m unsure. \n\nIf you don’t mind, how have you been able to measure your success? What helps you to feel like you’re doing better?\n\nEdit: really I should ask how do you keep track of feeling like you do better? I’m struggling bc I feel jumbled. It’s hard to see if there’s actual progress.",
      "created_utc": 1587047696.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fnlex67",
      "author": "None",
      "body": "wait until you get to a year of recovery (which you will). it's like living in a completely different universe, and i'm excited for you to see it.",
      "created_utc": 1587052353.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fnlafox",
      "author": "Steffi-blue",
      "body": "That was beautiful ♥️",
      "created_utc": 1587050039.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnm79gb",
      "author": "elleareby",
      "body": "Thanks for sharing. I’m feeling similarly lately. Trying to go all in on the intuitive eating thing and feeling myself not as obsessed. It’s amazing. Like fuck it! Who cares about this stupid shit. I’m realizing all the time I’ve wasted. Part of it also for me was feeling that I looked okay and then seeing that I weighed more than I wanted to and thinking what a scam that is. Isn’t it great to just eat “””bad””” foods like everyone else and not flip the hell out the whole time? I still struggle but for now I’m just letting myself have it if I want it and the obsessive thoughts fade more and more everyday and so does my constant insatiable hunger. Amazing how that works isnt it, lol.",
      "created_utc": 1587066320.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnmpsio",
      "author": "FastPhoria",
      "body": "I really needed to read this today - lockdown is really hitting my recovery hard.\n\nThank you for saying what I think a lot of us need to be reminded of sometimes. You're doing amazing and I'm super proud of you  <3",
      "created_utc": 1587075854.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnnw966",
      "author": "justme89_",
      "body": "This makes my day! Im really happy for you and also love Tabitha!!  \n\n\n6lbs is really not much considering you're underweight and you're eating unrestricted!!  \nI started 6 weeks ago and gained something like that but still hold on to a kind of mealplan which isnt that much at all... so Im kind of jealous ( haha you know what I mean)  that you're body is gaining so steady",
      "created_utc": 1587103686.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnlxi13",
      "author": "jessietl",
      "body": "this was so lovely to read... you’re very right about everything. you will get there. don’t give up.",
      "created_utc": 1587061450.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnnj9bx",
      "author": "OhCrumbs96",
      "body": "This is such a wonderful reminder that life doesn't have to be a miserable ED existence.\n\nI hope you can keep pushing forward so that once this lockdown is over, you're ready to go out and make up for all the fun experiences that your ED deprived you of.\n\nAlso, don't sell yourself short - this doesn't sound like a quasi-recovery to me. Obviously you're the best judge of your own situation but what you've described sounds like you're putting hard work into your recovery and aren't settling for quasi. You deserve a full recovery.",
      "created_utc": 1587093663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnm26km",
      "author": "ravenclawchaser",
      "body": "I couldn't relate more to this. I'm so proud of you, because I know how hard this can be. You're a bad bitch and you can do this!",
      "created_utc": 1587063792.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnld7rl",
      "author": "lovenote123",
      "body": "Honestly I don’t feel like it’s success yet because I’m still weighing myself and still care about body image. Maybe when I get to that point where those things don’t control me then I’ll feel partially successful.\n\nI think if you’re already considering about recovering then you’re already doing better. Some people say that “quasi/self recovery isn’t a real recovery” which kept me putting off recovery for a long time, but honestly, fuck that shit. Watch Tabitha farrar’s video on self recovering. She states that it was the best thing to do FOR HERSELF because she’s always been the type to do challenging/hard things on her own. And I could relate so much to that because I do so much on my own as well and have always preferred it that way.\n\nI guess I’m just taking it day by day, listening to my hunger and fullness cues and trying to regulate it. \n\nI think if you’re eating more and not compensating for it (restricting, purging, exercise purging, etc), that’s already a huge step and I’d say that’s already doing better. Although I’d be cautious to set guidelines as to what is “doing better” because what happens when you “do worse” one day? Will you let that stop you, go back to restricting, etc? \n\nRight now I‘ve been reintroducing fear foods everyday, hardly counting cals, not compensating for it and I think those are small steps but also going on the right path. Everyone’s different and some people need to take it slowly, some can just go all-in, but as long as you’re trying then you’re already doing better, in my opinion. I was surviving off the same 5 safe foods everyday for years, then would binge on some weekends with “bad” foods, then go back... such a horrible cycle. My main goals right now is reintroducing all types of food back in my life, little by little everyday, trying to let my body know that food isn’t scarce anymore. It’s a hard, hard process but the life I was living before was not worth it at all.\n\nYou’ve shown that you’re already courageous enough to try recovery and I wish you the best success ❣️ pls feel free to PM me.",
      "created_utc": 1587051485.0,
      "score": 9,
      "context": [
        {
          "id": "fnl628m",
          "author": "Istanbullsh1t",
          "body": "Thank you so much for taking the time to share this. \n\n\nI don’t have access to resources for recovery. If I want to do it I have to do it on my own. I wish I didn’t but I do. I think I’ve made some small steps but I’m unsure. \n\nIf you don’t mind, how have you been able to measure your success? What helps you to feel like you’re doing better?\n\nEdit: really I should ask how do you keep track of feeling like you do better? I’m struggling bc I feel jumbled. It’s hard to see if there’s actual progress.",
          "created_utc": 1587047696.0
        }
      ]
    }
  ]
}