{
  "id": "g3kx53",
  "subreddit": "fuckeatingdisorders",
  "author": "sunny__bob",
  "created_utc": 1587202707.0,
  "title": "\"Eat properly and eat sensibly\"",
  "selftext": "I've been trying to eat unrestricted recently and my mum is literally stopping me. \n\nI've told her the idea, what I want to do, how I believe it's the only way to fully recovery. She was never 100% onboard, projecting her own insecurities onto my recovery (\"if I did that I would just eat crisps all day\"- I explained that that's only because you restrict that food) and even though I never wanted her to do it, it was for me,  she for some reason kept making it about herself (\"oh i would never want to do that\"). \n\nI just spoke to my brother about it and he agrees that she projects her diet into the rest of the house hold. We can only have a small lunch, you can't snack (unless she is). \n\nI told her I need to be able to eat what I want to recover, she said that's fine. It started of well. I was trying lots of new stuff. But now she's refusing to buy snack food like biscuits or crisps because she \"doesn't like having them in the cupboard\". \n\nToday she just broke and refused to let me have pancakes for breakfast (which was a huge thing in my recovery  for me even to ask) and said I need to \"eat properly and eat sensibly\" . So....restrict? Thanks mum. \n\nShe's more disordered than me at this point but insists her way of eating should be how everyone eats. \n\nI cant recover if I can't eat unrestricted/ intuitively and my mum is literally forbidding it!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/g3kx53/eat_properly_and_eat_sensibly/",
  "score": 112,
  "num_comments": 13,
  "comments": [
    {
      "id": "fnrwwxl",
      "author": "None",
      "body": "Wow that’s horrible! I am so sorry this is happening. Your mom is wrong and should have been proud of you for taking steps to recovery. The only thing I can really think of to help is to learn to make your own food and buy your own ingredients till you can get out.",
      "created_utc": 1587204735.0,
      "score": 38,
      "context": []
    },
    {
      "id": "fnrzy5h",
      "author": "wethail",
      "body": " Depending on how old you are, buy and keep snacks in your room. \n\nEven a bag of apples tastes better without judgement",
      "created_utc": 1587208024.0,
      "score": 28,
      "context": []
    },
    {
      "id": "fnsf42x",
      "author": "Wen-D-Torrence",
      "body": "That stinks. She SOUNDS like she's only trying to impose on you what she THINKS is best. Doesn't sound like she clearly understand the process toward recovery? Do you have a nutritionist or doctor helping you?...perhaps this professional could meet with the family/you two and help bring everyone on the same team.",
      "created_utc": 1587220262.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fnst87u",
      "author": "selfcontrolwya",
      "body": "my mom is the same way too! i am so, SO sorry she’s doing that to you. it’s not fair it’s really taken a toll on my mental health. i’ve really been trying to recover™️ but my moms been making it way too difficult for me. i don’t have advice but hang in there! you’ve worked too hard, i have faith in you. my best advice is not to comment on her food, because when i do that my mom freaks out and lashes out at me more. sending hugs 🥺💞",
      "created_utc": 1587228347.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnsxk3o",
      "author": "MysticalWateryEye",
      "body": "I'm proud of you for trying to recover in a toxic recovery environment. Have you been to therapy or a doctor for this? is so, i encourage you to reach out to them and explain your situation (if it's safe for you to do so).\n\nI'm glad you have a supportive brother. Remember, her mindset is unhealthy, you can recover and have snacks/ foods you need to eat. To get around her strict guidelines, you can always order online, some places take longer but there's a lot of online options for snack delivery and you can keep your own food that she can't monitor. \n\nYour recovery is more important than her idea of what \"normal\" is, in order to recover you need to eat.\n\nAgain, i am so sorry you are going through all of this.",
      "created_utc": 1587230701.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fntkkmd",
      "author": "insomniacla",
      "body": "Can you stay with a friend for the rest of the quarantine?",
      "created_utc": 1587243524.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnsfhft",
      "author": "None",
      "body": "i agree with another poster, if you have money buy and store snacks in your room, or bring food from the kitchen and eat it in your room. \n\nto be honest thats not the best way to do it because hoarding food and eating in secret sounds like a binge. you should be able to eat without shame. \n\nare you getting therapy? if so maybe ask your therapist about family therapy? its good your brother agrees with you. mums can often be annoying in this way, mine was the same, always commenting on what i ate. doesnt help!",
      "created_utc": 1587220495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnus0am",
      "author": "izzybee1993",
      "body": "This sounds so much like my mom. I tried to buy Lucky Charms cereal once early in recovery while shopping with her, and she refused to pay for it and said if I wanted to buy it myself I’d have to hide it in my closet. After two years of me cycling through treatment, family therapy, and plenty of recommendations from people, I’m happy to say she finally got around to reading “Intuitive Eating” and is now on her way to healing her own relationship with food. I talked to her for an hour on the phone earlier today about how shitty diet culture is! That would never have happened 3 years ago! I’m hoping your mom will come around at some point too, I’m sorry you have to deal with her projecting her diet mentality onto you!",
      "created_utc": 1587269563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnrx7ie",
      "author": "sunny__bob",
      "body": "Its frustrating cuz I've had to come back from uni early because if covid 19. I was doing so much better by myself. It's also hard to get ny own food due to lockdown rules. I can't go out just for some extra snacks, they have to be bought with the main shop.",
      "created_utc": 1587205063.0,
      "score": 22,
      "context": [
        {
          "id": "fnrwwxl",
          "author": "None",
          "body": "Wow that’s horrible! I am so sorry this is happening. Your mom is wrong and should have been proud of you for taking steps to recovery. The only thing I can really think of to help is to learn to make your own food and buy your own ingredients till you can get out.",
          "created_utc": 1587204735.0
        }
      ]
    },
    {
      "id": "fnsvtu5",
      "author": "sunny__bob",
      "body": "💖💖💖",
      "created_utc": 1587229764.0,
      "score": 2,
      "context": [
        {
          "id": "fnst87u",
          "author": "selfcontrolwya",
          "body": "my mom is the same way too! i am so, SO sorry she’s doing that to you. it’s not fair it’s really taken a toll on my mental health. i’ve really been trying to recover™️ but my moms been making it way too difficult for me. i don’t have advice but hang in there! you’ve worked too hard, i have faith in you. my best advice is not to comment on her food, because when i do that my mom freaks out and lashes out at me more. sending hugs 🥺💞",
          "created_utc": 1587228347.0
        }
      ]
    },
    {
      "id": "fnsyalu",
      "author": "sunny__bob",
      "body": "Thanks, that means a lot. In going to bring it up in my next session x",
      "created_utc": 1587231100.0,
      "score": 4,
      "context": [
        {
          "id": "fnsxk3o",
          "author": "MysticalWateryEye",
          "body": "I'm proud of you for trying to recover in a toxic recovery environment. Have you been to therapy or a doctor for this? is so, i encourage you to reach out to them and explain your situation (if it's safe for you to do so).\n\nI'm glad you have a supportive brother. Remember, her mindset is unhealthy, you can recover and have snacks/ foods you need to eat. To get around her strict guidelines, you can always order online, some places take longer but there's a lot of online options for snack delivery and you can keep your own food that she can't monitor. \n\nYour recovery is more important than her idea of what \"normal\" is, in order to recover you need to eat.\n\nAgain, i am so sorry you are going through all of this.",
          "created_utc": 1587230701.0
        }
      ]
    },
    {
      "id": "fnrxqxx",
      "author": "None",
      "body": "Some places have grocery delivery places! I know here in the states you can order snacks from Wal-Mart and have them delivered in 2 hours, and there’s a delivery app called gopuff that also does it.  Maybe google around to see what’s local for you? \n\nI’m so sorry that it has to come to that. One of the first lessons I learned in my class was from a woman who was an eating disorder therapist, and she essentially said the most successful way a person’s recovery can go is if everyone in the person’s family attends family counseling together. Behaviors don’t manifest out of nowhere, and environment is such a important factor in mental health. Please don’t be too hard on yourself for struggling, it is 100% normal for things to be difficult right now & it’s something to be proud of that you’re working and making progress.",
      "created_utc": 1587205669.0,
      "score": 10,
      "context": [
        {
          "id": "fnrwwxl",
          "author": "None",
          "body": "Wow that’s horrible! I am so sorry this is happening. Your mom is wrong and should have been proud of you for taking steps to recovery. The only thing I can really think of to help is to learn to make your own food and buy your own ingredients till you can get out.",
          "created_utc": 1587204735.0
        },
        {
          "id": "fnrx7ie",
          "author": "sunny__bob",
          "body": "Its frustrating cuz I've had to come back from uni early because if covid 19. I was doing so much better by myself. It's also hard to get ny own food due to lockdown rules. I can't go out just for some extra snacks, they have to be bought with the main shop.",
          "created_utc": 1587205063.0
        }
      ]
    },
    {
      "id": "fnszbiw",
      "author": "MysticalWateryEye",
      "body": "i'm really proud of you, for what it's worth. I'm glad you have a therapist as well! please keep eating, and try to think of her rude comments as just an ED voice.",
      "created_utc": 1587231651.0,
      "score": 3,
      "context": [
        {
          "id": "fnsxk3o",
          "author": "MysticalWateryEye",
          "body": "I'm proud of you for trying to recover in a toxic recovery environment. Have you been to therapy or a doctor for this? is so, i encourage you to reach out to them and explain your situation (if it's safe for you to do so).\n\nI'm glad you have a supportive brother. Remember, her mindset is unhealthy, you can recover and have snacks/ foods you need to eat. To get around her strict guidelines, you can always order online, some places take longer but there's a lot of online options for snack delivery and you can keep your own food that she can't monitor. \n\nYour recovery is more important than her idea of what \"normal\" is, in order to recover you need to eat.\n\nAgain, i am so sorry you are going through all of this.",
          "created_utc": 1587230701.0
        },
        {
          "id": "fnsyalu",
          "author": "sunny__bob",
          "body": "Thanks, that means a lot. In going to bring it up in my next session x",
          "created_utc": 1587231100.0
        }
      ]
    }
  ]
}