{
  "id": "g4bnpl",
  "subreddit": "fuckeatingdisorders",
  "author": "literal-_-throwaway",
  "created_utc": 1587317533.0,
  "title": "Running and Recovery",
  "selftext": "At first, I was definitely running as more of a compulsive-compensatory behavior, but then I remembered why I fell in love with running to begin with, and now it's actually *really* encouraging me to eat more. Like, I want to be a good runner! You can't be a good runner when your diet is shit! \n\nAlso, like...I'm just so happy that I can still run. I thought for sure I'd hurt my body too badly, but it's actually bouncing back very well as long as I eat regularly and reasonably. \n\nThe other night was really my breakthrough. I cut my run short because I was tired - I'd enjoyed it, but my body was done. My ED was angry, but I was happy, and now, running feels less like a trap and more like the privilege that it is.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/g4bnpl/running_and_recovery/",
  "score": 97,
  "num_comments": 6,
  "comments": [
    {
      "id": "fnwx2ca",
      "author": "nolinestocross",
      "body": "Yes this makes me so happy to hear and I’m proud of you for recognizing these things !!!\n\nRunning in a healthy way was a huge step for me as well because it taught me how to recognize to my body’s signals and adjust to its needs! Plus you feel like you’re flying, and like you said, you don’t get to experience that if you’re not fueling your body properly",
      "created_utc": 1587327140.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fnwvn78",
      "author": "None",
      "body": "❤️❤️❤️",
      "created_utc": 1587326338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnx071c",
      "author": "None",
      "body": "Running and sport also helped me to recover. As soon as I fed my body I was running 50km each week when I'd previously could only manage about 10km. After I ran to Germany and started my PhD I had no time to run and started lifting instead and I love the effect of food in my body and sport.\n\nNow COVID has me back running and it's great! Sundays are sprint days and that power is exceptional.\n\nGood for you, really proud of you.",
      "created_utc": 1587328909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fnyypie",
      "author": "youknowmeshutup",
      "body": "That's great, honey! So happy for you",
      "created_utc": 1587380593.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo07byr",
      "author": "oldmenewme88",
      "body": "Really happy to read this today. Congratulations and thank you for sharing",
      "created_utc": 1587407347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnx7r93",
      "author": "literal-_-throwaway",
      "body": "Yes! Celebrating my 37-mile week with a pint of Ben n Jerry's even though I won't be running today because I DON'T HAVE TO RUN TO EAT!!! (And I need to stop thinking that I do!) \n\nEat to run, not run to eat. That's my mantra right now. (Also eat even if you don't run).",
      "created_utc": 1587333150.0,
      "score": 3,
      "context": [
        {
          "id": "fnx071c",
          "author": "None",
          "body": "Running and sport also helped me to recover. As soon as I fed my body I was running 50km each week when I'd previously could only manage about 10km. After I ran to Germany and started my PhD I had no time to run and started lifting instead and I love the effect of food in my body and sport.\n\nNow COVID has me back running and it's great! Sundays are sprint days and that power is exceptional.\n\nGood for you, really proud of you.",
          "created_utc": 1587328909.0
        }
      ]
    }
  ]
}