{
  "id": "g9zi3u",
  "subreddit": "fuckeatingdisorders",
  "author": "croccqueen",
  "created_utc": 1588121065.0,
  "title": "I'm So Proud of Myself",
  "selftext": "I'm not even gonna lie, this is an alcohol-fuelled self-congratulatory post. I struggled with extreme body dysmorphia, anorexic tendencies, and full-blown bulimia for much of middle school and the beginning of high school. Once I got my destructive habits under control I still struggled with being weight-obsessed and continued to struggle with my body dysmorphia for several years. Since quarantine began I have gained about 20 pounds and it just dawned on me today that I don't particularly care. Like, sure I'm not thrilled to have gained weight but it isn't soul-crushing. I don't hate myself. I can't even express to anyone reading this how proud I am of how far I've come. A couple of years ago I would have obsessed, and restricted, and cried, and binged after gaining weight like this. Now, I'm relatively content. I'm ok. I don't hate myself anymore and I'm almost crying while I write this because it JUST came to me how much this would have affected me a few years ago. The fact that it took almost two months for this to even dawn on me is so------amazing. Just amazing. I remember when I first decided to take back control and stop binging. It was on my mind every. single. day. I had to make a conscious effort to stop myself. Now I------I just-----I can't even express to anyone at all that might read this how incredible it feels to realize that I'm not controlled by my disorder anymore. I did it. I really did it. 16-year-old me used to look in the mirror and cry. I am so proud of myself and I want the world to know. There is hope. You can do it. I believe in you.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/g9zi3u/im_so_proud_of_myself/",
  "score": 89,
  "num_comments": 9,
  "comments": [
    {
      "id": "fowoc1e",
      "author": "iceicemilkshake",
      "body": "Wishing you a continued peace of mind!",
      "created_utc": 1588123777.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fowqpqz",
      "author": "indecision-king",
      "body": "I aspire to be like you!! Thank you so much for posting this, it gave me hope. I'm still in the \"having to make conscious effort to stop myself\" phase and it's exhausting and I can't wait to get to where you're at. Congratulations on sticking to your recovery and putting in the hard work to get to where you are now!! I'm proud of you.",
      "created_utc": 1588125139.0,
      "score": 6,
      "context": []
    },
    {
      "id": "foxk4cn",
      "author": "trylongerthanyoufail",
      "body": "You're giving me so much hope. \n\nI'm in this period you talk about, where the destructive habits are gone but I cannot stop scrutinizing my body to check if it's changing, worrying about my weight (even if I won't use a scale anymore). And I was thinking \"FUCK, this is still quite shit, this is still not what I want. I'm thinking the whole time about my weight. Not much about binging / purging anymore but about how large my thighs and ass are\". \n\nBut I'm having breakfast now and I'm reading your post at the same time, and it's telling me that if I just keep going, this will also fade. So FUCK YES I'll keep going. \n\nThank you really much for sharing this, I'm super proud of you, I'm super proud of us all going through this and continuing fighting every day to reach what you managed.",
      "created_utc": 1588146516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foy1cqm",
      "author": "justabostonterrior",
      "body": "This was really helpful to read actually. Sometimes I want to feel the same way and I almost do, but I was a really overweight kid so the memory of being the fat kid has always interrupted any peace of mind I almost had and lead me to believe the being contented with my body was going to take me back to being the fat kid.\nIt’s really reassuring just to read about other people feeling okay and eating without the sky falling because of it. Thank you. And you’ll see many more good days ❤️",
      "created_utc": 1588162823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fowwfj8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1588128614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foxh1p4",
      "author": "None",
      "body": "Really needed to hear a success story like this today- thank you so much for posting this!! Gives me lots of hope for the future. Congrats!!! ❤️",
      "created_utc": 1588143753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fox2omi",
      "author": "croccqueen",
      "body": "thankyou!!!!!",
      "created_utc": 1588132643.0,
      "score": 1,
      "context": [
        {
          "id": "fowoc1e",
          "author": "iceicemilkshake",
          "body": "Wishing you a continued peace of mind!",
          "created_utc": 1588123777.0
        }
      ]
    },
    {
      "id": "fox2kwb",
      "author": "croccqueen",
      "body": "thankyou so much! good luck on your recovery I know that every day is a struggle but it gets better. you can do it!",
      "created_utc": 1588132573.0,
      "score": 2,
      "context": [
        {
          "id": "fowqpqz",
          "author": "indecision-king",
          "body": "I aspire to be like you!! Thank you so much for posting this, it gave me hope. I'm still in the \"having to make conscious effort to stop myself\" phase and it's exhausting and I can't wait to get to where you're at. Congratulations on sticking to your recovery and putting in the hard work to get to where you are now!! I'm proud of you.",
          "created_utc": 1588125139.0
        }
      ]
    },
    {
      "id": "fox2o3a",
      "author": "croccqueen",
      "body": "thankyou so so so much! i'm still so emotional, I wish you the best of luck!",
      "created_utc": 1588132634.0,
      "score": 2,
      "context": [
        {
          "id": "fowwfj8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1588128614.0
        }
      ]
    },
    {
      "id": "foyrix7",
      "author": "indecision-king",
      "body": "Thanks!!",
      "created_utc": 1588177844.0,
      "score": 1,
      "context": [
        {
          "id": "fowqpqz",
          "author": "indecision-king",
          "body": "I aspire to be like you!! Thank you so much for posting this, it gave me hope. I'm still in the \"having to make conscious effort to stop myself\" phase and it's exhausting and I can't wait to get to where you're at. Congratulations on sticking to your recovery and putting in the hard work to get to where you are now!! I'm proud of you.",
          "created_utc": 1588125139.0
        },
        {
          "id": "fox2kwb",
          "author": "croccqueen",
          "body": "thankyou so much! good luck on your recovery I know that every day is a struggle but it gets better. you can do it!",
          "created_utc": 1588132573.0
        }
      ]
    }
  ]
}