{
  "id": "gamhmu",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1588210809.0,
  "title": "Today my husband surprised us with kebabs and shawarmas and I enjoyed it so much that I could cry. I didn’t feel like a piece of shit for eating for once and I haven’t felt this way in a long time.",
  "selftext": "In self recovery for almost a month and a half and have gained some much needed weight and sanity.\n\nMy husband brought home kebab and shawarma combos with hummus and pita bread. I actually suggested it because it’s a newish restaurant and is just down the street. Of course I was anxious AS FUCK but needed to challenge my ED. I kept looking at the menu for low calorie options for what seemed like a decade, but I just chose what was the most popular which was the shawarma combo. I was smiling so hard because it was so good and eating it while watching Netflix was such a nice time. We haven’t had takeout in so long because I usually cook and takeout scared tf out of me. Everytime I would have to eat food at a restaurant or wasn’t made by me I’d always think, “I’m such a pig, ugh, I’ll restrict tomorrow” while never enjoying the food even though it tasted good.\n\nIt’s so small but such an eye opener for me to realize how much my mindset has changed? Maybe because I’m not at a severely underweight BMI anymore and my body knows it gets food? Idk how to explain it but I almost seemed angry when my husband brought food home. I’d binge on it, hate myself while I’m eating, not even enjoy the food, would secretly get super mad if my husband wanted some of my food? So fucking weird. \n\nI’m excited to keep this up, try to have takeout maybe once or twice a week at the most, and just enjoy food and each other’s company.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gamhmu/today_my_husband_surprised_us_with_kebabs_and/",
  "score": 162,
  "num_comments": 7,
  "comments": [
    {
      "id": "fp0lqg9",
      "author": "mylessandovaldpt",
      "body": "Congratulations! These are the little moments that make recovery so wonderful.",
      "created_utc": 1588211814.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fp0n5pc",
      "author": "ANGLEDHOURGLASS",
      "body": "I have been feeling similarly, congratulations dude",
      "created_utc": 1588212656.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fp0w268",
      "author": "cornlover95",
      "body": "That’s awesome! Any pro tips that helped you?",
      "created_utc": 1588218219.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fp0z19m",
      "author": "cocoakobra",
      "body": "This made me happy to read. That's a big step, proud of you.",
      "created_utc": 1588220201.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fp1gckq",
      "author": "None",
      "body": "Wow!!! I wish I can feel this way again :) I’m happy for you!!",
      "created_utc": 1588234585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fp0zvlz",
      "author": "carinaarabella",
      "body": "Happy cake day!\nAnd congrats to you too :)",
      "created_utc": 1588220779.0,
      "score": 6,
      "context": [
        {
          "id": "fp0n5pc",
          "author": "ANGLEDHOURGLASS",
          "body": "I have been feeling similarly, congratulations dude",
          "created_utc": 1588212656.0
        }
      ]
    },
    {
      "id": "fp1yf5f",
      "author": "lovenote123",
      "body": "Honestly I think just gaining weight (gained about 7-8 lbs but not severely UW anymore) and the feelings kind of came naturally. It’s like my brain isn’t on famine mode anymore and doesn’t make me have this shit personality around food and people when food is around. I don’t think I would ever be able to enjoy food being severely UW no matter what I tried.\n\nI also think doing it more often so it doesn’t have much power over you will help a ton. Like I can’t just get takeout once every couple of months. I need to expose myself to it weekly so it’ll just be a whatever thing that tastes good. Not right now where it gave me so much anxiety to look at the menu, heart racing when my husband brought it home, etc. the goal is to be able to just be like ok I feel like getting takeout, get takeout, done. I believe that if food won’t have too much power on us like that then it’ll be more enjoyable. But it takes challenges to do so.\n\nI’ve been binge watching Megsy recovery’s videos and hers have been the most helpful and real to me when it comes to anorexia recovery. She says, “you’ll feel shit, but do it anyway. What’s the alternative? A restricted life with limited experiences.” That and the alternative could be death..",
      "created_utc": 1588251116.0,
      "score": 3,
      "context": [
        {
          "id": "fp0w268",
          "author": "cornlover95",
          "body": "That’s awesome! Any pro tips that helped you?",
          "created_utc": 1588218219.0
        }
      ]
    }
  ]
}