{
  "id": "gbl45j",
  "subreddit": "fuckeatingdisorders",
  "author": "DedicatedtoDistance",
  "created_utc": 1588349913.0,
  "title": "Some Thoughts from a \"Not Skinny\" Underweight Person",
  "selftext": "I suffered from a sever eating disorder for 8 years. At my lowest weight I looked normal, strong in fact and had an \"average\" BMI. I thought I was a failure who couldn't even succeed at having an eating disorder. \n\nI suffered EDNOS, but I thought that I was bulimic, non-restrictive and oh was I wrong. Going through recovery I was convinced I had a binge eating disorder because I couldn't stop myself from eating everything all the time. Part of the binge eating was due to binging and purging previously but most of it was just my body trying to get nutrients. \n\nI was an athlete and I was just training to be strong, fighting my own body to be the best. Everyone else just thought I was strong too.\n\nI tried to put on some weight over the past couple years but it wasn't enough. It wasn't until I got a stress fracture in one hip and then the other, after going over a year without having my period that I realized how serious things were. \n\nOver the past several months I have been working on eating whatever and not purging. I have significantly reduced my running and I increased by body weight by over 16%. Yes my stomach got a little squishier (which was my biggest fear), but I got my period back and turns out I have boobs. \n\nOnly now do I see the full extent of how bad things were. I was severally underweight (even though I looked normal or even a little bigger than some people). I was degrading my bones, ruining my teeth and destroying my throat. I would occasionally have shortness of breath (this should have scared me but didn't). I couldn't focus, was extremely tired and would get dizzy (all things I dismissed as unrelated). \n\nNow my BMI says I'm \"overweight\" but fuck that. I am exactly the weight my body needs me to be and I am stronger and happier now. It's not always easy to be in recovery but I chose it everyday. I finally learned that no one pound, five pound, or even 20 pounds is worth my happiness or my life. \n\nI've also learned: no one can fix this for you, it's going to be hard, it will not be a straight path and if you keep waiting things will never change.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gbl45j/some_thoughts_from_a_not_skinny_underweight_person/",
  "score": 154,
  "num_comments": 16,
  "comments": [
    {
      "id": "fp6dwoe",
      "author": "radrax",
      "body": "BMI is super unreliable, especially if you're building muscle. It sounds like you're doing a lot better.",
      "created_utc": 1588350666.0,
      "score": 44,
      "context": []
    },
    {
      "id": "fp6y8bb",
      "author": "brogressbro",
      "body": "This resonates with me as well - being a bodybuilder everyone around me just considers be ripped and healthy. Currently commiting to recovery and have the same worries about developing binge eating disorder due to constant food thoughts/having a hard time feeling full and stop eating/getting hungry an hour after a big meal etc. Have never purged But have had some restrict/binge cycles. When did the hunger normalise itself for you?",
      "created_utc": 1588360680.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fp6vnlp",
      "author": "TinyRhymey",
      "body": "This really resonated with me! I literally just got off the phone with a dietician from my doctor's office after talking about my eating tendencies for the first time and the timing of this post couldn't have been better. I don't know you but I'm genuinely happy to read about this chapter of your journey. It helped me feel hopeful about the process that I'm starting and I hope I can write my own progress post someday too. Thank you for writing this out, you're awesome :)",
      "created_utc": 1588359377.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fp6zpct",
      "author": "None",
      "body": "This is a really excellent post. At my lowest points (also with a history of EDNOS) I was always applauded and regarded as healthy and strong. Some people are visibly sick and everyone in their lives validates their recovery and others of us pass the eye test as healthy while destroying ourselves physically and mentally. No BMI or level of performance is worth your mental peace.",
      "created_utc": 1588361427.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fp85ick",
      "author": "unmerited-space",
      "body": "Thank you for sharing this — I have a similar story and sometimes I feel like I’m lying when I tell people I had an eating disorder because I was never technically underweight. But looking back at photos now, I looked like shit. Raccoon eyes and flat ass lol. \nEnjoy all the energy and good vibes! Life is so much better when you can eat 🥳",
      "created_utc": 1588384045.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp7je6x",
      "author": "Working-Reaction",
      "body": "this has actually made me feel a little better about recovering, thank you",
      "created_utc": 1588371733.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp81680",
      "author": "None",
      "body": "This hit home, glad you’re doing okay ❤️",
      "created_utc": 1588380711.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp8i4wz",
      "author": "None",
      "body": "I relate to this a LOT. Because I was a weightlifter, I was never underweight by BMI, even when my body fat was really low, so my doctors never noticed, and everyone acted like I was super healthy, even though I was super tired and cold all the time and having horrible stomach pains.",
      "created_utc": 1588392905.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp7385l",
      "author": "ysbekk",
      "body": "💕💕💕",
      "created_utc": 1588363231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpu8xom",
      "author": "None",
      "body": "Honestly... I needed to hear this. I’ve relapsed from anorexia and I’m not technically underweight by BMI. But I’ve lost a lot of weight and I’m constantly fighting myself over needing to recover because I’m not “underweight”. Thanks for sharing your story",
      "created_utc": 1588907263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fp816u1",
      "author": "None",
      "body": "This hit home, glad you’re doing okay ❤️",
      "created_utc": 1588380720.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fp7ensm",
      "author": "DedicatedtoDistance",
      "body": "It normalized after a couple of months. Mostly it was just about my body getting to the weight it wanted to be at. Also trying to eat regular meals at regular meal times despite previous binging or restricting was important. I think having a regular food intake helped eliminate the intense hunger.",
      "created_utc": 1588369206.0,
      "score": 5,
      "context": [
        {
          "id": "fp6y8bb",
          "author": "brogressbro",
          "body": "This resonates with me as well - being a bodybuilder everyone around me just considers be ripped and healthy. Currently commiting to recovery and have the same worries about developing binge eating disorder due to constant food thoughts/having a hard time feeling full and stop eating/getting hungry an hour after a big meal etc. Have never purged But have had some restrict/binge cycles. When did the hunger normalise itself for you?",
          "created_utc": 1588360680.0
        }
      ]
    },
    {
      "id": "fp7ewri",
      "author": "DedicatedtoDistance",
      "body": "You are awesome too! I am glad that I could bring you some hope and I am excited to one day read your progress post!",
      "created_utc": 1588369341.0,
      "score": 2,
      "context": [
        {
          "id": "fp6vnlp",
          "author": "TinyRhymey",
          "body": "This really resonated with me! I literally just got off the phone with a dietician from my doctor's office after talking about my eating tendencies for the first time and the timing of this post couldn't have been better. I don't know you but I'm genuinely happy to read about this chapter of your journey. It helped me feel hopeful about the process that I'm starting and I hope I can write my own progress post someday too. Thank you for writing this out, you're awesome :)",
          "created_utc": 1588359377.0
        }
      ]
    }
  ]
}