{
  "id": "gdc993",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1588601308.0,
  "title": "Answering questions I had 6 months ago",
  "selftext": "**What if my loved ones leave me after I gain weight?**\n\nThey haven’t. In fact, I actually think they are *less* likely to leave me now haha -- I'm able to spend more time with them, have the mental capacity to be there for them, and not sulk all day just because someone mentioned their exercise plan.\n\n**What if I gain weight forever?**\n\nI have gained weight rapidly, and currently weigh a few kilos more than my starting weight. My weight fluctuates, but within an expected range, and has generally stabilised. My appetite is also a lot more 'normal' than it was previously, and I am able to feel satiated by regular portions of food. I don't constantly think about food between meals anymore.\n\n**Who am I without ED?**\n\nI'm not sure, but I do know that my life now has space for other things. I love to read. I enjoy being creative. I see a lot of meaning in social activism and volunteer work. I love shitposting on the internet.  I think I could be many things :\")\n\n**What if I lose my 'ED abilities', which are the only things I'm good at?**\n\nYes, I'm very bad at ED now. I find it very difficult to restrict or over-exercise -- and not really even due to physical \"limitations\" anymore; my mind just goes \"fuck it\" way more easily and then I start eating and resting. Yes, this often upsets me, quite a bit. \n\nBut I've also realised that these 'ED skills' mean absolutely nothing in the real world -- they weird people out rather than impress them, and they've held me back from pursuing skills that actually matter. (I’ve noticed just how much further ahead some of my peers are in other aspects of life, which I never did when I was deeper in ED. It hurts a little now.)\n\nNot to mention, I'm now also bad at bingeing. Indisputable win tbh. Being in a binge phase when with other people is *especially* something I’ll never miss. Constantly obsessing about food, getting weird comments about the amounts I was eating right in front of others, picking at everyone’s leftovers... ugh, that didn’t feel good. \n\n**But ED is what makes me happy?**\n\nED made me think it made me happy when I was entrenched in it. I definitely thought I felt good when restricting, and even bingeing. But now, looking back on my worst times just honestly fills me with horror. The memories associated with that period are automatically shadowed with this haze of anxiety and physical pain it's pretty difficult to think about them. I was only happy within the limits of ED. Even though I don't now know what real happiness, I'm pretty sure it wasn't that.\n\n**What if I'm never able to recover?**\n\nIt's hard. I've been eating enough for a long time but even now there's often this nagging presence at the back of my mind scanning through calories, thinking about compensation, considering relapse, etc. I still have bad body image days. I still sometimes have small binges which I then try to compensate for.\n\nBut they're getting fewer and further between. And it gets easier to hope :\")",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gdc993/answering_questions_i_had_6_months_ago/",
  "score": 139,
  "num_comments": 6,
  "comments": [
    {
      "id": "fphimi5",
      "author": "wittyish",
      "body": "Beautifully said!",
      "created_utc": 1588621937.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpi1sr9",
      "author": "gay_of_sunshine",
      "body": "Thank you so much. This really gave me hope and I think you’re so strong.",
      "created_utc": 1588631984.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fphltjb",
      "author": "annielovesbacon",
      "body": "I loved reading this and it helped a lot, thank you :)",
      "created_utc": 1588623544.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpjhhnq",
      "author": "goodgirltilly1",
      "body": "Helpful to many i hope, nicely compiled and lovely to hear your doing well x",
      "created_utc": 1588668674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqakdvq",
      "author": "None",
      "body": "this is very genuinely one of the most helpful things i could have read right now. thank you so much for sharing🥺",
      "created_utc": 1589220554.0,
      "score": 1,
      "context": []
    }
  ]
}