{
  "id": "ge86ie",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1588719454.0,
  "title": "Not caring about calories anymore makes me feel like I learned how to fly",
  "selftext": "This is going to sound silly but since I made progress in my recovery I think calories truly mean nothing to me anymore. Sure old habits die hard so I check some things from time to time but the absolutely smothering, suffocating obsession with calories that literally dragged me down, made me feel anxious and in total despair all the time ... it’s finally gone. I feel so weightless, like I can fly. I just let go and now I’m floating with a bunch of balloons in the air and I can breathe...\n\nI know it’s not always going to be so easy. I struggle with weight gain and my body changing. But now when I look at old pictures of me at my LW I don’t see body goals or thinspo, I see my tired, sad eyes. I tortured myself and I am so sorry... the only thing I can do to make this right is to keep fighting and be kind to myself.\n\nWhen I see people on diets or counting calories I feel sad and sorry for them - but I also feel relief because I am not wearing these chains anymore.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ge86ie/not_caring_about_calories_anymore_makes_me_feel/",
  "score": 133,
  "num_comments": 4,
  "comments": [
    {
      "id": "fplvnsn",
      "author": "cherrycokethrowaway",
      "body": "oh my gosh. that is absolutely amazing. i hope to get there one day! ♥",
      "created_utc": 1588720359.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fply5lo",
      "author": "literal-_-throwaway",
      "body": "I'm starting to get to this place too - I still soft track, but after my nutfest the other night had literally ZERO effect on anything (other than giving me wicked heartburn, ouch), I have SO much less anxiety. \n\nI'm eating an entire pint of ice cream tomorrow bc my recommended daily intake is very high and if I gotta eat a fuckton of food, may as well get something I've sorely missed.",
      "created_utc": 1588721744.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fpm3eih",
      "author": "deena812044",
      "body": "Yes yes yes!!! I still struggle with this, so I absolutely commend you. Thank you for sharing something truly positive, and giving people a glimpse of what Real Recovery is <3<3<3",
      "created_utc": 1588724752.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fpore0y",
      "author": "ilytlh",
      "body": "Proud of you ❣ this is such a inspiration for us thank you.",
      "created_utc": 1588789353.0,
      "score": 1,
      "context": []
    }
  ]
}