{
  "id": "gf7f0c",
  "subreddit": "fuckeatingdisorders",
  "author": "Opening-Lecture",
  "created_utc": 1588861206.0,
  "title": "Body Callout during a Zoom Call",
  "selftext": "I was hanging out with five friends last night via Zoom and one of them was talking about this guy who knows him and how he’s always pressuring him to work out.\n\nHe was saying how maybe he has a point and he should lose weight because this guy was basically offering to become his sugar daddy if he would get thin. Then he jokingly(?) said, “I mean it makes sense, look at the only one of us who’s married.” (which is me). \n\nAnd it was so uncomfortable? There was one girl in the call who knows about my ED and changed the topic, but it was just so uncalled for.\n\nAnd it really pissed me off. Even if I didn’t have an ED, it’s a shitty thing to say and it probably made everyone else in the call feel bad (none of them are large). \n\nI feel like it’s very possible this guy *has* been having a hard time with his weight during quarantine and made a snide remark, but I just HATE when people assume that I’m having an easy go of it because I didn’t put on weight in quarantine.\n\nQuarantine has been absolute hell and I’ve had my worst relapse in a long time. I’m slowly picking up the pieces and trying not to fall apart while stuck inside taking care of a toddler, managing a home, and working remotely.\n\nI’m sorry you’re stuck at home all day with little to no responsibilities and have put on a few pounds that will probably fall off once your schedule goes back to normal.\n\nJust fuck you.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gf7f0c/body_callout_during_a_zoom_call/",
  "score": 104,
  "num_comments": 5,
  "comments": [
    {
      "id": "fps4s9p",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1588867458.0,
      "score": 30,
      "context": []
    },
    {
      "id": "fps5t4p",
      "author": "None",
      "body": "In my experience, when people comment on something like that (body type, masculinity, intelligence, etc.), they're generally not secure in that aspect of themselves. That being said, it doesn't excuse the behaviour. If he makes another comment like that, you may want to explain briefly that you're not having any easier of a time than he is.",
      "created_utc": 1588867951.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fq9ldsf",
      "author": "Various-List",
      "body": "Hi, I’m sorry he put you on the spot and I’m sorry you are struggling so much. I just wanted to offer solidarity. I’m working from home with a 1 and 4 year old and the stress is unrelenting. Now I’ve turned back to my ED I’ve been recovered from.\n\nPeople in different aspects of my life had been commenting on my weight loss that I guess really became noticeable early this year but was really due to finally getting the last bit of baby weight off. I’ve been pregnant or nursing almost the entire time I’ve lived in this town so they just aren’t used to seeing me at my normal size, which looks thin compared to the average adult. Anyway, the comments triggered me big time even though they were well intended.. Now I’m losing more weight from relapse and feel so self-conscious in a bad way.. even despite feeling driven and wanting to be skinnier. I was wearing a v-neck T-shirt on a virtual happy hour and about died from embarrassment when my colleagues were talking about weight gain and one made a comment that I’ll be a skeleton by the end of this. I just mumbled something about being busy from the kids. \n\nUnless it’s a personal friend that has told me they are on a weight loss or fitness program, I never comment on someone’s size or shape, big or small. It’s so off limits in my mind!",
      "created_utc": 1589201485.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpsy3z6",
      "author": "Opening-Lecture",
      "body": "His tone was a little off-putting and this isn’t the first time he’s made a comment about my appearance, but it’s very possible I’m just taking the comment too hard.\n\nI’ll try and give him the benefit of the doubt. I’m usually pretty chill about people talking about bodies and food and understanding that I’m just super sensitive, but....it’s a tough time and I needed to rant. \n\nMy support systems or bare minimum right now because of the virus situation, holding on though! Thanks for taking the time to respond 💜",
      "created_utc": 1588881576.0,
      "score": 11,
      "context": [
        {
          "id": "fps4s9p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1588867458.0
        }
      ]
    },
    {
      "id": "fpsyani",
      "author": "Opening-Lecture",
      "body": "I agree. I would usually just write it off and not give it too much attention but for some reason it just really got to me.\n\nHopefully it won’t happen again because the atmosphere of the chat got a little awkward after he commented 😬",
      "created_utc": 1588881665.0,
      "score": 7,
      "context": [
        {
          "id": "fps5t4p",
          "author": "None",
          "body": "In my experience, when people comment on something like that (body type, masculinity, intelligence, etc.), they're generally not secure in that aspect of themselves. That being said, it doesn't excuse the behaviour. If he makes another comment like that, you may want to explain briefly that you're not having any easier of a time than he is.",
          "created_utc": 1588867951.0
        }
      ]
    },
    {
      "id": "fpt8hd8",
      "author": "None",
      "body": "Had the same thing happen to me.  Truly mortifying.  I have to keep telling myself that *people make comments with the best of intentions....*",
      "created_utc": 1588886713.0,
      "score": 3,
      "context": [
        {
          "id": "fps5t4p",
          "author": "None",
          "body": "In my experience, when people comment on something like that (body type, masculinity, intelligence, etc.), they're generally not secure in that aspect of themselves. That being said, it doesn't excuse the behaviour. If he makes another comment like that, you may want to explain briefly that you're not having any easier of a time than he is.",
          "created_utc": 1588867951.0
        },
        {
          "id": "fpsyani",
          "author": "Opening-Lecture",
          "body": "I agree. I would usually just write it off and not give it too much attention but for some reason it just really got to me.\n\nHopefully it won’t happen again because the atmosphere of the chat got a little awkward after he commented 😬",
          "created_utc": 1588881665.0
        }
      ]
    }
  ]
}