{
  "id": "gfx4vg",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1588957897.0,
  "title": "I’ve been wanting a meat pie from this bakery next to my apartment, so I got one, got full off half, and now the other half has been hanging out on my dining table for like 3 hours and it’s not taunting me? I’m not fighting myself to not eat it? Who am I",
  "selftext": "A recovery queen\n\nLol jk not even close. After giving in to my extreme hunger 2 months ago and gaining some much needed weight (still need to get to a healthy BMI but at least I’m not severely UW anymore) I don’t feel the need to devour the entire kitchen anymore. I haven’t felt extreme hunger for like 2-3 weeks which might be too early to tell, but i absolutely forgot how being full feels so I’m extremely happy that the fullness cues started coming back. I swear I never thought this day would come. I thought everyone that kept telling me “extreme hunger will go” was lying because I’ve been hungry 24/7 for as long as I can remember. Thinking about food all the time. Dealing with my “black hole” of a stomach. Practically eating every box of pastries when I’m at my mom’s house, so I would avoid every type of pastry because I’ve accepted the fact that I couldn’t control myself around them. \n\nWhat could possibly happen that I could ever not be hungry? Well obviously, giving into my damn hunger. \n\nI only got one meat pie because I was afraid of devouring the whole box had I gotten more. But I totally could have. Now my husband will come home from work asking where’s his after seeing my half still there. Next time I’ll grab more and try other pastries and flavors :) I’m fucking ecstatic tbh",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gfx4vg/ive_been_wanting_a_meat_pie_from_this_bakery_next/",
  "score": 103,
  "num_comments": 4,
  "comments": [
    {
      "id": "fpwmw4w",
      "author": "sophie-kate",
      "body": "I love this positivity:)",
      "created_utc": 1588966261.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fpwnl1z",
      "author": "DartInTheDark",
      "body": "Holy hell, there's hope for me after all...\nThank you for sharing. ♥ I needed to read this today.",
      "created_utc": 1588966608.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpxl2bz",
      "author": "baguenette",
      "body": "love ya babe keep at it x",
      "created_utc": 1588984605.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpxyfq6",
      "author": "EastofEatin",
      "body": "So excited for you! You are AMAZING",
      "created_utc": 1588992162.0,
      "score": 1,
      "context": []
    }
  ]
}