{
  "id": "ghucfb",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1589224621.0,
  "title": "I have to recover...",
  "selftext": "Half an hour ago I was purging. Then I facetimed my parents (I'm studying in a different country) and learned that my grandpa passed away today... He was 90 and ready to go and we were all expecting this so it's not heartbreaking. What's heartbreaking was my father saying how it comforts him to talk to me and see me well... which I obviously am not. \n\nI have to stop binging and purging before I end up damaging my health permanently. It would break my parents' hearts if I were to suffer serious complications from this... It would already break their hearts if they knew what I was going through right now. I can't do that to them. \n\nI don't know if this makes sense but maybe if I can't recover for myself, I can recover for them. I have to put this thing behind me.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ghucfb/i_have_to_recover/",
  "score": 119,
  "num_comments": 4,
  "comments": [
    {
      "id": "fqb5lmq",
      "author": "None",
      "body": "It makes all the sense in the world and is a good reminder for you to keep resisting the downward spiral. We tend to forget that we're not only hurting ourselves. And we can only hide  behind lies and self-deception for so long. Good on you for facing things head on. Keep it up.",
      "created_utc": 1589230981.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fqbchyo",
      "author": "aventurette",
      "body": "It absolutely makes sense! Idk if you're in the US but it reminds me of the \"Quit Smoking\" commercials where the ex-smoker thinks about their family whenever they really want a smoke.\n\nJust remember that if you do relapse again, you are NOT disappointing them. You will only break their hearts if you give up altogether. Every time you pick yourself back up and try again, you'll be doing your parents proud.",
      "created_utc": 1589234471.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fqdy37b",
      "author": "zzombieyum",
      "body": "im so sorry to hear about your grandfather... stay strong! i'm happy to hear you're motivated to recover, but don't be afraid to ask for help if you need to. weather that be family, friends, therapist, or a treatment center. you got this <3",
      "created_utc": 1589298587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqcp9dq",
      "author": "goodgirltilly1",
      "body": "So sad to hear of the passing of your granddad, this is life however and so is your ED, hard to do i know but try to change by making that step not to lie. I lied for years hid thing and became expert at pretending, the day i decided to battle for me, not anyone else, ME, was the day i promised never to lie again, no one in your family can understand fully, don't expect them too, and tell them that. It sounds like your parents love you that all you need if you can start by loving yourself. xx",
      "created_utc": 1589264561.0,
      "score": 2,
      "context": []
    }
  ]
}