{
  "id": "gmv8qb",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1589915992.0,
  "title": "Alright, I'm doing it for real this time. I swear. I promise.",
  "selftext": "Fuck it. I've been farting around in quasi-recovery for too long, and I hate it. This weekend, I had a meal out and some dessert. It was delicious. My normal response would be to restrict and exercise purge during the week the compensate.\n\nNot anymore. I can't do it anymore. I cannot go through life like this any longer. The past few days, I have done zero body checking. I've done exercise that makes me feel good. I've eaten sandwiches and not salads. I'm eating fruit regularly because it **tastes good** and I'm not going to beat myself up for eating **an apple**. I've had cheese. I've eaten until fully satisfied. I incorporate vegetables in my diet in moderation so that I'm getting vitamins and nutrients and a little bit of roughage and **not** so that I'm filling up my stomach to suppress my hunger.\n\nLast therapy appointment, I realized how much I'm stagnating, and I'm tired of it all. I'm angry at myself for wasting this much time. We're on day three of actually recovering.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gmv8qb/alright_im_doing_it_for_real_this_time_i_swear_i/",
  "score": 101,
  "num_comments": 3,
  "comments": [
    {
      "id": "fr615a3",
      "author": "None",
      "body": "Starting day 1 here.  Let's not fuck around, eh?",
      "created_utc": 1589918088.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fr62nue",
      "author": "Aspenisbi",
      "body": "straight meeting grandiose memory imagine water toothbrush march tidy ripe\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1589918851.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fr8lg5h",
      "author": "None",
      "body": "you can do this... and dont let small setbacks drag you down its normal and okay to still have those E. D. thoughts and feelings but you just need to keep pushing and dont let it take over again and give it the control back (best you call someone you is invited and you trust most like ya bff, family member or partner to go through those bad moments and prevent relapses... or you can also contact me in this situation... we need to stand together and help each other <3)",
      "created_utc": 1589981478.0,
      "score": 1,
      "context": []
    }
  ]
}