{
  "id": "gr035n",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1590509905.0,
  "title": "Before recovery: couldn’t have sweets around my apartment in fear of devouring it in one sitting. Now, I can naturally have one cookie and can save some for tomorrow. I don’t have to fight myself. Why?",
  "selftext": "If you tried to sell me the idea of recovery for this exact reason, I’d be sold then and there. Most of my ED life (16 BMI) I had to fight myself from eating sweets and thought I had a sugar addiction. Every pastry wasn’t enough. I needed more. I literally felt like an addiction who couldn’t stop at a single pastry like normal people. I’d eat 5-6 pastries (donuts, cookies, danishes, whatever) at the office break room and would still have to fight myself to not eat any. Then restricted the rest of the day/next couple of days then the cycle continues.\n\nI’m not seeing a therapist. I’ve been doing self recovery for 2.5 months now and am almost at a healthy weight but since gaining 7 lbs I’ve been way at ease with pastries. Being able to NATURALLY stop has been amazing. Not fearing having them in my apartment has been amazing.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gr035n/before_recovery_couldnt_have_sweets_around_my/",
  "score": 151,
  "num_comments": 12,
  "comments": [
    {
      "id": "frw7krv",
      "author": "None",
      "body": "aw I am so pleased for you. The magic of recovery! \n\nI think it has a lot to do with your body starting to learn that there is no scarcity of food...both in your mind AND physical body. \n\nAs soon as your mind thinks something it enjoys is limited...it wonders why. It goes to the primal conclusion that there must be a famine. Thus, it wan't as much of that thing as it can when it's there! That's why when you can enjoy and eat something like that without the mental punishment and restrictive....you can relax and actually feel satisfied! \n\nKeep up the good work!",
      "created_utc": 1590516683.0,
      "score": 24,
      "context": []
    },
    {
      "id": "frw7zb4",
      "author": "None",
      "body": "restriction causes bingeing. it makes sense, but it's hard to accept it when we're sick. it's like when you go 18 hours without peeing, you feel like your bladder is going to explode, all you can think about is peeing, and when you do it it's a bigger quantity than if you had just peed every couple hours throughout the day.",
      "created_utc": 1590516880.0,
      "score": 18,
      "context": []
    },
    {
      "id": "frw9eov",
      "author": "ThatOnePotential",
      "body": "Congratulations on this win! Before recovery, like you, I would have never believed that I could \"control\" myself around sweets. It was always a war and I felt like I had to follow an abstinence model because I was addicted. \n\nMy understanding of this is that the closer to get to the weight where your body functions optimally, the less obsessed with food (particularly calorie dense) you get because your body no longer needs to repay the energy debt caused by your ED. Before that point your body is looking for foods that are the most energy dense easily processed and absorbed by your body (stuff we think of as \"junk\"). \n\nI also think to a limited extent, there is also a something to the idea of legalizing things--if you always have the option to eat stuff you used to label as \"off-limits\" the less tempted you are by it. \n\nWhatever the case, it is incredibly amazing when this happens. I am really happy for you :)",
      "created_utc": 1590517566.0,
      "score": 4,
      "context": []
    },
    {
      "id": "frwreuk",
      "author": "nourished-soul",
      "body": "This is AMAZING!!!! Do you think you had such a strong attraction to sweets, because you deprived yourself of them or were told you could never have them to be healthy? You should be so proud of yourself and the realizations you're making, it's wonderful! I'd love to talk more about your self recovery if you're open to it!",
      "created_utc": 1590526281.0,
      "score": 4,
      "context": []
    },
    {
      "id": "frwytdo",
      "author": "None",
      "body": "this is my goal! omg. how did you gain weight though? I am struggling to do so. did you go through extreme hunger and just eat whatever? i’m currently counting calories as a means to try to get enough food in me to gain.",
      "created_utc": 1590529961.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frz429s",
      "author": "Sareeee48",
      "body": "This happened to me—except I have a sweet tooth and fucking love sweets lmaoooo. But I do get satisfied waaay before the entire batch of cookies are on my stomach or before I’ve eaten the entire tub of icecream.  What’s also great... is that I can have icecream or cookies or whatever I want, every night, without freaking the fuck out. Lmao",
      "created_utc": 1590584897.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs0lkix",
      "author": "absolute_boy",
      "body": "When did the sugar cravings go away for you? I'm 1 month into recovery from a low BMI like you and I'm still in the phase where I will eat 1 cookie, then go back and devour the entire packet. I've gained nearly 20lbs in just a month due to these insane cravings... how long did it take for your appetite to even out?",
      "created_utc": 1590611656.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fryw9lb",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1590579162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frxcyil",
      "author": "lovenote123",
      "body": "The weird thing is I never really deprived myself. I would eat cookies and cereal frequently because to me it was like, “if I’m going to eat and waste calories, it better be worth it.” But then they were so calorically dense that the rest of my “meals” would be so nutritionally deficient just so I could stay under very little calories. But thank you! And yes please we can always talk and share our experiences! It’s always nice to not feel alone.",
      "created_utc": 1590537470.0,
      "score": 5,
      "context": [
        {
          "id": "frwreuk",
          "author": "nourished-soul",
          "body": "This is AMAZING!!!! Do you think you had such a strong attraction to sweets, because you deprived yourself of them or were told you could never have them to be healthy? You should be so proud of yourself and the realizations you're making, it's wonderful! I'd love to talk more about your self recovery if you're open to it!",
          "created_utc": 1590526281.0
        }
      ]
    },
    {
      "id": "frxdmry",
      "author": "lovenote123",
      "body": "Ohhh I feel you. I was eating so much peanut butter and nuts everyday for a week... it was like I was possessed and couldn’t stop eating when my body finally had some real food. Probably averaged 6k-7k cals a day for a week. The first 3 days, I think I only gained a pound. Yeah my body basically said “fuck calories” and I ate whatever I wanted. The first week I really did not want anything but pbjs and nuts. I think it was hard to gain weight at first because of something called “hyper metabolism” that happens during refeeding. I do suggest eating whenever you’re hungry if you’re experiencing extreme hunger, but if you can plan something with a dietician that would be better. I don’t suggest doing what I did because my heart was racing like crazy, I woke up in sweats, and my entire abdomen was sore and tender to the touch for a couple of weeks. But then again, I was just so fucking hungry that I don’t think a dietician’s plan would have helped. Anyway my inbox is always open if you want to talk about recovery more! I’m so glad you’ve decided to recover and pls hang in there!",
      "created_utc": 1590537849.0,
      "score": 3,
      "context": [
        {
          "id": "frwytdo",
          "author": "None",
          "body": "this is my goal! omg. how did you gain weight though? I am struggling to do so. did you go through extreme hunger and just eat whatever? i’m currently counting calories as a means to try to get enough food in me to gain.",
          "created_utc": 1590529961.0
        }
      ]
    },
    {
      "id": "frzhxeh",
      "author": "lovenote123",
      "body": "Weight gain and eating frequently. Such an easy concept but one of the hardest things to mentally get over.",
      "created_utc": 1590592521.0,
      "score": 4,
      "context": [
        {
          "id": "fryw9lb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590579162.0
        }
      ]
    },
    {
      "id": "frzcgis",
      "author": "None",
      "body": "thinking of them as wasted calories is called mental restriction and it absolutely counts as depriving yourself.",
      "created_utc": 1590589709.0,
      "score": 3,
      "context": [
        {
          "id": "frwreuk",
          "author": "nourished-soul",
          "body": "This is AMAZING!!!! Do you think you had such a strong attraction to sweets, because you deprived yourself of them or were told you could never have them to be healthy? You should be so proud of yourself and the realizations you're making, it's wonderful! I'd love to talk more about your self recovery if you're open to it!",
          "created_utc": 1590526281.0
        },
        {
          "id": "frxcyil",
          "author": "lovenote123",
          "body": "The weird thing is I never really deprived myself. I would eat cookies and cereal frequently because to me it was like, “if I’m going to eat and waste calories, it better be worth it.” But then they were so calorically dense that the rest of my “meals” would be so nutritionally deficient just so I could stay under very little calories. But thank you! And yes please we can always talk and share our experiences! It’s always nice to not feel alone.",
          "created_utc": 1590537470.0
        }
      ]
    },
    {
      "id": "frzimcx",
      "author": "nourished-soul",
      "body": "But within the days of not eating the sweets to \"make up\" for the binge was a deprivation of the sweets, did you find that by the end of those few days you restricted you wanted those sweets even more? That's how I was a bit, the idea of not being able to have it made me want it more.",
      "created_utc": 1590592870.0,
      "score": 2,
      "context": [
        {
          "id": "frwreuk",
          "author": "nourished-soul",
          "body": "This is AMAZING!!!! Do you think you had such a strong attraction to sweets, because you deprived yourself of them or were told you could never have them to be healthy? You should be so proud of yourself and the realizations you're making, it's wonderful! I'd love to talk more about your self recovery if you're open to it!",
          "created_utc": 1590526281.0
        },
        {
          "id": "frxcyil",
          "author": "lovenote123",
          "body": "The weird thing is I never really deprived myself. I would eat cookies and cereal frequently because to me it was like, “if I’m going to eat and waste calories, it better be worth it.” But then they were so calorically dense that the rest of my “meals” would be so nutritionally deficient just so I could stay under very little calories. But thank you! And yes please we can always talk and share our experiences! It’s always nice to not feel alone.",
          "created_utc": 1590537470.0
        }
      ]
    }
  ]
}