{
  "id": "gth0vm",
  "subreddit": "fuckeatingdisorders",
  "author": "problematicbeing",
  "created_utc": 1590856317.0,
  "title": "My boyfriend threw out my scale today.",
  "selftext": "After I broke down crying yesterday, he told me I need to take real steps to recovery, like eating 3 meals a day and throwing out the scale.  He warned me he was going to do it. I told him \"I'd do the same if the situation was reversed but Im still probably going to throw a fit\"\n\nAnd this morning, its gone. My ritual of weighing in the morning is gone. I know its for the best, i know this is what I need to get better. I won't buy another one and the soonest I'd have access to a scale is in August when I go back to work.  I hope by then I'm strong enough to not weigh myself.\n\nThings have gotten so hard. After 6 years and of cycling relapse and recovery I'm afraid that I'll never get it to stick.  But I have to try, because life is fucking hard and its harder with an eating disorder.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gth0vm/my_boyfriend_threw_out_my_scale_today/",
  "score": 131,
  "num_comments": 9,
  "comments": [
    {
      "id": "fsbko2s",
      "author": "Margkam",
      "body": "It’s hardest right after you stop a behaviour. You will have the compulsion to do it, but it will lessen over time. And in my experience, though you probably won’t all of a sudden love and accept your body, not being able to do it can feel like a relief. \n\nIt’s never easy to make changes, but it’s a great step. Best of luck!",
      "created_utc": 1590857744.0,
      "score": 42,
      "context": []
    },
    {
      "id": "fsbu7sx",
      "author": "None",
      "body": "My wife did this about 5 years ago and I took it hard! My ED threw a huge tantrum. It worked out for the best as since then I’ve finally gotten proper help (now that we can afford it) and consider myself well on the way to recovered. You can do it too but it’s ok if you need to panic for a minute! You will move forward and it sounds like you’ve got solid support behind you.",
      "created_utc": 1590861221.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fsd3zu4",
      "author": "sAm_I_Am77",
      "body": "It’s hard now but it will eventually feel liberating. My treatment team wanted me to get rid of my scale and I told them if that’s the case then they are not to weigh me at any appointments. We went back and forth on this. I stood my ground when they insisted they needed to weigh me. I asked them why is it that I am always hearing ‘your weight doesn’t matter’ yet the first thing you all want to do at the beginning of every single appointment is have me hop on that cold metal square? If it doesn’t matter than why weigh me? I told them I have been seeing them long enough that they can all tell the minute we are in the room together how I am doing. They can feel the energy and vibe I’m giving off, no scale needed. I can manipulate a weight anyway. They said we need it as a measurement of your progress. A measurement of my progress? Really? Can a scale measure the joy on my sons face as we toast our subway sandwiches before taking a bite? How about the happiness on my kids faces when I ask them to play a board game? Can it measure the strength I feel from not giving in to an urge? Or how about the amount of love and support I have around me? There are many ways to measure progress without using a damn scale.",
      "created_utc": 1590877940.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fsdcq0v",
      "author": "sAm_I_Am77",
      "body": "I haven’t been weighed in almost 2 years. When I could back up my reasons with valid points they agreed. I also complied and relinquished my scale to my therapist, she came to my house and we went through and I gave her anything that was behavior related. I still have urges or maybe a curiosity to weigh; but as long as they stay true to their word I promised to stay true to mine.",
      "created_utc": 1590882895.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsdapoe",
      "author": "BundleOfTriggers",
      "body": "Oh boy that is some tough love—but definitely love 💕 do you have a nutritionist or support team you’re working with? \n\nSending you so much love ❤️ I used to weigh myself daily too. You’ll look back on this someday with so much compassion for the hurt you’re feeling now.",
      "created_utc": 1590881739.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsdni7u",
      "author": "audreygenest",
      "body": "Proud of you. It is hard but it’s the best thing you can do. Although i still struggle, even at my low points, i will never step on a scale. At this point I’m fearful of it because  of the power it had over me like so many others in this sub. it used to dictate my happiness for the day, how i felt about the foods i ate, and represented so much for a stupid object! Sending love to you on this next step!",
      "created_utc": 1590889376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsdz59l",
      "author": "None",
      "body": "i promise it will get a lot easier. i used to weight myself all the time, but now i barely think about it at all.",
      "created_utc": 1590896615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsctew7",
      "author": "green131313",
      "body": "I forget about weighing myself one day after i stopped. You’ll be fine",
      "created_utc": 1590873678.0,
      "score": -1,
      "context": []
    },
    {
      "id": "fse9kru",
      "author": "lasaucerouge",
      "body": "You are so right! I have felt like this for ever but could never put words to it.",
      "created_utc": 1590903714.0,
      "score": 2,
      "context": [
        {
          "id": "fsd3zu4",
          "author": "sAm_I_Am77",
          "body": "It’s hard now but it will eventually feel liberating. My treatment team wanted me to get rid of my scale and I told them if that’s the case then they are not to weigh me at any appointments. We went back and forth on this. I stood my ground when they insisted they needed to weigh me. I asked them why is it that I am always hearing ‘your weight doesn’t matter’ yet the first thing you all want to do at the beginning of every single appointment is have me hop on that cold metal square? If it doesn’t matter than why weigh me? I told them I have been seeing them long enough that they can all tell the minute we are in the room together how I am doing. They can feel the energy and vibe I’m giving off, no scale needed. I can manipulate a weight anyway. They said we need it as a measurement of your progress. A measurement of my progress? Really? Can a scale measure the joy on my sons face as we toast our subway sandwiches before taking a bite? How about the happiness on my kids faces when I ask them to play a board game? Can it measure the strength I feel from not giving in to an urge? Or how about the amount of love and support I have around me? There are many ways to measure progress without using a damn scale.",
          "created_utc": 1590877940.0
        }
      ]
    }
  ]
}