{
  "id": "gu5z5o",
  "subreddit": "fuckeatingdisorders",
  "author": "cryingfaeries",
  "created_utc": 1590955755.0,
  "title": "A reminder for you, and for me. (a rambling of my hopeful thoughts today)",
  "selftext": "The problem is the eating disorder. We cannot romanticize these things anymore. Anyone who’s been through multiple relapses knows that this stupid shit is not worth it. It makes everything worse. Life is awful when ED behaviors control your every thought, every move, everything you put or do not put in your mouth. Your body was never, EVER, the problem. The reason why people are so worried about you is because what you are doing to yourself is wrong. The only reason it ever feels right is because this is a real illness that clouds your sense of judgement. You do not need to change. You never did anything to not deserve to live the same life as the girls you’re jealous of. Eat the oatmeal. Make the pancakes. Bake the fucking cookies. The little things in life matter. Food matters. You deserve it. You are good. You are okay. I promise.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gu5z5o/a_reminder_for_you_and_for_me_a_rambling_of_my/",
  "score": 103,
  "num_comments": 5,
  "comments": [
    {
      "id": "fsgjwlw",
      "author": "iceypak",
      "body": "sweetest thing i’ve read in a while. wishing you the best <3",
      "created_utc": 1590959292.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fsgxmyp",
      "author": "sorcerers_apprentice",
      "body": "Thank you so much <3 needed this right now",
      "created_utc": 1590966562.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsgrr5x",
      "author": "Lucretiia",
      "body": "❤️",
      "created_utc": 1590963426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fshgj2z",
      "author": "WhatsaGime",
      "body": "I just find this so hard to take on board when my BMI genuinely puts me at being overweight :( Like I want to take this on board, but I just can’t while I’m genuinely fat and need to lose weight, even if I’m doing it incredibly unhealthily. I just need to get to a low normal BMI.",
      "created_utc": 1590977294.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fshgk7z",
      "author": "I_am_the_flower",
      "body": "I’ve been through so many relapses and the more I have them the worse they get. Thank you so much for this! 💜",
      "created_utc": 1590977313.0,
      "score": 2,
      "context": []
    }
  ]
}