{
  "id": "guzh1i",
  "subreddit": "fuckeatingdisorders",
  "author": "emarlee",
  "created_utc": 1591067952.0,
  "title": "Has anyone else struggled with their body and weight and stuff since they were a child?",
  "selftext": "I remember when I was 8 I joined an athletics club and I remember how I would look at everyone else there because I thought they all looked so good and had nice athletic bodies. I vividly remember just looking down at my stomach and wanting to be like them so bad. It’s mental I was literally 8 years old having these thoughts. I was looking through old photos when I still did athletics and my body was tiny like I was so so so slim and it amazes me how I thought I was fat and it’s evident I just wasn’t. \nIdk it’s made me realise that I’ll never see how I look in a non distorted way and that sucks because in my mind I’ll never be good enough",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/guzh1i/has_anyone_else_struggled_with_their_body_and/",
  "score": 154,
  "num_comments": 25,
  "comments": [
    {
      "id": "fsls510",
      "author": "Snwussy",
      "body": "I was a little bit older than that, 10 or 11, but yeah. I started puberty early so I was \"bigger\" than other girls for a couple years... and even after things slowed down in late middle school/early high school and I was objectively little, I still felt huge, especially around people who were even smaller than me. I don't know if I'll ever kick that perspective either, and tbh I feel bad for seeing other real human beings as triggering.",
      "created_utc": 1591073875.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fslycke",
      "author": "emelixabeth",
      "body": "yes. i have specific memories of girls i thought were skinny who i wanted to look like so badly, as early as 2nd grade. 7 or 8 years old. i hope someday i can be happy with my body the way it is naturally, but i have no idea what that's like.",
      "created_utc": 1591078476.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fslvg3g",
      "author": "insomniopath",
      "body": "yes. i started hating my body at around 10 years old. i have a collection of memories that i still constantly think about.. comments that were made, days i felt disgusting, etc. it’s so sad that those thoughts that came from those memories haven’t gone away",
      "created_utc": 1591076246.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fsm5kkd",
      "author": "theonlyamylucy",
      "body": "Yep. My earliest memories are of me hating myself... fast forward to 41 years of age and I think about all the life I’ve wasted that I can’t get back 😭",
      "created_utc": 1591084551.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsm6jyl",
      "author": "vanillapie__",
      "body": "Yeah, i remember hearing \"you're fat\" or \"you're a cow\" or something like that from my grandma, I believe I was about 10 years old, also my hips and shoulders and well bone structure in general were bigger than any girl's at my age so I felt really huge ):",
      "created_utc": 1591085447.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsmnkx7",
      "author": "Snorlax_the_Panda",
      "body": "Definitely. I went on my first “diet” at eight. I would give away my lunch at school. I thought at age 10 that I invented purging when I started making myself throw up in the shower.",
      "created_utc": 1591100962.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsnfkey",
      "author": "alibunn",
      "body": "I think when I was around 5 or so I caught a stomach bug that made me vomit, which was the first real time I was sick enough to be throwing up, and I noticed that after being sick I wouldn’t be hungry even if there was no food left in my stomach. I followed the logical (to me) train of thought that if a person were to do this on purpose, they could eat whatever they wanted, then throw up, and then they wouldn’t be hungry after, and then they wouldn’t get fat.\n\nLittle did I know I hadn’t just made that up in my head, and I was actually describing bulimia, which I would pick up at age 16 and continue to struggle with ad infinitum (I’m 21 now bulimia still going strong).\n\nI think what helped me make that connection in my brain was my mom’s offhand comment about some random woman we passed in the streets, she said something like “she looks like she throws up”, and for some reason it stuck with me. My mom never body shamed me directly but she would say snippy little comments about other people’s bodies, so I guess that made me start noticing my own body. I was always a chubby kid and I learned chubby=bad, therefore me=bad.",
      "created_utc": 1591116059.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsnolhv",
      "author": "ms211064",
      "body": "Yes. I was 8 as well. I remember a friend of mine asking me to show her \"how skinny you actually are\" and I lifted my shirt and sucked my belly in and just could not admit that I was sucking in. I remember constantly comparing my legs and belly to other kids and I always felt the size of a building. I recently found a food journal from when I was 7 years old! So sad. So crazy to think about.",
      "created_utc": 1591120333.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsm5k93",
      "author": "Sadgirl_exe",
      "body": "yes, I was bullied because i always have been really skinny  (no abuse, I just wasn't interested in eating and preferred eating veggies and fruit than junk food or meat)\nI just wanted to be loved like other girls, I hated my body so much I started to stuff my face to gain weight",
      "created_utc": 1591084543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsmooah",
      "author": "vivianaq",
      "body": "yes!! i did dance as a child strong probably 5-8/9. i always has a stomach unlike all of the other girls there that had a more athletic build. i would always cover up and hide my body because i was insecure with it. still working on it.",
      "created_utc": 1591101733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsnekh7",
      "author": "None",
      "body": "Dad called me fat when I was ten and it ruined my life. \n\nChildren shouldn’t think like that.",
      "created_utc": 1591115580.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsnj693",
      "author": "China--Doll",
      "body": "Oh yeah definitely, I’ve hated my reflection from like 5-6ish. I always felt like I looked different from other girls, like worse and this feeling has never changed. I feel like I’ve been aware of the social preference for skinny since I was stupidly young, Britney Spears was my goal as a tiny child, I couldn’t wait to come of age and look like her but I didn’t know she was so young at the time. \n\nI remember my weight obsessed mum once watched me playing sports with my class (she was a teacher at the same school) and on the way home she out of the blue told me I was the skinniest girl in the class, I was like 8 and remember feeling kinda happy, I think it was at that point I realised it was actually important to me.",
      "created_utc": 1591117773.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsm0q7w",
      "author": "extraketchupthx",
      "body": "In the 2nd or 3rd grade I was sitting next to a friend on our way to the lake in my parents car. I remember comparing the size of our thighs and wondering why mine was bigger.",
      "created_utc": 1591080370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsn1rjs",
      "author": "None",
      "body": "sadly yes. i grew up/still live in a pretty rough home with a huge presence of mental illness in my family, i remember having a serious obsession with being thin from the age of 6-7. my mom was a very skinny mom when i was younger and she would always say manipulative things about how she was so much thinner at my age? like i was a little kid at the time. i remember being jealous of my mom’s bf’s daughter for being so thin and hating how my thighs got bigger when i sat down. i remember just weighing myself, trying to workout so i could have a flat stomach and literally having such a weird obsession with food. eating disorders run in my family sadly, and i think it’s a combination of nature and nurture that made me like this. i started binging at the age of 9-10 and restricting at the age of 12. i’m a month shy of 18 and it sucks ive wasted such a prominent chunk of my life being consumed with my self image.",
      "created_utc": 1591109309.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsnjyis",
      "author": "dirtywhiteconverse",
      "body": "yes!!! i was always a chubby kid- even though my parents didn’t really allow juice/soda or sugar very often. my friends were always tiny and i had a belly and thick thighs. when i was 10 i remember asking my friend if she thought i looked fat on school picture day and she said “i mean, a little.” my anorexia started during 7th grade, i was 4’5 in 6th grade and shot up to 5’3 by the end of 7th grade, but i didn’t gain any weight at all leading from me being chubby to me being a god damn STICK.",
      "created_utc": 1591118147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fso6j59",
      "author": "None",
      "body": "My first memory is when I was 4, and I cried to my mom because my stomach stuck out too far. Shit is deep rooted",
      "created_utc": 1591128706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fso6u4q",
      "author": "67_Lizards",
      "body": "It was a gymnastics club for me, I wondered why my thighs were so much bigger than all of the other girls, then I look back on pictures of me and I was a twig",
      "created_utc": 1591128849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fso9c2a",
      "author": "None",
      "body": "Yes. When I was around 3-4 I remember looking at my calves and hating them, told my mom they made me feel like a horse. In my elementary school we sat on the floor in music class, like marked spots, every year I would be preoccupied staring at my legs as I sat there thinking they were so much bigger than everyone else’s. It never went away. ETA: to be fair, my best friend growing up was this super painfully tiny girl and by 3rd grade I *was* legit overweight, so I didn’t pull it out of thin air. But even when I hit puberty and dropped to a really healthy weight I couldn’t shake the fear of being big and started doing unhealthy stuff to become smaller.",
      "created_utc": 1591130022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsoa9uy",
      "author": "xxkillerqxeenxx",
      "body": "I was 3 when I felt ugly about myself",
      "created_utc": 1591130463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsofloz",
      "author": "SuplexPrincess",
      "body": "My first memory of hating my body, I was maybe five years old. I had always been very small and underdeveloped height and weight wise, like I was in negative percentiles for growth. People commented on this constantly, how tiny I was and whatever. Until a random comment that there was another girl that was possibly smaller than I was. The person didn’t mean anything by it, but I remember the immense shame that came over me. It just got worse and worse from there, nitpicking everything about myself and grabbing at “fat” on my body, trying to look thinner, absolutely hating myself, all before I was in kindergarten",
      "created_utc": 1591133007.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsoivvh",
      "author": "ih8mesomuch",
      "body": "Ever since I was 6! I had a severe binge eating disorder. My only memories from childhood are eating and crying simultaneously. Now 12 years later we’re repping anorexia. :/ I wish I at least had time to be an innocent and carefree child. 6 is too young to look at nutrition labels. My thoughts are with you all x",
      "created_utc": 1591134591.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fssk7gb",
      "author": "jkaamaine",
      "body": "I was very bony as a child. But when I was 6, I saw all my classmates had legs thinner than mine, even though I was the skinniest one. It really bothered me at that time (my legs still bother me)",
      "created_utc": 1591220735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsnwcv6",
      "author": "emelixabeth",
      "body": "I also remember the tummy sucking starting as a kid! I have a memory of one day at lunch in 2nd grade, us girls played a \"game\" where we each sucked in or didn't suck in, and everyone else guessed which was our \"real\" tummy.",
      "created_utc": 1591123971.0,
      "score": 2,
      "context": [
        {
          "id": "fsnolhv",
          "author": "ms211064",
          "body": "Yes. I was 8 as well. I remember a friend of mine asking me to show her \"how skinny you actually are\" and I lifted my shirt and sucked my belly in and just could not admit that I was sucking in. I remember constantly comparing my legs and belly to other kids and I always felt the size of a building. I recently found a food journal from when I was 7 years old! So sad. So crazy to think about.",
          "created_utc": 1591120333.0
        }
      ]
    },
    {
      "id": "fsmuapb",
      "author": "cone_hat_crown_crow",
      "body": "Same! I was never really aware of my body until I was bullied. Cue dropping sports because of teasing, hating myself, gaining weight, and then rolling into bulimia until my early 20s. It was so hard to heal from that - and I'm still working on it! Bullies suck.",
      "created_utc": 1591105275.0,
      "score": 2,
      "context": [
        {
          "id": "fsm5k93",
          "author": "Sadgirl_exe",
          "body": "yes, I was bullied because i always have been really skinny  (no abuse, I just wasn't interested in eating and preferred eating veggies and fruit than junk food or meat)\nI just wanted to be loved like other girls, I hated my body so much I started to stuff my face to gain weight",
          "created_utc": 1591084543.0
        }
      ]
    },
    {
      "id": "fso0ueo",
      "author": "emarlee",
      "body": "Oh my goodness I remember doing that. I remember I was so self conscious of my tummy that I would then only suck in even when people couldn’t see my tummy, it literally made me feel so sick like the stomach ache it caused was unbearable.",
      "created_utc": 1591126085.0,
      "score": 2,
      "context": [
        {
          "id": "fsnolhv",
          "author": "ms211064",
          "body": "Yes. I was 8 as well. I remember a friend of mine asking me to show her \"how skinny you actually are\" and I lifted my shirt and sucked my belly in and just could not admit that I was sucking in. I remember constantly comparing my legs and belly to other kids and I always felt the size of a building. I recently found a food journal from when I was 7 years old! So sad. So crazy to think about.",
          "created_utc": 1591120333.0
        },
        {
          "id": "fsnwcv6",
          "author": "emelixabeth",
          "body": "I also remember the tummy sucking starting as a kid! I have a memory of one day at lunch in 2nd grade, us girls played a \"game\" where we each sucked in or didn't suck in, and everyone else guessed which was our \"real\" tummy.",
          "created_utc": 1591123971.0
        }
      ]
    }
  ]
}