{
  "id": "gy6b92",
  "subreddit": "fuckeatingdisorders",
  "author": "Clear-Scene",
  "created_utc": 1591506276.0,
  "title": "Recovery tips: Extreme hunger is normal! You are NOT overeating or binging. Your hunger/metabolism is not broken. It's scary, but you really need to listen to your body to recover.",
  "selftext": "**Tl;dr** when recovering from a restrictive eating disorder, you will probably eat way more than normal. It is not binging. It is not overeating. You will not become obese. It will not last forever. Your body needs extra energy right now to repair everything that been hurt by starvation. It is very very very important to eat what you want to eat right now.\n\n&#x200B;\n\nA lot of people recovering from restrictive eating disorders experience extreme hunger. You might find yourself eating incredible amounts of food, easily two or three times more than the average healthy person would. DO NOT PANIC! This is a normal part of recovery!\n\nYou might think (like I did) that you're not 'actually' hungry because although you feel a strong desire to eat, you don't feel the physical sensation of hunger. It might feel like you're simply eating because you're bored. It might feel like you're overeating or binging. YOU ARE NOT. The reason you don't feel physically hungry is simply because your digestive system isn't used to eating large amounts of food. Everything from your digesting enzymes to your gut bacteria have been harmed by lack of food. Your body REALLY REALLY needs energy to repair itself, but your digestive system isn't prepared for the need for large amounts of food. Your body is sending signals to the brain, like \"EAT FOOD NOW! WE NEED ENERGY TO REPAIR THE STARVATION DAMAGE!\" which makes you want to eat food. At the same time, your stomach is sending signals to the brain, like \"I'm already full bro. All these enzymes and bacteria and stuff aren't used to processing this much food,\" which makes you not feel hungry (even though you REALLY NEED FOOD).\n\nThink about it: The average person needs X calories give or take per day to function and stay alive. You need that base X calories or so PLUS extra that you need to repair all that has been damaged during your period of starvation: Your digestive system, muscles, bones, immune system, pretty much everything. You NEED energy to rebuild all that has been torn down. (most) People simply can't recover from starvation without eating large amounts of food.\n\nIf you usually sleep 8 hours a night, and then you restrict yourself to only 4 hours of sleep for a month, the next time you go to sleep without restriction you will probably sleep way longer than usual. It's the same with starvation recovery! If you usually eat X calories every day, and then you restrict yourself to half that amount for a long time, when you eat without restriction again you will probably eat way more than usual.\n\nRight now, the most important thing is for you to eat what your body needs you to eat. It doesn't matter how much you've already eaten today, or yesterday, or last week: You need to keep giving your body what is desperately needs. Your digestive system WILL adapt to be normal again. Your hunger WILL become normal again. The bloating and water retention WILL stop. It might take months, depending on the person. If you have a bad day where you restrict or purge, it's okay, just get back to the grind as soon as you can. This is the hardest part, but you NEED to stick with it as well as you can. I promise it is worth it.\n\nYou are not going to 'get used to' eating these extreme amounts of food. Your hunger levels are not 'broken' and neither is your metabolism. You are not going to become obese. The hunger will go away eventually, once your body doesn't have such a need for energy. You need a lot of energy to repair yourself. Trust the process, and trust your body.\n\nIt is true that some people develop a binge eating disorder after recovering from anorexia, but most people don't. During this phase of recovery, it is really too early to say whether or not you have or will have a binge eating disorder. Worrying about it won't do you any good. I would personally recommend that you seek professional help if you find yourself eating large amounts of food in short periods of time without feeling in control at least **eight months** after you begin your recovery process (but this really depends on the person, this is just a guideline to give you peace of mind that just because you are still really hungry 2 months into recovery, it doesn't mean you are binging). If you are afraid that you are binging, just know that your fear is almost definitely unfounded. Remember, eating disorders make you think stupid things. Right now your number one priority should be to recover.\n\nRemind yourself of the facts: You are sick. You need food to recover. You need to eat what your body is telling you to eat. This really really sucks, but it will not last forever. You can and will get better. You can and will live a normal life without extreme hunger and bloating, and without constant thoughts about food. It is going to be worth it.\n\n&#x200B;\n\nIt might be helpful to eat calorie-dense foods during this time, and eat lots of small meals or snacks throughout the day. This will help out your digestive system while it's adjusting. Fast food, processed food like candy and chips, chocolate, nuts, and ice cream are all great options. Liquid calories like milkshakes and ensures are also great! \n\n&#x200B;\n\nAlso important: Your extreme hunger may show up from day one, or it might appear a few weeks in. It may be constant, and it may come and go. You might not have it at all. No matter what your hunger looks like, it is normal. And it will go away in time.\n\nAlso also important: Some people worry about overfeeding (eating too much over a period of starvation has caused deaths in the past). Overfeeding in eating disorder patients almost exclusively occurs when family force feed the patient, not when the patient is feeding themselves. Your body generally knows how to keep you alive. There have been exceptions where people have pushed themselves and eaten so much after a period of starvation, like some holocaust survivors, but if you listen to your body you will almost certainly be just fine. If you are worried about your ability to regulate how much food you're eating, please consider getting inpatient treatment.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gy6b92/recovery_tips_extreme_hunger_is_normal_you_are/",
  "score": 212,
  "num_comments": 12,
  "comments": [
    {
      "id": "ft9lowe",
      "author": "Elyxionnn",
      "body": "This helped me a lot, because I’ve been having extreme hunger for a few days. But I’m scared I’ll gain soooo much, because I lost barely 10kg and I feel like im not worth recovery",
      "created_utc": 1591536555.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fta2de9",
      "author": "vOcaliseSquiffy",
      "body": "<3",
      "created_utc": 1591546556.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ftajmng",
      "author": "GrandVizierofAgrabar",
      "body": "I wish I had this, it’s so hard to eat without hunger.",
      "created_utc": 1591555786.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iy3is5n",
      "author": "None",
      "body": "I know, this post is two years old, but these lines were soothing my mind and soul so much. Thank you. I'm experiencing extreme hunger at the moment and it is just shocking to feel hunger again after the last two and a half years of restrictive eating. Especially the craving for all those things, I did not allow myself to eat during my eating disorder (I could eat thousands of waffles at the moment for example). It is so soothing to read those lines above and to see, that I'm not alone and theses signals are normal and more importantly *healthy.* \n\n The right way to go is to trust my body and to welcome the feeling of hunger, feel it and give in to that feeling. My body knows, what it needs during recovery.\n\nIf you, dear author, should read this: Thank you!",
      "created_utc": 1669644100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fum3r0f",
      "author": "BH_crates",
      "body": "Thank you for taking the time to write this, I just hope to let me ask you couple of skeptical questions if you don't mind.\n\nSo do you have any scientific evidence of any of this? Because here was the only place I've found such piece of advice. I know it makes perfect sense from a logical perspective, but correlation doesn't necessarily imply causation.\n\nI hope not to take my reply from a negative perspective, I'm someone who's struggling so much of EDA as well, and end up into those pretty well known binging cycles, but I'd rather take something proved and apply it, especially when it's health related.",
      "created_utc": 1591979823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kh1bktg",
      "author": "swiftie568",
      "body": "Please you are worth recovery",
      "created_utc": 1704798416.0,
      "score": 3,
      "context": [
        {
          "id": "ft9lowe",
          "author": "Elyxionnn",
          "body": "This helped me a lot, because I’ve been having extreme hunger for a few days. But I’m scared I’ll gain soooo much, because I lost barely 10kg and I feel like im not worth recovery",
          "created_utc": 1591536555.0
        }
      ]
    },
    {
      "id": "krab5ik",
      "author": "SolidAd2121",
      "body": "Same... I also lost only 10kg or even less, but I managed to pull myself together before my eating disorder got worse. Now I am eating normally again, already for two days after a month of restricting, and I did not weigh myself because I am scared. But I know I should not do it anyway. I know a lot of time has passed since you wrote this comment, but how did it work out for you?",
      "created_utc": 1708433987.0,
      "score": 1,
      "context": [
        {
          "id": "ft9lowe",
          "author": "Elyxionnn",
          "body": "This helped me a lot, because I’ve been having extreme hunger for a few days. But I’m scared I’ll gain soooo much, because I lost barely 10kg and I feel like im not worth recovery",
          "created_utc": 1591536555.0
        }
      ]
    },
    {
      "id": "iyo9gx0",
      "author": "None",
      "body": "Hi :) I’m also in recovery right now and am glad to find someone whose also recovering. I’ve been in quasi-recovery since January, relapsed in august and started recovery again in September. All throughout this year I had extreme hunger but always compensated for it…which is what I mean by quasi recovery. However since September I let the EH do whatever it needed to do without compensation. And what did it do? I ate, I ate a lot. Amounts that seem to be terrifying and way over what’s normal. But here I am, it’s December and I no longer have extreme hunger. It started to slowly balance out in November and now I am developing normal hunger cues again. But obviously not everyone has it for 2 months, some might experience EH for 2 weeks some for 1 year and some even longer. Everyone’s journey is unique. I have been suffering from ana ever since February 2019… that’s a lot of time I missed out on. I missed out on social gatherings. Pizza on my own birthday. Eating take away with friends. I lost friendships. I lost so many special memories… all because of ana. What I want you to take away and remember deeply and every single day are these points: \n\n1: EH is normal. Your body is in need of a LOT of calories because not only does it need to repair damage, it needs to trust you again. It needs to know that you are feeding your body and yes it will take a while but don’t be afraid. \n\n2: weight gain and fat gain is NEEDED. Now this is a scary fact. I gained fat and am afraid but hear me out. We need it. You will have to gain weight in order to recover your organs and your brain including your mind and soul. It is totally normal to overshoot your pre ED weight and it is needed. The fat is there to protect and repair ! I want to say be proud and happy about it but that would be dishonest because I myself am not happy about it but every single day I tell myself that it is FINE! And NEEDED! You and I both didn’t give our bodies what they needed for a very long period of time. Our bodies deserve to be well nourished now and forever ! Our bodies deserve it. Treat your body with care and love. \n\n3: People will think things. We never know what they might be thinking of us. My aunts might think or even say out loud: oh she gained weight. But that is not our business! We know our journey THEY DONT. For them I’ve been way too skinny all the time( which yes they have been right lol they had their reason to be concerned) so if they now think I gained too much then so be it. Which leads me to the last point \n\n4: our job right now is not to be aesthetic or lily rose depp / coquette core whatsoever LMAO. Our job right now is to repair severe damage. Damage not only to our body, organs, soul and brain but to our life. \n\nI am sure that one year from now, you and I will be happy and healthy and we will be thinking back to this with PRIDE ! This is our story. Our life and we will get through this shitty but beautiful recovery process and we will be fully recovered. So I wish you all the best. I love you and you’re strong and brave for choosing recovery and even though we are both scared we continue to fight this… and that to me is quite honestly FEARLESS ! \n\nPs: you are VALID",
      "created_utc": 1670017201.0,
      "score": 1,
      "context": [
        {
          "id": "iy3is5n",
          "author": "None",
          "body": "I know, this post is two years old, but these lines were soothing my mind and soul so much. Thank you. I'm experiencing extreme hunger at the moment and it is just shocking to feel hunger again after the last two and a half years of restrictive eating. Especially the craving for all those things, I did not allow myself to eat during my eating disorder (I could eat thousands of waffles at the moment for example). It is so soothing to read those lines above and to see, that I'm not alone and theses signals are normal and more importantly *healthy.* \n\n The right way to go is to trust my body and to welcome the feeling of hunger, feel it and give in to that feeling. My body knows, what it needs during recovery.\n\nIf you, dear author, should read this: Thank you!",
          "created_utc": 1669644100.0
        }
      ]
    },
    {
      "id": "ga59vew",
      "author": "Clear-Scene",
      "body": "Sorry for the extremely late reply, I hope you're doing well!\n\nWhat I was saying is based off of what my nutritionist has told me, conversations I've had with people recovered from eating disorders, and research I did during a time when I was doing a lot of research about weight loss and starvation. Hunger cues and such are still not entirely agreed upon by the scientific community, but I wrote this post based on what I believe from what I've heard. If you want to do your own research, \n I'm sure you will be able to find more by looking up key words like set weight, weight homeostasis, food/intake regulation, weight regulation, energy expenditure, dual regulation model, and overshoot weight.\n\nBut there is one study in particular that I remember! The Minnesota starvation study (or whatever it's called) is a pretty famous study where men were put into a severe caloric deficit for 6 months. The results were, obviously, that they were very weak and miserable. After they were set free, the men ate A LOT, upwards of 10,000 calories a day because they had such extreme hunger (this leveled off over time). Most (I think all, I don't remember) overshot their original weight, but then most (if not all) lost the overshoot weight and returned to the original weight within a few months or even years. There is no DEFINITE PROOF that this is because of their metabolisms and how we have evolved to survive, but it is a pretty safe guess and a lot of scientists think it is the case. It would be a pretty difficult thing to prove. The men's eating behaviors also stayed abnormal for a long time.\n\nThis has also been observed in overfeeding studies, where the participants return to their normal weight and normal hunger levels after the study is over (I don't remember any specifically, sorry).\n\nI think I also mentioned in the original post that overfeeding is very rare. I'm not sure if there have been studies on this, but my nutritionist (who has worked in eating disorder treatment centers for decades) believes that most overfeeding occurs when a patient is forced to eat too much by their family, because it is extremely difficult to overfeed yourself. (In this case, overfeeding doesn't mean eating too much so you gain too much weight, it means you are eating too much too quickly when you're body isn't ready for it, which can have other health effects).\n\nIt's very difficult to prove much of anything in the world of nutrition. People are still arguing about whether or not eggs are a superfood or pure evil, or whether too much salt or bad for you or if that is just confounded with processed food. I understand wanting to be safe and follow knowledge that you know to be true, but that isn't really an option here. But in my opinion, the least dangerous thing to do is to follow your hunger signals as best you can. But of course you should talk to a professional about it and do your own research! Binging has not been a problem for me, and I'm not about to tell you how to deal with it because I probably know less about it than you do.\n\nI hope you're doing well and staying safe!",
      "created_utc": 1603696053.0,
      "score": 4,
      "context": [
        {
          "id": "fum3r0f",
          "author": "BH_crates",
          "body": "Thank you for taking the time to write this, I just hope to let me ask you couple of skeptical questions if you don't mind.\n\nSo do you have any scientific evidence of any of this? Because here was the only place I've found such piece of advice. I know it makes perfect sense from a logical perspective, but correlation doesn't necessarily imply causation.\n\nI hope not to take my reply from a negative perspective, I'm someone who's struggling so much of EDA as well, and end up into those pretty well known binging cycles, but I'd rather take something proved and apply it, especially when it's health related.",
          "created_utc": 1591979823.0
        }
      ]
    },
    {
      "id": "ga5ffls",
      "author": "BH_crates",
      "body": "First of all, I'm so much thankful for your reply, and no worries about being late, we all got our own schedules ;)\n\nTo be totally honest, I pretty much have lots of thoughts when it comes to nutrition that haven't been scientifically proven yet, and I'm so much inclined into believing in them than other (sometimes unreasonable) scientific researches and papers. My thoughts are mainly biased by my own experiences, and body feelings.\n\nI agree so much with your opinion on scientific research in the nutrition field. Lots of nutrition scientific papers are based on observational results on a randomly-selected sample of people (not talking about biochemistry and biological research in here), which is statistically questionable. I understand we -humans- generally have no other options when it comes to nutrition research, but I'd still be in doubt with the contents of those papers. \n\nMy reasons are 1) What proves that their \"random sample\" is indeed random? Nothing provided so far, this is always mentioned as a fact. 2) While they acknowledge the existence of LOTS of known and unknown variables when it comes to human body and nutrition, every paper -whether explicitly or implicitly- always assumes *everything* is constant, and only one or few more variables that the paper talks about and demonstrates, which is definitely not reasonable, the variables are there for a reason and they definitely bias/affect the results one way or another. Again, I'm aware that we got no other options, however that shouldn't \"force\" people to believe them or else they're denying scientific facts (lots of people religiously follow those nutrition experiments results, and I guess the majority are simply reading the titles without even bothering reading the research itself).\n\nSorry for the long text, used to write academic essays so you can imagine haha! I guess TL;DR is quoting from your reply \"It's very difficult to prove much of anything in the world of nutrition\".\n\nAgain, thank you so much for your reply, and wish you good luck in your recovery journey! :)",
      "created_utc": 1603702409.0,
      "score": 1,
      "context": [
        {
          "id": "fum3r0f",
          "author": "BH_crates",
          "body": "Thank you for taking the time to write this, I just hope to let me ask you couple of skeptical questions if you don't mind.\n\nSo do you have any scientific evidence of any of this? Because here was the only place I've found such piece of advice. I know it makes perfect sense from a logical perspective, but correlation doesn't necessarily imply causation.\n\nI hope not to take my reply from a negative perspective, I'm someone who's struggling so much of EDA as well, and end up into those pretty well known binging cycles, but I'd rather take something proved and apply it, especially when it's health related.",
          "created_utc": 1591979823.0
        },
        {
          "id": "ga59vew",
          "author": "Clear-Scene",
          "body": "Sorry for the extremely late reply, I hope you're doing well!\n\nWhat I was saying is based off of what my nutritionist has told me, conversations I've had with people recovered from eating disorders, and research I did during a time when I was doing a lot of research about weight loss and starvation. Hunger cues and such are still not entirely agreed upon by the scientific community, but I wrote this post based on what I believe from what I've heard. If you want to do your own research, \n I'm sure you will be able to find more by looking up key words like set weight, weight homeostasis, food/intake regulation, weight regulation, energy expenditure, dual regulation model, and overshoot weight.\n\nBut there is one study in particular that I remember! The Minnesota starvation study (or whatever it's called) is a pretty famous study where men were put into a severe caloric deficit for 6 months. The results were, obviously, that they were very weak and miserable. After they were set free, the men ate A LOT, upwards of 10,000 calories a day because they had such extreme hunger (this leveled off over time). Most (I think all, I don't remember) overshot their original weight, but then most (if not all) lost the overshoot weight and returned to the original weight within a few months or even years. There is no DEFINITE PROOF that this is because of their metabolisms and how we have evolved to survive, but it is a pretty safe guess and a lot of scientists think it is the case. It would be a pretty difficult thing to prove. The men's eating behaviors also stayed abnormal for a long time.\n\nThis has also been observed in overfeeding studies, where the participants return to their normal weight and normal hunger levels after the study is over (I don't remember any specifically, sorry).\n\nI think I also mentioned in the original post that overfeeding is very rare. I'm not sure if there have been studies on this, but my nutritionist (who has worked in eating disorder treatment centers for decades) believes that most overfeeding occurs when a patient is forced to eat too much by their family, because it is extremely difficult to overfeed yourself. (In this case, overfeeding doesn't mean eating too much so you gain too much weight, it means you are eating too much too quickly when you're body isn't ready for it, which can have other health effects).\n\nIt's very difficult to prove much of anything in the world of nutrition. People are still arguing about whether or not eggs are a superfood or pure evil, or whether too much salt or bad for you or if that is just confounded with processed food. I understand wanting to be safe and follow knowledge that you know to be true, but that isn't really an option here. But in my opinion, the least dangerous thing to do is to follow your hunger signals as best you can. But of course you should talk to a professional about it and do your own research! Binging has not been a problem for me, and I'm not about to tell you how to deal with it because I probably know less about it than you do.\n\nI hope you're doing well and staying safe!",
          "created_utc": 1603696053.0
        }
      ]
    },
    {
      "id": "garm8n9",
      "author": "Clear-Scene",
      "body": "Very well said!\nI guess my philosophy as far as refeeding goes is that science can't predict how to do it right, so just trust your body and eat what and when you want. And yes, maybe I am trying to \"force\" other people to also think that way with very limited evidence, but I honestly think that it is the safest way to think for people recovering from a restrictive eating disorder. They are trying to learn to trust their body and not override their natural instincts to eat. I'm afraid that it would be harmful to tell them that there might be a specific science-approved method to recovery and that they might be doing it 'wrong'. Carefully planning out what they are eating is the exact opposite of what should be happening in the ideal recovery, at least in my opinion. Excessive control over food is what led to this whole mess.\n\nI probably should have at least mentioned that there is no solid scientific proof of my claims in my original post. But to be fair I am just trying to make an argument here. I don't want to argue for both sides when the other side is, to some extent, \"don't listen to your body, take control of your eating habits\". Even if we DO find out someway that I'm wrong and that is the best way to go to recover from starvation, I still think it would be psychologically harmful for people with eating disorders who have to prepare their own food.\n\nI just said the same thing like 5 times, sorry! Thanks for the nice reply, and thanks for the thanks for the reply",
      "created_utc": 1604208494.0,
      "score": 2,
      "context": [
        {
          "id": "fum3r0f",
          "author": "BH_crates",
          "body": "Thank you for taking the time to write this, I just hope to let me ask you couple of skeptical questions if you don't mind.\n\nSo do you have any scientific evidence of any of this? Because here was the only place I've found such piece of advice. I know it makes perfect sense from a logical perspective, but correlation doesn't necessarily imply causation.\n\nI hope not to take my reply from a negative perspective, I'm someone who's struggling so much of EDA as well, and end up into those pretty well known binging cycles, but I'd rather take something proved and apply it, especially when it's health related.",
          "created_utc": 1591979823.0
        },
        {
          "id": "ga59vew",
          "author": "Clear-Scene",
          "body": "Sorry for the extremely late reply, I hope you're doing well!\n\nWhat I was saying is based off of what my nutritionist has told me, conversations I've had with people recovered from eating disorders, and research I did during a time when I was doing a lot of research about weight loss and starvation. Hunger cues and such are still not entirely agreed upon by the scientific community, but I wrote this post based on what I believe from what I've heard. If you want to do your own research, \n I'm sure you will be able to find more by looking up key words like set weight, weight homeostasis, food/intake regulation, weight regulation, energy expenditure, dual regulation model, and overshoot weight.\n\nBut there is one study in particular that I remember! The Minnesota starvation study (or whatever it's called) is a pretty famous study where men were put into a severe caloric deficit for 6 months. The results were, obviously, that they were very weak and miserable. After they were set free, the men ate A LOT, upwards of 10,000 calories a day because they had such extreme hunger (this leveled off over time). Most (I think all, I don't remember) overshot their original weight, but then most (if not all) lost the overshoot weight and returned to the original weight within a few months or even years. There is no DEFINITE PROOF that this is because of their metabolisms and how we have evolved to survive, but it is a pretty safe guess and a lot of scientists think it is the case. It would be a pretty difficult thing to prove. The men's eating behaviors also stayed abnormal for a long time.\n\nThis has also been observed in overfeeding studies, where the participants return to their normal weight and normal hunger levels after the study is over (I don't remember any specifically, sorry).\n\nI think I also mentioned in the original post that overfeeding is very rare. I'm not sure if there have been studies on this, but my nutritionist (who has worked in eating disorder treatment centers for decades) believes that most overfeeding occurs when a patient is forced to eat too much by their family, because it is extremely difficult to overfeed yourself. (In this case, overfeeding doesn't mean eating too much so you gain too much weight, it means you are eating too much too quickly when you're body isn't ready for it, which can have other health effects).\n\nIt's very difficult to prove much of anything in the world of nutrition. People are still arguing about whether or not eggs are a superfood or pure evil, or whether too much salt or bad for you or if that is just confounded with processed food. I understand wanting to be safe and follow knowledge that you know to be true, but that isn't really an option here. But in my opinion, the least dangerous thing to do is to follow your hunger signals as best you can. But of course you should talk to a professional about it and do your own research! Binging has not been a problem for me, and I'm not about to tell you how to deal with it because I probably know less about it than you do.\n\nI hope you're doing well and staying safe!",
          "created_utc": 1603696053.0
        },
        {
          "id": "ga5ffls",
          "author": "BH_crates",
          "body": "First of all, I'm so much thankful for your reply, and no worries about being late, we all got our own schedules ;)\n\nTo be totally honest, I pretty much have lots of thoughts when it comes to nutrition that haven't been scientifically proven yet, and I'm so much inclined into believing in them than other (sometimes unreasonable) scientific researches and papers. My thoughts are mainly biased by my own experiences, and body feelings.\n\nI agree so much with your opinion on scientific research in the nutrition field. Lots of nutrition scientific papers are based on observational results on a randomly-selected sample of people (not talking about biochemistry and biological research in here), which is statistically questionable. I understand we -humans- generally have no other options when it comes to nutrition research, but I'd still be in doubt with the contents of those papers. \n\nMy reasons are 1) What proves that their \"random sample\" is indeed random? Nothing provided so far, this is always mentioned as a fact. 2) While they acknowledge the existence of LOTS of known and unknown variables when it comes to human body and nutrition, every paper -whether explicitly or implicitly- always assumes *everything* is constant, and only one or few more variables that the paper talks about and demonstrates, which is definitely not reasonable, the variables are there for a reason and they definitely bias/affect the results one way or another. Again, I'm aware that we got no other options, however that shouldn't \"force\" people to believe them or else they're denying scientific facts (lots of people religiously follow those nutrition experiments results, and I guess the majority are simply reading the titles without even bothering reading the research itself).\n\nSorry for the long text, used to write academic essays so you can imagine haha! I guess TL;DR is quoting from your reply \"It's very difficult to prove much of anything in the world of nutrition\".\n\nAgain, thank you so much for your reply, and wish you good luck in your recovery journey! :)",
          "created_utc": 1603702409.0
        }
      ]
    }
  ]
}