{
  "id": "gychjz",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1591536879.0,
  "title": "During my severely UW days, I had to unfollow and block food accounts because I couldn’t handle looking at photos of food without salivating.",
  "selftext": "It was mental torture. \n\nMy BMI was >!16!< and I consumed >!1200-1400!< calories which may not even seem that bad. I maintained that BMI for 3 months until my body couldn’t handle it anymore and I absolutely couldn’t stop eating for 2 weeks straight once I started self recovery. It’s been 2.5 months now. \n\nI’ve had body issues and restricting my food intake since I was 12, but it really got the worse about half a year ago when I wanted to lose “just 5 lbs” after a vacation, which spiraled to seeing how I could manipulate the numbers and “I’ll lose a little more just in case I need wiggle room” and all that temporary bullshit. \n\nLooking back now, as sad as I am to put myself through that, I feel like I needed that first hand self experience to realize how miserable and torturous that was. I’m able to go out to brunch with friends now (albeit still get hella anxious hours and days before, but I need to keep doing it), I’m able to eat peanut butter and pastries that I banned myself from eating for far too long, I don’t have chest pains anymore, I’m not thinking about food 24/7, etc. I’m still not at a healthy BMI and am in this quasi recovery thing, but gaining >!7 lbs!< was honestly the least my body needed. Fuck the mental torture and sad life I had. I need to make up the years from restricting my damn social life when everything opens up again.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/gychjz/during_my_severely_uw_days_i_had_to_unfollow_and/",
  "score": 98,
  "num_comments": 5,
  "comments": [
    {
      "id": "ftaj2bg",
      "author": "cone_hat_crown_crow",
      "body": "Cheers!! And, yeah, fuck mental torture! You don't deserve to be tortured - by yourself or anyone else. Also, a million thanks for your use of spoiler tags.",
      "created_utc": 1591555474.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fta3v8g",
      "author": "vOcaliseSquiffy",
      "body": ":’) <33333333 you deserve recovering op, i’m so proud of you honestly.",
      "created_utc": 1591547361.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ftah6zq",
      "author": "amerynpeters",
      "body": "Awwww op I’m so happy for you my love ♥️♥️♥️",
      "created_utc": 1591554448.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ftal0c1",
      "author": "b00burn",
      "body": "SO so so so proud of you! You are doing what's best for yourself and taking your recovering in your own hands! Kudos!",
      "created_utc": 1591556547.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ftasr8h",
      "author": "EastofEatin",
      "body": "I know it's hard but I am so SO proud of you! You deserve to recover, be happy, and eat 💕 congrats on 2 and a half months!!!",
      "created_utc": 1591560776.0,
      "score": 1,
      "context": []
    }
  ]
}