{
  "id": "h9jo90",
  "subreddit": "fuckeatingdisorders",
  "author": "Gothsyndrome",
  "created_utc": 1592238716.0,
  "title": "Any POCs here that feel really alone and invisible sometimes?",
  "selftext": "I do not mean to invalidate anyone or make anyone feel guilty or feel uncomfortable, but I really need to vent. Please do not take offense. I just really need to let this out because it’s been bothering me for awhile. \n\nI feel so alone at times. I feel so underrepresented by the fucking media and my therapist doesn’t understand that. I rarely see any videos about women of color suffering from these diseases. We are invisible. I feel invisible. And because of my ethnicity we tend to have “curvier” bodies. Not that mine is that curvy right now, since I’m UW, but I still see the boxiness of it. And the culture and having immigrant parents that don’t understand my ed just kinda like feels bleh. \n\nMy doctor told me I need to go inpatient and I do not want to go because I am scared I won’t see anyone who “looks” like me. It’ll make me feel like shit and alone. I know this sounds stupid or weird and it may be, but it’s something that is important to me. \n\nI want to feel heard, and on this platform I DO feel heard. Thank you all so much for always being here for everyone. We don’t have to see how we look like to support one another and that’s what I love about this subreddit. You guys fucking rock ❤️. \n\nI just wish it was like this outside of here basically.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/h9jo90/any_pocs_here_that_feel_really_alone_and/",
  "score": 154,
  "num_comments": 17,
  "comments": [
    {
      "id": "fux2mjj",
      "author": "cleonardo96",
      "body": "your not alone, I'm a native woman with an eating disorder. everyone in my tribe has an addiction problem and mine manifested into an eating disorder that none of them knows about. I know it's not the same and I can't compare my ed to my cousin's meth/drug/alcohol problems but its a similar thing y'know. to my knowledge, I'm the only one with this specific addiction and it feels lonely. tbh sometimes when I'm deep in a spiral I wish I had wound up with the meth addiction (i never will try it or any other drugs because I don't want an addiction) because my tribe is very curvy/ everyone is a bit heavy except the ones on meth and despite my ed or maybe because of it I'm on the heavier side and at least my cousins with other addictions have each other and a support system in place because they go through it together and I'm alone\n\n&#x200B;\n\nI've been threatened with inpatient too and I didn't  want to go either, not because no one would look like me but because that was always a threat my mom would use whenever i showed emotion that was \"inappropriate\" either too happy too sad too angry or whatever she didn't agree with me feeling she would threaten to send me away to \"a mental hospital\"",
      "created_utc": 1592240315.0,
      "score": 54,
      "context": []
    },
    {
      "id": "fuxdtsq",
      "author": "None",
      "body": "I'm an Asian American woman. (Well, mixed race with portuguese and Korean ancestry)\n\nI get the feeling of being underrepresented and invalidated. South Korea has really toxic diet culture as well. It's hard having something like an ED but to have it invalidated bc you don't fit the media stereotype of white, middle-class, UW, anorexic (not to invalidate anyone who comes from this background)",
      "created_utc": 1592245446.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fux7hi2",
      "author": "None",
      "body": "youre not alone, im also a poc and yeah its fucking hard. it feels like im not the right demographic to have an ed but we're all in this shit together",
      "created_utc": 1592242578.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fuxeex7",
      "author": "ashlizlee",
      "body": "I cannot fathom why anyone would take offense. I’m so sorry you’re going through this and that you have the added fears of not having someone understand or relate to you in the way you need right now. I do not need to see you to say you are beautiful and strong and deserve compassion and support from people who get what you’re going through.",
      "created_utc": 1592245703.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fuxeuac",
      "author": "doreenmng",
      "body": "i'm a woc and i feel ya babe. its very hard, i spend a lot of time seeking out people of color who struggle with ED on youtube and things and it helps to feel less alone (of course this isnt good to do for some ppl). but you are totally not alone and ik what you mean about how our bodies are very different from the medias typical white girl anorexic. youre not alone and totally valid",
      "created_utc": 1592245893.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fuxqyyu",
      "author": "Various-List",
      "body": "Wow, you have NO reason to apologize. If anyone is offended by your experience, they can fuck off!! \n\nI’m truly sorry you deal with this on top of your ED. As if this disease doesn’t blow already.",
      "created_utc": 1592251783.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fuxuxsi",
      "author": "None",
      "body": "I can’t personally relate bc I’m white, but I’ve heard quite a few people talk about this on various platforms. You’re not the only POC that feels that way. :( \n\nSorry all I can offer is second-hand assurance that you’re not alone.",
      "created_utc": 1592253777.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fuyxml3",
      "author": "Hotlikessauce69",
      "body": "I'm white but it was glaringly obvious how minorities are often left out of the conversation of mental health when I went to a Partial hospitalization program. \n\n\nWe'd all do meals together, but naturally several people there had to have special accomodations for food like for allergies and vegetarian needs. \n\nAnyways, I was sitting with one of the only two black women I met in this program, (among maybe 30 other patients) at breakfast and the dietitian gave her a special plate of food because she had dietary restrictions. She looks at her plate confused, and then asks about it. Turns out the dietitian confused her with the only other black girl in the program. \n\n\nSo yeah, I got the privilege of seeing blatant racism in health care. I'm so sorry that this kind of stuff happens. \n\nI also noticed how care is handled sometimes. All the therapists were white and it seemed kinda obvious they didn't understand some of the things these girls went through. I imagine there's a lot if other racist  bullshit out there too.",
      "created_utc": 1592273864.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fuyyu5y",
      "author": "Lapamasa",
      "body": "A couple of related threads from a while ago, if you want to read more experiences.\n\nhttps://www.reddit.com/r/EdAnonymousAdults/comments/goj18m/race_and_ed/\n\nhttps://www.reddit.com/r/EDAnonymous/comments/gudc2v/black_girl_with_an_ed/\n\nIn my area there's a mental health center specifically for people of color (run by POC). Their focus is primarily on existing as a person of color, or a migrant, in white Western society. So they deal with PTSD and systemic oppression, not with eating disorders, but they might help with ED on a basic level. Similarly, an inpatient program for ED might be perfect for helping with disordered eating, but will only be able to provide basic support for issues that arise from systemic racism.\n\nIn the end, you're a whole human, with many different aspects coming together. You don't fit into a neat little box, so it's hard to find a treatment that addresses everything that you need. And it's sad that you have to struggle with that more than the average white girl with an ED. But that doesn't mean that treatment is worthless unless it's a perfect fit. \n\nYou can go inpatient and address your ED, and later find a therapist who looks like you. Or maybe you can find an inpatient program with a psychologist from a similar cultural background? Maybe there's a POC mental health center near you, where you can get basic support for ED behaviors but more support for the racial aspects of your struggles. Or maybe you can try to find someone in your area, who has an ED, and wants to go inpatient, and does look like you, so you can go together.\n\nhttps://anad.org/blog/brown-girl-starving/\n\nAnother story.\n\nHope you'll find your way, and wishing you the best.",
      "created_utc": 1592274574.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fuzlm81",
      "author": "schtaz",
      "body": "\"And because of my ethnicity we tend to have “curvier” bodies.\" i feel yaaaa  \n\n\nI'm a non-hispanic latina and live in Mississippi where less than 2% of the population are hispanic or latino and I feel exactly the same way. You're not alone, much love to you ❤️",
      "created_utc": 1592290916.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fv0i9rl",
      "author": "ThatOnePotential",
      "body": "As others have said, you are definitely not alone. It is really difficult and unfortunate that a lot of people do not understand (or maybe even realize) that this, like any other medical or mental health issue effects all different types of people.\n\nLike you, I suspect my ethnically \"boxier\" frame, even when I was very underweight for my body, caused my ED to go unnoticed by the few medical professionals I encountered as a kid and young adult. I definitely relate to having immigrant parents and living in a culture that misunderstands issues like EDs. I had periods in my life, especially as a kid, where my ED really grabbed onto the idea that things couldn't be that bad for me because people with my type of background don't have EDs--wrong!\n\nAdditionally, many of us non-white people also are dealing with a history of poverty. The compounding class issue is rarely addressed, and of course contributes to issues like this going unnoticed. This is not only due to the of a lack of adequate health care, but also because these issues are stereotypically seen as a middle-class problem. For me, it is really hard to unravel the threads of my ED because I know my history of food scarcity (and my parents' own histories of food scarcity) played a pretty large role in the development of my issues with food.\n\nI feel incredibly grateful to have this space where these types of issues can be brought up and are treated with respect. I wish you all the best in your journey towards recovery--you aren't alone in this <3",
      "created_utc": 1592317401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fv15mxc",
      "author": "Cheekachar",
      "body": "Mixed POC here. I hear you sis. I think no matter your race, we all want out of this....but we have to acknowledge that our experiences and identities play into both illness and recovery.  Agree 100% that the ED conversation and therapy doesn't enough account for the minority experience or body shapes.. it's interesting for me because in the states I am seen as thin, but in Thailand I am much larger than most people. Combined with the in your face toxic Asian diet culture and zero understanding or eating disorders, it is a deep conflict in my recovery.\n\nThe socioc-cultural context for ED's can't be ignored IMO.",
      "created_utc": 1592327851.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fuxazk8",
      "author": "diarrheaisnice",
      "body": "Hey I just wanted to say that I was a really bad alcoholic and when I quit I ended up manifesting my addiction into restricting food from myself. ED has been harder for me to recover from than alcohol ever was. Your struggle is just as hard as theirs and just as valid. Much love to you ❤️",
      "created_utc": 1592244154.0,
      "score": 21,
      "context": [
        {
          "id": "fux2mjj",
          "author": "cleonardo96",
          "body": "your not alone, I'm a native woman with an eating disorder. everyone in my tribe has an addiction problem and mine manifested into an eating disorder that none of them knows about. I know it's not the same and I can't compare my ed to my cousin's meth/drug/alcohol problems but its a similar thing y'know. to my knowledge, I'm the only one with this specific addiction and it feels lonely. tbh sometimes when I'm deep in a spiral I wish I had wound up with the meth addiction (i never will try it or any other drugs because I don't want an addiction) because my tribe is very curvy/ everyone is a bit heavy except the ones on meth and despite my ed or maybe because of it I'm on the heavier side and at least my cousins with other addictions have each other and a support system in place because they go through it together and I'm alone\n\n&#x200B;\n\nI've been threatened with inpatient too and I didn't  want to go either, not because no one would look like me but because that was always a threat my mom would use whenever i showed emotion that was \"inappropriate\" either too happy too sad too angry or whatever she didn't agree with me feeling she would threaten to send me away to \"a mental hospital\"",
          "created_utc": 1592240315.0
        }
      ]
    },
    {
      "id": "fuxf50a",
      "author": "Gothsyndrome",
      "body": "I completely understand where you’re coming from. Most people don’t realize that EDs are also addictions. They’re obviously different from a alcohol/drug addiction, but nonetheless a dangerous illness/addiction that can lead to death. It feels like we’re alone the majority of the time, but don’t let that stop you from seeking help. Seeking out help is a first BIG step for us. Receiving a healthy support system is essential to recovery and your well being, whether that’s a therapist or a psychiatrist. My psychiatrist is POC, so I feel like she is very empathetic towards how I feel and understands me a bit better. If you think getting a POC doctor will help and make you feel less alone, do it! It helped me a bit at least. \n\nIt’s hard being in a ED group or in psychiatric ward because of this... but I always try to remember that no mental illness discriminates. Mental illness can not pick who to effect. We/You are equally as valid ❤️",
      "created_utc": 1592246029.0,
      "score": 11,
      "context": [
        {
          "id": "fux2mjj",
          "author": "cleonardo96",
          "body": "your not alone, I'm a native woman with an eating disorder. everyone in my tribe has an addiction problem and mine manifested into an eating disorder that none of them knows about. I know it's not the same and I can't compare my ed to my cousin's meth/drug/alcohol problems but its a similar thing y'know. to my knowledge, I'm the only one with this specific addiction and it feels lonely. tbh sometimes when I'm deep in a spiral I wish I had wound up with the meth addiction (i never will try it or any other drugs because I don't want an addiction) because my tribe is very curvy/ everyone is a bit heavy except the ones on meth and despite my ed or maybe because of it I'm on the heavier side and at least my cousins with other addictions have each other and a support system in place because they go through it together and I'm alone\n\n&#x200B;\n\nI've been threatened with inpatient too and I didn't  want to go either, not because no one would look like me but because that was always a threat my mom would use whenever i showed emotion that was \"inappropriate\" either too happy too sad too angry or whatever she didn't agree with me feeling she would threaten to send me away to \"a mental hospital\"",
          "created_utc": 1592240315.0
        }
      ]
    },
    {
      "id": "fuxk53l",
      "author": "uhhhhhhhbro",
      "body": "man that last paragraph you wrote, my mom did the same thing but threatening me w therapy. made me feel like feeling anything or expressing anything was wrong.",
      "created_utc": 1592248455.0,
      "score": 3,
      "context": [
        {
          "id": "fux2mjj",
          "author": "cleonardo96",
          "body": "your not alone, I'm a native woman with an eating disorder. everyone in my tribe has an addiction problem and mine manifested into an eating disorder that none of them knows about. I know it's not the same and I can't compare my ed to my cousin's meth/drug/alcohol problems but its a similar thing y'know. to my knowledge, I'm the only one with this specific addiction and it feels lonely. tbh sometimes when I'm deep in a spiral I wish I had wound up with the meth addiction (i never will try it or any other drugs because I don't want an addiction) because my tribe is very curvy/ everyone is a bit heavy except the ones on meth and despite my ed or maybe because of it I'm on the heavier side and at least my cousins with other addictions have each other and a support system in place because they go through it together and I'm alone\n\n&#x200B;\n\nI've been threatened with inpatient too and I didn't  want to go either, not because no one would look like me but because that was always a threat my mom would use whenever i showed emotion that was \"inappropriate\" either too happy too sad too angry or whatever she didn't agree with me feeling she would threaten to send me away to \"a mental hospital\"",
          "created_utc": 1592240315.0
        }
      ]
    },
    {
      "id": "fv15sjk",
      "author": "Cheekachar",
      "body": "Feel this hard on toxic asian diet culture.  And almost no understanding that it is even toxic or damaging in my experience.",
      "created_utc": 1592327924.0,
      "score": 1,
      "context": [
        {
          "id": "fuxdtsq",
          "author": "None",
          "body": "I'm an Asian American woman. (Well, mixed race with portuguese and Korean ancestry)\n\nI get the feeling of being underrepresented and invalidated. South Korea has really toxic diet culture as well. It's hard having something like an ED but to have it invalidated bc you don't fit the media stereotype of white, middle-class, UW, anorexic (not to invalidate anyone who comes from this background)",
          "created_utc": 1592245446.0
        }
      ]
    },
    {
      "id": "fuz0h86",
      "author": "Lapamasa",
      "body": "Another thread: https://www.reddit.com/r/EDAnonymous/comments/guno38/a_black_activists_tips_for_avoiding_relapse_in/\n\nAlso, I just saw that your psychologist is a woman of color! Good for you.",
      "created_utc": 1592275547.0,
      "score": 2,
      "context": [
        {
          "id": "fuyyu5y",
          "author": "Lapamasa",
          "body": "A couple of related threads from a while ago, if you want to read more experiences.\n\nhttps://www.reddit.com/r/EdAnonymousAdults/comments/goj18m/race_and_ed/\n\nhttps://www.reddit.com/r/EDAnonymous/comments/gudc2v/black_girl_with_an_ed/\n\nIn my area there's a mental health center specifically for people of color (run by POC). Their focus is primarily on existing as a person of color, or a migrant, in white Western society. So they deal with PTSD and systemic oppression, not with eating disorders, but they might help with ED on a basic level. Similarly, an inpatient program for ED might be perfect for helping with disordered eating, but will only be able to provide basic support for issues that arise from systemic racism.\n\nIn the end, you're a whole human, with many different aspects coming together. You don't fit into a neat little box, so it's hard to find a treatment that addresses everything that you need. And it's sad that you have to struggle with that more than the average white girl with an ED. But that doesn't mean that treatment is worthless unless it's a perfect fit. \n\nYou can go inpatient and address your ED, and later find a therapist who looks like you. Or maybe you can find an inpatient program with a psychologist from a similar cultural background? Maybe there's a POC mental health center near you, where you can get basic support for ED behaviors but more support for the racial aspects of your struggles. Or maybe you can try to find someone in your area, who has an ED, and wants to go inpatient, and does look like you, so you can go together.\n\nhttps://anad.org/blog/brown-girl-starving/\n\nAnother story.\n\nHope you'll find your way, and wishing you the best.",
          "created_utc": 1592274574.0
        }
      ]
    }
  ]
}