{
  "id": "hcjrlu",
  "subreddit": "fuckeatingdisorders",
  "author": "cryingfaeries",
  "created_utc": 1592647866.0,
  "title": "I know this sounds obvious but does anyone else ever have this moment??",
  "selftext": "where you’re like, what the fuck am I doing?? why am i not EATING ??? the most basic human function is to eat and I’ve decided not to and for WHAT??? I’m losing so much sleep and my anxiety is through the roof because I’ve stopped eating again. Every time I relapse, I remember why I was trying to recover before. This shit sucks. Please just eat. Losing 5 pounds is not worth the insomnia, the obsessive meal planning, the body checking, the unhappiness, the FATIGUE (don’t even get me started on this one!!) i just wanna have my fucking oatmeal like a person can I just let myself do that please",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hcjrlu/i_know_this_sounds_obvious_but_does_anyone_else/",
  "score": 166,
  "num_comments": 11,
  "comments": [
    {
      "id": "fvfmlrw",
      "author": "None",
      "body": "Yeah this is my thought flow all the time. Caught between how inane and meaningless this really is versus living with my anxieties over feeling full, getting fat, BDD etc etc.",
      "created_utc": 1592655077.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fvffs76",
      "author": "FreeBirdsFly",
      "body": "Having it right now while getting ready to exercise even though that my brain and body is waaaaaaaaaay to tired and sore to do it.",
      "created_utc": 1592648519.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fvfsgeb",
      "author": "tkidaw",
      "body": "This is when I tell myself \"stop torturing your body. You've already put the poor thing through enough.\"",
      "created_utc": 1592659630.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fvg0qe0",
      "author": "None",
      "body": "I have this struggle constantly but cant seem to stop myself?? I guess that's the joy of mental illness",
      "created_utc": 1592664940.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvgygyt",
      "author": "-plantagenista",
      "body": "When i feel weak and dizzy my AN brain is like 'look at me I've go so much self control i am amazing' and the LOGICAL brain is like 'what the hell am I doing this is crazy??'",
      "created_utc": 1592683676.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvifref",
      "author": "None",
      "body": "I had thoughts like this a lot when I was sick. I'd be exhausted walking home from class and think \"this is ridiculous just go home and eat the pop tarts you're craving\" but it wouldn't happen. Or it would, followed by immediate regret and attempts to \"make up for it\" with exercise or further restriction. It's easier said than done. \n\nMade me wonder a lot if I really had an eating disorder. Sort of a \"i don't have a legitimate problem I'm just faking it\" mixed with \"I'm not sick i could just eat normal anytime i want\"",
      "created_utc": 1592716338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvfihag",
      "author": "None",
      "body": "This is so relatable",
      "created_utc": 1592651288.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvh9kmu",
      "author": "amerynpeters",
      "body": "Relaaateee wow :( I have this thought all the time and it makes me hate myself for not being normal",
      "created_utc": 1592689933.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvna07e",
      "author": "ThatOnePotential",
      "body": "As other commenters show, this is completely relatable. I had those feelings very frequently when I was sick, but I did not understand how to get off the merry-go-round. Many times I had thoughts like, \"*What* am I doing?! I'm not a dumb person, I know all of the consequences of this behavior--why, why, why?\"\n\nPart of starting recovery was realizing that the voice asking those questions was my real self. Your real true self is the one that is trying its best to get you to work towards whatever is best & most healthy for you--that reasonable, logical voice is you. All those thoughts designed to get you to engage in ED behaviors are the ED itself doing its best to maintain control over you. I think of it this way--the ED brain is like a parasite that has taken over your brain and will do whatever it can to stay alive and in control. It gains more power and gets louder every time you follow what it says. The less you engage, even though it is hard, the less power it has.",
      "created_utc": 1592840573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvfmqne",
      "author": "cryingfaeries",
      "body": "Exactly this!!! It’s so hard knowing that eating is actually the thing to do in the real world, when the ED swoops im says it knows better. I know for a fact I should be eating and it seems like a great idea until it becomes reality",
      "created_utc": 1592655193.0,
      "score": 7,
      "context": [
        {
          "id": "fvfmlrw",
          "author": "None",
          "body": "Yeah this is my thought flow all the time. Caught between how inane and meaningless this really is versus living with my anxieties over feeling full, getting fat, BDD etc etc.",
          "created_utc": 1592655077.0
        }
      ]
    },
    {
      "id": "fvifstc",
      "author": "None",
      "body": "Very relatable.",
      "created_utc": 1592716368.0,
      "score": 1,
      "context": [
        {
          "id": "fvgygyt",
          "author": "-plantagenista",
          "body": "When i feel weak and dizzy my AN brain is like 'look at me I've go so much self control i am amazing' and the LOGICAL brain is like 'what the hell am I doing this is crazy??'",
          "created_utc": 1592683676.0
        }
      ]
    }
  ]
}