{
  "id": "heqdnr",
  "subreddit": "fuckeatingdisorders",
  "author": "AWhimsicalBee",
  "created_utc": 1592957529.0,
  "title": "Inspired by an earlier post - fuck ED memoirs!",
  "selftext": "I find a lot of solace in reading memoirs, and not just for the stereotypical thinspo bullshit. But I wish there was one that spoke to me.\n\nI wish they weren't all \"some shit happened, so I stopped eating as much, and then I stopped eating more, and then I was really skinni and hospital and some other stuff and then recovery, I'd like to thank my therapist/family/dog for helping me through this difficult time\".  \n\n\nWhy are they all super LW anorexia-based? Where's the \"I hated myself for fucking ever, and developed an ED, and then I lost a lot of weight, and then I gained a lot of weight, and I've been indulging in fucked up behaviours on and off for years and bouncing +/- 40lbs ever since, and weight loss isn't fucking linear, and sometimes I can eat almost nothing for three weeks and only lose 2lbs, and sometimes I can go on holiday and binge my face off non-stop for seven days and only gain 2lbs, because science is apparently broken\". Where's the \"I lost a shitload of weight really fucking fast, but because my BMI was normal/overweight to start with, literally no-one gave a shit or just praised me like it was awesome and not completely fucked up, even though if I'd been a low BMI when I started and done the exact same thing, it would have been a completely different reaction to my weight loss\"? Where's the \"I tried really fucking hard to embrace body positivity/HAES to conquer my demons, I tried intuitive eating but all it got me was consistent weight gain until I freaked out and went back to restricting, I tried to do normal person dieting but my body is a piece of shit so I have to do ED behaviour to lose anything which just keeps me trapped in this cycle\"? Where are the memoirs from the people who have tried so hard, for so long, but remain invisible?  \n\n\nI'm just so tired and I feel so invisible and more and more like my ED is of no concern because I'm not underweight.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/heqdnr/inspired_by_an_earlier_post_fuck_ed_memoirs/",
  "score": 88,
  "num_comments": 18,
  "comments": [
    {
      "id": "fvud4lr",
      "author": "None",
      "body": "Someone on this sub - who has  since deleted their account, so I can't give them proper credit - once posted this gem that I saved because it always makes me laugh. It pretty much sums up most recovery blogs/memoirs.  \n\n\n> Did you guys know you can have an eating disorder at ANY size or weight? But anyways here’s a before and after pic of me severely underweight weighing 12 pounds at 6’2 and I was only eating -10,000 calories a day I was sooo sick and underweight. But you can still have an eating disorder if you’re not underweight, if your ED isn’t restrictive, if you haven’t been hospitalized!! But also here’s a bunch of story posts of me being inpatient and tube fed and emaciated uwu",
      "created_utc": 1592999777.0,
      "score": 42,
      "context": []
    },
    {
      "id": "fvt5sm2",
      "author": "badgerhoneyy",
      "body": "Read Hunger by Roxanne Grey",
      "created_utc": 1592964699.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fvu5e86",
      "author": "WhatsaGime",
      "body": "YES. As someone who started morbidly obese and is currently trying to semi-recover while still having a technically overweight BMI, I find it hard to find any stories that resonate, or any in a similar situation to them. I’m trying to find stories about people trying to recover while still not having a normal/underweight BMI, but I’m struggling :( I just want to recover once I am a normal BMI but at the same time I know I’m doing stupid and dangerous stuff to get there, and I am dealing with a treatment team so don’t have too much of a choice not to try recovery right now lmao. \n\nAlso I lost all my weight from severe restricting only for like 7 months, then I suddenly started bingeing and purging and am still doing that while still trying to restrict. I feel like I’m all over the place and it sucks lmao. I just want to read about someone with a similar story who is now doing well",
      "created_utc": 1592992623.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fvt3a5j",
      "author": "doreenmng",
      "body": "i hate this too!! waiting on myself to recover to be able to write my own damn book.",
      "created_utc": 1592963236.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fvuixtg",
      "author": "Boosey0910",
      "body": "I would like to read other people's accounts of body dysmorphia in the wake of an ED.  I've been weight restored recovered for a while but I still see myself as fat, gross and ugly in the mirror. Oh and I'm a 52 year old woman.  I started down the anorexia road at 15 and it has taken me a very LONG time to even deal with the underlying issues.  Getting healthy isn't linear.",
      "created_utc": 1593003955.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fvuqfbc",
      "author": "bunanbunv",
      "body": "Stories like those are another factor for me not wanting to recover thinking I'm 'not bad enough'. I feel like I'm doing everyone else an injustice by invalidating myself for encouraging this stigma. I'm so afraid that when I recover people will tell me \"but you weren't anorexic skinny\" or \"you weren't that bad, right?\". Of course there are other factors holding me back, but hopefully I can put this behind me, and get better.\n\nAlso don't they know that it's triggering when they show pictures and explicitly state their lowest BMIs? Trigger warnings aren't gonna stop people lol.",
      "created_utc": 1593008336.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fvu1p0h",
      "author": "None",
      "body": "“because science is apparently broken” felt that. felt the intuitive eating one too. ugh!!",
      "created_utc": 1592988766.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fx3hao7",
      "author": "justperusind",
      "body": "I totally feel this 😔✊ i recently read a memoir by Susan Burton called “Empty” and I think it does go along the lines of what an ED truly looks like— she really goes into depth of her own personal feelings and the fact that she isn’t really recovered right now as well. Her journey is also pretty non-linear (i think?) and i dont think its as cliché/condescending as other typical memoirs!",
      "created_utc": 1594041590.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvv442i",
      "author": "basicallyaballerina",
      "body": "I also haaaate when people go into detail about their behaviors. I get the desire to show how bad things were/validate the disorder, but it is not helpful to talk about how little you ate or specific “tricks” you used to lose weight (and I’d argue it’s harmful!). The Atlantic had an article about this but basically a lot of ED memoirs are more “how to”s than anything else :(",
      "created_utc": 1593015322.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvvgmr0",
      "author": "cryingfaeries",
      "body": "This is so so so true. Most people with eating disorders never experience anything in a predictable way, especially when they’ve been engaging in behaviors for a long time. I hate hearing stuff like this because it’s so hard not to compare the “”success”” of your eating disorder with someone else. It sucks to not be seen just because you’re not the typical picture of anorexia that’s been pushed out to the general population. This is why no one’s ever given a shit about my illness, even though I’ve gotten sicker and sicker as the years pass. Ugh.",
      "created_utc": 1593021338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvuw1z7",
      "author": "None",
      "body": "I love Purge by Nicole Johns",
      "created_utc": 1593011301.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvuy6jh",
      "author": "adamrogu24",
      "body": "👏🏻👏🏻👏🏻",
      "created_utc": 1593012381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvupjzf",
      "author": "bunanbunv",
      "body": "I fucking love this",
      "created_utc": 1593007855.0,
      "score": 5,
      "context": [
        {
          "id": "fvud4lr",
          "author": "None",
          "body": "Someone on this sub - who has  since deleted their account, so I can't give them proper credit - once posted this gem that I saved because it always makes me laugh. It pretty much sums up most recovery blogs/memoirs.  \n\n\n> Did you guys know you can have an eating disorder at ANY size or weight? But anyways here’s a before and after pic of me severely underweight weighing 12 pounds at 6’2 and I was only eating -10,000 calories a day I was sooo sick and underweight. But you can still have an eating disorder if you’re not underweight, if your ED isn’t restrictive, if you haven’t been hospitalized!! But also here’s a bunch of story posts of me being inpatient and tube fed and emaciated uwu",
          "created_utc": 1592999777.0
        }
      ]
    },
    {
      "id": "fvuj0ww",
      "author": "Boosey0910",
      "body": "That book is great. I follow her on social media.  She's a force for body acceptance and speaking out against the social norms.",
      "created_utc": 1593004010.0,
      "score": 6,
      "context": [
        {
          "id": "fvt5sm2",
          "author": "badgerhoneyy",
          "body": "Read Hunger by Roxanne Grey",
          "created_utc": 1592964699.0
        }
      ]
    },
    {
      "id": "fvt3ei2",
      "author": "doreenmng",
      "body": "as a WOC too i hate reading the same white girl anorexia story over and over",
      "created_utc": 1592963306.0,
      "score": 30,
      "context": [
        {
          "id": "fvt3a5j",
          "author": "doreenmng",
          "body": "i hate this too!! waiting on myself to recover to be able to write my own damn book.",
          "created_utc": 1592963236.0
        }
      ]
    },
    {
      "id": "fvtn6va",
      "author": "KnittingWine",
      "body": "Girl. Me too.",
      "created_utc": 1592975768.0,
      "score": 3,
      "context": [
        {
          "id": "fvt3a5j",
          "author": "doreenmng",
          "body": "i hate this too!! waiting on myself to recover to be able to write my own damn book.",
          "created_utc": 1592963236.0
        }
      ]
    },
    {
      "id": "fvujnv6",
      "author": "None",
      "body": "seriously they’re all the same middle class white teenage girls :/ i’m not gonna say that i’m not all those things cos i am lol but most people with EDs don’t fit that bill",
      "created_utc": 1593004420.0,
      "score": 5,
      "context": [
        {
          "id": "fvt3a5j",
          "author": "doreenmng",
          "body": "i hate this too!! waiting on myself to recover to be able to write my own damn book.",
          "created_utc": 1592963236.0
        },
        {
          "id": "fvt3ei2",
          "author": "doreenmng",
          "body": "as a WOC too i hate reading the same white girl anorexia story over and over",
          "created_utc": 1592963306.0
        }
      ]
    }
  ]
}