{
  "id": "hgexu1",
  "subreddit": "fuckeatingdisorders",
  "author": "robotsintrees",
  "created_utc": 1593201988.0,
  "title": "I'm pleasantly surprised.",
  "selftext": "I've been in hospital since May 11th. The NG tube came out on Tuesday. I've gotten significantly physically better. I'm being discharged on Thursday next week. I'm learning that it actually causes less mental distress to go along with the treatment plan than to keep catering to ED. The feeling of \"not being sick enough\" is less than it has been in the past (ED still romanticizes how severely ill I was; so weak I could barely move, electrolytes all fucked up, low blood sugars, constant observation... I need to keep reminding myself how awful it felt for ME). I'm not afraid of recovering. ED is scared of being evicted, and I will mourn the loss of something that has been such a huge part of my life/identity for half my life, but I want to Live, and I absolutely can't with ED in control. I hope this attitude doesn't fade once I'm home. I can't do this again.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hgexu1/im_pleasantly_surprised/",
  "score": 99,
  "num_comments": 3,
  "comments": [
    {
      "id": "fw44tuy",
      "author": "Boosey0910",
      "body": "You can do it.  I wrote a letter to my anorexia saying goodbye, that I don't need her anymore and she can no retire.  It was a useful exercise for me.",
      "created_utc": 1593213585.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fw3txok",
      "author": "fandangoedflashback",
      "body": "You've got this ❤️",
      "created_utc": 1593207749.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fw5l190",
      "author": "amerynpeters",
      "body": "All the best for your recovery honey!! Well done for coming this far and I’m sorry it had to get to that point before you realized ✨💕💕♥️♥️♥️",
      "created_utc": 1593253511.0,
      "score": 2,
      "context": []
    }
  ]
}