{
  "id": "hinj0f",
  "subreddit": "fuckeatingdisorders",
  "author": "speedayyyy",
  "created_utc": 1593524362.0,
  "title": "I miss my ED body but I don’t miss the side effects",
  "selftext": "It’s so hard to keep reminding myself that I was not healthy, even if I was only very close to being UW my body was suffering greatly. I’d pull 12 hour shifts in the food business without eating, I’d get severe headaches and would get so dizzy. I was almost always in a fog. My hair was falling out, I was so tired and angry all the time because I couldn’t sleep when I wasn’t eating. But then I remember how much everyone would compliment me, people would tell me how they wish they had my body so I just kept going. They knew I wasn’t eating, they saw me only drink Diet Coke all day at work or if I was around my family during the holidays I would only take a small plate. My body looked good but on the inside it was suffering. \n\nNobody but my husband and close friends know that I have an ED. I’m struggling lately with the weight gain, trying to avoid looking up my BMI or weighing myself but it’s so fucking hard to look in the mirror and see the obvious parts I’ve gained weight. I don’t feel pretty or sexy, I just feel uncomfortable with myself. I’ve been tracking my calories again and I’m trying to lose some weight the healthy way but I feel myself slipping again. It’s just exhausting. I wish my stupid ED brain would just fuck off and let me be happy with my body.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hinj0f/i_miss_my_ed_body_but_i_dont_miss_the_side_effects/",
  "score": 118,
  "num_comments": 15,
  "comments": [
    {
      "id": "fwhe5wx",
      "author": "taylorsayle",
      "body": "Same. It's almost like people think being really skinny is always natural. But it rarely is. \n\nIf they knew how much you were struggling, I doubt they'd say those things. If they do say anything about your weight gain tell them how being skinnier made you feel bad. They will understand (and not really care or think less of you), and probably won't jump to the conclusion that you have/had an ed. \n\nUsually, you have to find confidence from somewhere else when you have an ed. Sexy is a state of mind. It doesn't matter what you look like. Try treating yourself to a little dose of lavish luxury when you're feeling uncomfortable with your body. \n\nYou seem to know tracking calories probably isnt a good idea. Stopping immediately is your best option. It will only get harder to stop the longer you do it, and the more you restrict, the more you want to. If you aren't overweight there is NO reason to lose weight. Thats the ed talking. And the ed will never f off unless you make it; by not listening to it. \n\nI hope this helps!",
      "created_utc": 1593530516.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fwigs0w",
      "author": "sattheer",
      "body": "Something about the phrase “brain fog” just doesn’t cover it. When I’m really bad, my brain SHUTS OFF. I can’t answer simple questions, I can’t remember the most basic things, I can’t interact with other people... those sorts of symptoms aren’t talked about enough",
      "created_utc": 1593548784.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fwiixwd",
      "author": "unicorns-n-mermaids",
      "body": "I feel you on this! It’s so hard too because I’ve had to come to terms with the fact that I will never be able to have that body again without the side effects. It’s not normal or healthy to be underweight/restricting and it can’t be achieved without harming myself. \n\nThe recovery weight gain was HARD. I still haven’t lost it (2 years later) but I look like I have since the edema has gone down. But I’m bigger than I was and that’s a really hard truth to have to face. I’ve relapsed several times in the process of trying to slim down just a little bit more to where I feel like I would be more comfortable, and what would still be realistic for my frame. \n\nSo just be careful. I’ve had more success lately at owning my new body and adjusting my diet to be more nutritionally-dense by making positive swaps instead of negative swaps. \n\nBy that I mean, instead of deciding I’m going to have a salad with my meal instead of another side because it’s fewer calories, I try to tell myself, I’m going to eat this salad because it has so many awesome nutrients (looking up the vitamins in different foods and their associated benefits has helped me view food in general more positively) that do xyz and I’m also going to have another side because I enjoy it’s taste! \n\nIf I try to manipulate how much I eat, I just go off the deep end again, so this is me trying to hack my brain by eating more for a good reason (not just filling volume with celery because it’s low cal and then I won’t be hungry) but viewing food as FUEL and goodness which it is! \n\nSorry that was such a marathon to read, I just really resonate with your feelings and wanted to share! I’m definitely no expert and still am struggling a ton daily but that little tip was the one positive change I can celebrate!",
      "created_utc": 1593549778.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fwix25u",
      "author": "Sareeee48",
      "body": "I feel this—what I had to learn was that weight loss was not attainable for me, no matter my size, because it was just a slippery slope for me and it NEVER works out. I highly recommend looking up HAES and following HAES positive people on IG, etc. I’m just learning how to love my body no matter what it looks like (and obviously working on the trauma that caused my Body dysmorphia and ED to begin with), and it’s hard but that’s literally my only option at this point.",
      "created_utc": 1593556673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwk6lsi",
      "author": "DisabledMuse",
      "body": "I hated people giving me compliments with weight loss as it always felt so critical of the weight I was before. And there's only one person that gets to be critical of myself.",
      "created_utc": 1593586156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwincwc",
      "author": "taylorsayle",
      "body": "It's not a problem. I'm no expert, but I've been to many so I'm just rewording what they told me. I have similar concerns to you, so I've asked a lot of the same questions. \n\nIntuitive eating is hard. But it's supposed to be rn, since we spent so long not doing it. It does get easier to listen to your hunger cues tho.  I  ate a little too much at first, but that's completely normal considering the circumstance. And you can lose weight by eating intuitively, but it shouldnt be the goal. That's when the ed comes out to try and speed things up. \n\nIt's so great that your husband is supportive. Sometimes I wish my boyfriends voice was my inner thoughts. I've tried adapting saying some things to myself that I think he might say, and knowing that he believes it, makes it easier for me to. You should always treat and talk to yourself the way a best friend would.",
      "created_utc": 1593551855.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwhhe1l",
      "author": "speedayyyy",
      "body": "Sometimes I’ll try to wear lingerie and feel sexy but then I look in the mirror and immediately want to cover up my entire body. I’m almost overweight, as in if I gain a few more pounds I will be and it terrifies me. I’ve had to buy all new clothing for this summer and I don’t feel confident *at all* . I’m scared of being around my friends or in public because of how gross I feel with my body. I try not to count calories but I know how much is in pretty much every thing I eat so it just sits there in my head. I just don’t get how when I look in the mirror I find my body disgusting but I see other people my height n weight and they look great. Nobody has said anything about my weight gain but it just feels like maybe they just don’t want to upset me... thank you for your reply. People always thought I was just naturally able to eat little and keep a small frame but in reality I was eating a dangerously low amount of calories a day or just not eating. It was literal hell.",
      "created_utc": 1593532081.0,
      "score": 11,
      "context": [
        {
          "id": "fwhe5wx",
          "author": "taylorsayle",
          "body": "Same. It's almost like people think being really skinny is always natural. But it rarely is. \n\nIf they knew how much you were struggling, I doubt they'd say those things. If they do say anything about your weight gain tell them how being skinnier made you feel bad. They will understand (and not really care or think less of you), and probably won't jump to the conclusion that you have/had an ed. \n\nUsually, you have to find confidence from somewhere else when you have an ed. Sexy is a state of mind. It doesn't matter what you look like. Try treating yourself to a little dose of lavish luxury when you're feeling uncomfortable with your body. \n\nYou seem to know tracking calories probably isnt a good idea. Stopping immediately is your best option. It will only get harder to stop the longer you do it, and the more you restrict, the more you want to. If you aren't overweight there is NO reason to lose weight. Thats the ed talking. And the ed will never f off unless you make it; by not listening to it. \n\nI hope this helps!",
          "created_utc": 1593530516.0
        }
      ]
    },
    {
      "id": "fwihg2b",
      "author": "None",
      "body": "I seriously \"lost\" 3 months of my life.  I have no idea how I functioned successfully until my body gave out.  Looking back, holy shit.",
      "created_utc": 1593549096.0,
      "score": 8,
      "context": [
        {
          "id": "fwigs0w",
          "author": "sattheer",
          "body": "Something about the phrase “brain fog” just doesn’t cover it. When I’m really bad, my brain SHUTS OFF. I can’t answer simple questions, I can’t remember the most basic things, I can’t interact with other people... those sorts of symptoms aren’t talked about enough",
          "created_utc": 1593548784.0
        }
      ]
    },
    {
      "id": "fwpr7ih",
      "author": "None",
      "body": ">Something about the phrase “brain fog” just doesn’t cover it. When I’m really bad, my brain SHUTS OFF.\n\nExactly! It's... a bit akin to suffering from depersonalisation or transient psychosis in a way. Now that I'm recovered-ish, I haven't the foggiest idea how I even managed to survive last year — I've lost huge chunks of my memory, and all of the shit I somehow managed to pull off now feels like a distant, hazy fever dream. The only things that really stick out are the awful memories, like being so cold in the middle of July that I had to take a hot bath.  I went on so many long and strenuous hikes and barely remember a single one of them.",
      "created_utc": 1593709110.0,
      "score": 3,
      "context": [
        {
          "id": "fwigs0w",
          "author": "sattheer",
          "body": "Something about the phrase “brain fog” just doesn’t cover it. When I’m really bad, my brain SHUTS OFF. I can’t answer simple questions, I can’t remember the most basic things, I can’t interact with other people... those sorts of symptoms aren’t talked about enough",
          "created_utc": 1593548784.0
        }
      ]
    },
    {
      "id": "fwiidro",
      "author": "speedayyyy",
      "body": "You’re so right. People would try and talk to me at work but it would be hard just remember what they said to me. I remember last summer when I was deep in the hell of my ED it was over 100 degrees Fahrenheit in my state and the air conditioning was broke at my job. I had to work right in front of an extremely hot oven blowing in my back while also on day 2 of a fast. My brain by the end of that day was just pounding and unable to work correctly.. I almost threw up just walking to my car after that shift. I wish people didn’t romanticize this shit.",
      "created_utc": 1593549547.0,
      "score": 6,
      "context": [
        {
          "id": "fwigs0w",
          "author": "sattheer",
          "body": "Something about the phrase “brain fog” just doesn’t cover it. When I’m really bad, my brain SHUTS OFF. I can’t answer simple questions, I can’t remember the most basic things, I can’t interact with other people... those sorts of symptoms aren’t talked about enough",
          "created_utc": 1593548784.0
        }
      ]
    },
    {
      "id": "fwnd3mv",
      "author": "bpurly",
      "body": "This! So much this. When I lost weight during my ED people would see me and be like \"omg! You lost the weight!\" Like ??? *the* weight? As if I had a designated amount everyone thought I should lose? It's just weird. And made me feel like I must have been huge and ugly before, which then made it so hard to commit to gaining weight in recovery. I wish people would be more conscious of compliments they give people after weight loss.",
      "created_utc": 1593652783.0,
      "score": 2,
      "context": [
        {
          "id": "fwk6lsi",
          "author": "DisabledMuse",
          "body": "I hated people giving me compliments with weight loss as it always felt so critical of the weight I was before. And there's only one person that gets to be critical of myself.",
          "created_utc": 1593586156.0
        }
      ]
    },
    {
      "id": "fwhr11b",
      "author": "taylorsayle",
      "body": "I try to ignore/forget my caloric knowledge of food. Not reading the calorie part of the label helps. if you dont use it, you lose it! Now I'm trying intuitive eating, recommended by my dietitian. \n\nI wear lingerie too sometimes, but I don't look at my body when I wear it. The mirror lies. I'm sure you're husband doesn't think a single bad thought when you wear it. You should try and let him make you feel sexy sometimes. My bf does this for me, and it helped a lot! Dancing also makes me feel sexy, but I make sure I'm not doing it to burn calories. I dont do it everyday. Doing my nails, or hair, taking a bubble bath with a face mask, wearing heels, perfume, or putting on a little make-up also helps, but nothing replaces just having that inner confidence im still gathering. \n\nI have also been near overweight while in recovery, and I started restricting again. It started small, but eventually, it triggered the ed back fully-fledged. \n\nRight now you should focus on maintaining. You can try incorporating a little exercise to tone up, but make sure you are doing it for health reasons first. My first ed warning sign is that if I miss a day I planned to exercise and feel the urge to restrict a meal to compensate, I stop for a bit. But your body will find its 'happy place'. And I can almost guarantee if you lost the weight you did, you aren't going to be naturally big.",
      "created_utc": 1593536676.0,
      "score": 5,
      "context": [
        {
          "id": "fwhe5wx",
          "author": "taylorsayle",
          "body": "Same. It's almost like people think being really skinny is always natural. But it rarely is. \n\nIf they knew how much you were struggling, I doubt they'd say those things. If they do say anything about your weight gain tell them how being skinnier made you feel bad. They will understand (and not really care or think less of you), and probably won't jump to the conclusion that you have/had an ed. \n\nUsually, you have to find confidence from somewhere else when you have an ed. Sexy is a state of mind. It doesn't matter what you look like. Try treating yourself to a little dose of lavish luxury when you're feeling uncomfortable with your body. \n\nYou seem to know tracking calories probably isnt a good idea. Stopping immediately is your best option. It will only get harder to stop the longer you do it, and the more you restrict, the more you want to. If you aren't overweight there is NO reason to lose weight. Thats the ed talking. And the ed will never f off unless you make it; by not listening to it. \n\nI hope this helps!",
          "created_utc": 1593530516.0
        },
        {
          "id": "fwhhe1l",
          "author": "speedayyyy",
          "body": "Sometimes I’ll try to wear lingerie and feel sexy but then I look in the mirror and immediately want to cover up my entire body. I’m almost overweight, as in if I gain a few more pounds I will be and it terrifies me. I’ve had to buy all new clothing for this summer and I don’t feel confident *at all* . I’m scared of being around my friends or in public because of how gross I feel with my body. I try not to count calories but I know how much is in pretty much every thing I eat so it just sits there in my head. I just don’t get how when I look in the mirror I find my body disgusting but I see other people my height n weight and they look great. Nobody has said anything about my weight gain but it just feels like maybe they just don’t want to upset me... thank you for your reply. People always thought I was just naturally able to eat little and keep a small frame but in reality I was eating a dangerously low amount of calories a day or just not eating. It was literal hell.",
          "created_utc": 1593532081.0
        }
      ]
    },
    {
      "id": "fwr4qc1",
      "author": "DisabledMuse",
      "body": "People have weird ideas of what's healthy. I've had doctors discount my many medical issues, telling me if I lost weight they would go away. 50lbs and an eating disorder later it's funnily not better at all...",
      "created_utc": 1593733702.0,
      "score": 2,
      "context": [
        {
          "id": "fwk6lsi",
          "author": "DisabledMuse",
          "body": "I hated people giving me compliments with weight loss as it always felt so critical of the weight I was before. And there's only one person that gets to be critical of myself.",
          "created_utc": 1593586156.0
        },
        {
          "id": "fwnd3mv",
          "author": "bpurly",
          "body": "This! So much this. When I lost weight during my ED people would see me and be like \"omg! You lost the weight!\" Like ??? *the* weight? As if I had a designated amount everyone thought I should lose? It's just weird. And made me feel like I must have been huge and ugly before, which then made it so hard to commit to gaining weight in recovery. I wish people would be more conscious of compliments they give people after weight loss.",
          "created_utc": 1593652783.0
        }
      ]
    },
    {
      "id": "fwihyvh",
      "author": "speedayyyy",
      "body": "Man intuitive eating is so damn hard sometimes. I’m trying my best but some days I really feel like I’m over eating. My husband is super attentive and is constantly complimenting my body. Any time I start to put myself down he just hugs me and tells me I need to stop being so hard on myself which is true, i am super critical of my body. \n\nYeah I’ve been maintaining for about 2 months now, I’ve only weighed myself like two times in the time frame but it seems like I am. It just makes me sad that I’m maintaining a higher weight. It’s hard to remind yourself constantly that it’s temporary, it’s really silly since I’m a grown woman/mother but I was used to always being tall and slender. Now it feels like anyone who looks at me just sees me as out of shape and given up on looking good. I know it’s probably in my head but whenever I see my parents in person it feels like they are judging me for gaining. They don’t say anything but my brain is dumb... I’ll be opening up my swimming pool soon and that helps me tone up a lot since I’ll be spending every day swimming for hours. Thank you so much for replying to me and giving me great advice ❤️",
      "created_utc": 1593549348.0,
      "score": 3,
      "context": [
        {
          "id": "fwhe5wx",
          "author": "taylorsayle",
          "body": "Same. It's almost like people think being really skinny is always natural. But it rarely is. \n\nIf they knew how much you were struggling, I doubt they'd say those things. If they do say anything about your weight gain tell them how being skinnier made you feel bad. They will understand (and not really care or think less of you), and probably won't jump to the conclusion that you have/had an ed. \n\nUsually, you have to find confidence from somewhere else when you have an ed. Sexy is a state of mind. It doesn't matter what you look like. Try treating yourself to a little dose of lavish luxury when you're feeling uncomfortable with your body. \n\nYou seem to know tracking calories probably isnt a good idea. Stopping immediately is your best option. It will only get harder to stop the longer you do it, and the more you restrict, the more you want to. If you aren't overweight there is NO reason to lose weight. Thats the ed talking. And the ed will never f off unless you make it; by not listening to it. \n\nI hope this helps!",
          "created_utc": 1593530516.0
        },
        {
          "id": "fwhhe1l",
          "author": "speedayyyy",
          "body": "Sometimes I’ll try to wear lingerie and feel sexy but then I look in the mirror and immediately want to cover up my entire body. I’m almost overweight, as in if I gain a few more pounds I will be and it terrifies me. I’ve had to buy all new clothing for this summer and I don’t feel confident *at all* . I’m scared of being around my friends or in public because of how gross I feel with my body. I try not to count calories but I know how much is in pretty much every thing I eat so it just sits there in my head. I just don’t get how when I look in the mirror I find my body disgusting but I see other people my height n weight and they look great. Nobody has said anything about my weight gain but it just feels like maybe they just don’t want to upset me... thank you for your reply. People always thought I was just naturally able to eat little and keep a small frame but in reality I was eating a dangerously low amount of calories a day or just not eating. It was literal hell.",
          "created_utc": 1593532081.0
        },
        {
          "id": "fwhr11b",
          "author": "taylorsayle",
          "body": "I try to ignore/forget my caloric knowledge of food. Not reading the calorie part of the label helps. if you dont use it, you lose it! Now I'm trying intuitive eating, recommended by my dietitian. \n\nI wear lingerie too sometimes, but I don't look at my body when I wear it. The mirror lies. I'm sure you're husband doesn't think a single bad thought when you wear it. You should try and let him make you feel sexy sometimes. My bf does this for me, and it helped a lot! Dancing also makes me feel sexy, but I make sure I'm not doing it to burn calories. I dont do it everyday. Doing my nails, or hair, taking a bubble bath with a face mask, wearing heels, perfume, or putting on a little make-up also helps, but nothing replaces just having that inner confidence im still gathering. \n\nI have also been near overweight while in recovery, and I started restricting again. It started small, but eventually, it triggered the ed back fully-fledged. \n\nRight now you should focus on maintaining. You can try incorporating a little exercise to tone up, but make sure you are doing it for health reasons first. My first ed warning sign is that if I miss a day I planned to exercise and feel the urge to restrict a meal to compensate, I stop for a bit. But your body will find its 'happy place'. And I can almost guarantee if you lost the weight you did, you aren't going to be naturally big.",
          "created_utc": 1593536676.0
        }
      ]
    },
    {
      "id": "fwikdu8",
      "author": "seagracemoore",
      "body": "I have learned to believe my husband when he compliments me and tells me he finds me attractive even when I am grossed out by what I see. Sometimes it doesn't shut off the ED brain, but it helps. I believe he is telling the truth. What men see as attractive isn't what we often use to judge ourselves. It's weird that the media doesn't address this enough. Most men love curves. So why do we feel so bad if we don't look like what we see in most movies, TV shows, and magazines? Why are those images we cling to instead of the compliments we get from our loved ones? The media images are getting more realistic but sometimes I wonder if I can ever un-brainwash myself or if my ED makes me have these obsessive thoughts about my weight and appearance.\n\nGetting older and gaining weight without doing anything 'wrong' has been a hard pill for me to swallow. I'm still 'normal' but I miss my younger, slimmer self, and I'm not going to engage in ED behavior to get it back because it's not worth it. I have so many wonderful things in my life - kids, decent job, my health, husband who thinks I'm hot.\n\nLast thing from me is that this is a really stressful time for many of us with social isolation and everything going on in the world. The fact that my weak spot is chattering more loudly is an indication that I'm feeling stressed and my goal is to better parent myself.\n\nWhen I look back on my life my weight is a minor part of what I will see. The rest of my life matters more so I'm taking time for those things to.\n\nHang in there!",
      "created_utc": 1593550456.0,
      "score": 3,
      "context": [
        {
          "id": "fwhe5wx",
          "author": "taylorsayle",
          "body": "Same. It's almost like people think being really skinny is always natural. But it rarely is. \n\nIf they knew how much you were struggling, I doubt they'd say those things. If they do say anything about your weight gain tell them how being skinnier made you feel bad. They will understand (and not really care or think less of you), and probably won't jump to the conclusion that you have/had an ed. \n\nUsually, you have to find confidence from somewhere else when you have an ed. Sexy is a state of mind. It doesn't matter what you look like. Try treating yourself to a little dose of lavish luxury when you're feeling uncomfortable with your body. \n\nYou seem to know tracking calories probably isnt a good idea. Stopping immediately is your best option. It will only get harder to stop the longer you do it, and the more you restrict, the more you want to. If you aren't overweight there is NO reason to lose weight. Thats the ed talking. And the ed will never f off unless you make it; by not listening to it. \n\nI hope this helps!",
          "created_utc": 1593530516.0
        },
        {
          "id": "fwhhe1l",
          "author": "speedayyyy",
          "body": "Sometimes I’ll try to wear lingerie and feel sexy but then I look in the mirror and immediately want to cover up my entire body. I’m almost overweight, as in if I gain a few more pounds I will be and it terrifies me. I’ve had to buy all new clothing for this summer and I don’t feel confident *at all* . I’m scared of being around my friends or in public because of how gross I feel with my body. I try not to count calories but I know how much is in pretty much every thing I eat so it just sits there in my head. I just don’t get how when I look in the mirror I find my body disgusting but I see other people my height n weight and they look great. Nobody has said anything about my weight gain but it just feels like maybe they just don’t want to upset me... thank you for your reply. People always thought I was just naturally able to eat little and keep a small frame but in reality I was eating a dangerously low amount of calories a day or just not eating. It was literal hell.",
          "created_utc": 1593532081.0
        },
        {
          "id": "fwhr11b",
          "author": "taylorsayle",
          "body": "I try to ignore/forget my caloric knowledge of food. Not reading the calorie part of the label helps. if you dont use it, you lose it! Now I'm trying intuitive eating, recommended by my dietitian. \n\nI wear lingerie too sometimes, but I don't look at my body when I wear it. The mirror lies. I'm sure you're husband doesn't think a single bad thought when you wear it. You should try and let him make you feel sexy sometimes. My bf does this for me, and it helped a lot! Dancing also makes me feel sexy, but I make sure I'm not doing it to burn calories. I dont do it everyday. Doing my nails, or hair, taking a bubble bath with a face mask, wearing heels, perfume, or putting on a little make-up also helps, but nothing replaces just having that inner confidence im still gathering. \n\nI have also been near overweight while in recovery, and I started restricting again. It started small, but eventually, it triggered the ed back fully-fledged. \n\nRight now you should focus on maintaining. You can try incorporating a little exercise to tone up, but make sure you are doing it for health reasons first. My first ed warning sign is that if I miss a day I planned to exercise and feel the urge to restrict a meal to compensate, I stop for a bit. But your body will find its 'happy place'. And I can almost guarantee if you lost the weight you did, you aren't going to be naturally big.",
          "created_utc": 1593536676.0
        },
        {
          "id": "fwihyvh",
          "author": "speedayyyy",
          "body": "Man intuitive eating is so damn hard sometimes. I’m trying my best but some days I really feel like I’m over eating. My husband is super attentive and is constantly complimenting my body. Any time I start to put myself down he just hugs me and tells me I need to stop being so hard on myself which is true, i am super critical of my body. \n\nYeah I’ve been maintaining for about 2 months now, I’ve only weighed myself like two times in the time frame but it seems like I am. It just makes me sad that I’m maintaining a higher weight. It’s hard to remind yourself constantly that it’s temporary, it’s really silly since I’m a grown woman/mother but I was used to always being tall and slender. Now it feels like anyone who looks at me just sees me as out of shape and given up on looking good. I know it’s probably in my head but whenever I see my parents in person it feels like they are judging me for gaining. They don’t say anything but my brain is dumb... I’ll be opening up my swimming pool soon and that helps me tone up a lot since I’ll be spending every day swimming for hours. Thank you so much for replying to me and giving me great advice ❤️",
          "created_utc": 1593549348.0
        }
      ]
    }
  ]
}