{
  "id": "hj0o1o",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1593566625.0,
  "title": "Adventures?!",
  "selftext": "Last week, my therapist challenged me to go on an adventure because I live in a tiny lil safe cage of routine and compulsions— the same exact mundane walk every day, the same exact foods, everything ritualistically measured and calculated... I was so intimidated and overwhelmed at the thought of change and newness but MY GOODNESS this past week has been so freeing. I decided to start small with new hiking trails and then realized I really want to camp. So I started researching easy overnight backpacking excursions in my area and I went to a recycled gear store today and found a backpacking pack for $30 (it has a rip that I’ll sew up).  I know exercise is a trigger and a slippery slope, but I will be mindful and cautious of my movement and I will have to keep myself vigilant about fueling my body for strength and smiles and new sights and all that! \nAnyway, I gave myself permission to try new things and to probably fail and to discover and to get so excited about something that the fear doesn’t matter and GUESS WHAAAT?! I haven’t been obsessing about food and body nearly as much. Today, I realized how much room there is in my mind to dream and to fantasize about life and how big and beautiful I can choose to make it! And I realized that my friends use their brains for thoughts that don’t obsess and punish and scrutinize all the time and I’m allowed to do that too. There’s so much more space for joy than I let myself believe.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hj0o1o/adventures/",
  "score": 93,
  "num_comments": 7,
  "comments": [
    {
      "id": "fwjfbsw",
      "author": "walkthroughfields",
      "body": "Wow, this is amazing. I’m so happy for you. Life can be amazing.",
      "created_utc": 1593567088.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fwk19ui",
      "author": "None",
      "body": "I’m so proud of you, this is incredible. Keep it up Love. You will still have ups and down, but hold on to this memory and experience-know there are millions more experiences you can chase too. There is so much life to live.",
      "created_utc": 1593581677.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fwkvmuy",
      "author": "boo9817",
      "body": "HELL YESSSSSSSS there is so much more joy that life has to offer when we dare to take that small risk! \n\nall the best OP, rooting for you!",
      "created_utc": 1593608860.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fwk6784",
      "author": "nancytwomills",
      "body": "congratulations bae, i'm so proud of you! i'm almost crying reading your story, because it's so inspiring. hope you keep doing new choices and living your life full of adventures. have a incredible day ❤",
      "created_utc": 1593585793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fwlegyf",
      "author": "None",
      "body": "My first attempt at sleeping outside started with a sleeping bag on my balcony. Small steps, small adventures. Have fun with your camping!",
      "created_utc": 1593619024.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fwme11z",
      "author": "Enduendada",
      "body": "I'm so proud of you! Be mindful of your body but also be mindful in general, just be present and enjoy yourself as much as possible. It sounds like an amazing breakthrough, so relish it!",
      "created_utc": 1593635235.0,
      "score": 2,
      "context": []
    }
  ]
}