{
  "id": "hnyaw9",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1594276899.0,
  "title": "Can’t remember the last time i ate without caring about calories",
  "selftext": "the title kinda says it all, i’m 17 and i can’t remember the last time i ate something -even something tiny- without thinking about/logging the calories. it’s exhausting and i feel like i’m wasting the best years of my life picking apart everything i eat. \n\nby all means, high school should be full of bad decisions, parties, skipping school, etc, but i’m wasting so much time and energy measuring food, counting calories, and bailing on plans because i’m scared there might be food that i’ll binge on.\n\nthe irony of it all is today my dad told me how proud he was that i was “eating well and getting more exercise...” i almost laughed",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hnyaw9/cant_remember_the_last_time_i_ate_without_caring/",
  "score": 96,
  "num_comments": 4,
  "comments": [
    {
      "id": "fxf0b58",
      "author": "mtngdss",
      "body": "hey, this was 100% me when i was 17, im 23 now and a year into recovery, i promise it gets better. you will one day be able to eat without the constant calculator running.",
      "created_utc": 1594298254.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fxfpiou",
      "author": "None",
      "body": "I’m happy you’re actually acknowledging that you’re essentially wasting your time/life. I know there really isn’t anything we can say to make you want to get better, it’s something you’ll need to want yourself, but being self aware is a good thing. I’ve been in recovery for 7 months now which isn’t a lot but it’s the longest I’ve ever had in ten years and counting is still in the back of my mind but at least it’s not in the front. \n\nI challenge you to make a conscious decision to retaliate against your ED thoughts at least once a day. For example: if you want to drink a smoothie but your ED is telling you to drink water instead, have a small smoothie. If you want to wear shorts but your ED says your legs look fat wear them out for an hour or two. Start small and work your way up to drinking a big smoothie, wearing shorts all day, eating at restaurants or wearing swim suits or whatever scares you. Eventually you can start doing it twice a day, 3x a day- etc. exposure therapy is GREAT for EDs. Just a suggestion, good luck hun ❤️",
      "created_utc": 1594311872.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fxhmoe5",
      "author": "Tyziken",
      "body": "yup thats a mood",
      "created_utc": 1594347030.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxfyl76",
      "author": "None",
      "body": "thank you :) i’m trying to take small steps to get better, but this is such an isolating thing to experience. very thankful for all of you ❤️",
      "created_utc": 1594316154.0,
      "score": 6,
      "context": [
        {
          "id": "fxfpiou",
          "author": "None",
          "body": "I’m happy you’re actually acknowledging that you’re essentially wasting your time/life. I know there really isn’t anything we can say to make you want to get better, it’s something you’ll need to want yourself, but being self aware is a good thing. I’ve been in recovery for 7 months now which isn’t a lot but it’s the longest I’ve ever had in ten years and counting is still in the back of my mind but at least it’s not in the front. \n\nI challenge you to make a conscious decision to retaliate against your ED thoughts at least once a day. For example: if you want to drink a smoothie but your ED is telling you to drink water instead, have a small smoothie. If you want to wear shorts but your ED says your legs look fat wear them out for an hour or two. Start small and work your way up to drinking a big smoothie, wearing shorts all day, eating at restaurants or wearing swim suits or whatever scares you. Eventually you can start doing it twice a day, 3x a day- etc. exposure therapy is GREAT for EDs. Just a suggestion, good luck hun ❤️",
          "created_utc": 1594311872.0
        }
      ]
    }
  ]
}