{
  "id": "hor3ec",
  "subreddit": "fuckeatingdisorders",
  "author": "MeanwhileOnPluto",
  "created_utc": 1594395369.0,
  "title": "Fuck my dad for giving my mother shit about weight gain while she had cancer",
  "selftext": "The first time my mother got cancer, I was 11 and settling in to some of my foundational ED behaviors. She went for chemo and she was one the rarer ones who gained weight during treatment instead of dropping it like a stone. *I remember this being a big deal in my family.*\n\nWhat the fuck, guys? The woman's got goddamn *cancer* and my dad's still resentful of her weight gain. She'd had binge eating disorder prior to this and would for the remainder of her life. \n\nDon't get me wrong, she's no saint, but that man made weight and eating and dieting a fucking thorn in my side from early, early childhood. My grandfather was even worse.\n\nFuck them. Fuck him for dehumanizing my mother for gaining weight while she was doing the things you do to, y'know, not die from cancer. Fuck these people. We deserve better.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hor3ec/fuck_my_dad_for_giving_my_mother_shit_about/",
  "score": 201,
  "num_comments": 13,
  "comments": [
    {
      "id": "fxjjyv4",
      "author": "None",
      "body": "that’s absolutely deplorable. i’m sorry you and your mother had to deal with that, what a piece of shit",
      "created_utc": 1594397380.0,
      "score": 41,
      "context": []
    },
    {
      "id": "fxk1e2j",
      "author": "givingitmyal",
      "body": "Though not as extreme as this, I have lots of childhood memories of my father teasing or demeaning my mother because of her weight. That shit imprints deep on the psyche.",
      "created_utc": 1594405778.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fxk24zv",
      "author": "None",
      "body": "Oh, I’m so sorry. My disorder began when my dad was diagnosed with cancer and suddenly food seemed like the most dangerous and harmful thing. He started doing weird cleanses and tried all this extreme orthorexic stuff before he actually allowed doctors to get involved. Those treatments and IVs alone can make a person very puffy and to give a single fuck about somebody’s weight or appearance when they are so ill is really wrong. I’m sorry that happened and I’m sorry you were so young.",
      "created_utc": 1594406139.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fxk5ahb",
      "author": "PseudonymousBlob",
      "body": "Not on the same level at all, but when I visited my family for Christmas my mom kept calling me chubby while praising my brother for losing weight. He lost weight because he was sick with the flu for a month. So fucked up.",
      "created_utc": 1594407650.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fxjs4n9",
      "author": "scan420",
      "body": "im so sorry",
      "created_utc": 1594401313.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fxkbo1t",
      "author": "None",
      "body": "I'm so sorry. I hope you never have to experience that from anyone ever again. You are worth so much more than your father's own shitty opinions and insecurities. I hope your mother is well too <3",
      "created_utc": 1594410833.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxjv0q6",
      "author": "alysszza",
      "body": "Ew >:(",
      "created_utc": 1594402704.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxk29m6",
      "author": "bikinibabepaulina",
      "body": "Absolutely fucked up, I’m sorry for you :(",
      "created_utc": 1594406201.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxlguq6",
      "author": "None",
      "body": "Something that people may be given as part of treatment is steroids, and these cause weight gain. Your dad sounds like a grade A asshole.",
      "created_utc": 1594433944.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxm1iw6",
      "author": "None",
      "body": "That mustve hurt you a lot",
      "created_utc": 1594446078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxkehts",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1594412262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxmnqp0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1594453333.0,
      "score": 0,
      "context": [
        {
          "id": "fxkehts",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1594412262.0
        }
      ]
    }
  ]
}