{
  "id": "hpiqgz",
  "subreddit": "fuckeatingdisorders",
  "author": "sbear606",
  "created_utc": 1594505043.0,
  "title": "Almost 1 year into recovery...I feel weird about how far I’ve come, almost as if I never struggled enough in the past with my eating for me to even consider myself having recovered from an eating disorder.",
  "selftext": "I ended up recovering alone with the help of some ed recovery group chats and that’s all. I’ve maintained a normal weight for the past 11 months without weighing or counting calories. I only struggled with disordered eating for about a year and a half and now I’ve been recovering for almost a year. I feel so...invalid. Like I wasn’t ever even sick... I’m scared to even mention to my friends that I’ve been recovering for one full year cause they might say stuff like “yeah ok that’s cool but you werent even sick...” \n\nAlso the turning point for me to recover was when my ed convinced me that I couldn’t go on my family’s annual summer vacation because of the scary food there. So one day before we left I insisted that I couldn’t go. My family was furious and while they were gone I was so angry with myself that I binged the entire time they were gone. I’ve been recovering since then. BUT my family is going on this same vacation this year. They never knew the reason I didn’t go last year so they keep teasing me about it. I’m absolutely terrified to see my family this year because I know they will bring up why I didn’t go last year and I just won’t have an answer. None of them really knew I struggled with ed. I just needed to vent. Thanks for reading if anyone did.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hpiqgz/almost_1_year_into_recoveryi_feel_weird_about_how/",
  "score": 92,
  "num_comments": 7,
  "comments": [
    {
      "id": "fxrtte3",
      "author": "None",
      "body": "if someone had cancer for a year would they have been any less sick than someone that had cancer for four years? is the person that had cancer for a year not allowed to identify as a cancer survivor, attend support group meetings, go to therapy to deal w it bc there’s ppl that have had cancer for longer?\n\nan illness is an illness, no matter how long you were sick for.",
      "created_utc": 1594510683.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fxs129z",
      "author": "Littlegreenplace",
      "body": "A year and a half even a few months is a long  time, too long, to be struggle with an eating disorder. It was damaging, your recovery is valid and you should be very proud, I’m proud of you.",
      "created_utc": 1594514908.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fxti0m3",
      "author": "-plantagenista",
      "body": "If your relationship with food impacted your quality of life, it was serious and warranted recovery. End of story.",
      "created_utc": 1594551999.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxu0vgl",
      "author": "Sareeee48",
      "body": "If you didn’t believe you were sick or sick enough—that thought alone proves you were. And I spent years convinced I “wasn’t sick enough,” the amount of time may not ever make you feel as if you are. The fact is, you got out of it and you are so brave and strong for that.\n\nI also know how it feels to be terrified of telling your friends and family. I didn’t tell anyone for the longest time (they still don’t know the fully extent of it even now). I thought they’d mock me and that my boyfriend would leave me... none of that happened. None of it. That said, if they do react this way, why would you want to be associated with those types of people?\n\nOr you don’t have to tell them at all, if that makes it more comfortable for you. You don’t owe them an answer, you could say, “that was a tough time for me last year and I don’t want to talk about it,” and then change the subject.",
      "created_utc": 1594565995.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxu4c5s",
      "author": "scoutstail",
      "body": "Just the fact that you suffered at all means you were sick enough. Its easy to forget how competitive this illness, but there is no magic point where you are “sick enough.” Be proud of the fact that you’ve come so far in recovery, that’s an amazing feat.",
      "created_utc": 1594567980.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxufb22",
      "author": "sbear606",
      "body": "thank you that is a good point",
      "created_utc": 1594573777.0,
      "score": 1,
      "context": [
        {
          "id": "fxrtte3",
          "author": "None",
          "body": "if someone had cancer for a year would they have been any less sick than someone that had cancer for four years? is the person that had cancer for a year not allowed to identify as a cancer survivor, attend support group meetings, go to therapy to deal w it bc there’s ppl that have had cancer for longer?\n\nan illness is an illness, no matter how long you were sick for.",
          "created_utc": 1594510683.0
        }
      ]
    },
    {
      "id": "fxuflz3",
      "author": "sbear606",
      "body": "You’re right. I told my boyfriend last night and I was sobbing. That made me realize that I try and brush it off as a little thing but deep down I was so affected by my ed.",
      "created_utc": 1594573925.0,
      "score": 2,
      "context": [
        {
          "id": "fxu0vgl",
          "author": "Sareeee48",
          "body": "If you didn’t believe you were sick or sick enough—that thought alone proves you were. And I spent years convinced I “wasn’t sick enough,” the amount of time may not ever make you feel as if you are. The fact is, you got out of it and you are so brave and strong for that.\n\nI also know how it feels to be terrified of telling your friends and family. I didn’t tell anyone for the longest time (they still don’t know the fully extent of it even now). I thought they’d mock me and that my boyfriend would leave me... none of that happened. None of it. That said, if they do react this way, why would you want to be associated with those types of people?\n\nOr you don’t have to tell them at all, if that makes it more comfortable for you. You don’t owe them an answer, you could say, “that was a tough time for me last year and I don’t want to talk about it,” and then change the subject.",
          "created_utc": 1594565995.0
        }
      ]
    }
  ]
}