{
  "id": "htfyos",
  "subreddit": "fuckeatingdisorders",
  "author": "punipunijelly",
  "created_utc": 1595075999.0,
  "title": "Why the FUCK do I even need to be skinny?",
  "selftext": "Seriously. I need to recover. My relationships are suffering, my academics are suffering, my work is suffering, my finances are suffering, my body is suffering. I don’t have any energy to do the most basic tasks, I’m emotionally unstable, I feel bad about myself for doing this, etc etc etc. I need to stop.\n\nBut then my ED brain is like “But...but if you recover you’ll gain weight...and you won’t be thin anymore...so...” BITCH WHO CARES!?!? AND WHO THE FUCK ASKED YOU!?!?!?\n\nWHY!?!?!?!? WHY DO I NEED TO BE SKINNY!?!?!?!?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/htfyos/why_the_fuck_do_i_even_need_to_be_skinny/",
  "score": 250,
  "num_comments": 12,
  "comments": [
    {
      "id": "fygpmm9",
      "author": "None",
      "body": "I can relate. My ED brain associates \"skinny\" with \"good\". Not good *looking,* but morally superior. My ED brain pegs \"skinny\" as good the same way it pegs \"polite\" as good. No intellectual or logical reasoning, just emotional association. I don't know about you, though.\n\nIt's great that you recognize that you need to recover. It took me a while to get fully on board after my own realization, but it got easier the more I pushed on with it. Cheers for recovery, beat the ED brain (with a stick of butter)!",
      "created_utc": 1595081892.0,
      "score": 67,
      "context": []
    },
    {
      "id": "fygnalb",
      "author": "Sourpatch_kiddo",
      "body": "THIS. In the moments my logical brain pulls through it seems so STUPID how much I’m sacrificing and throwing my life away to have a smaller physical form and for WHAT???",
      "created_utc": 1595080380.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fygqefj",
      "author": "Enduendada",
      "body": "My ED brain will hit me with that \"you'll be unhealthy! you've worked so hard for this!\" like, b\\*tch, I'M FUCKING UNHEALTHY RIGHT NOW I never feel strong anymore and I had a breakdown over <fear food> the other day like, shut up!!!",
      "created_utc": 1595082375.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fygp8cm",
      "author": "ssnarly",
      "body": "Look back at this on bad days!! This is such an important realization",
      "created_utc": 1595081642.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fyh4cqi",
      "author": "NikoTaco02",
      "body": "ABSOLUTELY! The stupid ass number on the scale I'm chasing will not make me look any different. It won't make me feel different. It will not make me any more or less healthy than I am right now. Still, if I don't hit it, I'm fat, unappealing, not enough and not worthy. All of this over a goddamn number that changes every day anyways??!?!?",
      "created_utc": 1595090471.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fygzclh",
      "author": "alliebbb",
      "body": "YES. And starving and depriving yourself to lose those last 5 pounds that no one will even NOTICE \n\nsuch an important realization",
      "created_utc": 1595087693.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fyi6usy",
      "author": "beautifulchaos22",
      "body": "Yesss! It takes so much awareness to realize this, OP, proud of you! \n\nWhen I was at my worst, I couldn’t focus on anything but the number on the scale, it was horrible. I pushed friends away, I was bitter and irritable with my family who just wanted to help, and I missed out on a lot of fun things because I ‘had’ to exercise and restrict.\n\nI realized that if I died from anorexia, no one was going to put “ beautifulchaos22 was X number of lbs” on my headstone. It’s not an achievement no matter how much ED tries to convince you it is. \n\nI want to help others and be someone that they know they can turn to and always confide in. I want to make a difference even if it’s just by little acts of kindness. \n\nI cannot give what I want to give if I’m giving to the ED.\n\nStay strong and safe! ♥️",
      "created_utc": 1595111881.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fyh7pgw",
      "author": "benevk",
      "body": "Well, on the positive side, you’ve recognized this  and the faulty logic ED’s give! You’re making progress =] keep pushing, please 🤎",
      "created_utc": 1595092333.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fygu5db",
      "author": "fitgeek69",
      "body": "THANK YOU FOR THIS REMINDER.",
      "created_utc": 1595084663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyi5poi",
      "author": "Spectrachic311311",
      "body": "SO much this. I have no real reason to be so skinny. It just makes me feel like crap so there’s that. But I think I get competitive and think well I’m skinnier than her so that makes me better than her. It’s effed up.",
      "created_utc": 1595111230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyhuznk",
      "author": "disorderedthoughts",
      "body": "All the feels on this",
      "created_utc": 1595105094.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyh9r4s",
      "author": "BMI_Computron",
      "body": "I had a very dark moment at my worst and just realized.. No one, not a single soul, is going to be at my funeral praising how slim my corpse is.\n\nNot many people would have come to my funeral in the first place if I kept withdrawing and putting up barriers because I was scared to eat or have anything to do with calories. I deserve to have a life. An actual life. Not one where I keep trying to make myself the smallest I can be in my casket. I want to smile and laugh, see movies, roller skate, swim, spend time with my loved ones and go on trips and EAT without constantly judging my own body as I move through the life I want to have. I can't do that if I'm obsessively caught on my life in numbers and measurements.",
      "created_utc": 1595093453.0,
      "score": 21,
      "context": [
        {
          "id": "fygnalb",
          "author": "Sourpatch_kiddo",
          "body": "THIS. In the moments my logical brain pulls through it seems so STUPID how much I’m sacrificing and throwing my life away to have a smaller physical form and for WHAT???",
          "created_utc": 1595080380.0
        }
      ]
    }
  ]
}