{
  "id": "huo7kg",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1595262103.0,
  "title": "I feel that my only choices are either to restrict forever, to become overweight, or both.",
  "selftext": "I simply cannot envision a future where I just eat what I truly, ACTUALLY want and maintain an average weight, just like I did before developing an ED. My mind just can't process that scenario. The ED convinces me that the slightly restrictive prescribed meal plans, with set mealtimes, \"normal\" portion sizes, an \"average\" amount of calories and \"no binges because that's only emotional\" is the only barrier that protects me from becoming overweight.\n\nThere will never, ever be a time where I can just munch on something without having to forcibly stop myself. A time where I eat a normal lunch and feel fully satisfied afterwards. A time where I don't think about food and have to compulsively fill my time with random stuff to try and distract myself from it. A time where I eat one slice of cake or a handful of crisps and do not secretly want to eat the whole package but pretend otherwise. Or, if that will happen, it will only be because I've become overweight in the process - which will mean that my ED was right.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/huo7kg/i_feel_that_my_only_choices_are_either_to/",
  "score": 206,
  "num_comments": 11,
  "comments": [
    {
      "id": "fypqzri",
      "author": "Cipher_A",
      "body": "Hi there! I feel like I’ve come a long way in recovery, so I hope my experience helps you.\n\nI also had this fear (still have it). After the obsessive restricting, I had a bingeing phase, then restriction, then bingeing, sprinkled with compensatory excessive exercise. I thought my hunger was broken, that I’d forever have to, like you say, force myself to stop, because my stomach had become a black hole, and I yearned for the days when I was a child who just naturally got full on not much.\n\nEventually I decided that what I was doing to myself was unacceptable and it wasn’t how I wanted to live my life, so I very gradually started taking steps toward recovery. Deleting tracking apps, not counting in my head, eating out without worrying about not knowing the calories in my food, eating more foods I didn’t allow myself to eat before, trying to accept that my healthy adult body will look a certain way, allowing myself to eat whenever I felt like eating, not exercising as much.\n\nThere were still cycles of restrict-binge within that time, but each time seemed less intense than the last, like my ED itself was getting tired, because I wasn’t feeding it—I was feeding myself.\n\nSince the lockdown a couple of months ago I finally decided to dramatically drop exercise sessions. I only “work out” when I feel like it, I don’t try to manipulate myself into doing anything. I had already made great progress at that point, but since then it’s really been wonderful, because my appetite normalized completely. It was like a miracle to me. To be able to eat a normal portion and just feel full? Magic. \n\nThat’s where I am now, I’ve lived with my reclaimed normal appetite for these last few months, and my weight has normalized. I had gained 10lbs at the peak of my restricting-bingeing cycles, I had lost about half of that before lockdown, mainly because even though I was still hungry a lot, I wasn’t really outright bingeing anymore, and now since my hunger normalized, I’m pretty much back to where I was when my ED was just starting. \n\nI don’t look exactly the same, I was, honestly, leaner then, but I was also 18. I’m almost 25 now, and I think it’s normal that my body looks different now. I think I like how I look now better. I’m basically an older, buffer, more mature version of myself, as if nothing had happened in between. I’m a lot stronger than I was at 18, both in mind and body, I think, and I’m grateful that I emerged healthier on the other side. \n\nI still have ED thoughts, but they don’t consume my life anymore. I have time for me, I barely think about food anymore, it’s wild!\n\nSo I hope that you and anyone else who reads this will see that there is hope, there is another side, an outside to the tunnel. Recovery is so so so worth it. Don’t give up, give yourself a break and get to know your body again. It’s a bit like helicopter parents, you know? Too much and the kid rebels, but you give the kid space, opportunities to have their own experiences, and the next thing you know, they’re a fun, capable human being you’re proud to hang out with. So trust your body, you might not like what happens initially, but trust it, listen to it, give it some love, it’ll learn trust you again too, and it’ll all work out.",
      "created_utc": 1595290088.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fyoqx2m",
      "author": "gotellitonthefreeway",
      "body": "This is a relatable fear. When you have made some progress on recovery, see if you can find a nutritionist who will help you develop a plan for intuitive eating. It helped save my relationship with food. \n\nIt might seem impossible now, but if you let yourself have slip ups and mistakes, you can get there. There’s no shame. Eating is hard.",
      "created_utc": 1595271852.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fyoenvb",
      "author": "SaltPainting",
      "body": "I read this and my stomach clenched with terror—I have the exact same fear. Or, I fear that I’ll gain and gain and gain and gain and never be able to lose it if I free myself in that way...I wish I knew the answer, it’s so fucking scary. I feel ugly enough already",
      "created_utc": 1595265946.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fyofaky",
      "author": "jirakip",
      "body": "Same here... it seems like this is a common fear :( I have very strong ED thoughts but I’m also at a higher weight, so the obsession feels more like a preventative measure because I could easily become overweight. It’s excruciating because I know that I wouldn’t have the urge to eat so much if I stopped thinking so much about food/my body in the first place, but like you said, it would be as if my ED were validated if I gained weight as a result",
      "created_utc": 1595266250.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fyoz3d5",
      "author": "shelleybean1",
      "body": "I HAVE BEEN THINKING THE SAME WAY! I try to think about what I was like before my ED really got intense (restriction) and even then I was worried about my weight. Like I can't imagine a life without being obsessed with food. And I fear if I wasn't obsessed with food I'd become obese.",
      "created_utc": 1595275838.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fypra6m",
      "author": "Foolypooly",
      "body": "I'm sorry.. I totally understand how you feel. You just have to help reminding yourself that it IS possible to have a normal relationship with food. You did it before your ED, and you can do it again. You've trained your brain to only think in terms of absolutes (either I starve myself or I binge), but you can UN-train your brain. I was the same way, and it's still hard, but being aware that you can live life without thinking at the extremes has really helped. Wishing you luck, you can do it!!!",
      "created_utc": 1595290251.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fypibtc",
      "author": "None",
      "body": "I don't see how most of these comments are helpful. You do not have to become overweight to be recovered. There are many people that are not. Your body will learn to regulate itself over time. Staying in your eating disorder will never make you happy.",
      "created_utc": 1595285407.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fypdoc4",
      "author": "bikecrotchthrowaway",
      "body": "Same. I'm in therapy right now and looking back on my life, the default for me has been to overeat and it took so much effort during the short periods of time (less than a year each) when I was actually a healthy weight. \n\nI also have a lot of emotions to process, I guess, and maybe other coping skills I could learn but it's so sad sometimes because all I want to do some days is just numb the pain with cookies. It's so much easier.",
      "created_utc": 1595283033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyq4f5b",
      "author": "Silver_Oakleaf",
      "body": "This hit HARD with me too",
      "created_utc": 1595297896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyq31zu",
      "author": "Enduendada",
      "body": "May I ask what working towards a plan like that is like? It never occurred to me that a nutritionist could help you *develop a plan* that has intuitive eating as it's cornerstone",
      "created_utc": 1595297096.0,
      "score": 2,
      "context": [
        {
          "id": "fyoqx2m",
          "author": "gotellitonthefreeway",
          "body": "This is a relatable fear. When you have made some progress on recovery, see if you can find a nutritionist who will help you develop a plan for intuitive eating. It helped save my relationship with food. \n\nIt might seem impossible now, but if you let yourself have slip ups and mistakes, you can get there. There’s no shame. Eating is hard.",
          "created_utc": 1595271852.0
        }
      ]
    }
  ]
}