{
  "id": "hxwip1",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1595719820.0,
  "title": "Triggering recovery youtubers",
  "selftext": "Do you ever get triggered by recovery youtubers? And I don't mean \"recovery\" youtubers, I mean actual recovery youtubers.\n\nFor some reason I find myself to be always so triggered by Megsy Recovery. She always said to never restrict yet she rigidly followed a meal plan - how can you not restrict AND follow a meal plan? Do you just magically feel full with average portions? - and sometimes even stated out loud that she'd gladly eat her breakfast all over again. (But she didn't, for some reason) She also somehow managed to never binge. Plus she recovered in this perfectly sized beautiful body that I'd never ever in one million years possibly get if I truly stopped restricting. Basically she looks like the poster child of recovery and I cannot relate.\n\nAnd she's not the only one - I see so many youtubers that \"stop restricting\" and \"recover\" while following a meal plan and being apparently satisfied with that approach, and staying lean and fit at the same time. And here I am with my messy extreme hunger, my over the top binges and my bloatedness and weight gain, feeling even more lonely than before.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/hxwip1/triggering_recovery_youtubers/",
  "score": 91,
  "num_comments": 44,
  "comments": [
    {
      "id": "fz9907d",
      "author": "None",
      "body": "I've been in and out of recovery for 20+ years. My recovery always seemed strongest when I was accepting enough of my own body and eating habits to nourish it that I didn't need to compare myself to others or dissect how im/perfectly other folks with eating disorders were going about their lives.",
      "created_utc": 1595724782.0,
      "score": 35,
      "context": []
    },
    {
      "id": "fzaqw32",
      "author": "FicklePsychologist4",
      "body": "Let’s be honest the ED community in general is toxic. Even on this subreddit, there’s gatekeeping, there’s body shaming, and numbers everywhere. I think keeping too many ED influences in our lives (be it YouTubers or a bunch of “recovery friends”) keeps us tethered to it. The only one I can think of that’s good is What Mia Did Next. She’s inclusive and very knowledgeable",
      "created_utc": 1595769059.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fzapy9m",
      "author": "zedem124",
      "body": "I feel  similarly about Rebecca Leung. She seems recovered I guess, I can't judge, but it's just triggering to see that her recovered body is my goal body (thigh gap, visible ab lines, perfect collarbones). That being said, she is very sweet and open in her videos and they did help me kinda challenge myself.",
      "created_utc": 1595768341.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fz95rgv",
      "author": "icedblackamericano",
      "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
      "created_utc": 1595722806.0,
      "score": 42,
      "context": []
    },
    {
      "id": "fza42h1",
      "author": "absolute_boy",
      "body": "I found that some of these videos helped me take the vital first few steps into recovery, but now I avoid some of them because I feel like they are either quasi-recovered or that the discussion of eating disorders will just make me want to lose weight again. I used to watch a lot of videos by this very upper-middle-class English woman who lived in a big house with her family who did a lot of 'full day of eating' videos, but then I realized she had been 'in recovery' for three years, hadn't gained any weight, and had huge bags under her eyes. She talked about not restricting but then in a vlog slipped up and refused to eat something because 'I'm saving it for a full day of eating', and it dawned on me that the reason I was watching her was because I wanted to keep my skinny eating disorder body while not restricting just like her - except when the camera was off, she WAS restricting.",
      "created_utc": 1595746748.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fz9mgln",
      "author": "PizzaIsASuperfood",
      "body": "I never really followed Megsy Recovery because I also got the same vibe from her. She seemed extremely anxious about food and didn't really go through all these different stages that are typical of recovery. It does seem like a lot of people liked her because she described different experiences that they could relate to.",
      "created_utc": 1595733222.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fzabvop",
      "author": "xleabrax",
      "body": "I feel like Tabitha is the only positive influence for those who are deciding to recover on their own and in general but for those seeking professional help it’s better to stay in your own lane and take on the advice (I know sometimes professional help can be messy too but these people have been studying years to help like a dietitian will try to help you maintain weight in a healthy sustainable way with the interlude of having what you fancy etc) like others have said and I agree, it’s management because it is a mental disorder at the end of the day",
      "created_utc": 1595754643.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fzb0rod",
      "author": "RatEnabler",
      "body": "Yes because it's a false fucking lie. And I'm angry at 'recovery youtubers' for taking some stand of authority on an issue as complex as living with an eating disorder because recovery is NEVER linear or simple enough content to be boiled down for the youtube vlog.\n\nA thin, athletic, 'recovered' youtuber telling me how many grams of yoghurt they put in their oatmeal is not the content i should be interested in. These youtubers are obviously are still in the full grip of their disorder otherwise they wouldn't be obsessively logging, filming, and recording every god damn thing they eat. Recovered people don't behave like that. They have shit to do. And it's damaging and potentially dangerous, triggering content for disordered people to consume.\n\nA recovered body is not slim and athletic. Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny. Recovered people don't 'exercise cause they looove the feel'. I'm sick of the lying. I wish people were more honest with themselves.",
      "created_utc": 1595775467.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fz9qkk1",
      "author": "helgatitsbottom",
      "body": "I am in recovery, not restricting and I have a meal plan. That’s mostly because if I don’t have a plan, then I often won’t remember to eat, or I’ll be like there’s nothing in the house. It’s also a reminder of the minimum that I need to hit each day.\n\nHowever, I also don’t necessarily eat exactly what’s in the plan; if I’ve put whatever meal in there, but a burger is something I’m craving, then I’ll go for that.",
      "created_utc": 1595735964.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fz96g90",
      "author": "gardenfaiiri",
      "body": "I have the same feelings towards Megsy Recovery, I watched a few of her videos when I first began considering recovery. I had watched others like Tabitha Farrar, etc who talked about extreme hunger, and eating unrestrictedly using a meal plan as a minimum. I stopped watching here videos however after noticing things similar to what you stated in your post, in one video she even talks about how she would become obsessed with foods that she had to allowed herself in her ED during recovery and crave them all the time, however she would allow herself to have them regularly (only one a day) in order to not binge. To me that sounding like restricting - if I want pancakes all the time, I’m going to follow all the other advice I’ve been given and eat pancakes for every damn meal that day if that’s what my body is asking for. \n\nI always see so many others praising her, but I can’t understand how she can be seen as a role model for real recovery when she still seems to engage in slightly disordered behaviours. Sometimes I wish my recovery was as perfect as she made it seem in a lot of her videos. She reinforces the idea that I will never been happy when I’m not mirco-managing my intake, that I will have to continue to restrict even in recovery to hold on to my happiness and a body that is deemed acceptable by society.",
      "created_utc": 1595723221.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fza4a5g",
      "author": "zombieggs",
      "body": "So many seem to just never gain weight, some of them have content going back years and haven’t gained at all since then.",
      "created_utc": 1595746944.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fza9y9g",
      "author": "ambxvalence",
      "body": "Literally the onlt recovery youtuber I can follow without being triggered is Rebecca Leung. She is such a positive influence on me that my eating disorder doesnt want me watching her.",
      "created_utc": 1595752620.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fzbfw46",
      "author": "-plantagenista",
      "body": "I get triggered when they are still seemingly very slim, like slimmer than I was when I was deep into my ED. A lot of the recovery insagram pages (that are genuinely recovery ones) that i follow are women that are still very thin. I dont want to judge them or presume they aren't actually recovered but everytime I see them i feel so completely inadequate. \n\nThey post really nice, inspiring, warm hearted content and I can tell they genuinely want to help people but I can't get over that hurdle.\n\nIts very easy to declare all the many amazing benefits of recivery when you seemingly come out of it with society's ideal body. Its easy when you have a perfect, beautiful face. I cannot relate to these women.\n\nI feel bad for judging them so harshly sometimes but thats just how I feel.",
      "created_utc": 1595783249.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fzbrpf1",
      "author": "deena812044",
      "body": "YouTube is just REALITY TELEVISION 95% of the time!!! There are exceptions like Tabitha Farrar and Follow the Intuition and probably others but those 2 were enough for me. If you see a video or channel and there's a ton of makeup, lighting, body shots, people who act totally happy all the time, you can just consider it the Kardashians or \"Real Housewives\" of recovery 😆\n\nAlso of course, if someone \"recovered\" by going vegan, low carb, doing any kind of juicing or intermittent fasting, RUN AWAY!! \n\nInstagram and YouTube caaaan be helpful, but you can easily just fall into total bs if you're not careful. Good luck!!",
      "created_utc": 1595789182.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fz9icuo",
      "author": "basicallyaballerina",
      "body": "They’re probably in quasi recovery",
      "created_utc": 1595730571.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fzdboqa",
      "author": "victorysflame",
      "body": "The only YouTuber than actually helped me recover was Stephanie buttermore and her all in journey",
      "created_utc": 1595820955.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fzabqsv",
      "author": "internerderner2",
      "body": "I know. When I think about it, it's incredibly stupid of me to go on about picking random youtube videos apart and ranting about how imperfect they are...why would I even care about how much Megsy eats...but there you go, EDs are crazy. In the end, deep down, I think many of us watch these youtubers to basically get permission to eat, and not getting it gives more power to the ED itself.",
      "created_utc": 1595754499.0,
      "score": 6,
      "context": [
        {
          "id": "fz9907d",
          "author": "None",
          "body": "I've been in and out of recovery for 20+ years. My recovery always seemed strongest when I was accepting enough of my own body and eating habits to nourish it that I didn't need to compare myself to others or dissect how im/perfectly other folks with eating disorders were going about their lives.",
          "created_utc": 1595724782.0
        }
      ]
    },
    {
      "id": "fzau0ie",
      "author": "internerderner2",
      "body": "May I suggest you Tabitha Farrar as well? She's basically what I was pre-ED (in terms of food) and what I'd like to go back to. Also, she's on the older side, which is quite refreshing in a community which is a bit centered on young, somewhat bubbly and \"\"\"\"immature\"\"\"\" girl (I don't mean it in a negative way - just to mean they might not be relatable for different demographics).",
      "created_utc": 1595771306.0,
      "score": 16,
      "context": [
        {
          "id": "fzaqw32",
          "author": "FicklePsychologist4",
          "body": "Let’s be honest the ED community in general is toxic. Even on this subreddit, there’s gatekeeping, there’s body shaming, and numbers everywhere. I think keeping too many ED influences in our lives (be it YouTubers or a bunch of “recovery friends”) keeps us tethered to it. The only one I can think of that’s good is What Mia Did Next. She’s inclusive and very knowledgeable",
          "created_utc": 1595769059.0
        }
      ]
    },
    {
      "id": "fzatcxq",
      "author": "teeeeelashev",
      "body": "Second this! So much!",
      "created_utc": 1595770839.0,
      "score": 2,
      "context": [
        {
          "id": "fzaqw32",
          "author": "FicklePsychologist4",
          "body": "Let’s be honest the ED community in general is toxic. Even on this subreddit, there’s gatekeeping, there’s body shaming, and numbers everywhere. I think keeping too many ED influences in our lives (be it YouTubers or a bunch of “recovery friends”) keeps us tethered to it. The only one I can think of that’s good is What Mia Did Next. She’s inclusive and very knowledgeable",
          "created_utc": 1595769059.0
        }
      ]
    },
    {
      "id": "fza9bxm",
      "author": "internerderner2",
      "body": ">it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example).\n\nI agree with many parts of your post, but not on this one. I like Tabitha Farrar for this very reason: because she never stops to tell us that full recovery and a life without ED ARE possible. The idea of always having some problems with food for the rest of my life is so discouraging that if it was true I don't think I'd bother trying to recover in the first place. You're right in saying that recovery is incredibly hard and long and messy, and that's why I want to believe there's an actual endpoint rather than just \"being better but still having thoughts\".",
      "created_utc": 1595751972.0,
      "score": 23,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        }
      ]
    },
    {
      "id": "fzapzpn",
      "author": "FicklePsychologist4",
      "body": "Eating disorders are not determined by body size",
      "created_utc": 1595768373.0,
      "score": 20,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        }
      ]
    },
    {
      "id": "fz9hb76",
      "author": "Nicolo_Ultra",
      "body": "I feel this so hard. I’m “recovering” but not really, it’s just an illusion to make people happy because all the benchmarks of my eating disorder are still prevalent and negatively impacting my life, Im just not as physically sick at a 19 bmi as I was much lower. It comforts others seeing me healthier, but the mental disorder is not cured in the least. Im convinced I can’t be a healthy weight eating whatever I want/the normal American diet, and I’ll get fat if I give up the ED. I just have to walk the ED minefield for the rest of my life, I guess.",
      "created_utc": 1595729909.0,
      "score": 9,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        }
      ]
    },
    {
      "id": "fzbgt2t",
      "author": "-plantagenista",
      "body": "I completely relate to this. When I started recovery, I found it easy, I felt in control, I felt that I was being really healthy. I traded calorie counting for protein counting. I had a carefully controlled portion of yogurt and fruit every morning and would get very upset when we didn't have any left. I had to plan every meal ahead of time and everything had to be extremely healthy and nutritious. I didnt eat anything that wasn't \"healthy\".\n\nI suppose I was at least eating an acceptable amount of calories but I had obviously just traded anorexia for orthorexia and surprise, surprise, that lasted for about 4 days until I relapsed. \n\nFinding recovery easy doesnt mean you never had an ED in the first place, it means you still have it.",
      "created_utc": 1595783704.0,
      "score": 3,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        }
      ]
    },
    {
      "id": "fz9p4z5",
      "author": "Flesh-And-Bone",
      "body": "a pint of ice cream is a binge? idk about that",
      "created_utc": 1595734973.0,
      "score": 5,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        }
      ]
    },
    {
      "id": "i1id3ob",
      "author": "FuelImaginary8410",
      "body": "Are you talking about Elzani? 😆",
      "created_utc": 1647853695.0,
      "score": 3,
      "context": [
        {
          "id": "fza42h1",
          "author": "absolute_boy",
          "body": "I found that some of these videos helped me take the vital first few steps into recovery, but now I avoid some of them because I feel like they are either quasi-recovered or that the discussion of eating disorders will just make me want to lose weight again. I used to watch a lot of videos by this very upper-middle-class English woman who lived in a big house with her family who did a lot of 'full day of eating' videos, but then I realized she had been 'in recovery' for three years, hadn't gained any weight, and had huge bags under her eyes. She talked about not restricting but then in a vlog slipped up and refused to eat something because 'I'm saving it for a full day of eating', and it dawned on me that the reason I was watching her was because I wanted to keep my skinny eating disorder body while not restricting just like her - except when the camera was off, she WAS restricting.",
          "created_utc": 1595746748.0
        }
      ]
    },
    {
      "id": "fzb51c8",
      "author": "internerderner2",
      "body": ">Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny.\n\nWell...to be honest, before my ED I was skinny (just not AS skinny as with an ED) and I didn't really put any effort into it. I just happened to have a daily intake that was aligned with that. It was only with my ED that I found out (and started caring about) what a calorie was.\n\nI also didn't exercise, at least not formally, except for the odd hike.\n\nI agree with the idea that truly recovered people don't just think and talk about food the whole time.",
      "created_utc": 1595777796.0,
      "score": 2,
      "context": [
        {
          "id": "fzb0rod",
          "author": "RatEnabler",
          "body": "Yes because it's a false fucking lie. And I'm angry at 'recovery youtubers' for taking some stand of authority on an issue as complex as living with an eating disorder because recovery is NEVER linear or simple enough content to be boiled down for the youtube vlog.\n\nA thin, athletic, 'recovered' youtuber telling me how many grams of yoghurt they put in their oatmeal is not the content i should be interested in. These youtubers are obviously are still in the full grip of their disorder otherwise they wouldn't be obsessively logging, filming, and recording every god damn thing they eat. Recovered people don't behave like that. They have shit to do. And it's damaging and potentially dangerous, triggering content for disordered people to consume.\n\nA recovered body is not slim and athletic. Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny. Recovered people don't 'exercise cause they looove the feel'. I'm sick of the lying. I wish people were more honest with themselves.",
          "created_utc": 1595775467.0
        }
      ]
    },
    {
      "id": "fzazksq",
      "author": "petitelinotte212",
      "body": "I have a similar issue - my therapist calls this “restriction in disguise” but I think what she means is unconscious restricting. Meaning restriction is such a decades long habit for me that I’ll easily “forget to eat” for half the day and not realize how hungry I am until my blood sugar is crashing. Or I’ll also not eat because I put off grocery shopping until the last possible minute. I had some historical issues around food scarcity, I think the avoiding eating habit goes much deeper in my mind than just weight loss and it’s been so tricky for me to manage my restricting habits - even though I’m technically “recovered” from my ED. Meal plans are helpful because they are already planned out, meaning they take out some of the mental and emotional labor of feeding myself, and they’re really just a minimum - and I do the same thing, I’ll swap out something else that I want to eat if I feel like it.",
      "created_utc": 1595774787.0,
      "score": 3,
      "context": [
        {
          "id": "fz9qkk1",
          "author": "helgatitsbottom",
          "body": "I am in recovery, not restricting and I have a meal plan. That’s mostly because if I don’t have a plan, then I often won’t remember to eat, or I’ll be like there’s nothing in the house. It’s also a reminder of the minimum that I need to hit each day.\n\nHowever, I also don’t necessarily eat exactly what’s in the plan; if I’ve put whatever meal in there, but a burger is something I’m craving, then I’ll go for that.",
          "created_utc": 1595735964.0
        }
      ]
    },
    {
      "id": "fzac2am",
      "author": "internerderner2",
      "body": "To be fair, I really don't want to hate on her - she seems a lovely person and if this is the path that worked for her, then I can only be happy. It just sometimes seems that her words don't fully align with what she shows in the videos, but I don't know her and the details of her recovery so maybe I shouldn't judge.",
      "created_utc": 1595754837.0,
      "score": 5,
      "context": [
        {
          "id": "fz96g90",
          "author": "gardenfaiiri",
          "body": "I have the same feelings towards Megsy Recovery, I watched a few of her videos when I first began considering recovery. I had watched others like Tabitha Farrar, etc who talked about extreme hunger, and eating unrestrictedly using a meal plan as a minimum. I stopped watching here videos however after noticing things similar to what you stated in your post, in one video she even talks about how she would become obsessed with foods that she had to allowed herself in her ED during recovery and crave them all the time, however she would allow herself to have them regularly (only one a day) in order to not binge. To me that sounding like restricting - if I want pancakes all the time, I’m going to follow all the other advice I’ve been given and eat pancakes for every damn meal that day if that’s what my body is asking for. \n\nI always see so many others praising her, but I can’t understand how she can be seen as a role model for real recovery when she still seems to engage in slightly disordered behaviours. Sometimes I wish my recovery was as perfect as she made it seem in a lot of her videos. She reinforces the idea that I will never been happy when I’m not mirco-managing my intake, that I will have to continue to restrict even in recovery to hold on to my happiness and a body that is deemed acceptable by society.",
          "created_utc": 1595723221.0
        }
      ]
    },
    {
      "id": "fzabvc2",
      "author": "internerderner2",
      "body": "I have the same feelings about Tabitha Farrar. My ED absolutely hates her.",
      "created_utc": 1595754633.0,
      "score": 4,
      "context": [
        {
          "id": "fza9y9g",
          "author": "ambxvalence",
          "body": "Literally the onlt recovery youtuber I can follow without being triggered is Rebecca Leung. She is such a positive influence on me that my eating disorder doesnt want me watching her.",
          "created_utc": 1595752620.0
        }
      ]
    },
    {
      "id": "fzu3ueu",
      "author": "justme89_",
      "body": "I can't stand her! For me she is too fake and still so so so skinny; it really is different for everyone. I like Tabitha the most (ED hates her) because she is so real. A bit too direct and straight forward sometimes, but that's what works for my recovery",
      "created_utc": 1596175023.0,
      "score": 3,
      "context": [
        {
          "id": "fza9y9g",
          "author": "ambxvalence",
          "body": "Literally the onlt recovery youtuber I can follow without being triggered is Rebecca Leung. She is such a positive influence on me that my eating disorder doesnt want me watching her.",
          "created_utc": 1595752620.0
        }
      ]
    },
    {
      "id": "fzkft8z",
      "author": "RigorousSleeper",
      "body": "That's real & valid. I think that's a byproduct of Youtube as a medium. Audiences give views to prettier faces and more 'acceptable' bodies.",
      "created_utc": 1595979935.0,
      "score": 2,
      "context": [
        {
          "id": "fzbfw46",
          "author": "-plantagenista",
          "body": "I get triggered when they are still seemingly very slim, like slimmer than I was when I was deep into my ED. A lot of the recovery insagram pages (that are genuinely recovery ones) that i follow are women that are still very thin. I dont want to judge them or presume they aren't actually recovered but everytime I see them i feel so completely inadequate. \n\nThey post really nice, inspiring, warm hearted content and I can tell they genuinely want to help people but I can't get over that hurdle.\n\nIts very easy to declare all the many amazing benefits of recivery when you seemingly come out of it with society's ideal body. Its easy when you have a perfect, beautiful face. I cannot relate to these women.\n\nI feel bad for judging them so harshly sometimes but thats just how I feel.",
          "created_utc": 1595783249.0
        }
      ]
    },
    {
      "id": "fzb3zet",
      "author": "Enduendada",
      "body": "I mean... There's some truth to that argument, but on the other hand I don't find it weird at all that you'd want to see how recovery is going for other people. It can be a scary process, and even if you're truly committed to it it's unrealistic to expect it to be a straight line. Feeling like we're not alone and seeking community can be a very powerful thing, as long as you are responsible about it.\n\nI'd advise to look for less triggering YouTubers.",
      "created_utc": 1595777240.0,
      "score": 3,
      "context": [
        {
          "id": "fz9907d",
          "author": "None",
          "body": "I've been in and out of recovery for 20+ years. My recovery always seemed strongest when I was accepting enough of my own body and eating habits to nourish it that I didn't need to compare myself to others or dissect how im/perfectly other folks with eating disorders were going about their lives.",
          "created_utc": 1595724782.0
        },
        {
          "id": "fzabqsv",
          "author": "internerderner2",
          "body": "I know. When I think about it, it's incredibly stupid of me to go on about picking random youtube videos apart and ranting about how imperfect they are...why would I even care about how much Megsy eats...but there you go, EDs are crazy. In the end, deep down, I think many of us watch these youtubers to basically get permission to eat, and not getting it gives more power to the ED itself.",
          "created_utc": 1595754499.0
        }
      ]
    },
    {
      "id": "fzhos55",
      "author": "icedblackamericano",
      "body": "Fair point, not everyone views things the same way.",
      "created_utc": 1595920771.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fza9bxm",
          "author": "internerderner2",
          "body": ">it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example).\n\nI agree with many parts of your post, but not on this one. I like Tabitha Farrar for this very reason: because she never stops to tell us that full recovery and a life without ED ARE possible. The idea of always having some problems with food for the rest of my life is so discouraging that if it was true I don't think I'd bother trying to recover in the first place. You're right in saying that recovery is incredibly hard and long and messy, and that's why I want to believe there's an actual endpoint rather than just \"being better but still having thoughts\".",
          "created_utc": 1595751972.0
        }
      ]
    },
    {
      "id": "fzhnc37",
      "author": "icedblackamericano",
      "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
      "created_utc": 1595919392.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        }
      ]
    },
    {
      "id": "fzhnfpo",
      "author": "icedblackamericano",
      "body": "Agreed. I still purge but it’s “auto purging” rather than “fingers-in-the-throat” purging, so because I don’t go to the bathroom after eating then my friends think I stopped purging. Nope. It just got so bad that it comes up automatically because I busted my esophageal sphincter.",
      "created_utc": 1595919487.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fz9hb76",
          "author": "Nicolo_Ultra",
          "body": "I feel this so hard. I’m “recovering” but not really, it’s just an illusion to make people happy because all the benchmarks of my eating disorder are still prevalent and negatively impacting my life, Im just not as physically sick at a 19 bmi as I was much lower. It comforts others seeing me healthier, but the mental disorder is not cured in the least. Im convinced I can’t be a healthy weight eating whatever I want/the normal American diet, and I’ll get fat if I give up the ED. I just have to walk the ED minefield for the rest of my life, I guess.",
          "created_utc": 1595729909.0
        }
      ]
    },
    {
      "id": "fzhnmgc",
      "author": "icedblackamericano",
      "body": "I laughed because I know this “success”...it’s like “I’m not obsessing over calories anymore, woohoo! Instead, I’m obsessing over other numbers in other stats! Wait...oh no...”",
      "created_utc": 1595919664.0,
      "score": 2,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzbgt2t",
          "author": "-plantagenista",
          "body": "I completely relate to this. When I started recovery, I found it easy, I felt in control, I felt that I was being really healthy. I traded calorie counting for protein counting. I had a carefully controlled portion of yogurt and fruit every morning and would get very upset when we didn't have any left. I had to plan every meal ahead of time and everything had to be extremely healthy and nutritious. I didnt eat anything that wasn't \"healthy\".\n\nI suppose I was at least eating an acceptable amount of calories but I had obviously just traded anorexia for orthorexia and surprise, surprise, that lasted for about 4 days until I relapsed. \n\nFinding recovery easy doesnt mean you never had an ED in the first place, it means you still have it.",
          "created_utc": 1595783704.0
        }
      ]
    },
    {
      "id": "fz9xe5d",
      "author": "thatgentleman28101",
      "body": "”entire pint of ice cream **after a large  fast food meal**”",
      "created_utc": 1595740995.0,
      "score": 6,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fz9p4z5",
          "author": "Flesh-And-Bone",
          "body": "a pint of ice cream is a binge? idk about that",
          "created_utc": 1595734973.0
        }
      ]
    },
    {
      "id": "fzhnh8a",
      "author": "icedblackamericano",
      "body": "There was more in that sentence",
      "created_utc": 1595919527.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fz9p4z5",
          "author": "Flesh-And-Bone",
          "body": "a pint of ice cream is a binge? idk about that",
          "created_utc": 1595734973.0
        }
      ]
    },
    {
      "id": "fzb9ape",
      "author": "RatEnabler",
      "body": "That's a fair point, and I am drawing a lot from my own experience as a shorter person, I've found I have to weigh a lot less to have the same BMI as someone a few inches taller, and as a shortie myself I'm forever rather bitter about that. 😢 At least for people under 5'3>, it takes a lot of conscious effort and disordered behaviour to appear skinny, and believing I can nonchalantly stay BMI 18 is unrealistic for me because of my frame. I forget not everyone is not 5'1. 😬",
      "created_utc": 1595779997.0,
      "score": 5,
      "context": [
        {
          "id": "fzb0rod",
          "author": "RatEnabler",
          "body": "Yes because it's a false fucking lie. And I'm angry at 'recovery youtubers' for taking some stand of authority on an issue as complex as living with an eating disorder because recovery is NEVER linear or simple enough content to be boiled down for the youtube vlog.\n\nA thin, athletic, 'recovered' youtuber telling me how many grams of yoghurt they put in their oatmeal is not the content i should be interested in. These youtubers are obviously are still in the full grip of their disorder otherwise they wouldn't be obsessively logging, filming, and recording every god damn thing they eat. Recovered people don't behave like that. They have shit to do. And it's damaging and potentially dangerous, triggering content for disordered people to consume.\n\nA recovered body is not slim and athletic. Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny. Recovered people don't 'exercise cause they looove the feel'. I'm sick of the lying. I wish people were more honest with themselves.",
          "created_utc": 1595775467.0
        },
        {
          "id": "fzb51c8",
          "author": "internerderner2",
          "body": ">Effortless skinniness is a lie perpetuated to you to keep you forever unhappy. Skinny people work hard to stay skinny.\n\nWell...to be honest, before my ED I was skinny (just not AS skinny as with an ED) and I didn't really put any effort into it. I just happened to have a daily intake that was aligned with that. It was only with my ED that I found out (and started caring about) what a calorie was.\n\nI also didn't exercise, at least not formally, except for the odd hike.\n\nI agree with the idea that truly recovered people don't just think and talk about food the whole time.",
          "created_utc": 1595777796.0
        }
      ]
    },
    {
      "id": "fzp3ls3",
      "author": "FicklePsychologist4",
      "body": "But assuming weights and BMIs is still in poor taste. I’m not even sure why you think including numbers like this in a recovery thread is appropriate in the first place. You have no idea what’s going on behind the scenes with people. The “thin” YouTuber may be binging then purging through exercise. The “larger” YouTuber could be restricting all day then binging and what you see that person feeling a false sense of freedom or externalizing their shame through “boasting”. Bottom line is you cannot assume what “direction” someone has “swung” based on weight.",
      "created_utc": 1596082553.0,
      "score": 5,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        },
        {
          "id": "fzhnc37",
          "author": "icedblackamericano",
          "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
          "created_utc": 1595919392.0
        }
      ]
    },
    {
      "id": "fzpn6bb",
      "author": "icedblackamericano",
      "body": "I was specifically talking about a certain type and not intending to generalize. We agree, you just disagree with me bringing up one type of person. And that’s fine; as I said, I agree with you. I am not assuming because the specific people I’m talking about include their backstory and before/after photos. This was a narrow view based on “HEY LOOK AT MY AWESOME RECOVERY” posts I’ve personally encountered. \n\nAs for the including numbers thing, this subreddit is for open discussion without needing TW/CW in comments/posts.",
      "created_utc": 1596099600.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        },
        {
          "id": "fzhnc37",
          "author": "icedblackamericano",
          "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
          "created_utc": 1595919392.0
        },
        {
          "id": "fzp3ls3",
          "author": "FicklePsychologist4",
          "body": "But assuming weights and BMIs is still in poor taste. I’m not even sure why you think including numbers like this in a recovery thread is appropriate in the first place. You have no idea what’s going on behind the scenes with people. The “thin” YouTuber may be binging then purging through exercise. The “larger” YouTuber could be restricting all day then binging and what you see that person feeling a false sense of freedom or externalizing their shame through “boasting”. Bottom line is you cannot assume what “direction” someone has “swung” based on weight.",
          "created_utc": 1596082553.0
        }
      ]
    },
    {
      "id": "g0ykwzx",
      "author": "FicklePsychologist4",
      "body": "It’s a matter of principle. Numbers aren’t helpful even if they’re “allowed”. The illness is not about the weight. I get what you’re saying but I don’t agree with the way you categorized them.",
      "created_utc": 1597030831.0,
      "score": 2,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        },
        {
          "id": "fzhnc37",
          "author": "icedblackamericano",
          "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
          "created_utc": 1595919392.0
        },
        {
          "id": "fzp3ls3",
          "author": "FicklePsychologist4",
          "body": "But assuming weights and BMIs is still in poor taste. I’m not even sure why you think including numbers like this in a recovery thread is appropriate in the first place. You have no idea what’s going on behind the scenes with people. The “thin” YouTuber may be binging then purging through exercise. The “larger” YouTuber could be restricting all day then binging and what you see that person feeling a false sense of freedom or externalizing their shame through “boasting”. Bottom line is you cannot assume what “direction” someone has “swung” based on weight.",
          "created_utc": 1596082553.0
        },
        {
          "id": "fzpn6bb",
          "author": "icedblackamericano",
          "body": "I was specifically talking about a certain type and not intending to generalize. We agree, you just disagree with me bringing up one type of person. And that’s fine; as I said, I agree with you. I am not assuming because the specific people I’m talking about include their backstory and before/after photos. This was a narrow view based on “HEY LOOK AT MY AWESOME RECOVERY” posts I’ve personally encountered. \n\nAs for the including numbers thing, this subreddit is for open discussion without needing TW/CW in comments/posts.",
          "created_utc": 1596099600.0
        }
      ]
    },
    {
      "id": "g0ykzk9",
      "author": "FicklePsychologist4",
      "body": "Language is important in this community so it’s important to be careful.",
      "created_utc": 1597030879.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        },
        {
          "id": "fzhnc37",
          "author": "icedblackamericano",
          "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
          "created_utc": 1595919392.0
        },
        {
          "id": "fzp3ls3",
          "author": "FicklePsychologist4",
          "body": "But assuming weights and BMIs is still in poor taste. I’m not even sure why you think including numbers like this in a recovery thread is appropriate in the first place. You have no idea what’s going on behind the scenes with people. The “thin” YouTuber may be binging then purging through exercise. The “larger” YouTuber could be restricting all day then binging and what you see that person feeling a false sense of freedom or externalizing their shame through “boasting”. Bottom line is you cannot assume what “direction” someone has “swung” based on weight.",
          "created_utc": 1596082553.0
        },
        {
          "id": "fzpn6bb",
          "author": "icedblackamericano",
          "body": "I was specifically talking about a certain type and not intending to generalize. We agree, you just disagree with me bringing up one type of person. And that’s fine; as I said, I agree with you. I am not assuming because the specific people I’m talking about include their backstory and before/after photos. This was a narrow view based on “HEY LOOK AT MY AWESOME RECOVERY” posts I’ve personally encountered. \n\nAs for the including numbers thing, this subreddit is for open discussion without needing TW/CW in comments/posts.",
          "created_utc": 1596099600.0
        }
      ]
    },
    {
      "id": "g1k353a",
      "author": "icedblackamericano",
      "body": "You're welcome to disagree, and of course you're welcome to explain why you disagree, but if we end up understanding each other and still disagreeing, there's not much else we can do. I think we are just looking at it from a different perspective; I don't think you're wrong or misguided or anything, I just don't see it exactly the same way is all.",
      "created_utc": 1597483768.0,
      "score": 1,
      "context": [
        {
          "id": "fz95rgv",
          "author": "icedblackamericano",
          "body": "There are two things I've noticed in the \"recovery social media\" group:\n\n1. A person who still has restriction, but they think because the portions look visually larger, it's not restriction. This is typically like eating a large amount of fruits and vegetables (which are great but low cal), or restricting their diet to \"clean\" food only (which we would recognize as orthorexia. Their bodies are not skeletal, but are still much slimmer than average (usually BMI 19-ish).\n\n2. A person who has \"swapped\" a restrictive disorder for a binge disorder. These are the people who \"boast\" about the *unnecessarily large meals* that they consume. It is a \"normal portion\" to eat part of a pint of ice cream. It is not \"recovery\" to eat an entire pint of ice cream after a large  fast food meal. This is binge eating, not recovery. Their bodies are typically larger, BMI 25 or higher. \n\nFor anyone who \"just\" starts recovering and finds it \"easier than I thought\", I would suspect it's one ED traded for another. Recovery is difficult and messy, and typically it's management rather than \"yeah I'm totally 100% recovered\" because ED's are mental disorders and the research seems to indicate that they cannot be \"cured\" (but can be managed...like diabetes, for example). Anyone who is chugging through recovery-management would explain how difficult it is, then offer some ideas that worked for them on how to address each difficulty. Someone who goes on about it being easy, or pretends it's all smooth sailing, that person hasn't recovered.",
          "created_utc": 1595722806.0
        },
        {
          "id": "fzapzpn",
          "author": "FicklePsychologist4",
          "body": "Eating disorders are not determined by body size",
          "created_utc": 1595768373.0
        },
        {
          "id": "fzhnc37",
          "author": "icedblackamericano",
          "body": "Absolutely true. The unfortunate fact is that anorexia nervosa gets the most visibility and the “recovery results” are the most stark. Statistically, those with bulimia nervosa are in the health to obese BMI range...for example, I could go into Full Recovery Mode™️ right now and no one could see a visual difference. This is still recovery, but it’s not shared as often as the “before-after” pictures of anorexia sufferers who go from underweight to obese. That’s all I meant by it, sorry if I wasn’t clear.",
          "created_utc": 1595919392.0
        },
        {
          "id": "fzp3ls3",
          "author": "FicklePsychologist4",
          "body": "But assuming weights and BMIs is still in poor taste. I’m not even sure why you think including numbers like this in a recovery thread is appropriate in the first place. You have no idea what’s going on behind the scenes with people. The “thin” YouTuber may be binging then purging through exercise. The “larger” YouTuber could be restricting all day then binging and what you see that person feeling a false sense of freedom or externalizing their shame through “boasting”. Bottom line is you cannot assume what “direction” someone has “swung” based on weight.",
          "created_utc": 1596082553.0
        },
        {
          "id": "fzpn6bb",
          "author": "icedblackamericano",
          "body": "I was specifically talking about a certain type and not intending to generalize. We agree, you just disagree with me bringing up one type of person. And that’s fine; as I said, I agree with you. I am not assuming because the specific people I’m talking about include their backstory and before/after photos. This was a narrow view based on “HEY LOOK AT MY AWESOME RECOVERY” posts I’ve personally encountered. \n\nAs for the including numbers thing, this subreddit is for open discussion without needing TW/CW in comments/posts.",
          "created_utc": 1596099600.0
        },
        {
          "id": "g0ykwzx",
          "author": "FicklePsychologist4",
          "body": "It’s a matter of principle. Numbers aren’t helpful even if they’re “allowed”. The illness is not about the weight. I get what you’re saying but I don’t agree with the way you categorized them.",
          "created_utc": 1597030831.0
        }
      ]
    }
  ]
}