{
  "id": "i1r5xi",
  "subreddit": "fuckeatingdisorders",
  "author": "gardenfaiiri",
  "created_utc": 1596283609.0,
  "title": "Today and everyday here after I will commit myself to unrestricted eating and weight gain.",
  "selftext": "I’ve been recovering from my last relapse for nearly a month now, I’ve never made it this far and I’m honestly very surprised. Although I can feel I’ve been in the verge of a relapse for about a week and increasingly engaging in unhelpful behaviours I wanted to write this to hold myself accountable to my commitment to this recovery. \n\nI realised a few days ago that I was still restricting, eating a lot, but I was still weighing everything, counting calories and would never let myself eat above my goal calories even if I was really hungry and really wanted to. So I threw out all the scales, deleted MFP and made a pledge to commit myself to structured unrestricted eating (still having a baseline minimum of 3 meals + 3 snacks and an idea of how much that has to include at a minimum. It went well, until I realised I had started skipping snacks and missing parts off meals and justifying it by the fact I was not physically hungry, or I had waiting too long and at that point I should just wait until the next meal or snack and not bother eating. Yesterday was my birthday and I wanted to challenge having a meal out and having an alcoholic drink with it, I did have several panic attacks beforehand, which included sitting down on the side of the road and crying but I did manage to have a starter and a drink instead of a full meal and then took myself out for takeaway chips on the beach to make up for it. \n\nOn reflection of all of this I realised something very important about my commit to recovery. Eating was becoming easier, I have basically no fear foods anymore, food and the act of eating causes very little anxiety in the moment now, the most nerve wrecking thing is getting overwhelmed by having to make a decision about what to eat. I can see that this proves I have committed myself to and am succeeding at eating unrestrictedly. However, I still feel terrible about eating afterwards, I find eating food I haven’t prepared and don’t know the calories of really difficult, using different bowls so I’m not forcing myself the tiniest portions possible is difficult and eating food I deem “bad” or “unhealthy” because it’s a food associated with weight gain by diet culture is hard. I see that this shows I haven’t actually committed myself to unrestricted weight gain, I continue to use this behaviours because I fear if I don’t I will gain weight. Which is stupid, I can’t recover still holding on to a suppress body weight, I can’t allow myself food freedom, and not allow my body freedom to gain weight, change shape, and make itself healthy. \n\nSo after that stupidly long post I’m here to say, today and every day here after I shall commit myself to both. I will eat the food I want in the amounts my body wants and needs regardless of the consequence of that (which will in the end be a better and happier life), I will do this every moment regardless of external factors. I can be sad, anxious, angry, happy, indifferent and still eat. Basically I must eat in order to heal my body and my relationship with food. So if you’ll excuse me, I’m off to have a PBJ sandwich, and maybe some of that leftover takeout.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i1r5xi/today_and_everyday_here_after_i_will_commit/",
  "score": 87,
  "num_comments": 6,
  "comments": [
    {
      "id": "fzzh7v5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1596291308.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g01e0qf",
      "author": "BMI_Computron",
      "body": "**Kick. Ass.**\n\n>I can't recover still holding onto a suppressed body weight.\n\nThis is such a power move against your ED and I couldn't be more brimming with pride about your pure strength right now. Seriously. If no one ever tells you, I am proud of you. You're doing great. You deserve to eat. You deserve a life. Love. Memories. Happiness.\n\nMuch love and best of luck! I'm here if you ever need to vent. :)❤️",
      "created_utc": 1596327658.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzzn7bk",
      "author": "bring_me_tea",
      "body": "There will be some rough shitty days, but as you continue, focus on the overall trend of feeling better and healthier! You can do it, and you're worth it!",
      "created_utc": 1596294512.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g00lfla",
      "author": "bana-bread",
      "body": "100% relate to this. Just had sunflower butter for the first time in 3 years this morning because I felt comfortable eating full-fat nut butters now. I don’t feel guilty but I only had half a serving because I didn’t “feel” like eating the whole thing. I’ve been eating more and don’t really avoid any foods, but I realized I’m always monitoring the AMOUNT I eat and get anxious whenever we go out to eat. I stopped tracking calories when I went into quasi-recovery a month ago, but I have a rough idea of how much to eat so that I don’t gain weight. I haven’t lost any weight since then, but I haven’t gained either. \n\nI know quasi-recovery doesn’t really work, but I’m still scared to go “All in”. I’m still scared of gaining weight—or rather, I only want to gain X amount so that I look “normal”. I started following a lot of “All in” insta accounts to motivate me, and I’m planning to do a grocery haul this week where I don’t look at any of the labels and just get what I want. I know I still need a little bit more of a push before I can fully commit, but I feel so close after today, I think I’m nearly ready. The problem is that my family keeps triggering me by bringing up my eating habits and weight, (I’ve talked to them about it and they do it less, but sometimes it slips out) but I’m moving out in 2 weeks so I think I’ll finally be in the right mindset to commit to full recovery.",
      "created_utc": 1596311387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzzxoql",
      "author": "gardenfaiiri",
      "body": "I hope you enjoy that meal, it will be nice to join in. Let’s kick our EDs asses",
      "created_utc": 1596299815.0,
      "score": 3,
      "context": [
        {
          "id": "fzzh7v5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1596291308.0
        }
      ]
    },
    {
      "id": "g02q4c6",
      "author": "gardenfaiiri",
      "body": "Thank you so much, this means a lot. It’s tough but messages like these I repeat to myself in those moments. I am so thankful for your reply, I’m almost all alone in my recovery so it feels really motivating to hear someone tell you they are proud of you. You’re an angel.",
      "created_utc": 1596361403.0,
      "score": 2,
      "context": [
        {
          "id": "g01e0qf",
          "author": "BMI_Computron",
          "body": "**Kick. Ass.**\n\n>I can't recover still holding onto a suppressed body weight.\n\nThis is such a power move against your ED and I couldn't be more brimming with pride about your pure strength right now. Seriously. If no one ever tells you, I am proud of you. You're doing great. You deserve to eat. You deserve a life. Love. Memories. Happiness.\n\nMuch love and best of luck! I'm here if you ever need to vent. :)❤️",
          "created_utc": 1596327658.0
        }
      ]
    },
    {
      "id": "g018r2q",
      "author": "gardenfaiiri",
      "body": "Hearing this made me so happy, I have felt the same way for weeks and it’s not a nice position to be stuck in. Honestly it’s so freeing, today my sister offered my some Japanese cookies she bought from are local Asian super market. The label is in Japanese, I couldn’t read it and I don’t know any nutritional information. I immediately said yes when offered and I ate and moved on. It was so freeing to join in, it was so nice to be able to say yes. She’s a little younger than me but has autism so doesn’t really understand what’s going on with me - she always offers me some of her food and I can see the disappointment in her eyes when I say no. It was nice not to see that. \n\nIt’s so easy, it’s so difficult, but it’s worth it. Good luck with everything and I hope moving out goes well and that it is a positive move for you and your recovery. Take care.",
      "created_utc": 1596324492.0,
      "score": 3,
      "context": [
        {
          "id": "g00lfla",
          "author": "bana-bread",
          "body": "100% relate to this. Just had sunflower butter for the first time in 3 years this morning because I felt comfortable eating full-fat nut butters now. I don’t feel guilty but I only had half a serving because I didn’t “feel” like eating the whole thing. I’ve been eating more and don’t really avoid any foods, but I realized I’m always monitoring the AMOUNT I eat and get anxious whenever we go out to eat. I stopped tracking calories when I went into quasi-recovery a month ago, but I have a rough idea of how much to eat so that I don’t gain weight. I haven’t lost any weight since then, but I haven’t gained either. \n\nI know quasi-recovery doesn’t really work, but I’m still scared to go “All in”. I’m still scared of gaining weight—or rather, I only want to gain X amount so that I look “normal”. I started following a lot of “All in” insta accounts to motivate me, and I’m planning to do a grocery haul this week where I don’t look at any of the labels and just get what I want. I know I still need a little bit more of a push before I can fully commit, but I feel so close after today, I think I’m nearly ready. The problem is that my family keeps triggering me by bringing up my eating habits and weight, (I’ve talked to them about it and they do it less, but sometimes it slips out) but I’m moving out in 2 weeks so I think I’ll finally be in the right mindset to commit to full recovery.",
          "created_utc": 1596311387.0
        }
      ]
    }
  ]
}