{
  "id": "i1xzgm",
  "subreddit": "fuckeatingdisorders",
  "author": "transfrenchtoast",
  "created_utc": 1596309969.0,
  "title": "My 10 tips for dealing with weight gain, fear, and other recovery tips!",
  "selftext": "Hi friends! I recently discovered a way that helps me counteract these thoughts, and I thought you guys may find it useful.\n\n1.) *Recognize this is an ED thought*\n\nYour ED is terrified of weight gain, so it’s going to make you as terrified as it can so that you won’t gain weight or recover. What helps me is saying to myself (whether aloud or in my head) “I recognize this is an ED thought and I’m no longer going to engage.”\n\nIf the thought keeps returning, I just say to myself “This is my ED, and I’m not engaging.” Or simply, “No.”\n\n2.) *Do your research!*\n\nSeriously. This helps so many people who I know. Do your research on the process of recovery! I’ll link my personal favorite(s) down below! You aren’t a special snowflake or unicorn. The rules of recovery also apply to you. You also need food.\n\n\nhttps://letsrecover.tumblr.com/recoveryguide\n\nhttps://www.nationaleatingdisorders.org/stages-recovery\n\nhttps://www.google.com/amp/s/mirror-mirror.org/getting-help/working-through-the-weight-restoration-phase-of-anorexia-nervosa\n\n3.) *If you’re scared to do it, you HAVE to do it*\n\nIf you’re scared to eat xyz, guess what? You have to eat xyz. No neural rewiring will occur if you don’t challenge yourself. You will never teach your brain that it’s okay to eat whatever you want if you don’t work on challenging your ED.\n\n4.) *Rapid weight gain won’t last forever*\n\nSeriously. It won’t. Your body will probably gain super fuckin’ fast at first because it’s scared. Plus, food and water weighs something, babe. Trust me. You retain an ungodly amount of fucking water and food at first. It’ll go away. I’m on my 2nd week of “All In” and my bloating is slowly going away. It’s nowhere near as bad.\n\n5.) *No two bodies are the same*\n\nDon’t let your ED use this as an excuse to not eat enough. Nah, tell that fuckface to suck it.\n\nWhat I mean is, what may be enough weight for one person, may not be enough for someone else. You may need a higher weight. Does that makes you a bad person? Nope! Does being smaller make you a better person? Also nope!\n\n6.) *Don’t overcomplicate it*\n\nYou want chocolate? Eat the chocolate. “But it’s not that easy!” It really is. It does get easier. I just gotta make your brain learn your fear foods are just food and can’t hurt you!\n(Just don’t eat any food you are allergic to please.)\n\n7.) *Don’t pinch new weight*\n\nAlso, try not to bodycheck. It’ll only make you feel worse.\n\n8.) *You are not gaining weight “too fast”*\n\nImagine you fell down and cut your knee. Would you say “Holy fucknuts! It’s scabbing too quickly! Now I gotta pick it because it’s healing too fast! Slow down, body!!” No, you wouldn’t. Your body is just healing itself. Trust me, other people HAVE gained as “fast” as you are.\n\n9.) *Don’t dwell/brood after meals or snacks*\n\nIf you’re struggling, ask a trusted one for support. However, don’t just sit there and dwell on your guilt. Play a game, meditate, watch YouTube, or do anything you enjoy to distract yourself! Trust me, it’ll help big time!\n\n10.) *Find your identity OUTSIDE of recovery*\n\nDon’t make recovery your whole identity. Find who you are without your ED. Otherwise, once you recovery fully you’ll feel a bit lost. Find who you are and what you’re passionate about.\n\n...\nThank you for reading all this! Feel free to ask any questions! I know I’m no expert, but I hope this helped! :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i1xzgm/my_10_tips_for_dealing_with_weight_gain_fear_and/",
  "score": 87,
  "num_comments": 11,
  "comments": [
    {
      "id": "g00u9pu",
      "author": "VariousResearcher439",
      "body": "This was amazing thank you so much!!!!! NUMBER TEN. NUMBER TEN. NUMBER TEN!!!I lost myself in my ED, I envy people\nWho have built their lives (socially, career, learning, creative expression) while I was busy doing ED shit. I feel so behind, but remembering who I want to be AS A LIVING HUMAN ON EARTH helps me see past ED. No amount of my skinny was ever sustainable anyways. I literally lost any other real interests in my ED outside of fitness/food/health. While embarking on my super uncomfortable recovery journey, I found a purpose (a college degree in sustainable energy) and a hobby (surfing) that I am so passionate about that they sometimes give my ED a swift kick in the dick.\nThat being said, I’m still riding the struggle bus in terms of eating confusion, and emotional/night eating. But I’m a hell of a lot healthier than I used to be before I at least tried recovery. Also damn that pinching, that will set me off. As will more than one second in the mirror. \n\nDiscomfort is the touchstone of growth!",
      "created_utc": 1596316118.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g01az3b",
      "author": "jirakip",
      "body": "Thanks for this :) I’ve been struggling a bit recently trying to quiet my compulsive ED thoughts, especially regarding body insecurity and health anxiety. The actions of recovering (eating) aren’t a problem for me, but it feels like a waste when I’m not making any mental progress and I’m stuck in quasi-recovery. I’m saving this post :D",
      "created_utc": 1596325819.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g02bfcg",
      "author": "RigorousSleeper",
      "body": "Two weeks is all it took for your bloat to go away??? Whoa! Lucky you.",
      "created_utc": 1596350756.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g028dli",
      "author": "ontopofyourmom",
      "body": "Wow, what a window into ED recovery...  I thought quitting smoking was tough, but 1, 6, and 9 are literally all that's required.",
      "created_utc": 1596347978.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g09bur0",
      "author": "Sareeee48",
      "body": "I know it’s two days late but thank you for this! I’m dealing with weight gain primarily in my midsection and it’s super hard to deal with so this was a nice reminder that my body is doing what it’s supposed to do.",
      "created_utc": 1596489823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g02shlk",
      "author": "AnnaAdderall",
      "body": "Thank you so much!",
      "created_utc": 1596363120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0q2wnw",
      "author": "rhymeswithpanda1987",
      "body": "Thank you for this.   \n\\#7 has been the hardest for me, I think. I have been showering in the dark the last couple weeks to avoid looking at my naked body. :/",
      "created_utc": 1596835315.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g01zmgm",
      "author": "VariousResearcher439",
      "body": "How do I save a post? I wanna save this one too:)",
      "created_utc": 1596341163.0,
      "score": 4,
      "context": [
        {
          "id": "g01az3b",
          "author": "jirakip",
          "body": "Thanks for this :) I’ve been struggling a bit recently trying to quiet my compulsive ED thoughts, especially regarding body insecurity and health anxiety. The actions of recovering (eating) aren’t a problem for me, but it feels like a waste when I’m not making any mental progress and I’m stuck in quasi-recovery. I’m saving this post :D",
          "created_utc": 1596325819.0
        }
      ]
    },
    {
      "id": "g042utl",
      "author": "transfrenchtoast",
      "body": "I’m under a lot of medical care. Trust me, it gets better :)",
      "created_utc": 1596384175.0,
      "score": 1,
      "context": [
        {
          "id": "g02bfcg",
          "author": "RigorousSleeper",
          "body": "Two weeks is all it took for your bloat to go away??? Whoa! Lucky you.",
          "created_utc": 1596350756.0
        }
      ]
    },
    {
      "id": "g09kk7n",
      "author": "transfrenchtoast",
      "body": "No problem! All my weight gain is going to my midsection and upper thighs. I’m very curvy in all the weirdest places right now.",
      "created_utc": 1596494166.0,
      "score": 2,
      "context": [
        {
          "id": "g09bur0",
          "author": "Sareeee48",
          "body": "I know it’s two days late but thank you for this! I’m dealing with weight gain primarily in my midsection and it’s super hard to deal with so this was a nice reminder that my body is doing what it’s supposed to do.",
          "created_utc": 1596489823.0
        }
      ]
    },
    {
      "id": "g034nwt",
      "author": "jirakip",
      "body": "I’m on mobile, so I can’t tell you where it is on desktop, but at the top of the screen there’s a little “bookmark” looking thing, and when you click it, you can refer back to the post from your account :) hope this helps",
      "created_utc": 1596370302.0,
      "score": 2,
      "context": [
        {
          "id": "g01az3b",
          "author": "jirakip",
          "body": "Thanks for this :) I’ve been struggling a bit recently trying to quiet my compulsive ED thoughts, especially regarding body insecurity and health anxiety. The actions of recovering (eating) aren’t a problem for me, but it feels like a waste when I’m not making any mental progress and I’m stuck in quasi-recovery. I’m saving this post :D",
          "created_utc": 1596325819.0
        },
        {
          "id": "g01zmgm",
          "author": "VariousResearcher439",
          "body": "How do I save a post? I wanna save this one too:)",
          "created_utc": 1596341163.0
        }
      ]
    }
  ]
}