{
  "id": "i3lukn",
  "subreddit": "fuckeatingdisorders",
  "author": "absolute_boy",
  "created_utc": 1596556501.0,
  "title": "\"Anorexia was right\"",
  "selftext": "I started trying to recover some months ago and I have now reached a low healthy weight (around 18.5, 19 BMI) and I am facing a mental hurdle as I desperately don't want to get any fatter than this, but at the same time I am craving food almost constantly. I eat a lot more than I did, but also exercise much more to make up for it - I do a long run every morning and walk for several hours in the afternoon. It's such hard work just maintaining. Normal portions do nothing for me. Even large meals barely fill a hole, and having been extremely underweight for a long time I find myself with an extreme aversion to feeling hungry. I drink so, so, so much water to try to kill the constant craving. Sometimes I think \"See! Anorexia was right - no normal amount of food will ever satisfy you, greedy pig.\"\n\nI've been starving myself and purging for years to stay thin. I have no idea what my set point could possibly be. Some people have to spend their whole lives hungry to avoid getting fat. It makes me miserable to think I might be one of them.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i3lukn/anorexia_was_right/",
  "score": 90,
  "num_comments": 27,
  "comments": [
    {
      "id": "g0c7889",
      "author": "None",
      "body": "Girl it's extreme hunger it's not you. Once you feed yourself correctly and in a way that satisfies ur current hunger, it will dwindle eventually. You will gain weight but your body needs it. Your appetite will die down and you'll be able to get on with your life.",
      "created_utc": 1596556700.0,
      "score": 79,
      "context": []
    },
    {
      "id": "g0c9p7f",
      "author": "mojingya",
      "body": "I have been in the exact same place as you, doing the exact same things to maintain. Truthfully...I couldn't deal with how much I was tiring myself, exercising so much to maintain the low weight. I stopped the bullshit. I ate. Followed extreme hunger. Stopped the purging and exercising. I rested. Gained weight. Two years in full recovery and it is all worth it.",
      "created_utc": 1596557724.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g0clxhn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1596562335.0,
      "score": 30,
      "context": []
    },
    {
      "id": "g0c98l2",
      "author": "koshele",
      "body": "that's so relatable i can't even. however, i've been astonished to feel that i don't want to eat this week. and in a good way, not the sort where you're enjoying hunger. i'm just sitting here not being bothered by food. not hungry, not full like bursting after a binge, but kind of full in the sense that i just don't feel like i'm missing food right now, and i probably have some more interesting things to do. and i do eat a good amount. i know it's just a short calm period, but it gives hope. i'm at my highest weight ever now, but it's worth it. i couldn't get my head around wanting to eat with a bmi of 18.5 and over, it's really tough, it feels invalid, like you're not dealing with an ED anymore, you're just a glutton, but you're definitely still dealing with the ED. so don't give up, and don't forget what really matters, you're doing ok.",
      "created_utc": 1596557535.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g0clf8j",
      "author": "miathemango",
      "body": "exercising will make u hungrier. u burn calories = u need calories back. it’s just how it works. u have got to listen to your body or else you’ll never recover.",
      "created_utc": 1596562169.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g0dy3bv",
      "author": "None",
      "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
      "created_utc": 1596582270.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g0cz50g",
      "author": "seagracemoore",
      "body": "Having a life is worth it. Walk through the fear. You will thank yourself. I have three healthy kids and a marriage that mostly works and needs work but is real and worth it. I've been through a lot of really hard times, but I've also been through amazing times. I had none of that when all I did was focus on the number on the scale and measured every morsel that went into my mouth.\n\nYes, my body shape still bothers me (dysmorphia) and I recently gained even more weight (probably hormones and age) and I had several huge meltdowns. But I don't want to go back to who I was and what I sacrificed to be a certain weight. I would rather take my 9 yo son out to have frozen yogurt because he misses his friends and is feeling lonely and needs to get out of the house during quarantine. Or spend time with my teenage daughters. To achieve the look I want would mean not spending time with them and that would be a huge loss.",
      "created_utc": 1596567384.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g0e2s1o",
      "author": "basicallyaballerina",
      "body": "Remember that if you stop now, you’ll be in quasi recovery. It gets worse before it gets better",
      "created_utc": 1596584780.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0e97mu",
      "author": "kristmastree",
      "body": "Been there. My extreme hunger didn’t disappear until I hit BMI 20 (started at 16). I was so scared, but once I relaxed into it, I wasn’t hungry anymore. I still have occasional outbursts, but nothing close to what it was in the past. Your body just needs time. I know it’s easy to say “trust the process”, but it works.",
      "created_utc": 1596588494.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0che2n",
      "author": "CherrySlushee",
      "body": "you should check out stephanie buttermore on youtube. she has lots of videos dealing with extreme hunger.",
      "created_utc": 1596560649.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0ehrz9",
      "author": "Various-List",
      "body": "Totally normal. Your body is trying to protect you now that it knows you have access to food. When it starts to feels secure, the hunger will taper to normal and if the extreme hunger has tipped you above your set point (temporarily), then you may even lose a few pounds as you settle to normalcy. \n\nThere is a lady named Stephanie Buttermore on YouTube that did a refeeding after maintaining a super low body fat percentage for a long time. She documented feeding her extreme hunger over the past year and as it tapered off and her experience. I personally found it very comforting and encouraging to see the process documented and played out.",
      "created_utc": 1596593630.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0g0u8i",
      "author": "None",
      "body": "Try mindfulness and mindful eating, it could help to reset your body’s reaction to feeling full.",
      "created_utc": 1596635693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0p8fno",
      "author": "rajfromsrilanka",
      "body": "Late, but op may not be a girl",
      "created_utc": 1596820923.0,
      "score": 5,
      "context": [
        {
          "id": "g0c7889",
          "author": "None",
          "body": "Girl it's extreme hunger it's not you. Once you feed yourself correctly and in a way that satisfies ur current hunger, it will dwindle eventually. You will gain weight but your body needs it. Your appetite will die down and you'll be able to get on with your life.",
          "created_utc": 1596556700.0
        }
      ]
    },
    {
      "id": "g0e1yan",
      "author": "LGn2wFrosty",
      "body": "I want this so badly! I want to have a life again. I just can’t wrap my head around the weight gain, any tips on how to deal with it?",
      "created_utc": 1596584322.0,
      "score": 5,
      "context": [
        {
          "id": "g0c9p7f",
          "author": "mojingya",
          "body": "I have been in the exact same place as you, doing the exact same things to maintain. Truthfully...I couldn't deal with how much I was tiring myself, exercising so much to maintain the low weight. I stopped the bullshit. I ate. Followed extreme hunger. Stopped the purging and exercising. I rested. Gained weight. Two years in full recovery and it is all worth it.",
          "created_utc": 1596557724.0
        }
      ]
    },
    {
      "id": "g0fjpg0",
      "author": "None",
      "body": "Were others judgemental of the weight gain? Ppl don't know I have an ed, I've convinced everyone I know that I'm naturally underweight and that there's nothing I can do about it. When I gain weight, EVERYONE comments on it. It doesn't affect me that much but I feel the need to justify myself and I can't just say \"Stfu I'm recovering from anorexia\"",
      "created_utc": 1596625598.0,
      "score": 3,
      "context": [
        {
          "id": "g0c9p7f",
          "author": "mojingya",
          "body": "I have been in the exact same place as you, doing the exact same things to maintain. Truthfully...I couldn't deal with how much I was tiring myself, exercising so much to maintain the low weight. I stopped the bullshit. I ate. Followed extreme hunger. Stopped the purging and exercising. I rested. Gained weight. Two years in full recovery and it is all worth it.",
          "created_utc": 1596557724.0
        }
      ]
    },
    {
      "id": "g0f70yu",
      "author": "VariousResearcher439",
      "body": "I love this scientific reasoning. Gonna save this this. Thank you. Can’t outsmart the body!",
      "created_utc": 1596612554.0,
      "score": 1,
      "context": [
        {
          "id": "g0clxhn",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1596562335.0
        }
      ]
    },
    {
      "id": "g0dbui1",
      "author": "Bezoomny-dama",
      "body": "Yep. I called this stage of my recovery “quasi”, where yes, while I was technically eating more, I was still exercising and tracking my meals and opting for “healthy” choices. Only when I fully surrendered to the extreme hunger, and took a long break from exercise (I took a year personally) was I able to slowly quiet my ED voice. Years later I am choosing to exercise with infrequent jogs, walking and yoga. It’s so different exercising now. I do it out of love for my body, wanting the feel good endorphins, rather than to punish my body.",
      "created_utc": 1596572037.0,
      "score": 8,
      "context": [
        {
          "id": "g0clf8j",
          "author": "miathemango",
          "body": "exercising will make u hungrier. u burn calories = u need calories back. it’s just how it works. u have got to listen to your body or else you’ll never recover.",
          "created_utc": 1596562169.0
        }
      ]
    },
    {
      "id": "g0eno2j",
      "author": "Bear2Pants",
      "body": "I completely relate, my hunger is back and with a vengeance. I can't stop eating and when I'm not it's all I think about. It's absolutely miserable.",
      "created_utc": 1596597214.0,
      "score": 2,
      "context": [
        {
          "id": "g0dy3bv",
          "author": "None",
          "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
          "created_utc": 1596582270.0
        }
      ]
    },
    {
      "id": "g0erssl",
      "author": "Limp-Specific-8630",
      "body": "I relate to this so much it makes me want to scream",
      "created_utc": 1596599885.0,
      "score": 2,
      "context": [
        {
          "id": "g0dy3bv",
          "author": "None",
          "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
          "created_utc": 1596582270.0
        }
      ]
    },
    {
      "id": "g0fdzt6",
      "author": "Itotsight",
      "body": "I understand. Now i'm at the overweight category i once feared",
      "created_utc": 1596619803.0,
      "score": 1,
      "context": [
        {
          "id": "g0dy3bv",
          "author": "None",
          "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
          "created_utc": 1596582270.0
        }
      ]
    },
    {
      "id": "g0dtddb",
      "author": "chlamydiakoalaa",
      "body": "Came here to second this! It seems you’ve been in a deficit for so long that your hunger signals are off. Definitely check out her more recent “all in” videos",
      "created_utc": 1596579878.0,
      "score": 3,
      "context": [
        {
          "id": "g0che2n",
          "author": "CherrySlushee",
          "body": "you should check out stephanie buttermore on youtube. she has lots of videos dealing with extreme hunger.",
          "created_utc": 1596560649.0
        }
      ]
    },
    {
      "id": "g0parxv",
      "author": "None",
      "body": "Sorry, didn't see the username. I call everyone girl so I didn't think it through",
      "created_utc": 1596822018.0,
      "score": 5,
      "context": [
        {
          "id": "g0c7889",
          "author": "None",
          "body": "Girl it's extreme hunger it's not you. Once you feed yourself correctly and in a way that satisfies ur current hunger, it will dwindle eventually. You will gain weight but your body needs it. Your appetite will die down and you'll be able to get on with your life.",
          "created_utc": 1596556700.0
        },
        {
          "id": "g0p8fno",
          "author": "rajfromsrilanka",
          "body": "Late, but op may not be a girl",
          "created_utc": 1596820923.0
        }
      ]
    },
    {
      "id": "g0foa77",
      "author": "mojingya",
      "body": "In beginning of recovery, I went a little radical and told myself. Weight gain or die. You either gain the weight, whatever it is, OR you will be signing up for death.\n\nI equated anorexia, poor mental health, deteriorating quality of life to death itself. Isnt that how anorexia feels? So that's how I kept pushing through. The weight gain itself is nothing compared to all, and I mean, the entirety of all the anorexia symptoms that are making you slowly kill yourself. \n\nI remember in recovery when I started feeling better, mentally, physically...I started crying, tearing up because I couldn't believe how good it felt. Like I was experiencing the world for the first time again, in wonder. Like a child. Hold on to that. \n\nÁlso, it's important to remember that the weight gain isn't just weight gain. You will fix organ damage, nerve damage, fix your brain, skin, hormones, hair, nails, bones. There's so many benefits. \n\nBeing body neutral instead of body :positive: helped. This body + brain is helping me go through the day, walk, do my school work, love my family, friends, experience memories, go through life.",
      "created_utc": 1596628801.0,
      "score": 4,
      "context": [
        {
          "id": "g0c9p7f",
          "author": "mojingya",
          "body": "I have been in the exact same place as you, doing the exact same things to maintain. Truthfully...I couldn't deal with how much I was tiring myself, exercising so much to maintain the low weight. I stopped the bullshit. I ate. Followed extreme hunger. Stopped the purging and exercising. I rested. Gained weight. Two years in full recovery and it is all worth it.",
          "created_utc": 1596557724.0
        },
        {
          "id": "g0e1yan",
          "author": "LGn2wFrosty",
          "body": "I want this so badly! I want to have a life again. I just can’t wrap my head around the weight gain, any tips on how to deal with it?",
          "created_utc": 1596584322.0
        }
      ]
    },
    {
      "id": "g0fnhg0",
      "author": "mojingya",
      "body": "Hm, honestly they weren't. The majority of people didn;t say a word, didn't care. Actually when I gained weight, I had so many people comment on how healthy, bright, glowy I look, and that I look happy. I had a few sentences like a speech prepared when I met people I hadn't met in a long time, something along the lines of \"Actually, I am recovering from an eating disorder, and I need/needed to gain weight, but I am/feel much healthier now\"even before they brought my weight up. This way, I was more in control of the situation. What helped was acting a little confident in my statement that I was healthier now that I've gained weight. I also convinced people that I was underweight naturally. What I personally did was post on my social media at the time to my group of friends that \"I'm sorry if I;ve misled anyone. I'm taking some time to take care of my health\". Something along these lines. You don't have to tell other people you have an ED but finding a way around to sort of take control of the narrative and the situation def helped stopped people from making judgements. I told my close friends, so they were all super aware and supportive. I had lengthy speeches to my parents about my recovery and they were supportive in the end. All this work was worth it in my opinion. I didn't view is as \"justifying\"myself, but clarifying to others what was happening so I could take control and not be anxious abt other's judgements. If people offered any unsolicited advice, I would steer the conversation away.",
      "created_utc": 1596628277.0,
      "score": 3,
      "context": [
        {
          "id": "g0c9p7f",
          "author": "mojingya",
          "body": "I have been in the exact same place as you, doing the exact same things to maintain. Truthfully...I couldn't deal with how much I was tiring myself, exercising so much to maintain the low weight. I stopped the bullshit. I ate. Followed extreme hunger. Stopped the purging and exercising. I rested. Gained weight. Two years in full recovery and it is all worth it.",
          "created_utc": 1596557724.0
        },
        {
          "id": "g0fjpg0",
          "author": "None",
          "body": "Were others judgemental of the weight gain? Ppl don't know I have an ed, I've convinced everyone I know that I'm naturally underweight and that there's nothing I can do about it. When I gain weight, EVERYONE comments on it. It doesn't affect me that much but I feel the need to justify myself and I can't just say \"Stfu I'm recovering from anorexia\"",
          "created_utc": 1596625598.0
        }
      ]
    },
    {
      "id": "g0fjdp5",
      "author": "None",
      "body": "Oh no :( Has your appetite decreased or is it still the same as it was in the beginning? Do you feel any better physically apart from the (I assume) mental struggle?",
      "created_utc": 1596625285.0,
      "score": 2,
      "context": [
        {
          "id": "g0dy3bv",
          "author": "None",
          "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
          "created_utc": 1596582270.0
        },
        {
          "id": "g0fdzt6",
          "author": "Itotsight",
          "body": "I understand. Now i'm at the overweight category i once feared",
          "created_utc": 1596619803.0
        }
      ]
    },
    {
      "id": "g2p5gvd",
      "author": "8track_treason",
      "body": "I call everyone girl as well. I understand.",
      "created_utc": 1598282030.0,
      "score": 1,
      "context": [
        {
          "id": "g0c7889",
          "author": "None",
          "body": "Girl it's extreme hunger it's not you. Once you feed yourself correctly and in a way that satisfies ur current hunger, it will dwindle eventually. You will gain weight but your body needs it. Your appetite will die down and you'll be able to get on with your life.",
          "created_utc": 1596556700.0
        },
        {
          "id": "g0p8fno",
          "author": "rajfromsrilanka",
          "body": "Late, but op may not be a girl",
          "created_utc": 1596820923.0
        },
        {
          "id": "g0parxv",
          "author": "None",
          "body": "Sorry, didn't see the username. I call everyone girl so I didn't think it through",
          "created_utc": 1596822018.0
        }
      ]
    },
    {
      "id": "g0fs6wb",
      "author": "Itotsight",
      "body": "It has decreased for sure. It isn't anything like when it was at the beginning. I could eat everything and anything 24/7. I was underweight back then and lost half of my weight, so i guess that was why i had that hunger when i let myself eat\n\nI exercise now more than ever i have in my life so yeah, i feel better and i can speak and held a conversation. I know i have these positive elements in this recivery progress, but there is still these negatives that won't let my ED go completely. :/\n\nBut i have a wide bonestructure and i'm 174,5 cm tall,and when yalking about bonestructure i mean my shoulders, hips, hands etc. I looked weird when i was thinner. I think i have in the genes to be a little bigger when healthy. I just dont accept my body as it is right now and ofc im scared i will gain more. I just try to face life day by day and live.\n\nGood day to you and i hope you can get better ♡",
      "created_utc": 1596631249.0,
      "score": 1,
      "context": [
        {
          "id": "g0dy3bv",
          "author": "None",
          "body": "I'm going through the exact same thing, having the exact same thoughts. I am barely underweight but the moment I started eating \"normally\", I couldn't and still can't stop thinking about food.\n\nI did it to get back my period..and I did after 1 month. But although I felt happy in the beginning, I immediately started thinking \"okay now that you got your period it means you're officially a fat pig. Enough of this, time to lose the weight again\". But it's been a month since I started eating more (got my period this past week) and I still can't properly restrict. I have walk 10.000 steps every day regardless of how tired I am or how sleep deprived and it's taking a toll on my mental health. \n\nI'm eating huge amounts of healthy food to stop the hunger- to the point where I feel physically sick (it takes around 1kg of food to make me feel sick, but I'm terrified of purging although I used to be bulimic in the past, so I don't do that anymore). And even though I physically can't eat more, I'm still craving food.\n\nEvery day is a living hell. I wake up tired and hungry, I try to not eat but I can't stop myself. If I eat an apple, the next thing I know I've eaten 3 apples and I'm on my way to the fridge to get more. I miss not eating, and I miss feeling good when I was hungry. Now I feel so bad if I don't eat.. Weekends are the worst cause I don't have work to keep me busy, so I always inhale 2000+ calories, then for the whole week I desperately try to make up for it, but I still don't lose any weight.\n\nIt's so much worse than when I was deep in the anorexia mindset.\nI'm not motivated and I can't concentrate. I thought eating more would give me energy and improve my mental state, but I just eat, sleep, think about what I'll eat next, repeat. Sleep quality is awful too. I keep sleeping after I eat so at night I'm wide awake. I keep making mistakes at work and I keep forgetting things.. I was doing great when I was restricting. I was waking up motivated and the only thing I could think of was work, studying and being \"perfect\"..now I'm fat and a failure. I'm crying every day, wishing I hadn't let myself go. The jeans I ordered 3 weeks ago don't fit me anymore. Everything is tight but I refuse to buy new clothes, I want to punish myself, to feel uncomfortable, to bully myself into losing the weight again.\n\nI also believe I'm one of the people who have to spend their whole lives hungry to stay thin. But when I was thin I wasn't feeling as hungry as I am now.. It's frustrating.\n\nSorry for sharing my story on your post. I don't know how to help. I just guess it's some normal reaction to chronic restriction. I'm not ready nor will I ever be ready to go all in as others suggested. Seeing people's end results scares me even more. Seeing their before and after pictures is my worst nightmare.. What if my set point is at an overweight bmi like my mom? She's been big her whole life and my body resembles hers. I know if I wasn't purging half my life and starving for my other half, I'd be big. I can't take such a risk. What about the extra skin and the fat cells that'll grow?",
          "created_utc": 1596582270.0
        },
        {
          "id": "g0fdzt6",
          "author": "Itotsight",
          "body": "I understand. Now i'm at the overweight category i once feared",
          "created_utc": 1596619803.0
        },
        {
          "id": "g0fjdp5",
          "author": "None",
          "body": "Oh no :( Has your appetite decreased or is it still the same as it was in the beginning? Do you feel any better physically apart from the (I assume) mental struggle?",
          "created_utc": 1596625285.0
        }
      ]
    }
  ]
}