{
  "id": "i6h13f",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1596967884.0,
  "title": "In most cases, the only reason why we have a meal plan is because we are scared of eating too much.",
  "selftext": "And you can trick anyone else into thinking that it's really just because without a meal plan you \"wouldn't know\" how much to eat and \"you wouldn't remember\" to eat enough. But deep down you know that's not true. What you really, truly, genuinely mean to say is that without a meal plan you wouldn't know how to eat enough **and still not eat too much**.\n\nIt's really really easy to eat enough. And it's also really really easy to eat more if you're in doubt you haven't eaten enough and you're ready to eat more. You don't need any meal plan for that. If you don't do that it's because your ED makes you choose not to. It's not because you don't know how.\n\nIf you're unsure whether you've eaten enough or not, you could just eat more. The only thing stopping you from doing just that is your ED.\n\nThe only exception might be patients with extremely severe anorexia who are so underweight that their whole brain is literally unable to think clearly. But if you're out of any immediate danger, you **know** how much is enough, but a meal plan makes you feel safe that you won't go \"over\", or you won't gain weight \"too fast\".",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i6h13f/in_most_cases_the_only_reason_why_we_have_a_meal/",
  "score": 101,
  "num_comments": 43,
  "comments": [
    {
      "id": "g0vrbrj",
      "author": "gardenfaiiri",
      "body": "Thank you, this is so reassuring, I’ve been really struggling with these feelings recently and telling myself I’ve eaten “enough” when in reality I’ve only eaten the bare minimum and would, in reality, have liked to eat a lot more.",
      "created_utc": 1596971499.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g0w7czx",
      "author": "angiotensin-2",
      "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
      "created_utc": 1596983276.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g0wckym",
      "author": "None",
      "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
      "created_utc": 1596986351.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g0w63j3",
      "author": "xleabrax",
      "body": "I’m only on a meal plan due to my heart’s condition and hope to move on from it but I do find having set times and snacks to be very odd as before my ED if I was hungry I would just eat - however pre ED I was overweight and having a dietician work with me does make me feel safe because all I have ever known is to over-indulge and basically starve, there has never been a BALANCE between me and food, I hope to find a healthy balance but then like you suggested, this could be me kidding myself :/ \n\nSide note: my meal plan is very flexible only the quantity/portion counts, my parents are controlling what I eat at the moment though",
      "created_utc": 1596982493.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g0wn2hi",
      "author": "notbritney",
      "body": "I follow a meal plan to maintain my weight, because that’s all I’m comfortable doing right now. I am afraid of losing weight, and terrified of gaining weight. I know I’m still engaging in disordered behaviour, but as far as my doctor is concerned right now that’s better than me losing more weight, or going back to binging and purging like I do every single time I don’t have structure when it comes to eating. \n\nI’m not saying this is necessarily good by any means, but it’s the lesser of many evils I guess, for me at least?",
      "created_utc": 1596992076.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0y66tc",
      "author": "SeattleRN",
      "body": "I agree to an extent, but through anorexia nervosa I legitimately forgot a lot of things that normal people do around food. Times, portion sizes, assess satiety, etc.",
      "created_utc": 1597021730.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0wq0ki",
      "author": "niacinameowde",
      "body": "You just roasted me to death and I am honestly 100% here for it. I hate how my fear of weight gain is holding me back. It's not just superficial it's also really irrational (for the way my body is, anyways). I know in my right mind that any weight gain I get will not be anywhere near as awful as I think it will be and that, even if it did, that there's more to life than being scared of a muffin top.",
      "created_utc": 1596993628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0x5ped",
      "author": "TheDrunkenGiraffe",
      "body": "That definitely tracks. I’m on a meal plan in bulimia recovery because ‘eating regularly helps prevent binges’ but also because I don’t want to eat too much and get even bigger.",
      "created_utc": 1597001694.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0z77gr",
      "author": "ninnzx7",
      "body": "I feel like I managed to mess myself up to the point that I don’t actually know what normal is anymore. I’ve been eating very little all the time thinking this is how everyone kind of manages it since that is what the calculators told me I should eat minimum. That’s just what I did no matter what I did throughout the day. I thought everyone around me does it like that. At some point I just realized I’m getting a lot of comments and questions about how little or often I eat and just got weaker and weaker when I realized what I’ve actually been doing when I got to weigh myself again. Now looking back I get really scared of myself that I thought that this is normal/ I can see why other people think that and don’t trust myself to know what’s right and wonder if I feel like I overate if there’s the possibility I am still undereating then I eat a bit more just to make sure but it’s freaking me out what if then I’m STILL undereating i can’t just keep going and going of course I will freak out but what if in a few months I look back again and will be like wtf were you doing? I honestly just don’t know anymore. But yes I guess I have this phobia too, I will eat a bit more just for making sure but it is what it is and you exaggerate it in your mind and just freak and freak. I do not know what normal is. I could use a meal plan please please please but unfortunately right now I’m not in the position to get one or get help or anything I’m just alone and trying to figure this out and get better but at the same time I’m afraid of myself because I haven’t realized what harm I’ve been doing to myself the whole time.",
      "created_utc": 1597050346.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0wq96n",
      "author": "ontopofyourmom",
      "body": "I don't have an ED (on this sub because I thought I might have), but it is hard as fuck for me to get myself to eat sometimes - just out of depression and not caring. \n\nAnd there is nothing in me that wants to control my intake. I'm eating potato chips in bed for breakfast just because I put them there when I went to bed so I'd have something at hand to eat. \n\nWhen your mind finally figures out how to deal with a thought or behavior, it's because you've been able to put the pieces together yourself. Successfully getting through that process often feels like you \"just did it,\" and I think that can be healthy in a lot of situations.\n\nBut I'm reminded about how it took ten attempts at quitting smoking over the course of a decade before I was \"just\" able to stop. I truly believe that most other smokers could do the same, despite experience and evidence to the contrary",
      "created_utc": 1596993755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0weyfp",
      "author": "internerderner2",
      "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
      "created_utc": 1596987690.0,
      "score": 2,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        }
      ]
    },
    {
      "id": "g0wf3wp",
      "author": "xleabrax",
      "body": "Yes! I feel the same way as you, seeking help from a dietician was the best decision for me (mentally and medically) as previous to my ED I was overweight due to overeating and now starving myself, I don’t know how to have a balanced relationship with food which is all I have ever wanted ever since I lost weight and then didn’t know how to maintain it thus spiralled into an ED \n\nHope your appointment goes well! :)",
      "created_utc": 1596987770.0,
      "score": 6,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        }
      ]
    },
    {
      "id": "g0wf5o4",
      "author": "internerderner2",
      "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
      "created_utc": 1596987795.0,
      "score": 0,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        }
      ]
    },
    {
      "id": "g0wnfsz",
      "author": "internerderner2",
      "body": "Absolutely. If a meal plan helps you spiraling down even more then it's better than nothing. I think it's great that you know the true reason why you're following a meal plan and I'm sure this will help you go further in your recovery. :)\n\n(EDIT major mistake)",
      "created_utc": 1596992264.0,
      "score": 2,
      "context": [
        {
          "id": "g0wn2hi",
          "author": "notbritney",
          "body": "I follow a meal plan to maintain my weight, because that’s all I’m comfortable doing right now. I am afraid of losing weight, and terrified of gaining weight. I know I’m still engaging in disordered behaviour, but as far as my doctor is concerned right now that’s better than me losing more weight, or going back to binging and purging like I do every single time I don’t have structure when it comes to eating. \n\nI’m not saying this is necessarily good by any means, but it’s the lesser of many evils I guess, for me at least?",
          "created_utc": 1596992076.0
        }
      ]
    },
    {
      "id": "g0wfisq",
      "author": "angiotensin-2",
      "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
      "created_utc": 1596987980.0,
      "score": 15,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        }
      ]
    },
    {
      "id": "g0xpkxa",
      "author": "None",
      "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
      "created_utc": 1597012195.0,
      "score": 6,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        }
      ]
    },
    {
      "id": "g0wpocs",
      "author": "notbritney",
      "body": "Thank you for being so understanding!",
      "created_utc": 1596993449.0,
      "score": 2,
      "context": [
        {
          "id": "g0wn2hi",
          "author": "notbritney",
          "body": "I follow a meal plan to maintain my weight, because that’s all I’m comfortable doing right now. I am afraid of losing weight, and terrified of gaining weight. I know I’m still engaging in disordered behaviour, but as far as my doctor is concerned right now that’s better than me losing more weight, or going back to binging and purging like I do every single time I don’t have structure when it comes to eating. \n\nI’m not saying this is necessarily good by any means, but it’s the lesser of many evils I guess, for me at least?",
          "created_utc": 1596992076.0
        },
        {
          "id": "g0wnfsz",
          "author": "internerderner2",
          "body": "Absolutely. If a meal plan helps you spiraling down even more then it's better than nothing. I think it's great that you know the true reason why you're following a meal plan and I'm sure this will help you go further in your recovery. :)\n\n(EDIT major mistake)",
          "created_utc": 1596992264.0
        }
      ]
    },
    {
      "id": "g0wh21c",
      "author": "None",
      "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
      "created_utc": 1596988825.0,
      "score": 7,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        }
      ]
    },
    {
      "id": "g0wfnuo",
      "author": "internerderner2",
      "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
      "created_utc": 1596988054.0,
      "score": -4,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        }
      ]
    },
    {
      "id": "g0xx24s",
      "author": "internerderner2",
      "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
      "created_utc": 1597016384.0,
      "score": 0,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        }
      ]
    },
    {
      "id": "g0xaujd",
      "author": "internerderner2",
      "body": "Lol I just realized that mistakenly wrote \"helps you spiraling down\" instead of \"keeps you from spiraling down\" and that completely changed my message. Now it sounds like I was being absolutely nasty. Oh my God I'm so sorry, I hope you still managed to get what I was trying to put across :D",
      "created_utc": 1597004390.0,
      "score": 1,
      "context": [
        {
          "id": "g0wn2hi",
          "author": "notbritney",
          "body": "I follow a meal plan to maintain my weight, because that’s all I’m comfortable doing right now. I am afraid of losing weight, and terrified of gaining weight. I know I’m still engaging in disordered behaviour, but as far as my doctor is concerned right now that’s better than me losing more weight, or going back to binging and purging like I do every single time I don’t have structure when it comes to eating. \n\nI’m not saying this is necessarily good by any means, but it’s the lesser of many evils I guess, for me at least?",
          "created_utc": 1596992076.0
        },
        {
          "id": "g0wnfsz",
          "author": "internerderner2",
          "body": "Absolutely. If a meal plan helps you spiraling down even more then it's better than nothing. I think it's great that you know the true reason why you're following a meal plan and I'm sure this will help you go further in your recovery. :)\n\n(EDIT major mistake)",
          "created_utc": 1596992264.0
        },
        {
          "id": "g0wpocs",
          "author": "notbritney",
          "body": "Thank you for being so understanding!",
          "created_utc": 1596993449.0
        }
      ]
    },
    {
      "id": "g0wi7az",
      "author": "angiotensin-2",
      "body": "I agree. I thought OP was trying to get at fatphobia because of their phrasing but maybe I was wrong in that assumption. I explained below in a comment what I was taught in extreme hunger vs bingeing. If I’m wrong then so be it but that’s how I recovered the first time. Overall this conversation is becoming extremely triggering to me so I’m tapping out. Thanks for agreeing with me I really appreciate it.",
      "created_utc": 1596989463.0,
      "score": 4,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wh21c",
          "author": "None",
          "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
          "created_utc": 1596988825.0
        }
      ]
    },
    {
      "id": "g0whgov",
      "author": "internerderner2",
      "body": ">you need a balance of fat, protein, and carbs to nourish your body.\n\nPeople with EDs are possibly the most knowledgeable people about nutrition that I've ever known. I've rarely met someone who genuinely wasn't able to put together a balanced meal in terms of nutrients.",
      "created_utc": 1596989051.0,
      "score": -5,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wh21c",
          "author": "None",
          "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
          "created_utc": 1596988825.0
        }
      ]
    },
    {
      "id": "g0wgq4m",
      "author": "angiotensin-2",
      "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
      "created_utc": 1596988639.0,
      "score": 8,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        }
      ]
    },
    {
      "id": "g10524z",
      "author": "None",
      "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
      "created_utc": 1597074685.0,
      "score": 3,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        }
      ]
    },
    {
      "id": "g0xo19d",
      "author": "notbritney",
      "body": "Don’t worry about it! I hadn’t actually noticed! Hahaha. I read it as you intended rather than what you actually wrote lol.",
      "created_utc": 1597011346.0,
      "score": 2,
      "context": [
        {
          "id": "g0wn2hi",
          "author": "notbritney",
          "body": "I follow a meal plan to maintain my weight, because that’s all I’m comfortable doing right now. I am afraid of losing weight, and terrified of gaining weight. I know I’m still engaging in disordered behaviour, but as far as my doctor is concerned right now that’s better than me losing more weight, or going back to binging and purging like I do every single time I don’t have structure when it comes to eating. \n\nI’m not saying this is necessarily good by any means, but it’s the lesser of many evils I guess, for me at least?",
          "created_utc": 1596992076.0
        },
        {
          "id": "g0wnfsz",
          "author": "internerderner2",
          "body": "Absolutely. If a meal plan helps you spiraling down even more then it's better than nothing. I think it's great that you know the true reason why you're following a meal plan and I'm sure this will help you go further in your recovery. :)\n\n(EDIT major mistake)",
          "created_utc": 1596992264.0
        },
        {
          "id": "g0wpocs",
          "author": "notbritney",
          "body": "Thank you for being so understanding!",
          "created_utc": 1596993449.0
        },
        {
          "id": "g0xaujd",
          "author": "internerderner2",
          "body": "Lol I just realized that mistakenly wrote \"helps you spiraling down\" instead of \"keeps you from spiraling down\" and that completely changed my message. Now it sounds like I was being absolutely nasty. Oh my God I'm so sorry, I hope you still managed to get what I was trying to put across :D",
          "created_utc": 1597004390.0
        }
      ]
    },
    {
      "id": "g0whtpm",
      "author": "None",
      "body": "Maybe they know a lot, but that doesn't mean they put thought into action. I am like a nutrition bible, but for the past 13 years I didn't follow what I knew intuitively. I needed my meal plan to hold me accountable especially for eating fat, and sometimes other things.",
      "created_utc": 1596989256.0,
      "score": 5,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wh21c",
          "author": "None",
          "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
          "created_utc": 1596988825.0
        },
        {
          "id": "g0whgov",
          "author": "internerderner2",
          "body": ">you need a balance of fat, protein, and carbs to nourish your body.\n\nPeople with EDs are possibly the most knowledgeable people about nutrition that I've ever known. I've rarely met someone who genuinely wasn't able to put together a balanced meal in terms of nutrients.",
          "created_utc": 1596989051.0
        }
      ]
    },
    {
      "id": "g0wgy3g",
      "author": "internerderner2",
      "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
      "created_utc": 1596988765.0,
      "score": 1,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        }
      ]
    },
    {
      "id": "g10ch5w",
      "author": "internerderner2",
      "body": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.",
      "created_utc": 1597078347.0,
      "score": -1,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        },
        {
          "id": "g10524z",
          "author": "None",
          "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
          "created_utc": 1597074685.0
        }
      ]
    },
    {
      "id": "g0wi4fh",
      "author": "internerderner2",
      "body": "> they put thought into action.\n\nAnd that's the whole problem, isn't it? \n\nThis is literally what I wrote in the whole post. We all know what to do, we just choose not to do it. If you are committed to do it (regardless of how much you actually want to), then you can do it with or without a meal plan. If not, then the ED will easily use the meal plan itself to its advantage as mine has done multiple times over at this point.",
      "created_utc": 1596989420.0,
      "score": 1,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wh21c",
          "author": "None",
          "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
          "created_utc": 1596988825.0
        },
        {
          "id": "g0whgov",
          "author": "internerderner2",
          "body": ">you need a balance of fat, protein, and carbs to nourish your body.\n\nPeople with EDs are possibly the most knowledgeable people about nutrition that I've ever known. I've rarely met someone who genuinely wasn't able to put together a balanced meal in terms of nutrients.",
          "created_utc": 1596989051.0
        },
        {
          "id": "g0whtpm",
          "author": "None",
          "body": "Maybe they know a lot, but that doesn't mean they put thought into action. I am like a nutrition bible, but for the past 13 years I didn't follow what I knew intuitively. I needed my meal plan to hold me accountable especially for eating fat, and sometimes other things.",
          "created_utc": 1596989256.0
        }
      ]
    },
    {
      "id": "g0whzmn",
      "author": "angiotensin-2",
      "body": "They are different a binge is an ed behavior and extreme hunger is the result of an overly restrictive diet. Binges are emotionally driven and have nothing to do with physical hunger as the person bingeing will push themselves to continue eating past the point of physical fullness. Extreme hunger only happens when we deprive our bodies of food for too long. That generally can’t be avoided and should be expected when recovering from a restrictive ed. I’m not saying that’s what’s being prevented. Bingeing, however is sometimes started as an extra coping mechanism or ed behavior. When we stop restricting, that’s a coping mechanism being taken away. It’s very common to start a new coping mechanism like bingeing. The meal plan and dietitian will help the person recovering learn the difference as extreme hunger is very often confused for a binge. The person is taught to listen to hunger/fullness queues and use those to guide eating big still hungry after eating a lot they will continue. That’s likely extreme hunger. When bingeing is the case, the person likely wouldn’t feel physically hungry after eating a lot of food and knows to stop. The meal plan gets them back on track after a binge.",
      "created_utc": 1596989346.0,
      "score": 8,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        }
      ]
    },
    {
      "id": "g0wibso",
      "author": "angiotensin-2",
      "body": "And as for your last comment I meant the meal plan prevents eating both too little and too much. You’ve only been arguing on the side of eating too much.",
      "created_utc": 1596989534.0,
      "score": 5,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        }
      ]
    },
    {
      "id": "g10hpa2",
      "author": "None",
      "body": "And what are your qualifications that allow you to make that kind of statement?",
      "created_utc": 1597080865.0,
      "score": 3,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        },
        {
          "id": "g10524z",
          "author": "None",
          "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
          "created_utc": 1597074685.0
        },
        {
          "id": "g10ch5w",
          "author": "internerderner2",
          "body": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.",
          "created_utc": 1597078347.0
        }
      ]
    },
    {
      "id": "g104mnz",
      "author": "None",
      "body": "I think some people need a meal plan for accountability. I know I did at my worst because the minute I started to skip out on certain things, I knew I had to re-evaluate and recommit to my meal plan. I don't think they should be a lifelong thing, but I think they are useful at certain points in recovery. You can't just tell someone with an eating disorder to \"just eat.\" If I was given free reign at my worst, I would have chosen to eat nothing and cut out entire food groups. I don't see how a meal plan as a base plan (which allows for variability) is detrimental, especially for someone with a restrictive eating disorder.",
      "created_utc": 1597074468.0,
      "score": 2,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wh21c",
          "author": "None",
          "body": "I completely agree with all of your points. Like you stated, a meal plan helps you make sure you are getting the proper nutrients from all different kinds of food. You could eat a ton of food, but you need a balance of fat, protein, and carbs to nourish your body. I also think it's helpful for people to have a set schedule of when they should eat because it is so easy to convince yourself that you aren't hungry if you don't have set meal times. I don't think you should be on a meal plan forever, but it definitely helps in the initial stages of recovery because I think some people with eating disorders lose sight of what a normal meal looks like, so they need a model to go off of. \n\nWith that said, a meal plan should definitely be emphasized as a MINIMUM for those that are recovering from restrictive EDs because it allows the person to go over without feeling guilty for eating \"more than they should.\" \n\nPeople in recovery need structure and I think a meal plan is necessary to provide that in the beginning. I don't think it has anything to do with fat-phobia or the prevention of over-eating. It is literally providing people with skewed views on food what a healthy diet should look like in terms of amounts, etc.",
          "created_utc": 1596988825.0
        },
        {
          "id": "g0whgov",
          "author": "internerderner2",
          "body": ">you need a balance of fat, protein, and carbs to nourish your body.\n\nPeople with EDs are possibly the most knowledgeable people about nutrition that I've ever known. I've rarely met someone who genuinely wasn't able to put together a balanced meal in terms of nutrients.",
          "created_utc": 1596989051.0
        },
        {
          "id": "g0whtpm",
          "author": "None",
          "body": "Maybe they know a lot, but that doesn't mean they put thought into action. I am like a nutrition bible, but for the past 13 years I didn't follow what I knew intuitively. I needed my meal plan to hold me accountable especially for eating fat, and sometimes other things.",
          "created_utc": 1596989256.0
        },
        {
          "id": "g0wi4fh",
          "author": "internerderner2",
          "body": "> they put thought into action.\n\nAnd that's the whole problem, isn't it? \n\nThis is literally what I wrote in the whole post. We all know what to do, we just choose not to do it. If you are committed to do it (regardless of how much you actually want to), then you can do it with or without a meal plan. If not, then the ED will easily use the meal plan itself to its advantage as mine has done multiple times over at this point.",
          "created_utc": 1596989420.0
        }
      ]
    },
    {
      "id": "g0wikli",
      "author": "internerderner2",
      "body": ">as the person bingeing will push themselves to continue eating past the point of physical fullness.\n\nLiterally every single person responding to extreme hunger has done that. \n\nNo, really. Eating past physical fullness is **extremely** common in extreme hunger. I would go as far as saying that extreme hunger cannot exist without eating past physical fullness at least once. Actually, scrape that, it's also common without extreme hunger due to physiological mechanisms. Physical fullness in general is a highly unreliable metric in recovery.\n\nThe funny thing is, every single word you wrote in this last reply is what my ED says to me on a daily basis, as in, \"you're only binging that's not extreme hunger because you eat past physical fullness and you're only mentally fucked\". Luckily enough I do not let triggers influence me too much these days because otherwise I'd be already out running my legs off and crying, lol.",
      "created_utc": 1596989669.0,
      "score": 0,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0whzmn",
          "author": "angiotensin-2",
          "body": "They are different a binge is an ed behavior and extreme hunger is the result of an overly restrictive diet. Binges are emotionally driven and have nothing to do with physical hunger as the person bingeing will push themselves to continue eating past the point of physical fullness. Extreme hunger only happens when we deprive our bodies of food for too long. That generally can’t be avoided and should be expected when recovering from a restrictive ed. I’m not saying that’s what’s being prevented. Bingeing, however is sometimes started as an extra coping mechanism or ed behavior. When we stop restricting, that’s a coping mechanism being taken away. It’s very common to start a new coping mechanism like bingeing. The meal plan and dietitian will help the person recovering learn the difference as extreme hunger is very often confused for a binge. The person is taught to listen to hunger/fullness queues and use those to guide eating big still hungry after eating a lot they will continue. That’s likely extreme hunger. When bingeing is the case, the person likely wouldn’t feel physically hungry after eating a lot of food and knows to stop. The meal plan gets them back on track after a binge.",
          "created_utc": 1596989346.0
        }
      ]
    },
    {
      "id": "g0wixwc",
      "author": "internerderner2",
      "body": "Because, as I wrote in the opening post, eating too little is actually a *choice* that we make.\n\nA choice that feels **incredibly necessary**, but a choice nonetheless.\n\nLiterally no one, no one but our ED is stopping us from eating more if we're in doubt that we haven't eaten enough.",
      "created_utc": 1596989869.0,
      "score": -1,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0wibso",
          "author": "angiotensin-2",
          "body": "And as for your last comment I meant the meal plan prevents eating both too little and too much. You’ve only been arguing on the side of eating too much.",
          "created_utc": 1596989534.0
        }
      ]
    },
    {
      "id": "g10i4lh",
      "author": "internerderner2",
      "body": "Qualifications are irrelevant in this case. I'm not dismissing the potential benefit of a meal plan. What I'm discussing is the reason why most patients choose it.",
      "created_utc": 1597081068.0,
      "score": -1,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        },
        {
          "id": "g10524z",
          "author": "None",
          "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
          "created_utc": 1597074685.0
        },
        {
          "id": "g10ch5w",
          "author": "internerderner2",
          "body": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.",
          "created_utc": 1597078347.0
        },
        {
          "id": "g10hpa2",
          "author": "None",
          "body": "And what are your qualifications that allow you to make that kind of statement?",
          "created_utc": 1597080865.0
        }
      ]
    },
    {
      "id": "g0wjggh",
      "author": "angiotensin-2",
      "body": "I’m done with this argument as I’m now incredibly triggered by this whole thing. And it’s very clear at this point neither of us will agree with each other. I originally commented as a way to let you know I didn’t think this was helpful for people in recovery to see. And I didn’t think you’d be so condescending back to me. We’re all in recovery here and we’re all trying to support each other. I wasn’t trying to tear you down, only let you know, your original post wasn’t helpful for me and upset me as it went against what I’ve been taught by my treatment team and it could do the same for others. It’s my fault for continuing to engage.",
      "created_utc": 1596990149.0,
      "score": 7,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0whzmn",
          "author": "angiotensin-2",
          "body": "They are different a binge is an ed behavior and extreme hunger is the result of an overly restrictive diet. Binges are emotionally driven and have nothing to do with physical hunger as the person bingeing will push themselves to continue eating past the point of physical fullness. Extreme hunger only happens when we deprive our bodies of food for too long. That generally can’t be avoided and should be expected when recovering from a restrictive ed. I’m not saying that’s what’s being prevented. Bingeing, however is sometimes started as an extra coping mechanism or ed behavior. When we stop restricting, that’s a coping mechanism being taken away. It’s very common to start a new coping mechanism like bingeing. The meal plan and dietitian will help the person recovering learn the difference as extreme hunger is very often confused for a binge. The person is taught to listen to hunger/fullness queues and use those to guide eating big still hungry after eating a lot they will continue. That’s likely extreme hunger. When bingeing is the case, the person likely wouldn’t feel physically hungry after eating a lot of food and knows to stop. The meal plan gets them back on track after a binge.",
          "created_utc": 1596989346.0
        },
        {
          "id": "g0wikli",
          "author": "internerderner2",
          "body": ">as the person bingeing will push themselves to continue eating past the point of physical fullness.\n\nLiterally every single person responding to extreme hunger has done that. \n\nNo, really. Eating past physical fullness is **extremely** common in extreme hunger. I would go as far as saying that extreme hunger cannot exist without eating past physical fullness at least once. Actually, scrape that, it's also common without extreme hunger due to physiological mechanisms. Physical fullness in general is a highly unreliable metric in recovery.\n\nThe funny thing is, every single word you wrote in this last reply is what my ED says to me on a daily basis, as in, \"you're only binging that's not extreme hunger because you eat past physical fullness and you're only mentally fucked\". Luckily enough I do not let triggers influence me too much these days because otherwise I'd be already out running my legs off and crying, lol.",
          "created_utc": 1596989669.0
        }
      ]
    },
    {
      "id": "g0wjmze",
      "author": "angiotensin-2",
      "body": "Alright I know I said I wasn’t going to continue but now I’m personally offended. I never made the choice to eat too little. This is incredibly offensive. My ed was not a choice. Good bye.",
      "created_utc": 1596990244.0,
      "score": 7,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0wibso",
          "author": "angiotensin-2",
          "body": "And as for your last comment I meant the meal plan prevents eating both too little and too much. You’ve only been arguing on the side of eating too much.",
          "created_utc": 1596989534.0
        },
        {
          "id": "g0wixwc",
          "author": "internerderner2",
          "body": "Because, as I wrote in the opening post, eating too little is actually a *choice* that we make.\n\nA choice that feels **incredibly necessary**, but a choice nonetheless.\n\nLiterally no one, no one but our ED is stopping us from eating more if we're in doubt that we haven't eaten enough.",
          "created_utc": 1596989869.0
        }
      ]
    },
    {
      "id": "g10io5w",
      "author": "None",
      "body": "No, they're not. You're telling people with eating disorders that they shouldn't follow a meal plan. You don't have the authority to make that statement. Also, most patients don't \"choose\" a meal plan. Dietitians or treatment teams recommend a meal plan.",
      "created_utc": 1597081328.0,
      "score": 2,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        },
        {
          "id": "g10524z",
          "author": "None",
          "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
          "created_utc": 1597074685.0
        },
        {
          "id": "g10ch5w",
          "author": "internerderner2",
          "body": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.",
          "created_utc": 1597078347.0
        },
        {
          "id": "g10hpa2",
          "author": "None",
          "body": "And what are your qualifications that allow you to make that kind of statement?",
          "created_utc": 1597080865.0
        },
        {
          "id": "g10i4lh",
          "author": "internerderner2",
          "body": "Qualifications are irrelevant in this case. I'm not dismissing the potential benefit of a meal plan. What I'm discussing is the reason why most patients choose it.",
          "created_utc": 1597081068.0
        }
      ]
    },
    {
      "id": "g0wjmrk",
      "author": "internerderner2",
      "body": "I also get triggered so much by people telling me that eating past physical fullness is wrong, because that's what my ED also says. But I continued talking with you because I respect you, I know you mean well and I was interested in your point of view. I wish you well in your future recovery. :)",
      "created_utc": 1596990241.0,
      "score": 0,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0whzmn",
          "author": "angiotensin-2",
          "body": "They are different a binge is an ed behavior and extreme hunger is the result of an overly restrictive diet. Binges are emotionally driven and have nothing to do with physical hunger as the person bingeing will push themselves to continue eating past the point of physical fullness. Extreme hunger only happens when we deprive our bodies of food for too long. That generally can’t be avoided and should be expected when recovering from a restrictive ed. I’m not saying that’s what’s being prevented. Bingeing, however is sometimes started as an extra coping mechanism or ed behavior. When we stop restricting, that’s a coping mechanism being taken away. It’s very common to start a new coping mechanism like bingeing. The meal plan and dietitian will help the person recovering learn the difference as extreme hunger is very often confused for a binge. The person is taught to listen to hunger/fullness queues and use those to guide eating big still hungry after eating a lot they will continue. That’s likely extreme hunger. When bingeing is the case, the person likely wouldn’t feel physically hungry after eating a lot of food and knows to stop. The meal plan gets them back on track after a binge.",
          "created_utc": 1596989346.0
        },
        {
          "id": "g0wikli",
          "author": "internerderner2",
          "body": ">as the person bingeing will push themselves to continue eating past the point of physical fullness.\n\nLiterally every single person responding to extreme hunger has done that. \n\nNo, really. Eating past physical fullness is **extremely** common in extreme hunger. I would go as far as saying that extreme hunger cannot exist without eating past physical fullness at least once. Actually, scrape that, it's also common without extreme hunger due to physiological mechanisms. Physical fullness in general is a highly unreliable metric in recovery.\n\nThe funny thing is, every single word you wrote in this last reply is what my ED says to me on a daily basis, as in, \"you're only binging that's not extreme hunger because you eat past physical fullness and you're only mentally fucked\". Luckily enough I do not let triggers influence me too much these days because otherwise I'd be already out running my legs off and crying, lol.",
          "created_utc": 1596989669.0
        },
        {
          "id": "g0wjggh",
          "author": "angiotensin-2",
          "body": "I’m done with this argument as I’m now incredibly triggered by this whole thing. And it’s very clear at this point neither of us will agree with each other. I originally commented as a way to let you know I didn’t think this was helpful for people in recovery to see. And I didn’t think you’d be so condescending back to me. We’re all in recovery here and we’re all trying to support each other. I wasn’t trying to tear you down, only let you know, your original post wasn’t helpful for me and upset me as it went against what I’ve been taught by my treatment team and it could do the same for others. It’s my fault for continuing to engage.",
          "created_utc": 1596990149.0
        }
      ]
    },
    {
      "id": "g0wjqly",
      "author": "internerderner2",
      "body": "Never did I ever said your ED was a choice. Mine also wasn't. But every day I choose to eat too little, and no one but myself is stopping me from eating more. That's the harsh and sad truth.",
      "created_utc": 1596990296.0,
      "score": -2,
      "context": [
        {
          "id": "g0w7czx",
          "author": "angiotensin-2",
          "body": "I’m not sure this is exactly true and tbh this comes off as a little invalidating. This kind of sounds like the argument that you can “just eat.” Which I think everyone hear knows how much that sucks because I literally could not just open the fridge right now and just do that. \n\n\n\n\nThere is a risk of going to the opposite side of the spectrum and developing bed or some type of binge eating from anorexia regardless of whether or not you’re underweight. Meal plans help mitigate that risk because generally that would make things worse. \n\n\n\nI also think meal plans help with macro and micronutrient distribution. Sure you can eat a lot of food, but if you’re not picking the right ones and right amounts of each you’re not going to replenish your body with the things it needs. \n\n\nI actually also think you wouldn’t remember to eat enough or to eat at certain times. My ed has me conditioned to never start eating before a certain time each day. So after so long of doing that I don’t get hungry until before that time and literally feel nauseous if I try to think about food too early. So yeah, if I were to go about my regular life I would forget about eating until a certain time and then it would be difficult to fit all of my exchanges before I go to sleep. \n\n\n\n\nI think it’s easy to eat enough if you don’t have an ed. But the ed warps you’re brain and you’re thinking so much that without outside guidance you will not know what to do.",
          "created_utc": 1596983276.0
        },
        {
          "id": "g0weyfp",
          "author": "internerderner2",
          "body": ">There is a risk of going to the opposite side of the spectrum \n\nAs in, there is a risk of going too much weight. That's the real fear. Let's call it for what it is.\n\n>if I were to go about my regular life I would forget about eating\n\nI don't know you and I might be speculating. But to be honest, it's really and I mean really hard to believe that someone with an active ED can genuinely, truthfully, honestly just \"forget\" eating.\n\nSee my answer above: I'm not being condescending and I don't enjoy calling people out for shit and giggles. What I do believe, though, is that in order to recover we first have to be fully honest with ourselves instead of finding excuses. Which is what I also do on a daily basis - \"forgetting\" to eat, \"genuinely not knowing\" how much to eat, thinking that I'm somehow the exception and so on.",
          "created_utc": 1596987690.0
        },
        {
          "id": "g0wfisq",
          "author": "angiotensin-2",
          "body": "Ok maybe I didn’t phrase it properly. But bingeing is a risk when in recovery from a restrictive ed. I know what you’re trying to get at. That having a meal plan means you fear gaining weight and that is fatphobic. But eds go deeper than just the societal fear of being overweight. There are a lot of things at play here beyond that. I also explained some other reasons above too that you failed to comment on. \n\n\n\nIn short I don’t think this is helpful for people in recovery to hear. It sounds like you’re saying just throw the whole meal plan out the window. I’m sure some people would do fine without it. But those are likely far and few in between. It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”",
          "created_utc": 1596987980.0
        },
        {
          "id": "g0wfnuo",
          "author": "internerderner2",
          "body": ">But bingeing is a risk when in recovery from a restrictive ed.\n\nAnd what are the negative consequences of this \"risk\"? Besides purging, which is also a choice and a conscious action that can be avoided (although no one wants to hear that - btw I also purge). \n\n>It’s like me saying don’t go to a therapist at all or get treatment because you “know what to do.”\n\nTherapy is not a basic biological function.\n\nHonestly I believe that one problem with us ED patients is that we don't like to hear that some things actually ARE under our control and we HAVE the ability to change them.",
          "created_utc": 1596988054.0
        },
        {
          "id": "g0wgq4m",
          "author": "angiotensin-2",
          "body": "Bingeing just like purging is an ed behavior. We want to avoid ALL ed behaviors. And don’t think I’m confusing bingeing with extreme hunger. I fully understand those are different things. \n\n\nAlso are you kidding? Therapy is proven time and time again to be the most effective way to treat eds. I believe it’s absolutely necessary for 95% of people with eds to fully recover. The way our brains work is totally a biological function. \n\n\nEds are a mixture of mental and physical symptoms but always have an underlying mental component. It is because of that me to component (that much be treated with therapy and counseling) that we do not know how to eat in a balanced way (meaning BOTH not too much and not enough). If we never treat the mental component we will never be truly able to let go of physical behavior use. \n\n\n\nAnd my ed isn’t about control and never was.",
          "created_utc": 1596988639.0
        },
        {
          "id": "g0wgy3g",
          "author": "internerderner2",
          "body": "> I fully understand those are different things. \n\nAnd how are they different? When I give in to my extreme hunger I feel every single symptom attributed to a binge (feeling out of control, eating very quickly, eating out of feelings instead of real hunger, eating in secret, feeling shameful...my ED thrives on those beliefs) Also, why would a meal plan reduce the risk of starting binging compared to no meal plan? If you're treating the mental component, which can very well happen with or without a meal plan, then the meal plan becomes redundant in the first place, right?\n\n>meaning BOTH not too much\n\nWhat does it mean too much?",
          "created_utc": 1596988765.0
        },
        {
          "id": "g0wibso",
          "author": "angiotensin-2",
          "body": "And as for your last comment I meant the meal plan prevents eating both too little and too much. You’ve only been arguing on the side of eating too much.",
          "created_utc": 1596989534.0
        },
        {
          "id": "g0wixwc",
          "author": "internerderner2",
          "body": "Because, as I wrote in the opening post, eating too little is actually a *choice* that we make.\n\nA choice that feels **incredibly necessary**, but a choice nonetheless.\n\nLiterally no one, no one but our ED is stopping us from eating more if we're in doubt that we haven't eaten enough.",
          "created_utc": 1596989869.0
        },
        {
          "id": "g0wjmze",
          "author": "angiotensin-2",
          "body": "Alright I know I said I wasn’t going to continue but now I’m personally offended. I never made the choice to eat too little. This is incredibly offensive. My ed was not a choice. Good bye.",
          "created_utc": 1596990244.0
        }
      ]
    },
    {
      "id": "g10ixgn",
      "author": "internerderner2",
      "body": ">You're telling people with eating disorders that they shouldn't follow a meal plan.\n\nI'm telling people that they are probably not being honest in why they follow a meal plan. They can absolutely do whatever they like. I also follow a meal plan myself.",
      "created_utc": 1597081452.0,
      "score": 1,
      "context": [
        {
          "id": "g0wckym",
          "author": "None",
          "body": "I don't have a meal plan yet, my dietician appointment is next week but...I genuinely do eat too much and that is why I made the dietician appointment. I am about to be officially overweight again and if I get there I feel I will be at risk for full relapse. I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food. If I try to control my food I go into overdrive and restrict and get obsessive, and start purging when I do binge. If I don't try to control it I end up bingeing and overeating and I am about to hit an overweight BMI because of it. \n\nI am sure your post resonates with a lot of people, but it isn't true for everyone, and there are exceptions beyond severe ana recovery. 🤷‍♀️🤷‍♀️",
          "created_utc": 1596986351.0
        },
        {
          "id": "g0wf5o4",
          "author": "internerderner2",
          "body": ">I genuinely need help to eat a normal amount because I don't know when I'm full anymore or when I should actually eat vs. when I should say no to food.\n\nIn other words, again: I don't know how not to eat \"too much\", with \"too much\" being \"the amount that leads me to a weight I don't like\".\n\nDo not think I'm being condescending. I know your fear all too well. I share that fear. But you have to be honest with yourself and recognize that it's not so much a \"but I **truly** need to watch my eating!\", because that's what literally everyone with an ED said ever.",
          "created_utc": 1596987795.0
        },
        {
          "id": "g0xpkxa",
          "author": "None",
          "body": "Okay but there is a point where you really have to say no to food? Like I can't just eat more whenever I'm in doubt, I would be just as bad as when I was at the lowest point of my ED.\n\nParticularly I fucked my satiety cues by binging, not like 'omg I ate 800 calories' bungling but medically bingeing, like an xl pizza, side of cheese sticks, pint of ice cream and family sized bag of chips in 30 mins and then purging it. Every day, sometimes multiple days for months. Stretched my stomach BEYOND the limit and fucked with my digestion. Getting legitimate fullness levels right is hard.\n\nIf I just eat whenever I'm in doubt, I will have just as many health concerns as I did when I was purging regularly. My goal isn't to just be happy with my body, it's to eat in a way that isn't actively harming my body. Before my ED I was actually overweight. Medically. It was not healthy. During my ED I was normal weight, and I was not healthy, medically. \n\nI want recovery to not be changing one unhealthy eating habit for another...I want to actually eat healthy and do right by my body. And it is hard to do on my own. Of course I'm scared of fucking gaining weight but I really want to do it right. \n\nBut fuck me I guess idk",
          "created_utc": 1597012195.0
        },
        {
          "id": "g0xx24s",
          "author": "internerderner2",
          "body": "To be clear, I'm not here to tell you that you're doing recovery wrong, and in any case you should definitely keep listening to your guts and your treatment team rather than a random stranger on reddit like me.\n\nI just have personally found that a meal plan only serves to fuel my ED and that I cannot ever hope to truly recover by obsessing over healthy portions, wholesome foods, right caloric amounts, not swinging the other way and all that jazz. It's all good for the average person, but I'm not there at the moment. Additionally, I've learned that I need to be honest with myself and realize why I'm doing certain actions that I'd dress up as legitimate concerns for my health. In any case, I'm not against any approach; if you think that a meal plan is the best solution for you instead, then I can only say do it! Ultimately, the only right way to recover is the one that works - you do you and I hope that whichever road you choose it will lead you to a healthy, happy and fulfilling life free from any ED crap. :)",
          "created_utc": 1597016384.0
        },
        {
          "id": "g10524z",
          "author": "None",
          "body": "You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating. There is a reason meal plans are used in eating disorder treatment so often; there is research and data backing them. If you're working with a dietitian, there should be a conversation about altering it frequently, but I don't think there's anything wrong with having a meal plan as a basis.",
          "created_utc": 1597074685.0
        },
        {
          "id": "g10ch5w",
          "author": "internerderner2",
          "body": ">You made a very blanket statement in your initial post, though. You said \"in most cases\" people in recovery shouldn't be on a meal plan because they are scared of overeating.\n\nAnd I stand by that statement.",
          "created_utc": 1597078347.0
        },
        {
          "id": "g10hpa2",
          "author": "None",
          "body": "And what are your qualifications that allow you to make that kind of statement?",
          "created_utc": 1597080865.0
        },
        {
          "id": "g10i4lh",
          "author": "internerderner2",
          "body": "Qualifications are irrelevant in this case. I'm not dismissing the potential benefit of a meal plan. What I'm discussing is the reason why most patients choose it.",
          "created_utc": 1597081068.0
        },
        {
          "id": "g10io5w",
          "author": "None",
          "body": "No, they're not. You're telling people with eating disorders that they shouldn't follow a meal plan. You don't have the authority to make that statement. Also, most patients don't \"choose\" a meal plan. Dietitians or treatment teams recommend a meal plan.",
          "created_utc": 1597081328.0
        }
      ]
    }
  ]
}