{
  "id": "i7316m",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1597058691.0,
  "title": "Sometimes I feel we need more 'tough talk' in recovery.",
  "selftext": "Don't get me wrong, it's great that we are kind to each other, listen to each other's fears and worries and try to be compassionate and understanding. A caring, supportive environment is always the best to achieve full and sustainable recovery.\n\nHowever, I also do feel that...I don't know, us with EDs don't really like to be told certain things - we know those to be true, but we hate hearing them nonetheless. \n\nSo here's some ideas that I have that usually get me into heated arguments with other people in recovery:\n\n1. **it is a choice to engage in any kind of behaviour**. You can say all you want that \"I can't help but restricting\", \"I can't stop purging\", \"it's beyond my control\" etc., but the harsh reality is that you DO have a choice. You DO choose to engage in those behaviours. You CAN choose not to. You didn't choose to have an ED, but you do choose everyday to keep having one. There is no one, no one but yourself that forces you to keep restricting, purging, exercising or whichever other behaviour characterizes your ED. \nAnd so many people interpret this as \"it's your fault/you just have to do it\", whereas this is absolutely not the case. What I am actually trying to put across is that you DO have the control to change your actions. And this feels incredibly empowering. Knowing that, you also know what to do next - which doesn't mean you have to do it alone; you may very well have to ask for help. But it's still up to you. \n\n2. **your triggers are your problem**. Yes, society is shit. Yes, people are often assholes. Maybe they try to be nice, and they fail. Maybe they don't understand how you feel. Maybe no one does. But as an adult living in the real world you cannot expect anyone to accommodate your issues. You probably also say a lot of stupid stuff that might hurt someone else and you don't know anything about it. That's life. Recovery is also learning to be confident enough that you don't have to be bothered by any random comment you read or run back to your ED everytime you feel uncomfortable. \n\n3. **you have to quit all the excuses**. You can trick your therapist, your dietitian, your parents, your friends, strangers on the internet and everyone else into believing all you want them to believe. That you \"forgot\" to eat, or you \"just want to walk to manage anxiety\", or that you \"are doing everything you can\". But in the end, the only person that loses is you. Real life doesn't care about any shenanigans and if you're not fully honest with yourself and the others you will just be wasting time that no one will give you back, while the rest of the world goes on without really caring about you.\n\nThat's it, thank you for coming to my shitty ted talk.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i7316m/sometimes_i_feel_we_need_more_tough_talk_in/",
  "score": 209,
  "num_comments": 40,
  "comments": [
    {
      "id": "g0zla74",
      "author": "None",
      "body": "I think many people approach recovery as --) I will go to treatment or therapy and that will eliminate whatever drives my ED behaviors and I will naturally stop doing them. \n\nUnfortunately, early to middling - and sometimes even long, established - recovery involves wanting to engage in behaviors but making the active decision not to. It's learning that having an urge or experiencing negative emotions and thoughts around that urge do not have to lead to an action. Most humans suck at prioritizing long term benefits over short term gains though so it's natural to go back to disordered behaviors that alleviate suffering NOW versus having hope that experiencing suffering for weeks or months or even years will eventually lead to a better outcome.\n\nBut yeah. Lots of passive language here and also in other recovery spaces.",
      "created_utc": 1597063390.0,
      "score": 41,
      "context": []
    },
    {
      "id": "g0ziyan",
      "author": "Sourpatch_kiddo",
      "body": "_You didn't choose to have an ED, but you do choose everyday to keep having one._\n\nOuch, this. I know it’s true now and tbh I would have hated if someone told me that months ago but I probably needed to hear it.",
      "created_utc": 1597061644.0,
      "score": 79,
      "context": []
    },
    {
      "id": "g0zjxem",
      "author": "None",
      "body": "I totally agree. Real recovery involves a *brutal* degree of self-honesty and taking a lot of responsibility for your behavior, reactions, and beliefs. And it's amazing how much of a difference that can make. Like, saying / thinking \"I can't help it, I just have to do \\[behavior\\]\" also reinforces to yourself that you can't and it becomes a self-fulfilling belief. If you want to recover, you have to do a lot of mental work to uproot all those beliefs that aren't conducive to recovery: you need to believe \"I *can* help it, I *can* choose to refrain from \\[behavior\\]\" and then you'll find, yeah, you actually can. You're right, it's super empowering :)\n\nIt just sucks that I think a lot of people aren't in a position where they can really tolerate or accept tough love, and they often push it away. I know I was in that position quite a lot in my recovery (or past shitty attempts at recovery lol). Took a while until I finally accepted that I needed to be honest with myself like that",
      "created_utc": 1597062388.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g10507y",
      "author": "taika2112",
      "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
      "created_utc": 1597074659.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g0zjl5n",
      "author": "notlosingsleep",
      "body": "I completely agree with you. It is not my fault that I developed an eating disorder and it is not my fault that society is shit and that I have so many triggers. But it is on me if I chose to engage in unhealthy behaviours. \n\nI’m almost done reading Brain Over Binge and it has changed the way I see my eating disorder so much. I don’t agree with the author on some things (like therapy being useless), but ever since I decided to take full responsibility for my actions, recovery has become so much easier. I am not in control of my urges to b/p, but I can chose what to do when I get the urges. And so I (mostly) stopped b/p because I’m not as weak as I think and my disorder does not control me. \n\nIt was hard to realise that I was making a lot of excuses and that I was consciously choosing to engage in disordered behaviours because it is easy, comforting and all I’ve known for a long time.\n\nAs I said before, I don’t agree with the author’s views on therapy. I never focused on my ed in therapy but learning to be more self aware in general and realising how skewed my perception/thought process can be was extremely helpful and therapy played a big role in that. \n\nHad you told me I’m making excuses and that I’m in control a few months ago I would’ve probably told you to fuck off and gone back to my disordered behaviours. Recovery is hard and I truly understand why we don’t like to be told that we have a choice. It means we have to put in the effort and it’s really uncomfortable. It’s worth it though, it really is, and it gets easier with time.",
      "created_utc": 1597062131.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g0zn5dv",
      "author": "xleabrax",
      "body": "Yes!! I’d like to add that tough love is also very needed in recovery and we all need a reality check - this is why I like Tabitha Farrar, she just cuts the crap with it because what we are engaging with at the end of the day is something so irrational and our relationship with food shouldn’t be complicated \n\n(Due to being under 18) my treatment team are trying their best and I am truly grateful for them but the sappy ways they try to convince me to eat just doesn’t do anything, I would like to be told my ED is stupid and to just eat the damn crisps! Haha (obviously this is different for everyone but I like the more realistic direct approach)",
      "created_utc": 1597064688.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g11i0yz",
      "author": "wanderlustcub",
      "body": "I feel that there are many different ways to climb the mountain of recovery. What works for you may not work for me, or for someone else. \n\nA combative, \"this is reality, grow up\"  approach works for some people, but for others, it just creates a mess. So, while I agree with aspects of this, I also know that there is no \"one size fits all\" approach to recovery and being told to harden up is in itself toxic.   \n\n\nTrust me, as a guy with an eating disorder, being told to \"toughen up,\" \"be a man,\" \"stop being a pussy,\"\"This isn't a man thing,\"  is harmful and destructive. Let's not replace one form of abuse with another.    \n\n\nThis goes beyond people with eating disorders, it is a human reaction.   \n\n\nEmpowerment is essential for recovery, but we don't need to break people down like the military in order to do it. And just telling someone that \"You just need to quit all the excuses\" or \"Your triggers are your problem, figure it out\" is quite detrimental when the person is not in the right space to accept that information.   \n\n\nI am glad that straight, blunt talk works for you, but it is not necessary the best for everyone, and there is never just a single solution to mental health.",
      "created_utc": 1597098422.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g0zv5my",
      "author": "applecinnamonnn",
      "body": "So much truth. We need more posts like this, honestly. I tell these things to myself everyday and I’m sure a lot of us do- but it’s like a soft spoken voice in my head that is so, so easy to ignore. I my case, I do it because I’m cognitively trying to escape happiness- for a reason me or my therapists never fully understood- and I *need* to be sick to have some sort of value, since apparently my self esteem is non existent. Thank you for sharing this and kicking us all in the shins.",
      "created_utc": 1597069525.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g10fouq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1597079903.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g121pbc",
      "author": "DartInTheDark",
      "body": "I was finally able to start recovering from binging and emotional overeating when I finally got ANGRY enough. At myself. And not in a 'I'm shit' sort of self hate kinda anger, but a 'it's time to be proud of myself; I'm so much better than this and am capable of so much more than this' kind of anger. I got so fed up with myself, and so over myself, that I finally went at my awful eating habits with a rage I didn't know I was capable of.\n\nYou. Must. Decide. To. Change. Then. Do. It.",
      "created_utc": 1597109140.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0zs1mx",
      "author": "youtubeserver",
      "body": "👏👏👏👏👏 well said tbh I think people need reminders that they are not helpless to the thoughts they have. It’s your own brain and you have the power over it, not the other way around. This is a big thought in Eastern philosophy as well as Western mindfulness. Taking back the power over my body for myself has been big for me. I struggle with letting thoughts pass often, but it is something I work on. Good luck to everyone here and know that these things don’t just disappear overnight, no, but you can take back the power of your own mind and that’s important",
      "created_utc": 1597067768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g10h1n9",
      "author": "LawrenAnne4",
      "body": "My therapist of over ten years is great with tough talk. I used to have a really bad habit of catastrophizing and making myself out to be the victim, and over the years he learned that being really forward and straight with me was the best course of action. I've hated it at times (it's hard to look yourself in the eye when you know you aren't doing what you need to do) but he is always incredibly honest with me and I really value knowing he won't sugarcoat anything and will call me on my shit.  \n\n&#x200B;\n\nOne memorable encounter was when I was lamenting that my sister stated that she didn't want to go to the movies with me and he said something along the lines of \"I get it, nobody wants to watch you lick the salt off of popcorn for two hours. You have to understand that if you engage in disordered behavior around people instead of engaging with them, they won't want to spend time with you\". It was awesome.",
      "created_utc": 1597080550.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g115p8i",
      "author": "DisabledMuse",
      "body": "There's a reason why interventions are so hard. The truth is, addiction to anything, substances or behaviours, are a complex mess of things that need untangling. And it can't untangle if we pretend it's okay or we have no control. This is our control. We feel out of control so we do this. Taking responsibility actually gives us more control and somewhere to go from there. I know that no one is doing this to me but me. No one can make me feel any way. It's how I respond to things. It's all so hard but we can do it one step at a time.",
      "created_utc": 1597092418.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g118t98",
      "author": "Greeneyedgirl17",
      "body": "God I love this you go glen co co",
      "created_utc": 1597093902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1221i1",
      "author": "DartInTheDark",
      "body": "Therapy thought me the distinction between fault and responsibility.\n\nWhatever is at fault for your issues doesn't matter. If you're an adult, you're RESPONSIBLE for them, even if it may not be your FAULT. (There may be exceptions in cases where people are truly incapable  of certain things due to things that really are beyond their control, but for most of us, we're really the only ones who have to take responsibility.)",
      "created_utc": 1597109328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0zoh8e",
      "author": "None",
      "body": "I agree with most of what you said, but-\n\n”You didn't choose to have an ED, but you do choose everyday to keep having one”\n\nI don’t totally agree with this. \n\nYes, I can choose not to act out on my ED, but i can’t control my mind that way. I don’t choose to have ED thoughts, but I can choose not to engage in or focus on them. \n\nJust how its frased makes me feel like it says you’re also ”choosing” to have ED thoughts. \nBut maybe u didnt mean the mental part, or u meant that we can choose not to make it worse. Or you meant what you said. Idk. Just my 2 cents",
      "created_utc": 1597065582.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1068lm",
      "author": "FicklePsychologist4",
      "body": "Omfg finally",
      "created_utc": 1597075274.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g10oijr",
      "author": "BluePurslane",
      "body": "Preach.  I love this ted talk ;)  I never recovered until I stopped believing that  it was the fault of society, parents, media, patriarchy, whatever.  And started believing that I had to take one step at a time.  My preferred nuance here is:  people who make unkind weight comments, friends who are on diets, the media, abusive parents and partners and the like are responsible for their behavior.  They should change!  But I'm responsible for my response.",
      "created_utc": 1597084133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g11p6ej",
      "author": "Enduendada",
      "body": "The universe sent this post my way because it knows I needed to hear it. You're right though, it IS empowering to know that you're at the drivers seat. Thanks.",
      "created_utc": 1597102150.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1042fc",
      "author": "None",
      "body": "I saw a lot of instances of number 1 in treatment. I never understood how some people would not eat when they were in a higher level of care. It was never easy for me, but I did it because I wanted to get out of the dark place I was in and get out of treatment eventually. I got in trouble several times for stating just that, but some of the other patients were coddled and pandered to. It's so frustrating when you're in treatment and really engage in the hard aspects of it and others around you refuse to put in the effort.",
      "created_utc": 1597074183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hr74f9g",
      "author": "kookie_doe",
      "body": "Yes yes yes..a thousand times this!!",
      "created_utc": 1641291939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0zmhcf",
      "author": "internerderner2",
      "body": "To be completely honest, sometimes I think this passive language is even counterproductive. I am not a poor sweet honey child who can't stand hard stuff and needs to be pampered. I am an adult. I don't need to be sheltered by the horrors of the world. I have the resources to deal.\n\nBut again, that's really just me. And I understand that some people are very very fragile and may need something different to avoid collapsing. There's also there's a fine line between \"tough talk\" and \"needlessly being a prick\".",
      "created_utc": 1597064227.0,
      "score": 32,
      "context": [
        {
          "id": "g0zla74",
          "author": "None",
          "body": "I think many people approach recovery as --) I will go to treatment or therapy and that will eliminate whatever drives my ED behaviors and I will naturally stop doing them. \n\nUnfortunately, early to middling - and sometimes even long, established - recovery involves wanting to engage in behaviors but making the active decision not to. It's learning that having an urge or experiencing negative emotions and thoughts around that urge do not have to lead to an action. Most humans suck at prioritizing long term benefits over short term gains though so it's natural to go back to disordered behaviors that alleviate suffering NOW versus having hope that experiencing suffering for weeks or months or even years will eventually lead to a better outcome.\n\nBut yeah. Lots of passive language here and also in other recovery spaces.",
          "created_utc": 1597063390.0
        }
      ]
    },
    {
      "id": "g10fr2n",
      "author": "internerderner2",
      "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
      "created_utc": 1597079931.0,
      "score": 8,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        }
      ]
    },
    {
      "id": "g10hwpn",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1597080963.0,
      "score": 3,
      "context": [
        {
          "id": "g0zn5dv",
          "author": "xleabrax",
          "body": "Yes!! I’d like to add that tough love is also very needed in recovery and we all need a reality check - this is why I like Tabitha Farrar, she just cuts the crap with it because what we are engaging with at the end of the day is something so irrational and our relationship with food shouldn’t be complicated \n\n(Due to being under 18) my treatment team are trying their best and I am truly grateful for them but the sappy ways they try to convince me to eat just doesn’t do anything, I would like to be told my ED is stupid and to just eat the damn crisps! Haha (obviously this is different for everyone but I like the more realistic direct approach)",
          "created_utc": 1597064688.0
        }
      ]
    },
    {
      "id": "g11nqsr",
      "author": "internerderner2",
      "body": "I don't want my post to be interpreted as \"man up\". I'm very against this kind of gender stereotypes :) and I know how lonely and shameful it feels to be a guy with an ED. But the point is not to harden up and stop whining, the point is just realizing that you have all you need to change this situation, and that taking responsibility doesn't mean playing a blame game - it doesn't mean wallowing in self-pity because you were too much of a dumb shit to change. It means knowing that however shitty, unfair and miserable it might feel, it is your problem and only you can get out of it. It means accepting that no one is forcing you to engage in behaviours and you can actually take steps to stop. Part of this awareness can also mean being humble enough to recognize that you're not accountable, or that you need help, or that you do not feel like taking those steps just yet (and maybe do not even want to). \n\nIt's not my intention to break anyone down and calling people out for fun. What I want to do is to convey the message that no matter how helpless and desperate you feel at the moment, no matter how out of control it seems, it's not out of your control. You have a choice. You have a way out. And you can choose to follow that way out.\n\nFor me personally, once I realized that, it was like a gate had opened - a new world of possibilities. But of course it was also bittersweet, because it meant that the next steps were up to *me* and *me only* and I could no longer convince myself that I had no other alternative and that I couldn't do anything about it.",
      "created_utc": 1597101384.0,
      "score": 3,
      "context": [
        {
          "id": "g11i0yz",
          "author": "wanderlustcub",
          "body": "I feel that there are many different ways to climb the mountain of recovery. What works for you may not work for me, or for someone else. \n\nA combative, \"this is reality, grow up\"  approach works for some people, but for others, it just creates a mess. So, while I agree with aspects of this, I also know that there is no \"one size fits all\" approach to recovery and being told to harden up is in itself toxic.   \n\n\nTrust me, as a guy with an eating disorder, being told to \"toughen up,\" \"be a man,\" \"stop being a pussy,\"\"This isn't a man thing,\"  is harmful and destructive. Let's not replace one form of abuse with another.    \n\n\nThis goes beyond people with eating disorders, it is a human reaction.   \n\n\nEmpowerment is essential for recovery, but we don't need to break people down like the military in order to do it. And just telling someone that \"You just need to quit all the excuses\" or \"Your triggers are your problem, figure it out\" is quite detrimental when the person is not in the right space to accept that information.   \n\n\nI am glad that straight, blunt talk works for you, but it is not necessary the best for everyone, and there is never just a single solution to mental health.",
          "created_utc": 1597098422.0
        }
      ]
    },
    {
      "id": "g10m5b9",
      "author": "internerderner2",
      "body": "Thank you for sharing your experience and for rephrasing, probably in a better and more articulate way, what I was trying to express. :)",
      "created_utc": 1597082990.0,
      "score": 3,
      "context": [
        {
          "id": "g10fouq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597079903.0
        }
      ]
    },
    {
      "id": "g120j8p",
      "author": "None",
      "body": "And honestly, I’m very surprised to see so much agreement with this idea in this community. Do folks not experience compulsion in connection with their behaviors? When I was under the most stress in the past I’ve unfortunately rationalized the behaviors so seamlessly that it felt like the only reasonable choice to engage. I have trouble identifying what changes in my life have allowed me to step back from that place at certain times, but for me it isn’t always the case that there was a moment to decide whether to listen to the thoughts. For me that wasn’t until much later in recovery.",
      "created_utc": 1597108487.0,
      "score": 2,
      "context": [
        {
          "id": "g0zoh8e",
          "author": "None",
          "body": "I agree with most of what you said, but-\n\n”You didn't choose to have an ED, but you do choose everyday to keep having one”\n\nI don’t totally agree with this. \n\nYes, I can choose not to act out on my ED, but i can’t control my mind that way. I don’t choose to have ED thoughts, but I can choose not to engage in or focus on them. \n\nJust how its frased makes me feel like it says you’re also ”choosing” to have ED thoughts. \nBut maybe u didnt mean the mental part, or u meant that we can choose not to make it worse. Or you meant what you said. Idk. Just my 2 cents",
          "created_utc": 1597065582.0
        }
      ]
    },
    {
      "id": "g0zox66",
      "author": "internerderner2",
      "body": "As Tabitha Farrar once said in her videos, you can't control your brain bringing up the thought, but you can choose not to believe the thought and not to dwell on it. In other words, you cannot help feeling shit after eating if that's the reaction your brain has practiced over the years, but you can choose how to respond to that feeling. Just as for the first few times flying you may not be able to help but having an instinctive moment of dread when your plane takes off, but you also know that you don't really *believe* in that dread.\n\nWhen I say \"you choose to keep having one\", I mean that the choices you make are conductive to you keeping having an ED. Of course you can't just stop having an ED overnight (oh, I wish...).",
      "created_utc": 1597065872.0,
      "score": 6,
      "context": [
        {
          "id": "g0zoh8e",
          "author": "None",
          "body": "I agree with most of what you said, but-\n\n”You didn't choose to have an ED, but you do choose everyday to keep having one”\n\nI don’t totally agree with this. \n\nYes, I can choose not to act out on my ED, but i can’t control my mind that way. I don’t choose to have ED thoughts, but I can choose not to engage in or focus on them. \n\nJust how its frased makes me feel like it says you’re also ”choosing” to have ED thoughts. \nBut maybe u didnt mean the mental part, or u meant that we can choose not to make it worse. Or you meant what you said. Idk. Just my 2 cents",
          "created_utc": 1597065582.0
        }
      ]
    },
    {
      "id": "g0zmssm",
      "author": "None",
      "body": "I used to like to point out when people were using passive language to describe engaging in behaviors while in recovery but the usual reply was \"thanks for making me feel bad about having an ED.\" I probably suck at that fine line stuff. :p",
      "created_utc": 1597064448.0,
      "score": 8,
      "context": [
        {
          "id": "g0zla74",
          "author": "None",
          "body": "I think many people approach recovery as --) I will go to treatment or therapy and that will eliminate whatever drives my ED behaviors and I will naturally stop doing them. \n\nUnfortunately, early to middling - and sometimes even long, established - recovery involves wanting to engage in behaviors but making the active decision not to. It's learning that having an urge or experiencing negative emotions and thoughts around that urge do not have to lead to an action. Most humans suck at prioritizing long term benefits over short term gains though so it's natural to go back to disordered behaviors that alleviate suffering NOW versus having hope that experiencing suffering for weeks or months or even years will eventually lead to a better outcome.\n\nBut yeah. Lots of passive language here and also in other recovery spaces.",
          "created_utc": 1597063390.0
        },
        {
          "id": "g0zmhcf",
          "author": "internerderner2",
          "body": "To be completely honest, sometimes I think this passive language is even counterproductive. I am not a poor sweet honey child who can't stand hard stuff and needs to be pampered. I am an adult. I don't need to be sheltered by the horrors of the world. I have the resources to deal.\n\nBut again, that's really just me. And I understand that some people are very very fragile and may need something different to avoid collapsing. There's also there's a fine line between \"tough talk\" and \"needlessly being a prick\".",
          "created_utc": 1597064227.0
        }
      ]
    },
    {
      "id": "g11icsc",
      "author": "wanderlustcub",
      "body": "I think you hit the nail here. Depending on where a person is in their ED, tough talk can easily be seen as abusive. \n\nI think that Tough Talk should be in the tool kit of recovery, but not the first tool used, or even one that is used most often.",
      "created_utc": 1597098584.0,
      "score": 4,
      "context": [
        {
          "id": "g0zla74",
          "author": "None",
          "body": "I think many people approach recovery as --) I will go to treatment or therapy and that will eliminate whatever drives my ED behaviors and I will naturally stop doing them. \n\nUnfortunately, early to middling - and sometimes even long, established - recovery involves wanting to engage in behaviors but making the active decision not to. It's learning that having an urge or experiencing negative emotions and thoughts around that urge do not have to lead to an action. Most humans suck at prioritizing long term benefits over short term gains though so it's natural to go back to disordered behaviors that alleviate suffering NOW versus having hope that experiencing suffering for weeks or months or even years will eventually lead to a better outcome.\n\nBut yeah. Lots of passive language here and also in other recovery spaces.",
          "created_utc": 1597063390.0
        },
        {
          "id": "g0zmhcf",
          "author": "internerderner2",
          "body": "To be completely honest, sometimes I think this passive language is even counterproductive. I am not a poor sweet honey child who can't stand hard stuff and needs to be pampered. I am an adult. I don't need to be sheltered by the horrors of the world. I have the resources to deal.\n\nBut again, that's really just me. And I understand that some people are very very fragile and may need something different to avoid collapsing. There's also there's a fine line between \"tough talk\" and \"needlessly being a prick\".",
          "created_utc": 1597064227.0
        }
      ]
    },
    {
      "id": "g122ert",
      "author": "DartInTheDark",
      "body": "100 percent agree with this. I've heard things like this in recovery programs: \"Relapses will happen. They're inevitable. Figure out ahead of time how to deal with them after.\" No, that just creates a mindset where you can choose to fail when you want to and call it a normal part of the recovery process.",
      "created_utc": 1597109538.0,
      "score": 4,
      "context": [
        {
          "id": "g0zla74",
          "author": "None",
          "body": "I think many people approach recovery as --) I will go to treatment or therapy and that will eliminate whatever drives my ED behaviors and I will naturally stop doing them. \n\nUnfortunately, early to middling - and sometimes even long, established - recovery involves wanting to engage in behaviors but making the active decision not to. It's learning that having an urge or experiencing negative emotions and thoughts around that urge do not have to lead to an action. Most humans suck at prioritizing long term benefits over short term gains though so it's natural to go back to disordered behaviors that alleviate suffering NOW versus having hope that experiencing suffering for weeks or months or even years will eventually lead to a better outcome.\n\nBut yeah. Lots of passive language here and also in other recovery spaces.",
          "created_utc": 1597063390.0
        },
        {
          "id": "g0zmhcf",
          "author": "internerderner2",
          "body": "To be completely honest, sometimes I think this passive language is even counterproductive. I am not a poor sweet honey child who can't stand hard stuff and needs to be pampered. I am an adult. I don't need to be sheltered by the horrors of the world. I have the resources to deal.\n\nBut again, that's really just me. And I understand that some people are very very fragile and may need something different to avoid collapsing. There's also there's a fine line between \"tough talk\" and \"needlessly being a prick\".",
          "created_utc": 1597064227.0
        }
      ]
    },
    {
      "id": "g10g32d",
      "author": "taika2112",
      "body": "I agree, but I think that power and acceptance can come with supportive language.",
      "created_utc": 1597080090.0,
      "score": 11,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        }
      ]
    },
    {
      "id": "g1168xe",
      "author": "xleabrax",
      "body": "Yes! while my family are very supportive with my wishes, for me mentally it’s been very hard to distinguish rational and irrational thoughts so having my family members snap me into reality is a big help, I will soon have to learn and believe what I am telling myself :)",
      "created_utc": 1597092682.0,
      "score": 1,
      "context": [
        {
          "id": "g0zn5dv",
          "author": "xleabrax",
          "body": "Yes!! I’d like to add that tough love is also very needed in recovery and we all need a reality check - this is why I like Tabitha Farrar, she just cuts the crap with it because what we are engaging with at the end of the day is something so irrational and our relationship with food shouldn’t be complicated \n\n(Due to being under 18) my treatment team are trying their best and I am truly grateful for them but the sappy ways they try to convince me to eat just doesn’t do anything, I would like to be told my ED is stupid and to just eat the damn crisps! Haha (obviously this is different for everyone but I like the more realistic direct approach)",
          "created_utc": 1597064688.0
        },
        {
          "id": "g10hwpn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597080963.0
        }
      ]
    },
    {
      "id": "g11rpad",
      "author": "wanderlustcub",
      "body": "I agree with you. I think many issues surrounding ED are also wrapped in self-worth, self-identity, and how others view you, and that lens can be applied differently for different people. \n\nI can only speak for myself, but I personally find that I am my own worst \"tough talk\" person. Because I take out the failures that I see in my self (ED included) and use that \"tough talk\" to destroy myself, and use it to advanced my self-abuse. \n\nAnd for me, that tough talk is part of my cycle. I tough talk myself into starving because it is the only way I can control my weight. I use other people's \"tough talk\" as a way to bolster my own shitty thoughts about myself, and that tough talk then becomes internalised. \n\n(I am using this mostly as an example, this was some of the behavior I have, and fight against on the daily) \n\n> \"It is my actions that made me fat, and therefore, I must take the responsibility for that and change it, and the only way I can change it is to starve myself because otherwise I will continually fail and continue to gain weight. I cannot just \"stop eating\" I must do this because otherwise, I am lazy, weak, and can't control myself. And only I can do this because no one is going to help me lose weight. And Only I know how best to lose weight for me, because I have tried \"the right way\" before and always fail.\" \n\nAnd then when I do restrict, starve, and lose weight, that tough talk is replaced by encouragement, and people being happy I lose weight. I do not get tough talk from others when I am starving (outside my husband who knows what I am doing), so why would tough talk get me out of losing weight when it is what I want? \n\nFor me, if anyone was tough on me, I was simply tougher on myself as a result and it feeds into my ED. My therapist identified that I didn't need tough love, I just needed love.  And having the grace and kindness to not only forgive myself for what I have done to myself, but also give you the permission to recover. For me, that was how I had to empower myself. Not with tough talk, but with a soft touch. \n\nIt is likely that my experience is different because I am a guy and the expectation is different for men than it is for women, so I can take that on, I do have a blind spot because I only know how my therapists have worked with me, and I haven't seen how they work with women. \n\nFor the record, I am often that \"tough love\" friend. Who will listen, and then break things down quite bluntly because I hate inaction. I hate wallowing for the sake of wallowing. I try to move things forward, and it is that personality tick of mine that pushes myself into really extreme situations with myself because I am just harsh and tough on myself at base. I have seen that tough talk work and backfire. I try my best to use my tough love to empower people so that they don't feel helpless, but it can be difficult. \n\nAnd I agree, there is always a way out, but that is difficult to say to someone who is so malnourished that they are not thinking correctly, and is exacerbating all of their negative thoughts. It can also lead to suicidal thoughts, so I worry about that phrasing. \n\nSo, I circle back to my original point - There are many paths to recovery, and tough talk can be an effective tool when used correctly and at the right point in the recovery process. But it is not the universal tool that can be used for every occasion. \n\nThank you for the discussion, I think this is a great thing for everyone to be talking about.",
      "created_utc": 1597103534.0,
      "score": 2,
      "context": [
        {
          "id": "g11i0yz",
          "author": "wanderlustcub",
          "body": "I feel that there are many different ways to climb the mountain of recovery. What works for you may not work for me, or for someone else. \n\nA combative, \"this is reality, grow up\"  approach works for some people, but for others, it just creates a mess. So, while I agree with aspects of this, I also know that there is no \"one size fits all\" approach to recovery and being told to harden up is in itself toxic.   \n\n\nTrust me, as a guy with an eating disorder, being told to \"toughen up,\" \"be a man,\" \"stop being a pussy,\"\"This isn't a man thing,\"  is harmful and destructive. Let's not replace one form of abuse with another.    \n\n\nThis goes beyond people with eating disorders, it is a human reaction.   \n\n\nEmpowerment is essential for recovery, but we don't need to break people down like the military in order to do it. And just telling someone that \"You just need to quit all the excuses\" or \"Your triggers are your problem, figure it out\" is quite detrimental when the person is not in the right space to accept that information.   \n\n\nI am glad that straight, blunt talk works for you, but it is not necessary the best for everyone, and there is never just a single solution to mental health.",
          "created_utc": 1597098422.0
        },
        {
          "id": "g11nqsr",
          "author": "internerderner2",
          "body": "I don't want my post to be interpreted as \"man up\". I'm very against this kind of gender stereotypes :) and I know how lonely and shameful it feels to be a guy with an ED. But the point is not to harden up and stop whining, the point is just realizing that you have all you need to change this situation, and that taking responsibility doesn't mean playing a blame game - it doesn't mean wallowing in self-pity because you were too much of a dumb shit to change. It means knowing that however shitty, unfair and miserable it might feel, it is your problem and only you can get out of it. It means accepting that no one is forcing you to engage in behaviours and you can actually take steps to stop. Part of this awareness can also mean being humble enough to recognize that you're not accountable, or that you need help, or that you do not feel like taking those steps just yet (and maybe do not even want to). \n\nIt's not my intention to break anyone down and calling people out for fun. What I want to do is to convey the message that no matter how helpless and desperate you feel at the moment, no matter how out of control it seems, it's not out of your control. You have a choice. You have a way out. And you can choose to follow that way out.\n\nFor me personally, once I realized that, it was like a gate had opened - a new world of possibilities. But of course it was also bittersweet, because it meant that the next steps were up to *me* and *me only* and I could no longer convince myself that I had no other alternative and that I couldn't do anything about it.",
          "created_utc": 1597101384.0
        }
      ]
    },
    {
      "id": "g10gc8h",
      "author": "internerderner2",
      "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
      "created_utc": 1597080212.0,
      "score": 6,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        }
      ]
    },
    {
      "id": "g139dja",
      "author": "internerderner2",
      "body": "Thank you for contributing as well. You raised really insightful points. :)",
      "created_utc": 1597143472.0,
      "score": 1,
      "context": [
        {
          "id": "g11i0yz",
          "author": "wanderlustcub",
          "body": "I feel that there are many different ways to climb the mountain of recovery. What works for you may not work for me, or for someone else. \n\nA combative, \"this is reality, grow up\"  approach works for some people, but for others, it just creates a mess. So, while I agree with aspects of this, I also know that there is no \"one size fits all\" approach to recovery and being told to harden up is in itself toxic.   \n\n\nTrust me, as a guy with an eating disorder, being told to \"toughen up,\" \"be a man,\" \"stop being a pussy,\"\"This isn't a man thing,\"  is harmful and destructive. Let's not replace one form of abuse with another.    \n\n\nThis goes beyond people with eating disorders, it is a human reaction.   \n\n\nEmpowerment is essential for recovery, but we don't need to break people down like the military in order to do it. And just telling someone that \"You just need to quit all the excuses\" or \"Your triggers are your problem, figure it out\" is quite detrimental when the person is not in the right space to accept that information.   \n\n\nI am glad that straight, blunt talk works for you, but it is not necessary the best for everyone, and there is never just a single solution to mental health.",
          "created_utc": 1597098422.0
        },
        {
          "id": "g11nqsr",
          "author": "internerderner2",
          "body": "I don't want my post to be interpreted as \"man up\". I'm very against this kind of gender stereotypes :) and I know how lonely and shameful it feels to be a guy with an ED. But the point is not to harden up and stop whining, the point is just realizing that you have all you need to change this situation, and that taking responsibility doesn't mean playing a blame game - it doesn't mean wallowing in self-pity because you were too much of a dumb shit to change. It means knowing that however shitty, unfair and miserable it might feel, it is your problem and only you can get out of it. It means accepting that no one is forcing you to engage in behaviours and you can actually take steps to stop. Part of this awareness can also mean being humble enough to recognize that you're not accountable, or that you need help, or that you do not feel like taking those steps just yet (and maybe do not even want to). \n\nIt's not my intention to break anyone down and calling people out for fun. What I want to do is to convey the message that no matter how helpless and desperate you feel at the moment, no matter how out of control it seems, it's not out of your control. You have a choice. You have a way out. And you can choose to follow that way out.\n\nFor me personally, once I realized that, it was like a gate had opened - a new world of possibilities. But of course it was also bittersweet, because it meant that the next steps were up to *me* and *me only* and I could no longer convince myself that I had no other alternative and that I couldn't do anything about it.",
          "created_utc": 1597101384.0
        },
        {
          "id": "g11rpad",
          "author": "wanderlustcub",
          "body": "I agree with you. I think many issues surrounding ED are also wrapped in self-worth, self-identity, and how others view you, and that lens can be applied differently for different people. \n\nI can only speak for myself, but I personally find that I am my own worst \"tough talk\" person. Because I take out the failures that I see in my self (ED included) and use that \"tough talk\" to destroy myself, and use it to advanced my self-abuse. \n\nAnd for me, that tough talk is part of my cycle. I tough talk myself into starving because it is the only way I can control my weight. I use other people's \"tough talk\" as a way to bolster my own shitty thoughts about myself, and that tough talk then becomes internalised. \n\n(I am using this mostly as an example, this was some of the behavior I have, and fight against on the daily) \n\n> \"It is my actions that made me fat, and therefore, I must take the responsibility for that and change it, and the only way I can change it is to starve myself because otherwise I will continually fail and continue to gain weight. I cannot just \"stop eating\" I must do this because otherwise, I am lazy, weak, and can't control myself. And only I can do this because no one is going to help me lose weight. And Only I know how best to lose weight for me, because I have tried \"the right way\" before and always fail.\" \n\nAnd then when I do restrict, starve, and lose weight, that tough talk is replaced by encouragement, and people being happy I lose weight. I do not get tough talk from others when I am starving (outside my husband who knows what I am doing), so why would tough talk get me out of losing weight when it is what I want? \n\nFor me, if anyone was tough on me, I was simply tougher on myself as a result and it feeds into my ED. My therapist identified that I didn't need tough love, I just needed love.  And having the grace and kindness to not only forgive myself for what I have done to myself, but also give you the permission to recover. For me, that was how I had to empower myself. Not with tough talk, but with a soft touch. \n\nIt is likely that my experience is different because I am a guy and the expectation is different for men than it is for women, so I can take that on, I do have a blind spot because I only know how my therapists have worked with me, and I haven't seen how they work with women. \n\nFor the record, I am often that \"tough love\" friend. Who will listen, and then break things down quite bluntly because I hate inaction. I hate wallowing for the sake of wallowing. I try to move things forward, and it is that personality tick of mine that pushes myself into really extreme situations with myself because I am just harsh and tough on myself at base. I have seen that tough talk work and backfire. I try my best to use my tough love to empower people so that they don't feel helpless, but it can be difficult. \n\nAnd I agree, there is always a way out, but that is difficult to say to someone who is so malnourished that they are not thinking correctly, and is exacerbating all of their negative thoughts. It can also lead to suicidal thoughts, so I worry about that phrasing. \n\nSo, I circle back to my original point - There are many paths to recovery, and tough talk can be an effective tool when used correctly and at the right point in the recovery process. But it is not the universal tool that can be used for every occasion. \n\nThank you for the discussion, I think this is a great thing for everyone to be talking about.",
          "created_utc": 1597103534.0
        }
      ]
    },
    {
      "id": "g10h5mg",
      "author": "taika2112",
      "body": "I know where you're coming from, and there are times when I know I want someone to stop beating around the bush and say something like, \"You're hurting yourself and it's not okay\". \n\nSo on the surface, I agree. I'm just also questioning whether part of the reason I think/feel that way is because so much of my inner monologue is a harsh, stern voice.",
      "created_utc": 1597080603.0,
      "score": 7,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        },
        {
          "id": "g10gc8h",
          "author": "internerderner2",
          "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
          "created_utc": 1597080212.0
        }
      ]
    },
    {
      "id": "g10hi45",
      "author": "internerderner2",
      "body": "I'm speculating here because I know nothing about you really, but maybe it's a different type of harsh voice. To use a metaphor, I imagine that the harsh voice of an evil boss constantly treating you like crap and making your life miserable is different from the harsh but loving voice of your mom telling you that you need to GTFO and find a new job ASAP. Isn't it? :)",
      "created_utc": 1597080769.0,
      "score": 4,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        },
        {
          "id": "g10gc8h",
          "author": "internerderner2",
          "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
          "created_utc": 1597080212.0
        },
        {
          "id": "g10h5mg",
          "author": "taika2112",
          "body": "I know where you're coming from, and there are times when I know I want someone to stop beating around the bush and say something like, \"You're hurting yourself and it's not okay\". \n\nSo on the surface, I agree. I'm just also questioning whether part of the reason I think/feel that way is because so much of my inner monologue is a harsh, stern voice.",
          "created_utc": 1597080603.0
        }
      ]
    },
    {
      "id": "g10ieas",
      "author": "taika2112",
      "body": "Yeah, I can see that.",
      "created_utc": 1597081197.0,
      "score": 4,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        },
        {
          "id": "g10gc8h",
          "author": "internerderner2",
          "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
          "created_utc": 1597080212.0
        },
        {
          "id": "g10h5mg",
          "author": "taika2112",
          "body": "I know where you're coming from, and there are times when I know I want someone to stop beating around the bush and say something like, \"You're hurting yourself and it's not okay\". \n\nSo on the surface, I agree. I'm just also questioning whether part of the reason I think/feel that way is because so much of my inner monologue is a harsh, stern voice.",
          "created_utc": 1597080603.0
        },
        {
          "id": "g10hi45",
          "author": "internerderner2",
          "body": "I'm speculating here because I know nothing about you really, but maybe it's a different type of harsh voice. To use a metaphor, I imagine that the harsh voice of an evil boss constantly treating you like crap and making your life miserable is different from the harsh but loving voice of your mom telling you that you need to GTFO and find a new job ASAP. Isn't it? :)",
          "created_utc": 1597080769.0
        }
      ]
    },
    {
      "id": "g11p540",
      "author": "DedicatedtoDistance",
      "body": "I totally agree with the differentiation of these voices. The problem is these voices get confused and some people don’t know how to have a stern loving voice. \n\nI have been working through recovery for awhile and sometimes I mess up cause I’m human. But the only way to keep moving forward is to forgive myself. I acknowledge that I fucked up but I also remind myself that it doesn’t make me weak, or a bad person, or incapable, or worthless. Because you will never get better if you don’t believe it’s possible/your capable of it and worth it.",
      "created_utc": 1597102131.0,
      "score": 2,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        },
        {
          "id": "g10gc8h",
          "author": "internerderner2",
          "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
          "created_utc": 1597080212.0
        },
        {
          "id": "g10h5mg",
          "author": "taika2112",
          "body": "I know where you're coming from, and there are times when I know I want someone to stop beating around the bush and say something like, \"You're hurting yourself and it's not okay\". \n\nSo on the surface, I agree. I'm just also questioning whether part of the reason I think/feel that way is because so much of my inner monologue is a harsh, stern voice.",
          "created_utc": 1597080603.0
        },
        {
          "id": "g10hi45",
          "author": "internerderner2",
          "body": "I'm speculating here because I know nothing about you really, but maybe it's a different type of harsh voice. To use a metaphor, I imagine that the harsh voice of an evil boss constantly treating you like crap and making your life miserable is different from the harsh but loving voice of your mom telling you that you need to GTFO and find a new job ASAP. Isn't it? :)",
          "created_utc": 1597080769.0
        }
      ]
    },
    {
      "id": "g11pdd3",
      "author": "internerderner2",
      "body": ">But the only way to keep moving forward is to forgive myself. I acknowledge that I fucked up but I also remind myself that it doesn’t make me weak, or a bad person, or incapable, or worthless.\n\nExactly. Recognizing you are responsible for your own actions doesn't mean beating yourself up when you take the \"wrong\" ones (\"wrong\" may not be the best word choice here but bear with me). It simply means saying \"okay, I fucked up and it sucks - but I can move on from here and next time I'll do better\". Everyone fucks up all the time. That's how we learn.",
      "created_utc": 1597102255.0,
      "score": 2,
      "context": [
        {
          "id": "g10507y",
          "author": "taika2112",
          "body": "Part of me agrees, but part of me also thinks that beating ourselves up is very much part and parcel with our ED in the first place. It's not like we need help disliking ourselves.",
          "created_utc": 1597074659.0
        },
        {
          "id": "g10fr2n",
          "author": "internerderner2",
          "body": "Accepting that you have the power to stop is absolutely not disliking yourself - quite the opposite. It's the first step towards taking back the control of your life. And I believe that it will feel even more of an achievement when you've realized that you CAN do it. You will like yourself even more for that.",
          "created_utc": 1597079931.0
        },
        {
          "id": "g10g32d",
          "author": "taika2112",
          "body": "I agree, but I think that power and acceptance can come with supportive language.",
          "created_utc": 1597080090.0
        },
        {
          "id": "g10gc8h",
          "author": "internerderner2",
          "body": "To be honest, I believe that being honest and blunt IS being supportive, simply because I believe it's the only way that can lead people to recover.",
          "created_utc": 1597080212.0
        },
        {
          "id": "g10h5mg",
          "author": "taika2112",
          "body": "I know where you're coming from, and there are times when I know I want someone to stop beating around the bush and say something like, \"You're hurting yourself and it's not okay\". \n\nSo on the surface, I agree. I'm just also questioning whether part of the reason I think/feel that way is because so much of my inner monologue is a harsh, stern voice.",
          "created_utc": 1597080603.0
        },
        {
          "id": "g10hi45",
          "author": "internerderner2",
          "body": "I'm speculating here because I know nothing about you really, but maybe it's a different type of harsh voice. To use a metaphor, I imagine that the harsh voice of an evil boss constantly treating you like crap and making your life miserable is different from the harsh but loving voice of your mom telling you that you need to GTFO and find a new job ASAP. Isn't it? :)",
          "created_utc": 1597080769.0
        },
        {
          "id": "g11p540",
          "author": "DedicatedtoDistance",
          "body": "I totally agree with the differentiation of these voices. The problem is these voices get confused and some people don’t know how to have a stern loving voice. \n\nI have been working through recovery for awhile and sometimes I mess up cause I’m human. But the only way to keep moving forward is to forgive myself. I acknowledge that I fucked up but I also remind myself that it doesn’t make me weak, or a bad person, or incapable, or worthless. Because you will never get better if you don’t believe it’s possible/your capable of it and worth it.",
          "created_utc": 1597102131.0
        }
      ]
    }
  ]
}