{
  "id": "i7i2g6",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1597108260.0,
  "title": "I gained an interesting perspective about weight gain",
  "selftext": "My brother is trying to gain weight. His body type, height and metabolism makes it very difficult for him. Recently, he’s been working out to put on muscle  and he found a diet to help people like him gain weight. He was over the moon when he saw that he gained 15 pounds and was gaining muscle as well. Like, he was literally jumping for joy. \n\nA few nights ago, my sister brought it up to him. She told him that he was lucky to be the skinny one in our family, that he should stop the weight gain diet he’s on, etc. He got angry. Like the red in the face, sobbing hysterically and punching the wall kind of angry. It startled me to see him get so mad, I had never known how big of an insecurity this was for him. \n\nThis experience made me realize how close-minded I am. For so long, I’ve believed that skinniness would equal happiness, not just for myself, but for everyone around me. My eating disorder sort of made me forget that there are people who aren’t happy to be in a smaller body. For so long, I’ve envied my brother’s body type, wished it was difficult for me to gain weight too. I was confused when he started trying to gain weight, I didn’t know why he would want to do that. Now I realize how shitty that is. \n\nThis was a great perspective shift for me. Being smaller won’t equal happiness. Not for me, not for others in recovery, and certainly not for my brother. I’m happy for him and his increased confidence and I hope he’ll continue to become more comfortable in his own skin.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i7i2g6/i_gained_an_interesting_perspective_about_weight/",
  "score": 90,
  "num_comments": 1,
  "comments": [
    {
      "id": "g12yvoa",
      "author": "None",
      "body": "For me, I will never forget how my mom told me about a colleague of hers who is overweight told a girl in yoga class \"How did you lose weight? I'm so jealous of your body!\" And the girl said \"You're only jealous because you don't know I had cancer\".\n\n\nBeing skinny doesn't equal happiness for sure. I'm most depressed when I'm thin, even if I'm maintaining",
      "created_utc": 1597132933.0,
      "score": 14,
      "context": []
    }
  ]
}