{
  "id": "i8zg5w",
  "subreddit": "fuckeatingdisorders",
  "author": "gardenfaiiri",
  "created_utc": 1597323523.0,
  "title": "The truth about saying “fuck it” to your eating disorder.",
  "selftext": "The truth about saying “fuck it” to and ED is that it is not a one time thing. it’s about saying “fuck it, I’m doing this” and then later saying “you know what, I feel really upset/guilty/angry that I disobeyed my ED thoughts, but fuck it, I refuse to allow myself to just sit with this feeling.”  “fuck it, I kow this feeling will pass and it will be okay.” ,”fuck it, I’m going to distract myself, draw, play a video game, write, rant to strangers on reddit because fuck my ED. I am going to allow myself to have and acknowledge these negative feelings, but I am not going to allow myself to sit in them.”\n\nThe most important thing that I have learnt about recovery, or possibly not even recovery in but just fighting your ED day to day when you decided to challenge rules in the name of getting even a tiny bit better. Is that it is not one moment of commitment, it’s not just saying “fuck it” once and then suddenly your in recovery, doing amazingly well and now never have to deal with the negative thoughts or physical and emotional feelings that come along with the ED. It’s about committing over and over again. \n\nTake my morning as an example:\n Every morning I get up and my ED tells me “just have tea you don’t need to have food for breakfast” \nand I say “fuck it” and then walk into the kitchen and begin making the breakfast I know my recovering body needs.\n “I should leave the milk and sugar out” I think as I start making my cup of tea, \n“fuck it” I say as I put milk straight from the carton (no measuring of course) and two sugars into my cup. \n“Maybe I should measure that yogurt to make sure I’m not eating too much, and also leave the honey out I don’t really like it THAT much, and swap the granola with puffed wheat cereal, it’s not many calories then.”\nNo, “fuck it, I can recognise this as an ED thought and I refuse to engage” then I pour as much yogurt as I damn like into a bowl, and top that with as much honey as I damn like because I do like my yogurt sweetened and it is not an unnecessary extra, next I’ll add as much granola as I damn like because puffed wheat might be less calories but it’s not nearly as tasty and satisfying as granola. But I’m still hungry after that yogurt,\n“Okay that’s enough, now I have to wait 3 hours until I can eat again”.\n“fuck it, I’m hungry, I’m listening to my body and feeding it the energy it needs and is asking for” \n\nI continue to say “fuck it” every time I get the urge to measure, or skimp/skip an ingredient, to intentionally spoil the food, to throw it out while I make some toast. Afterwards I feel a little fuller than I expect, even a little sick and uncomfortable. \n“Well look what I’ve done now, I’m just so greedy and horrible I shouldn’t have eaten that, now I just feel guilty and physically sick, I might as well go and exercise or purge because of this...” “fuck it, this is an ED narrative that I refuse to engage with” and so I proceed to sit down and wait the negative emotions and physical feelings out, I know they will past, I distract myself, I refuse to allow myself to torture myself by stewing in the negativity. I’ll play a video game or watch TV. Ten minutes later I’m so absorbed by the distraction that I barely notice the ED thoughts at all, and I can feel the fullness and discomfort start to pass. \n\nAs you can see I’ve said “fuck it” to my ED and committed to recovery 10+ times before 9am, this whole process happens over and over from the second I wake up to the second I go to bed. “Fuck it, fuck it, fuck it” I tell myself every time I hear an ED thought. It’s not easy, it’s tiring and sometimes I do give in to the urges I’m only human after all. It’s also taken me months to get to a point where I’m able to achieve this success at least 70-80% of the time. \n\nThe truth about saying “fuck it” is that it doesn’t mean that suddenly your ED will disappear, it doesn’t mean that suddenly you know longer have to endure negative feelings surrounding food, body image, and anything else in your life that your ED impacts - After all you are still an individual with an ED, a moment of commitment towards freedom from this does not negate that fact. You’ll need to find your own healthier coping mechanisms to deal with this (are really that is the first part of saying “fuck it”. The truth is while saying “fuck it” may not have instant gratification, it may not take away the shit that is begin human and living with an ED. However what it does do is empower you, if you can say “fuck it” and eat that fear food, or miss that run, or not act on your urge to purge, or really whatever behaviour it may be - even just once. It puts you in control, it proves that you have the power and the ability to say “fuck it” again and again.\n\nSaying “fuck it” the first step in letting the ED go and reclaiming your life back and I urge you all to give it a go, take a chance, who knows, maybe (actually most definitely I can attest to that fact it will be) your life will be better with a few more profanities thrown in.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/i8zg5w/the_truth_about_saying_fuck_it_to_your_eating/",
  "score": 171,
  "num_comments": 18,
  "comments": [
    {
      "id": "g1c05qt",
      "author": "problematicbeing",
      "body": "\"I've said fuck it and committed to recovery 10 times before 9am\"\n\nThis is why recovery is so so hard, you have to make the choice to fight your ED every single day, multiple times a day. Its exhausting and it takes strength. Choosing recovery takes willpower and resilience.",
      "created_utc": 1597330638.0,
      "score": 37,
      "context": []
    },
    {
      "id": "g1bvb6x",
      "author": "Kathireddit",
      "body": "Mad respect. This is the only way to win tbh and I'm proud of you for fighting.\nEvery decision brings you one step closer to recovery until you don't seriously consider the restrictive option anymore.",
      "created_utc": 1597328147.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g1bw9ku",
      "author": "krikein",
      "body": "thanks, I needed this - some people make recovery sound like they just flipped a switch overnight but no, it's a constant fight and you can't let the ED take an inch. it's exhausting, but I hope you stay strong 💖",
      "created_utc": 1597328657.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g1bwhj9",
      "author": "SeattleRN",
      "body": "WOW. This is amazing. Thank you for sharing. ❤️",
      "created_utc": 1597328771.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g1byuqz",
      "author": "Caroline_Directioner",
      "body": "This is incredible.  Thank you so much, I’m definitely going to reread this post when I’m having a hard time in recovery.",
      "created_utc": 1597329990.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g1chz9t",
      "author": "xleabrax",
      "body": "Saying “fuck it” is literally the most used tool in recovery, it adds a comedic affect to it which lightens the situation for me personally:) yesterday I ate Chinese because I was in the “fuck it” mindset I couldn’t be ASKED to deal with the ED thoughts and miss out on one of my favourite takeaways every time an ED thought would pop up I added more food to my plate :) \n\nAs well as in the morning I would normally put butter in my croissant, I had already eaten one without but I said “fuck it” thus I decided to put butter in the last one :) - every time I am in the presence of food saying “fuck it” so it’s basically my mindset most of the time as that is recovery :)",
      "created_utc": 1597338709.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g1ckjuz",
      "author": "rominatooor",
      "body": "This was an amazing read! Thank you so much for this. \n\nI've recently found saying 'fuck it' or  'fuck yea'  or 'fuck you' OUT LOUD when my ED tells me to skip or measure is so powerful. It brings the conscious decision of not listening to my ED voice out of my head and into the world and affirms the new reality I'm building for myself. It makes me feel determined, strong, and resilient!",
      "created_utc": 1597339841.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1cvfca",
      "author": "hello-blue-monday",
      "body": "I needed this, thank you so much.❤️",
      "created_utc": 1597344672.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1dm3qk",
      "author": "planetary-virgo",
      "body": "oh my God. this is a game changer. why didn't anyone tell me about this coping skill??",
      "created_utc": 1597357049.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1dq0bj",
      "author": "RigorousSleeper",
      "body": "YES! Saying f it to exercise is a big one for me on top of the food f-ups. (I now consider an f-up if I give in to an ED thought or behaviour. This was critical) I see someone attractive jogging? F-it, I'm prioritizing rest in recovery. See one of my favourite Youtube work-out series post a new HIIT InTeNse fAt buRn video? F-it, my body needs the fat, in fact it probably would do me some good to put on some more fat.",
      "created_utc": 1597358980.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1cwafs",
      "author": "Sourpatch_kiddo",
      "body": "This is so true!!! It’s a constant decision to say “fuck it” and each time you beat the ED further. and overtime you realize how rewarding it is. Best feeling ever",
      "created_utc": 1597345060.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1eckrj",
      "author": "marathon_runner_",
      "body": "Oooomg this post is ***10/10***. Thank you so much for this. <3",
      "created_utc": 1597371158.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1cwdtm",
      "author": "albz5424",
      "body": "Me too 😌",
      "created_utc": 1597345104.0,
      "score": 1,
      "context": [
        {
          "id": "g1bw9ku",
          "author": "krikein",
          "body": "thanks, I needed this - some people make recovery sound like they just flipped a switch overnight but no, it's a constant fight and you can't let the ED take an inch. it's exhausting, but I hope you stay strong 💖",
          "created_utc": 1597328657.0
        }
      ]
    },
    {
      "id": "g1cnf9c",
      "author": "gardenfaiiri",
      "body": "I love this, it’s amazing, “fuck it” has been a life changing recovery tool. I’m yet to challenge any takeaway other and pizza (for some reason I see pizza as a “safe” takeaway. Might have to get a Chinese this weekend because you’ve reminded me how much I’ve missed it.",
      "created_utc": 1597341077.0,
      "score": 3,
      "context": [
        {
          "id": "g1chz9t",
          "author": "xleabrax",
          "body": "Saying “fuck it” is literally the most used tool in recovery, it adds a comedic affect to it which lightens the situation for me personally:) yesterday I ate Chinese because I was in the “fuck it” mindset I couldn’t be ASKED to deal with the ED thoughts and miss out on one of my favourite takeaways every time an ED thought would pop up I added more food to my plate :) \n\nAs well as in the morning I would normally put butter in my croissant, I had already eaten one without but I said “fuck it” thus I decided to put butter in the last one :) - every time I am in the presence of food saying “fuck it” so it’s basically my mindset most of the time as that is recovery :)",
          "created_utc": 1597338709.0
        }
      ]
    },
    {
      "id": "g1dqgkd",
      "author": "gardenfaiiri",
      "body": "Honestly it’s becoming a favourite. “Fuck it” is so good, so adaptable, so simple. Best thing to happen to my recovery since I reintroduce sliced bread.",
      "created_utc": 1597359209.0,
      "score": 5,
      "context": [
        {
          "id": "g1dm3qk",
          "author": "planetary-virgo",
          "body": "oh my God. this is a game changer. why didn't anyone tell me about this coping skill??",
          "created_utc": 1597357049.0
        }
      ]
    },
    {
      "id": "g1dqym5",
      "author": "gardenfaiiri",
      "body": "Thank you for this comment, I also really struggle with exercising especially now that I’m restricting a whole lot less. Was going to going to get on my treadmill tomorrow because I feel bad about what I ate today. But you know what, I’m with you f-it, tomorrow I will rest because that is what my body needs to recover.",
      "created_utc": 1597359464.0,
      "score": 2,
      "context": [
        {
          "id": "g1dq0bj",
          "author": "RigorousSleeper",
          "body": "YES! Saying f it to exercise is a big one for me on top of the food f-ups. (I now consider an f-up if I give in to an ED thought or behaviour. This was critical) I see someone attractive jogging? F-it, I'm prioritizing rest in recovery. See one of my favourite Youtube work-out series post a new HIIT InTeNse fAt buRn video? F-it, my body needs the fat, in fact it probably would do me some good to put on some more fat.",
          "created_utc": 1597358980.0
        }
      ]
    },
    {
      "id": "g1cow8e",
      "author": "xleabrax",
      "body": "Aww!! I wish pizza was a safe food for me hopefully it’ll become one in the future :D I never developed a huge fear response to Chinese so I thought to challenge TAKEAWAY FOODS it’ll be the best option and work from there :)\n\nI’d like to add that just before writing this, I was given dessert for the first time after dinner which had triggered my ED very much due to what I had earlier today but I just said “fuck it” and ate the whole thing as my ED intended to only eat half of the dessert :)",
      "created_utc": 1597341710.0,
      "score": 3,
      "context": [
        {
          "id": "g1chz9t",
          "author": "xleabrax",
          "body": "Saying “fuck it” is literally the most used tool in recovery, it adds a comedic affect to it which lightens the situation for me personally:) yesterday I ate Chinese because I was in the “fuck it” mindset I couldn’t be ASKED to deal with the ED thoughts and miss out on one of my favourite takeaways every time an ED thought would pop up I added more food to my plate :) \n\nAs well as in the morning I would normally put butter in my croissant, I had already eaten one without but I said “fuck it” thus I decided to put butter in the last one :) - every time I am in the presence of food saying “fuck it” so it’s basically my mindset most of the time as that is recovery :)",
          "created_utc": 1597338709.0
        },
        {
          "id": "g1cnf9c",
          "author": "gardenfaiiri",
          "body": "I love this, it’s amazing, “fuck it” has been a life changing recovery tool. I’m yet to challenge any takeaway other and pizza (for some reason I see pizza as a “safe” takeaway. Might have to get a Chinese this weekend because you’ve reminded me how much I’ve missed it.",
          "created_utc": 1597341077.0
        }
      ]
    },
    {
      "id": "g1d3ffw",
      "author": "gardenfaiiri",
      "body": "Proud of you :)",
      "created_utc": 1597348266.0,
      "score": 1,
      "context": [
        {
          "id": "g1chz9t",
          "author": "xleabrax",
          "body": "Saying “fuck it” is literally the most used tool in recovery, it adds a comedic affect to it which lightens the situation for me personally:) yesterday I ate Chinese because I was in the “fuck it” mindset I couldn’t be ASKED to deal with the ED thoughts and miss out on one of my favourite takeaways every time an ED thought would pop up I added more food to my plate :) \n\nAs well as in the morning I would normally put butter in my croissant, I had already eaten one without but I said “fuck it” thus I decided to put butter in the last one :) - every time I am in the presence of food saying “fuck it” so it’s basically my mindset most of the time as that is recovery :)",
          "created_utc": 1597338709.0
        },
        {
          "id": "g1cnf9c",
          "author": "gardenfaiiri",
          "body": "I love this, it’s amazing, “fuck it” has been a life changing recovery tool. I’m yet to challenge any takeaway other and pizza (for some reason I see pizza as a “safe” takeaway. Might have to get a Chinese this weekend because you’ve reminded me how much I’ve missed it.",
          "created_utc": 1597341077.0
        },
        {
          "id": "g1cow8e",
          "author": "xleabrax",
          "body": "Aww!! I wish pizza was a safe food for me hopefully it’ll become one in the future :D I never developed a huge fear response to Chinese so I thought to challenge TAKEAWAY FOODS it’ll be the best option and work from there :)\n\nI’d like to add that just before writing this, I was given dessert for the first time after dinner which had triggered my ED very much due to what I had earlier today but I just said “fuck it” and ate the whole thing as my ED intended to only eat half of the dessert :)",
          "created_utc": 1597341710.0
        }
      ]
    }
  ]
}