{
  "id": "iazpdb",
  "subreddit": "fuckeatingdisorders",
  "author": "throw_990_away",
  "created_utc": 1597609569.0,
  "title": "I WILL NOT FEEL GUILTY ABOUT HAVING MILK AND SUGAR IN MY MORNING COFFEE",
  "selftext": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\nit’s a really delicious coffee though. It’s a coconut milk latte AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHGGHGHG",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/iazpdb/i_will_not_feel_guilty_about_having_milk_and/",
  "score": 173,
  "num_comments": 5,
  "comments": [
    {
      "id": "g1rw5ta",
      "author": "2young2B4gotten",
      "body": "Enjoy ☕️",
      "created_utc": 1597613408.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g1sc8kb",
      "author": "selfcontrolwya",
      "body": "i finally made the switch from black coffee to putting almond milk and sugar in it and i’m NEVER going back :)",
      "created_utc": 1597622569.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g1s94iz",
      "author": "ZiggyStardustWasHere",
      "body": "Good for the souuuuuuul.",
      "created_utc": 1597620705.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1t05y7",
      "author": "wubih",
      "body": "I support this message!",
      "created_utc": 1597637775.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1up19o",
      "author": "None",
      "body": "This always bothered me! I worked at a somewhat major coffee chain (not Starbucks) for a while a few years ago, and my roommate would always be making snide comments implying that none of the customers are actually drinking coffee. But in reality, our brewed coffee was the main seller by a lot - it was a constantly changing array of beans from different countries, brewed and disposed of every half hour. Of *course* we were all drinking coffee. And some coffees taste great black and unsweetened, some have flavors that pop with sugar, some lend themselves perfectly to cream - it's okay to like whatever you like however you like it, and being a snarky little shit about it benefits no one, but invalidates so many.",
      "created_utc": 1597670018.0,
      "score": 2,
      "context": []
    }
  ]
}