{
  "id": "idb0ql",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1597932764.0,
  "title": "I have a simple goal for this fall.",
  "selftext": "I wish to go to an orchard, pick some apples, do a hayride, wander through a corn maze, and enjoy a donut with some apple cider, just like I used to do as a kid.\n\nI want to do this without starving myself the day before or the day after, and I want to do it without binge eating ten donuts.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/idb0ql/i_have_a_simple_goal_for_this_fall/",
  "score": 103,
  "num_comments": 9,
  "comments": [
    {
      "id": "g27r2ha",
      "author": "anonchicago7",
      "body": "Me too! Just the idea is enough since i highly doubt anything will be open for the season this year. Shame haunted houses are my favorite",
      "created_utc": 1597933180.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g27uzoc",
      "author": "None",
      "body": "Yeah, I’m from upstate NY so Apple cider donuts are practically a way of life. I really want to be able to enjoy some by Halloween without restricting or feeling guilty. Also I want to be able to eat my grandma’s jelly thumbprint cookies by Christmas because they’re my favorite and it wouldn’t be Christmas without them. Plus, my family is Irish and we always exchange the BEST imported candy at Christmas that I don’t want to have to give up.",
      "created_utc": 1597935125.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g287bzd",
      "author": "twerkingslutbee",
      "body": "One thing I want to do is drink hot chocolate without hyperventilating again.",
      "created_utc": 1597940939.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g291qno",
      "author": "alibunn",
      "body": "Fuuuck I’m so ready for fall. Leggings and big sweaters, pots of warm delicious tea, apple picking, carving pumpkins, scarves, scones, PUMPKIN SPICE EVERYTHING omggg\n\nAutumn is my favourite season, your post reminded me of the magic coming! I hope that we will both be able to enjoy this beautiful season coming up without stressing about food 💖",
      "created_utc": 1597954323.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g28ktw1",
      "author": "Sareeee48",
      "body": "This post has the same vibe as my goal lmao... I’m 24 but I wanna go trick or treating, or at least eat some fucking candy (haven’t done in years, even when I took my nephew I just gave it all away because of the anxiety it caused me or it just sat until it was too old to eat) and watch horror movies without restricting the day before and after and hating myself afterwards. And same for thanksgiving and Christmas too! I’m so excited to finally get things for Christmas that aren’t fucking food related for once.",
      "created_utc": 1597947170.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g28z774",
      "author": "Rally4AP19",
      "body": "That's a fantastic goal!  You could make mini goals/steps leading up to the fall to help you achieve it.  For example, last Christmas I had a goal to go rock climbing in red rocks with my partner.  I have always been terrified of eating out because I couldn't track the calories.  Plus, there was the fear of stepping away from the gym for 1.5-2 weeks.  I started by being okay with taking rest days once a week then twice a week.  Grabbing a random doughnut or ice cream with my partner was another small step along with not restricting around doing so.  Then I built up to eating a full meal out more regularly. \n\n\nIt was so worth it!!!!!   I got to enjoy a new experience and be more present in the moment.  My strength and body went back to normal after a week or two.  You can do this!",
      "created_utc": 1597953382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g295cq2",
      "author": "avocantdough",
      "body": "This is such a wonderful goal. Guess what? I know you can do it. I just know it ❤️",
      "created_utc": 1597955796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2a2zqa",
      "author": "m3r3d1th_",
      "body": "What a wonderful goal!! I’m so proud of you",
      "created_utc": 1597972876.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g27wtop",
      "author": "hemlock_cupcakes",
      "body": "Autumn means Beak and Skiff!",
      "created_utc": 1597936000.0,
      "score": 1,
      "context": [
        {
          "id": "g27uzoc",
          "author": "None",
          "body": "Yeah, I’m from upstate NY so Apple cider donuts are practically a way of life. I really want to be able to enjoy some by Halloween without restricting or feeling guilty. Also I want to be able to eat my grandma’s jelly thumbprint cookies by Christmas because they’re my favorite and it wouldn’t be Christmas without them. Plus, my family is Irish and we always exchange the BEST imported candy at Christmas that I don’t want to have to give up.",
          "created_utc": 1597935125.0
        }
      ]
    }
  ]
}