{
  "id": "igdh8n",
  "subreddit": "fuckeatingdisorders",
  "author": "alwayswired",
  "created_utc": 1598366512.0,
  "title": "Everytime i start to eat more, my brother starts calling me fat/a pig as a ‘joke’ and it is killing me.",
  "selftext": "I used to weigh 120 pounds (im 5’9) and felt awful with hair loss, fatigue, cold all the time, no period etc. I decided i was done with feeling like that and started eating more with a goal weight of 130-135 pounds. I now weigh 125 pounds and my brother decided it would be funny to call me fat everytime he sees me. I feel like a dumbass for letting it get to me but my weight is a very sensitive subject and i feel horrible for eating anything at all right now. I asked him to stop multiple times but he doesn’t care. I relapsed back into my ED and haven’t eaten since saturday night and started walking compulsively again. He noticed and just keeps making jokes about it, calling me a fat ugly pig and what not. \n\nI know i should ignore it but its literally the one thing im sensitive about and i cant let it go. I live with my parents and brother so i see him every day. I dont know how to deal, my parents dont care and just tell me to ignore him and my mom just laughs with him and tells me to stop being a baby. \n\nEven when hes not around, i still constantly hear his words and i cant make myself eat anymore without crying and hating myself, i’m stuck.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/igdh8n/everytime_i_start_to_eat_more_my_brother_starts/",
  "score": 136,
  "num_comments": 12,
  "comments": [
    {
      "id": "g2t25wf",
      "author": "problematicbeing",
      "body": "That really sucks dude. I dont get how family can be so cruel, they're supposed to be supportive.\n\nYou're objectively not fat by any standard. And even if you were, fat is not a cuss word, and it doesn't define you. Try to reassure yourself of these things. And try to keep gaining weight despite that because you need to attain full recovery for yourself.  You deserve full freedom from your ed. Keep eating and keep fighting.",
      "created_utc": 1598368138.0,
      "score": 60,
      "context": []
    },
    {
      "id": "g2tddac",
      "author": "kinlinlin",
      "body": "Sorry for cursing, but your brother (and honestly your mom too) can fuck right off. That is so not cool. \nIt's not super clear from your post whether or not your family is aware of your ED, but that shouldn't matter, because their behaviour is unacceptable. \n\nYou need to reach out to your support system right now. It may be wise to disclose your ED to anyone you trust to support you through this process. If that person is an aunt/uncle or grandparent, perhaps you could stay with them for a bit. It may help you get through the worst of this. \n\nUntil then, it sounds like you're just going to have to white- knuckle it. Only talk to your mom when you have to (so as not to give her any reason to call you \"disrespectful\") and don't acknowledge your brother's presence. Don't even look at him. Wear headphones when you have to leave your room so you can't hear his nasty comments. It may be that he's dealing with some poor self-esteem, so he's lashing out to make himself feel better. Or he may just be a mean person. Hard to say. Regardless, you don't deserve to be treated poorly and you do deserve food. \nThe more you're able to nourish your body, the easier it'll be to deal with this bullshit. ❤",
      "created_utc": 1598372805.0,
      "score": 49,
      "context": []
    },
    {
      "id": "g2tg83o",
      "author": "Elle241",
      "body": "Your brother not only sounds like an immature as*hole (sorry not sorry), but it sounds like he might suffer from some seriously disordered views as well if he thinks it’s funny to pick on you about your weight no matter what your size is (and from the sounds of it, you are very thin). He is a bully. \n\nCan you sit down and have a serious conversation with your parents about what you’re going through? And how he is affecting you? Or do you have any other trusted family members you can talk to about this? His behavior is not ok and you deserve to reach out to people who will take you seriously. This is not a joke.",
      "created_utc": 1598374099.0,
      "score": 29,
      "context": []
    },
    {
      "id": "g2tobci",
      "author": "vanillazuella",
      "body": "\"I may be fat but you are stupid and insensitive and nothing solves for that\"-you \n\nRepeat as often as needed",
      "created_utc": 1598377829.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g2tpzvu",
      "author": "I_Love-Lasagna",
      "body": "go up to him and say \"shut the fuck up, talk to me like that again and ill slap the shit outta you\"",
      "created_utc": 1598378626.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g2ugwyo",
      "author": "daintydaisyxo",
      "body": "Sometimes people can heal when some persons aren't around them. What about an inpatient clinic? I don't know where you live but maybe that's an option for you? You really need help and to \"get over it\" isnt easy at all. Thats fucking toxic. I really wish you the best, but I don't think you can recover or start recovery in this circumstances! ♡",
      "created_utc": 1598391700.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2uz1ip",
      "author": "All_Seeka",
      "body": "I wish I could punch your brother in the face but that's uncalled for, just like his remarks about your physical image. I'm torn between telling you to fight fire with fire and tear him down or be the better person. Truly, you don't want to stoop down to his level. So, Be proud, look down on him, even pity him for his ignorant misery, but don't give him the satisfaction. You have come so fucking far, you are what you say you are, others may have opinions on us but it is YOU who decides. I think you are a beautiful person & I HOPE you see this as someone who cares.  I am so sorry your parents do fuck all to help and if they don't mind his language, certainly you can try (if you feel comfortable) standing up for yourself, getting a support system over to help defend you if he does this in front of company, embarrass your shitty parents by telling their friends when they come to visit.\n I'm just spitballing suggestions here because I know it must be hell walking on eggshells in what should be your safe home. You are more than what others have called you, you are more than you give yourself credit for, you have endurance he couldn't understand, willpower he does not possess and the self-control not to flip out on him. You are better than you know and stronger than you realize.",
      "created_utc": 1598401519.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2v8m1l",
      "author": "Stevia-Man911223",
      "body": "I don't know what to tell you about your brother maybe he has inscurties himself and is putting his problems on you , maybe he grew up rough or something , so i don't know the whole story so i can't give you advice but to ignore him , in the long term your health is the most important thing , more important than family etc... \n\n&#x200B;\n\nbut what i can tell you is to relax your at 125 pounds now there is no reason to be afraid of getting fat , you would have to eat massive amounts of calories for a long long long time to get even skinny fat , just relax enjoy having a lot more flexibility with your food  , what your afraid of will not happen to you i know its not easy but its just a reminder  GL",
      "created_utc": 1598406789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2tzwsv",
      "author": "CozyJumpers",
      "body": "Seconding this - not only is your brother an asshole, but your parents are complicit in this by just laughing along or ignoring it. I'm sorry your family is such a pile of garbage, I hope you can get away from them soon.",
      "created_utc": 1598383356.0,
      "score": 10,
      "context": [
        {
          "id": "g2tddac",
          "author": "kinlinlin",
          "body": "Sorry for cursing, but your brother (and honestly your mom too) can fuck right off. That is so not cool. \nIt's not super clear from your post whether or not your family is aware of your ED, but that shouldn't matter, because their behaviour is unacceptable. \n\nYou need to reach out to your support system right now. It may be wise to disclose your ED to anyone you trust to support you through this process. If that person is an aunt/uncle or grandparent, perhaps you could stay with them for a bit. It may help you get through the worst of this. \n\nUntil then, it sounds like you're just going to have to white- knuckle it. Only talk to your mom when you have to (so as not to give her any reason to call you \"disrespectful\") and don't acknowledge your brother's presence. Don't even look at him. Wear headphones when you have to leave your room so you can't hear his nasty comments. It may be that he's dealing with some poor self-esteem, so he's lashing out to make himself feel better. Or he may just be a mean person. Hard to say. Regardless, you don't deserve to be treated poorly and you do deserve food. \nThe more you're able to nourish your body, the easier it'll be to deal with this bullshit. ❤",
          "created_utc": 1598372805.0
        }
      ]
    },
    {
      "id": "g2tqmop",
      "author": "captain_jayne",
      "body": "You can call me fat, but I'll make sure everyone know's how small your dick is\n\nor pick something.\n\nidk, i was lucky and my siblings were older and \"babied\" me - but if it was me I'd turn into a total bitch to him.",
      "created_utc": 1598378927.0,
      "score": 13,
      "context": [
        {
          "id": "g2tobci",
          "author": "vanillazuella",
          "body": "\"I may be fat but you are stupid and insensitive and nothing solves for that\"-you \n\nRepeat as often as needed",
          "created_utc": 1598377829.0
        }
      ]
    },
    {
      "id": "g2tt2k4",
      "author": "alwayswired",
      "body": "I wish lol, he’s way *way* stronger/taller than me and easily beats the shit out of me.",
      "created_utc": 1598380086.0,
      "score": 4,
      "context": [
        {
          "id": "g2tpzvu",
          "author": "I_Love-Lasagna",
          "body": "go up to him and say \"shut the fuck up, talk to me like that again and ill slap the shit outta you\"",
          "created_utc": 1598378626.0
        }
      ]
    },
    {
      "id": "g2tttdq",
      "author": "I_Love-Lasagna",
      "body": "Ay do what you gotta do. \"Are you even siblings if youve never pulled a knife on them?\"",
      "created_utc": 1598380440.0,
      "score": 8,
      "context": [
        {
          "id": "g2tpzvu",
          "author": "I_Love-Lasagna",
          "body": "go up to him and say \"shut the fuck up, talk to me like that again and ill slap the shit outta you\"",
          "created_utc": 1598378626.0
        },
        {
          "id": "g2tt2k4",
          "author": "alwayswired",
          "body": "I wish lol, he’s way *way* stronger/taller than me and easily beats the shit out of me.",
          "created_utc": 1598380086.0
        }
      ]
    }
  ]
}