{
  "id": "ih6ebf",
  "subreddit": "fuckeatingdisorders",
  "author": "T_86",
  "created_utc": 1598472622.0,
  "title": "Wanting recovery vs not wanting it",
  "selftext": "How many times a day does your brain flip flop over which one you want? \n\n\n34f in the middle of a relapse at the moment. I had a breakdown earlier and told my fiancé that I want to recover. We got out all my old recovery workbooks from the past and we put post-it’s up on eating reminders. Well it’s been 3 hours and one protein shake later; I no longer want anything to do with recovery.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ih6ebf/wanting_recovery_vs_not_wanting_it/",
  "score": 106,
  "num_comments": 13,
  "comments": [
    {
      "id": "g2yc6wb",
      "author": "None",
      "body": "Yep it’s annoying because I’ll tell my BF that I’ve decided to start eating more from now on and then the next day I’m skipping meals and he’s so confused at all times basically.",
      "created_utc": 1598476537.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g2y9n1x",
      "author": "Iscariiot",
      "body": "I’m often in a place of not wanting to recover- even after months of Res. My head just isn’t in it. When I AM in the recovery mindset it’s because I feel guilty that I’m terrorizing my family. So I don’t have a very positive association with recovery overall. But I do flip a lot more now that I’m “”stuck”” in a more weight restored body.",
      "created_utc": 1598475339.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g2yd2sk",
      "author": "applecinnamonnn",
      "body": "I’ve been there for about 4 years now. This quasi recovery is draining my soul.",
      "created_utc": 1598476957.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g2yafci",
      "author": "avocantdough",
      "body": "I relate to this so much. Literally like 20 times a day.",
      "created_utc": 1598475702.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g2ygj6l",
      "author": "beautifulchaos22",
      "body": "It’s literally like parkour.  Pretty sure I have whiplash between the recovery vs relapse torment that my brain puts me through on a daily basis",
      "created_utc": 1598478598.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g2yn02m",
      "author": "lateoctober",
      "body": "I feel you so much. I feel like I'm outwardly going through the motions of recovery to appease those around me but I'm still clinging to all of my ana behaviours.",
      "created_utc": 1598481821.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g2yumq8",
      "author": "DisorderlyHum",
      "body": "I started residential yesterday and it seems like every other meal/snack I switch. Like I'll eat the whole meal, feel bad about it, restrict at the next one, feel better, eat a full meal/snack, feel bad, etc. Like thank u brain for this",
      "created_utc": 1598485866.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2yy70e",
      "author": "shetlandduck",
      "body": "i talk about it with my therapist a lot. how i don’t feel ready for recovery, but no one is really ready for recovery. i’m sick of dealing with the constant food thoughts, but i don’t know i want to do something about it. \n\ni spend time online looking at treatment centers near me, then open up ed twitter. it’s an endless cycle.",
      "created_utc": 1598487776.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g30ocfo",
      "author": "firelup19",
      "body": "Every freaking second. I’ve almost stopped talking about it because the minute I’m ambivalent suddenly I’m no longer a rational functioning adult but a incapacitated invalid/child. I’ve been stuck in quasi-recovery for 2 years because I appease everyone to be treated normally.",
      "created_utc": 1598533798.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3172xb",
      "author": "T_86",
      "body": "I really do want to get over all this and recover, like their are times throughout the day lately that I seriously want it so friggen bad! I post things for recovery all around our house and I make positive plans with my fiancé...and now I’m regretting it and wanting to stay in my safe little ED bubble. I feel so guilty to my fiancé about this back and forth bullshit.",
      "created_utc": 1598543410.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g34p9br",
      "author": "withonlygrace",
      "body": "Yeah...I‘ve told my partner that I’m going to get better so many times that he doesn’t believe me anymore, because the next day I just slip back down. I just don’t have any long lasting motivation.",
      "created_utc": 1598619952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g36zbws",
      "author": "None",
      "body": "All the time. One day I’m determined to start snacking in order to increase my calorie intake, and then a few hours later I decide that it’s not worth it since my parents serve me large portions for lunch and dinner anyway. It’s a definite struggle, but having a solid support system definitely helps.",
      "created_utc": 1598661084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g316mk6",
      "author": "T_86",
      "body": "Be proud of every small achievement! And every bite you take for recovery is an achievement worth being proud over! \n\n\nNot sure why it’s easier to say this to others and not myself though. I’m proud of you stranger-internet-friend :)",
      "created_utc": 1598543198.0,
      "score": 2,
      "context": [
        {
          "id": "g2yumq8",
          "author": "DisorderlyHum",
          "body": "I started residential yesterday and it seems like every other meal/snack I switch. Like I'll eat the whole meal, feel bad about it, restrict at the next one, feel better, eat a full meal/snack, feel bad, etc. Like thank u brain for this",
          "created_utc": 1598485866.0
        }
      ]
    }
  ]
}