{
  "id": "iidt2t",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1598643204.0,
  "title": "I finally stopped counting calories",
  "selftext": "I just discovered this subreddit, and the revelation has been amazing. So many of the other eating disorder subreddits don't seem focused on recovery like this one – they seem to focus more on rumination and serve to further embed disordered thoughts. I'm grateful to have found this community.\n\nI've had anorexia nervosa for years now, and I've been working with therapists for years to work on it. I've recovered a ton, but for the past year I have been stuck in quasi-recovery. I don't outright restrict anymore, and my list of fear foods is scant. I'm a competitive cyclist, and I keep my mileage and intensity in check. However, I still obsessively counted calories and avoided a lot of foods because of it.\n\nI recently started working with a sports dietician, and it's been incredible. In tandem with my therapist, the experience has been highly positive. I knew counting calories was one of the last, and throughout the whole course of the disorder, the biggest issue keeping me in quasi-recovery. Starting yesterday, I vowed to stop cold turkey.\n\nI always thought that I could NEVER stop counting calories. I did it every day for years, multiple times a day – on vacations, when I'm sick, when I'm busy; whenever. It's not so concrete, but part of me thought the sky would fall and my world would end if I stopped. I spun a story that I would head towards gaining huge amounts of weight, get slow on my bike, and lose control of my life. I would somehow be a failure and weak if I couldn't control and count. It's only day two, but none of that has happened, and every time the voice comes up resisting what's logical, I in essence tell it to fuck right off. I'm still nervous, and I don't know where this road is going, but I don't care anymore. I want to be normal, not obsess, and just enjoy food and my life.\n\nI'm excited to actually cast off the last barriers keeping me from recovery. I'm excited to be whole again. I'm excited to extricate this massive cognitive load from my mind. Wish me luck!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/iidt2t/i_finally_stopped_counting_calories/",
  "score": 117,
  "num_comments": 5,
  "comments": [
    {
      "id": "g36ehk9",
      "author": "ConfidentStrength999",
      "body": "That’s fantastic! I’m so happy for you that you’re moving forward in your recovery! Best of luck ❤️",
      "created_utc": 1598649751.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g36i64f",
      "author": "avocantdough",
      "body": "This makes me so happy to read!! Good for you!! We are on this journey together :)",
      "created_utc": 1598651646.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g37lg5u",
      "author": "ccallista",
      "body": "Proud of you you deserve to be excited and happy ❤️",
      "created_utc": 1598674835.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g37rvd1",
      "author": "applecinnamonnn",
      "body": "Loved reading this first thing in the morning. I’ve never really counted calories myself but I’m really happy you managed to let go of such a huge everyday habit. It’s really inspiring for someone who’s stuck in quasi recovery as well to read about your letting go of fear foods too :) Keep it up and good luck!",
      "created_utc": 1598679779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g38672j",
      "author": "None",
      "body": "so proud of u",
      "created_utc": 1598693720.0,
      "score": 2,
      "context": []
    }
  ]
}