{
  "id": "iiuver",
  "subreddit": "fuckeatingdisorders",
  "author": "gardenfaiiri",
  "created_utc": 1598716915.0,
  "title": "I don’t want to recover but I also don’t want to have an eating disorder anymore.",
  "selftext": "I like my body currently, I don’t love it but I’ve never loved my body and although I find myself being far more critical and getting a lot more up set when dressing every morning than I used to it’s something I could deal with. However I hate literally everything that comes along with having an eating disorder, I hope none of this makes me sound like I’m faking anything but I genuinely hate having to restrict, having to exercise when it hurts and doesn’t feel good at all, hate having to be cold all the time, be grumpy, tired, having to withdraw from social situations, and just having a really low mood all the time. \n\nThe ED served it’s purpose, sometimes it still seems to serve a purpose, but for the most part I’m really over it. The only thing that really holds me back is my body. I don’t know if I’m ready to look healthy again, I’m think I have extreme mental hunger and I’m convinced that I’m just going to eat into oblivion, I’m convinced that all the energy I consume is going towards solely fat gain and not also towards repairing the damage I’ve clearly done after a full year of restricting and over exercising. I’m scared because I don’t know if I’m going to recover into my pre-ED body, I don’t know what the end point looks like. I know that part of recovery is letting go of controlling your weight and body shape, but it’s still something I struggle with and have no professionals around to help me deal with these things. \n\nI struggle with the fact the last month where I was sort of recovering I found it really easy, I know it’s because things that should have been challenging weren’t because I listened to my ED, I restricted before and after this meals, I wouldn’t allow myself to go over a restrictive calorie number and I honestly thought it was fine because I was gaining weight, but I was unhappy because as much as I wanted to just let go and eat whatever I feel guilt for finding it so easy. I’m at a point where I miss food so much and I’m so hungry that allowing myself to eat is a massive wave of relief, being able to go to a supermarket and pick out whatever I want and not have to hoard it under my bed for months and months is exciting and wonderful. I love food, I always have, I love cooking and baking. My whole family loves meat and I’ve hated the taste and texture of most meat since I was young so I love taking the recipes my mum makes and trying to turn them into vegetarian meals. My ED hates me for admitting it but I find so much pleasure in cooking, in trying new foods, in having food because I enjoy it and not because it’s a number. \n\nI wish I was motivated to recover, and that I wasn’t stuck in a recover/restrict cycle which is where I am at now. I wish that my body image, and the guilt of giving up my ED and allowing myself to be kind to myself wasn’t so strong, I wish that I could gain weight and not feel bad about how others would perceive me. It’s all so overwhelming when I can see all o really want deep down is to not live this way anymore, I’m tired and so ready to throw in the towel. I don’t know why I can’t.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/iiuver/i_dont_want_to_recover_but_i_also_dont_want_to/",
  "score": 116,
  "num_comments": 12,
  "comments": [
    {
      "id": "g3957l2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1598718385.0,
      "score": 35,
      "context": []
    },
    {
      "id": "g397okp",
      "author": "PM_ME_UR_DECOY_SNAIL",
      "body": "I dont have an answer either but I just want you to know that none of what you are going through is in any way \"fake\". Honestly your story mirrors mine so much, it's almost creepy lol. \n\nI love baking so much and it is independent of my ED. I'm partially weight restored now and I dislike my current body more than my LW body, but even at my LW, I wasnt fully happy with my body. \n\nBut at least now at a higher weight, I am semi-functional. In comparison, I absolutely hated my life and everything about my ED at my LW. I wrote so much about hating how it ruined my life bc I did not want future-me to romanticise and feel nostalgic about that weight when it was coming at such a high cost to everything else. Honestly I think this is extremely typical of anorexia for anyone who is past the first few months of romanticizing the disorder. Think about it, no one actually likes the feeling of hunger or enjoys the process of their body breaking down or losing their relationships to fellow humans. If humans genuinely could like the feeling of starvation and medical damage and becoming isolated from others, we wouldnt have survived to this day as a species. People like exercise but when their bodies are screaming for energy and the exercise is drawing down on already-insufficient energy stores and damaging the body, they obviously do not like it. I blame mainstream portrayals of anorexia that make the disorder look effortless and quirky as if we're just eccentric dancers/models who love the condition like it's some cute little accessory.  \n\nIf you speak to people with enduring EDs, almost all of them are sick of or resigned to this kind of self-abuse, but sometimes we pick shitty conditions we feel familir living with, than to let go and not know where that lands us. It's a very human thing to do.  \n\nWhat you say about quasi-recovery where you managed to gain but still count calories, also doesnt make you fake. I could have written that part word for word too lol. EDs are not just about weight but control. Full recovery frightens me so much because of losing that feeling of control I desperately need, since I feel like I have no control over many other things in life.\n\nMy endo was actually unsurprised that I could gain weight initially from my LW. He had this vibe like he was waiting for the other shoe to drop. He's seen many patients with EDs by the way. He was far more surprised when I passed a certain weight and still managed to gain. But I relapse literally one month after that particular appointment lol. To me, this could mean that many patients he has seen have a level of weight gain they feel is \"acceptable\" and that they can tolerate, except that in true recovery you dont get to decide for your body exactly how much that gain is. So yeah you really arent alone or faking, many of us can gain some amount from LW until we cant/wont let ourselves. And as you say, it's easier if you still engage in the control aspect of the ED, which is why I always use \"weight restoration\" and \"recovery\" as separate terms.",
      "created_utc": 1598719510.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g393qlq",
      "author": "samirawifey",
      "body": "I don’t have an answer for you, but I just wanted to say I think I’m in the same place. I’m tired of the ED but I’m terrified that I’ll just gain all the weight back. Hang in there ❤️",
      "created_utc": 1598717761.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g39xi3g",
      "author": "None",
      "body": "For me, taking pleasure in cooking was a huge part of developing a better relationship with food. \n\nFirst, I want to stress that even thought you have a fear that if you stop restricting you will never stop eating, you should know that that fear is based in your ED and not in reality. \n\nSecond, I want to say that not everybody’s recovery journey is the same. Harm reduction is the name of the game until you’re ready to take the deep plunge and commit fully to recovery. Whether that’s challenging yourself to eat at least X amount of calories everyday, to throw out your scale/food scale, or even if it’s something that feels too “easy”. You don’t have to feel like an imposter: like you’re either faking your ED or your faking your recovery. \n\nI know you mentioned that you don’t currently have access to a professional - is there any chance that that could change?",
      "created_utc": 1598731304.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g39og7a",
      "author": "TrueRusher",
      "body": "I don’t have an answer other than “one day at a time” but I wanted you to know that I literally feel the exact same way. \n\nEvery word of this post describes me perfectly right now. I swear I could have written it myself. You’re not alone out here. You’re definitely not faking anything, friend. That’s the ED talking. I hope one day Ed’s voice is no longer around.",
      "created_utc": 1598727132.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g3b82e1",
      "author": "None",
      "body": "Oof I felt that. I just wanna say I think its normal for our EDs to control our lives at this point and were afraid of losing that.",
      "created_utc": 1598753419.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i7hm087",
      "author": "Flat-Lettuce-2706",
      "body": "i’m in the same place and i don’t know how to get out of it either. i’m constantly weighing my food and planning meals. it’s exhausting, but i absolutely can’t wrap my head around letting go of the control. any control i let go of (like increasing my calorie limit) is compensated with some other disordered behavior. it sucks",
      "created_utc": 1651792698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g396g6t",
      "author": "gardenfaiiri",
      "body": "Yeah, like the first almost 6 months I remember feeling so much better and “loving” everything the ED gave me. Now I absolutely hate everything, plus like you said, now I’ve tried recovering every time I relapse it feels 100x worse. And yeah I’ve heard so many people say that the more weight they gained the less they cared so part of me thinks I should just fuck it, do it, gain weight and see if it works out, like an experiment or something. I wish you all the best,\nI’m sure things will get better soon.",
      "created_utc": 1598718923.0,
      "score": 10,
      "context": [
        {
          "id": "g3957l2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1598718385.0
        }
      ]
    },
    {
      "id": "g39vqpz",
      "author": "David-Blowie",
      "body": "thank you, genuinely.",
      "created_utc": 1598730474.0,
      "score": 7,
      "context": [
        {
          "id": "g397okp",
          "author": "PM_ME_UR_DECOY_SNAIL",
          "body": "I dont have an answer either but I just want you to know that none of what you are going through is in any way \"fake\". Honestly your story mirrors mine so much, it's almost creepy lol. \n\nI love baking so much and it is independent of my ED. I'm partially weight restored now and I dislike my current body more than my LW body, but even at my LW, I wasnt fully happy with my body. \n\nBut at least now at a higher weight, I am semi-functional. In comparison, I absolutely hated my life and everything about my ED at my LW. I wrote so much about hating how it ruined my life bc I did not want future-me to romanticise and feel nostalgic about that weight when it was coming at such a high cost to everything else. Honestly I think this is extremely typical of anorexia for anyone who is past the first few months of romanticizing the disorder. Think about it, no one actually likes the feeling of hunger or enjoys the process of their body breaking down or losing their relationships to fellow humans. If humans genuinely could like the feeling of starvation and medical damage and becoming isolated from others, we wouldnt have survived to this day as a species. People like exercise but when their bodies are screaming for energy and the exercise is drawing down on already-insufficient energy stores and damaging the body, they obviously do not like it. I blame mainstream portrayals of anorexia that make the disorder look effortless and quirky as if we're just eccentric dancers/models who love the condition like it's some cute little accessory.  \n\nIf you speak to people with enduring EDs, almost all of them are sick of or resigned to this kind of self-abuse, but sometimes we pick shitty conditions we feel familir living with, than to let go and not know where that lands us. It's a very human thing to do.  \n\nWhat you say about quasi-recovery where you managed to gain but still count calories, also doesnt make you fake. I could have written that part word for word too lol. EDs are not just about weight but control. Full recovery frightens me so much because of losing that feeling of control I desperately need, since I feel like I have no control over many other things in life.\n\nMy endo was actually unsurprised that I could gain weight initially from my LW. He had this vibe like he was waiting for the other shoe to drop. He's seen many patients with EDs by the way. He was far more surprised when I passed a certain weight and still managed to gain. But I relapse literally one month after that particular appointment lol. To me, this could mean that many patients he has seen have a level of weight gain they feel is \"acceptable\" and that they can tolerate, except that in true recovery you dont get to decide for your body exactly how much that gain is. So yeah you really arent alone or faking, many of us can gain some amount from LW until we cant/wont let ourselves. And as you say, it's easier if you still engage in the control aspect of the ED, which is why I always use \"weight restoration\" and \"recovery\" as separate terms.",
          "created_utc": 1598719510.0
        }
      ]
    },
    {
      "id": "g3b007s",
      "author": "gardenfaiiri",
      "body": "Honestly thank you so much for this, I’ve felt so alone in these feelings for so long - it was driving me insane. I remember the day I hit my LW I knew that I needed to change, earlier that week I had been told it was unlikely I’ve make it to my 18th birthday if I continued on the path I was going (which in a few weeks at that time, also I did make it and I’m forever grateful and proud of myself for that). It’s easy to forget that weight restoration and being able to maintain a healthy weight is not the end goal of recovery, it’s really just one of the first major goals, especially when my treatment team was so focused on numbers and weight before I had to quit treatment for various reasons. I hope things will get easier, for both of us. I hope that one day we can both find peace within ourselves and our bodies. Thank you again, I’m so glad that I was given the opportunity to read this and wish you the best.",
      "created_utc": 1598748552.0,
      "score": 5,
      "context": [
        {
          "id": "g397okp",
          "author": "PM_ME_UR_DECOY_SNAIL",
          "body": "I dont have an answer either but I just want you to know that none of what you are going through is in any way \"fake\". Honestly your story mirrors mine so much, it's almost creepy lol. \n\nI love baking so much and it is independent of my ED. I'm partially weight restored now and I dislike my current body more than my LW body, but even at my LW, I wasnt fully happy with my body. \n\nBut at least now at a higher weight, I am semi-functional. In comparison, I absolutely hated my life and everything about my ED at my LW. I wrote so much about hating how it ruined my life bc I did not want future-me to romanticise and feel nostalgic about that weight when it was coming at such a high cost to everything else. Honestly I think this is extremely typical of anorexia for anyone who is past the first few months of romanticizing the disorder. Think about it, no one actually likes the feeling of hunger or enjoys the process of their body breaking down or losing their relationships to fellow humans. If humans genuinely could like the feeling of starvation and medical damage and becoming isolated from others, we wouldnt have survived to this day as a species. People like exercise but when their bodies are screaming for energy and the exercise is drawing down on already-insufficient energy stores and damaging the body, they obviously do not like it. I blame mainstream portrayals of anorexia that make the disorder look effortless and quirky as if we're just eccentric dancers/models who love the condition like it's some cute little accessory.  \n\nIf you speak to people with enduring EDs, almost all of them are sick of or resigned to this kind of self-abuse, but sometimes we pick shitty conditions we feel familir living with, than to let go and not know where that lands us. It's a very human thing to do.  \n\nWhat you say about quasi-recovery where you managed to gain but still count calories, also doesnt make you fake. I could have written that part word for word too lol. EDs are not just about weight but control. Full recovery frightens me so much because of losing that feeling of control I desperately need, since I feel like I have no control over many other things in life.\n\nMy endo was actually unsurprised that I could gain weight initially from my LW. He had this vibe like he was waiting for the other shoe to drop. He's seen many patients with EDs by the way. He was far more surprised when I passed a certain weight and still managed to gain. But I relapse literally one month after that particular appointment lol. To me, this could mean that many patients he has seen have a level of weight gain they feel is \"acceptable\" and that they can tolerate, except that in true recovery you dont get to decide for your body exactly how much that gain is. So yeah you really arent alone or faking, many of us can gain some amount from LW until we cant/wont let ourselves. And as you say, it's easier if you still engage in the control aspect of the ED, which is why I always use \"weight restoration\" and \"recovery\" as separate terms.",
          "created_utc": 1598719510.0
        }
      ]
    },
    {
      "id": "g395qvo",
      "author": "gardenfaiiri",
      "body": "You too, I hope things get better for us ♥️",
      "created_utc": 1598718650.0,
      "score": 5,
      "context": [
        {
          "id": "g393qlq",
          "author": "samirawifey",
          "body": "I don’t have an answer for you, but I just wanted to say I think I’m in the same place. I’m tired of the ED but I’m terrified that I’ll just gain all the weight back. Hang in there ❤️",
          "created_utc": 1598717761.0
        }
      ]
    },
    {
      "id": "g3b1lvz",
      "author": "gardenfaiiri",
      "body": "Thank you for this, that last part I think it’s something that is really important to keep in mind. I don’t have to do everything at once if I’m not ready or comfortable. \n\nIn terms of professional help, unfortunately not. I was with adolescent services in my area for 4 months, but they refused to offer me therapy as I wasn’t weight restored, and because I was so close to turning 18. When I turned 18 a month ago adult services offered to see me, but I was labelled as “difficult to work with” and “non-complaint” as I refused to work with them and all their rules around weight gain. I was told that I would have to weigh myself every week because of COVID, being weighed in general was a massive trigger to the point where my adolescences team stopped making me have weigh ins because the only time I was able to increase the amount I was eating was when I didn’t have to go in for a weigh in. I was told that I had to gain x amount of weight every week and if I didn’t then I would be at risk of losing appointments with my therapist and possibly being asked to leave the program. Plus a bunch of other rules that made zero sense to me and made me feel uncomfortable about my care. \n\nI could pay to go private, but finding a therapist would works with EDs is really hard and I’m currently unemployed due to my mental health so can’t really afford it. It hard because I would love some support but unfortunately things don’t currently look like they are going to fall into place.",
      "created_utc": 1598749513.0,
      "score": 5,
      "context": [
        {
          "id": "g39xi3g",
          "author": "None",
          "body": "For me, taking pleasure in cooking was a huge part of developing a better relationship with food. \n\nFirst, I want to stress that even thought you have a fear that if you stop restricting you will never stop eating, you should know that that fear is based in your ED and not in reality. \n\nSecond, I want to say that not everybody’s recovery journey is the same. Harm reduction is the name of the game until you’re ready to take the deep plunge and commit fully to recovery. Whether that’s challenging yourself to eat at least X amount of calories everyday, to throw out your scale/food scale, or even if it’s something that feels too “easy”. You don’t have to feel like an imposter: like you’re either faking your ED or your faking your recovery. \n\nI know you mentioned that you don’t currently have access to a professional - is there any chance that that could change?",
          "created_utc": 1598731304.0
        }
      ]
    },
    {
      "id": "g3b72qt",
      "author": "PM_ME_UR_DECOY_SNAIL",
      "body": "Yup, same here, for me my moment of lucidity was when i reached my LW, and I remembered crying over a single pancake on my birthday and getting into a huge fight over it. Like ok nowadays I still just dont like pancakes, but I'd still be like \"yeah it's whatever\" and just eat one if my mom made it for me for a special occasion. But nah I refused to eat even a bite then, bc my mom refused to estimate the calories, and it ruined the whole day and I thought \"ok wth this has reached some ridiculous level\".  And another moment when I broke down crying at 10pm in school because the vending machine had run out of the sandwich I was planning to get. Just full out sobbing near a group rushing their final projects. My mind broke through the fog again and was like yo this some screwed up shit lol. \n\nHonestly, i've asked people who have maintained dangerously low weights for years, if this sort of angst and suffering and desire for change ever goes away. If they ever stopped caring about everything they lost to their ED and accept it. To my surprise, they said no. Not unless they felt like they were moments from death so truly nothing can be done. Otherwise, they still had moments of hoping they could be stronger and change things. They still had moments of grief and anger over what they lost. It showed me that, yeah most ED people have a weight they cant sustain and they decide to gain a controlled amt of weight from there, but even for those who long term maintain very low weights, they have moments of sanity and grief and desperating wanting to change, because human hope and human desire for survival is that strong. The idea that they always love their ED and how it makes them skinny and that they entirely accept the costs of that ED- that's the fake part.",
      "created_utc": 1598752814.0,
      "score": 6,
      "context": [
        {
          "id": "g397okp",
          "author": "PM_ME_UR_DECOY_SNAIL",
          "body": "I dont have an answer either but I just want you to know that none of what you are going through is in any way \"fake\". Honestly your story mirrors mine so much, it's almost creepy lol. \n\nI love baking so much and it is independent of my ED. I'm partially weight restored now and I dislike my current body more than my LW body, but even at my LW, I wasnt fully happy with my body. \n\nBut at least now at a higher weight, I am semi-functional. In comparison, I absolutely hated my life and everything about my ED at my LW. I wrote so much about hating how it ruined my life bc I did not want future-me to romanticise and feel nostalgic about that weight when it was coming at such a high cost to everything else. Honestly I think this is extremely typical of anorexia for anyone who is past the first few months of romanticizing the disorder. Think about it, no one actually likes the feeling of hunger or enjoys the process of their body breaking down or losing their relationships to fellow humans. If humans genuinely could like the feeling of starvation and medical damage and becoming isolated from others, we wouldnt have survived to this day as a species. People like exercise but when their bodies are screaming for energy and the exercise is drawing down on already-insufficient energy stores and damaging the body, they obviously do not like it. I blame mainstream portrayals of anorexia that make the disorder look effortless and quirky as if we're just eccentric dancers/models who love the condition like it's some cute little accessory.  \n\nIf you speak to people with enduring EDs, almost all of them are sick of or resigned to this kind of self-abuse, but sometimes we pick shitty conditions we feel familir living with, than to let go and not know where that lands us. It's a very human thing to do.  \n\nWhat you say about quasi-recovery where you managed to gain but still count calories, also doesnt make you fake. I could have written that part word for word too lol. EDs are not just about weight but control. Full recovery frightens me so much because of losing that feeling of control I desperately need, since I feel like I have no control over many other things in life.\n\nMy endo was actually unsurprised that I could gain weight initially from my LW. He had this vibe like he was waiting for the other shoe to drop. He's seen many patients with EDs by the way. He was far more surprised when I passed a certain weight and still managed to gain. But I relapse literally one month after that particular appointment lol. To me, this could mean that many patients he has seen have a level of weight gain they feel is \"acceptable\" and that they can tolerate, except that in true recovery you dont get to decide for your body exactly how much that gain is. So yeah you really arent alone or faking, many of us can gain some amount from LW until we cant/wont let ourselves. And as you say, it's easier if you still engage in the control aspect of the ED, which is why I always use \"weight restoration\" and \"recovery\" as separate terms.",
          "created_utc": 1598719510.0
        },
        {
          "id": "g3b007s",
          "author": "gardenfaiiri",
          "body": "Honestly thank you so much for this, I’ve felt so alone in these feelings for so long - it was driving me insane. I remember the day I hit my LW I knew that I needed to change, earlier that week I had been told it was unlikely I’ve make it to my 18th birthday if I continued on the path I was going (which in a few weeks at that time, also I did make it and I’m forever grateful and proud of myself for that). It’s easy to forget that weight restoration and being able to maintain a healthy weight is not the end goal of recovery, it’s really just one of the first major goals, especially when my treatment team was so focused on numbers and weight before I had to quit treatment for various reasons. I hope things will get easier, for both of us. I hope that one day we can both find peace within ourselves and our bodies. Thank you again, I’m so glad that I was given the opportunity to read this and wish you the best.",
          "created_utc": 1598748552.0
        }
      ]
    }
  ]
}