{
  "id": "ik7cr1",
  "subreddit": "fuckeatingdisorders",
  "author": "gardenfaiiri",
  "created_utc": 1598910347.0,
  "title": "My body has chosen recovery, and even though I don’t want to recover, I’m trying my best to honour it.",
  "selftext": "I suppose even thought I don’t want it, my body has decided to chose recovery for me.\n\nI feel so bad for constantly making posts like this here, but I don’t have anyone else to confide in right now. I’ve been so back and forth with my recovery. I get really positive about it and then I sort of fall down when it comes to actually succeeding in anything and just fall back into behaviours after one day. \n\nI’m finding things really difficult, I have to gain weight and I’ve managed to gain a little, but I’m still at risk of a lot of health problems due to my weight and the damage I’ve done through the duration of my ED. I’m currently finding any further weight gain to be really difficult to deal with because I don’t want to image life at a higher weight, and looking healthy again. \n\nHowever, no matter how much I want to restrict, and lose weight I can’t. I’ll spend the whole day restricting only to binge after dinner, feel super guilty, and then even after I’ve binged I’ll still go to bed hungry after planning to restrict the next day. I’ve been stuck in this binge/restrict cycle for 3 weeks now and it’s awful, it makes me feel like I have not will power, like I’m losing control, and I just feel so disgusting all the time. I’ve done a lot of reading and I understand that this is a natural response is not only to the short term restriction, but also the longer-term restriction that has happened during the time I’ve had my ED. So instead of punishing myself, blaming myself, and talking badly to myself about it - I’ve decided that this is a signal from my body that it can no longer hold on to this suppressed body weight, and can no longer deal with the restriction. I know the only way to make these binges reduce in some way would be to stop restricting during the day, so I shall do that. My body is obviously in need to energy, it obviously cannot survive this much longer, and I know I can’t either. I guess even if binges continue to happen at night, I’ll probably feel a lot less guilty because I haven’t set myself up for restriction. Starting tomorrow, I will give myself full permission to eat unrestricted, and to rest. I will stop weighing myself, I will stop listening to food rules, and I will not feel guilty about the amount I’m struggling with recovery. It’s okay to not struggle as much as I thought I would, it’s okay to enjoy the recovery process. That doesn’t invalidate me, in the sane way that not being okay in recovery doesn’t make me a failure. \n\nWhat I’m beginning to realise is that recovery is not something that I can engage in when I feel like it, and ignore if I’m too tired, unhappy with my body, and feeling generally negative. It is unconditional and right now needs to be my main focus. It’s so hard, probably the hardest decision I’ve ever had to make but I’m going to listen to the people who are recovering, and those who have recovered and hold on tightly to the idea that it will get better and that all this anguish will be worth it soon.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ik7cr1/my_body_has_chosen_recovery_and_even_though_i/",
  "score": 90,
  "num_comments": 12,
  "comments": [
    {
      "id": "g3jafea",
      "author": "None",
      "body": "Don’t ever feel guilty for posting here or looking for support or taking a long time to recover or having a messy recovery. We are all on your team OP, we all want you to be supported and recovering.",
      "created_utc": 1598920502.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g3iv0sy",
      "author": "Enduendada",
      "body": "Trusting the process as well as your body is the bravest *and* the best thing you can ever do. I wish you the best. Be kind to yourself!",
      "created_utc": 1598912534.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g3jpkhi",
      "author": "f_edsthrowaway",
      "body": "I can definitely relate to the feeling that your body chose recovery, not you. Once the extreme hunger started and I got into the binge/purge/restrict cycle, I began to truly realize the futility of any further attempts at restriction. It was practically impossible for me to lose weight, and in fact I was slowly gaining it, and so recovery seemed to be rather inevitable, unless I wanted to live in absolute misery and in a stupor of food obsession forever. I had to accept that restriction is a battle that you will eventually lose.\n\nWhile I wouldn't say I'm fully recovered yet, being at a \"healthy\" weight and giving my body enough energy everyday has certainly resulted in an improved quality of life and a clearer head, despite persistent difficulties with body image and identity loss.\n\nI wish you good luck on your own recovery!",
      "created_utc": 1598928498.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g3jyyvh",
      "author": "None",
      "body": "❤️❤️❤️ it will all be okay, I’m happy you can come here for support. We appreciate you ❤️❤️❤️",
      "created_utc": 1598934292.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3kd8ol",
      "author": "noodlepooodle",
      "body": "Hey love. I was in a similar boat, went from solely restricting to restricting them binging. Are you getting professional help? Some problems are close to impossible to fix by yourself. I remember being so exhausted trying to help myself. I was tired and frustrated and just... exhausted trying to keep up. Getting a therapist really helped. I hope you can find a way that works for you! I’m proud of you ✨",
      "created_utc": 1598946943.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3myvr4",
      "author": "Flesh-And-Bone",
      "body": ">I suppose even thought I don’t want it, my body has decided to chose recovery for me.\n\nDamn, do I feel this. \n\nMe: \"Please, can we restrict calories just one day?\"\n\nBody: \"Sure, but you're going to make up for it tomorrow, or the next day, or the day thereafter.\"\n\nThe more I try to manage my food intake, the more my food intake manages me, so to speak. Some days I eat more food and some days I eat less. It is what it is. If I try to control it, I'm going to end up binge eating, and that feels terrible.",
      "created_utc": 1598992176.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3je7i8",
      "author": "gardenfaiiri",
      "body": "Thank you so much.",
      "created_utc": 1598922522.0,
      "score": 3,
      "context": [
        {
          "id": "g3jafea",
          "author": "None",
          "body": "Don’t ever feel guilty for posting here or looking for support or taking a long time to recover or having a messy recovery. We are all on your team OP, we all want you to be supported and recovering.",
          "created_utc": 1598920502.0
        }
      ]
    },
    {
      "id": "g3k4wa1",
      "author": "momoguri",
      "body": "This. All of us know how much those new to recovery need support but how difficult it is to reach out and ask.\n\nI like what you said about respecting and honoring your body. That is big, and what this is all about. Best of luck, op! 💗",
      "created_utc": 1598938901.0,
      "score": 2,
      "context": [
        {
          "id": "g3jafea",
          "author": "None",
          "body": "Don’t ever feel guilty for posting here or looking for support or taking a long time to recover or having a messy recovery. We are all on your team OP, we all want you to be supported and recovering.",
          "created_utc": 1598920502.0
        }
      ]
    },
    {
      "id": "g3kfw59",
      "author": "gardenfaiiri",
      "body": "I’m so glad this others have had a similar experience, it definitely helps me feel less alone and invalid. I can definitely relate to losing weight becoming impossible, I’m restricting but also binging and feeling miserable especially but my weight is still climbing. I hope things continue you look up for you.",
      "created_utc": 1598949873.0,
      "score": 1,
      "context": [
        {
          "id": "g3jpkhi",
          "author": "f_edsthrowaway",
          "body": "I can definitely relate to the feeling that your body chose recovery, not you. Once the extreme hunger started and I got into the binge/purge/restrict cycle, I began to truly realize the futility of any further attempts at restriction. It was practically impossible for me to lose weight, and in fact I was slowly gaining it, and so recovery seemed to be rather inevitable, unless I wanted to live in absolute misery and in a stupor of food obsession forever. I had to accept that restriction is a battle that you will eventually lose.\n\nWhile I wouldn't say I'm fully recovered yet, being at a \"healthy\" weight and giving my body enough energy everyday has certainly resulted in an improved quality of life and a clearer head, despite persistent difficulties with body image and identity loss.\n\nI wish you good luck on your own recovery!",
          "created_utc": 1598928498.0
        }
      ]
    },
    {
      "id": "g3kgezz",
      "author": "gardenfaiiri",
      "body": "I was in line to receive some. I’ve had professional help in the past but it was involuntary and I was not really in a position to receive it so I wasn’t willing to comply. That mixed with a relapse after involuntary IP, and a constantly being refused therapy due to my weight means that the IOP program I was supposed to transfer to refuses to take my case as I’m labelled as “difficult to work with” despite currently motivated to seek therapy. It’s difficult because I’ve been left with nothing and cannot afford to pay for private support, so I’m on my own really.",
      "created_utc": 1598950462.0,
      "score": 3,
      "context": [
        {
          "id": "g3kd8ol",
          "author": "noodlepooodle",
          "body": "Hey love. I was in a similar boat, went from solely restricting to restricting them binging. Are you getting professional help? Some problems are close to impossible to fix by yourself. I remember being so exhausted trying to help myself. I was tired and frustrated and just... exhausted trying to keep up. Getting a therapist really helped. I hope you can find a way that works for you! I’m proud of you ✨",
          "created_utc": 1598946943.0
        }
      ]
    },
    {
      "id": "g3kig3c",
      "author": "noodlepooodle",
      "body": "I’m really sorry. Have you checked out online counseling?",
      "created_utc": 1598952774.0,
      "score": 3,
      "context": [
        {
          "id": "g3kd8ol",
          "author": "noodlepooodle",
          "body": "Hey love. I was in a similar boat, went from solely restricting to restricting them binging. Are you getting professional help? Some problems are close to impossible to fix by yourself. I remember being so exhausted trying to help myself. I was tired and frustrated and just... exhausted trying to keep up. Getting a therapist really helped. I hope you can find a way that works for you! I’m proud of you ✨",
          "created_utc": 1598946943.0
        },
        {
          "id": "g3kgezz",
          "author": "gardenfaiiri",
          "body": "I was in line to receive some. I’ve had professional help in the past but it was involuntary and I was not really in a position to receive it so I wasn’t willing to comply. That mixed with a relapse after involuntary IP, and a constantly being refused therapy due to my weight means that the IOP program I was supposed to transfer to refuses to take my case as I’m labelled as “difficult to work with” despite currently motivated to seek therapy. It’s difficult because I’ve been left with nothing and cannot afford to pay for private support, so I’m on my own really.",
          "created_utc": 1598950462.0
        }
      ]
    },
    {
      "id": "g3kk891",
      "author": "gardenfaiiri",
      "body": "No I haven’t, I didn’t even think about that. I’ll definitely have a look into it now that you’ve mentioned it. Thank you so much.",
      "created_utc": 1598954721.0,
      "score": 3,
      "context": [
        {
          "id": "g3kd8ol",
          "author": "noodlepooodle",
          "body": "Hey love. I was in a similar boat, went from solely restricting to restricting them binging. Are you getting professional help? Some problems are close to impossible to fix by yourself. I remember being so exhausted trying to help myself. I was tired and frustrated and just... exhausted trying to keep up. Getting a therapist really helped. I hope you can find a way that works for you! I’m proud of you ✨",
          "created_utc": 1598946943.0
        },
        {
          "id": "g3kgezz",
          "author": "gardenfaiiri",
          "body": "I was in line to receive some. I’ve had professional help in the past but it was involuntary and I was not really in a position to receive it so I wasn’t willing to comply. That mixed with a relapse after involuntary IP, and a constantly being refused therapy due to my weight means that the IOP program I was supposed to transfer to refuses to take my case as I’m labelled as “difficult to work with” despite currently motivated to seek therapy. It’s difficult because I’ve been left with nothing and cannot afford to pay for private support, so I’m on my own really.",
          "created_utc": 1598950462.0
        },
        {
          "id": "g3kig3c",
          "author": "noodlepooodle",
          "body": "I’m really sorry. Have you checked out online counseling?",
          "created_utc": 1598952774.0
        }
      ]
    }
  ]
}