{
  "id": "ikfvwm",
  "subreddit": "fuckeatingdisorders",
  "author": "mariah-xo",
  "created_utc": 1598945082.0,
  "title": "the pandemic forced me into recovery & is saving my life.",
  "selftext": "i have good days & bad days. i have days full of regret asking myself \"what have i done?\" but i also have other days where i remember how unhappy i was when i was restricting & how mean i was to those around me because i was so irritable & unhappy. in the beginning i was \"attempting recovery\" (still restricting) eating around 1,500-1,800 cals a day & SLOWLY gaining. after awhile i then upped my intake to about 2,500 cals a day & was still not gaining at a rapid pace & at first i was fine with that. one night about a month & a half ago the extreme hunger was too much to handle & my body was shaking i could no longer ignore my hunger so i gave in. it's been almost two months of pain, sadness & anger but also of happiness & relief. i was a lost cause & i was genuinely sure that i would not make it to my 21st birthday. i started from an >!11 bmi!< & am now edging on being a \"healthy weight\" again. (even though bmi does not mean much) am i scared? of course but am i continuing on through the fear & pain? i am. i try to be proud of myself for how far i've come since i've had no outside help (no therapist, dietician, hospital) & a very toxic environment but i am doing it. i am trying to accept my body for how it looks & some days that's easy but some days it is really really fucking hard & restriction comes to my mind but then i try & realize how far i have come & how much progress i've made! i even think my weight is beginning to distribute more evenly now which is a relief & exciting. sorry for the long post i am just incredibly emotional right now & i want u all to know u CAN do this! u can attempt recovery & live a happy life. please just try! i know it's terrifying but what have u got to lose? ur eating disorder is always waiting for u but trust me once u experience freedom u won't want to go back. thank u to anyone who listened i am sending all of u love & am endlessly grateful for this sub (& all of u tolerating my many annoying posts)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ikfvwm/the_pandemic_forced_me_into_recovery_is_saving_my/",
  "score": 128,
  "num_comments": 11,
  "comments": [
    {
      "id": "g3kex4l",
      "author": "gardenfaiiri",
      "body": "I’ve been following your posts here for a while, and reading this has made me so proud and happy for you. I’m so glad to see you with a positive outlook on your recovery and life in general. You’ve come so far and your journey is inspiring. Keep going, you’re doing so good!",
      "created_utc": 1598948788.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g3la6tj",
      "author": "averyquietvoice",
      "body": "The pandemic may have been the trigger, but it’s ultimately all you! That is incredible! I think for many of us there’s a point in recovery when the ball goes over the hill and there’s no stopping it. Let’s keep riding the momentum towards full freedom! 💪",
      "created_utc": 1598969976.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g3l8xaq",
      "author": "problematicbeing",
      "body": "So so so so so DANG PROUD OF YOU\n\nYou are doing a really hard thing and you are killing it!!! This post absolutely made my day. Keep going Mariah :) you are gaining your life back.",
      "created_utc": 1598969487.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g3l5zty",
      "author": "JoshSummers",
      "body": "That is fantastic work! Great to read that update.",
      "created_utc": 1598968341.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g3l904v",
      "author": "plaginum",
      "body": "u got dis homie g! we are all very proud of u",
      "created_utc": 1598969519.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4bbiag",
      "author": "MetamorphosisBanana",
      "body": "I'm in a very similar place to you. I gained weight over the last year to a now normal weight for my height. I definitely have days where I feel fat and I wonder, \"What have I done?\" I have days now where I'm convinced I'm massive. I haven't taken many photos and have mainly hidden myself because I really am not convinced I look great. It's a strange headspace to be in. How do you accept your body? Like you, I did this alone. I feel like I can relate to your post so much. I'm just not used to this body. It doesn't feel like me in a lot of ways. Honestly though, I'm extremely proud of you for doing this. I know how hard it is and I understand the struggle. You're right though... ultimately, it is worth it because my mood and energy level is a LOT better. I'm sure you've noticed the energy thing. It's pretty remarkable the difference.",
      "created_utc": 1599467465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3kfytf",
      "author": "mariah-xo",
      "body": "u are so so kind! that means more to me than u know. i'm so thankful i read this <3",
      "created_utc": 1598949958.0,
      "score": 10,
      "context": [
        {
          "id": "g3kex4l",
          "author": "gardenfaiiri",
          "body": "I’ve been following your posts here for a while, and reading this has made me so proud and happy for you. I’m so glad to see you with a positive outlook on your recovery and life in general. You’ve come so far and your journey is inspiring. Keep going, you’re doing so good!",
          "created_utc": 1598948788.0
        }
      ]
    },
    {
      "id": "g3ljzb4",
      "author": "mariah-xo",
      "body": "ur so kind!! yes let's keep going i'm rooting for u!! <3 thank u so much for saying that.",
      "created_utc": 1598973601.0,
      "score": 1,
      "context": [
        {
          "id": "g3la6tj",
          "author": "averyquietvoice",
          "body": "The pandemic may have been the trigger, but it’s ultimately all you! That is incredible! I think for many of us there’s a point in recovery when the ball goes over the hill and there’s no stopping it. Let’s keep riding the momentum towards full freedom! 💪",
          "created_utc": 1598969976.0
        }
      ]
    },
    {
      "id": "g3ljvq1",
      "author": "mariah-xo",
      "body": "thank u so much!!! i appreciate that <3 sending u so much love!!",
      "created_utc": 1598973564.0,
      "score": 1,
      "context": [
        {
          "id": "g3l8xaq",
          "author": "problematicbeing",
          "body": "So so so so so DANG PROUD OF YOU\n\nYou are doing a really hard thing and you are killing it!!! This post absolutely made my day. Keep going Mariah :) you are gaining your life back.",
          "created_utc": 1598969487.0
        }
      ]
    },
    {
      "id": "g3ljw5w",
      "author": "mariah-xo",
      "body": "thank u!!",
      "created_utc": 1598973568.0,
      "score": 1,
      "context": [
        {
          "id": "g3l5zty",
          "author": "JoshSummers",
          "body": "That is fantastic work! Great to read that update.",
          "created_utc": 1598968341.0
        }
      ]
    },
    {
      "id": "g3ljwyy",
      "author": "mariah-xo",
      "body": "thank u baby <3",
      "created_utc": 1598973577.0,
      "score": 2,
      "context": [
        {
          "id": "g3l904v",
          "author": "plaginum",
          "body": "u got dis homie g! we are all very proud of u",
          "created_utc": 1598969519.0
        }
      ]
    }
  ]
}