{
  "id": "iot0gs",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1599569646.0,
  "title": "The benefits of a binge (?)",
  "selftext": "So, yesterday I had a binge. A really, r e a l l y massive one. This alone already feels like the biggest most catastrophic event ever happened in the entire history of the universe. The fact that I'm at a healthy weight makes it even worse, if possible. My ED is yelling at me that this is just the beginning and I'm en route to becoming infinitely obese and the world will just end. It's literally throwing its most powerful weapons at me all at once and it's INCREDIBLY convincing. I cannot stress enough how desperate, scared and hopeless I'm feeling right now.\n\nThat said.\n\nI slept better last night. It had been several nights of bad sleep but last night I slept well and never woke up - also because I didn't drink my usual [insert excessively high number of] cups of caffeine-free tea and diet sodas, therefore I didn't have to pee all the time.\n\nI'm wearing short sleeves today. I'm not cold.\n\nI'm *somewhat* less hungry than yesterday. My mind is *slightly* less consumed with pictures of mountains of peanut butter to gorge on.\n\nTime goes by faster! I found myself staring less compulsively at the clock waiting for the next meal to come.\n\nMy mind feels freer. I just spent a couple hours straight working on a project without realizing I wasn't thinking about food.\n\nI'm less fidgety. I'm just sitting on my chair like that.\n\nI don't know what this is supposed to mean. Probably nothing. And it's not like I don't plan to go immediately back to restricting. The fear of weight gain is just too overwhelming. But anyways. Maybe it will be helpful to someone.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/iot0gs/the_benefits_of_a_binge/",
  "score": 87,
  "num_comments": 6,
  "comments": [
    {
      "id": "g4frw0d",
      "author": "jeykehey",
      "body": "those, my friend, are the benefits of fueling your mind and body! binging in and of itself has no benefits, especially long term. im not sure how low you restrict, but id 100% recommend upping your intake a bit. you'll feel better and binge less.",
      "created_utc": 1599570694.0,
      "score": 36,
      "context": []
    },
    {
      "id": "g4hypwt",
      "author": "alysszza",
      "body": "I thought the same way u did ab two years ago. \nAt that point in my life , i was restricting a LOT and working out excessively. That being said, i still never became technically \"underweight\". \nMy natural body type has always caused me to b on the higher end of wat i am 'meant to b'. When i got to my ed stage, i lost a significant amount of weight but was still technically normal. \nKeep this in mind- your weight does not determine your illness. \nED's are fueled mentally, your weight becomes a side effect of what you are thinking in ur brain. \nYour ED isnt invalid just because u r still at a normal weight. Your ED isnt the number on the scale, it is the constant mind consuming obsessive thoughts of food, and yet the constant denial and restriction of food. \nListen to your body. You needed that food yesterday. And weight gain is not the work of the devil. It is a natural part of human life that comes and goes with the tides. \nEven when you dont believe it, you are going to be alright.",
      "created_utc": 1599611410.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4hr0zi",
      "author": "vivianaq",
      "body": "i binged today so thank u:,)",
      "created_utc": 1599607087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4fsy36",
      "author": "internerderner2",
      "body": "I know what you mean, it's just that I already maintain a healthy weight by eating an adequate (according to the dietitian) amount of calories on a daily basis, therefore I'm very very resistant to upping calories. I guess my body is just broken.",
      "created_utc": 1599571376.0,
      "score": 7,
      "context": [
        {
          "id": "g4frw0d",
          "author": "jeykehey",
          "body": "those, my friend, are the benefits of fueling your mind and body! binging in and of itself has no benefits, especially long term. im not sure how low you restrict, but id 100% recommend upping your intake a bit. you'll feel better and binge less.",
          "created_utc": 1599570694.0
        }
      ]
    },
    {
      "id": "g4ftn4u",
      "author": "jeykehey",
      "body": "obviously i cant argue the advice of your care provider, but id like to point out that if your dietary needs were being met on a regular basis, you wouldnt be experiencing any of the negative side effects of restriction you list in your original post. being a \"healthy\" weight unfortunately doesnt mean youre healthy or functioning well.",
      "created_utc": 1599571816.0,
      "score": 21,
      "context": [
        {
          "id": "g4frw0d",
          "author": "jeykehey",
          "body": "those, my friend, are the benefits of fueling your mind and body! binging in and of itself has no benefits, especially long term. im not sure how low you restrict, but id 100% recommend upping your intake a bit. you'll feel better and binge less.",
          "created_utc": 1599570694.0
        },
        {
          "id": "g4fsy36",
          "author": "internerderner2",
          "body": "I know what you mean, it's just that I already maintain a healthy weight by eating an adequate (according to the dietitian) amount of calories on a daily basis, therefore I'm very very resistant to upping calories. I guess my body is just broken.",
          "created_utc": 1599571376.0
        }
      ]
    },
    {
      "id": "g4h658b",
      "author": "waterspouts_",
      "body": "Sometimes it's not all about calories. You probably got some nutrients that you were severely needing. I'm always low on potassium, magnesium, vitamin b, and folic acid. I usually take a bunch of supplements but eating a good meal usually does the trick. Unfortunately having an ED sucks ass and I can't stand feeling full and I can't purge anymore because of seizures and my teeth being all fucked up.",
      "created_utc": 1599596960.0,
      "score": 6,
      "context": [
        {
          "id": "g4frw0d",
          "author": "jeykehey",
          "body": "those, my friend, are the benefits of fueling your mind and body! binging in and of itself has no benefits, especially long term. im not sure how low you restrict, but id 100% recommend upping your intake a bit. you'll feel better and binge less.",
          "created_utc": 1599570694.0
        },
        {
          "id": "g4fsy36",
          "author": "internerderner2",
          "body": "I know what you mean, it's just that I already maintain a healthy weight by eating an adequate (according to the dietitian) amount of calories on a daily basis, therefore I'm very very resistant to upping calories. I guess my body is just broken.",
          "created_utc": 1599571376.0
        }
      ]
    }
  ]
}