{
  "id": "iwfkp2",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1600614722.0,
  "title": "I swear, feeling full and satisfied after a meal and not feeling like I could eat that meal x10 again is one of the best feelings ever.",
  "selftext": "Before recovery (malnourished, underweight):\n- I would be so scared of eating (especially out and with others) because I knew if I started, I couldn’t be able to stop.\n- I would eat way more than everyone on the rare occasions that I’d eat out.\n- I’d often finish my food, look at others food and want to eat off their plate (I didn’t, unless it was my husband, embarrassing though)\n- I was NEVER FULL. I only realized this was because I was in a calorie deficit for so long and it was my body’s way of trying to get me to gain weight and be healthy. Not because I have a black hole of a stomach.\n- all I could think and fantasize about was food. All the food I wish I could eat. Looking at yelp photos of restaurants. Blocking food accounts because looking at them was torture.\n- during thanksgiving and Christmas, I legit ate for a family at 10... I wasn’t getting full no matter the amount of servings I’d have. It was fucking crazy the amount of food I could fit in my stomach.\n- this lead me to a horrible binge/restrict cycle to maintain UW.\n\nNow (7 months of self recovery and gaining to a healthy weight)\n- I’m not scared to eat out. I know I’ll get full.\n- I can share a meal out with my husband and enjoy it. Not be a bitch about sharing, or being so aware of how much he’s taking vs. me. Being UW made me so “greedy” with food, maybe because my body thought it was the only time it was going to eat.\n- I can have a pastry or HALF! without going overboard. I never thought I’d see the day.\n- energy levels, mood, libido, period, everything back. No more weird chest pains or extreme coldness.\n\nAs much as I am still not comfortable w my recovery body, getting my fullness cues back has been one of the best things.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/iwfkp2/i_swear_feeling_full_and_satisfied_after_a_meal/",
  "score": 151,
  "num_comments": 12,
  "comments": [
    {
      "id": "g5zrz00",
      "author": "bikecrotchthrowaway",
      "body": "I was just like you in the before stage! Except I was never underweight and now I'm pretty seriously overweight. But I used to be so scared of eating out at restaurants or \"letting go\" and now I don't finish meals if I'm not hungry which I'd never done before in my LIFE",
      "created_utc": 1600617899.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g5zmdlb",
      "author": "halfcupgrapes",
      "body": "Yes this is the best!",
      "created_utc": 1600615177.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g60f1pc",
      "author": "lizzhao07",
      "body": "i’m a week into recovery and i feel like i could eat so much... ahh i hope one day i won’t need to eat tons of food, feel full, and still want to eat more",
      "created_utc": 1600626816.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g5zqmb4",
      "author": "aryalaya",
      "body": "Congratulations on your recovery so far, must have been so hard to do it all by yourself! I'm so glad to hear, that others experience this greediness too, my boyfriend always wants to finish my food and it's driving me nuts most days :D",
      "created_utc": 1600617317.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g621agu",
      "author": "m3r3d1th_",
      "body": "Yes!! I was so afraid of recovery when I was sick bc I thought everyone felt like they had a bottomless pit in their stomach. Further into recovery I get full and it’s a wonderful feeling (once I fight back the guilt) anyway, I feel hungry so I’m going to eat!! Lunch!! :)",
      "created_utc": 1600652821.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g60f8xd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600626886.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g61w2ab",
      "author": "elizabethhayley",
      "body": "I can really relate to not being able to sense these cues, especially when times are tough. I'm so happy you've done the work to recover past that point. Thank you for sharing HOPE! ❤️",
      "created_utc": 1600649789.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g60iunq",
      "author": "green131313",
      "body": "Do you have to gain weight for recovery like this?",
      "created_utc": 1600628096.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g63ef4u",
      "author": "internerderner2",
      "body": "I am exactly like your \"before\", except I'm no longer underweight, therefore I don't feel justified to gain :(",
      "created_utc": 1600691090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g60umgw",
      "author": "None",
      "body": "it will happen for you if you just stick thru the hardest part!",
      "created_utc": 1600633070.0,
      "score": 4,
      "context": [
        {
          "id": "g60f1pc",
          "author": "lizzhao07",
          "body": "i’m a week into recovery and i feel like i could eat so much... ahh i hope one day i won’t need to eat tons of food, feel full, and still want to eat more",
          "created_utc": 1600626816.0
        }
      ]
    },
    {
      "id": "g622yw0",
      "author": "lovenote123",
      "body": "Quarantine + extreme hunger kind of forced me to recover. Then day by day challenging the ED thoughts and go against them. Your ED says skip breakfast? Eat it. It says no peanut butter? Eat pb. Come up with an excuse to not go out because fear of eating out? Just go. You’ll realize how much memories you’ve missed just to not eat.. and that ED logic is pathetic. Everyday challenge those thoughts.",
      "created_utc": 1600653789.0,
      "score": 7,
      "context": [
        {
          "id": "g60f8xd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600626886.0
        }
      ]
    },
    {
      "id": "g621e4w",
      "author": "m3r3d1th_",
      "body": "Follow lots of pro-recovery accounts on social media and surround yourself with people who will encourage and support you. My self-recovery was kickstarted by a friend who also had an ED but had since recovered.",
      "created_utc": 1600652882.0,
      "score": 3,
      "context": [
        {
          "id": "g60f8xd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600626886.0
        }
      ]
    },
    {
      "id": "g65zzbs",
      "author": "withonlygrace",
      "body": "If you’re underweight, yes. If you’re not, sometimes. You can’t have recovered thoughts with a malnourished body.",
      "created_utc": 1600734097.0,
      "score": 3,
      "context": [
        {
          "id": "g60iunq",
          "author": "green131313",
          "body": "Do you have to gain weight for recovery like this?",
          "created_utc": 1600628096.0
        }
      ]
    }
  ]
}