{
  "id": "j2wt9e",
  "subreddit": "fuckeatingdisorders",
  "author": "Reapermanee",
  "created_utc": 1601506941.0,
  "title": "I used to be a member of a pro-ED community. I'm so sorry.",
  "selftext": "In 2018, I was an active member of a pro-eating disorder website. Every day, I would scroll through the site obsessively for hours. I would read forum post after forum post about really triggering things to motivate myself to continue destroying my mind and body. Most regrettably, though, I would post the worst, most triggering things multiple times a day. One of these forums was dedicated to something called \"body checks\", where people posted images of their bodies (usually in some state of undress) as a way to visually measure physical changes. For months, I posted in this forum nearly every day. \n\nMy sick body is out on the internet. It's there for everyone to see. I cannot imagine how many people I triggered with my content. I regret my actions so deeply. Without intending to, I fueled people's disorder. I gave them reasons to keep hurting themselves. I gave them images, posts about my obsessive exercise routine, and fatphobia to read. I gave them material to take notes from to apply in real life. I participated in a destructive, toxic community. For that, I am so sorry. \n\nI am so glad I've left that community and haven't returned to it in two years now. I NEVER want to be part of that toxicity again. Instead, I want to motivate others to embrace themselves as they are and continue choosing recovery. I want to be a better person. I hope that as the years go by, I can participate more in the recovery community. Everyone deserves to accept and love who they are, and nobody deserves to live in misery. If you are actively participating in the pro-ED community, I highly encourage you to leave; as much as your ED will be pissed at first, you are doing yourself a favor.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/j2wt9e/i_used_to_be_a_member_of_a_proed_community_im_so/",
  "score": 128,
  "num_comments": 9,
  "comments": [
    {
      "id": "g799k2b",
      "author": "minor7flat6",
      "body": "who here hasn’t been a member of such a community? i don’t say that to minimize what you said. it’s beautiful and responsible and i appreciate it. but just... you don’t have to feel too guilty. it’s not that uncommon. having an ED is still relatively poorly understood. there isn’t that much societal help for it, and what does exist is only kind of... adequate at best. so those of us with them seek each other out. it’s only natural. we’re animals. we want to connect with each other more deeply than anything else.\n\nyou’re doing great. you owe yourself some kindness IMO. you rock. keep going towards recovery. it’s gotta be worth it.",
      "created_utc": 1601528215.0,
      "score": 49,
      "context": []
    },
    {
      "id": "g79adxb",
      "author": "MySenpai13",
      "body": "Hey, i did this before too, so many of us have. It's important we realise that we've done wrong and take responsibility, then again we were also sick, some of us still are sick. We wouldn't have done it if we knew truly how harmful it was. Don't beat yourself up over it, i won't either. Nobody told us how wrong that was, we had to find out on our own skin.",
      "created_utc": 1601528808.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g79f4aw",
      "author": "None",
      "body": "A pro ED community got me into self harm :/ theyre toxic to the core",
      "created_utc": 1601532414.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g79hfnf",
      "author": "LittlePurrx",
      "body": "I used to be part of a community like that too, about 14 years ago. Didn't post any photos though, but I was reading. It's quite common, I think. Give yourself some credit on getting out of that <3",
      "created_utc": 1601534399.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g79vwvm",
      "author": "None",
      "body": "I was also a member of those kinds of communities, I didn't post my own body but I reposted pictures of others I thought were \"motivational\" and I would write really triggering posts about my body and eating. \n\nI agree with others who say the majority of us have probably contributed to or at least visited these communities at some point. they're horrible places but you should not be too hard on yourself :)",
      "created_utc": 1601550384.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g79a46p",
      "author": "Reapermanee",
      "body": "Oh for sure!!! I definitely don't want my post to come off like \"this is a unique experience to me\" or \"if you were ever part of the pro ED community you should feel so bad about yourself!!!\" I just truly am realizing the consequences of my past actions. Pro-ED communities are SO intriguing and attractive to people with EDs who feel alone and are desperately seeking out a community who \"gets it\". It's the main reason I joined the community in the first place. I just acknowledge that what I did was really harmful, I wish I'd never engaged in the community (especially to the degree I did), and I want to encourage everyone to seek out support communities that actually foster recovery as opposed to encouraging self-destruction. \n\nAnd thank you 💗 recovery is worth it, and everyone is worth recovery!",
      "created_utc": 1601528606.0,
      "score": 19,
      "context": [
        {
          "id": "g799k2b",
          "author": "minor7flat6",
          "body": "who here hasn’t been a member of such a community? i don’t say that to minimize what you said. it’s beautiful and responsible and i appreciate it. but just... you don’t have to feel too guilty. it’s not that uncommon. having an ED is still relatively poorly understood. there isn’t that much societal help for it, and what does exist is only kind of... adequate at best. so those of us with them seek each other out. it’s only natural. we’re animals. we want to connect with each other more deeply than anything else.\n\nyou’re doing great. you owe yourself some kindness IMO. you rock. keep going towards recovery. it’s gotta be worth it.",
          "created_utc": 1601528215.0
        }
      ]
    },
    {
      "id": "g79c4xl",
      "author": "Reapermanee",
      "body": "Absolutely. When the eating disorder side of us takes over, all logic and reasoning goes out the window. Engaging in such a community is not something we should demonize ourselves over for being a part of. We were really sick and struggling and feeling so alone in our struggles. But I also just felt like taking some responsibility for my actions. I've kind of acted like I've never been pro-ED and I just wanted to say \"hey, actually, I've been there and done that, and I'm going to actively try and be more engaged in a supportive recovery oriented community instead now\".",
      "created_utc": 1601530082.0,
      "score": 6,
      "context": [
        {
          "id": "g79adxb",
          "author": "MySenpai13",
          "body": "Hey, i did this before too, so many of us have. It's important we realise that we've done wrong and take responsibility, then again we were also sick, some of us still are sick. We wouldn't have done it if we knew truly how harmful it was. Don't beat yourself up over it, i won't either. Nobody told us how wrong that was, we had to find out on our own skin.",
          "created_utc": 1601528808.0
        }
      ]
    },
    {
      "id": "g79g5p4",
      "author": "Reapermanee",
      "body": "I'm so sorry that you experienced that 😞 growing up, I've seen a multitude of pro ED sites, and some were more encouraging of self-destructive behaviors than others. Encouraging self harm is truly awful.",
      "created_utc": 1601533280.0,
      "score": 2,
      "context": [
        {
          "id": "g79f4aw",
          "author": "None",
          "body": "A pro ED community got me into self harm :/ theyre toxic to the core",
          "created_utc": 1601532414.0
        }
      ]
    },
    {
      "id": "g7b1d6n",
      "author": "minor7flat6",
      "body": "that’s the thing — i don’t totally agree that what you did was *really* harmful. i live in downtown portland. a couple days ago had a conversation with a guy who had no shoes. last night walked around past a line of tents outside the justice center.\n\nthere are people in the world who *really* hurt others. those people are usually the ones in power, in business, in government. seeking power is a natural impulse, and it’s healthy to acknowledge the harmful effects. but i would just say i believe that the deep emotion associated with saying something is *really* harmful is actually a description best suited for people like the police officers physically brutalizing people or legislators voting to eliminate services for them. pro-ED sites are more under the heading of “youthful indiscretion.” which absolutely can be harmful. but it’s also universal because we do crazy things to cope when we’re younger and typically those things lessen with time. and so it’s just not the same type of volitional choice. in my mind that’s what make the different categories more or less ethically severe — was it a choice? and was it so common among others to indicate a groupthink phenomenon or other biological imperative over which we have little control?\n\nnot arguing that the effects of pro-ED are trivial. not at all. people die. even if they don’t lives are ruined. it’s about choice and premeditation imo.\n\nall that said i really liked your post and i am super pleased for you to be recovering and also enjoying this friendly little ethics debate lol. hope you have a splendid day!!! 😁",
      "created_utc": 1601572681.0,
      "score": 2,
      "context": [
        {
          "id": "g799k2b",
          "author": "minor7flat6",
          "body": "who here hasn’t been a member of such a community? i don’t say that to minimize what you said. it’s beautiful and responsible and i appreciate it. but just... you don’t have to feel too guilty. it’s not that uncommon. having an ED is still relatively poorly understood. there isn’t that much societal help for it, and what does exist is only kind of... adequate at best. so those of us with them seek each other out. it’s only natural. we’re animals. we want to connect with each other more deeply than anything else.\n\nyou’re doing great. you owe yourself some kindness IMO. you rock. keep going towards recovery. it’s gotta be worth it.",
          "created_utc": 1601528215.0
        },
        {
          "id": "g79a46p",
          "author": "Reapermanee",
          "body": "Oh for sure!!! I definitely don't want my post to come off like \"this is a unique experience to me\" or \"if you were ever part of the pro ED community you should feel so bad about yourself!!!\" I just truly am realizing the consequences of my past actions. Pro-ED communities are SO intriguing and attractive to people with EDs who feel alone and are desperately seeking out a community who \"gets it\". It's the main reason I joined the community in the first place. I just acknowledge that what I did was really harmful, I wish I'd never engaged in the community (especially to the degree I did), and I want to encourage everyone to seek out support communities that actually foster recovery as opposed to encouraging self-destruction. \n\nAnd thank you 💗 recovery is worth it, and everyone is worth recovery!",
          "created_utc": 1601528606.0
        }
      ]
    }
  ]
}