{
  "id": "j56igk",
  "subreddit": "fuckeatingdisorders",
  "author": "Colubrine",
  "created_utc": 1601845286.0,
  "title": "Had a REVELATION",
  "selftext": "I’ve finally (after a significant amount of suffering haha) realised that I cannot keep exercising at the rate that I do without increasing my food intake. \n\nLow food intake and intense exercise is destroying me and leaving me without enough energy to take care of myself and do basic tasks. I can’t not eat, lose weight and exercise at the same time for any protracted period of time. \n\nToday I realised that actually the sports I do are more important to me than controlling my food. I enjoy them so much and I love spending time with my team mates and widening my life and perspectives outside of feeling sorry for myself because I’m scared of calories. \n\nSo I’m going to eat much more so I can do much more and actually enjoy my life!!!!\n\nJust wanted to share with people who understand 🥰",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/j56igk/had_a_revelation/",
  "score": 114,
  "num_comments": 5,
  "comments": [
    {
      "id": "g7q8spn",
      "author": "avocantdough",
      "body": "This is so inspiring.",
      "created_utc": 1601849542.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g7qijyw",
      "author": "None",
      "body": "Well done you! Omg :) I’m so proud of you!",
      "created_utc": 1601855184.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g7r83zm",
      "author": "plaginum",
      "body": "so proud of u for realizing this!!",
      "created_utc": 1601870979.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7rknw0",
      "author": "Silver_Oakleaf",
      "body": "What a wonderful revelation! So happy to hear you’ve decided to take that step!!! 🙃🙃🙃",
      "created_utc": 1601882780.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7vuvo7",
      "author": "deena812044",
      "body": "So wonderful, good for you! Don't let the creepy voices talk you out of this important revelation. I didn't realize, or couldn't act on it in time. I used to be able to run half marathons, rock climb or mountain bike for hours, stay out late dancing. My eating disorder broke down my body so much that I couldn't walk a mile without getting dizzy, and my feet hurt all the time now. little by little things are getting better in recovery, but apparently I'm one of those people whose body is going to take at least a couple years to heal. So basically between the year that my body broke down and my long recovery process, I've lost the ability to do sports and adventure travel for 3 to 4 years. At least that's what I hope :/ I really hope I'll get back to being able to do those things I love again. Hold on to the important things and cherish them, and nourish your body so you can keep on living your life!!",
      "created_utc": 1601983180.0,
      "score": 1,
      "context": []
    }
  ]
}