{
  "id": "j6t8gd",
  "subreddit": "fuckeatingdisorders",
  "author": "miathemango",
  "created_utc": 1602085557.0,
  "title": "it’s around one year in recovery for me, so here’s a list of things i’ve gained besides weight",
  "selftext": "*1.) an amazing relationship with everyone around me.*\n\ni was very isolated in my ed, and while recovering i’ve regained relationships with everyone i really care about. no more hiding things, no more having to feel alone.\n\n*2.) a healthy relationship with the gym*\n\ni use the gym as a form of stress relief now. no more doing cardio that i always dread and not even feeling accomplished afterwards.\n\n*3.) loving my body for once*\n\nin my ed i never thought gaining weight would make me more confident in my body, but it really truly has. i can look in the mirror and genuinely like what i look at. obviously i have my bad days, but if i do, im not focused on my body all day. i move on from the bad thoughts because they simply do not matter.\n\n*4.) enjoying activities besides things involving food*\n\nin my ed nothing interested me if it didn’t involve food. now i can paint, write, read, watch tv shows, and play games and be perfectly entertained. in my ed i never thought this was possible. i thought i was addicted to food but that’s not the case.\n\n*5.) finding my style*\n\nin my ed i was constantly cold so i was always wear a sweatshirt and leggings or sweatpants. now i can wear jeans and cute shirts because im not constantly freezing.\n\nif gaining weight is holding u back from recovering, let go. gaining weight will give you your life back.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/j6t8gd/its_around_one_year_in_recovery_for_me_so_heres_a/",
  "score": 133,
  "num_comments": 11,
  "comments": [
    {
      "id": "g81hqna",
      "author": "None",
      "body": "I love all of this!! congrats on getting to a year and the best with you <3\n\nalso p.s., not a lot of people talk about point 5! i used to wear black all the damn time but now in recovery, I'm starting to realise i love wearing green and red (not at the same time!),",
      "created_utc": 1602103776.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g823zv7",
      "author": "orangepekoes",
      "body": "That's amazing, congrats! Sadly for me the weight gain has made me even more reclusive. I'm going to see some family I haven't seen in a while this weekend and I'm embarrassed about it but will try my hardest not to think about it.",
      "created_utc": 1602115570.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g80jlux",
      "author": "wallace1313525",
      "body": "So happy for you!!",
      "created_utc": 1602087140.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g81a2la",
      "author": "EastofEatin",
      "body": "So proud of you! Keep going ❤😘",
      "created_utc": 1602099991.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81ald4",
      "author": "avocantdough",
      "body": "I am SO happy for you. This is so inspiring to read!! For anyone reading this comment, you will get there too!!",
      "created_utc": 1602100249.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81dcrp",
      "author": "neverendinganger",
      "body": "so proud and happy for you! and this was so so helpful to read, thank you :)",
      "created_utc": 1602101601.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81p1if",
      "author": "None",
      "body": "This makes me so happy to read, thank you for sharing and congratulations on your recovery!",
      "created_utc": 1602107530.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8399pz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1602144012.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g82cbbq",
      "author": "miathemango",
      "body": "keep going! wishing u luck in recovery. you’ll get past this",
      "created_utc": 1602120239.0,
      "score": 3,
      "context": [
        {
          "id": "g823zv7",
          "author": "orangepekoes",
          "body": "That's amazing, congrats! Sadly for me the weight gain has made me even more reclusive. I'm going to see some family I haven't seen in a while this weekend and I'm embarrassed about it but will try my hardest not to think about it.",
          "created_utc": 1602115570.0
        }
      ]
    },
    {
      "id": "g81ahlp",
      "author": "miathemango",
      "body": "thank you!",
      "created_utc": 1602100198.0,
      "score": 3,
      "context": [
        {
          "id": "g80jlux",
          "author": "wallace1313525",
          "body": "So happy for you!!",
          "created_utc": 1602087140.0
        }
      ]
    },
    {
      "id": "g81ai0j",
      "author": "miathemango",
      "body": "thank you!!",
      "created_utc": 1602100203.0,
      "score": 2,
      "context": [
        {
          "id": "g81a2la",
          "author": "EastofEatin",
          "body": "So proud of you! Keep going ❤😘",
          "created_utc": 1602099991.0
        }
      ]
    },
    {
      "id": "g841s53",
      "author": "miathemango",
      "body": "i got a dietitian in the beginning but after a while i didn’t feel the need for one. i still see a therapist to this day. the beginning was little wins but the little wins are the biggest in the beginning. i went through feelings of guilt and i had breakdowns on a regular basis, but something told me to keep going, so i did. now i barely even think about food and if i do, i follow my hunger. i get guilty feelings on occasion, but looking back at the beginning, i am so much happier and content in my recovery. i am not as uncomfortable as i was in the beginning either.",
      "created_utc": 1602167988.0,
      "score": 1,
      "context": [
        {
          "id": "g8399pz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1602144012.0
        }
      ]
    }
  ]
}