{
  "id": "jc3ks5",
  "subreddit": "fuckeatingdisorders",
  "author": "One-Acanthopterygii4",
  "created_utc": 1602823968.0,
  "title": "I'm too fat to be taken seriously in my disorder",
  "selftext": "a few weeks ago I relapsed. well. . .kinda. I was doing IE and still lost weight bc my shit is fucked.\n\nANYWAY. I passed out before work-life legit hit the deck-and when I called out my boss said he wanted a drs note for me to return.\n\nI went to the Dr and told him I had an ED and I was concerned. They did some blood work and didn't find anything to be deficient. sick, right? well this MF looked at me and said \"good job on the weight loss! looks like you've lost abt xx lbs. keep it up!\"\n\nand that stuck with me so much that when things got really bad and my therapist brought up hospitalization I told her my blood work was good a few weeks ago and that there's no way I'm sick enough to go inpatient.\n\nI feel so invalid. I get it,y recovery weight was high bc I was bingeing constantly but holy shit I can't get that Drs voice out if my head. How much weight do I need to lose to be taken seriously? what's the fucking issue here? how many days do I have to go without eating for it to be a problem???\n\nfuck, man. we not doing well, loves.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/jc3ks5/im_too_fat_to_be_taken_seriously_in_my_disorder/",
  "score": 91,
  "num_comments": 11,
  "comments": [
    {
      "id": "g8z6pdn",
      "author": "Reapermanee",
      "body": "My friend with atypical anorexia ran into this issue often. I won't tell her story or private details bc it's inappropriate to tell someone else's story, but she was never taken seriously until many years down the line and after changing health care providers/centers several times. So absolutely infuriating. \n\nNo matter what your doc says, your issues are 100% vaild and serious. Shame on them for saying something so both untrue and inappropriate. \"Normal\" labs don't mean shit when it comes to EDs; even at my sickest, a lot of labs came back in some \"normal\" range. Did that mean I wasn't sick? Absolutely NOT!!! And it doesn't mean you're any less sick, either. \n\nScrew that doc. You are valid. 💞 If possible, I'd suggest switching to a new doc, one that will take you seriously.\n\nEDIT: Inspired by the latest poster, if anyone reading this is located in WA state, I have several centers and body posi medical professionals/medical professionals educated on EDs that have openings in their practices! Please feel free to shoot me a PM or inbox and I can provide recovery oriented resources! OP and everyone reading this deserves recovery 💗",
      "created_utc": 1602827056.0,
      "score": 26,
      "context": []
    },
    {
      "id": "g8zdcdm",
      "author": "momoguri",
      "body": "Okay, you don't need to lose more weight to be taken seriously. Your doctor was in the wrong here, and that was uncalled for especially when you informed him that you have an ED. I hate it how it always seems to be an issue with weighing too little or too much. Even some psychiatrists don't seem to understand that EDs are not about how much you weigh or how you look. It's a coping mechanism for coping with uncomfortable feelings, unbearable living situations.... the reasons are numerous.\n\nI have some personal experience with this too. I've been denied inpatient because I was normal weight, even though I was in agony mentally and the nurse I went to see acknowledged that (she was the one who sent the request to take me in). But in the end, I didn't want to go to an inpatient facility that only focuses on weight restoration and cannot offer anything else (I've heard this is the case with a lot of inpatient places). That said, seek a second opinion. You deserve to be helped, you deserve to be taken seriously and treated with respect. <3",
      "created_utc": 1602833534.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g8zm180",
      "author": "LittlePurrx",
      "body": "I also am in a bigger body now, and it's almost impossible to get taken seriously about my ED :( When I had anorexia, it was so much easier to get understanding, but now it's just assumptions and dismissive attitudes all over the place. I've now decided to contact a private clinic that can help, as I've given up on the national health system here.",
      "created_utc": 1602843404.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g8zthlf",
      "author": "None",
      "body": "this is actually sickening, how can DOCTORS be so uneducated about eating disorders? I'm so sorry this happened to you, don't let an idiotic doctor from stopping you getting the help you deserve.",
      "created_utc": 1602850213.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g8z9r94",
      "author": "None",
      "body": "I have an ED and live in a larger body and there are doctors out there who know better and care! I have seen too DOs (instead of MDs) who not only get it but have studied HAES and follow Dr. Jennifer Gaudiani’s work. I recommend looking into a local DO if you’re not already seeing one as they tend to have a different approach & to read Sick Enough by Dr. Gaudiani!\n\nYou deserve treatment! What you went through with work and your doctor is truly awful but there is hope. The people who really know EDs know better.",
      "created_utc": 1602829898.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g90900e",
      "author": "novelle",
      "body": "Your experience is valid. Your struggle is valid. Your eating disorder is real. Your doctor is a piece of work jerk face. \n\nYour eating disorder is actively trying to stay alive while you are actively trying to fight it.  IT is holding tight to what your doctor said because that view of 'not sick enough' helps the ED hold on tighter and stay alive longer. \n\nRemember that your boss is concerned for you.  Members of this forum validate you.  **Your therapist (who is trained and knowledgeable about you) has advised for inpatient treatment and is taking you and your illness very seriously.**  \n\nThe ED forces one to see the world in 'all or nothing' ways and to overgeneralize information that suits it.  Your doctor was in the wrong and is only one voice.  You, the forum here, your therapist, etc. etc. all support you. You've got this.  You absolutely deserve support.",
      "created_utc": 1602859673.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g90r4uj",
      "author": "Mysterious_Ideal",
      "body": "Legitimately primary care doctors, at least in America, do not get much education on things like nutrition, eating disorders, mental health issues, or gynecology. They might have spent 2-5 hours on each of these tops in the entirety of their education. If they didn’t do a rotation in an ed clinic, etc., they just... have no idea what they’re looking at.",
      "created_utc": 1602868776.0,
      "score": 6,
      "context": [
        {
          "id": "g8zthlf",
          "author": "None",
          "body": "this is actually sickening, how can DOCTORS be so uneducated about eating disorders? I'm so sorry this happened to you, don't let an idiotic doctor from stopping you getting the help you deserve.",
          "created_utc": 1602850213.0
        }
      ]
    },
    {
      "id": "g8zr0q1",
      "author": "helgatitsbottom",
      "body": "What is a DO?",
      "created_utc": 1602848245.0,
      "score": 1,
      "context": [
        {
          "id": "g8z9r94",
          "author": "None",
          "body": "I have an ED and live in a larger body and there are doctors out there who know better and care! I have seen too DOs (instead of MDs) who not only get it but have studied HAES and follow Dr. Jennifer Gaudiani’s work. I recommend looking into a local DO if you’re not already seeing one as they tend to have a different approach & to read Sick Enough by Dr. Gaudiani!\n\nYou deserve treatment! What you went through with work and your doctor is truly awful but there is hope. The people who really know EDs know better.",
          "created_utc": 1602829898.0
        }
      ]
    },
    {
      "id": "g90sxtv",
      "author": "None",
      "body": "I think its fairly similar here in the UK, doctors are not qualified to diagnose EDs, you just have to be lucky enough to get a doctor who takes you seriously and refers you to a specialist. thankfully my doctor was extremely professional and made sure I got to see a specialist... alot of people  especially if they are not underweight cannot get a diagnosis  because their doctor doesn't care.",
      "created_utc": 1602869677.0,
      "score": 2,
      "context": [
        {
          "id": "g8zthlf",
          "author": "None",
          "body": "this is actually sickening, how can DOCTORS be so uneducated about eating disorders? I'm so sorry this happened to you, don't let an idiotic doctor from stopping you getting the help you deserve.",
          "created_utc": 1602850213.0
        },
        {
          "id": "g90r4uj",
          "author": "Mysterious_Ideal",
          "body": "Legitimately primary care doctors, at least in America, do not get much education on things like nutrition, eating disorders, mental health issues, or gynecology. They might have spent 2-5 hours on each of these tops in the entirety of their education. If they didn’t do a rotation in an ed clinic, etc., they just... have no idea what they’re looking at.",
          "created_utc": 1602868776.0
        }
      ]
    },
    {
      "id": "g90306j",
      "author": "Discalced-diapason",
      "body": "Doctor of Osteopathy. They have the same training as an MD, as well as osteopathic manipulation. They’re also trained to be more holistic in looking at their patient instead of focusing on the symptoms. \n\nDr. Mike on YouTube is a DO.",
      "created_utc": 1602856383.0,
      "score": 1,
      "context": [
        {
          "id": "g8z9r94",
          "author": "None",
          "body": "I have an ED and live in a larger body and there are doctors out there who know better and care! I have seen too DOs (instead of MDs) who not only get it but have studied HAES and follow Dr. Jennifer Gaudiani’s work. I recommend looking into a local DO if you’re not already seeing one as they tend to have a different approach & to read Sick Enough by Dr. Gaudiani!\n\nYou deserve treatment! What you went through with work and your doctor is truly awful but there is hope. The people who really know EDs know better.",
          "created_utc": 1602829898.0
        },
        {
          "id": "g8zr0q1",
          "author": "helgatitsbottom",
          "body": "What is a DO?",
          "created_utc": 1602848245.0
        }
      ]
    },
    {
      "id": "g903awy",
      "author": "helgatitsbottom",
      "body": "Ahhh, it seems this is a US only thing; we don’t have them in my country.",
      "created_utc": 1602856554.0,
      "score": 3,
      "context": [
        {
          "id": "g8z9r94",
          "author": "None",
          "body": "I have an ED and live in a larger body and there are doctors out there who know better and care! I have seen too DOs (instead of MDs) who not only get it but have studied HAES and follow Dr. Jennifer Gaudiani’s work. I recommend looking into a local DO if you’re not already seeing one as they tend to have a different approach & to read Sick Enough by Dr. Gaudiani!\n\nYou deserve treatment! What you went through with work and your doctor is truly awful but there is hope. The people who really know EDs know better.",
          "created_utc": 1602829898.0
        },
        {
          "id": "g8zr0q1",
          "author": "helgatitsbottom",
          "body": "What is a DO?",
          "created_utc": 1602848245.0
        },
        {
          "id": "g90306j",
          "author": "Discalced-diapason",
          "body": "Doctor of Osteopathy. They have the same training as an MD, as well as osteopathic manipulation. They’re also trained to be more holistic in looking at their patient instead of focusing on the symptoms. \n\nDr. Mike on YouTube is a DO.",
          "created_utc": 1602856383.0
        }
      ]
    }
  ]
}