{
  "id": "jdoywp",
  "subreddit": "fuckeatingdisorders",
  "author": "Reapermanee",
  "created_utc": 1603057346.0,
  "title": "I'm in the largest body I've ever been... And I kind of don't care???",
  "selftext": "I was struggling at the beginning of the year, but now, I am doing so well in recovery. I still have some insecurities, but I legit don't hate myself at all anymore. My appearance used to be all I fixated on. I used to measure my worth in how many clothing sizes I could drop in 3 months. In how few meals I ate. In how many pounds I lost overnight. Now, those things don't even cross my mind. \n\nI order the food I want. I eat the portion size I want. I don't resort to 6 hours of exercise to \"make up for it\". I just live my life, eat my food, and continue on with my day. I feel so free. My anorexia held me down since I was 7 years old. Now, at 24, I feel more alive than ever. Thank you to everyone who has ever supported me on here. Through the lows and highs. Even if I've never met you, I love you and wish you only the best. Fuck your eating disorder. You are worthy of life. 💗",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/jdoywp/im_in_the_largest_body_ive_ever_been_and_i_kind/",
  "score": 162,
  "num_comments": 25,
  "comments": [
    {
      "id": "g9a810f",
      "author": "flowingfawn",
      "body": "Im so happy for you!!! I hope you continue on this recovery path",
      "created_utc": 1603072505.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g99i8ef",
      "author": "mariah-xo",
      "body": "yes ur fucking awesome!!!! this was great to read so proud of u!!! <3",
      "created_utc": 1603057639.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g9afzxb",
      "author": "jessiemail04",
      "body": "Congrats and you go, queen!",
      "created_utc": 1603077428.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9b0982",
      "author": "KnittingWine",
      "body": "I feel the same way, and I feel guilty. Thank you for reminding me not to ❤️",
      "created_utc": 1603095257.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9bpj2x",
      "author": "HaloTopHoe",
      "body": "Omg you're freakin amazing!! I'm so jealous! I've been stuck in this quasi recovery BS for over 6 months and I swear  I can't seem to just completely break free!!! At least I'm maintaining and not losing ahain, but I'm still underweight and miserable . You give me hope though! That was so great to read! Hopefully I can feel that way soon!!❤❤❤",
      "created_utc": 1603115904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9bsj32",
      "author": "Mjinzy",
      "body": "sameeeee recovery feels great (besides those insecurities sometimes)",
      "created_utc": 1603117385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmv9pfe",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612994733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g99ztbg",
      "author": "bobosiwa_",
      "body": "POP OFF GIRLL 🥳🥳🥰",
      "created_utc": 1603067758.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g9a1nv6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1603068829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9arfke",
      "author": "Ditz3n",
      "body": "Sounds great! I also ate a big breakfast today with oats and proteinpowder mixed in! For the first time I actually biked to school without freezing in 2 degrees celcius. These are the things I use to remember to eat, because it helps with me living through my day being happy!",
      "created_utc": 1603086121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9a9eq1",
      "author": "Reapermanee",
      "body": "Ty!!! And me, too. This is my first year back in recovery & I'm working really hard to stay out of residential again. Spent 2018 and 2019-early 2020 in facilities, and I really don't want to make it a pattern to relapse and go to res every year.",
      "created_utc": 1603073360.0,
      "score": 10,
      "context": [
        {
          "id": "g9a810f",
          "author": "flowingfawn",
          "body": "Im so happy for you!!! I hope you continue on this recovery path",
          "created_utc": 1603072505.0
        }
      ]
    },
    {
      "id": "g99ig1s",
      "author": "Reapermanee",
      "body": "💗💗💗 you're a fucking rockstar too!!! Never forget it 💞",
      "created_utc": 1603057752.0,
      "score": 5,
      "context": [
        {
          "id": "g99i8ef",
          "author": "mariah-xo",
          "body": "yes ur fucking awesome!!!! this was great to read so proud of u!!! <3",
          "created_utc": 1603057639.0
        }
      ]
    },
    {
      "id": "g9aoods",
      "author": "Reapermanee",
      "body": "tysm!!! 💞",
      "created_utc": 1603083688.0,
      "score": 2,
      "context": [
        {
          "id": "g9afzxb",
          "author": "jessiemail04",
          "body": "Congrats and you go, queen!",
          "created_utc": 1603077428.0
        }
      ]
    },
    {
      "id": "g9e2kc5",
      "author": "Reapermanee",
      "body": "💗 no matter what your ED screams at you, the shape of your body does not define who you are as a person.",
      "created_utc": 1603157472.0,
      "score": 2,
      "context": [
        {
          "id": "g9b0982",
          "author": "KnittingWine",
          "body": "I feel the same way, and I feel guilty. Thank you for reminding me not to ❤️",
          "created_utc": 1603095257.0
        }
      ]
    },
    {
      "id": "g9e3o0e",
      "author": "Reapermanee",
      "body": "💞💞💞 thank you! Oh boy, been there @ the quasi recovery BS!!! For me, it was all about embracing the whole process, putting trust into the process, and forming a close knit circle of friends who are all recovery oriented that got me to where I am today. Even in PHP and IOP, I was using behaviors because I knew that if I let myself actually eat 3 meals and a snack I would gain. The idea of gaining can be so scary. But being alive and enjoying life in a larger body beats barely scraping by in a very sick, undernourished body. \n\nI believe in you 💞 I sincerely believe everyone is capable of recovery. I dealt with this shit since single digits, wasn't sure if I'd ever come even close to recovery. But look at me now!!! You are capable💞 take EVERY win you have in recovery and run with it. Gas yourself up. Celebrate yourself. Even if the win seems \"little\" or \"pathetic\" or \"meaningless\", just run with it and let it motivate you to continue choosing health over the disorder.",
      "created_utc": 1603158101.0,
      "score": 1,
      "context": [
        {
          "id": "g9bpj2x",
          "author": "HaloTopHoe",
          "body": "Omg you're freakin amazing!! I'm so jealous! I've been stuck in this quasi recovery BS for over 6 months and I swear  I can't seem to just completely break free!!! At least I'm maintaining and not losing ahain, but I'm still underweight and miserable . You give me hope though! That was so great to read! Hopefully I can feel that way soon!!❤❤❤",
          "created_utc": 1603115904.0
        }
      ]
    },
    {
      "id": "g9e3vfy",
      "author": "Reapermanee",
      "body": "Absolutely!!! So glad to hear you've embraced recovery 💞 it feels awesome to be truly living as opposed to just barely staying alive.",
      "created_utc": 1603158222.0,
      "score": 2,
      "context": [
        {
          "id": "g9bsj32",
          "author": "Mjinzy",
          "body": "sameeeee recovery feels great (besides those insecurities sometimes)",
          "created_utc": 1603117385.0
        }
      ]
    },
    {
      "id": "gmvutjy",
      "author": "Reapermanee",
      "body": "Totally get this! I had the same fears myself in early recovery. For a while, I tried to recover without \"gaining too much weight\"; I ate the bare minimum at treatment so they wouldn't kick me out & would use behaviors in secret at home in order to keep controlling my weight and body shape. I was SO SCARED of what being in a larger body & clothing size would mean for me. I had a LOT of paranoias around what that would mean for me, the biggest paranoia being \"if I gain weight, everyone will hate me and not want anything to do with me.\" These worries kept me up at night, they kept me from going out with friends, and ultimately they kept me spiraling in my disorder. \n\nThen, after landing myself in res the second time, I became incredibly determined to \"do recovery right\" and actually make an effort to get better. Even in times of distress, I kept my trust in my treatment team, I listened and participated in the groups more, I ate the food (or drank the supplements), I opened up to the treatment team when I was struggling so they could help talk me off the ledge, and I started communicating more with my supportive, recovery oriented friends. When I got released from res & stepped down to PHP/IOP, I will fully admit that I struggled for a few months; was basically doing what I did before, eating the bare minimum at treatment & using behaviors whenever I wasn't in the treatment building. My body was continuing to change, and I knew that if I followed the meal plan 100% and stopped using behaviors entirely, it would keep changing a bit more. I didn't know if the weight gain and body changes would EVER stop if I fully committed to recovery, and I was scared that if I let myself eat more, I'd just keep getting bigger and bigger & my loved ones would despise me/judge me for it. Had a LOT of conversations with my dietician, therapist, and PCP about my fears, and they all reminded me that if I truly do want to fight back at the ED, I needed to treat my body with respect, and that the respectful thing to let my body do is eat when it's hungry, that the physical changes are temporary and will stop when I'm at a more stable place, and that if the people in my social circles were \"true friends\" then they'd love me no matter what I look like after leaving treatment. \n\nAt first, I practically rolled my eyes when they would tell me stuff like that, but one day I decided to just take a chance & see if they were right, and I bit the bullet and fully embraced recovery around April of last year. For the first time ever, I was properly nourishing myself, even when left by myself. I wasn't using behaviors. I focused my attention on how I could make myself happier instead of skinnier. My body did contine to grow a bit, and now have been stable at whatever weight I'm at currently for a while (I don't weigh myself & my doctor doesn't share it with me, so I have no idea how much I weigh, which helps with recovery immensely since I hyperfocus on numbers). I ran into a bump in the road when I FINALLY accepted the fact that 80% of my closet didn't fit me anymore, but I quickly overcame the lapse by reminding myself that I deserve to live a healthy life, that my loved ones think I'm worthy, that buying a few new shirts and pants in a larger size isn't a reflection on who I am as a person, & that my eating disorder does not have my best interests in mind. \n\nI also had a couple very serious conversations with my Dad about things that helped me through, and made me sincerely believe that my loved ones DO think I'm good enough, even at my current weight. We both broke down and cried about stuff together, and he told me over and over that he loves me, is inspired by my commitment to recovery, and that all he wants is for me to stay alive and just be happy. Having my dad in my corner as my cheerleader has gotten me through the roughest days, and I always leave conversations with him feeling significantly less triggered and insecure. I also opened up to a couple of my friends about my paranoia around them leaving me because I'm in a larger body, and they just reassured me that they're incredibly proud of me for recovering & coming back stronger, and that they feel nothing but love and respect for me & my journey to self-acceptance, and I sincerely believe them, just like I believe my dad when he reassures me I'm enough. \n\nTL;DR: Focusing on my well-being/happiness and leaning on my support system have both majorly helped me accept physical recovery. I wish you only the best! You CAN do it, even if it's scary!!! 💖 and ty for your kind words!!! I'm incredibly proud of the work I put in over this past year or so, and I have zero regrets over choosing recovery. I almost died pulling my ED BS 24/7, and I'm so glad I didn't & still have a chance at building the life I truly want for myself 😁 (also sorry for accidentally writing a friggin novel, lol!)",
      "created_utc": 1613004904.0,
      "score": 1,
      "context": [
        {
          "id": "gmv9pfe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612994733.0
        }
      ]
    },
    {
      "id": "g9a9i0v",
      "author": "Reapermanee",
      "body": "✌😎👍",
      "created_utc": 1603073419.0,
      "score": 2,
      "context": [
        {
          "id": "g99ztbg",
          "author": "bobosiwa_",
          "body": "POP OFF GIRLL 🥳🥳🥰",
          "created_utc": 1603067758.0
        }
      ]
    },
    {
      "id": "g9aa1np",
      "author": "Reapermanee",
      "body": "💗 it takes time. Not every day is a great body image day, even a year into recovery. I'm gonna say something sooo cliche, but it's really helped me: YEET THAT SCALE!!! I have not known my weight since winter of last year, and it's significantly helped me. And if you get weighed at a doctors office, you can always ask them to let you step on the scale backwards and not say your weight out loud or print it on your visit summary. Most doctors will respect this request 😁 Give yourself some grace, you're doing your best!",
      "created_utc": 1603073738.0,
      "score": 11,
      "context": [
        {
          "id": "g9a1nv6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603068829.0
        }
      ]
    },
    {
      "id": "g9e4c83",
      "author": "Reapermanee",
      "body": "Yay!!!! It feels awesome to eat those delicious, comforting foods without regret; to just see it as you fueling your body for the day to come as opposed to something \"bad\" or \"evil\". And it's awesome that you're not totally frozen from being outside for a while! I remember the first time in years that I stood outside in shorts and a t-shirt without getting so cold I have to change into sweats and a long sleeve; happened just this summer, and it was so trippy, but absolutely wonderful.",
      "created_utc": 1603158492.0,
      "score": 2,
      "context": [
        {
          "id": "g9arfke",
          "author": "Ditz3n",
          "body": "Sounds great! I also ate a big breakfast today with oats and proteinpowder mixed in! For the first time I actually biked to school without freezing in 2 degrees celcius. These are the things I use to remember to eat, because it helps with me living through my day being happy!",
          "created_utc": 1603086121.0
        }
      ]
    },
    {
      "id": "g9a9ji1",
      "author": "flowingfawn",
      "body": "Its normal to struggle more some days, just remember not to be hard on yourself for it! If you have a bad day you calm yourself down and start again in the morning. You should be really pride of yourself lovely",
      "created_utc": 1603073443.0,
      "score": 5,
      "context": [
        {
          "id": "g9a810f",
          "author": "flowingfawn",
          "body": "Im so happy for you!!! I hope you continue on this recovery path",
          "created_utc": 1603072505.0
        },
        {
          "id": "g9a9eq1",
          "author": "Reapermanee",
          "body": "Ty!!! And me, too. This is my first year back in recovery & I'm working really hard to stay out of residential again. Spent 2018 and 2019-early 2020 in facilities, and I really don't want to make it a pattern to relapse and go to res every year.",
          "created_utc": 1603073360.0
        }
      ]
    },
    {
      "id": "g9emhsd",
      "author": "KnittingWine",
      "body": "Thank you ❤️❤️🥰",
      "created_utc": 1603170564.0,
      "score": 2,
      "context": [
        {
          "id": "g9b0982",
          "author": "KnittingWine",
          "body": "I feel the same way, and I feel guilty. Thank you for reminding me not to ❤️",
          "created_utc": 1603095257.0
        },
        {
          "id": "g9e2kc5",
          "author": "Reapermanee",
          "body": "💗 no matter what your ED screams at you, the shape of your body does not define who you are as a person.",
          "created_utc": 1603157472.0
        }
      ]
    },
    {
      "id": "g9fximu",
      "author": "HaloTopHoe",
      "body": "Thank you so much for your kind words of encouragement. It really means alot. It's just hard to fully recover right now when I'm so depressed. But I will take your words to heart and keep fighting",
      "created_utc": 1603208484.0,
      "score": 2,
      "context": [
        {
          "id": "g9bpj2x",
          "author": "HaloTopHoe",
          "body": "Omg you're freakin amazing!! I'm so jealous! I've been stuck in this quasi recovery BS for over 6 months and I swear  I can't seem to just completely break free!!! At least I'm maintaining and not losing ahain, but I'm still underweight and miserable . You give me hope though! That was so great to read! Hopefully I can feel that way soon!!❤❤❤",
          "created_utc": 1603115904.0
        },
        {
          "id": "g9e3o0e",
          "author": "Reapermanee",
          "body": "💞💞💞 thank you! Oh boy, been there @ the quasi recovery BS!!! For me, it was all about embracing the whole process, putting trust into the process, and forming a close knit circle of friends who are all recovery oriented that got me to where I am today. Even in PHP and IOP, I was using behaviors because I knew that if I let myself actually eat 3 meals and a snack I would gain. The idea of gaining can be so scary. But being alive and enjoying life in a larger body beats barely scraping by in a very sick, undernourished body. \n\nI believe in you 💞 I sincerely believe everyone is capable of recovery. I dealt with this shit since single digits, wasn't sure if I'd ever come even close to recovery. But look at me now!!! You are capable💞 take EVERY win you have in recovery and run with it. Gas yourself up. Celebrate yourself. Even if the win seems \"little\" or \"pathetic\" or \"meaningless\", just run with it and let it motivate you to continue choosing health over the disorder.",
          "created_utc": 1603158101.0
        }
      ]
    },
    {
      "id": "g9acjj4",
      "author": "AsparagusQueen",
      "body": "You are such a sweetheart thanks for this. I will get rid of the damn scale one of these days it just brings me missery. I cant even fathom going to the doc cause i dont want my weight to be recorded lol im insane bye",
      "created_utc": 1603075250.0,
      "score": 3,
      "context": [
        {
          "id": "g9a1nv6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603068829.0
        },
        {
          "id": "g9aa1np",
          "author": "Reapermanee",
          "body": "💗 it takes time. Not every day is a great body image day, even a year into recovery. I'm gonna say something sooo cliche, but it's really helped me: YEET THAT SCALE!!! I have not known my weight since winter of last year, and it's significantly helped me. And if you get weighed at a doctors office, you can always ask them to let you step on the scale backwards and not say your weight out loud or print it on your visit summary. Most doctors will respect this request 😁 Give yourself some grace, you're doing your best!",
          "created_utc": 1603073738.0
        }
      ]
    },
    {
      "id": "g9ep5sg",
      "author": "Ditz3n",
      "body": "Yaiii! :D",
      "created_utc": 1603172864.0,
      "score": 2,
      "context": [
        {
          "id": "g9arfke",
          "author": "Ditz3n",
          "body": "Sounds great! I also ate a big breakfast today with oats and proteinpowder mixed in! For the first time I actually biked to school without freezing in 2 degrees celcius. These are the things I use to remember to eat, because it helps with me living through my day being happy!",
          "created_utc": 1603086121.0
        },
        {
          "id": "g9e4c83",
          "author": "Reapermanee",
          "body": "Yay!!!! It feels awesome to eat those delicious, comforting foods without regret; to just see it as you fueling your body for the day to come as opposed to something \"bad\" or \"evil\". And it's awesome that you're not totally frozen from being outside for a while! I remember the first time in years that I stood outside in shorts and a t-shirt without getting so cold I have to change into sweats and a long sleeve; happened just this summer, and it was so trippy, but absolutely wonderful.",
          "created_utc": 1603158492.0
        }
      ]
    },
    {
      "id": "g9e5ncq",
      "author": "Reapermanee",
      "body": "Not insane at all!!!  Trust me, I am the LAST person to call someone \"insane\"; at the height of my disorder, I did a lot of things that didn't quite make sense just because my ED voice told me to. The idea of someone else recording your weight and you not knowing can be REALLY difficult. There were some mornings in res where I almost refused to get on the scale because I didn't want a stranger seeing my weight and recording it for only treatment team to see. The key to recovery is just to keep checking that BS ED voice; whenever it pops up with some reason to do something disordered, you have to attack it with logic. Way easier said than done, but I believe in your ability to fight back 💗 it just takes practice. \n\nAlso, totally forgot to mention it before, but you can also request that the doc DOESN'T take your weight. You don't even have to go in detail about why. Just ask if they can do a normal visit minus the wiegh-in. 💞",
      "created_utc": 1603159252.0,
      "score": 2,
      "context": [
        {
          "id": "g9a1nv6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603068829.0
        },
        {
          "id": "g9aa1np",
          "author": "Reapermanee",
          "body": "💗 it takes time. Not every day is a great body image day, even a year into recovery. I'm gonna say something sooo cliche, but it's really helped me: YEET THAT SCALE!!! I have not known my weight since winter of last year, and it's significantly helped me. And if you get weighed at a doctors office, you can always ask them to let you step on the scale backwards and not say your weight out loud or print it on your visit summary. Most doctors will respect this request 😁 Give yourself some grace, you're doing your best!",
          "created_utc": 1603073738.0
        },
        {
          "id": "g9acjj4",
          "author": "AsparagusQueen",
          "body": "You are such a sweetheart thanks for this. I will get rid of the damn scale one of these days it just brings me missery. I cant even fathom going to the doc cause i dont want my weight to be recorded lol im insane bye",
          "created_utc": 1603075250.0
        }
      ]
    },
    {
      "id": "g9e9ufw",
      "author": "AsparagusQueen",
      "body": "Thanks! You speak the words of the wise 🤧",
      "created_utc": 1603161721.0,
      "score": 2,
      "context": [
        {
          "id": "g9a1nv6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603068829.0
        },
        {
          "id": "g9aa1np",
          "author": "Reapermanee",
          "body": "💗 it takes time. Not every day is a great body image day, even a year into recovery. I'm gonna say something sooo cliche, but it's really helped me: YEET THAT SCALE!!! I have not known my weight since winter of last year, and it's significantly helped me. And if you get weighed at a doctors office, you can always ask them to let you step on the scale backwards and not say your weight out loud or print it on your visit summary. Most doctors will respect this request 😁 Give yourself some grace, you're doing your best!",
          "created_utc": 1603073738.0
        },
        {
          "id": "g9acjj4",
          "author": "AsparagusQueen",
          "body": "You are such a sweetheart thanks for this. I will get rid of the damn scale one of these days it just brings me missery. I cant even fathom going to the doc cause i dont want my weight to be recorded lol im insane bye",
          "created_utc": 1603075250.0
        },
        {
          "id": "g9e5ncq",
          "author": "Reapermanee",
          "body": "Not insane at all!!!  Trust me, I am the LAST person to call someone \"insane\"; at the height of my disorder, I did a lot of things that didn't quite make sense just because my ED voice told me to. The idea of someone else recording your weight and you not knowing can be REALLY difficult. There were some mornings in res where I almost refused to get on the scale because I didn't want a stranger seeing my weight and recording it for only treatment team to see. The key to recovery is just to keep checking that BS ED voice; whenever it pops up with some reason to do something disordered, you have to attack it with logic. Way easier said than done, but I believe in your ability to fight back 💗 it just takes practice. \n\nAlso, totally forgot to mention it before, but you can also request that the doc DOESN'T take your weight. You don't even have to go in detail about why. Just ask if they can do a normal visit minus the wiegh-in. 💞",
          "created_utc": 1603159252.0
        }
      ]
    }
  ]
}