{
  "id": "jjo1ii",
  "subreddit": "fuckeatingdisorders",
  "author": "MissMagus",
  "created_utc": 1603892854.0,
  "title": "I re-hit the weight I was at when I stopped eating...",
  "selftext": "I won't post numbers, but I lost most of my bodyweight and then some when I developed bulimia after restricting for most of my adult life.  I was hospitalized.  Almost died.  Hair fell out.  Had some seizures.  Had to wear children's pants.  It was horrific.\n\nBut I recovered (don't wanna plug drugs, but smoking legal cannabis completely saved my life) and I finally weighed myself yesterday for the first time in forever.\n\nI look good.  I've been working really hard in recovery, and also just trying to get my life back together after I almost lost it.  The weight is distributing differently...which isn't bad.  Just.  Different.\n\nI had a moment where I wanted to just stop eating again to get back down to my \"initial\" goal weight.  But, I'm healthier now and realize those are the thoughts that got me in this shit hole to begin with.\n\nKeep on keeping on.  I'm not gonna let that stupid ass number dictate my life.  \n\nI'm happy to be alive.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/jjo1ii/i_rehit_the_weight_i_was_at_when_i_stopped_eating/",
  "score": 143,
  "num_comments": 2,
  "comments": [
    {
      "id": "gaei6yi",
      "author": "None",
      "body": "congratulations! weight restoration can be scary but it sounds like you have a really healthy attitude toward it.",
      "created_utc": 1603907123.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gaezlh9",
      "author": "clumsycouture",
      "body": "Congrats! I think I’ve weighed myself maybe 10 times in the last 9 years I’ve been in recovery. Fuck that stupid number. I was bulimic for 5 years and pot saved my life too, well that and my partner. He gave me the ultimatum of him or Bulimia and pot helped with the anxiety and shame. \n\nLuckily in Canada it’s legal for anybody whose over 18 now.",
      "created_utc": 1603915297.0,
      "score": 10,
      "context": []
    }
  ]
}