{
  "id": "jp4c7u",
  "subreddit": "fuckeatingdisorders",
  "author": "pearanormalactivity",
  "created_utc": 1604666197.0,
  "title": "The physical aspect of recovery (bloating, overshoot, etc)",
  "selftext": "No one really prepares you or tells you about how disgusting and painful recovery is.  \n\nWhen I first started recovering, I was bloating SO bad. My whole body was so swollen, especially in my face. If I ate literally slightly more than what I ate when I was anorexic, I would gain weight - just to give an idea of the bloating. I actually gained my weight rapidly after I let go of all the restrictions (like probably within a month or two?).  Let's not forget how painful it is to force-feed yourself 2500-3000 calories a day to gain weight. My stomach constantly felt like it was going to burst open from being so full. \n\nI ended up gaining quite a bit of weight and struggled with binging once my body was used to eating again. \n\nAfter about a year to a year and a half, my weight naturally fell back down to my set point. The bloating was completely gone. I ended up losing a bit of weight from my highest in recovery without changing my diet, really. \n\nAfter 2 years, I now eat 2000 calories + a day and my weight is in a completely healthy, slim range. I don't gain weight from having 1 calorie more of air like I did before, lol. It literally stays within the same range regardless of how much food I eat. \n\n&#x200B;\n\nI just wanted to share my win. I am so happy to finally have reached this place in my life where I can eat a little more without crying in my bed after lol.  Fuck eating disorders for taking so much of my life away, even through recovery.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/jp4c7u/the_physical_aspect_of_recovery_bloating/",
  "score": 284,
  "num_comments": 35,
  "comments": [
    {
      "id": "gbc8x12",
      "author": "radfordead",
      "body": "Thank you very much for your post. I’m only at the very beginning of my recovery and hate pretty much everything about it. It’s nice to hear something positive about recovery from someone from the other side :)",
      "created_utc": 1604666989.0,
      "score": 57,
      "context": []
    },
    {
      "id": "gbceu6i",
      "author": "problematicbeing",
      "body": "A year+ feels like a really long time to wait for things to normalize and even out when you're struggling hard with body dysmorphia and a loud ED voice.... BUT its really not that long in the big picture of your entire life and health. \n\n\nReally proud of you and your recovery! Thank you for sharing!",
      "created_utc": 1604670735.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gbchajw",
      "author": "Yoshilover644",
      "body": "Thank you for sharing this. Bloating is the main thing I struggle with and it got so bad in my face. Your post helped me realize I need to work harder at fighting the ED voice and allowing myself to eat but it’s still so difficult for me. My tummy feels so so round and I hate it.",
      "created_utc": 1604672048.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gbd6jt4",
      "author": "MotherElvis88",
      "body": "Congrats! I'm the same- now that my body is at it's set point (or 'happy weight' as I like to call it) it's almost impossible for me to gain weight. Even during the pandemic when I've gone from working in an office that involved lots of running around to working from home and sitting on my ass for eight hours a day I haven't gained an ounce. I think that after going through an eating disorder, and staying at your set point for a decent length of time your body will go to any lengths not to change this.",
      "created_utc": 1604683958.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gbcch8w",
      "author": "butternutsquashin",
      "body": "Just wanted to echo with lots of patience this was my experience as well!",
      "created_utc": 1604669339.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gbcjgrs",
      "author": "pinkgirl999",
      "body": "Thank you for sharing this! Ive been at my overshoot for a while now and still struggling with a lot of bloating 9 months in, so this was really really reassuring for me. Im so happy for you!",
      "created_utc": 1604673156.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gbdgnhb",
      "author": "Appropriate_Craft626",
      "body": "How long did the physical effects take to resolve? I’m about 4 months “all in” and still struggle with some fatigue and brain fog/vision symptoms. I think I’m at my overshoot weight and it’s stabilizing too",
      "created_utc": 1604688675.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gbcvy6m",
      "author": "daddydangles911",
      "body": "Thanks so much for sharing this, I really needed to hear it. I'm a couple months into recovery and finding my resolve wavering a bit because I feel like I'm just going to keep gaining forever and ever and I don't know if I could accept that. It's such a relief to hear that it will eventually stabilize even if you 100% let go of restriction.",
      "created_utc": 1604679145.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gbf47a8",
      "author": "linconnuedelaseine",
      "body": "I really needed to read this today. I’m a year and a couple months in and I’ve gained 70lbs and am now overweight. I Keep trying to just trust that it will all get better one day, but sometimes I wonder if my body will ever feel like a normal healthy body. My stomach sticks way out and I’m kind of puffy all over. Anyway, your store gives me hope.",
      "created_utc": 1604720014.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gbdonsa",
      "author": "Sourpatch_kiddo",
      "body": "Just chiming in to say I experienced the same thing. The beginning is always the hardest but my body now trusts me and it’s amazing",
      "created_utc": 1604692512.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gbd6qhf",
      "author": "HaloTopHoe",
      "body": "Thanks for this!!!! I've been stuck in quasi recovery for 6 months now and I'm miserable! At least I am maintaining 7lbs higher than my lowest. I KNOW I need to gain at LEAST 10 lbs more to not be underweight but it's so mentally hard! One day I'll be fine with the gain and not stress about eating, the next I'm back to restriction...ugh it's mentally and physically exhausting.",
      "created_utc": 1604684044.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gbe32fq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1604699321.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gbdilex",
      "author": "wildxxdaze",
      "body": "Thank you so much for sharing this and sending you so much love as you continue to heal on this recovery journey. I'm about 5 months into my OP treatment and the bloating is still real! It was comforting to read your shared experience of these symptoms as at times I wonder if I'm losing my mind!! (When really, it's healing). Thanks again for sharing this positivity. You're right, eating disorders fucking suck but the strength you have is incredible.",
      "created_utc": 1604689585.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hvah89t",
      "author": "cruisinforasnoozinn",
      "body": "That’s so uplifting! Well done!!\nNobody ever listens or wants to talk to me abt the insane gastrointestinal purgatory I’m placed in every time I try to gain weight, making it impossible to gain muscle, balance, strength or generally stay active in the process. I feel like I’m dragging a heavy life around behind me every day, and still forced to think obsessively about eating, only in an opposite way now. My healthy & physically male friends try to give me workout and diet advice and I’m like, “thanks! I’ll definitely use that”",
      "created_utc": 1643818037.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbdtini",
      "author": "salamandie",
      "body": "Im happy for you! I had that bloating and water retention in recovery, and when i first started eating again I ate just a few things and i got dizzy and cold and bloated and my stomach hurt so bad I ended up going to the hospital. Recovering is such a hard decision and a hard thing to actually go through with. People that have never had this disorder will never know just how awful it is. I had this eating disorder seven years ago and it's still the most traumatic, worst thing that I've ever had to go through.",
      "created_utc": 1604694846.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbeyl2r",
      "author": "moonlightbasil",
      "body": "going through overshoot right now and it's literal hell. i'm only 4.5 months and was hoping to start going down at 8-12 months. can u give more detail abt how long u were in ed and whether you did any exercise or not? for ex, i was 1 year full underweight with another year binge/restrict quasi.",
      "created_utc": 1604716672.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kwpo6oc",
      "author": "Fabulous_Platypus225",
      "body": "Did anyone else here have symptoms beside bloating? I gave up binging and purging and extreme laxative use last year, then went into extreme restriction to avoid the bloating, burping and acid reflux. Even water bloats me at this point.. im so scared im not going to get better. My therapist told me it could take 2 years or more of eating consistently for my symptoms to go away but they're just so extreme... im terrified",
      "created_utc": 1711492014.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkepuh1",
      "author": "Hefty_Psychology_911",
      "body": "Thank you for sharing this. I am still recovering and am about 13 months in, still have severe bloating, gas, and overshoot as well. I eat when hungry and stop when full. Just wondering you mentioned it takes about 1 year to normalise than it just fades away. What do you mean by this? Does it just disappear gradually and one day you wake up and notice, hey it's normal again, overshoot is gone, and the symptoms as well? \nThank you. ",
      "created_utc": 1724883573.0,
      "score": 3,
      "context": []
    },
    {
      "id": "is6yq8t",
      "author": "subtlecrush",
      "body": "today I am almost 60 days clean from bulimia and im doing well but I was so close today....SO close and this post brought me back down to a level headed mindset thank you",
      "created_utc": 1665688803.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwvj16e",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1731476210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "htrcvyy",
      "author": "None",
      "body": "Thank you for this post.",
      "created_utc": 1642869420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbc9bpc",
      "author": "pearanormalactivity",
      "body": "I’m glad it helps! The beginning of recovery is genuinely the worst part, but it only gets better from there. Keep strong.",
      "created_utc": 1604667274.0,
      "score": 17,
      "context": [
        {
          "id": "gbc8x12",
          "author": "radfordead",
          "body": "Thank you very much for your post. I’m only at the very beginning of my recovery and hate pretty much everything about it. It’s nice to hear something positive about recovery from someone from the other side :)",
          "created_utc": 1604666989.0
        }
      ]
    },
    {
      "id": "gbdnpqr",
      "author": "pearanormalactivity",
      "body": "For everything to go back to 100% normal again took roughly a year and a half. I had a case of extreme hunger when I fully let go, so I gained a fair amount of weight during it. You have to keep in mind that you’ve deprived your body for years already so it’ll take time to go back to normal. In my case, I had anorexia for 2 years so it makes sense that it took so long to stabilize. I’d imagine it depends on how severe your case is as to how long it takes. \n\nThings start to normalize after about the year mark tho. That’s when I noticed the biggest difference in physical symptoms. It just kinda fades away from there.",
      "created_utc": 1604692060.0,
      "score": 11,
      "context": [
        {
          "id": "gbdgnhb",
          "author": "Appropriate_Craft626",
          "body": "How long did the physical effects take to resolve? I’m about 4 months “all in” and still struggle with some fatigue and brain fog/vision symptoms. I think I’m at my overshoot weight and it’s stabilizing too",
          "created_utc": 1604688675.0
        }
      ]
    },
    {
      "id": "hszt551",
      "author": "None",
      "body": "Hi, how are you today?",
      "created_utc": 1642390966.0,
      "score": 1,
      "context": [
        {
          "id": "gbf47a8",
          "author": "linconnuedelaseine",
          "body": "I really needed to read this today. I’m a year and a couple months in and I’ve gained 70lbs and am now overweight. I Keep trying to just trust that it will all get better one day, but sometimes I wonder if my body will ever feel like a normal healthy body. My stomach sticks way out and I’m kind of puffy all over. Anyway, your store gives me hope.",
          "created_utc": 1604720014.0
        }
      ]
    },
    {
      "id": "j9nwymq",
      "author": "Advanced-Luck-2446",
      "body": "I’m in the same situation lol. How are you now?",
      "created_utc": 1677143233.0,
      "score": 1,
      "context": [
        {
          "id": "gbf47a8",
          "author": "linconnuedelaseine",
          "body": "I really needed to read this today. I’m a year and a couple months in and I’ve gained 70lbs and am now overweight. I Keep trying to just trust that it will all get better one day, but sometimes I wonder if my body will ever feel like a normal healthy body. My stomach sticks way out and I’m kind of puffy all over. Anyway, your store gives me hope.",
          "created_utc": 1604720014.0
        }
      ]
    },
    {
      "id": "gbdof7x",
      "author": "pearanormalactivity",
      "body": "It took me a really long time to go all into recovery! K was like you where I was “in” it, but not really lol. I still stayed underweight and restricted, just not as severely as before. I hit a point where I stopped caring and decided to just eat normally. I gained probably 6kg (12ish pounds) within the month, even though my calories were only 1800-2000.  But I just kept up with it tbh and got through the extreme hunger phase, and it all went back to normal. All the effects of the eating disorder and negative aspects of recovery disappeared, and now I can eat 2000 calories without gaining any weight. I really recommend just going all in and getting it over with.",
      "created_utc": 1604692398.0,
      "score": 10,
      "context": [
        {
          "id": "gbd6qhf",
          "author": "HaloTopHoe",
          "body": "Thanks for this!!!! I've been stuck in quasi recovery for 6 months now and I'm miserable! At least I am maintaining 7lbs higher than my lowest. I KNOW I need to gain at LEAST 10 lbs more to not be underweight but it's so mentally hard! One day I'll be fine with the gain and not stress about eating, the next I'm back to restriction...ugh it's mentally and physically exhausting.",
          "created_utc": 1604684044.0
        }
      ]
    },
    {
      "id": "gbghwvo",
      "author": "pearanormalactivity",
      "body": "Yes! The stomach pain was the worst! I had such extreme hunger at one point for like 6 months, and I just ate EVERYTHING. It was honestly really stressful because I couldn't stop myself, but it completely evened out afterward where I didn't feel as hungry anymore. And like you, it took a while for it to redistribute, as all of it was on my face and stomach.  \n\nTotally valid on not calorie counting! I find that it gives me comfort to still have a general idea of how much food I am eating, so I don't have to feel scared about it. I don't always count, though - there are days where I know it's been a bad day so I don't even try to calculate it lol.  \n\nStretchy pants and flowy skirts are saviors too!",
      "created_utc": 1604761579.0,
      "score": 3,
      "context": [
        {
          "id": "gbe32fq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1604699321.0
        }
      ]
    },
    {
      "id": "gbdnxuf",
      "author": "pearanormalactivity",
      "body": "Thank you! Yes, the bloating is the worst and was the source of so many tears lol. It 100% goes away though and your body fat/fluid distribution goes back to normal, but I know it can sometimes be hard to remember that when you’re in the midst of it. :)",
      "created_utc": 1604692169.0,
      "score": 5,
      "context": [
        {
          "id": "gbdilex",
          "author": "wildxxdaze",
          "body": "Thank you so much for sharing this and sending you so much love as you continue to heal on this recovery journey. I'm about 5 months into my OP treatment and the bloating is still real! It was comforting to read your shared experience of these symptoms as at times I wonder if I'm losing my mind!! (When really, it's healing). Thanks again for sharing this positivity. You're right, eating disorders fucking suck but the strength you have is incredible.",
          "created_utc": 1604689585.0
        }
      ]
    },
    {
      "id": "gbgg8dc",
      "author": "pearanormalactivity",
      "body": "I was anorexic for 2 years.  The first year was severe restriction where my goal was to keep losing and losing. The 2nd year was to appease my parents, so I gained 2lbs for them (lol) and restricted heavily to stay at the same weight (which was underweight). After that from when I actually started to recover, it took about 1.5 years to have my body fully heal from the damage it went through. \n\nI did exercise, but sort of sporadically. For the first year of recovery I didn’t really workout on my own, but I figure skated (I’m a figure skater) once or twice a week. I also took walks everyday / every other day. It was only actually this year that I committed to working out again and skating more seriously.  I don’t really have a straight forward answer to it, but I really recommend doing some physical activity (like taking walks) that doesn’t focus on building up your body. I feel like mentally it helped me not feel so bad about the fact that I was eating a lot more, plus it boosted my overall mood. I recommend a light activity like walking at first because it’s not so focused on building up your body like actual workouts are, which is kind of a “danger zone” for people with ED imo.",
      "created_utc": 1604760568.0,
      "score": 7,
      "context": [
        {
          "id": "gbeyl2r",
          "author": "moonlightbasil",
          "body": "going through overshoot right now and it's literal hell. i'm only 4.5 months and was hoping to start going down at 8-12 months. can u give more detail abt how long u were in ed and whether you did any exercise or not? for ex, i was 1 year full underweight with another year binge/restrict quasi.",
          "created_utc": 1604716672.0
        }
      ]
    },
    {
      "id": "lkqpew2",
      "author": "pearanormalactivity",
      "body": "Hmm I think it was a gradual change that happened over time rather than a “wake up one day and it’s all fixed” kind of change? Like my metabolism at the time was extremely messed up, I did some really severe damage to myself. :/ So I think it just takes time to reverse the damage. \n\nFrom what I can remember, I struggled with bloating for a very long time - I looked quite swollen everywhere for a period there, looking back at old pics now. But there was a point I hit where I was not actively gaining weight from eating a morsel of food, and my weight became relatively stable. The bloating eventually subsided after my weight stabilized (took some time). It was a long time ago now and at the time I kinda blocked out any thoughts about my body or what I was eating because it made me sad lol and was super triggering, so unfortunately this is as much as I remember. \n\nSide note - a recommendation I have is getting an instant pot / pressure cooker, if you’re not much of a cook. I literally hated cooking, so I struggled with eating nutritious food (which I think exacerbated the symptoms). But I’ve been able to make tons of nutritious food with low effort, and it has made a pretty extraordinary difference to my hair, nails, how I feel, bloating, etc. I lost like half of my hair during my ED and this is the only thing that has fixed that post recovery. \n\nHope it helps and congratulations on recovery!!! ❤️😊",
      "created_utc": 1725054915.0,
      "score": 2,
      "context": [
        {
          "id": "lkepuh1",
          "author": "Hefty_Psychology_911",
          "body": "Thank you for sharing this. I am still recovering and am about 13 months in, still have severe bloating, gas, and overshoot as well. I eat when hungry and stop when full. Just wondering you mentioned it takes about 1 year to normalise than it just fades away. What do you mean by this? Does it just disappear gradually and one day you wake up and notice, hey it's normal again, overshoot is gone, and the symptoms as well? \nThank you. ",
          "created_utc": 1724883573.0
        }
      ]
    },
    {
      "id": "lwvj17v",
      "author": "AutoModerator",
      "body": "This post has been removed because our automoderator detected it as spam. If you believe this action was made in error, please **report** this comment to bring it to the attention of the moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1731476211.0,
      "score": 1,
      "context": [
        {
          "id": "lwvj16e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1731476210.0
        }
      ]
    },
    {
      "id": "j9oxwdf",
      "author": "linconnuedelaseine",
      "body": "I’m much better now. It’s been 3 years and a few months since I started by journey in ED recovery and I’m so grateful I stuck it out. The weight gain process was so difficult. But it got better. One thing I did that was huge in my recovery after this post, was I found a different dietitian. I felt that the one I had just wasn’t listening to my fears and concerns. She really seemed to have an agenda and made little judgements about every food I chose to eat. I remember I went to this restaurant once and I wanted something fresher for dinner so I chose this salmon dish with quinoa and pomegranate seeds. But she asked if another other meals had looked good on the menu. I said the pizza did. And she then told me I should have chosen the pizza. Back then I didn’t trust myself yet. I worried my brain was somehow always tricking me into relapse. My dietitian spent a lot of time telling me my ED brain was and tricky and that I couldn’t trust myself. This went against what I was learning in therapy — that I could trust myself. My therapist was telling me I was strong and capable and that I needed to show compassion and curiosity toward my feelings. My dietitian was saying the opposite. Any time I shared concerns and doubts with mg dietitian I realized she just wanted me to follow her rhetoric and trust her judgement. She didn’t like questions or concerns. And ultimately no matter how much body positivity she preached or health at every size she taught, I didn’t feel safe with her because she didn’t welcome my questions or concerns. She got upset with them. I told my therapist how I felt and asked her for a new ED recovery dietitian. I told her what I wanted: someone who would hold me accountable and challenge me if they thought I was slipping into old thoughts or habits from my ED, BUT also someone who didn’t balk at or judge my individual ideas or questions about the nutrition info I was being given. She got a reference for me and I started with the new dietitian and it changed my life. I could be honest with her and she didn’t shoot me down. The old dietitian wanted to see me raging fear foods on a constant basis. And while I’m so glad I got comfortable eating fear foods I didn’t feel like there was any gently nutrition going on. This new dietitian was so helpful and balanced. She helped me find loving ways of choosing nourishing and balanced meals while also making sure I was keeping fun foods in my repertoire. She also told me I didn’t have to like where my body was at. The old dietitian kept trying to make me love and like how my overweight body looked and felt. And it just wasn’t authentic for me. She wanted me to just say I liked it but I didn’t. This new dietitian told me I didn’t have to like it, but that I needed to show it love and gratefulness for all it does for me. She said “you can work towards a more balanced body, but you need to be honest with yourself that you might not ever find a body shape you are super happy with. When you were in your ED you weren’t happy with your body either. So just don’t lie to yourself. And Be kind to your body as you seek more balance. “ this was revolutionary for me. She helped me talk through all my meals to find more balanced options and also how to work intuitive eating into balanced nutrition. If I told her I didn’t agree with an idea or teaching or I had concerns she accepted it but challenged it. It’s been so good for me. She also helped me find more balance in my activity and movement. She said “20 minutes a day of movement is a loving thing to do for your body whether it’s stretching, walking, yoga, weights, bike riding, rock climbing etc. Take it easy, and do it from a place of love for your body and how it makes you feel, not from a place of hate and shame for how your body looks.” I really embraced this and started telling myself, “I care about what my body can do and how it feels, now how it looks” and this changed everything. I started eating and moving in ways that supported this. I joined a Jiu Jitsu class and realized I needed to build strength to keep up so I started lifting weights. And then I realized I couldn’t build the muscle without eating really good amounts of food so I didn’t want to skip any meals. I wanted to actually build muscle and strength not break it down and hurt it. Then my sister started asking me to do fun run 5ks. So I would run once per week to gear up for the fun run and we had a blast. We take photos together in our fun run t shirts and we cheer each other along the run the whole way. Ultimately my weight has dropped down a bit since 2 years ago. And I don’t know if it will continue to do so or not. But I got so thrilled with seeing what my body was capable of doing if I just took good care of it, that I stopped worrying as much about how I look as often. Of course there are a host of reasons one deals with ED. My OCD definitely had a part to play, as well as a response to childhood trauma. But I’m on a journey. And I don’t expect perfection from myself. I know there will be great mountain top moments and tough valley moments. But that’s ok. Im glad I chose to move away from a dietitian who pushed her own agenda and ideology on me and found one who encouraged personal growth and individuality while also still lovingly challenging me and pushing me to growth. Bottom line: my best advice if you want it is to keep your recovery in a constant state of evaluation. If ever you feel like you’re at the end of your rope and want to give up entirely, then ask yourself if you’re getting the right support. Be really honest with your recovery team. Don’t lie to yourself or them. And if they are a good team they won’t judge your honesty, and they will help you find ways to move forward in recovery while also being mindful of how you feel. If you’re uncomfortable in your body a good team will hear you out and walk through this journey with you, not preaching at you and pulling you along THEIR path. And lastly I will say I have not relapsed in three years but that doesn’t mean my ED thoughts never arise. And rather than shush them I am honest about them. And a good care team will be not only ok with that, but welcome it. Keep going. I know it’s so hard. But it is so worth it. I hope you find peace and hope. You’re so brave to go on this journey. It’s a road not well worn for many. You can do this. I believe in you!",
      "created_utc": 1677165586.0,
      "score": 6,
      "context": [
        {
          "id": "gbf47a8",
          "author": "linconnuedelaseine",
          "body": "I really needed to read this today. I’m a year and a couple months in and I’ve gained 70lbs and am now overweight. I Keep trying to just trust that it will all get better one day, but sometimes I wonder if my body will ever feel like a normal healthy body. My stomach sticks way out and I’m kind of puffy all over. Anyway, your store gives me hope.",
          "created_utc": 1604720014.0
        },
        {
          "id": "j9nwymq",
          "author": "Advanced-Luck-2446",
          "body": "I’m in the same situation lol. How are you now?",
          "created_utc": 1677143233.0
        }
      ]
    },
    {
      "id": "gbdshs5",
      "author": "HaloTopHoe",
      "body": "Wow thank you! That's actually really encouraging! I'm considering just upping my weight training and \"bulking\" to convince myself to eat more lol",
      "created_utc": 1604694353.0,
      "score": 3,
      "context": [
        {
          "id": "gbd6qhf",
          "author": "HaloTopHoe",
          "body": "Thanks for this!!!! I've been stuck in quasi recovery for 6 months now and I'm miserable! At least I am maintaining 7lbs higher than my lowest. I KNOW I need to gain at LEAST 10 lbs more to not be underweight but it's so mentally hard! One day I'll be fine with the gain and not stress about eating, the next I'm back to restriction...ugh it's mentally and physically exhausting.",
          "created_utc": 1604684044.0
        },
        {
          "id": "gbdof7x",
          "author": "pearanormalactivity",
          "body": "It took me a really long time to go all into recovery! K was like you where I was “in” it, but not really lol. I still stayed underweight and restricted, just not as severely as before. I hit a point where I stopped caring and decided to just eat normally. I gained probably 6kg (12ish pounds) within the month, even though my calories were only 1800-2000.  But I just kept up with it tbh and got through the extreme hunger phase, and it all went back to normal. All the effects of the eating disorder and negative aspects of recovery disappeared, and now I can eat 2000 calories without gaining any weight. I really recommend just going all in and getting it over with.",
          "created_utc": 1604692398.0
        }
      ]
    },
    {
      "id": "llm8sda",
      "author": "Hefty_Psychology_911",
      "body": "Thank you. \nOne more thing, how soon do you think overshoot will drop down? At about 16 months or when? Does this happen gradually or relatively quickly?\nThank you ",
      "created_utc": 1725538578.0,
      "score": 1,
      "context": [
        {
          "id": "lkepuh1",
          "author": "Hefty_Psychology_911",
          "body": "Thank you for sharing this. I am still recovering and am about 13 months in, still have severe bloating, gas, and overshoot as well. I eat when hungry and stop when full. Just wondering you mentioned it takes about 1 year to normalise than it just fades away. What do you mean by this? Does it just disappear gradually and one day you wake up and notice, hey it's normal again, overshoot is gone, and the symptoms as well? \nThank you. ",
          "created_utc": 1724883573.0
        },
        {
          "id": "lkqpew2",
          "author": "pearanormalactivity",
          "body": "Hmm I think it was a gradual change that happened over time rather than a “wake up one day and it’s all fixed” kind of change? Like my metabolism at the time was extremely messed up, I did some really severe damage to myself. :/ So I think it just takes time to reverse the damage. \n\nFrom what I can remember, I struggled with bloating for a very long time - I looked quite swollen everywhere for a period there, looking back at old pics now. But there was a point I hit where I was not actively gaining weight from eating a morsel of food, and my weight became relatively stable. The bloating eventually subsided after my weight stabilized (took some time). It was a long time ago now and at the time I kinda blocked out any thoughts about my body or what I was eating because it made me sad lol and was super triggering, so unfortunately this is as much as I remember. \n\nSide note - a recommendation I have is getting an instant pot / pressure cooker, if you’re not much of a cook. I literally hated cooking, so I struggled with eating nutritious food (which I think exacerbated the symptoms). But I’ve been able to make tons of nutritious food with low effort, and it has made a pretty extraordinary difference to my hair, nails, how I feel, bloating, etc. I lost like half of my hair during my ED and this is the only thing that has fixed that post recovery. \n\nHope it helps and congratulations on recovery!!! ❤️😊",
          "created_utc": 1725054915.0
        }
      ]
    },
    {
      "id": "jc893vt",
      "author": "meganelizabeth-",
      "body": "Incredible journey, thank you for sharing!!",
      "created_utc": 1678840143.0,
      "score": 3,
      "context": [
        {
          "id": "gbf47a8",
          "author": "linconnuedelaseine",
          "body": "I really needed to read this today. I’m a year and a couple months in and I’ve gained 70lbs and am now overweight. I Keep trying to just trust that it will all get better one day, but sometimes I wonder if my body will ever feel like a normal healthy body. My stomach sticks way out and I’m kind of puffy all over. Anyway, your store gives me hope.",
          "created_utc": 1604720014.0
        },
        {
          "id": "j9nwymq",
          "author": "Advanced-Luck-2446",
          "body": "I’m in the same situation lol. How are you now?",
          "created_utc": 1677143233.0
        },
        {
          "id": "j9oxwdf",
          "author": "linconnuedelaseine",
          "body": "I’m much better now. It’s been 3 years and a few months since I started by journey in ED recovery and I’m so grateful I stuck it out. The weight gain process was so difficult. But it got better. One thing I did that was huge in my recovery after this post, was I found a different dietitian. I felt that the one I had just wasn’t listening to my fears and concerns. She really seemed to have an agenda and made little judgements about every food I chose to eat. I remember I went to this restaurant once and I wanted something fresher for dinner so I chose this salmon dish with quinoa and pomegranate seeds. But she asked if another other meals had looked good on the menu. I said the pizza did. And she then told me I should have chosen the pizza. Back then I didn’t trust myself yet. I worried my brain was somehow always tricking me into relapse. My dietitian spent a lot of time telling me my ED brain was and tricky and that I couldn’t trust myself. This went against what I was learning in therapy — that I could trust myself. My therapist was telling me I was strong and capable and that I needed to show compassion and curiosity toward my feelings. My dietitian was saying the opposite. Any time I shared concerns and doubts with mg dietitian I realized she just wanted me to follow her rhetoric and trust her judgement. She didn’t like questions or concerns. And ultimately no matter how much body positivity she preached or health at every size she taught, I didn’t feel safe with her because she didn’t welcome my questions or concerns. She got upset with them. I told my therapist how I felt and asked her for a new ED recovery dietitian. I told her what I wanted: someone who would hold me accountable and challenge me if they thought I was slipping into old thoughts or habits from my ED, BUT also someone who didn’t balk at or judge my individual ideas or questions about the nutrition info I was being given. She got a reference for me and I started with the new dietitian and it changed my life. I could be honest with her and she didn’t shoot me down. The old dietitian wanted to see me raging fear foods on a constant basis. And while I’m so glad I got comfortable eating fear foods I didn’t feel like there was any gently nutrition going on. This new dietitian was so helpful and balanced. She helped me find loving ways of choosing nourishing and balanced meals while also making sure I was keeping fun foods in my repertoire. She also told me I didn’t have to like where my body was at. The old dietitian kept trying to make me love and like how my overweight body looked and felt. And it just wasn’t authentic for me. She wanted me to just say I liked it but I didn’t. This new dietitian told me I didn’t have to like it, but that I needed to show it love and gratefulness for all it does for me. She said “you can work towards a more balanced body, but you need to be honest with yourself that you might not ever find a body shape you are super happy with. When you were in your ED you weren’t happy with your body either. So just don’t lie to yourself. And Be kind to your body as you seek more balance. “ this was revolutionary for me. She helped me talk through all my meals to find more balanced options and also how to work intuitive eating into balanced nutrition. If I told her I didn’t agree with an idea or teaching or I had concerns she accepted it but challenged it. It’s been so good for me. She also helped me find more balance in my activity and movement. She said “20 minutes a day of movement is a loving thing to do for your body whether it’s stretching, walking, yoga, weights, bike riding, rock climbing etc. Take it easy, and do it from a place of love for your body and how it makes you feel, not from a place of hate and shame for how your body looks.” I really embraced this and started telling myself, “I care about what my body can do and how it feels, now how it looks” and this changed everything. I started eating and moving in ways that supported this. I joined a Jiu Jitsu class and realized I needed to build strength to keep up so I started lifting weights. And then I realized I couldn’t build the muscle without eating really good amounts of food so I didn’t want to skip any meals. I wanted to actually build muscle and strength not break it down and hurt it. Then my sister started asking me to do fun run 5ks. So I would run once per week to gear up for the fun run and we had a blast. We take photos together in our fun run t shirts and we cheer each other along the run the whole way. Ultimately my weight has dropped down a bit since 2 years ago. And I don’t know if it will continue to do so or not. But I got so thrilled with seeing what my body was capable of doing if I just took good care of it, that I stopped worrying as much about how I look as often. Of course there are a host of reasons one deals with ED. My OCD definitely had a part to play, as well as a response to childhood trauma. But I’m on a journey. And I don’t expect perfection from myself. I know there will be great mountain top moments and tough valley moments. But that’s ok. Im glad I chose to move away from a dietitian who pushed her own agenda and ideology on me and found one who encouraged personal growth and individuality while also still lovingly challenging me and pushing me to growth. Bottom line: my best advice if you want it is to keep your recovery in a constant state of evaluation. If ever you feel like you’re at the end of your rope and want to give up entirely, then ask yourself if you’re getting the right support. Be really honest with your recovery team. Don’t lie to yourself or them. And if they are a good team they won’t judge your honesty, and they will help you find ways to move forward in recovery while also being mindful of how you feel. If you’re uncomfortable in your body a good team will hear you out and walk through this journey with you, not preaching at you and pulling you along THEIR path. And lastly I will say I have not relapsed in three years but that doesn’t mean my ED thoughts never arise. And rather than shush them I am honest about them. And a good care team will be not only ok with that, but welcome it. Keep going. I know it’s so hard. But it is so worth it. I hope you find peace and hope. You’re so brave to go on this journey. It’s a road not well worn for many. You can do this. I believe in you!",
          "created_utc": 1677165586.0
        }
      ]
    }
  ]
}