{
  "id": "jt2pmd",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1605213539.0,
  "title": "i am so fucking sick of nonfat milk",
  "selftext": "i’m sick of 2%, i’m sick of low-calorie, i’m sick of 300 calorie frozen meals, i’m so sick of ordering food and then freaking out about how much it is. it’s just goddamn food. it’s just a literal lifeless THING. it just sits there and i sit there and then cry and freak out and have breakdown and rip my hair out and lose my friends and i fucking HATE it more than anything. fuck you, food. fuck you and how fucking delicious you are. i am 105 goddamn pounds and i think i’m fat. i hâte myself and my body everytime i experience any bloat or change. i hate having no tits but i hate having tits more. i’m just so sick of feeling so disgusted and chaotic over something that should be an afterthought. i should be excited about going out to dinner. i should be able to eat when i’m sober. i should be able to feel okay about things. but i do and i hate that.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/jt2pmd/i_am_so_fucking_sick_of_nonfat_milk/",
  "score": 159,
  "num_comments": 7,
  "comments": [
    {
      "id": "gc3wqav",
      "author": "paperklipp",
      "body": "God, you’ve nailed this whole mood. Right there with you.",
      "created_utc": 1605230397.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gc41qc5",
      "author": "flowerscatsandqs",
      "body": "I could have written this post. I’m sorry you’re struggling so much, I’m right there with you. This sucks and I’m sick of it too.",
      "created_utc": 1605233246.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gc439j0",
      "author": "iwantanorangemouse",
      "body": "Yes. This is the mood. Fuck.",
      "created_utc": 1605234100.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gc4ivtm",
      "author": "BrowncoatIona",
      "body": "This definitely resonates. I so, so wish I never became so well-versed in the calorie content of nearly everything. Like, I want to just eat and not care. I want to not care about my body the way that I do. There are so, so, so many more important things than this. But everything I'm eat I'm bombarded. Everytime I look in the mirror it's cacophony. \n\nI dream of traveling and eating and not caring. Of eating a birthday dinner of whatever the hell I want and just enjoying it. Dietary restrictions makes it hard, my ED makes it impossible (or feels like that).",
      "created_utc": 1605243496.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gc44i6y",
      "author": "brookleiaway",
      "body": "i cant relate cause my family got non fat my whole life so ive never tasted the real milk",
      "created_utc": 1605234805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gc4i3qm",
      "author": "seinfeld-monster",
      "body": "you said it perfectly",
      "created_utc": 1605242949.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gc4jiqk",
      "author": "dortuh",
      "body": "ARE YOU ME cause I could have posted this word for word",
      "created_utc": 1605243951.0,
      "score": 1,
      "context": []
    }
  ]
}