{
  "id": "k1jdup",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1606411694.0,
  "title": "Whenever I hear someone saying that you can never fully recover from an ED, I just wanna kill myself.",
  "selftext": "I don't wanna deal with this shit for the rest of my life.\n\nI don't wanna \"manage\".\n\nI don't wanna have lingering thoughts that I get somewhat better at ignoring.\n\nI don't wanna be functional but low-key struggle inside at the same time.\n\nI don't wanna \"focus on a healthy diet\" or \"count calories but the healthy way\" or \"manage my weight\".\n\nI don't wanna \"have something like an addiction\" that flares up in times of stress.\n\nI don't wanna \"get better\".\n\nI just don't wanna have an ED.\n\nHow the fuck is \"you can never fully recover\" supposed to be motivating? It's the single most depressing thing ever. Why would I even bother trying to recover in the first place if that was true? Why would I wanna live a life like that?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k1jdup/whenever_i_hear_someone_saying_that_you_can_never/",
  "score": 170,
  "num_comments": 38,
  "comments": [
    {
      "id": "gdous1y",
      "author": "CozyJumpers",
      "body": "The whole \"remission\" concept is highly flawed and honestly 100% untrue. Many people have fully recovered from their EDs, please don't let these ignorant messages of \"never truly recovering\" get to you. They're usually told by people who don't really know what they're talking about anyways. Look up Tabitha Farrar on youtube, she had anorexia and fully recovered and is a strong advocate for true full recovery. \n\nYou're not going to have to live this way for the rest of your life <3",
      "created_utc": 1606417254.0,
      "score": 61,
      "context": []
    },
    {
      "id": "gdoq6rj",
      "author": "ForestRagamuffin",
      "body": "because life is good. easy words to say, but they are actually true imo. my ed was in remission for 10 years and they were wonderful years. i wouldn't trade them for anything. now i'm about 11 months into recovery from a hard relapse and like, it's been rough (sometimes awful), but i still wouldn't trade it for oblivion. i love my family and my queer fam. the process of recovering is a reward unto itself, not that i always remember that. i've gotten to know myself much better during recovery and it turns out that i'm worth getting to know (imo). so...it's true that eating disorders don't go away forever, but life doesn't end when the struggle begins. again, i know these words are easy to say and might sound trite, but the times when they ring true are times worth living for. just my 2 cents. i hope today is an ok day for you, but if not, i hope tomorrow is better. much solidarity!",
      "created_utc": 1606415232.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gdorjd6",
      "author": "None",
      "body": "This will always irk me about how we in the US handle recovery. This thought of “always having/being X(ed, addiction, mental illness)” is a uniquely American one and not how they view recovery in other western countries at all. \n\nIn my own life when i was recovering from drugs and alcohol I found it counter productive and more hurtful to my recovery than helpful. It shifts the focus from taking things one day at a time and places it to the rest of your life which is terrifying and intimidating. I had to seriously reshift the way I see recovery and spend time reading sources about recovery from other countries because they dont see it the same as we do in the states. Besides making your recovery a lifelong process makes you identify with your X and makes it a part of your personhood which makes it harder to recover and is counter intuitive to actually recovering.\n\nBtw, you can blame AA for making recovery a “lifelong process” even though there is all evidence points to the fact that recovery (at least for alcoholism) is stastically over after a year of sobriety since the chances of relapse are less than 5% if your a year sober. Less than 1% relapse rate after two years. Our entire thinking about recovery for everything (ed,addiction, mental illness) was built on ideas by a cult (AA) from 70 years that has, to this day zero evidence to prove the effectiveness of their methods. Look into recovery sources from outside the US where AA isnt a thing and you’ll see what I mean. \n\n\nTldr: recovery is only a lifelong process in the states because AA has such a hige monopoly on recovery here but in other countries recovery is seen as a much shorter process that isn’t lifelong.",
      "created_utc": 1606415832.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gdoxu36",
      "author": "None",
      "body": "This is so relatable - I could have written this a couple of years ago. \n\nI know this is a rant and you're not looking for advice, but if I was talking to my younger self I would say:\n\nSpoiler alert! \n\nYou can have a happy life. \n\nYou can learn to love food and your body. \n\nYou can have a healthy relationship with others. \n\nYou can live a much, much better life than you're currently living. \n\nThink about it this way: even \"normal\" people without EDs can have shitty thoughts from time to time or invasive thoughts - you know, like \"oh I wonder what would happen if I throw my phone out the window\" or \"omg what if I drop this baby.\" But they're so infrequent, small, inconsequential. They're not a part of your life, and they're not a part of you. \n\nOne day, the ED you once had will not be a part of your life. \n\nI don't have an eating disorder anymore. Sometimes, I look back on myself when I had an ED, and I feel a lot of compassion like I'm looking at a suffering stranger. I'm not the person I was anymore. I killed that old life, and I was reborn. \n\nYou're in the middle of the hardest part. It's like you're climbing a mountain and you're not able to even see the peak because it's dark and cloudy and foggy. But you just have to be curious enough to see whether the view is worth it or not. \n\nAnyway, OP, I sincerely do wish you luck. I think that what you're doing is brave and hard and also can be really really sucky. You're always welcome to rant here.",
      "created_utc": 1606418618.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gdp8ars",
      "author": "MaryContrary26",
      "body": "Don't believe it. I know too many people who are absolutely recovered (really).",
      "created_utc": 1606423297.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gdoz74w",
      "author": "ewoktuna",
      "body": "Here's my analogy and how it is like for me. My Ed is like being sprayed by a skunk. When you're in the height of it it is unbearable, it's all you can think about it consumes your every thought. Like the spray, it's soooo strong. But recovery is like taking the baths to wash it off. For some it takes fewer baths to get rid of the smell, some more. The thing about being sprayed by a skunk is you can get phantom smells of it later (even if you got all the oils off) and the experience is embedded in your brain. In other words it sticks with you years later. But it's nothing like how it was when you first got sprayed, it's a memory something you observe (ex. \"Oh, I smell skunk\" is like \" hey, that once triggered me years ago, these are the thoughts I used to have, hmmmm interesting.\") \n\nThere are soooo many more vectors/layers to EDs and mental health (like hormones, environment, drugs, other mental health problems etc...) But knowledge and growth in yourself is a weapon against it and when you get stuck in the black and white thinking of recovered vs. not, you miss everything that could help you. \n\nPlease, take a big breath, envision that mental stop sign, get off the cyclical thinking rollercoaster and talk to someone you trust/mental health professional. There is soooo much to live for. Please, please, please.",
      "created_utc": 1606419230.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gdoplxo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606414994.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gdp13nj",
      "author": "pabstpumpkinbeer",
      "body": "I 100000% believe in full recovery. I have personally witnessed it in friends... people I genuinely thought would be sick forever. And they're not anymore. It's possible.",
      "created_utc": 1606420069.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gdp70rk",
      "author": "LittlePurrx",
      "body": "You absolutely can fully recover! I've not got there yet, but my close friend has been fully 100% recovered for about ... 8 years or so now. She's a huge inspiration to me!",
      "created_utc": 1606422708.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gdp8jmc",
      "author": "Chrysoprase89",
      "body": "Whoa I thought I was the only one who felt this way! It made me not want to try to recover at all. I figured if I was going to be miserable, I might as well keep the ED. \n\nBut I have to say - I'm... oh man. 4 years out, I think? And especially for the past year, I just... have no ED behaviors/thoughts anymore. I dove right into intuitive eating and definitely had some binge/restrict cycles early on, for the first 6-12 months maybe, and then exercised too much, but slowly it all kinda evened out. My life is so rich and full now and I really barely ever think about my body size / shape - I \\*never\\* think about, much less count, calories. That's been the case for probably the past 2.5-3 years. \n\nI wish this line of thought would just go away. I don't think it's true at all.",
      "created_utc": 1606423408.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gdpb546",
      "author": "DisabledMuse",
      "body": "That's kind of BS to be fair. A lot of people manage to fully recover. Some people may have problems still, but usually it's because they're not dealing with the underlying mental issues of the ED itself. Like untreated mood disorders or not dealing with the body dysmorphia. It can get better. I'm mostly better and I'm here to let you know that it's not always going to be this bad. Recovery is like climbing a mountain. As long as you don't give up, one day you'll make it to the top and it will be downhill finally. There may be more ups and downs, but it will never be as hard or as long as it was to begin with. I promise.",
      "created_utc": 1606424621.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gdpmd7d",
      "author": "None",
      "body": "Your anger and despair are part of the recovery process. Allowing yourself to feel that anger and despair is important, but allowing it to consume you won’t help. Stay mindful of your emotions. You’re stronger than you think.",
      "created_utc": 1606431194.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdppzc0",
      "author": "muushugaipan",
      "body": "So the thing is, I WAS fully recovered. For four years I didn't think about what I ate, I didn't worry about numbers, I didn't know OR CARE what I weighed, I didn't engage in disordered behaviors, and medically I had reversed the damage that had been done.\n\nAnd then I relapsed. But I KNOW I can get back to that point, eventually.   And maybe next time it lasts for a little longer, or even forever.  Either way, fighting is worth it.",
      "created_utc": 1606433396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdq0qa8",
      "author": "pastelxbones",
      "body": "for me relapses are always a possibility and have happened, but when i’m fully in recovery i usually do well and don’t have too many intrusive thoughts or struggle eating.",
      "created_utc": 1606440197.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdqaq4f",
      "author": "lalaloui22",
      "body": "Marya Hornbacher, who said in Wasted that she didn’t believe she’d ever be free of her ED now considers herself fully recovered. It’s absolutely possible.",
      "created_utc": 1606446848.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdpnzyu",
      "author": "Retexo",
      "body": "I almost thought I wrote this. I understand these words you’re saying exactly. What’s the point of trying to recover when you never REALLY recover? I’ve fallen back on my ED because I’m just tired of fighting it. There’s no point anymore. It’ll be here forever so why not just give in. It’ll always be a fucking battle and I don’t think I can win the war. Should I eat this or will I gain too much? Should I avoid this even though I want it? Should I skip this meal? Should I eat more of this so I stay within my healthy weight range? I don’t want to go over or under my healthy weight range, but it takes too much work to manage it, especially when you can’t use a scale to legitimately know. Is this meal balanced enough? What if I ate too much protein and not enough carbs? What if I skip carbs for a day? Should I wake up early and eat breakfast or sleep extra and skip? I really want ____ but it’s unhealthy and I shouldn’t eat it. How do these other people eat like this without a thought about what they’re eating other than “it tastes good?” \n\nFuck all this shit.",
      "created_utc": 1606432191.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdppi6w",
      "author": "sexonalady",
      "body": "The thing is even if you do have small issues with it for the remainder of your life, it’s so worth it compared to how badly it feels to be in it. I’m just now in my third month of recovery and therapy and it is SO worth it already and is honestly rarely in the front of my mind. I don’t even think about food very much at all anymore like I used to. ‘Managing’ isn’t what you would think it is.",
      "created_utc": 1606433109.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdprw6o",
      "author": "MySenpai13",
      "body": "You can fully recover, I think it just means that some people are more prone to relapse later but I had anorexia and now I can eat perfectly normally and even occasionally overeat with only occasional thoughts about weight and calories, never enough to hurt me for more than a minute and to hate myself though.",
      "created_utc": 1606434573.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdpytr0",
      "author": "mochimochi16",
      "body": "My Mom had an eating disorder twice in her life and she tells me that it never completely goes away, you just have to block it out and don’t listen to it. She tells me I’ll be fighting with it for the rest of my life. She said she still fights against that voice everyday. It’s sad but unfortunately you can recover but there will always be that linger in the back of your mind.",
      "created_utc": 1606438942.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdqvu1z",
      "author": "sweetpotato37",
      "body": "My mum had anorexia from the age of 8, which turned to bulimia in her 20's. She recovered at the age of 35.\n\nShe eats normally now. Food doesn't control her. She eats what she wants, she snacks, her weight is normal, she doesn't overexercise or count calories etc.\n\nIt is doable. I promise.",
      "created_utc": 1606462814.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdoiiwl",
      "author": "hotlinehelpbot",
      "body": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "created_utc": 1606411706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdqzwxl",
      "author": "ablindbabywith7legs",
      "body": "I completely get this. I feel all these feelings and have my days where I feel so angry and share these exact thoughts too.\n\nI have no idea where you're at today, but I  say I've recovered from an eating disorder, not that I'm recovering. I don't like the mentality that this is something I have to suffer through every day of my life forever, because I don't think that will be the case for me. I have hope that soon these thoughts will be nothing more than something brief that comes and goes, not something I have to nurture intensely with every other breath \n\nI have hope this will be like drinking/drugs for me. With time the intense cravings and obsessive thoughts faded away, with spikes from tough events or bouts of loneliness or self-neglect, but even now I never think about drinking or using anymore. This happened at my 4th year of sobriety. I never want to use again. I hope me using food as a way to run from emotions will be the same.\n\nWhatever works for you you find it and you stick with it. Sometimes what works changes. Sometimes I feel wrong and realize I need to switch up how I'm coping. Some days are harder than others, but it is never like it used to be and I know that, but I don't have any crisises like I used to.\n\nMy worst day recovered is 5000 times better than my worst day struggling with my ED 100%\n\nEveryday I get to wake up as someone recovered from their eating disorder and ask myself if I want to live freely or if I want to suffer with my ED. It's a choice I can make every day. some days I act out a bit then catch myself, some times I have a few days where I'm not eating enough or I eat too much, but its nothing like it used to be. It's getting more normal, and the longer I have the easier it is to decide to live freely. It's harder in the short term to make that choice, it can be uncomfortable, but it's so fucking worth it. What's getting easier is the willingness to choose to live a life without my ED in any way. I guess every day I get to choose, the more time I get the more automatic that feels that I just am becoming this weird foreign person who is able to feel and cope with their feelings more and more\n\nI really hope this brings you some hope dude. I felt very trapped in loneliness for so long and I love this subreddit. The amount of times I woke up wanting to die, screaming to no one about how I don't want to be this person, begged a god I never believed in to make this all go away is heart breaking to look back on. I never thought I would be someone who has recovered from that fucked up nightmare. I'm coming up to a year without my ED",
      "created_utc": 1606466672.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdptd1z",
      "author": "None",
      "body": "I love Tabitha Farrar. I second this recommendation.",
      "created_utc": 1606435494.0,
      "score": 13,
      "context": [
        {
          "id": "gdous1y",
          "author": "CozyJumpers",
          "body": "The whole \"remission\" concept is highly flawed and honestly 100% untrue. Many people have fully recovered from their EDs, please don't let these ignorant messages of \"never truly recovering\" get to you. They're usually told by people who don't really know what they're talking about anyways. Look up Tabitha Farrar on youtube, she had anorexia and fully recovered and is a strong advocate for true full recovery. \n\nYou're not going to have to live this way for the rest of your life <3",
          "created_utc": 1606417254.0
        }
      ]
    },
    {
      "id": "gdp0n8h",
      "author": "None",
      "body": "Wait i didn't even think about this or know that \"always having it\" is a US idea. I'm in the states and I've been told by many providers that this is something that will always be with me. What sources can I look to outside of the US to get a different perspective? \n\nI struggle with identity issues around my ED and BPD and feel oddly \"connected\" to them. And then someone telling me that I'll always have them doesn't even give me a reason to try to get rid of them.. especially because im so attached to my mental illnessses and don't see a reason to give them up.",
      "created_utc": 1606419867.0,
      "score": 15,
      "context": [
        {
          "id": "gdorjd6",
          "author": "None",
          "body": "This will always irk me about how we in the US handle recovery. This thought of “always having/being X(ed, addiction, mental illness)” is a uniquely American one and not how they view recovery in other western countries at all. \n\nIn my own life when i was recovering from drugs and alcohol I found it counter productive and more hurtful to my recovery than helpful. It shifts the focus from taking things one day at a time and places it to the rest of your life which is terrifying and intimidating. I had to seriously reshift the way I see recovery and spend time reading sources about recovery from other countries because they dont see it the same as we do in the states. Besides making your recovery a lifelong process makes you identify with your X and makes it a part of your personhood which makes it harder to recover and is counter intuitive to actually recovering.\n\nBtw, you can blame AA for making recovery a “lifelong process” even though there is all evidence points to the fact that recovery (at least for alcoholism) is stastically over after a year of sobriety since the chances of relapse are less than 5% if your a year sober. Less than 1% relapse rate after two years. Our entire thinking about recovery for everything (ed,addiction, mental illness) was built on ideas by a cult (AA) from 70 years that has, to this day zero evidence to prove the effectiveness of their methods. Look into recovery sources from outside the US where AA isnt a thing and you’ll see what I mean. \n\n\nTldr: recovery is only a lifelong process in the states because AA has such a hige monopoly on recovery here but in other countries recovery is seen as a much shorter process that isn’t lifelong.",
          "created_utc": 1606415832.0
        }
      ]
    },
    {
      "id": "gds2uef",
      "author": "a0172787m",
      "body": "can attest to this as someone from an asian country. my friends with EDs (both recovered and not) don't tend to always see the ED as a core or necessarily important identity. for some people, maybe in the US, centering the \"recovering addict\" identity can help some people with getting out of the denial phase and getting committed to recovery. but that's not the only way to recover. I myself don't consider my ED a very big part of my identity even though it's arguably the most disruptive to my everyday life and well-being. some of my friends don't either and I don't think it's because they had it any easier recovering. do what you need to do to recover. a big part of my own struggle is/was also with feeling resigned to being mentally afflicted with ED forever even if I'm recovered in terms of my behaviours. but recently I've been seeing how enjoying food, being neutral or ok in one's body, feeling connected, not having to miss out on cool life things because of the ED can be within reach. it just took me a While to see that and it's important to know you deserve that even if you aren't necessarily there yet. I don't think Fully Recovered is a destination per se, but I do think there are people who have gotten into the groove enough of countering their ED thoughts and believing wholeheartedly in these counters + have slowly gained enough good experiences living life while not engaging with the ED mindset. it is a process that can get much easier, and at the same time of course, everyone's journey is not the same. other comorbid mental health issues aside your ED can make it harder to see that and it's important to acknowledge.",
      "created_utc": 1606496458.0,
      "score": 4,
      "context": [
        {
          "id": "gdorjd6",
          "author": "None",
          "body": "This will always irk me about how we in the US handle recovery. This thought of “always having/being X(ed, addiction, mental illness)” is a uniquely American one and not how they view recovery in other western countries at all. \n\nIn my own life when i was recovering from drugs and alcohol I found it counter productive and more hurtful to my recovery than helpful. It shifts the focus from taking things one day at a time and places it to the rest of your life which is terrifying and intimidating. I had to seriously reshift the way I see recovery and spend time reading sources about recovery from other countries because they dont see it the same as we do in the states. Besides making your recovery a lifelong process makes you identify with your X and makes it a part of your personhood which makes it harder to recover and is counter intuitive to actually recovering.\n\nBtw, you can blame AA for making recovery a “lifelong process” even though there is all evidence points to the fact that recovery (at least for alcoholism) is stastically over after a year of sobriety since the chances of relapse are less than 5% if your a year sober. Less than 1% relapse rate after two years. Our entire thinking about recovery for everything (ed,addiction, mental illness) was built on ideas by a cult (AA) from 70 years that has, to this day zero evidence to prove the effectiveness of their methods. Look into recovery sources from outside the US where AA isnt a thing and you’ll see what I mean. \n\n\nTldr: recovery is only a lifelong process in the states because AA has such a hige monopoly on recovery here but in other countries recovery is seen as a much shorter process that isn’t lifelong.",
          "created_utc": 1606415832.0
        }
      ]
    },
    {
      "id": "gdpjtr3",
      "author": "ontopofyourmom",
      "body": "This is a very important fact.",
      "created_utc": 1606429668.0,
      "score": 2,
      "context": [
        {
          "id": "gdorjd6",
          "author": "None",
          "body": "This will always irk me about how we in the US handle recovery. This thought of “always having/being X(ed, addiction, mental illness)” is a uniquely American one and not how they view recovery in other western countries at all. \n\nIn my own life when i was recovering from drugs and alcohol I found it counter productive and more hurtful to my recovery than helpful. It shifts the focus from taking things one day at a time and places it to the rest of your life which is terrifying and intimidating. I had to seriously reshift the way I see recovery and spend time reading sources about recovery from other countries because they dont see it the same as we do in the states. Besides making your recovery a lifelong process makes you identify with your X and makes it a part of your personhood which makes it harder to recover and is counter intuitive to actually recovering.\n\nBtw, you can blame AA for making recovery a “lifelong process” even though there is all evidence points to the fact that recovery (at least for alcoholism) is stastically over after a year of sobriety since the chances of relapse are less than 5% if your a year sober. Less than 1% relapse rate after two years. Our entire thinking about recovery for everything (ed,addiction, mental illness) was built on ideas by a cult (AA) from 70 years that has, to this day zero evidence to prove the effectiveness of their methods. Look into recovery sources from outside the US where AA isnt a thing and you’ll see what I mean. \n\n\nTldr: recovery is only a lifelong process in the states because AA has such a hige monopoly on recovery here but in other countries recovery is seen as a much shorter process that isn’t lifelong.",
          "created_utc": 1606415832.0
        }
      ]
    },
    {
      "id": "gdpl1fk",
      "author": "yogak06",
      "body": "this is so encouraging to hear- how did you get to this place? it seems so so impossible to me",
      "created_utc": 1606430401.0,
      "score": 3,
      "context": [
        {
          "id": "gdoxu36",
          "author": "None",
          "body": "This is so relatable - I could have written this a couple of years ago. \n\nI know this is a rant and you're not looking for advice, but if I was talking to my younger self I would say:\n\nSpoiler alert! \n\nYou can have a happy life. \n\nYou can learn to love food and your body. \n\nYou can have a healthy relationship with others. \n\nYou can live a much, much better life than you're currently living. \n\nThink about it this way: even \"normal\" people without EDs can have shitty thoughts from time to time or invasive thoughts - you know, like \"oh I wonder what would happen if I throw my phone out the window\" or \"omg what if I drop this baby.\" But they're so infrequent, small, inconsequential. They're not a part of your life, and they're not a part of you. \n\nOne day, the ED you once had will not be a part of your life. \n\nI don't have an eating disorder anymore. Sometimes, I look back on myself when I had an ED, and I feel a lot of compassion like I'm looking at a suffering stranger. I'm not the person I was anymore. I killed that old life, and I was reborn. \n\nYou're in the middle of the hardest part. It's like you're climbing a mountain and you're not able to even see the peak because it's dark and cloudy and foggy. But you just have to be curious enough to see whether the view is worth it or not. \n\nAnyway, OP, I sincerely do wish you luck. I think that what you're doing is brave and hard and also can be really really sucky. You're always welcome to rant here.",
          "created_utc": 1606418618.0
        }
      ]
    },
    {
      "id": "gdpkupd",
      "author": "None",
      "body": "This is really good advice.",
      "created_utc": 1606430287.0,
      "score": 3,
      "context": [
        {
          "id": "gdoz74w",
          "author": "ewoktuna",
          "body": "Here's my analogy and how it is like for me. My Ed is like being sprayed by a skunk. When you're in the height of it it is unbearable, it's all you can think about it consumes your every thought. Like the spray, it's soooo strong. But recovery is like taking the baths to wash it off. For some it takes fewer baths to get rid of the smell, some more. The thing about being sprayed by a skunk is you can get phantom smells of it later (even if you got all the oils off) and the experience is embedded in your brain. In other words it sticks with you years later. But it's nothing like how it was when you first got sprayed, it's a memory something you observe (ex. \"Oh, I smell skunk\" is like \" hey, that once triggered me years ago, these are the thoughts I used to have, hmmmm interesting.\") \n\nThere are soooo many more vectors/layers to EDs and mental health (like hormones, environment, drugs, other mental health problems etc...) But knowledge and growth in yourself is a weapon against it and when you get stuck in the black and white thinking of recovered vs. not, you miss everything that could help you. \n\nPlease, take a big breath, envision that mental stop sign, get off the cyclical thinking rollercoaster and talk to someone you trust/mental health professional. There is soooo much to live for. Please, please, please.",
          "created_utc": 1606419230.0
        }
      ]
    },
    {
      "id": "gdoqzlt",
      "author": "internerderner2",
      "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
      "created_utc": 1606415594.0,
      "score": 5,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        }
      ]
    },
    {
      "id": "gdps6k7",
      "author": "Foreversmalll",
      "body": "100% recommend https://tabithafarrar.com/book-rehabilitate-rewire-recover/",
      "created_utc": 1606434755.0,
      "score": 5,
      "context": [
        {
          "id": "gdorjd6",
          "author": "None",
          "body": "This will always irk me about how we in the US handle recovery. This thought of “always having/being X(ed, addiction, mental illness)” is a uniquely American one and not how they view recovery in other western countries at all. \n\nIn my own life when i was recovering from drugs and alcohol I found it counter productive and more hurtful to my recovery than helpful. It shifts the focus from taking things one day at a time and places it to the rest of your life which is terrifying and intimidating. I had to seriously reshift the way I see recovery and spend time reading sources about recovery from other countries because they dont see it the same as we do in the states. Besides making your recovery a lifelong process makes you identify with your X and makes it a part of your personhood which makes it harder to recover and is counter intuitive to actually recovering.\n\nBtw, you can blame AA for making recovery a “lifelong process” even though there is all evidence points to the fact that recovery (at least for alcoholism) is stastically over after a year of sobriety since the chances of relapse are less than 5% if your a year sober. Less than 1% relapse rate after two years. Our entire thinking about recovery for everything (ed,addiction, mental illness) was built on ideas by a cult (AA) from 70 years that has, to this day zero evidence to prove the effectiveness of their methods. Look into recovery sources from outside the US where AA isnt a thing and you’ll see what I mean. \n\n\nTldr: recovery is only a lifelong process in the states because AA has such a hige monopoly on recovery here but in other countries recovery is seen as a much shorter process that isn’t lifelong.",
          "created_utc": 1606415832.0
        },
        {
          "id": "gdp0n8h",
          "author": "None",
          "body": "Wait i didn't even think about this or know that \"always having it\" is a US idea. I'm in the states and I've been told by many providers that this is something that will always be with me. What sources can I look to outside of the US to get a different perspective? \n\nI struggle with identity issues around my ED and BPD and feel oddly \"connected\" to them. And then someone telling me that I'll always have them doesn't even give me a reason to try to get rid of them.. especially because im so attached to my mental illnessses and don't see a reason to give them up.",
          "created_utc": 1606419867.0
        }
      ]
    },
    {
      "id": "gdpt6pw",
      "author": "None",
      "body": "It started because my younger sister was picking up my ED habits and I realized I had to change. \n\nIt was a really, really long process. \n\nI threw out my scale and mirrors, learned about intuitive eating and got over my extreme hunger, stopped purging, quit smoking (I only picked it up because I heard it helped you lose weight), learned a lot about the intersection between fatphobia and racism, learned about nutrition, came to peace with being gay, went to therapy a lot (group therapy, CBT therapy, and regular schmegular therapy), went to a psychiatrist, moved out of a toxic/triggering environment and left an emotionally abusive relationship, learned how to cook, went thrift shopping for new clothes and threw away anything that grew too small, gained back a lot of weight, learned to mourn my ED and make peace with my new body, ate my fear foods, started taking care of my skin/hair/nails, read a lot of books and listened to a lot of podcasts, unfollowed all pro-ED content on my social media, then unfollowed anything that had to do with influencers or women whose bodies I resented, then deleted all my social media for a while, then when I rejoined it I made an active choice to post on forums like this that were pro-recovery, stopped going to the gym, started moving my body only in ways that made me happy, eventually started weight lifting and yoga again and I realized I wanted to be strong. I moved to a different country then moved back home. I first became neutral about my body - it was just flesh and bone and fat and skin and hair that held me together - and then I actively practice a lot of compassion to my body. And I realized I would rather be fat than have an eating disorder. And then I realized that actually, my body returned to roughly the same weight I was at before. And one day I woke up and realized I don’t listen to the same music I used to listen to and that I don’t dress the same way anymore and that felt better and more alive than I have in years. \n\nSorry for the rambling thoughts! \n\nI will admit that it isn’t always sunshine and rainbows, but life never is, right? Doesn’t mean it’s not worth it. And sometimes I see things that are triggering/upsetting - but i deal with it in the same way that a person who has doesn’t have an ED would. My sister is really struggling in recovery, and a lot of the things she says/does are, like, objectively triggering - unintentionally or not. But she’s just a kid. \n\nAnyways, sorry for the long ass rant! I wish I had more concrete advice but I really do believe that everyone’s journey is different. Even if later on I do find myself struggling or if I fall back or relapse - it’s like, I have a safe plan now. I know how to get better. But the process was frankly so arduous that I would rather not have to repeat it, and I have no interest in going back to the person I was when food and weight was all that I cared about.\n\nP.S: it seemed impossible to me too.",
      "created_utc": 1606435384.0,
      "score": 13,
      "context": [
        {
          "id": "gdoxu36",
          "author": "None",
          "body": "This is so relatable - I could have written this a couple of years ago. \n\nI know this is a rant and you're not looking for advice, but if I was talking to my younger self I would say:\n\nSpoiler alert! \n\nYou can have a happy life. \n\nYou can learn to love food and your body. \n\nYou can have a healthy relationship with others. \n\nYou can live a much, much better life than you're currently living. \n\nThink about it this way: even \"normal\" people without EDs can have shitty thoughts from time to time or invasive thoughts - you know, like \"oh I wonder what would happen if I throw my phone out the window\" or \"omg what if I drop this baby.\" But they're so infrequent, small, inconsequential. They're not a part of your life, and they're not a part of you. \n\nOne day, the ED you once had will not be a part of your life. \n\nI don't have an eating disorder anymore. Sometimes, I look back on myself when I had an ED, and I feel a lot of compassion like I'm looking at a suffering stranger. I'm not the person I was anymore. I killed that old life, and I was reborn. \n\nYou're in the middle of the hardest part. It's like you're climbing a mountain and you're not able to even see the peak because it's dark and cloudy and foggy. But you just have to be curious enough to see whether the view is worth it or not. \n\nAnyway, OP, I sincerely do wish you luck. I think that what you're doing is brave and hard and also can be really really sucky. You're always welcome to rant here.",
          "created_utc": 1606418618.0
        },
        {
          "id": "gdpl1fk",
          "author": "yogak06",
          "body": "this is so encouraging to hear- how did you get to this place? it seems so so impossible to me",
          "created_utc": 1606430401.0
        }
      ]
    },
    {
      "id": "gdpo41b",
      "author": "Retexo",
      "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
      "created_utc": 1606432260.0,
      "score": 2,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        }
      ]
    },
    {
      "id": "gdqm1cc",
      "author": "scarlettoharas",
      "body": "This was incredibly beautiful and made me cry. Thank you.",
      "created_utc": 1606454821.0,
      "score": 5,
      "context": [
        {
          "id": "gdoxu36",
          "author": "None",
          "body": "This is so relatable - I could have written this a couple of years ago. \n\nI know this is a rant and you're not looking for advice, but if I was talking to my younger self I would say:\n\nSpoiler alert! \n\nYou can have a happy life. \n\nYou can learn to love food and your body. \n\nYou can have a healthy relationship with others. \n\nYou can live a much, much better life than you're currently living. \n\nThink about it this way: even \"normal\" people without EDs can have shitty thoughts from time to time or invasive thoughts - you know, like \"oh I wonder what would happen if I throw my phone out the window\" or \"omg what if I drop this baby.\" But they're so infrequent, small, inconsequential. They're not a part of your life, and they're not a part of you. \n\nOne day, the ED you once had will not be a part of your life. \n\nI don't have an eating disorder anymore. Sometimes, I look back on myself when I had an ED, and I feel a lot of compassion like I'm looking at a suffering stranger. I'm not the person I was anymore. I killed that old life, and I was reborn. \n\nYou're in the middle of the hardest part. It's like you're climbing a mountain and you're not able to even see the peak because it's dark and cloudy and foggy. But you just have to be curious enough to see whether the view is worth it or not. \n\nAnyway, OP, I sincerely do wish you luck. I think that what you're doing is brave and hard and also can be really really sucky. You're always welcome to rant here.",
          "created_utc": 1606418618.0
        },
        {
          "id": "gdpl1fk",
          "author": "yogak06",
          "body": "this is so encouraging to hear- how did you get to this place? it seems so so impossible to me",
          "created_utc": 1606430401.0
        },
        {
          "id": "gdpt6pw",
          "author": "None",
          "body": "It started because my younger sister was picking up my ED habits and I realized I had to change. \n\nIt was a really, really long process. \n\nI threw out my scale and mirrors, learned about intuitive eating and got over my extreme hunger, stopped purging, quit smoking (I only picked it up because I heard it helped you lose weight), learned a lot about the intersection between fatphobia and racism, learned about nutrition, came to peace with being gay, went to therapy a lot (group therapy, CBT therapy, and regular schmegular therapy), went to a psychiatrist, moved out of a toxic/triggering environment and left an emotionally abusive relationship, learned how to cook, went thrift shopping for new clothes and threw away anything that grew too small, gained back a lot of weight, learned to mourn my ED and make peace with my new body, ate my fear foods, started taking care of my skin/hair/nails, read a lot of books and listened to a lot of podcasts, unfollowed all pro-ED content on my social media, then unfollowed anything that had to do with influencers or women whose bodies I resented, then deleted all my social media for a while, then when I rejoined it I made an active choice to post on forums like this that were pro-recovery, stopped going to the gym, started moving my body only in ways that made me happy, eventually started weight lifting and yoga again and I realized I wanted to be strong. I moved to a different country then moved back home. I first became neutral about my body - it was just flesh and bone and fat and skin and hair that held me together - and then I actively practice a lot of compassion to my body. And I realized I would rather be fat than have an eating disorder. And then I realized that actually, my body returned to roughly the same weight I was at before. And one day I woke up and realized I don’t listen to the same music I used to listen to and that I don’t dress the same way anymore and that felt better and more alive than I have in years. \n\nSorry for the rambling thoughts! \n\nI will admit that it isn’t always sunshine and rainbows, but life never is, right? Doesn’t mean it’s not worth it. And sometimes I see things that are triggering/upsetting - but i deal with it in the same way that a person who has doesn’t have an ED would. My sister is really struggling in recovery, and a lot of the things she says/does are, like, objectively triggering - unintentionally or not. But she’s just a kid. \n\nAnyways, sorry for the long ass rant! I wish I had more concrete advice but I really do believe that everyone’s journey is different. Even if later on I do find myself struggling or if I fall back or relapse - it’s like, I have a safe plan now. I know how to get better. But the process was frankly so arduous that I would rather not have to repeat it, and I have no interest in going back to the person I was when food and weight was all that I cared about.\n\nP.S: it seemed impossible to me too.",
          "created_utc": 1606435384.0
        }
      ]
    },
    {
      "id": "gdptnd7",
      "author": "None",
      "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
      "created_utc": 1606435679.0,
      "score": 6,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        }
      ]
    },
    {
      "id": "ge76wkl",
      "author": "Retexo",
      "body": "Getting healthier physically and mentally doesn't mean you're recovered. The obsessions with food and exercise and weight and calories will ALWAYS be there. And that's what sucks.",
      "created_utc": 1606777382.0,
      "score": 1,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        },
        {
          "id": "gdptnd7",
          "author": "None",
          "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
          "created_utc": 1606435679.0
        }
      ]
    },
    {
      "id": "ge7qvy4",
      "author": "None",
      "body": "Maybe for some people that is true, but to be honest it hasn’t been my experience.",
      "created_utc": 1606787102.0,
      "score": 3,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        },
        {
          "id": "gdptnd7",
          "author": "None",
          "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
          "created_utc": 1606435679.0
        },
        {
          "id": "ge76wkl",
          "author": "Retexo",
          "body": "Getting healthier physically and mentally doesn't mean you're recovered. The obsessions with food and exercise and weight and calories will ALWAYS be there. And that's what sucks.",
          "created_utc": 1606777382.0
        }
      ]
    },
    {
      "id": "geaxyqa",
      "author": "Retexo",
      "body": "Maybe so. I'm glad it isn't your experience. I hope yours has been better.",
      "created_utc": 1606859639.0,
      "score": 1,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        },
        {
          "id": "gdptnd7",
          "author": "None",
          "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
          "created_utc": 1606435679.0
        },
        {
          "id": "ge76wkl",
          "author": "Retexo",
          "body": "Getting healthier physically and mentally doesn't mean you're recovered. The obsessions with food and exercise and weight and calories will ALWAYS be there. And that's what sucks.",
          "created_utc": 1606777382.0
        },
        {
          "id": "ge7qvy4",
          "author": "None",
          "body": "Maybe for some people that is true, but to be honest it hasn’t been my experience.",
          "created_utc": 1606787102.0
        }
      ]
    },
    {
      "id": "gec0a0y",
      "author": "None",
      "body": "I hope your experience gets better too.",
      "created_utc": 1606880324.0,
      "score": 2,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        },
        {
          "id": "gdptnd7",
          "author": "None",
          "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
          "created_utc": 1606435679.0
        },
        {
          "id": "ge76wkl",
          "author": "Retexo",
          "body": "Getting healthier physically and mentally doesn't mean you're recovered. The obsessions with food and exercise and weight and calories will ALWAYS be there. And that's what sucks.",
          "created_utc": 1606777382.0
        },
        {
          "id": "ge7qvy4",
          "author": "None",
          "body": "Maybe for some people that is true, but to be honest it hasn’t been my experience.",
          "created_utc": 1606787102.0
        },
        {
          "id": "geaxyqa",
          "author": "Retexo",
          "body": "Maybe so. I'm glad it isn't your experience. I hope yours has been better.",
          "created_utc": 1606859639.0
        }
      ]
    },
    {
      "id": "gee4ydm",
      "author": "Retexo",
      "body": "Thank you",
      "created_utc": 1606930844.0,
      "score": 2,
      "context": [
        {
          "id": "gdoplxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606414994.0
        },
        {
          "id": "gdoqzlt",
          "author": "internerderner2",
          "body": ">That’s how I think that my eating disorder will be. I may be recovered, but the thoughts are still there. There can be weeks that I go without even thinking about it. But the thoughts pop up from time to time. \n\nThat's what I was talking about in the post. If that's the best I can hope for I might as well just kill myself already. I don't see the point. I don't even care about trying.",
          "created_utc": 1606415594.0
        },
        {
          "id": "gdpo41b",
          "author": "Retexo",
          "body": "Same. What’s the point of fighting for life. I may physically recover, but mentally? Don’t think so. Not worth keeping up the fight.",
          "created_utc": 1606432260.0
        },
        {
          "id": "gdptnd7",
          "author": "None",
          "body": "When people say physical recovering is less than half the battle, it’s like... Physically recovering definitely had some perks like sleeping better, getting my libido back, being able to spend time with my family & friends, getting my 4.0 back because I had such mental clarity, having a regular menstrual cycle, healthier hair/nails/skin etc, but mental recovery helped me appreciate it. And honestly it’s a lot easier to mentally recover when your brain and body have the energy they need. It might seem impossible, but it isn’t out of reach for you.",
          "created_utc": 1606435679.0
        },
        {
          "id": "ge76wkl",
          "author": "Retexo",
          "body": "Getting healthier physically and mentally doesn't mean you're recovered. The obsessions with food and exercise and weight and calories will ALWAYS be there. And that's what sucks.",
          "created_utc": 1606777382.0
        },
        {
          "id": "ge7qvy4",
          "author": "None",
          "body": "Maybe for some people that is true, but to be honest it hasn’t been my experience.",
          "created_utc": 1606787102.0
        },
        {
          "id": "geaxyqa",
          "author": "Retexo",
          "body": "Maybe so. I'm glad it isn't your experience. I hope yours has been better.",
          "created_utc": 1606859639.0
        },
        {
          "id": "gec0a0y",
          "author": "None",
          "body": "I hope your experience gets better too.",
          "created_utc": 1606880324.0
        }
      ]
    }
  ]
}