{
  "id": "k3g0lw",
  "subreddit": "fuckeatingdisorders",
  "author": "moonlightbasil",
  "created_utc": 1606679708.0,
  "title": "recovery is ugly. stop trying to find ways around that.",
  "selftext": "was going through this forum and almost getting annoyed at how many people think they're eating too much or are wondering if it's possible to avoid some hard parts of recovery etc. to be fair i was like that once, but basically my point is that RECOVERY SUCKS. you will probably overshoot. you will probably binge. you will probably eat (loads of) junk food. you will probably cry. should this scare you from recovering? NO. because the life you're living with during your ed is way worse. so u need to get over it and just trust that recovery be worth it. \n\njust felt like someone needed to be blunt about that.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k3g0lw/recovery_is_ugly_stop_trying_to_find_ways_around/",
  "score": 206,
  "num_comments": 20,
  "comments": [
    {
      "id": "ge2tqw4",
      "author": "None",
      "body": "its just like how drug withdrawal is fucking hell on earth but once you get through that, life in the other side is 1000x better.",
      "created_utc": 1606682467.0,
      "score": 62,
      "context": []
    },
    {
      "id": "ge33pqo",
      "author": "None",
      "body": "You’re right, it is ugly, it’s scary, and confusing. But the end result and the lessons you learn is worth these uncomfortable situations. That’s how I know I’m recovering is that I’m going through uncomfortable situations. For example, if I binge, I feel guilt until I purge, but if I acknowledge that guilt but don’t act upon it and go on with my day, that’s one step away from my Ed behaviour. Things that are worth it usually cost something in return, in this case, it’s our comfort zone.",
      "created_utc": 1606687129.0,
      "score": 30,
      "context": []
    },
    {
      "id": "ge2ujk6",
      "author": "None",
      "body": "This is something I have to keep reminding myself constantly. Like there are days in my recovery I cant even go into rooms with mirrors or have to shut off the lights because I’m terrified of what I’ll see and I will probably hate myself but I have to remind myself that possibly gaining a tiny bit of fat in the short term is vastly better than dying young because of organ failure or suicide.\n\nRecovery sucks and its hard but it beats death and it beats being so miserable in life that Id rather be dead.",
      "created_utc": 1606682833.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ge3g9co",
      "author": "linconnuedelaseine",
      "body": "In a very depressed part of my recovery. My body really overshot and now I’m super overweight and I crave junk food all the time. Your raw honesty is a breath of fresh air. Thank you.",
      "created_utc": 1606693633.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ge3tv0s",
      "author": "lemej",
      "body": "I’ve accepted that I’m going to always feel relapsey and shitty. It won’t ever feel pretty, in either relapse or recovery. Never. \n\nBut I can look at my actions and life quality NOW and compare it to the past. I realize that I’m now in a place that promotes a better livelihood both physically and mentally. Even if I feel like shit.\n\nEven if I hate myself, at least I’m doing the damn thing. The good that comes out of my better choices are just harder to measure because they’re more qualitative than quantitative. \n\nI’m not perfect. No road is paved perfectly, but at least I’ve given myself wheels that turn.",
      "created_utc": 1606701289.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ge3zzq6",
      "author": "germanshepherd_mom",
      "body": "I struggle with this because I relapsed to cope with my depression and it actually helped, but brought upon a whole new unhealthy and difficult disorder which was anorexia- and now that I’m recovering, the depression I tried to suppress is back. I go to therapy, have taken meds for years, and all that but, I feel like coming out on “the other side” looks a little different for people with other disorders, because there isn’t happiness there. There are suicidal thoughts that were there before the eating disorder. I know I need to recover, but I have a mountain of hurt aside from the ED too. Sometimes I feel like I should just not be here at all. But you’re right, recovery is ugly.",
      "created_utc": 1606704654.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ge82ke9",
      "author": "HolidayAd7032",
      "body": "Like if you really don’t wanna get better then why continue to be on a recovery-based platform? I just feel like constantly sharing the defaults of eating disorders doesn’t help.\n\nI don’t mean to sound rude but like, nothing is more frustrating than trying to just make each day better and then hopping on to see everyone comparing and talking about weight and numbers.. it’s basically agreeing with the stigma that’s already happening.\n\nFor me, the ED wasn’t a body image thing.. it was mostly a control/trauma response.\n\nGet help from professionals.. because comparing and competing isn’t going to get you anywhere.\n\nThe only ones who ever “won” at this disorder, are in a grave.",
      "created_utc": 1606793491.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ge39l7s",
      "author": "miathemango",
      "body": "this!! the hard parts are the most rewarding.",
      "created_utc": 1606690151.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ge3fu8w",
      "author": "peposcar",
      "body": "thank you i really needed to hear this",
      "created_utc": 1606693410.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ge3nb1q",
      "author": "HagQueen",
      "body": "This 100%, thank you!",
      "created_utc": 1606697519.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge4l6cf",
      "author": "anjaliv",
      "body": "The only way out is through.",
      "created_utc": 1606719277.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge831db",
      "author": "HolidayAd7032",
      "body": "Also, it irks me that people who are deep into their ED get so much attention but those who are telling their story of recovery/recovering, get no recognition.\n\nA girl I was in treatment with who flat out told everyone that she’s sicker than anyone else, and still complains about how her family doesn’t support her, and acts like she’s sicker than anyone, gets so much attention via TikTok.. it just freaking sucks.",
      "created_utc": 1606793756.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge823df",
      "author": "HolidayAd7032",
      "body": "Thank you for being blunt about this because I thought I was the only one who got irritated about this kind of thing.\n\nLike I know having an ED isn’t easy, and I know recovery isn’t easy either.. but I’ve always told myself that I get out of it what I put into it.\nI’m not going to expect others to put in more effort than me.. I hate half assing anything I do, so I basically used that towards recovering.\n\nI never under why some girls in treatment would try to be the sickest and talk about how they were the sickest, etc.\nI remember telling 2 of them that I wanted to sit by myself during meal time because they were triggering.\nMe and the other girl who told them they were triggering always called them out because they both flaunted their ED and were only there because they knew eachother prior and both came in at the same time just to hangout.. it was very frustrating.\nLike I obviously get that it’s not that simple but it’s a lot better pushing through than continuing to suffer.\n\nI am thankful everyday that I have the insightfulness and motivation that I have towards getting better.. it sounds harsh and not compassionate but like, it’s reality and it gets very hard seeing people flaunt their ED’s when you’re just trying to get closer to a normal life.\n\nI can’t even enjoy social media platforms anymore to help me get through hard shit because there’s always something triggering or competitive with eating disorders popping up out of nowhere.\nI’ve tried getting new accounts and everything and yet non-recovery related shit comes up all the time.\nSorry for ranting but I’m glad I’m not the only one who gets the point in this.",
      "created_utc": 1606793225.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge4iayz",
      "author": "selukli",
      "body": "SPITTIN FACTS OUT HERE",
      "created_utc": 1606716856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge6nkqs",
      "author": "moonlightbasil",
      "body": "i am too and i feel you! sometimes u don't need to pretend everything is good and just recognize that ur in a shitty spot that will take a while to get past!",
      "created_utc": 1606768457.0,
      "score": 5,
      "context": [
        {
          "id": "ge3g9co",
          "author": "linconnuedelaseine",
          "body": "In a very depressed part of my recovery. My body really overshot and now I’m super overweight and I crave junk food all the time. Your raw honesty is a breath of fresh air. Thank you.",
          "created_utc": 1606693633.0
        }
      ]
    },
    {
      "id": "ge8dlnm",
      "author": "moonlightbasil",
      "body": "yeah \"sounding rude\" is something i was worried about but honestly if ur coming on a recovery platform and triggering a bunch of people (unintentionally or not) then i also have the right to be straightforward lol",
      "created_utc": 1606800302.0,
      "score": 3,
      "context": [
        {
          "id": "ge82ke9",
          "author": "HolidayAd7032",
          "body": "Like if you really don’t wanna get better then why continue to be on a recovery-based platform? I just feel like constantly sharing the defaults of eating disorders doesn’t help.\n\nI don’t mean to sound rude but like, nothing is more frustrating than trying to just make each day better and then hopping on to see everyone comparing and talking about weight and numbers.. it’s basically agreeing with the stigma that’s already happening.\n\nFor me, the ED wasn’t a body image thing.. it was mostly a control/trauma response.\n\nGet help from professionals.. because comparing and competing isn’t going to get you anywhere.\n\nThe only ones who ever “won” at this disorder, are in a grave.",
          "created_utc": 1606793491.0
        }
      ]
    },
    {
      "id": "ge7pnng",
      "author": "linconnuedelaseine",
      "body": "AMEN",
      "created_utc": 1606786434.0,
      "score": 2,
      "context": [
        {
          "id": "ge3g9co",
          "author": "linconnuedelaseine",
          "body": "In a very depressed part of my recovery. My body really overshot and now I’m super overweight and I crave junk food all the time. Your raw honesty is a breath of fresh air. Thank you.",
          "created_utc": 1606693633.0
        },
        {
          "id": "ge6nkqs",
          "author": "moonlightbasil",
          "body": "i am too and i feel you! sometimes u don't need to pretend everything is good and just recognize that ur in a shitty spot that will take a while to get past!",
          "created_utc": 1606768457.0
        }
      ]
    },
    {
      "id": "k3qap7p",
      "author": "Tight_Replacement554",
      "body": "Update?",
      "created_utc": 1696607238.0,
      "score": 1,
      "context": [
        {
          "id": "ge3g9co",
          "author": "linconnuedelaseine",
          "body": "In a very depressed part of my recovery. My body really overshot and now I’m super overweight and I crave junk food all the time. Your raw honesty is a breath of fresh air. Thank you.",
          "created_utc": 1606693633.0
        },
        {
          "id": "ge6nkqs",
          "author": "moonlightbasil",
          "body": "i am too and i feel you! sometimes u don't need to pretend everything is good and just recognize that ur in a shitty spot that will take a while to get past!",
          "created_utc": 1606768457.0
        },
        {
          "id": "ge7pnng",
          "author": "linconnuedelaseine",
          "body": "AMEN",
          "created_utc": 1606786434.0
        }
      ]
    },
    {
      "id": "k3wsb82",
      "author": "linconnuedelaseine",
      "body": "For me, my recovery has gotten far better. I found more balance in my eating and exercise. I still don’t count calories or macros and I still allow myself to eat foods I’m craving, but I don’t feel like I’m craving the junk foods constantly anymore. I did lose a little bit of the excess weight over the course of the last two years, but I still am bigger than I’d like to be. However I’ve accepted that expecting my body to change overnight is unrealistic, and expecting to perfectly like my body when it is much bigger than it used to be is a hard sell. But I’ve found a lot of joy in appreciating what my body can do for me — its capabilities, so to speak. I took a Jiu Jitsu class and started cycling and these are things my anorexic body could never have done. So while I still am not super happy with how I look I’m much more happy with how I feel. And I’m on a journey that will continue on throughout my life. I’m not going to lie, I’d still like to lose some of the excess weight I am carrying. But I’m much more accepting of the time it takes to see those changes. Slow and steady I go on.",
      "created_utc": 1696716220.0,
      "score": 1,
      "context": [
        {
          "id": "ge3g9co",
          "author": "linconnuedelaseine",
          "body": "In a very depressed part of my recovery. My body really overshot and now I’m super overweight and I crave junk food all the time. Your raw honesty is a breath of fresh air. Thank you.",
          "created_utc": 1606693633.0
        },
        {
          "id": "ge6nkqs",
          "author": "moonlightbasil",
          "body": "i am too and i feel you! sometimes u don't need to pretend everything is good and just recognize that ur in a shitty spot that will take a while to get past!",
          "created_utc": 1606768457.0
        },
        {
          "id": "ge7pnng",
          "author": "linconnuedelaseine",
          "body": "AMEN",
          "created_utc": 1606786434.0
        },
        {
          "id": "k3qap7p",
          "author": "Tight_Replacement554",
          "body": "Update?",
          "created_utc": 1696607238.0
        }
      ]
    }
  ]
}