{
  "id": "k3pjwt",
  "subreddit": "fuckeatingdisorders",
  "author": "throwawayperson222",
  "created_utc": 1606713826.0,
  "title": "To anyone who needs this: yes, your extreme hunger will subside if you let yourself eat.",
  "selftext": "8 months ago during the beginning stages of self recovery I was where some of you are now. Googling information about extreme hunger. Needing reassurance that it’s normal and will stop. It WILL stop ONLY if you allow yourself to eat. And not feeling like a bottomless pit for once is honestly one of the best things about recovery. Not thinking about food 24/7. Being able to live life and eat things that wasn’t carefully made and measured by you. Not feeling like you messed up your day and needing to binge because you ate something you didn’t intend you.\n\nI’m sitting here chillin. Not thinking about food. Not looking up Yelp photos of food. Not hungry. Not stuffed. Not making myself go to sleep hungry. 8 months ago, none of this would have seemed real. I’m literally so happy because my mental space has been cleared from all that bullshit. I can eat a pastry and not feel like I need 10 more. This is because I had to fight and force myself to eat things everyday that wasn’t made by me. I had to challenge myself everyday. It got easier and it was 100% worth it because I don’t have that “fuck it, might as well eat everything!” Mindset anymore.\n\nTrust me this has been one of the hardest things in life. Forcing myself to eat fear foods- basically anything I didn’t make. It was realllly hard at first but you need to challenge yourself for it to be easier. When something becomes normal (eating regular things, fear foods) then it doesn’t become a big deal. \n\nI allowed myself to eat. I ate loaves of loaves of bread and peanut butter during the first few weeks of self recovery. I COULDNT stop eating. I woke up to my stomach sooo tender because of all the food. My body craved FATS sooo badly and that’s what I gave it. Yes I gained weight fast. and you need to gain weight if you’re experiencing extreme hunger. Period. \n\nIt will go away. I didn’t believe it would ever go away either. But it did. And you will be okay. Just let it happen and eat. Don’t let this shit suck you out of life anymore.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k3pjwt/to_anyone_who_needs_this_yes_your_extreme_hunger/",
  "score": 151,
  "num_comments": 8,
  "comments": [
    {
      "id": "ge6i1kd",
      "author": "nearlyhalfabicycle",
      "body": "I second this! The extreme hunger and constant obsession with food went away for me too when I stopped restricting. Now I can look at a box of cookies and be like \"meh, I don't think I feel like having a cookie right now\". I can have ice cream sitting in the freezer untouched for days. I almost never feel stuffed after eating. All of this would have seemed impossible to me in the past.",
      "created_utc": 1606765878.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ge4tnwu",
      "author": "marathon_runner_",
      "body": "This is so promising and reassuring! Thank you for sharing - so happy for you & all you've accomplished!!",
      "created_utc": 1606727455.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ge5bqhr",
      "author": "cat0verlord",
      "body": "thank you. i'm trying really really hard lately to just eat intuitively like a normal person but it's so difficult sometimes when i feel SO ashamed of myself every time i eat. :(",
      "created_utc": 1606744526.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ge4i60p",
      "author": "germanshepherd_mom",
      "body": "I’m so happy for you!!",
      "created_utc": 1606716741.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ge5kjy6",
      "author": "DedicatedtoDistance",
      "body": "This is so true!",
      "created_utc": 1606749747.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge7jiqr",
      "author": "pinkgirl999",
      "body": "Yess this is exactly what happened for me! I didn’t think I’d ever be able to overcome the constant urge to binge and food obsession, but now that I have, nothing has ever felt as good as not being so damn hungry all the time. Literally have to eat your way out of it!!",
      "created_utc": 1606783288.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gegzs4z",
      "author": "poisoncandiedapple",
      "body": "Omg, I have been in AN (6-7 months) recovery for 2 weeks+ ish now and I CANNOT STOP EATING.I meant it literally. I have extreme cravings for foods and my mind is restless until I give in and start eating... and when I start I can’t stop unless I feel nauseous from a full blown ‘binge’.My pre recovery bmi is 12 and now im almost fully weight restored, it only took TWO WEEKS. I would have two servings of food as my main meals and still find myself having snacks afterwards and it would not stop until I feel physically uncomfortable. I am ALMOST weight restored from consuming 3-5k calories EVERYDAY for 2 weeks now but it doesn’t stop. I still experience brain fog and feel like physiologically and mentally I am yet to fully recover but the weight and fat mass are piling up too quickly... I can’t sleep at night unless I eat alot to the point of extreme fullness before I can sleep peacefully or I’ll find myself wide awake till the sun rises, unable to curb the cravings and mental hunger no matter what i do to distract myself. I need help... my dietician told me to just try my best to curb the cravings and desire to eat but it’s SO hard to fight it because I can’t stop thinking about food... :(",
      "created_utc": 1606987460.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge541a1",
      "author": "internerderner2",
      "body": "I'm happy for you :)\n\nbut the problem is also \"when\" it subsides... :(",
      "created_utc": 1606738472.0,
      "score": 1,
      "context": []
    }
  ]
}