{
  "id": "k4pnia",
  "subreddit": "fuckeatingdisorders",
  "author": "glee4life2020",
  "created_utc": 1606844160.0,
  "title": "ive made a plan to properly recover and im going to stick to it",
  "selftext": "Although it was scary, i told my mum that ive got an obsession and shes helped me come up with a plan to recover properly. Firstly, i am going to put my weighing scales in her room and im only going to weigh myself twice a week rather than everyday. Im also going to eat 1600 cal a day instead of 1400 and increase it too 1800 and hopefully 2000 before christmas so i get to a point where im eating normally. As well as that im going to have a normal lunch like a sandwhich and either crisps or a piece of fruit, rather than junk food like i do now and a proper full dinner. Lastly, im going to try not to count calories as much and if i want a treat like crisps or cookie that makes me go over i shoud have it bc i deserve it. So yh, this is an update ig. I admit i have been avoiding properly recovering in fear of weight gain and although im still a bit scared, i now see that i am more important than the number on the scale. Ill keep yall posted if ud like lol but yh im gonna do this.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k4pnia/ive_made_a_plan_to_properly_recover_and_im_going/",
  "score": 87,
  "num_comments": 7,
  "comments": [
    {
      "id": "gea39y3",
      "author": "Caroline_Directioner",
      "body": "Congratulations! Full recovery is so difficult and I’m sure you’ll be able to do it, I’m so glad you were able to get support and realize that you weren’t fully recovered.  Sending love and support 💕",
      "created_utc": 1606845287.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gea74jr",
      "author": "None",
      "body": "recovery is so difficult and you will probably hate it most of the time but take it from someone who's been recovering for a month, stick with it! it get more and more bearable as you progress! \n\nAfter a while you will come to realise just how miserable and sick you were in your ED.",
      "created_utc": 1606847110.0,
      "score": 13,
      "context": []
    },
    {
      "id": "geanmm2",
      "author": "Disastrous-Bat4811",
      "body": "Im sooo proud!! What you did is really a hard thing to do and you should be proud of yourself for taking that first step. Im glad that you choose to be there for youself and be kind to your body. Im finally doing the same and it is difficult but bearable. Just remember to stick to it. \nI wish you the best!",
      "created_utc": 1606854776.0,
      "score": 9,
      "context": []
    },
    {
      "id": "geaoir4",
      "author": "None",
      "body": "sounds like a solid plan! best of luck with it <3 recovery is difficult but very very very worth it !! :D",
      "created_utc": 1606855194.0,
      "score": 8,
      "context": []
    },
    {
      "id": "geajhz1",
      "author": "EastofEatin",
      "body": "So proud of you! I wish you the best of luck, you've got this 💕💕💕",
      "created_utc": 1606852848.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gebxxkc",
      "author": "Lostinsideasnowbank",
      "body": "Hey, congrats. I'd suggest no scale at all for a while. It is stressful to NOT have one, but when ones around it gets to easy to focus on the  numbers, and especially early on even a few extra pounds can trigger the \"I gotta stop gaining\" thought process. If the scale isint there all you'll notice at first as you eat better is how much better you'll feel. And it really is like a drug. \n\nUnless you're mom need's a scale around I'd honestly toss it out. Literally, as an internet stranger, if you throw your scale out I will buy you a new one is six months. Or give it to a friend or relative for a while.\n\n One of the best things that happened to me was moving and not having a scale around. If you're like most people, if the scale is in the house at all you'll use it, and seeing those numbers is dangerous. \n\nI know you likely feel like you need to see those numbers, and it seems like a reasonable plan to limit yourself to weighing yourself to weighing yourself twice a week, but its really part of the same \"everything measured and controlled\" attitude that goes into restricted eating. If the scales not even there than it's not even a factor. \n\nAnd I promise promise promise that not being able to weigh yourself at home for two months won't lead to any ill effects. \n\nAnd depending on who grocery shops in your house and how on board your family is I'd also suggest repackaging things. Ceral into those plastic food bins. Ice cream bars out of the box. Etc. Basically, make finding the exact calories a chore so it becomes harder to obsess and track. \n\nAnd focus on really examining if youre hungry. I got to a point where unless I focused on it I didn't even realize I was hungry and I really had to relearn paying attention to my body. At my worst I was eating 800 or fewer calories a day, and learning how to actually pay attention to what my body needs.\n\n For me it also helped to stop conceptualizing \"my body\" and \"me\" as two separate things. You are your body and your body is you. Viewing my body as a thing deserving of love wasn't so easy, but viewing myself as deserving of love was easier. Sometimes those little changes in thought process can really help. \n\nI hope some of that may help and in any case I am so proud of you. Starting on recovery is hard, asking for help is hard, but it gets easier every day. And bad days and set backs are normal, so don't let them throw you.",
      "created_utc": 1606878954.0,
      "score": 3,
      "context": []
    },
    {
      "id": "geamds1",
      "author": "glee4life2020",
      "body": "awww thank you :)",
      "created_utc": 1606854200.0,
      "score": 4,
      "context": [
        {
          "id": "geajhz1",
          "author": "EastofEatin",
          "body": "So proud of you! I wish you the best of luck, you've got this 💕💕💕",
          "created_utc": 1606852848.0
        }
      ]
    }
  ]
}