{
  "id": "k5dk2j",
  "subreddit": "fuckeatingdisorders",
  "author": "ijuanaexpire",
  "created_utc": 1606929526.0,
  "title": "As someone in recovery, I believe that everyone deserves access to healthy, affordable food. There’s an app called ShareTheMeal by the United Nations which allows you to feed a child for a day for as little as US$0.80.",
  "selftext": "Let me preface this by saying that as an individual in recovery myself, this is in no way invalidating the extent by which we suffer at the hands of our eating disorders by bringing up the fact that hundreds of millions of people  don’t know when and where they’re going to get their next meal. I know how fucking miserable it is to be stuck in this hellhole of a disorder that sucks our soul out and robs us of our spirit. With that in mind, I believe that a crucial but often overlooked component of eating disorder recovery is making a conscious effort to change how we evaluate ourselves, and what we base our self worth on. Our EDs make it too easy to lose ourselves in the obsessive scrutinisation of our physical appearance, conditioning us to believe that once we finally lose 10 pounds, purchase that shirt and buy that concealer, then we’d finally be happy.  That’s such bullshit.\n\nHappiness (not the fleeting kind you get from buying that one shirt) can be found in helping others. There’s a Chinese proverb that goes:  “If you want happiness for an hour, take a nap. If you want happiness for a day, go fishing. If you want happiness for a year, inherit a fortune. If you want happiness for a lifetime, help somebody.” Therefore, an integral component of recovery is shifting the focus from what we can do for ourselves, to what we can do for others. The happiness one may get from losing 5 pounds is transient, but the joy one receives from helping others is everlasting.\n\nShareTheMeal makes it extremely easy to donate to those in need and feed an individual for a day for as little as $0.80 USD. With ShareTheMeal, you can see exactly where your donation goes and who you are helping. By donating, you’ll be able to feed those in need whilst simultaneously progressing with your recovery, therefore feeding yourself too. Therefore it becomes evident that hunger is no longer a question, but an act of consciousness.\n\nPS: this isn’t sponsored btw i was just rly touched by their vision lol",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k5dk2j/as_someone_in_recovery_i_believe_that_everyone/",
  "score": 118,
  "num_comments": 3,
  "comments": [
    {
      "id": "geecxc1",
      "author": "planetary-virgo",
      "body": "I'll definitely make a donation, thank you! I had no idea this was a thing \n\na big components in my ED actually is food security. I am poor, with no income, on food stamps, which makes eating regularly and enough so much harder because I tend to view food as being wasted on me.",
      "created_utc": 1606933961.0,
      "score": 18,
      "context": []
    },
    {
      "id": "geej61k",
      "author": "rachelnessxo",
      "body": "I used to make a monthly donation, and every time I would talk myself out of binging on junk food, I would donate some of the money I would have spent. It feels really great to do the monthly giving because it tells you where your money went.",
      "created_utc": 1606936594.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gee1y4d",
      "author": "ijuanaexpire",
      "body": "IOS: https://apps.apple.com/au/app/sharethemeal-charity-donate/id977130010\n\nAndroid: https://play.google.com/store/apps/details?id=org.sharethemeal.app&hl=en&gl=US",
      "created_utc": 1606929630.0,
      "score": 10,
      "context": []
    }
  ]
}