{
  "id": "k600v6",
  "subreddit": "fuckeatingdisorders",
  "author": "OhnoOhyes12",
  "created_utc": 1607011623.0,
  "title": "I got my period again after 2 years",
  "selftext": "I haven't had my period in almost 2 years and that was really scary since I don't want to damage my bones or my ability to have children. The last few months I've been recovering and gained almost 6 kg. To be honest I didn't expect to get it back so soon, but I'm so relieved. I just want to share this here since no one in my life about this and I really want someone to share this with since it's a huge step for me and I've been struggling with my Ed for a really long time but no one knows how bad it was 🥺",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k600v6/i_got_my_period_again_after_2_years/",
  "score": 94,
  "num_comments": 9,
  "comments": [
    {
      "id": "gehxhjc",
      "author": "eileen_i",
      "body": "I'm happy for you!! The same thing happened to me and you explained it perfectly--it's such a relief! I remember being younger and dreading it, but we have a new appreciation for it, it means your body is getting healthier. I'm excited for you!!",
      "created_utc": 1607012250.0,
      "score": 18,
      "context": []
    },
    {
      "id": "geik0lx",
      "author": "Caroline_Directioner",
      "body": "I’m so happy for you, that’s such a huge step in your recovery!",
      "created_utc": 1607022780.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gejct5d",
      "author": "DedicatedtoDistance",
      "body": "Yay!",
      "created_utc": 1607035159.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gek1dzx",
      "author": "cherbebe12",
      "body": "Congrats on your progress!!! I didn’t want mine back but it sort slowly started to come back this year. I feel torn between relieved I’m getting healthier and won’t mess up my fertility, and the satisfaction I felt when I lost it.",
      "created_utc": 1607050009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gekibe3",
      "author": "alacondor",
      "body": "That’s amazing!!! So proud! I had a friend who lost her period for months and it was honestly scary as she could barely do anything and idk what your experience is with this but she barely could do any physical activities as she would get tired instantly and had almost no energy to do anything. She was always a sick pale colour and just not good... but I’m glad you got your period again as that’s a sign you are on the right track and your body is beginning to work normally again!",
      "created_utc": 1607062211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gekr29k",
      "author": "sweetpotato37",
      "body": "Congratulations. Its a great feeling!\n\nI got mine back recently after 10 years.. I didn't know how to feel when I first saw the blood. I was scared, happy, nervous..\n\nKeep pushing forwards, you're doing great!",
      "created_utc": 1607069945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gehyfl5",
      "author": "OhnoOhyes12",
      "body": "Thank you 💕",
      "created_utc": 1607012703.0,
      "score": 5,
      "context": [
        {
          "id": "gehxhjc",
          "author": "eileen_i",
          "body": "I'm happy for you!! The same thing happened to me and you explained it perfectly--it's such a relief! I remember being younger and dreading it, but we have a new appreciation for it, it means your body is getting healthier. I'm excited for you!!",
          "created_utc": 1607012250.0
        }
      ]
    },
    {
      "id": "gekue4r",
      "author": "None",
      "body": "Ten years? Oh my goodness can I ask if you did anything in particular?  I am so pleased and proud of you for getting it back!\n\nIt's been 7 years and I am feeling desperate. I have put on weight, eating lots of carbs and fats, and reduced exercise but still nothing.",
      "created_utc": 1607073214.0,
      "score": 2,
      "context": [
        {
          "id": "gekr29k",
          "author": "sweetpotato37",
          "body": "Congratulations. Its a great feeling!\n\nI got mine back recently after 10 years.. I didn't know how to feel when I first saw the blood. I was scared, happy, nervous..\n\nKeep pushing forwards, you're doing great!",
          "created_utc": 1607069945.0
        }
      ]
    },
    {
      "id": "gekvrm2",
      "author": "sweetpotato37",
      "body": "I had to have a serious talk with my doctor.\n\nI'm 26 but I've been diagnosed with osteoporosis in my hips and leg joints. It had started to hurt to walk so they sent me for a dexa scan. It scared me.\n\nMy doctor told me that because I hadn't had my period for over 10 years, my body wasn't getting enough estrogen to help protect my bones.\n\nSo I worked on gaining a little bit of weight. I saw an amazing therapist who specialised in 'transactional analysis'. (I tried counselling with CBT and person centered, and nothing worked.)\n\nThe GP but me on some higher estrogen tablets as well. They're called microgron (I think) and they've helped me, along with the weight gain.\n\nGaining weight has been a massive struggle because really I find it hard to keep any food down at all. I focused on eating what my body was really craving, in the hope that my body would instinctively tell me because of nutrients or vitamins I might be missing.\n\nI eat a lot of Asda's carrot and pumpkin seed bread with strawberry jam.\n\nThis was just what helped me, it might not be the same for anyone else.\n\nThank you so much for your lovely message!",
      "created_utc": 1607074644.0,
      "score": 1,
      "context": [
        {
          "id": "gekr29k",
          "author": "sweetpotato37",
          "body": "Congratulations. Its a great feeling!\n\nI got mine back recently after 10 years.. I didn't know how to feel when I first saw the blood. I was scared, happy, nervous..\n\nKeep pushing forwards, you're doing great!",
          "created_utc": 1607069945.0
        },
        {
          "id": "gekue4r",
          "author": "None",
          "body": "Ten years? Oh my goodness can I ask if you did anything in particular?  I am so pleased and proud of you for getting it back!\n\nIt's been 7 years and I am feeling desperate. I have put on weight, eating lots of carbs and fats, and reduced exercise but still nothing.",
          "created_utc": 1607073214.0
        }
      ]
    }
  ]
}