{
  "id": "k6o0wt",
  "subreddit": "fuckeatingdisorders",
  "author": "dude_duh",
  "created_utc": 1607098981.0,
  "title": "I used to only drink black coffee but now I make specialty coffees all the time.",
  "selftext": "I used to be so scared to drink anything but black coffee. I didn't want to add sugar, syrups, or milk because it was just extra calories. Since I've been in recovery, my espresso machine is experiencing a whole new world of specialty lattes. Made an eggnog latte today with homemade eggnog (something I never drank while I was struggling) and it was delicious. Apple spice latte? Sure. Einspänner? Delicious.\n\nI don't even care anymore. My at-home coffee shop is decked out with stuff I used to be scared of.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k6o0wt/i_used_to_only_drink_black_coffee_but_now_i_make/",
  "score": 94,
  "num_comments": 6,
  "comments": [
    {
      "id": "gem3flv",
      "author": "djagta",
      "body": "That's so cool and you've come so far!! I've never heard of einspänner but I looked it up and you're inspiring me to go make some too haha",
      "created_utc": 1607102310.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gemrlnl",
      "author": "cone_hat_crown_crow",
      "body": "Me, too!! Only black coffee - hot or iced. But now I'm really into making cappuccinos and lattes at home. (Or asking my boyfriend to make them lol) It's such a nice treat! I haven't tried adding extra spices or flavors, but the apple spice latte sounds amazing! Going to have to try that.",
      "created_utc": 1607113890.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gemfs9c",
      "author": "tinybirdiee",
      "body": "this is my biggest dream. thank you for sharing :)",
      "created_utc": 1607108140.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gemw2k7",
      "author": "abnormalswanker",
      "body": "WE LOVE❤️❤️❤️🥰",
      "created_utc": 1607116126.0,
      "score": 3,
      "context": []
    },
    {
      "id": "genamn6",
      "author": "bigheadbitch",
      "body": "i love watching videos of people making their fancy coffees!! i really like making my own eggnog lattes too but homemade eggnog sounds even more amazing!!!",
      "created_utc": 1607123861.0,
      "score": 3,
      "context": []
    },
    {
      "id": "genllvv",
      "author": "dude_duh",
      "body": "So simple but really tasty. Some people mix the whipped cream into the espresso but I let it mix in as I sip. Bitter and sweet :)",
      "created_utc": 1607130208.0,
      "score": 5,
      "context": [
        {
          "id": "gem3flv",
          "author": "djagta",
          "body": "That's so cool and you've come so far!! I've never heard of einspänner but I looked it up and you're inspiring me to go make some too haha",
          "created_utc": 1607102310.0
        }
      ]
    }
  ]
}