{
  "id": "k7oail",
  "subreddit": "fuckeatingdisorders",
  "author": "makeupyourworld",
  "created_utc": 1607234827.0,
  "title": "I had pizza and chinese food today",
  "selftext": "This isn’t really that big a deal I guess because I eat a lot of these “challenging” foods all the time but ordering or even admitting that i want takeout is a HUGE deal for me. I cook every night bc I feel the need to provide for others and that in order to eat i need to accomplish something like make something nice or make others happy by making food for them (i enjoy eating with family theyre kinda supportive) but literally college has been SO rough and its been impossible to cook all the time, finish my exams, and have time to do normal sh** like shower (or do my nails which i really wanted to do tonight!) Yesterday I had a bad stomach all day and couldnt eat til late and my mom was like what can i make you and i was like i really want pizza can we got pizza and we ordered cheese pizza from the place that makes real New York Pizza and it was so good 😊 and i had that for dinner last night and then for lunch today too. And after lunch I had to take an exam for 3 hours online and then i wanted to shower, go for a walk, and do my nails and i was CRAVING Chinese food. I havent had chinese takeout in a minimum of 5 years. Only ever would steal like 4 spoons of fried rice when my dad got it bc he never dared asked me bc im anxiety times 1000x. So tonight my mom was like what do u wanna eat and i was like uh idk and after like 20 minutes of me shaking i was like “honestly im craving chinese food so badly like craving” and she was like “let me see if dad is near the good place on his way home from work, ill have chinese too.” and she was like what do you want and i was like, soup, spare ribs, and lo mein. so for all of us she ordered a wonton soup, a small hot and sour bc thats my jam, spare ribs, pork fried rice, and vegetable lo mein noodles. we ate and watched a movie and it was SO good!!!! omg i had takeout twice in one day and for dinner two nights in a row obviously were not made of money so can’t do that everyday but man i really needed it so bad. i needed reassurance like 90 times and my mom was like “um i get food/order food at work a few days per week food is a necessity you’re allowed to have someone else do the work you dont need a reason.” do yeah im freaking out a bit but it was delicious 10/10",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/k7oail/i_had_pizza_and_chinese_food_today/",
  "score": 86,
  "num_comments": 4,
  "comments": [
    {
      "id": "geuqk1q",
      "author": "CozyJumpers",
      "body": "Aw your parents sound like lil peaches :) And congrats on being able to eat take out twice in a row!!",
      "created_utc": 1607277839.0,
      "score": 3,
      "context": []
    },
    {
      "id": "geuqypq",
      "author": "makeupyourworld",
      "body": "IM FREAKING OUT BC I GAINED 2 LBS OVERNIGHT IM JUST TRYNA TELL MYSELF ITS WATER AND FLUCTUATIONS AND TO CHILL\n\nand yes most of the time they are quite nice i am so happy they ordered me takeout bc like they get it a lot but are always scared to ask me bc im in a panic about food 107% of the time but theyre like girl u know if u want chinese food or pizza or ramen or chick fil a we gotchu. like my first year of college my dad would pick up vegan takeout every weekend or even sometimes eat in the vegan restaurant with me that he hated bc it was my “safe place” and then the weird restaurant fear happened :o",
      "created_utc": 1607278040.0,
      "score": 1,
      "context": [
        {
          "id": "geuqk1q",
          "author": "CozyJumpers",
          "body": "Aw your parents sound like lil peaches :) And congrats on being able to eat take out twice in a row!!",
          "created_utc": 1607277839.0
        }
      ]
    },
    {
      "id": "geutcpa",
      "author": "CozyJumpers",
      "body": "It's 100% water/food weight. You can't permanently gain 2 lbs overnight unless you eat a literal truckload's worth of food, and even then the weight gain wouldn't show up til days later when the food has actually been digested and stored as fat, don't worry!!",
      "created_utc": 1607279104.0,
      "score": 3,
      "context": [
        {
          "id": "geuqk1q",
          "author": "CozyJumpers",
          "body": "Aw your parents sound like lil peaches :) And congrats on being able to eat take out twice in a row!!",
          "created_utc": 1607277839.0
        },
        {
          "id": "geuqypq",
          "author": "makeupyourworld",
          "body": "IM FREAKING OUT BC I GAINED 2 LBS OVERNIGHT IM JUST TRYNA TELL MYSELF ITS WATER AND FLUCTUATIONS AND TO CHILL\n\nand yes most of the time they are quite nice i am so happy they ordered me takeout bc like they get it a lot but are always scared to ask me bc im in a panic about food 107% of the time but theyre like girl u know if u want chinese food or pizza or ramen or chick fil a we gotchu. like my first year of college my dad would pick up vegan takeout every weekend or even sometimes eat in the vegan restaurant with me that he hated bc it was my “safe place” and then the weird restaurant fear happened :o",
          "created_utc": 1607278040.0
        }
      ]
    },
    {
      "id": "geuxfep",
      "author": "makeupyourworld",
      "body": "True. Yesterday I ate 2 slices of pizza (lunch), one scoop of rice, 3 ribs, and a serving of lo mein noodles. And 2 cups of organic apple juice. That is not 7000 calories. That is a normal amount of food! I walked 5 miles and my body needed to eat well! I need to remember that! Salt and fluids can shift our bodies water balance all the time it is no biggie just relax and let it pass. :-)",
      "created_utc": 1607280804.0,
      "score": 1,
      "context": [
        {
          "id": "geuqk1q",
          "author": "CozyJumpers",
          "body": "Aw your parents sound like lil peaches :) And congrats on being able to eat take out twice in a row!!",
          "created_utc": 1607277839.0
        },
        {
          "id": "geuqypq",
          "author": "makeupyourworld",
          "body": "IM FREAKING OUT BC I GAINED 2 LBS OVERNIGHT IM JUST TRYNA TELL MYSELF ITS WATER AND FLUCTUATIONS AND TO CHILL\n\nand yes most of the time they are quite nice i am so happy they ordered me takeout bc like they get it a lot but are always scared to ask me bc im in a panic about food 107% of the time but theyre like girl u know if u want chinese food or pizza or ramen or chick fil a we gotchu. like my first year of college my dad would pick up vegan takeout every weekend or even sometimes eat in the vegan restaurant with me that he hated bc it was my “safe place” and then the weird restaurant fear happened :o",
          "created_utc": 1607278040.0
        },
        {
          "id": "geutcpa",
          "author": "CozyJumpers",
          "body": "It's 100% water/food weight. You can't permanently gain 2 lbs overnight unless you eat a literal truckload's worth of food, and even then the weight gain wouldn't show up til days later when the food has actually been digested and stored as fat, don't worry!!",
          "created_utc": 1607279104.0
        }
      ]
    }
  ]
}