{
  "id": "kboexh",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1607776550.0,
  "title": "Can we stop using Stephanie Buttermore as an example in recovery?",
  "selftext": "EDIT: I took some time to consider what others have said and I absolutely agree that she very well might still have an eating disorder; that said, if she does she’s absolutely not in recovery and likely restricting and therefore my point still stands that she still should not be used as an example in recovery. All that said, I appreciate being called out because it isn’t fair to assume someone’s health, psychologically or physically.\n\nShe didn’t have an eating disorder. She had disordered eating, sure, but she did not having a full blown ED—she has never even described herself as having an eating disorder.\n\nTbh I feel like people use her as an example for what we WANT after recovery despite the fact that she continued to exercise, she refused to give up her physique for the most part and talks about dropping weight—all of the things we’re supposed to avoided in recovery—because she remained muscular and thin. If she didn’t, I doubt she’d be as hyped up as she has been, especially in the ED community.\n\nI’m happy she eats intuitively now, but when I watched her videos as per someone’s recommendation I felt more triggered and upset with myself than motivated. I don’t look like her weight restored. Even when I started exercising again. And I know many of us don’t.\n\nI just feel like she’s not a great example considering she clung to her physique and exercise in a way that we with eating disorders simply cannot do if we want to recover fully.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kboexh/can_we_stop_using_stephanie_buttermore_as_an/",
  "score": 166,
  "num_comments": 60,
  "comments": [
    {
      "id": "gfivaii",
      "author": "CelestialWolfMoon",
      "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
      "created_utc": 1607780104.0,
      "score": 75,
      "context": []
    },
    {
      "id": "gfkxvr7",
      "author": "anjaliv",
      "body": "I agree that she’s not a good example of ED recovery but not because she doesn’t have an eating disorder but rather than she refuses to acknowledge the psychological aspects of her ED. I don’t propose to know how or why her body returned to a fit shape so quickly. But I do see a woman posting body checking photos of herself nearly EVERY single day, and showing off her outfits and squatting in front of the mirror too often to consider her as recovered. She really had to  think about her actions and beliefs when she was at her heaviest so that she could find her way through that time, but almost as quickly as she she lost that weight the body checking and “working for your calories” beliefs all returned.  She may even agree she “might have” an eating disorder but I think she doesn’t want to work through it. Her mentality sorta shows in everything she does. When she started reading books for her book, it became about how many books she could read in a year. When she began solving rubik’s cubes, it quickly became about how fast she could do it. She is an all or nothing person in her mentality and a perfectionist, which I know most of us ended up here in the first place with that way of seeing life. \n\nI don’t think her science is wrong but I do think she’s the type of person who will find science to objectify her reasoning for believing in something bc of her black and white thinking. What I mean to say is she only challenged her beliefs about health/fitness when she was so hungry that she was desperate, and THEN found science to justify going all in. And if she decides it doesn’t work anymore, her ED will find the science for that too. That to me is also a little ED-ish. Not using your internal emotional wisdom/growth/honesty/reflection about yourself but relying on black and white objective truths/numbers/stats. Some people rely on science as an objective truth and emotional crutch for decision making. Our world is weird that way, there is actually science for completely contrasting things and when you’re looking for absolute truths, you will realize that it’s pretty tough to find the “Real” answer. Does that make sense? I do agree with set point theory however she herself doesn’t prescribe this for everyone and to me that is admitting that she is picking and choosing what she wants to believe for herself. (Also distancing herself from her weight gain by framing it in a statistical/scientific way is just an emotional defense mechanism but that’s just my opinion lol). \n\nTo me the only useful part of her all in theory is that if you eat enough and don’t restrict your weight settles into one weight that doesn’t change much. That’s about it. The end point of balance is the most important. Those of us who come from ED recovery usually have had to do what Stephanie did, but most of us will end up over our regular weight for a while and MAYBE down a couple oz in the end lol not back to an fab fit athletic physique. But again the main point is, we would be RECOVERED, mentally and emotionally. So the way our body looks wouldn’t be such a big deal anymore. We wouldn’t even be thinking about it. We’d be absolutely neutral and wouldn’t be posting selfies every day to the world. I do agree with the science on set weight theory. There is a steady state between starvation and binging. But it doesn’t look like Stephanie because she’s not recovered and hasn’t done the heavy emotional work of recovery. \n\nI guess tl/dr she’s not a great example because to me she’s not recovered and doesn’t really want to be because she profits too much from being thin, beautiful and fit.\n\n*sorry for all the edits I’m just clarifying my thoughts!",
      "created_utc": 1607805321.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gfjemz2",
      "author": "doctorslacker",
      "body": "I agree with a lot of what’s been said here, especially how useful it is to see someone go through all of the uncomfortable parts of refeeding.\n\nI will say, an “all-in” recovery was what finally worked for me after years of treatment including multiple hospitalizations, and this was the first time I saw that method discussed so broadly. I personally found eating “all-in” much less restrictive than exchanges, much less stressful than eating intuitively and trying to decide how much food was ok, and my hunger-fullness signals actually returned and my food focus faded unlike with any other method I’d tried previously.\n\nI had bulimia nervosa. I understand this may not be the best method for every bulimic or for many people with other EDs, but I wish I’d known it was an option much sooner. It’s hard not to want to spread the word. Also, the number and popularity of Steph's videos make her an easy resource to point to.\n\nALL THAT SAID, I would recommend Kayla Rose instead. Kayla was Stephanie Buttermore's inspiration, someone who had an ED and recovered, and she creates much more ED-related content.",
      "created_utc": 1607787187.0,
      "score": 40,
      "context": []
    },
    {
      "id": "gfmbqrf",
      "author": "lameanonymous",
      "body": "There has always been something that didn’t sit right with me about the way she body checks and takes posed/unposed pictures of her body nearly every day, but in her videos she claims that she could care less about what weight she ended on as long as she wasn’t hungry anymore? I don’t know why it bothers me??? if I’m just being a cynic or what, but idk??  Like she is 100% allowed to be happy w her body and the journey she has been on, and her body is definitely healthier, and I do agree it could potentially be damaging to Frame her as a recovery GOAL or something to aspire to",
      "created_utc": 1607821069.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gfiq5zy",
      "author": "cheshlz",
      "body": "Preach",
      "created_utc": 1607777766.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gfis6ri",
      "author": "None",
      "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
      "created_utc": 1607778529.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gfmgx1e",
      "author": "Rosenhansthud",
      "body": "On the bright side, Buttermore is a funny name for someone with an ED.",
      "created_utc": 1607823143.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfjl60e",
      "author": "tears_of_an_angel_",
      "body": "I know she didn’t have an Ed but I still like her and she’s still super inspiring to me. I resonated with a lot about what she said about her experience with extreme hunger and her attitude and eating habits just inspire me to want to recover I guess",
      "created_utc": 1607789415.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gfjsmxo",
      "author": "classic_moth",
      "body": "Totally agreed. I feel really uncomfortable every time she is paraded as an example. What she's going through is of course admirable and -her- journey. She comes from a place of maintaining an extremely low level of body fat and doing massive \"cheat days\". Looking back at those videos now it strikes me how it's basically justified binge eating.\n\nAgain, that's her choice, and I'm glad she's taking a healthier approach now, but she's definitely not - as you say - an example of what recovery should look like for the majority of us.\n\nEDIT: The one thing I do appreciate about her all-in journey is that it made me realize that recovery doesn't automatically mean you'll balloon up and never stop gaining weight! That's one of my greatest fears and having those mollified is at least valuable. I can learn to trust my hunger cues, eat moderately healthy, and eventually my body will take care of the rest.",
      "created_utc": 1607791982.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gfjfa59",
      "author": "zedem124",
      "body": "I agree. and I just feel frustrated with myself because I don't look like her version of recovered.",
      "created_utc": 1607787404.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gfmuqxu",
      "author": "standsure",
      "body": "Done. I have no clue who she is and happy to keep it that way.",
      "created_utc": 1607829071.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfmsvc3",
      "author": "coffeesoakedpickles",
      "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
      "created_utc": 1607828094.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gflouf6",
      "author": "None",
      "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
      "created_utc": 1607814149.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gfitlke",
      "author": "internerderner2",
      "body": "I don't like her as a person and don't care about her as a youtuber, but I guess some people took her as an example because she was a fit and fairly high-profile youtuber who just started eating to satiety without any restriction, which is what many people in recovery want to do (me included lol). \n\nIf anything I have a problem with Gwyneth Olwyn, but seems like she's no longer mentioned lately, which is good.",
      "created_utc": 1607779245.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfjdf8c",
      "author": "AlectBeck",
      "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
      "created_utc": 1607786769.0,
      "score": 49,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        }
      ]
    },
    {
      "id": "gfj94em",
      "author": "applecinnamonnn",
      "body": "very well put, I agree",
      "created_utc": 1607785243.0,
      "score": 8,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        }
      ]
    },
    {
      "id": "gflpzn7",
      "author": "Sareeee48",
      "body": "This is everything I felt but couldn’t put into words, holy fuck. I’m happy I took the time to read this, I 10000% agree with everything you said.",
      "created_utc": 1607814464.0,
      "score": 9,
      "context": [
        {
          "id": "gfkxvr7",
          "author": "anjaliv",
          "body": "I agree that she’s not a good example of ED recovery but not because she doesn’t have an eating disorder but rather than she refuses to acknowledge the psychological aspects of her ED. I don’t propose to know how or why her body returned to a fit shape so quickly. But I do see a woman posting body checking photos of herself nearly EVERY single day, and showing off her outfits and squatting in front of the mirror too often to consider her as recovered. She really had to  think about her actions and beliefs when she was at her heaviest so that she could find her way through that time, but almost as quickly as she she lost that weight the body checking and “working for your calories” beliefs all returned.  She may even agree she “might have” an eating disorder but I think she doesn’t want to work through it. Her mentality sorta shows in everything she does. When she started reading books for her book, it became about how many books she could read in a year. When she began solving rubik’s cubes, it quickly became about how fast she could do it. She is an all or nothing person in her mentality and a perfectionist, which I know most of us ended up here in the first place with that way of seeing life. \n\nI don’t think her science is wrong but I do think she’s the type of person who will find science to objectify her reasoning for believing in something bc of her black and white thinking. What I mean to say is she only challenged her beliefs about health/fitness when she was so hungry that she was desperate, and THEN found science to justify going all in. And if she decides it doesn’t work anymore, her ED will find the science for that too. That to me is also a little ED-ish. Not using your internal emotional wisdom/growth/honesty/reflection about yourself but relying on black and white objective truths/numbers/stats. Some people rely on science as an objective truth and emotional crutch for decision making. Our world is weird that way, there is actually science for completely contrasting things and when you’re looking for absolute truths, you will realize that it’s pretty tough to find the “Real” answer. Does that make sense? I do agree with set point theory however she herself doesn’t prescribe this for everyone and to me that is admitting that she is picking and choosing what she wants to believe for herself. (Also distancing herself from her weight gain by framing it in a statistical/scientific way is just an emotional defense mechanism but that’s just my opinion lol). \n\nTo me the only useful part of her all in theory is that if you eat enough and don’t restrict your weight settles into one weight that doesn’t change much. That’s about it. The end point of balance is the most important. Those of us who come from ED recovery usually have had to do what Stephanie did, but most of us will end up over our regular weight for a while and MAYBE down a couple oz in the end lol not back to an fab fit athletic physique. But again the main point is, we would be RECOVERED, mentally and emotionally. So the way our body looks wouldn’t be such a big deal anymore. We wouldn’t even be thinking about it. We’d be absolutely neutral and wouldn’t be posting selfies every day to the world. I do agree with the science on set weight theory. There is a steady state between starvation and binging. But it doesn’t look like Stephanie because she’s not recovered and hasn’t done the heavy emotional work of recovery. \n\nI guess tl/dr she’s not a great example because to me she’s not recovered and doesn’t really want to be because she profits too much from being thin, beautiful and fit.\n\n*sorry for all the edits I’m just clarifying my thoughts!",
          "created_utc": 1607805321.0
        }
      ]
    },
    {
      "id": "gfmugzs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607828924.0,
      "score": 6,
      "context": [
        {
          "id": "gfkxvr7",
          "author": "anjaliv",
          "body": "I agree that she’s not a good example of ED recovery but not because she doesn’t have an eating disorder but rather than she refuses to acknowledge the psychological aspects of her ED. I don’t propose to know how or why her body returned to a fit shape so quickly. But I do see a woman posting body checking photos of herself nearly EVERY single day, and showing off her outfits and squatting in front of the mirror too often to consider her as recovered. She really had to  think about her actions and beliefs when she was at her heaviest so that she could find her way through that time, but almost as quickly as she she lost that weight the body checking and “working for your calories” beliefs all returned.  She may even agree she “might have” an eating disorder but I think she doesn’t want to work through it. Her mentality sorta shows in everything she does. When she started reading books for her book, it became about how many books she could read in a year. When she began solving rubik’s cubes, it quickly became about how fast she could do it. She is an all or nothing person in her mentality and a perfectionist, which I know most of us ended up here in the first place with that way of seeing life. \n\nI don’t think her science is wrong but I do think she’s the type of person who will find science to objectify her reasoning for believing in something bc of her black and white thinking. What I mean to say is she only challenged her beliefs about health/fitness when she was so hungry that she was desperate, and THEN found science to justify going all in. And if she decides it doesn’t work anymore, her ED will find the science for that too. That to me is also a little ED-ish. Not using your internal emotional wisdom/growth/honesty/reflection about yourself but relying on black and white objective truths/numbers/stats. Some people rely on science as an objective truth and emotional crutch for decision making. Our world is weird that way, there is actually science for completely contrasting things and when you’re looking for absolute truths, you will realize that it’s pretty tough to find the “Real” answer. Does that make sense? I do agree with set point theory however she herself doesn’t prescribe this for everyone and to me that is admitting that she is picking and choosing what she wants to believe for herself. (Also distancing herself from her weight gain by framing it in a statistical/scientific way is just an emotional defense mechanism but that’s just my opinion lol). \n\nTo me the only useful part of her all in theory is that if you eat enough and don’t restrict your weight settles into one weight that doesn’t change much. That’s about it. The end point of balance is the most important. Those of us who come from ED recovery usually have had to do what Stephanie did, but most of us will end up over our regular weight for a while and MAYBE down a couple oz in the end lol not back to an fab fit athletic physique. But again the main point is, we would be RECOVERED, mentally and emotionally. So the way our body looks wouldn’t be such a big deal anymore. We wouldn’t even be thinking about it. We’d be absolutely neutral and wouldn’t be posting selfies every day to the world. I do agree with the science on set weight theory. There is a steady state between starvation and binging. But it doesn’t look like Stephanie because she’s not recovered and hasn’t done the heavy emotional work of recovery. \n\nI guess tl/dr she’s not a great example because to me she’s not recovered and doesn’t really want to be because she profits too much from being thin, beautiful and fit.\n\n*sorry for all the edits I’m just clarifying my thoughts!",
          "created_utc": 1607805321.0
        }
      ]
    },
    {
      "id": "gfn1lzi",
      "author": "Sareeee48",
      "body": "I generally enjoy Kayla Rose but I wish she wouldn’t do food she eats in a day videos lol",
      "created_utc": 1607832529.0,
      "score": 7,
      "context": [
        {
          "id": "gfjemz2",
          "author": "doctorslacker",
          "body": "I agree with a lot of what’s been said here, especially how useful it is to see someone go through all of the uncomfortable parts of refeeding.\n\nI will say, an “all-in” recovery was what finally worked for me after years of treatment including multiple hospitalizations, and this was the first time I saw that method discussed so broadly. I personally found eating “all-in” much less restrictive than exchanges, much less stressful than eating intuitively and trying to decide how much food was ok, and my hunger-fullness signals actually returned and my food focus faded unlike with any other method I’d tried previously.\n\nI had bulimia nervosa. I understand this may not be the best method for every bulimic or for many people with other EDs, but I wish I’d known it was an option much sooner. It’s hard not to want to spread the word. Also, the number and popularity of Steph's videos make her an easy resource to point to.\n\nALL THAT SAID, I would recommend Kayla Rose instead. Kayla was Stephanie Buttermore's inspiration, someone who had an ED and recovered, and she creates much more ED-related content.",
          "created_utc": 1607787187.0
        }
      ]
    },
    {
      "id": "gfn2de0",
      "author": "Sareeee48",
      "body": "THIS, I feel the same way. I feel like she is very much disordered in a lot of ways and people are always commenting “oh check out Stephanie Buttermore if you’re afraid of overshoot! She lost all of her weight, just be patient.” And I’m like uhhhhhh, that’s not how this works.\n\nI guarantee if she wound up being heavier no one would be praising her so much.",
      "created_utc": 1607832842.0,
      "score": 9,
      "context": [
        {
          "id": "gfmbqrf",
          "author": "lameanonymous",
          "body": "There has always been something that didn’t sit right with me about the way she body checks and takes posed/unposed pictures of her body nearly every day, but in her videos she claims that she could care less about what weight she ended on as long as she wasn’t hungry anymore? I don’t know why it bothers me??? if I’m just being a cynic or what, but idk??  Like she is 100% allowed to be happy w her body and the journey she has been on, and her body is definitely healthier, and I do agree it could potentially be damaging to Frame her as a recovery GOAL or something to aspire to",
          "created_utc": 1607821069.0
        }
      ]
    },
    {
      "id": "gfiwa1a",
      "author": "DeathWish111",
      "body": "You really believe she lost 25 pounds unintentionally in less than 5 months?",
      "created_utc": 1607780505.0,
      "score": 30,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        }
      ]
    },
    {
      "id": "gfjqquv",
      "author": "None",
      "body": "I thought my exercise was my passion for years and thought I was “recovered” as well despite spending at least an hour everyday exercising and having full scale anxiety attacks when I missed a day. I was eating, but i still was obsessed with my body, eating “healthy”and making sure I was lean and fit. My ED just transferred over to orthiorexia.",
      "created_utc": 1607791374.0,
      "score": 9,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        }
      ]
    },
    {
      "id": "gfit0qq",
      "author": "Sareeee48",
      "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
      "created_utc": 1607778911.0,
      "score": 18,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        }
      ]
    },
    {
      "id": "gfn1bzr",
      "author": "Sareeee48",
      "body": "I would agree if her social media accounts weren’t also riddled with restrictive behaviors and disordered mindsets (many people have pointed out a lot of her problematic behavior in the comments so I don’t state them here).\n\nYou are 100% allowed to find someone’s methods inspirational but it doesn’t change the fact that they are unhealthy and damaging to others.",
      "created_utc": 1607832418.0,
      "score": 7,
      "context": [
        {
          "id": "gfmsvc3",
          "author": "coffeesoakedpickles",
          "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
          "created_utc": 1607828094.0
        }
      ]
    },
    {
      "id": "gflrory",
      "author": "Sareeee48",
      "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
      "created_utc": 1607814936.0,
      "score": 16,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        }
      ]
    },
    {
      "id": "gfiu31r",
      "author": "Sareeee48",
      "body": "Which is also kind of my point—if she wasn’t fit or gained a lot of weight back that didn’t fit into societal beauty standards, she would have been ignored and ridiculed (more) I think. I don’t mind her content, I mind people using her as an example of what they wanna look like, talking about overshoot, etc. but we don’t talk much about actual ED accounts like Talyngrace on IG.\n\nTotally agree with you about Gwyneth Owlyn though she’s super fucking toxic... and Alice Olivia as well, though not to such an extreme extent.",
      "created_utc": 1607779559.0,
      "score": 11,
      "context": [
        {
          "id": "gfitlke",
          "author": "internerderner2",
          "body": "I don't like her as a person and don't care about her as a youtuber, but I guess some people took her as an example because she was a fit and fairly high-profile youtuber who just started eating to satiety without any restriction, which is what many people in recovery want to do (me included lol). \n\nIf anything I have a problem with Gwyneth Olwyn, but seems like she's no longer mentioned lately, which is good.",
          "created_utc": 1607779245.0
        }
      ]
    },
    {
      "id": "gfjmhcb",
      "author": "internerderner2",
      "body": "IIRC she used to make up the same \"lies\" before, masking her cheat days and her intermittent fasting or whatever as her true natural way of eating. But I never really followed her so I don't know.",
      "created_utc": 1607789864.0,
      "score": 13,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        }
      ]
    },
    {
      "id": "gfjoax6",
      "author": "Sareeee48",
      "body": "This as welll... I checked out her IG awhile ago and noped out of there so quick.",
      "created_utc": 1607790496.0,
      "score": 7,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        }
      ]
    },
    {
      "id": "gfkequw",
      "author": "tatertotski",
      "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
      "created_utc": 1607799150.0,
      "score": 6,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        }
      ]
    },
    {
      "id": "gfjfd5b",
      "author": "zedem124",
      "body": "I have to agree with this.",
      "created_utc": 1607787433.0,
      "score": 3,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        }
      ]
    },
    {
      "id": "gfn3eeh",
      "author": "anjaliv",
      "body": "Hey thanks so much for sharing your point of view! I agree with you as well but I have a few personal opinions which I will share cuz why not lol...\n\n I personally have the belief that our desire change our otherwise physically healthy bodies to look a specific way is in itself a shade of disordered. It’s just disordered in a more functional way. (That is just my opinion so please take it as that!) Despite the fact that it is in our culture to do this and despite the fact that it is something generally accepted as normal and in fact a point of pride, I still just can’t see this to be particularly healthy behavior. I don’t think of it as a behavior that is ingrained in us, i think it is something we pick up as we grow older (the idea that we can and should alter our bodies). It just becomes very tricky to see it for what it is when we are in the same society that we are trying to make an observation on.\n\n I agree that it’s not black and white. But I believe where the shades of grey lie is in that there are very many shades of “disordered” from functioning disordered to highly non-functioning disordered.  The only time something is actually clinically diagnosed is when it’s interruptive to daily life, but that doesn’t make the behaviors safe just because they aren’t clinically diagnosed. So when someone casually goes on a diet, it is still a disordered behavior but largely overlooked because everyone does it. When someone rigidly over exercises, that’s still disordered too. I’m not saying it an issue that now SHOULD be fixed by everyone, but i believe it’s honest to acknowledge that these behaviors are mildly disordered at the least (orthorexia). Stephanie has said she felt a deep sense of pressure to look like the rest of the fitness industry to be taken seriously. This is fair, and in fact it’s the reason women alter or suppress their natural weight, to conform to society at some degree. It’s not a wrong thing to do but i believe it is in one shape or another, a reaction to societal pressure (in the same way that some women eat less because of guilt, or pain, or eat more because of pain and hurt). Body conformity comes from the psychological desire of wanting to belong. That discrimination does do harm and we as a society do need to work on being more accepting of body diversity. The alternate side of that “desire” is fear of not belonging.\n\nI think in the end it’s just down to the definition of what “eating disorder” and how serious it should be before it’s classified as a disordered, how common it really is in our society, and what we choose to do once we know these behaviors are affecting us in a negative way. I would hate to think that there are people who would turn away from this subreddit thinking they aren’t “sick enough” but also, if they just aren’t ready to address their issues yet, that’s fine too. I just hope we can live in a society one day where we don’t feel the need to change ourselves to be loved and accepted! :)",
      "created_utc": 1607833273.0,
      "score": 10,
      "context": [
        {
          "id": "gfkxvr7",
          "author": "anjaliv",
          "body": "I agree that she’s not a good example of ED recovery but not because she doesn’t have an eating disorder but rather than she refuses to acknowledge the psychological aspects of her ED. I don’t propose to know how or why her body returned to a fit shape so quickly. But I do see a woman posting body checking photos of herself nearly EVERY single day, and showing off her outfits and squatting in front of the mirror too often to consider her as recovered. She really had to  think about her actions and beliefs when she was at her heaviest so that she could find her way through that time, but almost as quickly as she she lost that weight the body checking and “working for your calories” beliefs all returned.  She may even agree she “might have” an eating disorder but I think she doesn’t want to work through it. Her mentality sorta shows in everything she does. When she started reading books for her book, it became about how many books she could read in a year. When she began solving rubik’s cubes, it quickly became about how fast she could do it. She is an all or nothing person in her mentality and a perfectionist, which I know most of us ended up here in the first place with that way of seeing life. \n\nI don’t think her science is wrong but I do think she’s the type of person who will find science to objectify her reasoning for believing in something bc of her black and white thinking. What I mean to say is she only challenged her beliefs about health/fitness when she was so hungry that she was desperate, and THEN found science to justify going all in. And if she decides it doesn’t work anymore, her ED will find the science for that too. That to me is also a little ED-ish. Not using your internal emotional wisdom/growth/honesty/reflection about yourself but relying on black and white objective truths/numbers/stats. Some people rely on science as an objective truth and emotional crutch for decision making. Our world is weird that way, there is actually science for completely contrasting things and when you’re looking for absolute truths, you will realize that it’s pretty tough to find the “Real” answer. Does that make sense? I do agree with set point theory however she herself doesn’t prescribe this for everyone and to me that is admitting that she is picking and choosing what she wants to believe for herself. (Also distancing herself from her weight gain by framing it in a statistical/scientific way is just an emotional defense mechanism but that’s just my opinion lol). \n\nTo me the only useful part of her all in theory is that if you eat enough and don’t restrict your weight settles into one weight that doesn’t change much. That’s about it. The end point of balance is the most important. Those of us who come from ED recovery usually have had to do what Stephanie did, but most of us will end up over our regular weight for a while and MAYBE down a couple oz in the end lol not back to an fab fit athletic physique. But again the main point is, we would be RECOVERED, mentally and emotionally. So the way our body looks wouldn’t be such a big deal anymore. We wouldn’t even be thinking about it. We’d be absolutely neutral and wouldn’t be posting selfies every day to the world. I do agree with the science on set weight theory. There is a steady state between starvation and binging. But it doesn’t look like Stephanie because she’s not recovered and hasn’t done the heavy emotional work of recovery. \n\nI guess tl/dr she’s not a great example because to me she’s not recovered and doesn’t really want to be because she profits too much from being thin, beautiful and fit.\n\n*sorry for all the edits I’m just clarifying my thoughts!",
          "created_utc": 1607805321.0
        },
        {
          "id": "gfmugzs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607828924.0
        }
      ]
    },
    {
      "id": "gfjcocm",
      "author": "roborunner87",
      "body": "This! I don’t understand her hypes. She definitely had some sort of ED when she said she wanted to eat other people’s left over at the table all the time.",
      "created_utc": 1607786498.0,
      "score": 17,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfiwa1a",
          "author": "DeathWish111",
          "body": "You really believe she lost 25 pounds unintentionally in less than 5 months?",
          "created_utc": 1607780505.0
        }
      ]
    },
    {
      "id": "gfj76ro",
      "author": "antipetpeeves",
      "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
      "created_utc": 1607784553.0,
      "score": 10,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        }
      ]
    },
    {
      "id": "gfn3jwh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607833336.0,
      "score": 3,
      "context": [
        {
          "id": "gfmsvc3",
          "author": "coffeesoakedpickles",
          "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
          "created_utc": 1607828094.0
        },
        {
          "id": "gfn1bzr",
          "author": "Sareeee48",
          "body": "I would agree if her social media accounts weren’t also riddled with restrictive behaviors and disordered mindsets (many people have pointed out a lot of her problematic behavior in the comments so I don’t state them here).\n\nYou are 100% allowed to find someone’s methods inspirational but it doesn’t change the fact that they are unhealthy and damaging to others.",
          "created_utc": 1607832418.0
        }
      ]
    },
    {
      "id": "gfltcmx",
      "author": "None",
      "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
      "created_utc": 1607815414.0,
      "score": 6,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        }
      ]
    },
    {
      "id": "gfkywj6",
      "author": "None",
      "body": "She’s been called out a few times now on r/InstagramReality for shopping. Blurry lines, warped backgrounds and furniture, and then there’s the butt pad incident. She posted some at home workouts where she seems to be wearing some sort of pad or push up undergarment.",
      "created_utc": 1607805659.0,
      "score": 9,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        },
        {
          "id": "gfkequw",
          "author": "tatertotski",
          "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
          "created_utc": 1607799150.0
        }
      ]
    },
    {
      "id": "gfmrf58",
      "author": "AlectBeck",
      "body": ">IIRC\n\nI'm a graphic designer and I work in advertisement. I don't want to sound like I'm bragging or making things up, but after years of working editing pictures, the edits jump to the eye. That, and the fact that some edits are pretty bad/obvious, like wavy counter tops, missing chunks of waist, floating hips and underawear, blurry lines around textured objects (her clothes, her bedsheets, carpet, skin, etc) etc. Those are \"real examples\", you can find those mistakes on her pictures. Her hips look big and round on some pictures, and the next day they'd be boxy/square, just the way the are in real like (which are perfectly fine! Square hips are beautiful too)  \n\n\nEdit: Grammar mistakes",
      "created_utc": 1607827375.0,
      "score": 6,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        },
        {
          "id": "gfkequw",
          "author": "tatertotski",
          "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
          "created_utc": 1607799150.0
        }
      ]
    },
    {
      "id": "gfjio6q",
      "author": "DeathWish111",
      "body": "And how she said her stomach was distended and bloated from being stuffed but she was still thinking about what she wanted to eat next. It's obviously not right for us to diagnose her with an ED, as she has never admitted to having one, but I think saying she absolutely did not have one is bullshit as well.",
      "created_utc": 1607788556.0,
      "score": 18,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfiwa1a",
          "author": "DeathWish111",
          "body": "You really believe she lost 25 pounds unintentionally in less than 5 months?",
          "created_utc": 1607780505.0
        },
        {
          "id": "gfjcocm",
          "author": "roborunner87",
          "body": "This! I don’t understand her hypes. She definitely had some sort of ED when she said she wanted to eat other people’s left over at the table all the time.",
          "created_utc": 1607786498.0
        }
      ]
    },
    {
      "id": "gfja4sh",
      "author": "Sareeee48",
      "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
      "created_utc": 1607785600.0,
      "score": 6,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        }
      ]
    },
    {
      "id": "gfn4cuc",
      "author": "Sareeee48",
      "body": "I am of the belief that you cannot diet or intentionally lose weight in a healthy way as dieting does not work—this is something that science has been very clear about. Having the desire to change your body is inherently unhealthy. So I will respectfully disagree with you and move on as we will not find a middle ground on this.",
      "created_utc": 1607833659.0,
      "score": 6,
      "context": [
        {
          "id": "gfmsvc3",
          "author": "coffeesoakedpickles",
          "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
          "created_utc": 1607828094.0
        },
        {
          "id": "gfn1bzr",
          "author": "Sareeee48",
          "body": "I would agree if her social media accounts weren’t also riddled with restrictive behaviors and disordered mindsets (many people have pointed out a lot of her problematic behavior in the comments so I don’t state them here).\n\nYou are 100% allowed to find someone’s methods inspirational but it doesn’t change the fact that they are unhealthy and damaging to others.",
          "created_utc": 1607832418.0
        },
        {
          "id": "gfn3jwh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607833336.0
        }
      ]
    },
    {
      "id": "gfmb43r",
      "author": "Sareeee48",
      "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
      "created_utc": 1607820812.0,
      "score": 11,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        }
      ]
    },
    {
      "id": "gfmzf64",
      "author": "tatertotski",
      "body": "Oh whoa I haven’t seen her posts on that subreddit, going to try to find them now. Thanks!",
      "created_utc": 1607831619.0,
      "score": 2,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        },
        {
          "id": "gfkequw",
          "author": "tatertotski",
          "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
          "created_utc": 1607799150.0
        },
        {
          "id": "gfkywj6",
          "author": "None",
          "body": "She’s been called out a few times now on r/InstagramReality for shopping. Blurry lines, warped backgrounds and furniture, and then there’s the butt pad incident. She posted some at home workouts where she seems to be wearing some sort of pad or push up undergarment.",
          "created_utc": 1607805659.0
        }
      ]
    },
    {
      "id": "gfjotwe",
      "author": "Sareeee48",
      "body": "I definitely don’t mean to say she definitely does not have one, more so that she has made a point to say she didn’t... but thinking back to her IG she very well could and I highly doubt she’s not restricting again, especially with her “what I eat in a day” videos, talking about not wanting to gain weight during the holidays, etc.",
      "created_utc": 1607790676.0,
      "score": 11,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfiwa1a",
          "author": "DeathWish111",
          "body": "You really believe she lost 25 pounds unintentionally in less than 5 months?",
          "created_utc": 1607780505.0
        },
        {
          "id": "gfjcocm",
          "author": "roborunner87",
          "body": "This! I don’t understand her hypes. She definitely had some sort of ED when she said she wanted to eat other people’s left over at the table all the time.",
          "created_utc": 1607786498.0
        },
        {
          "id": "gfjio6q",
          "author": "DeathWish111",
          "body": "And how she said her stomach was distended and bloated from being stuffed but she was still thinking about what she wanted to eat next. It's obviously not right for us to diagnose her with an ED, as she has never admitted to having one, but I think saying she absolutely did not have one is bullshit as well.",
          "created_utc": 1607788556.0
        }
      ]
    },
    {
      "id": "gfjbg0n",
      "author": "antipetpeeves",
      "body": "I gotcha. I see what you're saying and that makes sense, but I would caution against making the assumption that someone has an eating disorder or not. I had one go undetected for years because I was dead set on hiding it and acting like nothing was wrong, and I never developed close friendships for a period of time because I was too busy with my eating and exercise routines. But on the outside, people didn't see this. I know because I opened up to an old friend who I have gotten much closer with now that I am in a better place, and she said she never knew I was dealing with it back then.",
      "created_utc": 1607786065.0,
      "score": 22,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        },
        {
          "id": "gfja4sh",
          "author": "Sareeee48",
          "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
          "created_utc": 1607785600.0
        }
      ]
    },
    {
      "id": "gfn6te4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607834637.0,
      "score": 2,
      "context": [
        {
          "id": "gfmsvc3",
          "author": "coffeesoakedpickles",
          "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
          "created_utc": 1607828094.0
        },
        {
          "id": "gfn1bzr",
          "author": "Sareeee48",
          "body": "I would agree if her social media accounts weren’t also riddled with restrictive behaviors and disordered mindsets (many people have pointed out a lot of her problematic behavior in the comments so I don’t state them here).\n\nYou are 100% allowed to find someone’s methods inspirational but it doesn’t change the fact that they are unhealthy and damaging to others.",
          "created_utc": 1607832418.0
        },
        {
          "id": "gfn3jwh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607833336.0
        },
        {
          "id": "gfn4cuc",
          "author": "Sareeee48",
          "body": "I am of the belief that you cannot diet or intentionally lose weight in a healthy way as dieting does not work—this is something that science has been very clear about. Having the desire to change your body is inherently unhealthy. So I will respectfully disagree with you and move on as we will not find a middle ground on this.",
          "created_utc": 1607833659.0
        }
      ]
    },
    {
      "id": "gfn6okn",
      "author": "None",
      "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
      "created_utc": 1607834584.0,
      "score": 2,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        }
      ]
    },
    {
      "id": "gfpfo1i",
      "author": "None",
      "body": "[recent post](https://www.reddit.com/r/Instagramreality/comments/k6ys58/it_is_so_insidious_how_she_preaches_body/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nIt’s tough because you can’t search by name on the sub but here’s a recent one. Other people have noticed things on her IG but she deletes a lot of comments.",
      "created_utc": 1607874256.0,
      "score": 3,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        },
        {
          "id": "gfkequw",
          "author": "tatertotski",
          "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
          "created_utc": 1607799150.0
        },
        {
          "id": "gfkywj6",
          "author": "None",
          "body": "She’s been called out a few times now on r/InstagramReality for shopping. Blurry lines, warped backgrounds and furniture, and then there’s the butt pad incident. She posted some at home workouts where she seems to be wearing some sort of pad or push up undergarment.",
          "created_utc": 1607805659.0
        },
        {
          "id": "gfmzf64",
          "author": "tatertotski",
          "body": "Oh whoa I haven’t seen her posts on that subreddit, going to try to find them now. Thanks!",
          "created_utc": 1607831619.0
        }
      ]
    },
    {
      "id": "gfu2brg",
      "author": "None",
      "body": "I was just going to come here and share the most recent IG reality post and then I realized the source haha!",
      "created_utc": 1607969889.0,
      "score": 1,
      "context": [
        {
          "id": "gfivaii",
          "author": "CelestialWolfMoon",
          "body": "I think one of the things that people really like about her all-in journey is that she recounts how hard it is to gain weight in front of a large audience and to deal with the backlash from it.  She also had to learn to not fear gaining weight so that she could become healthier.  I agree that she most likely had disordered eating and not an ED, so she may not be the “perfect” example of recovery for people with EDs.  However, I don’t think anyone is the “perfect” example of ED recovery for everyone, because we are all different in regards to ours lives and our own experiences with EDs.",
          "created_utc": 1607780104.0
        },
        {
          "id": "gfjdf8c",
          "author": "AlectBeck",
          "body": "Let's be honest, tho. I you follow her IG account, as I did when I was a fan, you would read about how scared she is of the mere idea of gaining some weight back during the holidays (the post was not so long ago!) so I wouldnt say she \"had\" disordered eating. She still has it. She dropped weight so fast when she realized she wasn't dropping it naturally after the six month mark on her All In journey, and she started restricting again AND photoshopping. She's not cured, she's not in a better place, mentally. There problem is not that she's not \"a perfect example\" (and she wanted to be a perfect case of \"all in\", her words, not mine) the problem are the lies and the way she deceives that trick people into thinking that she is a perfect case of recovery.\n\n\\*Edit to add some information. English is not my first language, so I had some grammar mistakes.  \n\n\nEdit 2: Oh my lord! My first award ever. Thank you so much, I never thought I would get one.",
          "created_utc": 1607786769.0
        },
        {
          "id": "gfkequw",
          "author": "tatertotski",
          "body": "How do you know she was/is photoshopping photos?\n\nI agree with everything you said, but this is the first time of me hearing about photoshop, so I’m curious",
          "created_utc": 1607799150.0
        },
        {
          "id": "gfkywj6",
          "author": "None",
          "body": "She’s been called out a few times now on r/InstagramReality for shopping. Blurry lines, warped backgrounds and furniture, and then there’s the butt pad incident. She posted some at home workouts where she seems to be wearing some sort of pad or push up undergarment.",
          "created_utc": 1607805659.0
        },
        {
          "id": "gfmzf64",
          "author": "tatertotski",
          "body": "Oh whoa I haven’t seen her posts on that subreddit, going to try to find them now. Thanks!",
          "created_utc": 1607831619.0
        }
      ]
    },
    {
      "id": "gfjqyy4",
      "author": "DeathWish111",
      "body": "Totally agree. Thanks for this post btw. I cannot believe so many in the ED community look up to her. Also going along with what the point of this post...All In was never supposed to be ED recovery but amenorrhea recovery (which she says she never actually lost her period, it was just irregular).",
      "created_utc": 1607791448.0,
      "score": 5,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfiwa1a",
          "author": "DeathWish111",
          "body": "You really believe she lost 25 pounds unintentionally in less than 5 months?",
          "created_utc": 1607780505.0
        },
        {
          "id": "gfjcocm",
          "author": "roborunner87",
          "body": "This! I don’t understand her hypes. She definitely had some sort of ED when she said she wanted to eat other people’s left over at the table all the time.",
          "created_utc": 1607786498.0
        },
        {
          "id": "gfjio6q",
          "author": "DeathWish111",
          "body": "And how she said her stomach was distended and bloated from being stuffed but she was still thinking about what she wanted to eat next. It's obviously not right for us to diagnose her with an ED, as she has never admitted to having one, but I think saying she absolutely did not have one is bullshit as well.",
          "created_utc": 1607788556.0
        },
        {
          "id": "gfjotwe",
          "author": "Sareeee48",
          "body": "I definitely don’t mean to say she definitely does not have one, more so that she has made a point to say she didn’t... but thinking back to her IG she very well could and I highly doubt she’s not restricting again, especially with her “what I eat in a day” videos, talking about not wanting to gain weight during the holidays, etc.",
          "created_utc": 1607790676.0
        }
      ]
    },
    {
      "id": "gfjcpb1",
      "author": "Sareeee48",
      "body": "I’m pretty sure she herself has made a point to say she cannot speak for those with EDs because she didn’t suffer from one when explaining how her body regulated. Hence my whole post, and the fact that she regulated a lot quicker than many of us did or will in the future. I’m of course she still could have suffered from one, I didn’t believe I was anorexic until I decided to recover.\n\n\nI don’t mind her content in general sense, but specifically recommending her when talking about overshoot, weight redistribution, or fear of “gaining too much” is more harmful than it is helpful, especially when we have a lot of specifically pro recovery accounts already.",
      "created_utc": 1607786508.0,
      "score": 4,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        },
        {
          "id": "gfja4sh",
          "author": "Sareeee48",
          "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
          "created_utc": 1607785600.0
        },
        {
          "id": "gfjbg0n",
          "author": "antipetpeeves",
          "body": "I gotcha. I see what you're saying and that makes sense, but I would caution against making the assumption that someone has an eating disorder or not. I had one go undetected for years because I was dead set on hiding it and acting like nothing was wrong, and I never developed close friendships for a period of time because I was too busy with my eating and exercise routines. But on the outside, people didn't see this. I know because I opened up to an old friend who I have gotten much closer with now that I am in a better place, and she said she never knew I was dealing with it back then.",
          "created_utc": 1607786065.0
        }
      ]
    },
    {
      "id": "gfn8ktd",
      "author": "Sareeee48",
      "body": "Hey thanks! 🤍",
      "created_utc": 1607835354.0,
      "score": 3,
      "context": [
        {
          "id": "gfmsvc3",
          "author": "coffeesoakedpickles",
          "body": "Im actually watching one of her videos as i write this lol\n\nanyway, i think its one of those things where it just completely depends on the person- on your history, your relationship with exercise/dieting, and what you picture your recovery to be.\n\nI'm definitely not fully recovered and i still see a lot of disordered thoughts/activities in my life that I'm trying to try to work on (because I'm not there yet). she has a target audience, and for a lot of people in the ed community that's just not them. while she definitely  didn't struggle with a full-blown eating disorder, she still felt many of the physical and psychological symptoms of a restrictive eating disorder, and i think that's what resonates with many people.\n\ni like exercise- i like running, i like wrestling, i like feeling strong. stopping that completely for the sake of recovery felt like a bigger mental burden on me than trying to continue exercising, but shifting my focus from burning calories to just feeling strong and healthy and happy. I think, for me personally, her videos helped a lot with understanding that fitness is absolutely **not** all or nothing, and you can eat intuitively and 'all in' and still be strong and work out. and working out also isn't a thing you have to do to change your body, you know?  i also just like watching her for the sake of her positive and supportive energy regarding openness with food and intuition around it. again, this is just me and my mindset on my point in my journey, right now.\n\nidk, its completely valid to not watch her if her story is something that triggers you, but many people definitely do find solace in her story, to some degree.\n\nedit to say that i don't think she should be used as the posterchild for recovery, because her recovery from xtreme hunger does not depict traditional ed recovery. Just that her videos still helped a lot of people, including those in ed recovery.",
          "created_utc": 1607828094.0
        },
        {
          "id": "gfn1bzr",
          "author": "Sareeee48",
          "body": "I would agree if her social media accounts weren’t also riddled with restrictive behaviors and disordered mindsets (many people have pointed out a lot of her problematic behavior in the comments so I don’t state them here).\n\nYou are 100% allowed to find someone’s methods inspirational but it doesn’t change the fact that they are unhealthy and damaging to others.",
          "created_utc": 1607832418.0
        },
        {
          "id": "gfn3jwh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607833336.0
        },
        {
          "id": "gfn4cuc",
          "author": "Sareeee48",
          "body": "I am of the belief that you cannot diet or intentionally lose weight in a healthy way as dieting does not work—this is something that science has been very clear about. Having the desire to change your body is inherently unhealthy. So I will respectfully disagree with you and move on as we will not find a middle ground on this.",
          "created_utc": 1607833659.0
        },
        {
          "id": "gfn6te4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1607834637.0
        }
      ]
    },
    {
      "id": "gfn8e1q",
      "author": "Sareeee48",
      "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
      "created_utc": 1607835276.0,
      "score": 11,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        }
      ]
    },
    {
      "id": "gfjdz11",
      "author": "antipetpeeves",
      "body": "That makes sense. Yeah the worse you are the harder recovery is. Everyone is walking their own path and seeing stuff like that can be triggering for people with eating disorders since there's a lot of competition aspects to it.",
      "created_utc": 1607786958.0,
      "score": 4,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        },
        {
          "id": "gfja4sh",
          "author": "Sareeee48",
          "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
          "created_utc": 1607785600.0
        },
        {
          "id": "gfjbg0n",
          "author": "antipetpeeves",
          "body": "I gotcha. I see what you're saying and that makes sense, but I would caution against making the assumption that someone has an eating disorder or not. I had one go undetected for years because I was dead set on hiding it and acting like nothing was wrong, and I never developed close friendships for a period of time because I was too busy with my eating and exercise routines. But on the outside, people didn't see this. I know because I opened up to an old friend who I have gotten much closer with now that I am in a better place, and she said she never knew I was dealing with it back then.",
          "created_utc": 1607786065.0
        },
        {
          "id": "gfjcpb1",
          "author": "Sareeee48",
          "body": "I’m pretty sure she herself has made a point to say she cannot speak for those with EDs because she didn’t suffer from one when explaining how her body regulated. Hence my whole post, and the fact that she regulated a lot quicker than many of us did or will in the future. I’m of course she still could have suffered from one, I didn’t believe I was anorexic until I decided to recover.\n\n\nI don’t mind her content in general sense, but specifically recommending her when talking about overshoot, weight redistribution, or fear of “gaining too much” is more harmful than it is helpful, especially when we have a lot of specifically pro recovery accounts already.",
          "created_utc": 1607786508.0
        }
      ]
    },
    {
      "id": "gfn96lj",
      "author": "None",
      "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
      "created_utc": 1607835602.0,
      "score": 3,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        }
      ]
    },
    {
      "id": "gfjpd8i",
      "author": "Sareeee48",
      "body": "I edited the post because tbh you’re right. She can say a lot of things but they don’t necessarily make it true... she could very well have an ED and it isn’t fair for me to say she doesn’t.",
      "created_utc": 1607790892.0,
      "score": 5,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        },
        {
          "id": "gfja4sh",
          "author": "Sareeee48",
          "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
          "created_utc": 1607785600.0
        },
        {
          "id": "gfjbg0n",
          "author": "antipetpeeves",
          "body": "I gotcha. I see what you're saying and that makes sense, but I would caution against making the assumption that someone has an eating disorder or not. I had one go undetected for years because I was dead set on hiding it and acting like nothing was wrong, and I never developed close friendships for a period of time because I was too busy with my eating and exercise routines. But on the outside, people didn't see this. I know because I opened up to an old friend who I have gotten much closer with now that I am in a better place, and she said she never knew I was dealing with it back then.",
          "created_utc": 1607786065.0
        },
        {
          "id": "gfjcpb1",
          "author": "Sareeee48",
          "body": "I’m pretty sure she herself has made a point to say she cannot speak for those with EDs because she didn’t suffer from one when explaining how her body regulated. Hence my whole post, and the fact that she regulated a lot quicker than many of us did or will in the future. I’m of course she still could have suffered from one, I didn’t believe I was anorexic until I decided to recover.\n\n\nI don’t mind her content in general sense, but specifically recommending her when talking about overshoot, weight redistribution, or fear of “gaining too much” is more harmful than it is helpful, especially when we have a lot of specifically pro recovery accounts already.",
          "created_utc": 1607786508.0
        },
        {
          "id": "gfjdz11",
          "author": "antipetpeeves",
          "body": "That makes sense. Yeah the worse you are the harder recovery is. Everyone is walking their own path and seeing stuff like that can be triggering for people with eating disorders since there's a lot of competition aspects to it.",
          "created_utc": 1607786958.0
        }
      ]
    },
    {
      "id": "gfnbedu",
      "author": "Sareeee48",
      "body": "Almost everything you said is virtually false. Running also does not build muscle, and fun fact, you burn the same amount of calories running as you so walking; walking, like running, is primarily a cardiovascular exercise and is excellent for the heart alone. There is no “baseline,” and you do not need to build muscle to be healthy, that’s such a misinformed statement.\n\n“You’d be better for it if you push yourself,” how do you know that? Do you know the health of others’ just by their exercise routine? No, you don’t. I was at my unhealthiest exercising regularly. I am at my healthiest now, and I haven’t worked out at all since March save for a month in August.\n\nOnce again, nobody owes you their health. You don’t have to do traditional exercise to remain healthy, and even if you did you STILL a don’t have to exercise because you don’t owe anyone your health. Exercising can absolutely be a healthy outlet, but you. Do. Not. Need. To. Exercise. Traditionally. To. Be. Healthy. Point blank, period. I am not continuing this conversation anymore.",
      "created_utc": 1607836513.0,
      "score": 8,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        },
        {
          "id": "gfn96lj",
          "author": "None",
          "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
          "created_utc": 1607835602.0
        }
      ]
    },
    {
      "id": "gfl4t5v",
      "author": "antipetpeeves",
      "body": "hey that's awesome self-awareness! thanks for this.",
      "created_utc": 1607807609.0,
      "score": 4,
      "context": [
        {
          "id": "gfis6ri",
          "author": "None",
          "body": "I really do like her. she introduced me to the idea of all in recovery. no, some people with eds can't emulate her completely because she still exercises but its never obsessive or disordered exercise is just her passion and hobby.\n\nshe has never had an ed but I still think her videos are useful for some people in ed recovery.\n\nand yes, she does talk about the fact that she has lost weight as part of her all in journey, but she's made it clear it isn't intentional and just a result of her decreased appetite and normalised hunger cues.\n\nI like her videos because she talks about all the horrible and uncomfortable things about refeeding such as bloating, weight gain and low self esteem. but she also makes clear that all these things don't last forever and eventually you will come out the other end a healthier, happier person.\n\n\nshe can't be expected to be the perfect template for ed sufferers because she *isnt* an ed sufferer. but her content is still valuable for a lot of people, including me.",
          "created_utc": 1607778529.0
        },
        {
          "id": "gfit0qq",
          "author": "Sareeee48",
          "body": "But the fact still remains that she DID NOT have an ED. When talking about overshoot I *always* see someone recommending her videos because she lost that weight (never said it wasn’t natural, but she still lost that weight and it is a talking point people cling to), but many people in ED recovery just don’t lose that weight, let alone within the first year. If she wasn’t thin and muscular (I say and because I feel like the two words have become one entity to many people), her story wouldn’t be as impactful as it was to so many in the ED community.\n\nI don’t have a problem with her content, I actually enjoy how she explains the science behind it all, but we use her as an example of how we hope we look in and after recover and it’s not healthy.",
          "created_utc": 1607778911.0
        },
        {
          "id": "gfj76ro",
          "author": "antipetpeeves",
          "body": "Can you elaborate on what you see as the divide between ED and disordered eating?",
          "created_utc": 1607784553.0
        },
        {
          "id": "gfja4sh",
          "author": "Sareeee48",
          "body": "Disordered eating is just not normal eating but it doesn’t effect how you function *too* much, or to the extent an eating disorder does. You don’t have a healthy relationship with food, but you can still function in your normal day to day life; people who diet can still go to and keep their job, attend social events and maintain relationships. An eating disorder has prevented me from doing any of these things because it’s something I HAVE to do above anything else in my life or something terrible will happen if I don’t (i.e., I’ll become unhealthy/fat/I’ll die/whatever else.",
          "created_utc": 1607785600.0
        },
        {
          "id": "gfjbg0n",
          "author": "antipetpeeves",
          "body": "I gotcha. I see what you're saying and that makes sense, but I would caution against making the assumption that someone has an eating disorder or not. I had one go undetected for years because I was dead set on hiding it and acting like nothing was wrong, and I never developed close friendships for a period of time because I was too busy with my eating and exercise routines. But on the outside, people didn't see this. I know because I opened up to an old friend who I have gotten much closer with now that I am in a better place, and she said she never knew I was dealing with it back then.",
          "created_utc": 1607786065.0
        },
        {
          "id": "gfjcpb1",
          "author": "Sareeee48",
          "body": "I’m pretty sure she herself has made a point to say she cannot speak for those with EDs because she didn’t suffer from one when explaining how her body regulated. Hence my whole post, and the fact that she regulated a lot quicker than many of us did or will in the future. I’m of course she still could have suffered from one, I didn’t believe I was anorexic until I decided to recover.\n\n\nI don’t mind her content in general sense, but specifically recommending her when talking about overshoot, weight redistribution, or fear of “gaining too much” is more harmful than it is helpful, especially when we have a lot of specifically pro recovery accounts already.",
          "created_utc": 1607786508.0
        },
        {
          "id": "gfjdz11",
          "author": "antipetpeeves",
          "body": "That makes sense. Yeah the worse you are the harder recovery is. Everyone is walking their own path and seeing stuff like that can be triggering for people with eating disorders since there's a lot of competition aspects to it.",
          "created_utc": 1607786958.0
        },
        {
          "id": "gfjpd8i",
          "author": "Sareeee48",
          "body": "I edited the post because tbh you’re right. She can say a lot of things but they don’t necessarily make it true... she could very well have an ED and it isn’t fair for me to say she doesn’t.",
          "created_utc": 1607790892.0
        }
      ]
    },
    {
      "id": "guoqwue",
      "author": "tkdaw",
      "body": "I agree with this except my physics PhD brain wants to edit that you do burn somewhat more calories running than walking just because there's more vertical motion in running which requires energy expenditure \n\nI say this not to say \"RUN BECAUSE IT BURNS MORE CALS\" but because runners are notorious for not recognizing how intensive exercise running is and not fueling properly because of it so I feel the need to do PSAs before more runners end up with deficit induced injuries",
      "created_utc": 1618545347.0,
      "score": 3,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        },
        {
          "id": "gfn96lj",
          "author": "None",
          "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
          "created_utc": 1607835602.0
        },
        {
          "id": "gfnbedu",
          "author": "Sareeee48",
          "body": "Almost everything you said is virtually false. Running also does not build muscle, and fun fact, you burn the same amount of calories running as you so walking; walking, like running, is primarily a cardiovascular exercise and is excellent for the heart alone. There is no “baseline,” and you do not need to build muscle to be healthy, that’s such a misinformed statement.\n\n“You’d be better for it if you push yourself,” how do you know that? Do you know the health of others’ just by their exercise routine? No, you don’t. I was at my unhealthiest exercising regularly. I am at my healthiest now, and I haven’t worked out at all since March save for a month in August.\n\nOnce again, nobody owes you their health. You don’t have to do traditional exercise to remain healthy, and even if you did you STILL a don’t have to exercise because you don’t owe anyone your health. Exercising can absolutely be a healthy outlet, but you. Do. Not. Need. To. Exercise. Traditionally. To. Be. Healthy. Point blank, period. I am not continuing this conversation anymore.",
          "created_utc": 1607836513.0
        }
      ]
    },
    {
      "id": "gfne1v6",
      "author": "None",
      "body": "When I was referring to building muscle, that was in reference to my mention of strength training. You're not going to have much of anything in terms of muscle if you just walk, you need some strength training for that. I don't claim that cardio builds any substantial muscle, except for intense climbs and sprints on a bike or something similar. Without strength training, it is very easy to get an overly high bodyfat percentage even at a normal weight. This is unhealthy by itself. There is plenty of people who fall into the healthy bmi range who still have an excess of bodyfat. \n\nRunning and cycling were related to cardiovascular health gains. Your overall stamina and endurance will never ever get any better without doing more vigorous cardio than walking. Do you think you will be at your best cardio capacity for running or cycling by just walking or would you assume you would need further hard work to achieve better conditioning to hit your peak? Answer is self explanatory. Harder cardio offers more cardiovascular health benefits than walking. Walking barely increases heart rate as it is. \n\nI don't think anyone owes me their health, they owe it to themselves. I'm just stating that there is a lot left on the table if you quit your fitness journey at taking walks. \n\nI won't address much on your statement that the unhealthiest version of you was the one that exercised the most. We both know why that was. \n\nCheers I suppose? You didn't really give a good answer as to why just walking will do it all. If it was, no one would be lifting weights and doing harder cardio. Pushing yourself above walking is the right direction. Obviously there is something to gain from the harder stuff in regards to both health and overall fitness.",
      "created_utc": 1607837668.0,
      "score": 1,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        },
        {
          "id": "gfn96lj",
          "author": "None",
          "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
          "created_utc": 1607835602.0
        },
        {
          "id": "gfnbedu",
          "author": "Sareeee48",
          "body": "Almost everything you said is virtually false. Running also does not build muscle, and fun fact, you burn the same amount of calories running as you so walking; walking, like running, is primarily a cardiovascular exercise and is excellent for the heart alone. There is no “baseline,” and you do not need to build muscle to be healthy, that’s such a misinformed statement.\n\n“You’d be better for it if you push yourself,” how do you know that? Do you know the health of others’ just by their exercise routine? No, you don’t. I was at my unhealthiest exercising regularly. I am at my healthiest now, and I haven’t worked out at all since March save for a month in August.\n\nOnce again, nobody owes you their health. You don’t have to do traditional exercise to remain healthy, and even if you did you STILL a don’t have to exercise because you don’t owe anyone your health. Exercising can absolutely be a healthy outlet, but you. Do. Not. Need. To. Exercise. Traditionally. To. Be. Healthy. Point blank, period. I am not continuing this conversation anymore.",
          "created_utc": 1607836513.0
        }
      ]
    },
    {
      "id": "guqh2mz",
      "author": "Sareeee48",
      "body": "I mean, I went to school for kinesiology and I just disagree. Running and walking may not burn the same calories, per se, but they burn approximately the same amount per mile. You tend to burn more running overall because you don’t typically walk 5-10 miles, those are running distances.",
      "created_utc": 1618587350.0,
      "score": 1,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        },
        {
          "id": "gfn96lj",
          "author": "None",
          "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
          "created_utc": 1607835602.0
        },
        {
          "id": "gfnbedu",
          "author": "Sareeee48",
          "body": "Almost everything you said is virtually false. Running also does not build muscle, and fun fact, you burn the same amount of calories running as you so walking; walking, like running, is primarily a cardiovascular exercise and is excellent for the heart alone. There is no “baseline,” and you do not need to build muscle to be healthy, that’s such a misinformed statement.\n\n“You’d be better for it if you push yourself,” how do you know that? Do you know the health of others’ just by their exercise routine? No, you don’t. I was at my unhealthiest exercising regularly. I am at my healthiest now, and I haven’t worked out at all since March save for a month in August.\n\nOnce again, nobody owes you their health. You don’t have to do traditional exercise to remain healthy, and even if you did you STILL a don’t have to exercise because you don’t owe anyone your health. Exercising can absolutely be a healthy outlet, but you. Do. Not. Need. To. Exercise. Traditionally. To. Be. Healthy. Point blank, period. I am not continuing this conversation anymore.",
          "created_utc": 1607836513.0
        },
        {
          "id": "guoqwue",
          "author": "tkdaw",
          "body": "I agree with this except my physics PhD brain wants to edit that you do burn somewhat more calories running than walking just because there's more vertical motion in running which requires energy expenditure \n\nI say this not to say \"RUN BECAUSE IT BURNS MORE CALS\" but because runners are notorious for not recognizing how intensive exercise running is and not fueling properly because of it so I feel the need to do PSAs before more runners end up with deficit induced injuries",
          "created_utc": 1618545347.0
        }
      ]
    },
    {
      "id": "gfotc2u",
      "author": "Sareeee48",
      "body": "Again, no they don’t. Health is not dependent on exercise, your entire argument is based on fatphobic ideologies and therefore mute. Your mention of excess body fat is, in itself, fatphobic. I don’t think you truly understand how fat mass to fat free mass works, especially considering the body makes it’s own muscle mass even in recovery from an eating disorder where the individual is most often refrained from traditional exercise (which is exactly why the tapering of overshoot and weight redistribution occur). My body fat is currently high due to recovery, but my doctor said I am healthy, for example. That is NOT a concern to them. Are you going to argue that because I don’t lift weight or do cardio and therefore must be unhealthy? That I “owe it to myself” to be healthier than I am now, despite currently having no desire to exercise yet? You can’t, because you do not know me, nor my body, nor *anyone else’s* body. Body fat does not equal health. Fat people exist whether or not we all eat and exercise the same (fat people can be and are absolutely be healthy too). Maybe follow fat positive people on social media, including those who exercise for enjoyment rather than an obligation to their health—which is *exactly* what leads to so many eating disorders—and be better.",
      "created_utc": 1607864143.0,
      "score": 7,
      "context": [
        {
          "id": "gflouf6",
          "author": "None",
          "body": "Recovering doesn't mean quitting exercise or losing all your muscle. You can't just quit exercising for the rest of your life because you went through an ED.",
          "created_utc": 1607814149.0
        },
        {
          "id": "gflrory",
          "author": "Sareeee48",
          "body": "I.... don’t see where I said any of that, but okay. \n\nWe have to stop exercising at least for a couple months (in terms of lifting/intense running/ etc.) because our bodies need to heal. I literally couldn’t get out of bed for more than a few hours the first few weeks, let alone exercise. I like working out, but I understood that I had to give it up for awhile and restructure my relationship with movement so it’s enjoyable, not compulsive and compensatory. Stephanie literally took like a week or two off because she got sick, but she never 100% gave up exercise to allow her body to heal properly.\n\nI’m also going to be *that* person and say that yes, you absolutely *can* quit exercising in the traditional sense for the rest of your life if you choose to. Going to the gym or running is not a necessity and it is absolutely valid to choose not to exercise because you had an ED.",
          "created_utc": 1607814936.0
        },
        {
          "id": "gfltcmx",
          "author": "None",
          "body": "I misunderstood you, it came off as a forever thing. I guess it depends on how damaged you are from it, some people probably could do okay with a couple week break. (Official ED Diagnosis only requires certain habits and thoughts for about 3 months, and some people won't have restricted to 300 calories a day or something like that.)\n\nI don't think it's a good idea to quit exercising forever.  The point of recovery is to regain your health, you won't ever be as healthy as you can without exercise. Strength training and a bit of cardio are crucial to building a strong body, which should really be a goal after you're recovered. I don't think it's good for almost anyone on the planet to just never exercise. \n\nI should go for a walk speaking of that. Anyway, sorry for the initial misunderstanding there. I didn't realize you meant a temporary break. I never really quit cycling during my regain, and averaged about 75 miles a week during it all. Although my disordered eating (struggle to really call it an ED) was not as extensive as others. I felt awful, but wasn't like 15 BMI or restricting to super low calorie figures.",
          "created_utc": 1607815414.0
        },
        {
          "id": "gfmb43r",
          "author": "Sareeee48",
          "body": "Fair enough, I can see how the post could lead to that assumption.\n\nThat said, I’m absolutely going to have to respectfully disagree with you on exercising. Traditional exercise is *not* the only form of physical activity and people are perfectly healthy just running errands or doing chores around the house. My sister doesn’t “exercise” but she’s healthy. People don’t understand that you’re still burning calories by simply walking around the grocery store, from your apartment/house, between classes, etc. As a very active person who enjoys lifting, physical activity does not only mean going to the gym or running miles and we as a society really need to stop telling people it is and attributing to our unhealthy relationship with our bodies.",
          "created_utc": 1607820812.0
        },
        {
          "id": "gfn6okn",
          "author": "None",
          "body": "Running errands, walking, and doing chores don't contribute to building actual muscle mass. Nor to improving cardiovascular health. People would be leaving out some important parts of building a healthy body by not doing any real exercise. \n\nThere is a reason why it's only considered exercise once your heart rate is elevated considerably.\n\n(I respect your opinion, just giving an alternate view. Never hurts to hear the other side.)",
          "created_utc": 1607834584.0
        },
        {
          "id": "gfn8e1q",
          "author": "Sareeee48",
          "body": "Um... what???? Walking is ***absolutely*** a form of exercise and one that is often recommended and to and ideal for others—are you assuming that walking around doing chores and running errands does not work muscles because you’re not at a gym? Again, plenty of people who do not exercise in the traditional sense are perfectly health. And even if they weren’t, nobody owes you or anyone else their health. Health is a privilege and not everyone is privileged enough to be able exercise.",
          "created_utc": 1607835276.0
        },
        {
          "id": "gfn96lj",
          "author": "None",
          "body": "Sure it uses muscles, but it doesn't work them above a regular baseline level at all. Walk 4 miles or 50 miles, you won't get any extra cardio or muscle growth benefit from it.\n\nEveryone is better off building some muscle and indulging in all aspects of health, and this includes muscle and cardiovascular health gains, of which walking will not provide anymore of if you already walk around 10k steps a day. Walk all you want, you can't get the benefits that doing a hard cardio like cycling or running will bring. Walk all you want, you can't build the leg muscle that actual strength training will. \n\nYes everyone should do plenty of walking, but they really shouldn't JUST do walking unless that's all they are capable of. You can be healthy just walking, but you'll be better for it if you push yourself to do more than that.",
          "created_utc": 1607835602.0
        },
        {
          "id": "gfnbedu",
          "author": "Sareeee48",
          "body": "Almost everything you said is virtually false. Running also does not build muscle, and fun fact, you burn the same amount of calories running as you so walking; walking, like running, is primarily a cardiovascular exercise and is excellent for the heart alone. There is no “baseline,” and you do not need to build muscle to be healthy, that’s such a misinformed statement.\n\n“You’d be better for it if you push yourself,” how do you know that? Do you know the health of others’ just by their exercise routine? No, you don’t. I was at my unhealthiest exercising regularly. I am at my healthiest now, and I haven’t worked out at all since March save for a month in August.\n\nOnce again, nobody owes you their health. You don’t have to do traditional exercise to remain healthy, and even if you did you STILL a don’t have to exercise because you don’t owe anyone your health. Exercising can absolutely be a healthy outlet, but you. Do. Not. Need. To. Exercise. Traditionally. To. Be. Healthy. Point blank, period. I am not continuing this conversation anymore.",
          "created_utc": 1607836513.0
        },
        {
          "id": "gfne1v6",
          "author": "None",
          "body": "When I was referring to building muscle, that was in reference to my mention of strength training. You're not going to have much of anything in terms of muscle if you just walk, you need some strength training for that. I don't claim that cardio builds any substantial muscle, except for intense climbs and sprints on a bike or something similar. Without strength training, it is very easy to get an overly high bodyfat percentage even at a normal weight. This is unhealthy by itself. There is plenty of people who fall into the healthy bmi range who still have an excess of bodyfat. \n\nRunning and cycling were related to cardiovascular health gains. Your overall stamina and endurance will never ever get any better without doing more vigorous cardio than walking. Do you think you will be at your best cardio capacity for running or cycling by just walking or would you assume you would need further hard work to achieve better conditioning to hit your peak? Answer is self explanatory. Harder cardio offers more cardiovascular health benefits than walking. Walking barely increases heart rate as it is. \n\nI don't think anyone owes me their health, they owe it to themselves. I'm just stating that there is a lot left on the table if you quit your fitness journey at taking walks. \n\nI won't address much on your statement that the unhealthiest version of you was the one that exercised the most. We both know why that was. \n\nCheers I suppose? You didn't really give a good answer as to why just walking will do it all. If it was, no one would be lifting weights and doing harder cardio. Pushing yourself above walking is the right direction. Obviously there is something to gain from the harder stuff in regards to both health and overall fitness.",
          "created_utc": 1607837668.0
        }
      ]
    }
  ]
}