{
  "id": "kdpgts",
  "subreddit": "fuckeatingdisorders",
  "author": "edsarebs",
  "created_utc": 1608051530.0,
  "title": "I just had two spoons of peanut butter and then stopped.",
  "selftext": "Before I started recovery, if I opened a jar of peanut butter I couldn't stop eating it until I was sick. I think I was just so hungry and my body was so deprived that when actual calories were available, I lost all self control.\n\nWell I've been making an effort to eat more consistently and well. My mom opened a new kind of peanut butter so I had a spoonful to try it. Then I had another because it was good. And that was it. I have no desire to even have more. I am finally satisfied with just one serving of a food a like. And counterintuitively it's all because I've been eating more. I was so concerned that recovery would lead to binges, but turns out the opposite happened instead :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kdpgts/i_just_had_two_spoons_of_peanut_butter_and_then/",
  "score": 166,
  "num_comments": 7,
  "comments": [
    {
      "id": "gfy4pfe",
      "author": "heybadanamu",
      "body": "This is such a big win! Honestly, I can’t stand peanut butter now (after having 3 jars in one night because it is such a stereotypical ED fear food). Keep breaking down those food rules and fear foods and eat on!",
      "created_utc": 1608058004.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gfyi03g",
      "author": "BluePurslane",
      "body": "Fist bump!  I had one piece of cheesecake on Thanksgiving.  Just one!",
      "created_utc": 1608063894.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gfy8cec",
      "author": "Emotional-Scene-477",
      "body": "yay!!!",
      "created_utc": 1608059618.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gg0ti8u",
      "author": "None",
      "body": ">And counterintuitively it's all because I've been eating more. \n\nit's not counter intuitively, it's by design. ;) congrats!",
      "created_utc": 1608118627.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gfz9lhq",
      "author": "Limp-Specific-8630",
      "body": "Wow this makes me so happy to hear! How long did it take for you to get to this point?",
      "created_utc": 1608077653.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfzmljy",
      "author": "2Mosey",
      "body": "Legend",
      "created_utc": 1608084878.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gfzss42",
      "author": "edsarebs",
      "body": "Thank you! I would say about two months, but there have been a lot of setbacks and I'm definitely not all the way there yet. I've made progress but I'm honestly not sure that I would be able to do the same thing tomorrow or the day after",
      "created_utc": 1608088363.0,
      "score": 10,
      "context": [
        {
          "id": "gfz9lhq",
          "author": "Limp-Specific-8630",
          "body": "Wow this makes me so happy to hear! How long did it take for you to get to this point?",
          "created_utc": 1608077653.0
        }
      ]
    }
  ]
}