{
  "id": "ke7diz",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1608117228.0,
  "title": "I've never felt healthier or happier in my body, and this is the highest weight I've been in over a decade",
  "selftext": "I'm writing this post to celebrate something that has surprised me, and made me feel so proud. I realised, recently, that my body looked different. And that, in fact, *I loved it.*\n\nI'm the heaviest I've been since before I went through a period of extreme restrictive eating in my teens (that left me with a decade, I can see now, of messed up attitude despite being outwardly healthy appearing). It's just a few lbs rn past the number on the scale I would never 'let' myself go before, but it's a really big deal for me.\n\nI value this, here, more than keeping my weight at or below a certain number (which I held myself to for *years* to be 'worthy'. No, no - this is SO much better!).\n\nBeing very slim in my twenties was part of my identity, and it was encouraged by family. I was praised for being very slender, and how I looked in clothes. I never felt sexy or womanly. Ever. But I was stuck in this 'how I should look' mode. I wasn't meant to be sexy, I was meant to be slender, graceful, petite, small... all the things people would comment on.\n\nPlus, the fact that my mother always valued thinness didn't help (she grew up overweight in a time when extreme skinniness was the 'thing'. My frame was enviable to her, despite that fact it was an underweight BMI). Of course - it's *my* responsibility 100% - but I've only JUST started listening to myself in all aspects of my life, after all these years. If I complained about feeling 'fat', it was 'you don't look it, but why don't we eat like this for a while/ you do this?'. it helped to normalise my mindset.\n\nThis year, I started being more relaxed with my diet. I didn't realise the extend to which my 'healthy' habits were keeping me in an unhealthy frame of mind. (I still eat healthy, but I won't go into detail some of the ridiculous self imposed 'rules' I had to follow). I'm exercising still, but sometimes very gently, sometimes fiercely. And *always* to feel good - not to manipulate my body.\n\nAnd this, here, is me at my highest weight in a long time. In over a decade. This is me looking at my body, and realising that I like this shape more than when I was very skinny (actually, I never felt comfortable in it then, it was just something I felt compelled to be). I feel attractive. I feel sexy, even.\n\nAnd guess what? My hair is thicker, healthier. I'm not entirely sure what my hormones have been doing this month - but I have a feeling that this is what I'm *supposed* to feel like (fat affects estrogen levels, so I'm thinking it's to do with that?).\n\nSo I'm writing this to celebrate. I'm listening to myself instead of placing control on other people ( I mean: thinking I had to be a certain way because other people could only see me as having value if I was that, and not because I valued *me...* There's a lot more to hitting this realisation but I won't write another essay here).\n\nI'm finding freedom in my habits, my body and life. And I feel amazing.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ke7diz/ive_never_felt_healthier_or_happier_in_my_body/",
  "score": 162,
  "num_comments": 16,
  "comments": [
    {
      "id": "gg0xptj",
      "author": "Yoshilover644",
      "body": "Thank you so much for sharing this. I relate to a majority of what you said. It was very helpful for me to read - it gave me a better perspective of things as I’m struggling right now but wanting so badly to improve",
      "created_utc": 1608122518.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gg14901",
      "author": "ashlizlee",
      "body": "Congratulations! I’m so happy for you. Growing up with a parent encouraging you to be thin is so damaging. My ED was heavily influenced by my mom because she’s been overweight most of her life and started telling me at too young an age that certain outfits “look good now, but would be stunning if you lost just 5 lbs.” She never meant it to be harmful, but that mentality stayed with me for a long time and I developed similar ridiculous habits that you describe to try to stay in control. You are an inspiration and I applaud you for listening to yourself and your body and finding joy.",
      "created_utc": 1608127174.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gg1v922",
      "author": "913xrose",
      "body": "I love this so much! I tend to cling to the thought that I \"have\" to stay a certain weight as well because everyone around me growing up placed so much value on my thin body, but I was still a teenager and not yet in the body I was meant to be in. I'm so glad that I'm not alone in that, and I hope that I can work towards becoming like you and embracing who I am without caring about what other people think. Congrats on your new mindset!! :)",
      "created_utc": 1608141073.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gg1yp8t",
      "author": "None",
      "body": "im so proud of you OP! thats honestly so incredible and inspiring and im so haply for you. \n\nim almost a year into recovery now, and ive recently hit what i have long deemed to be a wholly unacceptable weight. it feels slightly crushing i cant lie, but this post makes me think that maybe in time, i can be okay with my body for being fleshy. \n\ni looked awkward when i was rather underweight. i liked it but it objectively wasnt my best look",
      "created_utc": 1608142710.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gg1jzc9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1608135665.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gg1nupp",
      "author": "OMGIzAGril",
      "body": "This post gives me so much hope. <3 Thank you!",
      "created_utc": 1608137547.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gg1cgma",
      "author": "bitch_interrupted",
      "body": "So so proud of you! Thank you for sharing this ❤",
      "created_utc": 1608131871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gg29erm",
      "author": "toienojao",
      "body": ">thinking I had to be a certain way because other people could only see me as having value if I was that, and not because I valued me...\n\nthis. I'm having such a hard time changing my mindset for my recovery, and this is something I have to internalize. I *know* it is true, but I can't seem to *believe*it. thank you for sharing this, it helps",
      "created_utc": 1608147672.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gg1jxlc",
      "author": "None",
      "body": "Thank you! I'm so glad sharing this could be helpful for someone else <3 <3",
      "created_utc": 1608135640.0,
      "score": 5,
      "context": [
        {
          "id": "gg0xptj",
          "author": "Yoshilover644",
          "body": "Thank you so much for sharing this. I relate to a majority of what you said. It was very helpful for me to read - it gave me a better perspective of things as I’m struggling right now but wanting so badly to improve",
          "created_utc": 1608122518.0
        }
      ]
    },
    {
      "id": "gg1jqqk",
      "author": "None",
      "body": "Oh, I so relate to this! My mother is wonderful, but the influence can really warp your mindset.   \n\n\nAnd thank you so much <3 <3",
      "created_utc": 1608135548.0,
      "score": 3,
      "context": [
        {
          "id": "gg14901",
          "author": "ashlizlee",
          "body": "Congratulations! I’m so happy for you. Growing up with a parent encouraging you to be thin is so damaging. My ED was heavily influenced by my mom because she’s been overweight most of her life and started telling me at too young an age that certain outfits “look good now, but would be stunning if you lost just 5 lbs.” She never meant it to be harmful, but that mentality stayed with me for a long time and I developed similar ridiculous habits that you describe to try to stay in control. You are an inspiration and I applaud you for listening to yourself and your body and finding joy.",
          "created_utc": 1608127174.0
        }
      ]
    },
    {
      "id": "gg2mag1",
      "author": "None",
      "body": "Oof yes, that feeling. I actually read an article the other day on perfectionism, and how it causes us to exist fragmented in other peoples minds, consumed by what they think and whether its good enough, versus just us focusing on our own ability to be good. \n\nIt kind of reminds me of this. I know it's fed to us by other people, but by seeing it for what it is, we have so much power. When you stop existing in this fragmented place, you suddenly see how much damage it was causing you, and you can focus on being an amazing, different version of yourself. \n\nANYWAY! It's late and I'm probably not explaining that like I mean to! Good luck!! <3",
      "created_utc": 1608153728.0,
      "score": 3,
      "context": [
        {
          "id": "gg1v922",
          "author": "913xrose",
          "body": "I love this so much! I tend to cling to the thought that I \"have\" to stay a certain weight as well because everyone around me growing up placed so much value on my thin body, but I was still a teenager and not yet in the body I was meant to be in. I'm so glad that I'm not alone in that, and I hope that I can work towards becoming like you and embracing who I am without caring about what other people think. Congrats on your new mindset!! :)",
          "created_utc": 1608141073.0
        }
      ]
    },
    {
      "id": "gg2nr0i",
      "author": "None",
      "body": "Thank you!! <3 <3 \n\nOne thing I've learned is how much the language we use affects how we feel. It's kind of funny, but it was actually from r/kibbe that I realised this (if you're not familiar, it's about dressing for your body type, based on yin/yang principles and things like that). But while all 'types' are meant to be equal, a lot of people show resistance to their 'type' because of the language used to describe them... and 'fleshy' is one of them. If you swap out that word for another descriptor, you suddenly see it in a whole new, romantic, beautiful light.\n\nI don't know if this is getting my point across - or is even helpful at all! - but basically I try to apply the principle that the words we use to describe ourselves to ourselves have a big impact. It was quite eye opening to see when I became a part of the r/ community.\n\nAnyway, again, that might not be helpful. But! Sending you love on your journey!",
      "created_utc": 1608154427.0,
      "score": 2,
      "context": [
        {
          "id": "gg1yp8t",
          "author": "None",
          "body": "im so proud of you OP! thats honestly so incredible and inspiring and im so haply for you. \n\nim almost a year into recovery now, and ive recently hit what i have long deemed to be a wholly unacceptable weight. it feels slightly crushing i cant lie, but this post makes me think that maybe in time, i can be okay with my body for being fleshy. \n\ni looked awkward when i was rather underweight. i liked it but it objectively wasnt my best look",
          "created_utc": 1608142710.0
        }
      ]
    },
    {
      "id": "gg2l7hu",
      "author": "None",
      "body": "<3 Thank you!! That's so lovely of you to say",
      "created_utc": 1608153211.0,
      "score": 1,
      "context": [
        {
          "id": "gg1jzc9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1608135665.0
        }
      ]
    },
    {
      "id": "gg2lgbs",
      "author": "None",
      "body": "I am so glad to hear this! Feeling so good in your body is absolutely possible <3 <3",
      "created_utc": 1608153331.0,
      "score": 2,
      "context": [
        {
          "id": "gg1nupp",
          "author": "OMGIzAGril",
          "body": "This post gives me so much hope. <3 Thank you!",
          "created_utc": 1608137547.0
        }
      ]
    },
    {
      "id": "gg1jgaw",
      "author": "None",
      "body": "Thank you so much! <3 Your comment really means a lot!",
      "created_utc": 1608135405.0,
      "score": 1,
      "context": [
        {
          "id": "gg1cgma",
          "author": "bitch_interrupted",
          "body": "So so proud of you! Thank you for sharing this ❤",
          "created_utc": 1608131871.0
        }
      ]
    },
    {
      "id": "gg2od1c",
      "author": "None",
      "body": "I get you, I really do. This was me for nearly 15 years. But you can get there. I will say that it wasn't just in this area of my life that I changed this mindset, but all areas, which I think is why I'm in such a strong place with my body and mind right now. \n\nBut, you can absolutely get there, to a place where you place you above what you think other people need you to be to find value. \n\nSo glad this post helped. Thank you <3 <3",
      "created_utc": 1608154725.0,
      "score": 2,
      "context": [
        {
          "id": "gg29erm",
          "author": "toienojao",
          "body": ">thinking I had to be a certain way because other people could only see me as having value if I was that, and not because I valued me...\n\nthis. I'm having such a hard time changing my mindset for my recovery, and this is something I have to internalize. I *know* it is true, but I can't seem to *believe*it. thank you for sharing this, it helps",
          "created_utc": 1608147672.0
        }
      ]
    },
    {
      "id": "gg2ot8f",
      "author": "None",
      "body": "thank you so much! sending you the best back",
      "created_utc": 1608154944.0,
      "score": 2,
      "context": [
        {
          "id": "gg1yp8t",
          "author": "None",
          "body": "im so proud of you OP! thats honestly so incredible and inspiring and im so haply for you. \n\nim almost a year into recovery now, and ive recently hit what i have long deemed to be a wholly unacceptable weight. it feels slightly crushing i cant lie, but this post makes me think that maybe in time, i can be okay with my body for being fleshy. \n\ni looked awkward when i was rather underweight. i liked it but it objectively wasnt my best look",
          "created_utc": 1608142710.0
        },
        {
          "id": "gg2nr0i",
          "author": "None",
          "body": "Thank you!! <3 <3 \n\nOne thing I've learned is how much the language we use affects how we feel. It's kind of funny, but it was actually from r/kibbe that I realised this (if you're not familiar, it's about dressing for your body type, based on yin/yang principles and things like that). But while all 'types' are meant to be equal, a lot of people show resistance to their 'type' because of the language used to describe them... and 'fleshy' is one of them. If you swap out that word for another descriptor, you suddenly see it in a whole new, romantic, beautiful light.\n\nI don't know if this is getting my point across - or is even helpful at all! - but basically I try to apply the principle that the words we use to describe ourselves to ourselves have a big impact. It was quite eye opening to see when I became a part of the r/ community.\n\nAnyway, again, that might not be helpful. But! Sending you love on your journey!",
          "created_utc": 1608154427.0
        }
      ]
    }
  ]
}