{
  "id": "kiumwu",
  "subreddit": "fuckeatingdisorders",
  "author": "Flesh-And-Bone",
  "created_utc": 1608735819.0,
  "title": "We all deserve to eat this Christmas.",
  "selftext": "I am terrified of binge eating on the holidays, but I am determined not to. Every holiday, I do a little better than the last.\n\nHalloween: overate on chocolate a bit, but I put it behind me and moved on.\n\nThanksgiving: didn't eat breakfast and got too hungry, but I managed to stop eating when fully satisfied without making myself sick. Ate leftovers that I wanted to eat and skipped those that I wasn't really into.\n\nChristmas: I am determined to Do Better this time around. I am going to get up, work out, then have a healthy brunch, and then I am going to bake up a storm with my family. I will allow myself to eat as much food as I want and not make myself sick.\n\nI am obviously a bit leery of the caloric bombs that I'm cooking up, but it's just food. It's Just Food.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kiumwu/we_all_deserve_to_eat_this_christmas/",
  "score": 161,
  "num_comments": 6,
  "comments": [
    {
      "id": "ggt2ti6",
      "author": "edsarebs",
      "body": "Thank you for this post. I definitely didn't do too well on Thanksgiving, but I'm going to do better on Christmas and the days around it. I will eat, and I won't worry about calories, but I also won't make myself sick. Good luck!",
      "created_utc": 1608739923.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ggudfgk",
      "author": "Oap101",
      "body": "This whole year has been a big long binge/purge session. I'm pretty much avoiding holiday gatherings, I made it a month and a half without purging a few months ago and I want to get back there even if it means missing out on festivities. The eating on Christmas just feel doesn't worth it this early on, I'm not ready. I'm focused on recovering and dealing with the weight that has left me very uncomfortable in my skin.",
      "created_utc": 1608764494.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggtc63t",
      "author": "Metallurgelgru",
      "body": "I had a hard morning eating more povitica than I planned on. But you're right, it's Just Food and I deserve to eat lunch and dinner and not be hungry. It's the holidays and the food is there to bring us joy, not shame.",
      "created_utc": 1608744815.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggtscma",
      "author": "coffeesoakedpickles",
      "body": "Thank you for this. I was a little scared that i would restrict all day and make myself sick in the evening, and I really wanted to fast today so i could make up for excess food tomorrow. But i just ate a salad AND a sandwich, anyway. And ill eat more tonight, and its okay:) We deserve food.",
      "created_utc": 1608753251.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gguobct",
      "author": "manicpanicbp",
      "body": "i am triggered and can’t control myself :( but thank you for this inspiration",
      "created_utc": 1608770566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggv61tm",
      "author": "dortuh",
      "body": "I will.enjoy this damn holiday",
      "created_utc": 1608780524.0,
      "score": 1,
      "context": []
    }
  ]
}