{
  "id": "kjxh72",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1608895054.0,
  "title": "I eat a lot yesterday at Christmas eve. I'm ALSO gonna eat a lot today at Christmas.",
  "selftext": "I definitely ate wayyyyy over my \"limit\". And when I say way over I don't just mean that I had a couple cookies. I mean actually WAY over. And yes my ED is screaming at me. But whatever. Once you actually commit to not listening to it, it's surprisingly easy to just carry on eating.\n\nI don't know what's gonna happen in the next few days. I'm very likely gonna freak out no later than next week over the infinite weight gain that just happened and all the bloat and the protruding belly and I'll feel horrible as ever. But you know what? Food has actually made me much more relaxed than when I restrict - it's like my body is saying \"oh thank God, there's some fucking food finally\".\n\nYesterday was a nice day with my family and loads of delicious foods and today is gonna be the same.\n\n*sorry for the typo in the title, it's \"I ate a lot yesterday\"",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kjxh72/i_eat_a_lot_yesterday_at_christmas_eve_im_also/",
  "score": 103,
  "num_comments": 9,
  "comments": [
    {
      "id": "ggzldg8",
      "author": "None",
      "body": "SAME! I drank a decent amount and ate way more than I wanted to... I've been consistently bloated and my stomach is protruding.. I hate it BUTTTT a body is a body is a body is a body... Like most people's bodies look like this (like not having a flat stomach)",
      "created_utc": 1608905285.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ggzidh9",
      "author": "DartInTheDark",
      "body": "Me too! Let's own it and love it!",
      "created_utc": 1608902401.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ggzj2av",
      "author": "None",
      "body": "lets fckn GOOOO!! :D i hope you enjoy the rest of your Christmas:) <3",
      "created_utc": 1608903096.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ggzs7qo",
      "author": "bingbonged_jpg",
      "body": "Me too! It's Christmas! Let's be happy and let go for one day 💕",
      "created_utc": 1608910832.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ggzsmle",
      "author": "coffeesoakedpickles",
      "body": "i know it feels scary as fuck- i feel the same- but i’m so proud of you❤️❤️ merry christmas and congrats on the win",
      "created_utc": 1608911136.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gh0i7fw",
      "author": "meurtrir",
      "body": "I'm giving myself four days. I have eaten EVERYTHING. Tiny voice is screeching at me but I'm trying not to care.",
      "created_utc": 1608927873.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggzz9cf",
      "author": "manicpanicbp",
      "body": "ME TOOOOOO \n\nno i’m i’m legit like self loathing to the max right now \nbut last night i was sitting at the dinner table binging of course but having conversations and laughing with my family instead of bitching out at them when i am hungry and irritable....\n\noverall i’ve decided today i’m going to try to eat intuitively 🥺 i think i know that won’t work but better try \n\nanyways happy holidays to everyone!! sending my\nlove",
      "created_utc": 1608915789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh0jy9g",
      "author": "petitelinotte212",
      "body": "The liberation of eating FOR PLEASURE!! We deserve it just as anyone else!",
      "created_utc": 1608928948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gh0tq3d",
      "author": "Berryb2045",
      "body": "Yes I love this! Enjoy the holidays everyone, ya'll deserve it! ❤️ Even though I'm struggling I'm trying again to keep this mindset",
      "created_utc": 1608935018.0,
      "score": 2,
      "context": []
    }
  ]
}