{
  "id": "kl6273",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1609085185.0,
  "title": "Christmas is over, and my ED brain is already defaulting back to restriction and old rituals.",
  "selftext": "I can see all the excuses playing in my head.\n\nYou ate a lot, you don't need anymore food.\n\nYou need to restrict because there's gonna be NYE soon and you need to prepare because you might eat even more.\n\nYou've already gained weight over the holidays, it's not like you're underweight anyway, you can just stop here.\n\nYou need to lose the water weight.\n\nYou can't just binge for life.\n\nEveryone eats a bit less after the holidays, why wouldn't you?\n\nAnd once again I'm not doing anything to stop this. Once again I'm allowing myself to be conquered and subdued. It's a self repeating cycle I can't manage to get myself out of. I feel utterly powerless even though I know I'm not.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kl6273/christmas_is_over_and_my_ed_brain_is_already/",
  "score": 121,
  "num_comments": 7,
  "comments": [
    {
      "id": "gh73t2i",
      "author": "littlemissbones",
      "body": "posting here is doing something about it! writing out those thoughts could be a first step in talking them down and giving yourself some compassion 💖",
      "created_utc": 1609087485.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gh72s6f",
      "author": "throwawayforlemoi",
      "body": "It's the same for me at the moment. If you want to talk about it, you can dm me",
      "created_utc": 1609086911.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gh7pdd7",
      "author": "ontopofyourmom",
      "body": "Mindfulness is powerful and it sounds like you're really self-aware!",
      "created_utc": 1609098783.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gh7repm",
      "author": "petitelinotte212",
      "body": "You’re noticing and recognizing the mentality - that’s a big deal. The sooner you learn to identify that voice as your ED, the easier it will become overtime to deconstruct those ideas. Even if you can’t resist them right now, you can change the way you feel about them. Get angry! Be sad! Start countering those thoughts with good information that disarms them: \n\nRestricting after a meal doesn’t “balance out” the calories - we don’t work like that metabolically. Restricting always puts your body under stress, no matter how much you’ve eaten before.\n\nYou can’t “lose” water weight - the bloating will subside once you’re eating and drinking enough to recalibrate the minerals in your body.\n\nEating is not “earned” it is a natural biological process and one of our most basic physical needs. \n\nBody size or weight gain are not limiting diagnostic factors for eating disorders. Fat ppl have disordered eating. Thin people have disordered eating. It’s about the behavior, and al of it is harming you.\n\nEven if the behavior doesn’t change right away, if you can intentionally repeat these truths and counter your ED thoughts with them, you will start giving TRUTH the power, instead of your ED’s lies.\n\nIt’s ok to be struggling - never stop fighting for your health. You deserve to recover, and you do not have to live like this!",
      "created_utc": 1609099817.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gh8k4b4",
      "author": "None",
      "body": "Damn. Didn't even give you till New Year's?",
      "created_utc": 1609114471.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh8rtwn",
      "author": "None",
      "body": "Me too man, me too",
      "created_utc": 1609118609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh8rxox",
      "author": "None",
      "body": "The ed brain is always on the grind",
      "created_utc": 1609118666.0,
      "score": 2,
      "context": [
        {
          "id": "gh8k4b4",
          "author": "None",
          "body": "Damn. Didn't even give you till New Year's?",
          "created_utc": 1609114471.0
        }
      ]
    }
  ]
}