{
  "id": "kmhku5",
  "subreddit": "fuckeatingdisorders",
  "author": "CozyJumpers",
  "created_utc": 1609259461.0,
  "title": "Let's talk about body dysmorphia.",
  "selftext": "Despite the fact that the majority of people suffering from anorexia also simultaneously suffer from some level of body dysmorphia, body dysmorphia is still this convoluted aspect of the disorder that has a big ol' question mark around it. Using myself as a case study of this, I still suffer from body dysmorphia despite my progress in recovery. Even though both my dress size and most human beings who have seen me would confirm the fact that I fit into the \"thin\" range of bodies, I rarely internalize that for more than a short period of time before going back to believing that I'm larger than I am, as well as hyperfixating over specific body parts and their perceived 'severe' flaws. This has been true even at my lowest weight. And this is the case for most people I know who've suffered from a restrictive eating disorder. When we feel that we look drastically differently than we do, it's not deliberately done out of a desire to be \"dramatic\", and (for most decent people) is not an attempt to disparage people in larger bodies either. It's a genuine inability to view ourselves in an accurate and neutral light, typically due to perfectionism and/or a sense of feeling like we're inherently not good enough.\n\nBut body dysmorphia in the general public is often dismissed as this vapid, immature thing, e.g.: [The scene in *Mean Girls* where the popular girls look in the mirror and complain about their different body parts](https://www.youtube.com/watch?v=5ZlBBHLB0zs&ab_channel=BrittanyGordon), with this scene attempting to paint the narrative that this kind of thinking/behavior about one's body is only associated with hyperprivileged shallow women who have nothing better to do than complain about their bodies.\n\nThis stereotype is misogynistic garbage, but I'm not going to take too much time to detangle here the ways that social environments both force women to hate their bodies and then ridicule them when they do, because many others have eloquently unpacked this before me. So, instead, I'd like to go back to body dysmorphia itself and its validity as a mental disorder in its own right. Mainly, the fact that:\n\n**Body Dysmorphia is classified as a type of psychological delusion.**\n\n\\[[Source](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2915600/)\\]\n\n* If you're familiar with delusions whatsoever, you know that they're not something people can just get over through sheer willpower. When people think of delusions, they typically think of persecutory delusions, which are the delusions that make people think someone is 'out to get them', like believing that someone is following you or that your neighbors are plotting to kill you; these types of delusions are typically associated with mood disorders like schizophrenia or bipolar disorder. But delusions also range into other categories that aren't persecutory as well. Delusions can sometimes be somatic in nature, i.e: relating to one's body or health. Somatic delusions can take the form of severe health anxiety, such as believing that you're suffering from a serious/fatal illness like cancer, or extreme preoccupation with your body, like believing there is something seriously wrong with your body, believing that you have physical flaws on your body that either don't exist at all or are much less exaggerated than you see them as, etc. A lot of this is body dysmorphia in a nutshell.  \n\n**And if Body Dysmorphia is an actual psychological disorder, you can't just 'snap out of it.'**\n\n* Going back to *Mean Girls* for a sec, that type of messaging is fucking omnipresent in the media. The idea that 'caring about your body is silly and shallow and if you were a better and more intelligent person, you wouldn't do it' is in every movie and TV show about every 'dumb blonde' or 'vapid evil bitch' ever. But as previously mentioned, it's just not true. You don't have these thoughts about your body because you're an unintelligent person, and you can't just decide that you're not going to think that way anymore at the drop of a hat. All these mentalities do is further reinforce the misconception that body dysmorphia isn't a serious issue that needs care and attention. \n\n&#x200B;\n\nThe reality is, eating disorders leave some pretty painful emotional scars, even after they're gone. Every time in your disorder when you looked in the mirror and teared up at how 'hideous' you thought you looked, every time you self-harmed out of hatred of your body, every time you stayed up late at night and wholeheartedly believed that no one could ever love someone who looked like you, they left a scar. And those scars need attention to heal. They certainly won't heal by minimizing their impact or acting like they're not important.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kmhku5/lets_talk_about_body_dysmorphia/",
  "score": 125,
  "num_comments": 9,
  "comments": [
    {
      "id": "ghf3bhh",
      "author": "honeymapleham",
      "body": "This. Thank you for spending the time to write this. As someone diagnosed with an RED and suffers from BDD simultaneously, this means so much. Even the ones closest to us can’t seem to understand how we genuinely cannot see what they can.",
      "created_utc": 1609268855.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ghfquuh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1609280570.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ghhen98",
      "author": "XXBATNT",
      "body": "Appreciate the analytical thoughts and effort you put into writing this post :)\n\nIf we could always/usually remember to tackle the stuff going on in our brains like this... I wonder where we’d be! Haha",
      "created_utc": 1609317619.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghfzs04",
      "author": "BabyStinkBreath",
      "body": "I needed to read this, thank you.",
      "created_utc": 1609285214.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghgd8i2",
      "author": "None",
      "body": "THANK YOU. I’ve been getting so mad about this and I hate how if you think about your body, you’re shallow!! I have a friend who’s been making comments like “I just don’t think about my looks and appearance that much” when I bring up my thoughts about my body and my dysmorphia. I just also want to side note to that comment, my friend is conventionally attractive and very much has pretty privilege and constantly gets hit on, so obvi, she doesn’t have to “think” about her appearance and looks.",
      "created_utc": 1609292362.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghk3cro",
      "author": "hello-blue-monday",
      "body": "Thank you for sharing this. Lately, I’ve been navigating “trusting my body” while also acknowledging that I can’t necessarily trust my own perception of my appearance. It can be a challenge, but coming to terms with those two truths has been so helpful.",
      "created_utc": 1609376331.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghfjqwc",
      "author": "CozyJumpers",
      "body": "For sure <3 Yeah, it definitely took me a good while to realize that body dysmorphia wasn't a choice that I was making but rather a genuine disorder that I was suffering from. It's pretty insidious too because the fact that it's so convincing makes you believe that you don't have it at all, like the belief that \"If I feel this ugly, then surely I must be. Others may suffer from body dysmorphia, but not me, I'm just ugly.\" Which is of course not true, so it's so important to actually discuss the fact that it's so \"convincing\" because delusions inherently are super convincing, they're based on your fears, they're going to feel super real even when they're not.",
      "created_utc": 1609277001.0,
      "score": 10,
      "context": [
        {
          "id": "ghf3bhh",
          "author": "honeymapleham",
          "body": "This. Thank you for spending the time to write this. As someone diagnosed with an RED and suffers from BDD simultaneously, this means so much. Even the ones closest to us can’t seem to understand how we genuinely cannot see what they can.",
          "created_utc": 1609268855.0
        }
      ]
    },
    {
      "id": "ghftsbc",
      "author": "CozyJumpers",
      "body": "God that's so true. It's crazy to have that double standard of hardcore believing in women's rights, body positivity, and rejecting beauty standards for literally everyone else, and vehemently telling everyone you meet that they don't need to change themselves and they don't need a perfect body and that all of that is just bullshit created by the patriarchy to make you hate yourself and feel small, but when it comes to yourself it's like, \"Except me, I must fit every single beauty standard and have zero flaws :)\" It's fucked up but it happens.\n\nAlso jfc at that therapist, I stg I have no clue how assholes like that even get their degree.",
      "created_utc": 1609282072.0,
      "score": 4,
      "context": [
        {
          "id": "ghfquuh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1609280570.0
        }
      ]
    },
    {
      "id": "ghfp3v1",
      "author": "honeymapleham",
      "body": "It’s just so hard to really understand how it can be an illusion, because what we see must be true, and seeing is believing, cold hard facts, etc.",
      "created_utc": 1609279680.0,
      "score": 7,
      "context": [
        {
          "id": "ghf3bhh",
          "author": "honeymapleham",
          "body": "This. Thank you for spending the time to write this. As someone diagnosed with an RED and suffers from BDD simultaneously, this means so much. Even the ones closest to us can’t seem to understand how we genuinely cannot see what they can.",
          "created_utc": 1609268855.0
        },
        {
          "id": "ghfjqwc",
          "author": "CozyJumpers",
          "body": "For sure <3 Yeah, it definitely took me a good while to realize that body dysmorphia wasn't a choice that I was making but rather a genuine disorder that I was suffering from. It's pretty insidious too because the fact that it's so convincing makes you believe that you don't have it at all, like the belief that \"If I feel this ugly, then surely I must be. Others may suffer from body dysmorphia, but not me, I'm just ugly.\" Which is of course not true, so it's so important to actually discuss the fact that it's so \"convincing\" because delusions inherently are super convincing, they're based on your fears, they're going to feel super real even when they're not.",
          "created_utc": 1609277001.0
        }
      ]
    },
    {
      "id": "ghgc3m4",
      "author": "CozyJumpers",
      "body": "Yeah definitely. The only thing that really helped me with this was learning about anxious/obsessive thinking as a whole and how it works. One of the only things that helps me in those moments is remembering that thoughts aren't facts, just because your brain has a thought like \"I'm unattractive\" or \"I've gained weight\", doesn't make it true, etc. It's not a foolproof method but I think it helps sometimes to realize that when you're feeling low, a lot of your thoughts are based on your emotions in the moment, and not necessarily on what's objectively true.",
      "created_utc": 1609291753.0,
      "score": 4,
      "context": [
        {
          "id": "ghf3bhh",
          "author": "honeymapleham",
          "body": "This. Thank you for spending the time to write this. As someone diagnosed with an RED and suffers from BDD simultaneously, this means so much. Even the ones closest to us can’t seem to understand how we genuinely cannot see what they can.",
          "created_utc": 1609268855.0
        },
        {
          "id": "ghfjqwc",
          "author": "CozyJumpers",
          "body": "For sure <3 Yeah, it definitely took me a good while to realize that body dysmorphia wasn't a choice that I was making but rather a genuine disorder that I was suffering from. It's pretty insidious too because the fact that it's so convincing makes you believe that you don't have it at all, like the belief that \"If I feel this ugly, then surely I must be. Others may suffer from body dysmorphia, but not me, I'm just ugly.\" Which is of course not true, so it's so important to actually discuss the fact that it's so \"convincing\" because delusions inherently are super convincing, they're based on your fears, they're going to feel super real even when they're not.",
          "created_utc": 1609277001.0
        },
        {
          "id": "ghfp3v1",
          "author": "honeymapleham",
          "body": "It’s just so hard to really understand how it can be an illusion, because what we see must be true, and seeing is believing, cold hard facts, etc.",
          "created_utc": 1609279680.0
        }
      ]
    }
  ]
}