{
  "id": "knlw63",
  "subreddit": "fuckeatingdisorders",
  "author": "MentallyFuckedBerry",
  "created_utc": 1609401409.0,
  "title": "“Just don’t overeat or undereat”",
  "selftext": "ABSOLUTELY GENIUS WHY DIDN’T I THINK OF THAT? God good this phrase pisses me off so much. I’m hungry mf!! Very hungry. Leave me alone lmao.\n\nAnd now people are all up on my ass because my BMI is in the normal but mildly high range?? Like mf I’ve grown a bit since my ED maybe leave me alone??",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/knlw63/just_dont_overeat_or_undereat/",
  "score": 128,
  "num_comments": 11,
  "comments": [
    {
      "id": "ghl97ll",
      "author": "blacktar-heroin",
      "body": "dude it feels like you can never win with people. you either don’t eat enough or you eat too much. people just need to learn to shut the fuck up and not comment on what others eat it’s seriously so frustrating.",
      "created_utc": 1609403577.0,
      "score": 39,
      "context": []
    },
    {
      "id": "ghlsuc0",
      "author": "None",
      "body": "books squeamish merciful march wise sip panicky lunchroom touch hungry\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1609422675.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ghlfyih",
      "author": "None",
      "body": "LEGITT no matter what you do its always wrong like tf am i supposed to do",
      "created_utc": 1609410674.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ghlsmrc",
      "author": "FeatherWorld",
      "body": "Thank, I'm cured 🙄 There is no balance for me. It's all the way or no way. There is no winning. Sometimes people just want you to be miserable so they can think themselves superior, even when you are doing better.",
      "created_utc": 1609422526.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ghm0zwt",
      "author": "linconnuedelaseine",
      "body": "Healing from an ED is such a journey! People on the outside of it just do not get it! \n\nYou’re doing great! It’s hard as hell to choose recovery on a daily basis and it sounds like you’re showing up for yourself! I’m so sorry for the idiots who think it’s so easy to “fix.”",
      "created_utc": 1609427894.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ghm795c",
      "author": "bikecrotchthrowaway",
      "body": "One of the most helpful things my ED therapist told me is that it's totally normal to eat a little too much some days and your body will probably balance it out by being less hungry the next day.",
      "created_utc": 1609431347.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghlxoc1",
      "author": "Wrencer4Endgame",
      "body": "Lmao basically my dad. Like it's that easy",
      "created_utc": 1609425924.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghn8lan",
      "author": "metempsychosis99",
      "body": "People are generally very ignorant when it comes to eating disorders, that's why you hear the most ridiculous things. It's a struggle. I feel you.",
      "created_utc": 1609451078.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghn96bd",
      "author": "metempsychosis99",
      "body": "When in recovery it's normal to experience extreme hunger and eat higher amounts. Your body needs it to replenish the nutrition you lacked and repair the damage done to your body. It will balance itself out, both your apetite and your body fat. It's only normal, but an incredibly difficult process to go through even without useless ignorant comments like these. People just tend to speak shit. Tell them to suck it.",
      "created_utc": 1609451403.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi0t097",
      "author": "None",
      "body": "UGHHHH my mom used to tell me that all the time before i started recovery! she understands now but it was just so difficult to communicate how nonsensical that phrase felt to me (and still is like fuckk)",
      "created_utc": 1609725151.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghlu39u",
      "author": "T_86",
      "body": "34f with bipolar1 and a restrictive eating disorder here. My entire life my mother has reacted to my bipolar disorder by saying “just don’t be so dramatic” and now my fiancé who actually is very loving and supportive says dumb things like “just eat but stop when you’re full”. I try not to get upset at that comment cause I know that one comes from good intentions but it’s definitely not helpful at all.",
      "created_utc": 1609423558.0,
      "score": 13,
      "context": [
        {
          "id": "ghlsuc0",
          "author": "None",
          "body": "books squeamish merciful march wise sip panicky lunchroom touch hungry\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "created_utc": 1609422675.0
        }
      ]
    }
  ]
}