{
  "id": "koh6vj",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1609529000.0,
  "title": "My niece told me to go on a diet",
  "selftext": "We were eating dinner and honestly I've been okay considering... You know, it's Christmas period and I usually struggle around now. And then my niece told me to go on a diet, \"as a joke\". But I obviously didn't take it as a joke. \n\nI feel like shit lol. I obvs got upset but I can't do anything at the table bc my fam don't know my struggles w my ED bullshit. So I CAN'T say anything.\n\n I ate dessert still tho. I'm not gonna fall back into bad habits but god I Sure Am Thinking About It",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/koh6vj/my_niece_told_me_to_go_on_a_diet/",
  "score": 103,
  "num_comments": 5,
  "comments": [
    {
      "id": "ghrjrwh",
      "author": "kianathebutt",
      "body": "regardless of how young your niece is, you still had the right to tell her that that's NEVER a nice thing to say to someone. shit, literally any adult at the table at all should have told her that.",
      "created_utc": 1609538637.0,
      "score": 51,
      "context": []
    },
    {
      "id": "ghr7bur",
      "author": "Caroline_Directioner",
      "body": "i’m so sorry you had to deal with that, i’m glad you were able to talk back to your ED enough to eat dessert",
      "created_utc": 1609532005.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ghrkgq5",
      "author": "EDanonyaccount",
      "body": "My cousin’s daughter used to do this to me! Called me fat and to loose weight when I was a perfectly normal weight and nobody called her out on it. The whole family would get pissed whenever I told her off too. Ugh I’m so angry for you, I’m glad you didn’t let her shitty comment affect your behaviour.",
      "created_utc": 1609538998.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ghrpyi6",
      "author": "qiaozhina",
      "body": "My 3-year-old niece has recently taken to calling me chubby chops and it makes me want to die even though she clearly thinks it is nothing more than a term of endearment. I can't really get mad at her because she's three and is using all the ways she knows to express her fondness of me but boyyyyy do I wish she wouldn't call me chubby.\n\nIf she is old enough to grasp what she is saying and suggesting, tell her to cut it out purely on the basis that it is rude.",
      "created_utc": 1609541949.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ghrq46p",
      "author": "ForestRagamuffin",
      "body": "100% agree. op's niece is gonna grow up and keep saying things like that unless someone nips it in the bud. you're always within your right to say \"no thanks, i don't want your opinions about my body\" or \"i think that's rude and i don't want you to talk to me like that.\" anyway, i'm sorry op had to hear that!",
      "created_utc": 1609542038.0,
      "score": 21,
      "context": [
        {
          "id": "ghrjrwh",
          "author": "kianathebutt",
          "body": "regardless of how young your niece is, you still had the right to tell her that that's NEVER a nice thing to say to someone. shit, literally any adult at the table at all should have told her that.",
          "created_utc": 1609538637.0
        }
      ]
    }
  ]
}