{
  "id": "kowtm3",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1609590976.0,
  "title": "Eating \"normal meals\" feels worse than anything else, and few people seem to be able to understand this.",
  "selftext": "Yes it feels even worse than binging.\n\nI'm not really afraid of feeling full (I mean I am, but that's not the point). I'm more afraid of NOT feeling full after a meal, which always happens when I eat normal meals. At least if I skip a meal or massively undereat I can tell myself that it's obvious if I don't feel full. But if I eat a normal meal and then I still not feel full/satisfied (which, again, happens pretty much all the time), then what's left? It just means I'm fucked and there's something wrong with me.\n\n(and adding protein/fibre/water, eating mindfully or something like that doesn't help either - I've eaten more protein than you humans can imagine lol)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kowtm3/eating_normal_meals_feels_worse_than_anything/",
  "score": 114,
  "num_comments": 9,
  "comments": [
    {
      "id": "ghtn857",
      "author": "cheshlz",
      "body": "Ikr i feel like the food obsession increases bc your appetite is stimulated but the shame that comes with eating \"normally\" and the frustration of not being \"normal\" kinda makes you want to binge to make the calorie consumption \"worth it\" by at least not being left wanting more and bc you shouldn't it's miserable and feels dirty.",
      "created_utc": 1609592207.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ghtr9m8",
      "author": "Stonerook61",
      "body": "Oooft. This is exactly what holds me back in recovery. It's nice to feel less alone having read your post. Thank you.",
      "created_utc": 1609595541.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ghtrka6",
      "author": "None",
      "body": "I relate to this, but as I have continued to eat more and less restrctivley,  I have found my meals become more and more satisfying.  \n\nEg. If you had just been in a barren desert for hours and were extremely thirsty, you would need more water than someone who was hydrated and in a comfy house. If that makes sense? \n\nI found that for a long time, I would have a proper meal with family or friends, then dessert, then another kind of supper, when usually no one else would. But it worked for me. And I now find that extreme hunger decreasing. It's a very normal part of recovery!",
      "created_utc": 1609595767.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ghusobu",
      "author": "pennycenturie",
      "body": "> I've eaten more protein than you humans can imagine\n\nthis is menacing.\n\nThat being said, I know what you mean. There's so many things about \"normal eating\" that I find impossible. People think it's insane when I don't eat, they understand when I binge, but the way they eat is what baffles me beyond belief.",
      "created_utc": 1609616436.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghvdpa6",
      "author": "MaryContrary26",
      "body": "In recovery you need more than \"normal\" meals\".You're repairing the damage.",
      "created_utc": 1609627301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghu0x6p",
      "author": "peanutbutterbarbie",
      "body": "i get this",
      "created_utc": 1609601960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghu33d5",
      "author": "planxtie",
      "body": "For a while the ,normal‘ signals from my body were all mixed up. I was so used to denying my hunger, that it was really hard for a while to know what sensations I was having. This caused me anxiety. But eventually my intuition came back and I learned to trust my body to tell me what it needs again.",
      "created_utc": 1609603212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghw2y6l",
      "author": "thanksfortalking",
      "body": "This. That's how I feel when I'm depressed (most of the time) like now. I have to starve or overstuff myself to not feel absolutely terrible. And no one knows why. I've never heard a theory that makes sense for this. I don't even know why.",
      "created_utc": 1609641068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghtnfr7",
      "author": "internerderner2",
      "body": "Or on the other hand it makes you want to restrict even more, because if you have to restrict anyway then what's the point in having a meal plan? I might as well just do it on my own terms.",
      "created_utc": 1609592394.0,
      "score": 14,
      "context": [
        {
          "id": "ghtn857",
          "author": "cheshlz",
          "body": "Ikr i feel like the food obsession increases bc your appetite is stimulated but the shame that comes with eating \"normally\" and the frustration of not being \"normal\" kinda makes you want to binge to make the calorie consumption \"worth it\" by at least not being left wanting more and bc you shouldn't it's miserable and feels dirty.",
          "created_utc": 1609592207.0
        }
      ]
    }
  ]
}