{
  "id": "kqi084",
  "subreddit": "fuckeatingdisorders",
  "author": "pbpankeiks",
  "created_utc": 1609794517.0,
  "title": "anyone else feel frustrated when someone doesn’t “make you” eat",
  "selftext": "I know I want to eat!!! But I’m waiting for someone to be like “PLEASE EAT YOU HAVE TO EAT” to do it. I don’t need “permission” to eat. I’m an adult that has decided to stop half assing my recovery. To stop being in “remission” as i have been for the past 10 years. But here I am half assing it and expecting people to grant me permission to eat a hot dog ...........",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kqi084/anyone_else_feel_frustrated_when_someone_doesnt/",
  "score": 141,
  "num_comments": 13,
  "comments": [
    {
      "id": "gi45egc",
      "author": "neverendinganger",
      "body": "the one person who knows about my ED doesn’t at all try to make me eat, and I know he just doesn’t want to upset me but Dumb ED Brain makes me feel like he must want me to lose weight, so I actually occasionally eat out of spite",
      "created_utc": 1609798794.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gi48ixx",
      "author": "ThoughtPolicePolice",
      "body": "I’m in res rn. \n\nAt first they’d come to remind me it’s meal time, and I’d be like, oh great, permission, ok I’ll eat. \n\nThen I started to push back a bit. Not hungry right now, maybe later. They’d say come on it’s ready now let’s go, so I did. \n\nThen I kept pushing and... they stopped rebutting. Then they stopped reminding me at all. They’re smart. They know what they’re doing. It’s an autonomy thing. I have to learn. But JFC do I hate it. \n\nI just want to be looked after. :(\n\nSo, I feel you.",
      "created_utc": 1609800327.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gi4biu6",
      "author": "bobanyangie",
      "body": "literally aksjskdjks i get annoyed when people dont tell me to eat and also annoyed when people tell me to eat",
      "created_utc": 1609801824.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gi3xc9a",
      "author": "edsarebs",
      "body": "It happens to me too. I'll still eat even if no one says anything, but I get a perverse pleasure from people like my mom pushing me to eat. Also some frustration when they do, but for some reason it makes me feel accomplished and almost validated",
      "created_utc": 1609794965.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gi4j689",
      "author": "basementmixtape",
      "body": "what has helped me is having someone i send pictures of what i eat to so they can hold me accountable and tell me to eat when i haven’t and be supportive and kind when i have, then i can eat by myself and still get the validation that comes when someone asks you to eat when i need it to eat. i know it’s not an ideal recovery method but it’s what’s helping me rn",
      "created_utc": 1609805716.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gi4258v",
      "author": "MaryContrary26",
      "body": "You may want to eat but do you think you deserve to? And if part of you doesn't what it is that you don't deserve and why? (may be helpful to really look at what's going on)",
      "created_utc": 1609797244.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gi4ijvw",
      "author": "fishsoap69",
      "body": "PLEASE EAT. YOU HAVE TO EAT",
      "created_utc": 1609805392.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gi5b5wh",
      "author": "tinymightybookworm",
      "body": "I can definitely understand this feeling. For the most part I've moved past it, but I remember when I was first recovering it was very helpful to message my friends (one of whom understood completely and who has had experience with EDs herself) and tell them the dilemma - that I wanted to eat something but I just couldn't. It felt like I needed permission, and a lot of the guilt of eating something would melt away with that permission. It might help if you can find someone to trust and figure out something like this. I'm not saying it's a permanent solution because I'm hoping you should reach a point of being more comfortable around food when you're alone with it, but it can be something for now until you become more comfortable eating without a push. Until you're back on your feet. Just someone you can message and who can give you the \"permission\" or push that your brain might need to feel less guilt. I don't know if this helps and I wish you all the best. And I hope you know that it's okay to eat and that your body needs you to be kind to it and feed it. You always have permission to eat, and you shouldn't feel any shame.  I also understand if it might help if you have that tiny extra push from someone else right now, as someone who has been there before. Stay strong! If you're willing to take words from someone online: You always deserve to eat. If you want to eat, eat. You deserve to. It'll be okay. Be kind to yourself and your body for wanting food, no matter what food it might be.",
      "created_utc": 1609820366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi69ahx",
      "author": "None",
      "body": "Honestly it feels very invasive and demeaning to beg my sister who has an ED to eat, because it feels like I’m saying “just eat and it’ll fix your ED!” so I try to avoid it. Most of the advice you see when you Google “what to do if my loved one has an ED” is “don’t try to force them to eat.” So if you get an ED thought that says “well you need someone to beg you to eat, if they wanted you to eat they would have tried to force you,” etc, it helps to counter that thought with the reality that everyone who loves you wants you to recover, to eat and to eat well and be satiated and happy, and that they’re doing what they think is best to help you get there.",
      "created_utc": 1609849609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi4cfkj",
      "author": "pbpankeiks",
      "body": "i literally get annoyed by saying that i want to eat something and not being insisted on going and eating that something. its so stupid bc i had an incident with my mom where i told her i wanted to eat a pastry from a bakery close to our house but since she was gardening she said we could go when she finished. Logically, this is fine. In my fucked up head, I told myself “well now you definitely can’t have that because she didn’t insist on going right then and there”. So I got annoyed and when we finally went I ordered nothing. so dumb",
      "created_utc": 1609802277.0,
      "score": 12,
      "context": [
        {
          "id": "gi4biu6",
          "author": "bobanyangie",
          "body": "literally aksjskdjks i get annoyed when people dont tell me to eat and also annoyed when people tell me to eat",
          "created_utc": 1609801824.0
        }
      ]
    },
    {
      "id": "gi69hei",
      "author": "None",
      "body": "I relate to this. I remember once I was in college, I forgot my meal card and panicked, but the employee told me “honey go ahead and eat as much as you want anyway”, and I literally get testy eyes when I think about this small act of kindness. I think about that person a lot, I hope they’re doing well.",
      "created_utc": 1609849767.0,
      "score": 2,
      "context": [
        {
          "id": "gi5b5wh",
          "author": "tinymightybookworm",
          "body": "I can definitely understand this feeling. For the most part I've moved past it, but I remember when I was first recovering it was very helpful to message my friends (one of whom understood completely and who has had experience with EDs herself) and tell them the dilemma - that I wanted to eat something but I just couldn't. It felt like I needed permission, and a lot of the guilt of eating something would melt away with that permission. It might help if you can find someone to trust and figure out something like this. I'm not saying it's a permanent solution because I'm hoping you should reach a point of being more comfortable around food when you're alone with it, but it can be something for now until you become more comfortable eating without a push. Until you're back on your feet. Just someone you can message and who can give you the \"permission\" or push that your brain might need to feel less guilt. I don't know if this helps and I wish you all the best. And I hope you know that it's okay to eat and that your body needs you to be kind to it and feed it. You always have permission to eat, and you shouldn't feel any shame.  I also understand if it might help if you have that tiny extra push from someone else right now, as someone who has been there before. Stay strong! If you're willing to take words from someone online: You always deserve to eat. If you want to eat, eat. You deserve to. It'll be okay. Be kind to yourself and your body for wanting food, no matter what food it might be.",
          "created_utc": 1609820366.0
        }
      ]
    },
    {
      "id": "gi4cr6h",
      "author": "bobanyangie",
      "body": "ahh i felt that. next time pls get a pastry from the bakery :(. bread is god tier",
      "created_utc": 1609802438.0,
      "score": 10,
      "context": [
        {
          "id": "gi4biu6",
          "author": "bobanyangie",
          "body": "literally aksjskdjks i get annoyed when people dont tell me to eat and also annoyed when people tell me to eat",
          "created_utc": 1609801824.0
        },
        {
          "id": "gi4cfkj",
          "author": "pbpankeiks",
          "body": "i literally get annoyed by saying that i want to eat something and not being insisted on going and eating that something. its so stupid bc i had an incident with my mom where i told her i wanted to eat a pastry from a bakery close to our house but since she was gardening she said we could go when she finished. Logically, this is fine. In my fucked up head, I told myself “well now you definitely can’t have that because she didn’t insist on going right then and there”. So I got annoyed and when we finally went I ordered nothing. so dumb",
          "created_utc": 1609802277.0
        }
      ]
    }
  ]
}