{
  "id": "krlasb",
  "subreddit": "fuckeatingdisorders",
  "author": "averyquietvoice",
  "created_utc": 1609928809.0,
  "title": "WHY did I ever think I needed to lose weight!?!",
  "selftext": "So I found photos of myself right before I started exercising and trying to diet in 2018. I forgot what I used to look like before my ED, and I am just flabbergasted.\n\nPre-disordered me was on the smaller side, a size that was more or less societally desirable. I looked that way effortlessly, eating without thinking, with no exercise regime. But even then I thought I could stand to lose a few - and pandora’s box was opened.\n\nGranted, to deal with life stress I may have ended up with some other maladaptive coping mechanism than an ED, but I am SO mad I got dragged in so deeply by diet culture and online weight loss and “health” communities. I totally got scammed!! So much wasted time, energy, and money trying to stay thin, only to blow more on reversing all the damage 🤦‍♀️\n\nAll that said, 6 months into all-in recovery and I am doing great! I feel closer to pre-disordered me than ever in terms of my relationship with food. I even like the curves that come with my bigger body now, I just feel like I have a different... aesthetic? So I honestly don’t really mind whether or not I end up reverting back to my smaller self, as long as I keep eating with no reservations and never ever do extreme diet bullshit ever again!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/krlasb/why_did_i_ever_think_i_needed_to_lose_weight/",
  "score": 119,
  "num_comments": 6,
  "comments": [
    {
      "id": "giaxlbr",
      "author": "QueenOfNothingII",
      "body": "Same here. Some of the motivation I had when I first wanted to loose weight was the memory I had of some old photos. Now when I look  at those photos, I realise that my body was actually normal and pretty. But still the thought of getting a normal weight scares me.",
      "created_utc": 1609941760.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gib6gdp",
      "author": "manicpanicbp",
      "body": "same here. :( i also LOVED food like i think about food every second every minute now and still love it but i mean my relationship with food was so so so healthy. ugh i was so happy too but then i started coping with drugs and smoked sooooo much weed which gave me the munchies and i gained a lot of weight so i think that’s what triggered my motivation :/\n\nalso CONGRATULATIONS 🎊 recovery is not linear but it sounds like you are being courageous /engaging in self love so i’m happy for you!!",
      "created_utc": 1609946501.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gib1yyk",
      "author": "None",
      "body": "That sounds like amazing progress.  This level of trust in your body is astounding and hard to achieve . When you trust a person more and give them more freedoms they start to realize they are more responsible for the outcome of things and that's kind of how I like to view it with trusting my body . I (try to) trust my body because I know with some time and hard work it gets better at sending me correct hunger signals and making me crave foods I need and that are healthy :)) I am still very disordered but this has helped me so much.",
      "created_utc": 1609944188.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gibw2gc",
      "author": "None",
      "body": "yep, EDs are never really about weight i think, theyre addictions. looking back i was so much smaller than i am now post/mid recovery but im sooo much happier. but yeah, i did think i was bigger than i was and its shocking to realise with hindsight",
      "created_utc": 1609958103.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gicq5ym",
      "author": "petitelinotte212",
      "body": "I had the same experience when uploading a cache of old photos to a new phone. It was a photo of me in pajama shorts and a tank top and I honestly couldn't believe how small I was - I didn't even recognize it was me at first, Not because I was emaciated, I was a normal weight like you, but I never ever looked at myself and saw a body that small. It shocked me how dismorphic I had been. I had been so trained to obsess over being smaller, I was unable to see what size my body really was, like, truly. Like by a lot. It made me so sad, man. I really grieved for that girl, and like you said was bummed at all of the wasted time, energy, and money - not to mention all of the years I could have just been happy with my body as it was because in fact I did conform to thin body standards. \n\nBody acceptance isn't something you receive based on conformity to these arbitrary beauty standards, its something you have to choose to do and can choose to do no matter what size you are - and something you will never feel, no matter how small you are, unless you decide that you're good enough.",
      "created_utc": 1609971100.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gicd6ft",
      "author": "wildxdaze",
      "body": "Thank you for sharing this and sending you love on your recovery journey! I totally feel you in every way. I started working at a spin studio mid ED in 2019 and I look back at myself at that time and can't believe how sucked into the \"\"\"\"fitness\"\"\"\" and diet culture life I was - now looking back I'm like f*ck me that stuff can be so dangerous, especially to those who may fall into ED patterns. I felt scammed too.",
      "created_utc": 1609965662.0,
      "score": 2,
      "context": []
    }
  ]
}