{
  "id": "kuk3i7",
  "subreddit": "fuckeatingdisorders",
  "author": "K_Dagger",
  "created_utc": 1610304455.0,
  "title": "I’m Out.",
  "selftext": "I’m 22 years old. I’ve struggled with various forms of EDs since I was 12. My mom is an former LA beauty pageant Queen and she has always made hurtful comments about my body. She would tell me that if I wanted to be able to wear shorts I needed to watch my weight. I was in middle school, 5’6” and under 120lbs. That in addition to signing my first modeling contract at 15 gave me horrible self image. At one shoot I had a male assistant who I had never met literally throw down a massive, full skirted dress I was supposed to wear because “we’ll have to put it on over her head instead of having her step into it because her ass is so damn big”. I was 16 and still under 120lbs. \n\nI’ve let my ED take away so many amazing things. I ruined relationships with men because of my insecurity and moodiness. I’ve put strain on my friendships because I was so damn unhappy and it made everyone that had to deal with me miserable. It also played a significant role in the decay of a relationship in which I was the closest to falling in love than I’ve ever been before. And I’m done letting it make me cry in dressing rooms and want to purge before wearing anything tight. \n\n\nDuring 2020 I lost a woman who was a second mother figure to me. At times I was closer with her than my own mom. As horrible as that was it gave me perspective. I only have so much time to live and I want to actually live. I started a therapy workbook that turned into me actually going to real therapy sessions (virtual due to location/pandemic). I started actually taking my Wellbutrin everyday like I’m supposed to. I stopped spending the majority of my day tracking every single calorie including vitamins and medicine. I started wearing clothes that actually fit me and showed my shape. I started eating foods that made me happy like mashed potatoes and pasta and pancakes. I practice “joyful” movement that I enjoy rather than just finding exercise that burns the most calories. On NYE I ate; crab dip with tortilla chips, crab cakes, coconut shrimp with French fries, and toffee cake with ice cream. I drank Irish coffees and cosmopolitans and French 75’s. And I was okay. Nothing went wrong. The world didn’t stop turning because I ate everything I wanted and didn’t purge after. After a decade of this battle I think I’m through the worst of it. I still have several weeks of therapy planned (my therapist said we will reevaluate after that date and see if I need continued therapy), consistency with my medication and lots of self love.\n\n\n I know that I will have to keep working at this for the rest of my life. But for now, thank you for the years of help, support and camaraderie, I am out. 💕",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kuk3i7/im_out/",
  "score": 149,
  "num_comments": 9,
  "comments": [
    {
      "id": "gismikr",
      "author": "BluePurslane",
      "body": "I love this post.  And I want to give you some hope with this:  *\" I know that I will have to keep working at this for the rest of my life. \"*  Maybe not.  Maybe you won't.  I'm at a place where it's not a daily and hourly struggle.  This *can* become a thing of the past that you don't think about much.",
      "created_utc": 1610309974.0,
      "score": 37,
      "context": []
    },
    {
      "id": "giskyhb",
      "author": "flyingcat_hysteria",
      "body": "♡♡♡",
      "created_utc": 1610309211.0,
      "score": 4,
      "context": []
    },
    {
      "id": "giu5700",
      "author": "Alllibee",
      "body": "Hell yes. Keep it up, empowering words that I hope I can share my version of one day soon. Best wishes to you <3",
      "created_utc": 1610336671.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gisy0qx",
      "author": "Hurtbroskii",
      "body": "♥️",
      "created_utc": 1610315483.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gitp94l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610328732.0,
      "score": 3,
      "context": []
    },
    {
      "id": "giuz1pz",
      "author": "bitch_interrupted",
      "body": "So so proud of you! Good luck with everything, you are so strong. Recovery is worth it, and YOU are worth it. ❤",
      "created_utc": 1610356855.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gisscuw",
      "author": "K_Dagger",
      "body": "Thank you for your kindness. \n\n\nI guess I view it as, I hope that one day it is easy and just fades into the background but if it doesn’t then that’s still okay and I can still conquer it. \n\n\n<3",
      "created_utc": 1610312715.0,
      "score": 11,
      "context": [
        {
          "id": "gismikr",
          "author": "BluePurslane",
          "body": "I love this post.  And I want to give you some hope with this:  *\" I know that I will have to keep working at this for the rest of my life. \"*  Maybe not.  Maybe you won't.  I'm at a place where it's not a daily and hourly struggle.  This *can* become a thing of the past that you don't think about much.",
          "created_utc": 1610309974.0
        }
      ]
    },
    {
      "id": "giuiojb",
      "author": "K_Dagger",
      "body": "Thank you, I wish you all the luck and strength in the world. <3",
      "created_utc": 1610344728.0,
      "score": 4,
      "context": [
        {
          "id": "giu5700",
          "author": "Alllibee",
          "body": "Hell yes. Keep it up, empowering words that I hope I can share my version of one day soon. Best wishes to you <3",
          "created_utc": 1610336671.0
        }
      ]
    },
    {
      "id": "gitpug6",
      "author": "K_Dagger",
      "body": "Don’t apologize. That’s what’s this sub is for. You can absolutely message me. Idk how much help I’ll be but I will try my best to at least tell you my experience :))",
      "created_utc": 1610329027.0,
      "score": 3,
      "context": [
        {
          "id": "gitp94l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610328732.0
        }
      ]
    },
    {
      "id": "giwjnvm",
      "author": "K_Dagger",
      "body": "Thank you <3",
      "created_utc": 1610385801.0,
      "score": 1,
      "context": [
        {
          "id": "giuz1pz",
          "author": "bitch_interrupted",
          "body": "So so proud of you! Good luck with everything, you are so strong. Recovery is worth it, and YOU are worth it. ❤",
          "created_utc": 1610356855.0
        }
      ]
    }
  ]
}