{
  "id": "kvh9dk",
  "subreddit": "fuckeatingdisorders",
  "author": "fricken_noodle_soup",
  "created_utc": 1610415114.0,
  "title": "about beauty",
  "selftext": "i find in a lot of ED recovery places, there’s a lot of talk about “you don’t need to be thin to be beautiful”, “stretch marks are still beautiful”, “soft tummies/big thighs are beautiful”. i agree, you absolutely don’t need to be thin to be beautiful. but it’s worth it to think about why we equate beauty to worth. why do these features have to be considered “beautiful” just to be good, normal features? why does my stomach have to be considered beautiful if it’s just a part of my body that helps keep me alive? a lot of people don’t find their bodies beautiful and a lot never will, but that doesn’t mean recovery is hopeless for them, because recovery isn’t about being beautiful. and i honestly hate how the body positivity movement has been co-opted into that.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kvh9dk/about_beauty/",
  "score": 155,
  "num_comments": 15,
  "comments": [
    {
      "id": "giyay5n",
      "author": "ConfidentStrength999",
      "body": "I completely agree. I’d recommend looking up info about the body neutrality movement, which is much more in line with the logic you’re describing - a movement trying to shift away from the need to be beautiful at all, or to ascribe so much value to traits like beauty. Personally I think that’s a much more logical and helpful way of thinking than trying to convince myself that every part of the way I look is beautiful.",
      "created_utc": 1610415731.0,
      "score": 53,
      "context": []
    },
    {
      "id": "giyfsc0",
      "author": "None",
      "body": "I don't really have a problem with the idea that having stretch marks or a pooch can be beautiful.  What bugs me more is the idea that all eating disorders are about poor body image.  For some people they are, and I don't want to invalidate that, but EDs can happen for all sorts of reasons and just like any other mental illness need specific, individualized treatment, not sappy platitudes.\n\nAlso, as someone who is genetically predetermined to have more of a \"boyish\" body shape I really dislike the whole \"real women have curves\" movement.  Actually, when you think about it the idea that you have to have the curves of a Kardashian to be a real woman is pretty transphobic, and probably ableist as well.  I really prefer the idea that body size doesn't matter, taking care of your health as best you can does.",
      "created_utc": 1610418179.0,
      "score": 36,
      "context": []
    },
    {
      "id": "giyf70c",
      "author": "momunist",
      "body": "I completely agree. I honest to god wish instead of body positivity, we had a body acceptance movement or body respect movement instead. It’s a much more achievable goal for a lot of people.",
      "created_utc": 1610417885.0,
      "score": 14,
      "context": []
    },
    {
      "id": "giyo0mx",
      "author": "Oblique_Ocean",
      "body": "\"Beautiful\" is just a very ambiguous word that is overrated and overused nowadays, to a point that I don't even know what it means anymore, especially when people use it to describe human bodies.\n\nI also think people feel some level of pride/powder when they use the word \"beautiful\" to describe things - as if they think they have this special ability to view things differently, thus are better humans than others or something.",
      "created_utc": 1610422276.0,
      "score": 9,
      "context": []
    },
    {
      "id": "giz2x2w",
      "author": "aubbzz",
      "body": "Love this. I have a hard time celebrating my “beautiful” body because it’s just not. But I can accept that it’s just not and learn to live with it. Saying I have a beautiful body that is truly very overweight just feels very condescending and a lie.",
      "created_utc": 1610431184.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gizadiw",
      "author": "Avalolo",
      "body": "I hate the idea of EDs being about beauty. Mine’s about a couple of things but a big factor is actually making myself as sexually unappealing as possible.\n\nHere’s my take: people who feel like their EDs are about beauty are actually suffering a much deeper problem that the ED masks by telling you it’s about beauty. Convenient excuse, given the societal beauty standard. I don’t know, maybe I’m wrong but it makes a lot of sense to me. Nobody kills themselves in the name of beauty. Maybe instead, a desperate need to feel loved or accepted.",
      "created_utc": 1610437370.0,
      "score": 7,
      "context": []
    },
    {
      "id": "giz9yz3",
      "author": "tinypawslilwhiskers",
      "body": "I so agree with this. Beauty to me isn't associated with things I necessarily care to apply to my entire self. That is, I don't want to be defined by it. I want to like myself, no matter what form it is in. And I want to be honest with myself about how it looks. Not overly critical, but not blind to the truth either.",
      "created_utc": 1610436998.0,
      "score": 5,
      "context": []
    },
    {
      "id": "giz4f2e",
      "author": "None",
      "body": "I totally agree with your thought process! Becoming body-neutral was really helpful to me, especially since I came down with several rare diseases/chronic illnesses as I got older. Not being able to do the things I want with my body really changed my attitude about it, in a good way overall. I focus on how my body feels (pain/no pain, tight or sore vs relaxed) and whether I'm able to get up and do what I want to do. Whether I'm beautiful is pretty low on the priority list right now. \n\nAlso, I think it's important to acknowledge that not all people are equally beautiful, and that's ok. I dont' have to be beautiful to deserve human rights, or to be treated with respect. Idk I have a lot of thoughts about this and I don't want to write an essay, but I think you're on to something.",
      "created_utc": 1610432287.0,
      "score": 6,
      "context": []
    },
    {
      "id": "giz1jfq",
      "author": "hellhellhellhell",
      "body": "God THIS. This is part of the reason that body/fat positivity has always rubbed me the wrong way.",
      "created_utc": 1610430201.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gizpbtb",
      "author": "internerderner2",
      "body": "That's one of the reasons I dislike the \"body positivity\" movement. I see all these people who are \"recovered\" or \"in recovery\" whose profiles are basically just countless body pics. I respect that if that's what helps them, but I personally believe that recovery should be about shifting your focus away from food and body issues entirely. \n\nThis honestly holds true for the \"fat acceptance\" movement as well - again, it's absolutely great that you feel confident in whatever appearance or body size you have and you can live your recovery however you want but I don't know, equating yourself with your body or your looks just strikes me as a little bit problematic and a little bit too similar to what so many people with EDs do.\n\nAnd yeah, you don't need to be \"beautiful\" to have a good life. I am quite ugly honestly. I know that, everyone knows that, and it's okay. I can get by without being told or convincing myself that I'm attractive.",
      "created_utc": 1610452171.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gj119fq",
      "author": "vangoghwiththeflow",
      "body": "Yes. I think I made huge steps in my recovery when I started thinking about this! My stretch marks are not “beautiful”, if I don’t wear my retainer, I have a tooth that moves out of place and that is not “beautiful”, my acne is not “beautiful”. \nBut!! They’re still my body. I don’t need to find something beautiful in order to not hate it. THAT is the sort of black-and-white, rigid thinking that honestly got me into a really bad spot. Not everyone will find me beautiful and that is OK! My acne is there. If I cover it with makeup, fine. If I don’t, whatever. I don’t think true body-neutrality is the answer. But I’m aware of the fact that I’m not going to like absolutely every single piece of my body. I like my eyes! I like my smile! I am not more or less deserving of self-respect based off of what is “beautiful” or what isn’t.",
      "created_utc": 1610477988.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gizdnrc",
      "author": "None",
      "body": "honestly this focus on beauty just makes me feel worse because I will never feel this way, I would be happy with just body neutrality. \n\nI am not conventionally attractive, and I would rather not delude myself into believing I am as beautiful as a runway model, but that should not make me any less worthy of respect.",
      "created_utc": 1610440515.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gizrfhp",
      "author": "None",
      "body": "I couldn’t agree with this more. Far too much focus is placed on how bodies look, especially for girls. I don’t have an ED (my little sister I look after does), but I’ve found that one of the great things about getting older is that less focus is placed on how you look aesthetically. This is especially the case since I’ve got pregnant; there’s a lot less social pressure to look ‘beautiful’ and instead people focus on how you are producing/have produced a human, which is an amazing feat. It almost like as you get older and go through stages of life, people no longer focus on your outer beauty, but instead also look at what you’ve accomplished. It’s just sad that that same perspective isn’t used for young girls too.",
      "created_utc": 1610454022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gj11x06",
      "author": "5foot3",
      "body": "Here's the kicker... the longer you are in recovery, the easier this mindset becomes. It takes work, and strength, and grit - but once I stopped fighting myself it was so easy. It seems impossible until one day it's not so unimaginable. Then one day you have body positive thoughts that are so good they startle you... and then one day you might realize you can hardly remember what it was like to hate yourself so much.",
      "created_utc": 1610478286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gizht7q",
      "author": "None",
      "body": "Maybe for some people with EDs it is about beauty, I don't know.  I feel ya though, I hate it when people who don't have EDs claim it's all about wanting to look like a model. They trivialize mental illness because they want to be the hero who tells the anorexic girl she's beautiful and she magically recovers and lives happily ever after.",
      "created_utc": 1610444705.0,
      "score": 3,
      "context": [
        {
          "id": "gizadiw",
          "author": "Avalolo",
          "body": "I hate the idea of EDs being about beauty. Mine’s about a couple of things but a big factor is actually making myself as sexually unappealing as possible.\n\nHere’s my take: people who feel like their EDs are about beauty are actually suffering a much deeper problem that the ED masks by telling you it’s about beauty. Convenient excuse, given the societal beauty standard. I don’t know, maybe I’m wrong but it makes a lot of sense to me. Nobody kills themselves in the name of beauty. Maybe instead, a desperate need to feel loved or accepted.",
          "created_utc": 1610437370.0
        }
      ]
    }
  ]
}