{
  "id": "kyoh88",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1610822187.0,
  "title": "I overreacted to a triggering comment and now I realise how fragile my recovery mindset is :/",
  "selftext": "decided to do an experiment today and went the whole day without snacking. my ED brain tells me 3 meals (in recovery) is all I need, but my 3 meals are pretty small so I need to eat between meals to keep my energy up. today was to prove once and for all that snacks actually are necessary because I have felt pretty weak and low in energy all day. \n\nso about half an hour ago I decided to get a snack because I realised mum was making dinner and it would still be a while (even though me and my therapist have decided to have designated food times of 10am, 2pm and 6pm). my dad left the room while I was making it and then they called to me from the kitchen and said not to ruin my appetite just before dinner.\n\nfuck.\n\nso that's proof that they talked about my eating behind my back, they have judged me for having a snack. they didn't think me having a snack was necessary so close to dinner time. but I feel so weak! I just feel so ashamed right now. my mind is going crazy about how I shouldn't have had it, I should have just waited. they think I'm weak-willed and have no self control. I'm angry too because I TOLD them I wanted to make my own meals so I can stick to the schedule and have dinner at 6. no. they took that away from me and judged me for having a snack.\n\nI know I'm overreacting to a tiny, inconsequential comment. I have realised my recovery is actually a lot more fragile than I imagined and thats such a frightening and depressing reality.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/kyoh88/i_overreacted_to_a_triggering_comment_and_now_i/",
  "score": 94,
  "num_comments": 6,
  "comments": [
    {
      "id": "gjhq69l",
      "author": "MentallyFuckedBerry",
      "body": "It’s alright. Now you know what you have to work on/build up. I can say I’m 99% sure your parents did not mean that in a rude way. I’ve heard my parents say that to eachother and myself a lot. It’s a very common comment. But I understand why it is hurtful to you, and now I think you should sit down with your parents if they are aware of your ED and recovery, and explain to them that comments about your eating are hurtful.\n\nKeep going, friend. I’m proud of you.",
      "created_utc": 1610823791.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gjit2b8",
      "author": "CelestialWolfMoon",
      "body": "I’m sorry that your parents made that inconsiderate comment.  I know that it really sucks to get triggered by off-handed comments about your eating habits, especially if you’re early into recovery.  Have you said anything to them about it?  If not, you should probably explain to them that it’s not helpful to make comments like that.",
      "created_utc": 1610842402.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gjix7d7",
      "author": "throwaway-m1",
      "body": "It’s good that you can recognize when your ED brain is overreacting. But also, even though it’s seen as a normal thing to do and I’m sure they have good intentions, it’s not okay for people to comment on and police what you chose to eat in recovery. I would be upset if this happened, too - and I’m a year and a half into recovery! I’ve worked so hard to get to a point where I can eat whatever I want, and if someone says “don’t eat that” I’d freak out a little bit (though everyone in my family also knows better at this point). \n\nIt’s also awesome that you decided to have a snack. That’s a huge accomplishment!!",
      "created_utc": 1610844588.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjjd68y",
      "author": "chlamydiakoalaa",
      "body": "Ive been in recovery for quite a few years and I know exactly how you feel as my mom makes these comments often as well. Today she even made a similar comment and it still triggers me so badly. Just know that you know your body best, nobody knows what’s best for you better than you. You were absolutely right to eat if you felt faint, you shouldn’t have to justify eating at anytime to anyone! Please know that it’s totally normal to feel triggered by a comment like that and please don’t let it set you back. You got this!",
      "created_utc": 1610853216.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjm0l6e",
      "author": "twerkingslutbee",
      "body": "I remember back in 2013 how one inconvenience sent me on a 7 year spiral where I still deal with the fall out. It’s terrifying to always live life on eggshells knowing something small is what your life is dependent on",
      "created_utc": 1610901168.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjnjnj7",
      "author": "None",
      "body": "that's what makes it so scary! knowing that inevitable, small comments could send me spiraling. I suppose that's what recovery is about though, learning to cope with them and moving on. Good luck with you recovery x",
      "created_utc": 1610920686.0,
      "score": 1,
      "context": [
        {
          "id": "gjm0l6e",
          "author": "twerkingslutbee",
          "body": "I remember back in 2013 how one inconvenience sent me on a 7 year spiral where I still deal with the fall out. It’s terrifying to always live life on eggshells knowing something small is what your life is dependent on",
          "created_utc": 1610901168.0
        }
      ]
    }
  ]
}