{
  "id": "l1xu0b",
  "subreddit": "fuckeatingdisorders",
  "author": "edsarebs",
  "created_utc": 1611233418.0,
  "title": "I hate how sensitive my ED has made me.",
  "selftext": "Food is everywhere and even now that I'm trying to recover everything triggers me.\n\nToday our attendance question in homeroom was \"What did you eat for breakfast this morning?\" I hadn't eaten breakfast yet (but I am going to), but I also didn't want to reply \"nothing\" because I was afraid of giving someone the wrong idea, so I ended up writing way more than everyone else explaining that I would be eating later.\n\nIn health class my health teacher went on a tangent about amenorrhea and how it caused stress fractures and it made me feel absolutely terrible. He meant no harm but it reminded me everything wrong with me.\n\nI work at a grocery store and customers will constantly complain about their weight or make comments on what they're buying. I can't really do anything except smile and nod, but sometimes when they comment on something I normally eat, I won't be able to eat it for a few days because it seems like they're criticizing my diet as well as theirs.\n\nIt's just a constant barrage of things I never thought about before, but that now have the capability to ruin my day",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l1xu0b/i_hate_how_sensitive_my_ed_has_made_me/",
  "score": 98,
  "num_comments": 4,
  "comments": [
    {
      "id": "gk24pjy",
      "author": "wingedwrists",
      "body": "Just wanted to say I am sorry you’re going through this. \n\nIt’s not really possible to change how we feel when someone says something or a triggering thing happens.\n\nBut wrt not eating foods because they’ve been put down, that sounds like something you could maybe isolate and try to ‘challenge’ piecemeal - if you wanted to.",
      "created_utc": 1611236110.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gk4vnen",
      "author": "doodledoo5822",
      "body": "GOD I remember how rough that was when I was in that phase of eating disorder recovery-- food is SO engrained in our culture! I remember feeling like it was inescapable to be triggered, and it felt totally out of control... which then made me want to do more eating disorder behaviors. It was a rough cycle.\n\nI promise, if you're on a general trajectory of recovery, it goes away over time. I'm recovered from an eating disorder and I don't get triggered by food mentions at all anymore. But I remember weeks at a time feeling ruined by casual comments about food that the average person wouldn't think twice about. It sounds especially tough for you working at a grocery store!! But as long as you're generally headed in a recovery-ish direction, it'll go away over time. Wishing you as much peace as you can have in the meantime! <3",
      "created_utc": 1611284145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gk3knk1",
      "author": "edsarebs",
      "body": "Yeah, I have been trying to go against it it's just not very fun. And thank you!!",
      "created_utc": 1611260484.0,
      "score": 6,
      "context": [
        {
          "id": "gk24pjy",
          "author": "wingedwrists",
          "body": "Just wanted to say I am sorry you’re going through this. \n\nIt’s not really possible to change how we feel when someone says something or a triggering thing happens.\n\nBut wrt not eating foods because they’ve been put down, that sounds like something you could maybe isolate and try to ‘challenge’ piecemeal - if you wanted to.",
          "created_utc": 1611236110.0
        }
      ]
    },
    {
      "id": "gk64r3n",
      "author": "edsarebs",
      "body": "Thank you!",
      "created_utc": 1611319396.0,
      "score": 1,
      "context": [
        {
          "id": "gk4vnen",
          "author": "doodledoo5822",
          "body": "GOD I remember how rough that was when I was in that phase of eating disorder recovery-- food is SO engrained in our culture! I remember feeling like it was inescapable to be triggered, and it felt totally out of control... which then made me want to do more eating disorder behaviors. It was a rough cycle.\n\nI promise, if you're on a general trajectory of recovery, it goes away over time. I'm recovered from an eating disorder and I don't get triggered by food mentions at all anymore. But I remember weeks at a time feeling ruined by casual comments about food that the average person wouldn't think twice about. It sounds especially tough for you working at a grocery store!! But as long as you're generally headed in a recovery-ish direction, it'll go away over time. Wishing you as much peace as you can have in the meantime! <3",
          "created_utc": 1611284145.0
        }
      ]
    }
  ]
}