{
  "id": "l2m4ol",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1611316123.0,
  "title": "Hot take: comments like \"I wish I could do that\" aren't helpful",
  "selftext": "A big part of eating disorders is feeling \"not sick enough\", and even when we are mostly recovered or actively in recovery, those feelings can creep in.\n\nI hate it when I or someone else posts a win or celebrates their progress, a success, whatever, and the reactions are: \"Congrats! I can't do that, but it's great that you can.\" \"I could never do that but I'm so happy for you!\" \"I hope I can do that one day too...\"\n\nI don't know. I know it's meant to be positive... but it doesn't come off that way. It feels like my success is turned into another's validation of their sickness, and I feel like, huh, did I really have an eating disorder if I could do this thing, but this person *couldn't*? Was I truly ever sick?\n\nI know it's meant to be positive and I absolutely do not think they're meant to be harmful, but they do feel kind of... unhelpful. Once you are aware of your sickness, it is up to you to eat. You can't choose to not have ED thoughts, but you can choose to act against them. It's very hard, but at the very least, I wish people wouldn't respond in that defeatist way to others' successes.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l2m4ol/hot_take_comments_like_i_wish_i_could_do_that/",
  "score": 181,
  "num_comments": 9,
  "comments": [
    {
      "id": "gk61zvt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611317221.0,
      "score": 66,
      "context": []
    },
    {
      "id": "gk67blz",
      "author": "cherry_tsukuyomi",
      "body": "I’m so glad I’m not the only one who felt this way. I seek out posts about people’s recovery wins because I have nothing else to motivate me. When I see those comments I feel awful about my own progress and I genuinely worry about how the OP is processing it. \n\nRecovery can be a fragile thing that we need to help uphold and protect for others too.",
      "created_utc": 1611321174.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gk6ljwd",
      "author": "redtopiary",
      "body": "I've never really understood the intention behind those comments either. Imagine doing that if you heard that someone got a job after months of struggling with unemployment. \"Oh, you got a job? Congratulations! If only I could have a job right now.\" It shifts the conversation back towards yourself and almost comes across as passive aggressive. But I realize that with EDs we are constantly comparing ourselves to others for validation in regards to how sick we are. I don't even realize I'm doing it half the time.",
      "created_utc": 1611326992.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gk6p579",
      "author": "lillynight",
      "body": "Everything about this is so true, I really don’t think most commenters mean to be rude when they post things like that, but it ends up sounding really weird. I personally don’t even look much at recovery stuff rn because I feel jealous that they’re doing okay, and I don’t want to be rude to someone through my stupid ED brain.",
      "created_utc": 1611328167.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gk8poz8",
      "author": "throwaway-m1",
      "body": "This is a great point. \n\nI feel like maybe instead people could say something like “this really inspires me to move forward in my recovery!” Or “yay!! This is one of my recovery goals!”. Just keep it positive, and make people feel like it’s a good thing that they shared.",
      "created_utc": 1611350605.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gk9y04f",
      "author": "y2kcasualty",
      "body": "I agree, being on the receiving end of that feels shitty.\n\nI also get where people are coming from though. We're all in pain, most of us have that sense of competitiveness, and when you see others doing \"better\" than you it's really hard to sit with that discomfort. A lot of people also don't see that they're making it about themselves even though it might seem obvious.\n\nDoesn't excuse the shitty behavior, but remembering this and trying to have compassion has made it easier for me to tolerate receiving comments like that.",
      "created_utc": 1611366523.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gk7aoj5",
      "author": "Janawa",
      "body": "I agree that the first two comments saying \"I could never do that\" are competitive, but the last example of \"i hope to do that one day\" or other variations like \"I cant wait to get there\" are not competitive, but the person looking forward to recovery when they are in a stage that it might not be possible.  I say variations of \"I hope to do that some day\" because I have no options for recovery right now, as no therapists are taking me in or anything.",
      "created_utc": 1611334633.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gk6wadi",
      "author": "hydrowifehydrokids",
      "body": "Maybe, but it can also be them feeling defensive and trying to justify why they aren't recovering. People said that to me when I quit drinking years ago too. Lots of \"oh I could never do that, but good on you,\" or when I worked out \"I wish I could go to the gym, but I don't have the time.\" \n\nIt might be them humble bragging about their restriction, but it might also be a defensive thing because they KNOW they should recover too",
      "created_utc": 1611330330.0,
      "score": 21,
      "context": [
        {
          "id": "gk61zvt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611317221.0
        }
      ]
    },
    {
      "id": "gk98huu",
      "author": "5foot3",
      "body": "I see it a little differently now that I’m recovered. I remember what it felt like to think it was impossible and now that I’m on the other side of it, I see it is possible. It feels like a duty and an honor of being recovered to provide insight and hope. My competitiveness about my eating disorder mostly went away with recovery, so I’m sure that’s a big part of why I feel that way.",
      "created_utc": 1611357021.0,
      "score": 3,
      "context": [
        {
          "id": "gk6ljwd",
          "author": "redtopiary",
          "body": "I've never really understood the intention behind those comments either. Imagine doing that if you heard that someone got a job after months of struggling with unemployment. \"Oh, you got a job? Congratulations! If only I could have a job right now.\" It shifts the conversation back towards yourself and almost comes across as passive aggressive. But I realize that with EDs we are constantly comparing ourselves to others for validation in regards to how sick we are. I don't even realize I'm doing it half the time.",
          "created_utc": 1611326992.0
        }
      ]
    },
    {
      "id": "gk805yx",
      "author": "None",
      "body": "That could also be it. I quit smoking about a year ago and when I told acquaintances that I quit they did get quite defensive.",
      "created_utc": 1611342053.0,
      "score": 3,
      "context": [
        {
          "id": "gk61zvt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611317221.0
        },
        {
          "id": "gk6wadi",
          "author": "hydrowifehydrokids",
          "body": "Maybe, but it can also be them feeling defensive and trying to justify why they aren't recovering. People said that to me when I quit drinking years ago too. Lots of \"oh I could never do that, but good on you,\" or when I worked out \"I wish I could go to the gym, but I don't have the time.\" \n\nIt might be them humble bragging about their restriction, but it might also be a defensive thing because they KNOW they should recover too",
          "created_utc": 1611330330.0
        }
      ]
    }
  ]
}