{
  "id": "l5g56f",
  "subreddit": "fuckeatingdisorders",
  "author": "throwawaygrandmadog",
  "created_utc": 1611674614.0,
  "title": "Fat logic is litterally so hateful its ridiculous",
  "selftext": "Here's the thing.. yes there are health risks that come with being overweight. Yes, there is a science behind weight gain and loss. \n\nBut thats not all this is, is it? People complain that hate is being thrown their way, or even that violence is being done against them, and these people are so quick to call it lies.. wat? This whole group is dedicated to basically making fun of fat people, and yet you are shocked that there are people out there being shitty to fat people? Really?\n\nThey disregard anything that doesn't line up with the narrative they are trying to present. Someone was saying they had pain BEFORE gaining weight, and that they wanted the doctors to actually test to figure out what was causing the pain and not just blame it on weight and let that be the end of it. Guess what they did? Blamed it on her weight. Despite it being present *before* she gained it. The mental gymnastics of \"oh, she just have been fat BEFORE and then gained more weight\" or whatever other reasons they spout, they have to make assumptions like that to support their narrative. (btw, people just blaming fat peoples health struggles on them being fat is a huge issue that can litterally kill, but considering the sheer amount of hate in that subreddit I litterally dont think these people would care/genuinly feel they would still blame the overweight individual somehow) \n\nAlso, some of the posts are just like \"I deserve to feel beautiful\" and people are getting hated only! Holy shit. You can't tell me that wanting people to not feel beautiful is in any way trying to \"help\" them. \n\nAnd here's the thing, I wouldn't be writing this if they just said what they are. But they dont. They need to pretend they are intelligent, they need to beleive that have the moral high ground. They aren't and they don't, its litterally just hateful garbage.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l5g56f/fat_logic_is_litterally_so_hateful_its_ridiculous/",
  "score": 103,
  "num_comments": 11,
  "comments": [
    {
      "id": "gkujuei",
      "author": "None",
      "body": "A lot of people in that subreddit also rely on shaky logic, stereotypes and cherry-picking to make their points. It’s gross.",
      "created_utc": 1611684192.0,
      "score": 51,
      "context": []
    },
    {
      "id": "gkvcza6",
      "author": "Naughty_moose92",
      "body": "I think its the same thing as abortion or any other medical situation, being fat isn't anyone else's business. Idk why people get so personally offended by others bodies.",
      "created_utc": 1611696007.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gku09ca",
      "author": "indignan",
      "body": "Agreed with all of this! During the worst of my ED I used fat logic as my motivation to restrict. It infuriates me now",
      "created_utc": 1611675760.0,
      "score": 40,
      "context": []
    },
    {
      "id": "gkw9ew5",
      "author": "CelestialWolfMoon",
      "body": "I feel like most people just use that sub to trigger themselves or project their own grievances about their weight or former weight.",
      "created_utc": 1611710891.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gky6q00",
      "author": "confusedtired",
      "body": "Yup I use that sub at ED fuel",
      "created_utc": 1611757115.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkyjlwb",
      "author": "tkdaw",
      "body": "That sub has, ironically, been one of my biggest sources of support during recovery. It's got a fair share of hateful idiots, yes, but it's also got a pretty great community of people who are just trying to figure out how to best integrate diet and exercise for *health* when mental health issues make IE unrealistic. I didn't start exercising to control my weight. My ED and exercise habits were separate, and figuring out a healthy balance has been challenging but rewarding.",
      "created_utc": 1611762084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkwkxat",
      "author": "None",
      "body": ">shaky logic, stereotypes and cherry-picking \n\nI feel like this pattern crops up a lot with certain types of people",
      "created_utc": 1611716622.0,
      "score": 6,
      "context": [
        {
          "id": "gkujuei",
          "author": "None",
          "body": "A lot of people in that subreddit also rely on shaky logic, stereotypes and cherry-picking to make their points. It’s gross.",
          "created_utc": 1611684192.0
        }
      ]
    },
    {
      "id": "gkvgku6",
      "author": "None",
      "body": "and they always lose their shit over posts that are obvious jokes/satire/hyperbole",
      "created_utc": 1611697485.0,
      "score": 11,
      "context": [
        {
          "id": "gkujuei",
          "author": "None",
          "body": "A lot of people in that subreddit also rely on shaky logic, stereotypes and cherry-picking to make their points. It’s gross.",
          "created_utc": 1611684192.0
        }
      ]
    },
    {
      "id": "gkw5ljt",
      "author": "radicalvenus",
      "body": "It's because it is other people who have eating disorders or people who are fat but \"not like these other fatties\". It's a gross circle jerk of hate because they're afraid of becoming what they think is the most disgusting/morally repugnant thing they could become and that's fat",
      "created_utc": 1611708995.0,
      "score": 8,
      "context": [
        {
          "id": "gkvcza6",
          "author": "Naughty_moose92",
          "body": "I think its the same thing as abortion or any other medical situation, being fat isn't anyone else's business. Idk why people get so personally offended by others bodies.",
          "created_utc": 1611696007.0
        }
      ]
    },
    {
      "id": "gkwfunq",
      "author": "throwaway-m1",
      "body": "Right!! There’s no subreddit for making fun of the “logic” of smokers, thin people who eat like shit, people who stay up all night and overwork themselves. It’s just fatphobia plain and simple.",
      "created_utc": 1611714087.0,
      "score": 6,
      "context": [
        {
          "id": "gkvcza6",
          "author": "Naughty_moose92",
          "body": "I think its the same thing as abortion or any other medical situation, being fat isn't anyone else's business. Idk why people get so personally offended by others bodies.",
          "created_utc": 1611696007.0
        }
      ]
    },
    {
      "id": "gkutw45",
      "author": "None",
      "body": "Me too, it's free meanspo",
      "created_utc": 1611688331.0,
      "score": 19,
      "context": [
        {
          "id": "gku09ca",
          "author": "indignan",
          "body": "Agreed with all of this! During the worst of my ED I used fat logic as my motivation to restrict. It infuriates me now",
          "created_utc": 1611675760.0
        }
      ]
    }
  ]
}