{
  "id": "l5rmcw",
  "subreddit": "fuckeatingdisorders",
  "author": "mystarinthesky",
  "created_utc": 1611706427.0,
  "title": "you know what, i think im ready to recover.",
  "selftext": "or to try, at least.\n\nhad a painful day, and just had an awful binge and i am very uncomfortable, physically, but i know it will pass, and more importantly i don't want to keep doing this, i don't want to keep fighting my body to try to lose weight for god knows what reason. i use my ED to distract myself from addressing whatever's really going on in my head, and i'm tired of it. i'm 17, i already lost a good portion of my teenage years to this pain and i'm ready to move on, or to try to.\n\nand i'm so scared because so much of what i've done lately has been to try to avoid getting help. i've been in and out of treatment for a couple years, two residental stays, a lot of inpatient, and things have gotten a lot better in some ways (not really due to the treatment), and things can continue to improve, i know they can.\n\nso i'm done. i'm going to write a note to my mom, and i'm going to see a dietician again, and i'm going to face my fears head-on and try recovery, because i haven't given it a good, honest try, and i am capable.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l5rmcw/you_know_what_i_think_im_ready_to_recover/",
  "score": 100,
  "num_comments": 7,
  "comments": [
    {
      "id": "gkw1d0n",
      "author": "new-freckle",
      "body": "so proud of you 💕💕 remember this feeling. it'll be a difficult road but it's really worth it. we're rooting for you.",
      "created_utc": 1611706931.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gkw2n4w",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611707551.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gkwn8s6",
      "author": "alliebbb",
      "body": "Yesss! Reread this post whenever you feel urge to go back to your ED ❤️you got this OP",
      "created_utc": 1611717815.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gkx9ksy",
      "author": "witchystoneyslutty",
      "body": "Hang in there! Today is my 15th day not counting calories, and I’ve been making myself eat enough. Honestly...I feel so much better. Hang in there, you can do this!!! 🖤",
      "created_utc": 1611732213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkxkzix",
      "author": "Top-Ad6302",
      "body": "I'm currently in recovery and I PROMISE you that every struggle you will face is truly worth it, because you'll get your life back.",
      "created_utc": 1611742387.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkxxft7",
      "author": "bitch_interrupted",
      "body": "You can do this!! So so proud of you, staying motivated is the hardest part but you've got this ❤",
      "created_utc": 1611751996.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkw481x",
      "author": "mystarinthesky",
      "body": "thank you so much <3",
      "created_utc": 1611708316.0,
      "score": 5,
      "context": [
        {
          "id": "gkw1d0n",
          "author": "new-freckle",
          "body": "so proud of you 💕💕 remember this feeling. it'll be a difficult road but it's really worth it. we're rooting for you.",
          "created_utc": 1611706931.0
        }
      ]
    },
    {
      "id": "gkw49uh",
      "author": "mystarinthesky",
      "body": "thank you! yeah i know i'll eat tomorrow but i'll probably feel the urge to restrict in little ways.. i'll do my best though.",
      "created_utc": 1611708340.0,
      "score": 5,
      "context": [
        {
          "id": "gkw2n4w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611707551.0
        }
      ]
    }
  ]
}