{
  "id": "l6o143",
  "subreddit": "fuckeatingdisorders",
  "author": "Toehaha",
  "created_utc": 1611808388.0,
  "title": "This is gonna sound really weird, but does anyone else sometimes feel like they don’t wanna let go of their ED cuz it’s such a big part of them and almost wear it as a badge of pride?",
  "selftext": "Like I logically know I have an issue and I know the science behind it, but I just can’t seem to apply it to myself, like I’m such a hypocrite.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l6o143/this_is_gonna_sound_really_weird_but_does_anyone/",
  "score": 160,
  "num_comments": 13,
  "comments": [
    {
      "id": "gl20uot",
      "author": "new-freckle",
      "body": "yeah. i think for me it's the pride in being so self-disciplined and taking it all in silence. that's why when i realized it was destroying me, asking for help was the hardest thing.",
      "created_utc": 1611813429.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gl31sya",
      "author": "None",
      "body": "Felt this way. No longer do. When you let go of disordered eating as part of your identity you create room for a whole lot more. The relationships and hobbies I spend my time on a are 100x as fulfilling",
      "created_utc": 1611840390.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gl2np21",
      "author": "blondiesdiary",
      "body": "So not weird.  It’s safety.",
      "created_utc": 1611831438.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gl4n49j",
      "author": "None",
      "body": "I didn’t feel this for my ED, but I had this exact feeling with my drug and alcohol addiction. I knew alcohol/opiates were going to kill me but I couldn’t let go of them partially because I identified myself as an addict and it was part of my identity. I was never able to recover from either until I was able to let go of this idea that somehow the drugs I was doing defined me as a person which is why AA and similar 12 step based programs never worked for me. I had to let go of who I WAS to become the person I was meant to BE. This is kind of tricky doing it on your own though but I had help from a fanatic mental health professional as well as a group of really supportive friends.\n\nWhile I don’t identify with my ED I do identify myself as being thin and “wispy” for a boy which did make ED recovery a challenge but Ive been constantly reminding myself and doing affirmations so I know that my body does not define me, and Ive learned that it is merely a flesh suit that lets me experience consciousness.",
      "created_utc": 1611859677.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gl1t7gx",
      "author": "violinlili",
      "body": "Totally",
      "created_utc": 1611808964.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gl459xk",
      "author": "honeycakies",
      "body": "I used to think this way in the past, but then I realized that being anorexic was such a meaningless \"accomplishment\" compared to my friends' actual life achievements in school, work, etc. I'm a lot more proud of what I did in recovery than when I was just existing in a skinny body and doing literally nothing else.",
      "created_utc": 1611852743.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl2fhnw",
      "author": "None",
      "body": "same!! like it just make me feel so disgustingly 🥴superior 🥴to everyone else",
      "created_utc": 1611824484.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gl4t5eu",
      "author": "crymeacoffeetable",
      "body": "I can’t imagine making myself comfortable with food. I’ve had to survive in discomfort for so long that giving it up for comfort at this point feels wrong and I don’t know how to cope with feeling badly and also not feeling badly. If that makes any sense.",
      "created_utc": 1611861908.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl3g6v8",
      "author": "pinata_buck",
      "body": "thanks for the glimpse of hope friend :) btw looove your username !",
      "created_utc": 1611845289.0,
      "score": 6,
      "context": [
        {
          "id": "gl31sya",
          "author": "None",
          "body": "Felt this way. No longer do. When you let go of disordered eating as part of your identity you create room for a whole lot more. The relationships and hobbies I spend my time on a are 100x as fulfilling",
          "created_utc": 1611840390.0
        }
      ]
    },
    {
      "id": "gl2zco6",
      "author": "Wrencer4Endgame",
      "body": "Yeah : // it makes me feel safe and I use it as a (shitty) coping mechanism",
      "created_utc": 1611839270.0,
      "score": 4,
      "context": [
        {
          "id": "gl2np21",
          "author": "blondiesdiary",
          "body": "So not weird.  It’s safety.",
          "created_utc": 1611831438.0
        }
      ]
    },
    {
      "id": "glp3qs3",
      "author": "thanksfortalking",
      "body": "This is true, and probably helpful for some. But for some people who have had an ED for a long time, wow is that depressing.",
      "created_utc": 1612242385.0,
      "score": 1,
      "context": [
        {
          "id": "gl459xk",
          "author": "honeycakies",
          "body": "I used to think this way in the past, but then I realized that being anorexic was such a meaningless \"accomplishment\" compared to my friends' actual life achievements in school, work, etc. I'm a lot more proud of what I did in recovery than when I was just existing in a skinny body and doing literally nothing else.",
          "created_utc": 1611852743.0
        }
      ]
    }
  ]
}