{
  "id": "l80uam",
  "subreddit": "fuckeatingdisorders",
  "author": "Imsuchamess4",
  "created_utc": 1611946702.0,
  "title": "My story",
  "selftext": "on January 3rd I went to urgent care to get a covid test. When I got there the nurse took me over to the scale. I was wearing a huge sweatshirt and sweatpants to hide my body so I said to her “beware the number is going to be huge because of my clothes”. The scale read 88 pounds. She did my covid test and took my blood pressure and then brought me a juice box and said I needed to drink the whole thing. I sobbed and tried to refuse telling her I “could not afford the calories”. It was in that moment I realized how sick I really was. The doctor came in 30 minutes later and told me I tested positive for covid. I asked her if I would be okay considering the state my body was in and she said she didn’t know. Everyone told me if I wanted to beat covid I was going to have to eat- A LOT. So that’s what I did. I didn’t count one calorie for the first time in over a year that day. I ate whatever was given to me and just told myself “eat it to beat it”. And guess what? I made it out alive!! If you’re not recovering you are dying. You will NEVER be good enough for your eating disorder. I cannot say I’m recovered at all but for the first time I can say I’m actually in recovery. I haven’t started putting on weight yet which just goes to show how irrational our thoughts around food are. I know my body cannot function at this weight and it’s going to have to happen and I will not give up when it does. Beat this ugly ass illness please.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l80uam/my_story/",
  "score": 205,
  "num_comments": 10,
  "comments": [
    {
      "id": "gl9wkwb",
      "author": "etisfather",
      "body": "that’s amazing, i’m so proud of you!! i’m currently in recovery as well and it’s so hard. i’ve been very close to relapsing due to those irrational thoughts that the ed pumps to us. thank you for posting this, it’s exactly what i needed to hear to get back on track. it’s like i was meant to read it haha. good luck with your recovery, you’re gonna kill it <3",
      "created_utc": 1611947240.0,
      "score": 35,
      "context": []
    },
    {
      "id": "gla83qt",
      "author": "tinylil",
      "body": "This really affected me even though I’ve been in active recovery for years. It brought back memories of trying to refuse juice to take my pills with in the hospital. I honestly shed a tear. I’m so glad you shared this and I am beyond happy that you kicked covid and are choosing recovery. You got this!",
      "created_utc": 1611951266.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gla9fn4",
      "author": "maegantheepony",
      "body": "“You will never be good enough for your eating disorder”\nNeeded this",
      "created_utc": 1611951729.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gla4dw8",
      "author": "None",
      "body": "This is amazing, you are amazing for choosing recovery!! You’ve got this <3",
      "created_utc": 1611949967.0,
      "score": 12,
      "context": []
    },
    {
      "id": "glavo2x",
      "author": "tinymightybookworm",
      "body": "Honestly I don't know how to explain it but the COVID pandemic put into perspective for me personally just how much giving into my eating disorder thoughts would be unnecessary pain. It's so dangerous, and I would hate to find myself in that situation. I've found myself more grateful and less bothered about weight, because I know that at least I am staying healthy and that I am alive. I don't want to sound like I am making it about me, and I'm really sorry that you have COVID. I just hope that you feel better.\n\nI am wishing you all the very best! I hope that you feel better really soon and take care of yourself. Be kind to yourself and your body during this time. Have you lost your smell or taste? I hope that you can use this time to enjoy food and beat those thoughts. Try new foods and rest! Your body needs it and it's okay!\n\nHonestly the biggest thing that helped me beat my eating disorder was trying new foods that my friend introduced me to. I remind myself how much fun it is to try new things. I hope that you can do that too. Please take care of yourself!",
      "created_utc": 1611960264.0,
      "score": 8,
      "context": []
    },
    {
      "id": "glafugz",
      "author": "missmaddie95",
      "body": "I am SO happy for you, that's incredible(: \n\n&#x200B;\n\nAlso, something I learned recently-your doctor works for YOU. You have the right to decline being weighed. I always tell them \"no,\" when they walk me to the scale and then I provide them with either an estimation or whatever my weight was at my last weigh-in on my terms. It has saved me TONS of anxiety!",
      "created_utc": 1611953906.0,
      "score": 6,
      "context": []
    },
    {
      "id": "glaetym",
      "author": "bitch_interrupted",
      "body": "So proud of you. I'm sorry the motivation to recover had to come from something so scary, but you did amazing ❤",
      "created_utc": 1611953592.0,
      "score": 5,
      "context": []
    },
    {
      "id": "glbj80u",
      "author": "Cheekachar",
      "body": "Congrats. This is amazing to hear. I think there is something powerful to thinking about food as medicine and units of energy. So much of a ED stems from this assignment of food as a bad or immoral thing. This weird twist of the brain where food=bad. In the end its a unit of energy, simple as that. (Hard part is feeling that even when one knows it logically...) It sounds like a big step for you. I hope this can be a gentle, wonderful uphill rise for you. Good luck. You deserve it.",
      "created_utc": 1611971409.0,
      "score": 4,
      "context": []
    },
    {
      "id": "glcjurx",
      "author": "ontopofyourmom",
      "body": "It sounds like quitting smoking after surviving a heart attack! You must be pretty tough to have pulled through.",
      "created_utc": 1611993227.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl9wym7",
      "author": "Imsuchamess4",
      "body": "It’s so far from easy but we HAVE to do this. I’m only a message away and I’m in your corner and so excited to hear about you getting your life back xx",
      "created_utc": 1611947376.0,
      "score": 10,
      "context": [
        {
          "id": "gl9wkwb",
          "author": "etisfather",
          "body": "that’s amazing, i’m so proud of you!! i’m currently in recovery as well and it’s so hard. i’ve been very close to relapsing due to those irrational thoughts that the ed pumps to us. thank you for posting this, it’s exactly what i needed to hear to get back on track. it’s like i was meant to read it haha. good luck with your recovery, you’re gonna kill it <3",
          "created_utc": 1611947240.0
        }
      ]
    }
  ]
}