{
  "id": "l8r84q",
  "subreddit": "fuckeatingdisorders",
  "author": "TheBetterCornlord",
  "created_utc": 1612029150.0,
  "title": "THE POSITIVE EFFECTS OF ALL IN ARE FINALLY STARTING TO KICK IN",
  "selftext": "Today I had one of the best days I've had in ages. I didn't think or plan food or at least barely did. Every time I've went all in before I never got through the constant thinking about food phase and eating everything phase and relapsed every time because of it. This time I kept going no matter what my brain told me. I went all in 2 weeks back (no exercise (I'm wheelchair bound so I have to do at least a little bit but that's so I can keep up my strength to stay independent) or restriction). I've been eating whatever I want and today has been the day where my hard work is showing in my own behaviour and mind. \nI also finally after eating a bunch of yoghurt and granola bowls for dessert every day(like multiple bowls after dinner) finally got sick after eating more than one bowl. My body is finally getting in touch with my cues again. I feel free.\n\nRecovery is hard, but it will be worth it. It took me a long time to get here, but please keep going.\nYou will also be free one day",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l8r84q/the_positive_effects_of_all_in_are_finally/",
  "score": 102,
  "num_comments": 4,
  "comments": [
    {
      "id": "gle7f8w",
      "author": "taoshka",
      "body": "So proud of you for keeping on! Also hi, fellow disabled/ED buddy!",
      "created_utc": 1612032541.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gle7w5k",
      "author": "deplorable_word",
      "body": "That must feel so so good!!",
      "created_utc": 1612032756.0,
      "score": 9,
      "context": []
    },
    {
      "id": "glek9li",
      "author": "None",
      "body": "Hell yeah my friend! Great job on your progress",
      "created_utc": 1612038551.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glx4gtr",
      "author": "deena812044",
      "body": "So wonder to hear this! 😁💖👍",
      "created_utc": 1612392387.0,
      "score": 1,
      "context": []
    }
  ]
}