{
  "id": "l8vv0a",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1612041187.0,
  "title": "My first birthday in 6 years without anorexia *TW for weight numbers",
  "selftext": "Last year, my boyfriend took me to Baskin Robins to get an Oreo Blizzard cake and a small blizzard. In line, I said something like, “I bet you the cashier is going to think I’m a fat fuck.” I remember the funny look he gave me; I was >!95!< lbs at most, only ate once a day, and exercised for 1.5 hours every day. He and I were in this weird phase where I was too sick to understand or even acknowledge his needs in the relationship outside of my anorexia and he didn’t know how to bring it up, so while he was at work all day I stayed at home, by myself, fantasizing about my single slice of cake I’d end up purging before he’d get home and then giving the rest to him and my roommates.\n\nThis year, my coworker bought me a cookie cake and the kids at work (I work at a daycare) made me cards and told me why they were grateful for me. My boyfriend requested Monday off so we could go to the aquarium together; he got me my favorite Starbucks drink, a mini Carvel ice cream cake for the two of us, and vodka and such for Sea Breeze cocktails; my best friend ordered me a pizza; and tomorrow we’re going to the city to get me some art supplies and maybe even my own skateboard.\n\nA lot of the time, I struggle to see the good things in recovery, but this is the first birthday I’ve been genuinely grateful for everything I have and it’s all because I finally chose everything else over anorexia. This the first day I’ve noticed I’ve been genuinely happy.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l8vv0a/my_first_birthday_in_6_years_without_anorexia_tw/",
  "score": 185,
  "num_comments": 10,
  "comments": [
    {
      "id": "glesz0y",
      "author": "Ditz3n",
      "body": "<3",
      "created_utc": 1612042745.0,
      "score": 20,
      "context": []
    },
    {
      "id": "glexvo4",
      "author": "Hahhahahhohno",
      "body": "This is such a beautiful post",
      "created_utc": 1612045152.0,
      "score": 20,
      "context": []
    },
    {
      "id": "glfkvxx",
      "author": "peanutbutterbarbie",
      "body": "wow. im so happy for you. happy birthday love",
      "created_utc": 1612056911.0,
      "score": 11,
      "context": []
    },
    {
      "id": "glfksrk",
      "author": "CelestialWolfMoon",
      "body": "You should be proud of how far you’ve come.  Happy birthday!",
      "created_utc": 1612056863.0,
      "score": 11,
      "context": []
    },
    {
      "id": "glfmiz6",
      "author": "acousticbruises",
      "body": "I LOVE this post. I am so happy you've had such a lovely burthday. Congrats to you and all you've accomplished.",
      "created_utc": 1612057772.0,
      "score": 9,
      "context": []
    },
    {
      "id": "glg8oxp",
      "author": "Queenofwands1212",
      "body": "This gives me hope. Your birthday sounds lovely and so expansive and creative. Your boyfriend sounds like a really down to earth guy. All the special little things .... makes me happy",
      "created_utc": 1612069918.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glftkoh",
      "author": "salutethesaguaro",
      "body": "Ahhh yess!!! 💕💕💕",
      "created_utc": 1612061503.0,
      "score": 5,
      "context": []
    },
    {
      "id": "glgjtcy",
      "author": "tinymightybookworm",
      "body": "So proud of you and HAPPY BIRTHDAY!",
      "created_utc": 1612077887.0,
      "score": 4,
      "context": []
    },
    {
      "id": "glh6c85",
      "author": "violetmoz",
      "body": "this is really amazing, well done on ur progress! and happy birthday :)",
      "created_utc": 1612098750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glfz5aw",
      "author": "oogiebuns",
      "body": "This is amazing! I hope I can eventually get to this point in my recovery as well. So happy for you.",
      "created_utc": 1612064429.0,
      "score": 5,
      "context": []
    }
  ]
}