{
  "id": "l9w2nh",
  "subreddit": "fuckeatingdisorders",
  "author": "bobanyangie",
  "created_utc": 1612158308.0,
  "title": "some affirmations i use to remind myself that’s it’s okay to a lot in a day and eat more than others:",
  "selftext": "* i am in recovery. i am recovering from an eating disorder so of course i have to concentrate more on fueling my body.\n* skipping meals is not trendy. it does not even contribute to weight loss. it is just unhealthy.\n* those that brag on social media about not eating are exaggerating, or misunderstanding their intake. do not use them as comparison. \n* building on the previous point. because of my eating disorder i am hyper aware of my intake - unlike most people. this leads to the misconception that i am eating much more than anyone else\n* everyone has a different metabolism, depending on genetics and wild variety of other factors. if you need more food than others it may just be a difference in metabolism. trust that your body knows what to do with the food you give it.\n* how my body is shaped is something i am born with. my digestive patterns/bloating is something i am born with. for the most part, it is futile to try to change these forcefully. i cannot let my eating disorder convince me that i am “too fat” or that the way my body naturally functions is something i can control.\n* do not look for validation from others. i AM sick. i AM suffering. i AM sensitive. i AM recovering. most people are NOT. so of course i have different needs.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/l9w2nh/some_affirmations_i_use_to_remind_myself_thats/",
  "score": 205,
  "num_comments": 6,
  "comments": [
    {
      "id": "gll9g7h",
      "author": "rosesilverblue",
      "body": "Your last bullet point... thank you.",
      "created_utc": 1612181517.0,
      "score": 10,
      "context": []
    },
    {
      "id": "glknr22",
      "author": "jessietl",
      "body": "beautiful, thank you <3",
      "created_utc": 1612163335.0,
      "score": 5,
      "context": []
    },
    {
      "id": "glkufd6",
      "author": "None",
      "body": "This is really timely and helpful. And powerful!",
      "created_utc": 1612168753.0,
      "score": 6,
      "context": []
    },
    {
      "id": "glkzhek",
      "author": "mandolinwaterfall",
      "body": "Yes, the 4th bullet point! What is loads for me is nothing for my boyfriend, friends etc.",
      "created_utc": 1612173200.0,
      "score": 5,
      "context": []
    },
    {
      "id": "glm29wj",
      "author": "mangoedcow",
      "body": "this. thank you so so so so so much",
      "created_utc": 1612195177.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmxlo6o",
      "author": "Donkeychum10",
      "body": "Simply Perfect. Thank you.",
      "created_utc": 1613048420.0,
      "score": 1,
      "context": []
    }
  ]
}