{
  "id": "lee752",
  "subreddit": "fuckeatingdisorders",
  "author": "GalaxyDude10",
  "created_utc": 1612668198.0,
  "title": "Bruh... I Just Hit My Goal Weight!!!! TW: Weight/Numbers",
  "selftext": "Ya'll I just hit my goal weight after 2 YEARS of being in quasi-recovery. I'm now at a healthy 119-120lbs. Obviously, I'm scared as hell because it's been so long since I've been at this weight but also so grateful that my body gave me a second chance at life and happiness/health. I also just realized how GOOD I looked with some fat and weight on me. My stomach doesn't protrude out all the time no matter how much I ate, and for some odd reason I feel more confident in my skin now (weird how gaining 30+ lbs can do to ya, huh?). My therapist is going to be so happy when she hears about this on Monday!\n\nI just had no one to celebrate this with so I thought I would post this here to help some people by keeping them going in recovery. I've had days where I cried, relapsed, yelled, and had panic attacks on the floor of my bedroom, one of my only safe places I have. It was absolutely awful going through all of that, but it is so worth it coming out on the other end. I have more life to live now, and food is my friend, not my enemy anymore. Yes, I still have to increase my intake more because my period hasn't come back for 3 years, so that's something to work on, but this is amazing. An amazing beginning to a new chapter in my life. :)\n\nTo anyone struggling, keep going. Coming from someone who wanted to starve to death on some days and begged people to stay in her ED, it is so much better coming out of that dark, depressing tunnel that you feel like there is no end to. Caves have to stop somewhere. YOU CAN DO IT. <3",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lee752/bruh_i_just_hit_my_goal_weight_tw_weightnumbers/",
  "score": 114,
  "num_comments": 6,
  "comments": [
    {
      "id": "gmg9vyc",
      "author": "None",
      "body": "It’s really nice to see a “goal weight” in terms of a recovery goal.  Proud of you.",
      "created_utc": 1612711659.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gmc74ce",
      "author": "CelestialWolfMoon",
      "body": "Congrats!",
      "created_utc": 1612671838.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmcns4q",
      "author": "NaCheezIt",
      "body": "Congrats!! I don't know you but I'm really hapoy for you OP!",
      "created_utc": 1612677494.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmd8cd4",
      "author": "pettypoops",
      "body": "This made me teary. So happy for you, let’s keep going :’)",
      "created_utc": 1612685019.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmetrw7",
      "author": "cloudbustingmp3",
      "body": "aw this is so heartwarming, congrats! super happy for you and your progress! ❤️",
      "created_utc": 1612698747.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmivix6",
      "author": "GalaxyDude10",
      "body": "Thank you everyone for the kind comments. I'm so glad I found this forum that focuses on recovery and not just the bad things that happen with EDs. :)",
      "created_utc": 1612741300.0,
      "score": 2,
      "context": []
    }
  ]
}