{
  "id": "lgbgxs",
  "subreddit": "fuckeatingdisorders",
  "author": "nickDNR",
  "created_utc": 1612899483.0,
  "title": "a big recovery win: finally being able to keep leftovers in my room",
  "selftext": "i've rarely been to my university meal hall because it's buffet style (all to-go now) with hundreds of options and big portions, left overs are inevitable. i used to not trust myself to go because i wasn't able to stop eating after being full AND if i had leftovers they would be on my mind 24/7 until i ate them. \n\ntoday for the first time i went with a bag, got as much delicious food as i could, ate until i was full, and stored the rest in my fridge to have tomorrow or for dinner. I'm looking at the Tupperware FULL of food now with no desire to overeat and i trust myself not to. wow. never before in my entire life. \n\nanother win, early recovery binges were something i always struggled with especially after my nightly mary jane consumption so i would just set myself a hard and fast rule: NO EATING after said activity.  yesterday night i was lying in bed being tantalized by the cookies right under my bed. then i was like wait a sec I'm allowed to eat this this is fine wtf and i ate them and i fell asleep :\\~)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lgbgxs/a_big_recovery_win_finally_being_able_to_keep/",
  "score": 119,
  "num_comments": 4,
  "comments": [
    {
      "id": "gmqxvaj",
      "author": "featheredpeacock",
      "body": "This made me smile. Know that some stranger out in the world is both proud and very inspired by you, keep fighting the good fight friend.",
      "created_utc": 1612908074.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gmr54re",
      "author": "killa_kirby",
      "body": "Omg what great progress! Sounds like you are honoring your hunger cues and allowing yourself to be treated to delicious food as well. Keep up the great work!",
      "created_utc": 1612911503.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmunc67",
      "author": "nickDNR",
      "body": "thank you it means soso much to me 💖 i owe it all to going vegan and deciding to nourish the Buddha-nature inherent in me and in us all :-)",
      "created_utc": 1612985196.0,
      "score": 2,
      "context": [
        {
          "id": "gmqxvaj",
          "author": "featheredpeacock",
          "body": "This made me smile. Know that some stranger out in the world is both proud and very inspired by you, keep fighting the good fight friend.",
          "created_utc": 1612908074.0
        }
      ]
    },
    {
      "id": "gmv1rpd",
      "author": "featheredpeacock",
      "body": "YES! Another vegan oh my god. Veganism has seriously changed my life!",
      "created_utc": 1612991327.0,
      "score": 2,
      "context": [
        {
          "id": "gmqxvaj",
          "author": "featheredpeacock",
          "body": "This made me smile. Know that some stranger out in the world is both proud and very inspired by you, keep fighting the good fight friend.",
          "created_utc": 1612908074.0
        },
        {
          "id": "gmunc67",
          "author": "nickDNR",
          "body": "thank you it means soso much to me 💖 i owe it all to going vegan and deciding to nourish the Buddha-nature inherent in me and in us all :-)",
          "created_utc": 1612985196.0
        }
      ]
    }
  ]
}