{
  "id": "ljp65q",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1613312277.0,
  "title": "I think my eating disorder is partly fueled by my desire to not be sexualised.",
  "selftext": "most of the big reasons why I'm anorexic are pretty clear to me, but I avoid talking about the fact that my fear of being sexualised is fuel for my ed.\n\nI don't even know why I feel like this tho. I don't know if I'm asexual, I think I am but I'm open to changing that label in the future. I am not a victim of sexual trauma, I just don't want to be viewed by anyone sexually. I still feel like a child.\n\nI don't even like bending over out of fear of any implied sexual undertones. it just makes me so uncomfortable. \n\nI have a very flat chest and the thought of getting bigger boobs if i gain weight disgusts me. the same goes for hips.\n\nthe only thing I can think of that has triggered this is the fact that when I was about 9 or 10 I started getting boobs before most other girls in my class and I used to get made fun of for it. and being fake asked out as a joke multiple times.\n\nI just think I'm so ugly and disgusting that thinking someone could be genuinely attracted to me is unbelievable. I cant even comprehend that.\n\nI dont really know where I'm going with this, just a rant I guess. this subject makes me so uncomfortable I have not even told my therapist this.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ljp65q/i_think_my_eating_disorder_is_partly_fueled_by_my/",
  "score": 119,
  "num_comments": 17,
  "comments": [
    {
      "id": "gneomu0",
      "author": "simplerconfused",
      "body": "You’re not alone, although mine went in an opposite direction. A terrible relationship with a man lead to me being terrified of being sexualised and I binged and purged and binged\nSome more. Put on a comfort blanket worth of weight to subconsciously prevent men from seeing me. Realising I am actually a lesbian has been the thing that has allowed me to get free from that and actually start losing weight again healthily.",
      "created_utc": 1613312515.0,
      "score": 28,
      "context": []
    },
    {
      "id": "gnfcb9p",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1613318888.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gngodoi",
      "author": "manicpanicbp",
      "body": "mine too\n\never since i was little people always told me i was “exotic” and “different” and that “boys were obsessed with me for my ass” \n\nmy ed started from my insecurities with being over sexualized and wanting to punish myself \n\ni am a “healthy weight” now which is good i guess but every day i look in the mirror and see my butt it’s hard to leave my room. \n\n people will compliment my butt thinking it’s a fuxking compliment but it hurts so so bad and it always ends with me crying alone \n\ni think all curvy bodies are BEAUTIFUL just not mine...\n\n\nTHANKS YOU for being brave and sharing \nbecause reading this/other people’s responses makes me feel less alone ❤️\ni’m queer too which i’m finding in the comments and that’s interesting",
      "created_utc": 1613334828.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gng134n",
      "author": "H3rmy",
      "body": "I had the same feeling, I hated being sexualized since my early teens and even in the beginning with my partner I told him I “might” be asexual. I still continued with him and eventually I did get the feelings of “he was the one” but I kept everything very low key and I never stopped myself from doing things with him, I love him and believe people can grow and change, but I would feel this tremendous sadness after every time about how I looked so on, so on. However, now that I’ve been in recovery for a bit now and I’ve put a lil on myself I can feel hot as hell and my confidence can definitely influence my wardrobe haha, but I still totally get days where I wanna hide from the world /-: WIP\n\nEdit: these feelings about myself have made it way easier for me to feel comfortable with sex and openly talk about it which is nice, I know not all relationships need it but I’m my particular one I always really wanted that aspect so I’m happy about that",
      "created_utc": 1613324368.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gng6d52",
      "author": "Wrencer4Endgame",
      "body": "I have been wondering if I became asexual too tbh... I used to be quite sexual (even kinky lol) when I was maintaining an \"healthy\" weight, but now that I've relapsed, I have zero libido/no motivation to date anyone... And tbh I don't really mind because I used to be sexualized by random dudes all the time because I'm sex positive & I don't miss that at all...\nAlso, I'm bi and I've noticed (in my case) that when women I fancy start to want sex things, I don't feel like getting intimate atm, even if they're less pushy than men",
      "created_utc": 1613325770.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gngfgpx",
      "author": "Various-List",
      "body": "100% can relate to this. I think being underweight through puberty is why I ended up so flat chested. Every other female in my family is a size D at a minimum, even at a slim weight. During my healthy time in adulthood, I really struggled with this, and not feeling beautiful. Relapsing though, I remember that head space of “don’t see me. Don’t notice me. Please god.. don’t touch me..”",
      "created_utc": 1613330305.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnh9acq",
      "author": "daddydangles911",
      "body": "Thank you for sharing this, I thought I was the only one. I'm a naturally large-cheated, full-hipped person and I have been since I was 13. It got me so much unhealthy and detrimental attention. It was like the moment I entered 8th grade everyone treated me differently- my friends, boys, even the teachers. That coupled with the fact that I just genuinely don't like being curvy and would much rather dress kind of androgynously means I'm at constant war with my weight restored body. I'm so sorry you feel this way too, I hope that you find healing. 🤍",
      "created_utc": 1613345969.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gngjjwb",
      "author": "waterspouts_",
      "body": "I feel you. Mine developed in HS after some traumatizing childhood sexual assaults. I was terrified of what I saw on TV and how sexualized people of my age were. I was dead set on making sure no one would have any reason to look at me unless it was disgust.",
      "created_utc": 1613332383.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnhhui6",
      "author": "maegantheepony",
      "body": "I feel this. For me it’s having a large chest from a young age and constantly having it pointed out. Then my mom would say “you just have a womanly body” okay great well I’m 13. Just fueled my hatred for my body and food even more. So while you may never have experienced SA, you may have internalized gross looks and comments growing up and are trying to protect yourself.",
      "created_utc": 1613350850.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnepg77",
      "author": "None",
      "body": "that crazy thing is though, I'm gay too, and being sexualised by women doesn't bother me, but with men it still does. I don't even know why though, never had a bad experience with men, never dated or anything, its a mystery 🤷‍♀️",
      "created_utc": 1613312784.0,
      "score": 20,
      "context": [
        {
          "id": "gneomu0",
          "author": "simplerconfused",
          "body": "You’re not alone, although mine went in an opposite direction. A terrible relationship with a man lead to me being terrified of being sexualised and I binged and purged and binged\nSome more. Put on a comfort blanket worth of weight to subconsciously prevent men from seeing me. Realising I am actually a lesbian has been the thing that has allowed me to get free from that and actually start losing weight again healthily.",
          "created_utc": 1613312515.0
        }
      ]
    },
    {
      "id": "gnfdyq0",
      "author": "None",
      "body": "wow this makes so much sense, thanks for this",
      "created_utc": 1613319236.0,
      "score": 5,
      "context": [
        {
          "id": "gnfcb9p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613318888.0
        }
      ]
    },
    {
      "id": "gnggirw",
      "author": "fishonthesun",
      "body": "TW (SA)\n\nAlso a lesbian!!! Had a lot of sexual trauma at the hands of men. Combination of they were narcissistic, manipulative, abusive, and wouldn't take no for an answer, and I didn't \"satisfy them often enough\" bc, i now know, I am a lesbian and literally feel nauseous when I see a shirtless man. I was trying to recover so I could do kickboxing to feel safe and protected in my body, bc my ED stems a bit from those guys telling me if I gained weight I'd be \"even more irresistible\" so I did what I could to lose weight to protect myself from more sexual trauma",
      "created_utc": 1613330844.0,
      "score": 6,
      "context": [
        {
          "id": "gnfcb9p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613318888.0
        }
      ]
    },
    {
      "id": "gngi28q",
      "author": "avocantdough",
      "body": "This is exactly me too. I’m gay and I aM certain that is fueling my disorder",
      "created_utc": 1613331632.0,
      "score": 5,
      "context": [
        {
          "id": "gnfcb9p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613318888.0
        }
      ]
    },
    {
      "id": "gnggqci",
      "author": "fishonthesun",
      "body": "It's possible you became asexual, sexuality can change over time! But, also, keep in mind that restricting intake can decrease sex drive. Your body doesn't want to work on making a kid if it isn't getting enough for other regular functions.",
      "created_utc": 1613330952.0,
      "score": 5,
      "context": [
        {
          "id": "gng6d52",
          "author": "Wrencer4Endgame",
          "body": "I have been wondering if I became asexual too tbh... I used to be quite sexual (even kinky lol) when I was maintaining an \"healthy\" weight, but now that I've relapsed, I have zero libido/no motivation to date anyone... And tbh I don't really mind because I used to be sexualized by random dudes all the time because I'm sex positive & I don't miss that at all...\nAlso, I'm bi and I've noticed (in my case) that when women I fancy start to want sex things, I don't feel like getting intimate atm, even if they're less pushy than men",
          "created_utc": 1613325770.0
        }
      ]
    },
    {
      "id": "gngpctf",
      "author": "manicpanicbp",
      "body": "“dont notice me” is something that i can 100p relate too \n\ni wish i could legit vanish and the though of people looking at me or even finding me attractive is repulsive \n\nugh",
      "created_utc": 1613335325.0,
      "score": 4,
      "context": [
        {
          "id": "gngfgpx",
          "author": "Various-List",
          "body": "100% can relate to this. I think being underweight through puberty is why I ended up so flat chested. Every other female in my family is a size D at a minimum, even at a slim weight. During my healthy time in adulthood, I really struggled with this, and not feeling beautiful. Relapsing though, I remember that head space of “don’t see me. Don’t notice me. Please god.. don’t touch me..”",
          "created_utc": 1613330305.0
        }
      ]
    },
    {
      "id": "gnfe0xx",
      "author": "None",
      "body": "You're welcome.",
      "created_utc": 1613319248.0,
      "score": 4,
      "context": [
        {
          "id": "gnfcb9p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1613318888.0
        },
        {
          "id": "gnfdyq0",
          "author": "None",
          "body": "wow this makes so much sense, thanks for this",
          "created_utc": 1613319236.0
        }
      ]
    },
    {
      "id": "gnggr42",
      "author": "agree-with-you",
      "body": "I agree, this does seem possible.",
      "created_utc": 1613330962.0,
      "score": 3,
      "context": [
        {
          "id": "gng6d52",
          "author": "Wrencer4Endgame",
          "body": "I have been wondering if I became asexual too tbh... I used to be quite sexual (even kinky lol) when I was maintaining an \"healthy\" weight, but now that I've relapsed, I have zero libido/no motivation to date anyone... And tbh I don't really mind because I used to be sexualized by random dudes all the time because I'm sex positive & I don't miss that at all...\nAlso, I'm bi and I've noticed (in my case) that when women I fancy start to want sex things, I don't feel like getting intimate atm, even if they're less pushy than men",
          "created_utc": 1613325770.0
        },
        {
          "id": "gnggqci",
          "author": "fishonthesun",
          "body": "It's possible you became asexual, sexuality can change over time! But, also, keep in mind that restricting intake can decrease sex drive. Your body doesn't want to work on making a kid if it isn't getting enough for other regular functions.",
          "created_utc": 1613330952.0
        }
      ]
    },
    {
      "id": "gngw5oj",
      "author": "Wrencer4Endgame",
      "body": "Yeah, I'm really wondering these days if it's because I'm restricting or a totally new approach of my sexuality",
      "created_utc": 1613338843.0,
      "score": 1,
      "context": [
        {
          "id": "gng6d52",
          "author": "Wrencer4Endgame",
          "body": "I have been wondering if I became asexual too tbh... I used to be quite sexual (even kinky lol) when I was maintaining an \"healthy\" weight, but now that I've relapsed, I have zero libido/no motivation to date anyone... And tbh I don't really mind because I used to be sexualized by random dudes all the time because I'm sex positive & I don't miss that at all...\nAlso, I'm bi and I've noticed (in my case) that when women I fancy start to want sex things, I don't feel like getting intimate atm, even if they're less pushy than men",
          "created_utc": 1613325770.0
        },
        {
          "id": "gnggqci",
          "author": "fishonthesun",
          "body": "It's possible you became asexual, sexuality can change over time! But, also, keep in mind that restricting intake can decrease sex drive. Your body doesn't want to work on making a kid if it isn't getting enough for other regular functions.",
          "created_utc": 1613330952.0
        }
      ]
    }
  ]
}