{
  "id": "lkd1yy",
  "subreddit": "fuckeatingdisorders",
  "author": "Blue_sKai",
  "created_utc": 1613393446.0,
  "title": "1 MONTH IN RECOVERY",
  "selftext": "So yesterday marked one month since i started recovery, going all in/unrestricted eating and i wanted to share my wins and things i'm struggling with, and how things are going overall :)\nI decided to recover because I was just so fed up, I couldn't go on like that anymore. I had started noticing shortness of breath at night and my heart beat so low at rest i was always waiting for the next beat in fear. As many, i started recovery by tip toeing into it. The first day i allowed myself an extra sandwich. Slowly i started increasing my calories and within a few days i was just so ravenously hungry i couldn't go back to restricting as before even if i wanted to, so i said fuck it.\n\n1. During my ed i was at the gym everyday for a year, and i would feel horrible if i didnt go one day or if my exercise wasn't productive. I stopped going cold turkey and i thought it was going to be so hard to let go and to not exercise at all, but instead i felt so free from the first day i quit. I didn't realize how much it was draining me. I'm honestly so glad i did. I see people who say you can work out at the same time you recover but that's definitely not for me.\n\n2. I'm dealing with extreme mental hunger atm and some days it's too much to handle. I'm doing my best to honour it but it's very hard. The anxiety i get from the constant fight between my healthy mind asking for food and my ed mind being horrified by it is definitely the most challenging part.\n\n3. I'm so tired aaaalll the time, all I do is eat and read (currently reading tabitha farrar's Rehabilitate, Rewire, Recover. It's amazing). Sometimes i hate it because during my ed I was so energetic :( but i know this means my body is taking the extra fuel that i'm giving it and working on repairs.\n\n4. I've been able to eat so many fear foods, things that during my ed i would have never eaten and I have also broken a lot of food rules (still got a long way to go, but i'm surely making progress).\n\n5. A big part of my ed was about counting calories. I still count to this day, even though it doesn't make a difference to me if the numbers say 3k or 7k (but my ed brain definitely loves the least amount). The first days of recovery i was using the excuse of counting calories to meet the minimums, but now with extreme hunger i easily go past those every day, so i know there is no need to keep logging every piece of food i'm consuming. I'm working on it, i just can't just delete MFP, not yet...\n\n6. I have gained almost 10 pounds so far and i have the \"beer belly\". I know some of it is water weight, i still don't mind the weight gain because i know i need it, and i'm still underweight. But i fear the day when i reach a \"normal bmi\" and i still have extreme hunger so i have to find another motivation for eating that isn't getting to a normal weight. This is actually my biggest fear right now.\n\nI hope people that are in the same point resonate with this, or helps you if you're considering recovery. I encourage you to follow it. I've still got a loong way to go but it is definitely the best thing i've done :)\nFeel free to ask me any question or to share your experiences during the first weeks of recovery!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lkd1yy/1_month_in_recovery/",
  "score": 88,
  "num_comments": 8,
  "comments": [
    {
      "id": "gnjmpre",
      "author": "None",
      "body": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️Keep going, it’s worth it. You’re doing amazing!",
      "created_utc": 1613405259.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gnjnelr",
      "author": "None",
      "body": "You are such a ray of sunshine and incredibly strong. This post is making me smile. One day at a time, warrior. You're doing great. 💖 Thanks for taking the time to write this down!",
      "created_utc": 1613405600.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gnkdyys",
      "author": "pinkbumi",
      "body": "Proud of you <3 the first month is usually the hardest. Keep it up, its worth it :))",
      "created_utc": 1613418265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnl6w2k",
      "author": "Silver_Oakleaf",
      "body": "Thanks for posting this. You’ve got this. 💪",
      "created_utc": 1613432442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gnjsjgd",
      "author": "Blue_sKai",
      "body": "Thank you so much! 🥰",
      "created_utc": 1613408081.0,
      "score": 2,
      "context": [
        {
          "id": "gnjmpre",
          "author": "None",
          "body": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️Keep going, it’s worth it. You’re doing amazing!",
          "created_utc": 1613405259.0
        }
      ]
    },
    {
      "id": "gnjsruc",
      "author": "Blue_sKai",
      "body": "Thank you so much for your kind words, it means a lot! ♥️",
      "created_utc": 1613408194.0,
      "score": 3,
      "context": [
        {
          "id": "gnjnelr",
          "author": "None",
          "body": "You are such a ray of sunshine and incredibly strong. This post is making me smile. One day at a time, warrior. You're doing great. 💖 Thanks for taking the time to write this down!",
          "created_utc": 1613405600.0
        }
      ]
    },
    {
      "id": "gnknavs",
      "author": "Blue_sKai",
      "body": "Thank you!! 💪♥️",
      "created_utc": 1613422700.0,
      "score": 3,
      "context": [
        {
          "id": "gnkdyys",
          "author": "pinkbumi",
          "body": "Proud of you <3 the first month is usually the hardest. Keep it up, its worth it :))",
          "created_utc": 1613418265.0
        }
      ]
    },
    {
      "id": "gnlbg0t",
      "author": "Blue_sKai",
      "body": "Thank you 🥰💪",
      "created_utc": 1613434858.0,
      "score": 1,
      "context": [
        {
          "id": "gnl6w2k",
          "author": "Silver_Oakleaf",
          "body": "Thanks for posting this. You’ve got this. 💪",
          "created_utc": 1613432442.0
        }
      ]
    }
  ]
}