{
  "id": "ll5uku",
  "subreddit": "fuckeatingdisorders",
  "author": "throwawayperson222",
  "created_utc": 1613488394.0,
  "title": "Physical things that got better for me as a recovering Asian with an eating disorder",
  "selftext": "This all happened when I was maintaining a >!16!< BMI for like 3 months. It wasn’t even that low and I could hardly stay that low of a weight because of extreme hunger.\n\nSome things that happened being that UW:\n• heart rate would SPIKE everytime I ate, it was kind of scary. It would continue to beat fast for the entirety of me eating.\n• brain fog af, felt slow and stupid attempting to continue conversations\n• my heart/chest felt tight when exercising. Another scary thing that would happen\n• joint pain!!! Sitting would hurt cus I had no fat. Laying down on my side would hurt. EVEN PUTTING MY PHONE IN MY POCKET hurt my hip bones\n• worst of it all was thinking about food every second of the day. It really sucks when calories, food are what you only think about especially when you have work to do or have to study. It’s a sad life\n• so cold. I would have the heater on me for 15-20 minutes before I attempted to change in the morning. I was still freezing trying to change clothes.\n• obviously no period for like a year\n\nAs much as I hate my body right now, those heart problems kind of worry me if I did any long term damage. I’m asian and look normal at that low BMI, but you wouldn’t even think that I was physically deteriorating. Sometimes I look at other uw Asians, kpop stars and wonder how the fuck... are they okay? Do they have their period? Do they not have heart problems? People like Rose that’s obviously super UW. How is that okay and how are people defending that she’s naturally skinny?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ll5uku/physical_things_that_got_better_for_me_as_a/",
  "score": 134,
  "num_comments": 4,
  "comments": [
    {
      "id": "gnnpxd7",
      "author": "None",
      "body": "It's not okay, those UW kpop people are very unhealthy and suffer a lot. They maintain it with ridiculous diets.",
      "created_utc": 1613491738.0,
      "score": 57,
      "context": []
    },
    {
      "id": "gnq4351",
      "author": "DifferentIsPossble",
      "body": "Hey, that's not \"not even that skinny.\" That's the disorder talking, just pointing that out. You were dangerously underweight! You're still comparing yourself to others and thinking of yourself as 'not even that skinny' when it was far beyond that.",
      "created_utc": 1613532311.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gnq3pjs",
      "author": "lapetitepapillon",
      "body": "Korean girl here, I totally get you. I'm really glad to hear that you're recovering though :)",
      "created_utc": 1613532108.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gnrckb0",
      "author": "ilikebigbooks98765",
      "body": "Thanks for sharing, its posts like these that make me stop and think it isn't worth it. I'm asian too, and I'd probably look \"normal\" even being UW which is annoying af. I always wonder about those UW kpop stars too, how the hell do they exercise and do all their training and shows without passing out and looking perfectly fine??! Do they not have any of the typical symptoms of being UW??? It makes me feel like I should be able to do it too without repercussions (which is a dangerous line of thinking)",
      "created_utc": 1613566231.0,
      "score": 3,
      "context": []
    }
  ]
}