{
  "id": "lslt3i",
  "subreddit": "fuckeatingdisorders",
  "author": "xleabrax",
  "created_utc": 1614300942.0,
  "title": "I hate the fact that when you’re even a few months into recovery people perceive you as recovered",
  "selftext": "This is obviously due to lack of knowledge about ED’s - granted, I didn’t have the slightest clue before developing AN but the amount of mental strain this illness causes every single day I’m surprised more people aren’t aware of the effects of EDs considering it’s the biggest mental health killer \n\nI suppose my annoyance is heightened because I still struggle with tiredness even 7 months in, it often feels like I’m not allowed to be because I’m physically better \n\nNotably brain fog is the biggest downside to my recovery, I cannot retain information like I use to which stresses me out I’ve been at such a disadvantage because of it which is sadly a reason for me to relapse when I get ideas to \n\nI realise this can also be a good thing as it brings normality but I wish people were more mindful of it",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lslt3i/i_hate_the_fact_that_when_youre_even_a_few_months/",
  "score": 142,
  "num_comments": 8,
  "comments": [
    {
      "id": "goscftw",
      "author": "honeycakies",
      "body": "yes omg. And, in my case, switching disorders from AN to BN and having people assume I can't be in the midst of a relapse because I'm a healthy weight atm. It's like weight restoration makes people suddenly devoid of any empathy / understanding",
      "created_utc": 1614308022.0,
      "score": 26,
      "context": []
    },
    {
      "id": "goscbyx",
      "author": "lolaboats",
      "body": "This pissed me off too. I was 3 months into recovery and my mom thought it would be a great thing to make a giant feast of all my trigger foods that I used to love thinking it would would be a great celebration of my recovery. I binged, purged and fell right back into extreme restriction. Sweet idea, but not a good one.",
      "created_utc": 1614307967.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gostzog",
      "author": "queener_beaner",
      "body": "No one will ever truly understand what you’ve gone through with your ED, especially people who’ve never struggled with one. When someone perceives you as recovered, or doesn’t “get it”, just let it go knowing that you wouldn’t want anyone else to go through the pain and suffering you have, just for the sake of you being understood. \n\nI’ve been “recovered” for a few years now but still have flashbacks almost daily that make me so so sad. (Haha I’m still in this sub aren’t I?) People think I’m 100% now, and that’s fine for them. The truth is recovery is an ongoing daily thing, long after the therapy and the behaviors stop.",
      "created_utc": 1614318382.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gosqpvy",
      "author": "asparagus_1",
      "body": "this. i FINALLY got the courage to tell my friend that I had a disorder and she asked if I’m working towards getting better. I said yeah I’m seeing a dietitian and really working hard. The very next text she sends? “I heard on the radio that doing __ burns __ amount of calories!”",
      "created_utc": 1614316167.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gosvk7j",
      "author": "germanshepherd_mom",
      "body": "I relate to this so much. I’m 6 months in and everyone just thinks I’m better now",
      "created_utc": 1614319531.0,
      "score": 5,
      "context": []
    },
    {
      "id": "goswplv",
      "author": "FunkyBlueMohawkBird",
      "body": "I feel ya. On the fatigue, the brain fog and the assumptions people make regarding recovery. My mom thinks I’ve damaged my brain with eating disorders ..and I believe her. Here’s a list of brain foods, so you don’t have to read a whole article about nutrition: sweet potato, leafy greens, salmon, avocado, walnuts, blueberries, chocolate, coffee. When I eat the brain foods (in addition to lots of other foods!), I at least trick myself into thinking I’m doing something proactive about the fog. I started eating meat (mostly salmon) just for my mind, and I’m a little grateful for the brain fog.. if only because realizing I could lose my MIND and my whole identity to this shit was intolerable to me. Trying to make my brain sharp again motivates much of my recovery.",
      "created_utc": 1614320407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "got33h5",
      "author": "saharalilyy",
      "body": "YUUUUUP, my brother thinks i’m recovered because i’m a healthy weight",
      "created_utc": 1614325713.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gotrkoo",
      "author": "None",
      "body": "I have friends who has this disorder too and they constantly ask about my recovery, it’s really getting irritating because you can just feel them comparing their recovery/lives to mine. It’s like they are body checking themselves AND me. I don’t do that comparison crap. I do take my time however to encourage them  and am positive. And I do decline when they ask for photos or ‘proof’ But I hate when my ‘progress’ makes them feel bad about themselves, is really what I’m getting at here.",
      "created_utc": 1614346057.0,
      "score": 2,
      "context": []
    }
  ]
}