{
  "id": "lt7xfw",
  "subreddit": "fuckeatingdisorders",
  "author": "absolute_boy",
  "created_utc": 1614373809.0,
  "title": "Mukbangers, competitive eaters and the open secret of bulimia",
  "selftext": "Let's get a little controversial. We've all seen them and probably watched them jealously while fighting off hunger pangs - the dainty, good-looking people who gorge themselves on a buffet's worth of burgers, pizzas, and every brand of fast food under the sun every other day, racking up thousands of views and never gaining a single pound. It seems every person with a knowledge of eating disorders knows exactly how these people maintain their trim figures. Yet a quick scroll through the comments always shows a vast majority of people praising their 'good metabolism' (yes metabolism varies from person to person, but not so much that you can maintain 110lbs while embarking on thrice-weekly '20k calories challenges'). It feels like purging is pretty much an open secret among many, and that people just choose to ignore it because it's inconvenient and ugly and spoils whatever fantasies watching these videos provide.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lt7xfw/mukbangers_competitive_eaters_and_the_open_secret/",
  "score": 140,
  "num_comments": 6,
  "comments": [
    {
      "id": "gox6j2o",
      "author": "NutelllaBellla",
      "body": "Yesss, too true!!!! And What is even more infuriating to me is when that muck bang channel's dainty host preaches \"health and fitness\" and claims these are just \"cheat meals\" when I can literally take one look at their jawline and see swollen salivary glands just like mine from purging. Bulimia has been a tough disorder to beat because the only reason I maintain an underweight/ borderline underweight BMI is because I binge and purge whenever I'm alone. And then the rest of the time I restrict calories on MFP or straight up water fast. It sucks because on days when I feel ravenous and eat maintenance calories I'll feel so guilty for eating up to maintenance level and beat myself up. But then when I get the alone time to completely gorge on a million calories and purge, I use \\*those exact muck bang youtubers\\* to justify my binging and purging and don't feel nearly as much guilt as the days I eat sensibly/ enough to maintain but don't binge and purge. This bulimia is leaving me in the worse predicament and these youtubers only promote the disorder.",
      "created_utc": 1614388332.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gowua0j",
      "author": "punipunijelly",
      "body": "lmao I’ve always thought that I could be one of those mukbangers if I wanted to be...but i don’t know if I could deal with the guilt, I mean someone said “you must be one of those girls who can eat whatever and stay thin huh?” once and I still cringe",
      "created_utc": 1614383564.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gowpvgy",
      "author": "tears_of_an_angel_",
      "body": "I was always sus about kim and Liz...",
      "created_utc": 1614382146.0,
      "score": 22,
      "context": []
    },
    {
      "id": "goxc0o1",
      "author": "anonforlong",
      "body": "I had been meaning to pose a similar question on this sub. mukbangs have always had me a bit confused. Some mykbangs I understand if it’s not like an overwhelming amount of food. But some literally remind me of my own binges. Idk if it’s because I have food issues but I really don’t get how someone could make a living from mukbanging (aka Lowkey let’s call it for what it is-  binging) multiple times a week and not eventually develop an ED. And the fact that mukbanging is kinda really fetishized by society normalizes food behaviors that seem forced most of the time. Idk",
      "created_utc": 1614391424.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gp13q1g",
      "author": "TheUnfedMind",
      "body": "The whole Kate Yup controversy amazed me.  \nPeople are more willing to believe that someone is held hostage than put two and two together and face the fact that they are confronted with ED behaviour.  \nI think its the discrepancy between the highly sensationalised amounts of food and the mundane and everything but glamorous aftermath. Just unfathomable for some people.",
      "created_utc": 1614442789.0,
      "score": 5,
      "context": []
    }
  ]
}