{
  "id": "lzdn9c",
  "subreddit": "fuckeatingdisorders",
  "author": "Edthrowaway1325",
  "created_utc": 1615072291.0,
  "title": "Birthday cake: an ode to recovery",
  "selftext": "During the 7 years of my eating disorder, I DREADED birthdays. Why? Mostly, birthday cake. Friends, family, coworkers trying to give you cake, cupcakes, brownies... An anorexic's worst nightmare.\n\nSo I spent every year planning weeks in advance how to avoid birthday cake. I planned how to convince coworkers and friends I didn't want cake, and meticulously researched the calories in every type of cake and told my parents I  wantes a low fat cheesecake or mini vanilla cupcakes - - the safest options I could find - - because my parents refused to not get me a cake. So I'd lie about what cake I like, miserably eat a tiny slice, hate every second of it, throw the rest of it out as soon as I could and starve myself the next day to make up for it. \n\nYears of anxiety and fear and shame on a day where your loved one just want to celebrate you. Years of cake in trash cans, gas station dumpsters and flushed down the toilet.\n\nBut not anymore.\n\nLast year, my first recovery birthday, I asked for carrot cake because I stinkin' LOVE carrot cake. It was the most amazing delicious thing, and I ate at least 5 slices on my Bday and all the rest the next day. I felt a lot of shame for \"binging\", and thought this meant I'd never be able to eat cake normally again. In reality, my body just wanted what I had been depriving it of for years.\n\nYesterday was my second birthday since my recovery. This year, I asked for another carrot cake. My mom ordered it from the best bakery in town and it. was. HEAVENLY.\n\nAnd you know what? I had one slice on my Bday, and that was enough. Then, I had a slice this morning for breakfast. And that was enough. There is almost an ENTIRE carrot cake in my fridge right now, and I have no desire to eat any of it. In fact, I may not be able to finish this thing at all this year. Or maybe I will. Who knows. Who cares. \n\nAll I know is recovery is worth it. Not fearing birthdays is worth it. And carrot cake is definitely worth it.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lzdn9c/birthday_cake_an_ode_to_recovery/",
  "score": 103,
  "num_comments": 3,
  "comments": [
    {
      "id": "gq262cv",
      "author": "None",
      "body": "I needed to hear this. In March 18 it is officially my first birthday out of treatment, and I have been so scared. Thank you, so so much. I’m so happy for you and I just want you to know you just helped me so much with this post. I’m so proud of your progress and how brave you are. You’re an inspiration for anyone going through recovery. It isn’t ever easy, but just remember you’re worth it. You’re worth every delicious bite of cake you can have. Thank you luv and stay strong. You have everyone here rooting for you❤️🙌🥰",
      "created_utc": 1615086197.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gq2jbr8",
      "author": "dortuh",
      "body": "I'm not the BIGGEST fan of cake, and my family is really bad at baking and cooking in general, but they're so damn weird about me not wanting it every year. One year my grandma insisted I have a cake and got one for HERSELF with both our names on it cause it was for my birthday but she was the one who wanted to eat it. It was funny\n\n But its really frustrating, every year having to deal with everyone making MY birthday all about THEM. So for the past couple years I started going out of town for my birthday. All I want anymore is to be left alone and do what I want.\n\n\n But I totally feel you on the cake thing. Its just a stressful food for me (even though I just had some 5 minutes ago cause I'm on vacation, bought a single slice) Safeway is better at making cake than my family 🤣 they're so fatally bad at making food. I see why I was a skinny child.",
      "created_utc": 1615094590.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gq3j7re",
      "author": "JunKriid1711",
      "body": "Good Job, I love hearing stories like this",
      "created_utc": 1615126210.0,
      "score": 1,
      "context": []
    }
  ]
}