{
  "id": "lzlx77",
  "subreddit": "fuckeatingdisorders",
  "author": "GameofCheese",
  "created_utc": 1615103029.0,
  "title": "Trigger warning! Ed death, and it's consequences on others.",
  "selftext": "Trigger warning: ED death and it's triggering consequences. I just need to talk. But please don't read further if it could trigger you. That's the last thing I want from this.\n\n*A little background: I grew up with an ED-NOS mom with periods of anorexia and bulimia. I was a chubby kid and started my EDs in my late teens. I sought help at 22, and never stopped... NEVER STOPPED getting professional help.\n\nI NEVER wanted to lose my life or quality of life to these diseases. It's robbed me of almost everything. But I have ALWAYS refused to give it my life.\n\nI will never stop going to treatment until I'm old. I will always be in some stage of recovery. Even if I were to become anorexic again, I'd do it under the watchful eye of an outpatient team to prevent my heart or brain or other organs from going. I would never refuse supplements or testing or therapy. But here I am now. In some sort of never- ending limbo of Ed-NOS/recovery dance for years and years.\n\nI'm currently 42 ED-NOS, and \"obese\" (same set point for 10 years but I've been ED-NOS with a little bit of every ED ruining my metabolism and doing too much overeating) but 20 years ago I was a seriously ill purging-anorexic who bounced between inpatient, residential, partial, day treatment, and outpatient.\n\nI eventually gave up anorexia as I have been borderline recovering for the last 22 years and try to eat every day at least one good meal. I haven't been inpatient or in residential in about 10 years since I was intensely bulimic but I have been in and out of other treatments ever since. I'm probably about to go into partial again due to my currently chaotic rapidly cycling ED behaviors and depression post-covid recovery if insurance will cover (I had Mono-like fatigue for 6 months after Covid infection).\n\nMy life now is that I've been on SSDI (social security disability) with Medicare since a long inpatient/residential stint in 2011. I was immediately approved by a state board instead of the drawn-out federal decision making body because of how long I had been institutionalized. I had even become homeless at one point because my parents wouldn't enable me anymore. So thank God for SSDI.\n\nSo now I'm going to be 43 next month. I work part-time and get my SSDI to pay for my apartment with my pets. I'm not married, no kids... no career, not even my college degree... I had to drop out a year shy. I have none of those things because I gave into E.D.'s voice before I was even an adult.\n\nPLEASE DON'T BECOME ME. JUST NEEDED TO SAY THAT.\n\n\nWhich brings me to today's need to talk.\n\nI was being dumb and watching an Intervention episode on an anorexic I think to thinspo myself into fasting for the weekend (I've been doing some long fasting again). Anyway, the girl reminded me of my best friend in the longest inpatient/ residential stint I had at 23. It was for about 9 months bouncing around. But the constant was my friend \"A\".\n\nI loved her very dearly, but not at first. She was so sick coming from a medical facility to our inpatient unit that she was still the lowest weight on the unit and it triggered EVERYONE.\n\nShe was much more sick than any of us. I, too, was triggered as I was at my low-weight and honestly my body would have given out wayyy before she had gotten to her \"stable-enough\" weight that let her get into our unit from a medical hospital. She had already put on 20 lbs. I mean to this day I don't know how she was even alive then.\n\nTime goes on. She becomes my best friend. And we're the same age! Similar dreams and desires! I leave the hospital and I bounce to and from various facilities with some relapsing and we ended up in residential at the same time together 6 months later since she finally got out of inpatient, and I was coming back and then we were moved to residential around the same time.\n\nShe was my roommate and bathroom buddy. We were always together. I truly thought she was working recovery. We helped each other distract from after-meals and ignored the unit drama together. She was being tube fed on the residential unit because she was still quite underweight. They would kangaroo feed her while we slept.\n\nI slowly restored weight and looking back at my discharge photo I have never looked healthier or happier. My skin glowed, my hair was shiny and thick, my eyes were bright with happiness, hopes, dreams, and the ability to FEEL my life.\n\nUnfortunately right before that picture was taken, my best friend betrayed herself, me, and our entire unit. She was using a lot of tricks I won't repeat, but she took advantage of me to do some of them unbeknownst to me. The staff was on to her the whole time due to her lack of weight restoration and some loss, and she was kicked out of residential. She did come clean at the end. I was very hurt and just so very sad. I knew then that we were very very different...\n\nI was never going to let myself die directly from these diseases but she would. I knew she would. This was her third serious treatment and her parents had sold their house.\n\nI tried to maintain contact. I loved her so so much. More than anyone I've been in treatment with before or since. But when I got home and was trying to work my recovery and she was merely dabbling at it, it was way too triggering to talk to her.\n\nI eventually told her all this and she understood. I loved her to the moon and back but for my own safety I couldn't maintain contact unless she was working in a professional treatment of some sort.\n\nI never talked to her much more again. I always wanted to get back in touch, but having recovery be so borderline for me for so long, I never felt strong enough to reconnect. I was also even MORE SO afraid to find out she had passed away from ED. She was always holding the Grim Reaper's hand with her sickly fingers, and everyone could see it. Her parents had accepted her death awhile ago. She had a sibling with children and people she loved that she wanted to see grow up, but she couldn't stop. Just could never stop.\n\nI emailed her today, I still had that in my phone. I decided that if my yearly obituary search hasn't found anything yet that it was actually safe to say she HAD gotten better. It finally occurred to me that she couldn't be borderline sick for all these years without dying. We're just too old for our bodies to handle that at our ages. So she was probably doing well!\n\nI emailed her and then did a name search. I figured I might find something about her becoming a teacher or at least living on Social Security like me at home enjoying time with her nieces, and nephews and enjoying some kind of valuable life. At least we would have each other to understand the life- long struggles. Realizing it's getting too late to have kids thanks to this fucking disease.\n\nWell, I guess I had been spelling her name wrong (I had gotten rid of her contact info after I had to cut off contact).\n\nWell... I found her obituary today and saw a photo of her headstone. She died in 2011. I called the funeral home and it was MY 'A' and she did die from anorexia. I'm going to write to her family via the funeral home, but I can't go to her funeral and I never said goodbye.\n\nShe died the year I went from homeless back to residential, giving up two dogs that I loved like children because I had no other choice. The year the government formally decided I was too sick to work probably ever work again because I lost too many jobs (from fainting at work or \"borrowing money\" to get food because I wouldn't bring any with me on my week long fasts and I broke down, to just too many sick days.)\n\nI guess it's a small blessing I didn't find out that year. We were both 33. I was clinging to life and she was already gone.\n\nBut today is not a good day either. I was already on the admit list to ED partial or mental health partial if I don't qualify due to insurance (I was denied last week for ED partial and refused MH partial).\n\nI am trying to stay out of treatment desperately. I never thought I'd go again. But getting my own place 2 years ago and then going though the stress of Covid has messed me up. (There is a theory that it has caused brain inflammation affecting my mental health besides the fatigue and shared sociatal depression).\n\nAnyway, I had a panic attack after I got off the phone with the funeral director and called the ED clinic and talked to the MD on call. She is going to touch base with my therapist.\n\nI don't know what happens to me now.\n\nDo I give in to temptation because fuck it? Do In let myself get sicker so I can qualify for treatment? Obviously I'll keep fighting but that's my ED screaming right now. \n\nI probably need at least MH at this point but who knows.\n\nI feel like I'm about to go to anorexia all over again. I can't be pushed into treatment \"right now\" since I don't qualify, I could lose some weight, and I could feel that HIGH we get, PLUS I can take a break from the stress of eating as much as I make myself. I can take fasting vacations and restrict and not deal with the stress of eating, overeating, or purging. I can just do nothing.\n\nAnd that's where I'm at. Today was not a good day in my recovery to find out I lost her.\n\nPLEASE DON'T DIE. EVEN THAT IS FUCKING TRIGGERING.\n\nIf you read all that, sorry it was so disjointed and awkward... I'm on a lot of Klonopin (Dr let me have extra) and I'm writing on mobile so it's not edited. Normally it'd be better written but you get the gist.\n\nJust... if you are younger. Please don't die at 33 or look back at your life at 42 and realize this has taken everything from you.\n\nJust fucking get better.\n\nThat's all.\n\nI'll update once I find out what's going to happen to me.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/lzlx77/trigger_warning_ed_death_and_its_consequences_on/",
  "score": 117,
  "num_comments": 15,
  "comments": [
    {
      "id": "gq42006",
      "author": "manicpanicbp",
      "body": "thank you so much for sharing your story \n\nit sounded like you had a deep connection with your friend. people go in and out of our lives to teach us new things and experiences. she made a great impact on you from being your bathroom buddy/ best friend to teaching you how important it is to recover. \n\nafter listening to your story i believe that you truly have done the work. it is a long long battle but you said yourself that you have strong support systems and that is WONDERFUL- but even better it’s amazing that you changed your perspective and mindset internally. ❤️❤️❤️ your friend would be so happy and proud of you just like i am. i can’t imagine what you are going through but all i can say is to not beat yourself up if you relapse because growth is NOT linear. \n\nyou are grieving and this is stressful so all of your thoughts and feelings are 100p valid. is there anything you can do to bring you joy? or center yourself around people who make you smile? go for a walk maybe listen to a good podcast. try meditation or yoga. also it’s okay to not be okay too! \n\ntake all the time you need to heal❤️ and if you can’t trust yourself to make healthy coping decisions maybe ask someone to be with you or talk on the phone with. even chatting people online to get my energy or thoughts out has been an amazing outlet for me. \n\nagain thank you for sharing your story because now it has made a great impact on me and my perspective in recovery.\n\nsending my love❤️❤️❤️",
      "created_utc": 1615136667.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gq3yxb6",
      "author": "blondiesdiary",
      "body": "I’m so sorry to hear this. 😞 I saw that a girl I was in treatment with died from her ED & it’s honestly so heartbreaking and scary. Because you know what it’s like to be that sick. You know how hard it is to see how deep you are in the disorder and how close to death you are. Yet even once you weight restore and can see the damage you’ve done, the urge to go back is still there. This is heartbreaking and I hope that you can seek treatment. I don’t know where you’re from but there are treatment centers that will accept you despite your weight. You don’t have to be underweight to deserve treatment. & being underweight isn’t the only health risk that comes with this hell.",
      "created_utc": 1615135100.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gq3tlmd",
      "author": "Thin_Wishes3",
      "body": "Oh man, I wish I had something helpful to say and I just don’t. But I’m so sorry for everything you went though, it sounds terrible and traumatic.\n\nI’m 28 now and I’ve been in and out of recovery and go in phases in an out of habits. It scares me to know these just never go away without proper help. I have a slew of other MH issues, with SI being one and I always think it won’t matter if I die. But I know deep down that isn’t true. I could see how deeply this is affecting you even though you haven’t spoken to your friend in years. \n\nTry and continue to get better and do what you need to do for you. Thank you for sharing your story and I hope there are brighter days ahead.",
      "created_utc": 1615132347.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gq4rmiq",
      "author": "None",
      "body": "That regular obituary search for the friends you haven’t heard from... it’s so scary and stressful. My dearest friend died briefly last year from anorexia but luckily they were able to revive her. It was the scariest thing I’ve ever heard and she’s been in the hospital ever since. I’m just so grateful that that close scare motivated her to actually commit to recovery for the first time. I’m so proud of her. Having friends that also have Ed’s is a roller coaster. But they’re the only people that get me.",
      "created_utc": 1615147595.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gq57hmb",
      "author": "None",
      "body": "Hey, thank you for writing all that. It's helpful for me to know that even after years of \"recovery,\" we will still struggle, because sometimes I feel alone as someone in my 30s. \n\nAlso, I totally relate to your determination to make it. It's so commendable and you deserve all the help you need to survive. Hang in there, and I'm sorry about your friend",
      "created_utc": 1615154254.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gq48cy6",
      "author": "GameofCheese",
      "body": "Omg.  Thank you for such a lovely thought out response.  It really gave me the little pep talk I needed.  I was just kinda in shock yesterday and really upset.  But today really is a much better day. \n\nI took my puppy to the dog park, opened the windows in the apt, and having been enjoying the fresh air and sunshine.  I think I really needed that. I'm gonna take a little nap with my pets and wake up and try to eat a good lunch... for 'A'.\n\nIt would make her sad to know that she triggered me in any way.  But it was the depression and grief talking and how do we deal with negative emotions?... stupid ED. Well fuck that voice and this disease...\n\nI'm gonna fight today. \n\nLove all that responded! And thank you so much for your thoughtful post!  💕",
      "created_utc": 1615139748.0,
      "score": 3,
      "context": [
        {
          "id": "gq42006",
          "author": "manicpanicbp",
          "body": "thank you so much for sharing your story \n\nit sounded like you had a deep connection with your friend. people go in and out of our lives to teach us new things and experiences. she made a great impact on you from being your bathroom buddy/ best friend to teaching you how important it is to recover. \n\nafter listening to your story i believe that you truly have done the work. it is a long long battle but you said yourself that you have strong support systems and that is WONDERFUL- but even better it’s amazing that you changed your perspective and mindset internally. ❤️❤️❤️ your friend would be so happy and proud of you just like i am. i can’t imagine what you are going through but all i can say is to not beat yourself up if you relapse because growth is NOT linear. \n\nyou are grieving and this is stressful so all of your thoughts and feelings are 100p valid. is there anything you can do to bring you joy? or center yourself around people who make you smile? go for a walk maybe listen to a good podcast. try meditation or yoga. also it’s okay to not be okay too! \n\ntake all the time you need to heal❤️ and if you can’t trust yourself to make healthy coping decisions maybe ask someone to be with you or talk on the phone with. even chatting people online to get my energy or thoughts out has been an amazing outlet for me. \n\nagain thank you for sharing your story because now it has made a great impact on me and my perspective in recovery.\n\nsending my love❤️❤️❤️",
          "created_utc": 1615136667.0
        }
      ]
    },
    {
      "id": "gq47co7",
      "author": "GameofCheese",
      "body": "Thank you. I know, that's the attitude of my team.  They want me in for sure.  It's an insurance thing.  But I'm sure they will work around what they need to hopefully now that things are getting a bit worse. I really appreciate the response! Hugs!",
      "created_utc": 1615139321.0,
      "score": 5,
      "context": [
        {
          "id": "gq3yxb6",
          "author": "blondiesdiary",
          "body": "I’m so sorry to hear this. 😞 I saw that a girl I was in treatment with died from her ED & it’s honestly so heartbreaking and scary. Because you know what it’s like to be that sick. You know how hard it is to see how deep you are in the disorder and how close to death you are. Yet even once you weight restore and can see the damage you’ve done, the urge to go back is still there. This is heartbreaking and I hope that you can seek treatment. I don’t know where you’re from but there are treatment centers that will accept you despite your weight. You don’t have to be underweight to deserve treatment. & being underweight isn’t the only health risk that comes with this hell.",
          "created_utc": 1615135100.0
        }
      ]
    },
    {
      "id": "gq3uox1",
      "author": "GameofCheese",
      "body": "Omg.  You too! All the hugs and healing energy your way!! None of us deserve any of this shit.",
      "created_utc": 1615132906.0,
      "score": 4,
      "context": [
        {
          "id": "gq3tlmd",
          "author": "Thin_Wishes3",
          "body": "Oh man, I wish I had something helpful to say and I just don’t. But I’m so sorry for everything you went though, it sounds terrible and traumatic.\n\nI’m 28 now and I’ve been in and out of recovery and go in phases in an out of habits. It scares me to know these just never go away without proper help. I have a slew of other MH issues, with SI being one and I always think it won’t matter if I die. But I know deep down that isn’t true. I could see how deeply this is affecting you even though you haven’t spoken to your friend in years. \n\nTry and continue to get better and do what you need to do for you. Thank you for sharing your story and I hope there are brighter days ahead.",
          "created_utc": 1615132347.0
        }
      ]
    },
    {
      "id": "gq4ypqe",
      "author": "GameofCheese",
      "body": "Omg I know.  I'm so so sorry to hear about your friend.  I hope with everything in my being she does get better. If you CAN be there for her, definitely be. I just wasn't strong enough unfortunately. Hugs!!!!",
      "created_utc": 1615150561.0,
      "score": 3,
      "context": [
        {
          "id": "gq4rmiq",
          "author": "None",
          "body": "That regular obituary search for the friends you haven’t heard from... it’s so scary and stressful. My dearest friend died briefly last year from anorexia but luckily they were able to revive her. It was the scariest thing I’ve ever heard and she’s been in the hospital ever since. I’m just so grateful that that close scare motivated her to actually commit to recovery for the first time. I’m so proud of her. Having friends that also have Ed’s is a roller coaster. But they’re the only people that get me.",
          "created_utc": 1615147595.0
        }
      ]
    },
    {
      "id": "gq8v8g0",
      "author": "GameofCheese",
      "body": "Thank you so much!  Hugs to you!!! ❤❤❤",
      "created_utc": 1615232328.0,
      "score": 1,
      "context": [
        {
          "id": "gq57hmb",
          "author": "None",
          "body": "Hey, thank you for writing all that. It's helpful for me to know that even after years of \"recovery,\" we will still struggle, because sometimes I feel alone as someone in my 30s. \n\nAlso, I totally relate to your determination to make it. It's so commendable and you deserve all the help you need to survive. Hang in there, and I'm sorry about your friend",
          "created_utc": 1615154254.0
        }
      ]
    },
    {
      "id": "gqauoyo",
      "author": "manicpanicbp",
      "body": "no thank you!!! i appreciate you so much❤️",
      "created_utc": 1615270336.0,
      "score": 3,
      "context": [
        {
          "id": "gq42006",
          "author": "manicpanicbp",
          "body": "thank you so much for sharing your story \n\nit sounded like you had a deep connection with your friend. people go in and out of our lives to teach us new things and experiences. she made a great impact on you from being your bathroom buddy/ best friend to teaching you how important it is to recover. \n\nafter listening to your story i believe that you truly have done the work. it is a long long battle but you said yourself that you have strong support systems and that is WONDERFUL- but even better it’s amazing that you changed your perspective and mindset internally. ❤️❤️❤️ your friend would be so happy and proud of you just like i am. i can’t imagine what you are going through but all i can say is to not beat yourself up if you relapse because growth is NOT linear. \n\nyou are grieving and this is stressful so all of your thoughts and feelings are 100p valid. is there anything you can do to bring you joy? or center yourself around people who make you smile? go for a walk maybe listen to a good podcast. try meditation or yoga. also it’s okay to not be okay too! \n\ntake all the time you need to heal❤️ and if you can’t trust yourself to make healthy coping decisions maybe ask someone to be with you or talk on the phone with. even chatting people online to get my energy or thoughts out has been an amazing outlet for me. \n\nagain thank you for sharing your story because now it has made a great impact on me and my perspective in recovery.\n\nsending my love❤️❤️❤️",
          "created_utc": 1615136667.0
        },
        {
          "id": "gq48cy6",
          "author": "GameofCheese",
          "body": "Omg.  Thank you for such a lovely thought out response.  It really gave me the little pep talk I needed.  I was just kinda in shock yesterday and really upset.  But today really is a much better day. \n\nI took my puppy to the dog park, opened the windows in the apt, and having been enjoying the fresh air and sunshine.  I think I really needed that. I'm gonna take a little nap with my pets and wake up and try to eat a good lunch... for 'A'.\n\nIt would make her sad to know that she triggered me in any way.  But it was the depression and grief talking and how do we deal with negative emotions?... stupid ED. Well fuck that voice and this disease...\n\nI'm gonna fight today. \n\nLove all that responded! And thank you so much for your thoughtful post!  💕",
          "created_utc": 1615139748.0
        }
      ]
    },
    {
      "id": "gq5h9s2",
      "author": "None",
      "body": "I do my best to support her. My recovery’s going pretty well and I’m at a lot more stable place, so I try my best to help her and keep her going. She’s the greatest friend I’ve ever had and I don’t know what I would do if I lost her.",
      "created_utc": 1615158801.0,
      "score": 3,
      "context": [
        {
          "id": "gq4rmiq",
          "author": "None",
          "body": "That regular obituary search for the friends you haven’t heard from... it’s so scary and stressful. My dearest friend died briefly last year from anorexia but luckily they were able to revive her. It was the scariest thing I’ve ever heard and she’s been in the hospital ever since. I’m just so grateful that that close scare motivated her to actually commit to recovery for the first time. I’m so proud of her. Having friends that also have Ed’s is a roller coaster. But they’re the only people that get me.",
          "created_utc": 1615147595.0
        },
        {
          "id": "gq4ypqe",
          "author": "GameofCheese",
          "body": "Omg I know.  I'm so so sorry to hear about your friend.  I hope with everything in my being she does get better. If you CAN be there for her, definitely be. I just wasn't strong enough unfortunately. Hugs!!!!",
          "created_utc": 1615150561.0
        }
      ]
    },
    {
      "id": "gqcsv7n",
      "author": "GameofCheese",
      "body": "No... YOU!! Lol.  🥰",
      "created_utc": 1615313346.0,
      "score": 3,
      "context": [
        {
          "id": "gq42006",
          "author": "manicpanicbp",
          "body": "thank you so much for sharing your story \n\nit sounded like you had a deep connection with your friend. people go in and out of our lives to teach us new things and experiences. she made a great impact on you from being your bathroom buddy/ best friend to teaching you how important it is to recover. \n\nafter listening to your story i believe that you truly have done the work. it is a long long battle but you said yourself that you have strong support systems and that is WONDERFUL- but even better it’s amazing that you changed your perspective and mindset internally. ❤️❤️❤️ your friend would be so happy and proud of you just like i am. i can’t imagine what you are going through but all i can say is to not beat yourself up if you relapse because growth is NOT linear. \n\nyou are grieving and this is stressful so all of your thoughts and feelings are 100p valid. is there anything you can do to bring you joy? or center yourself around people who make you smile? go for a walk maybe listen to a good podcast. try meditation or yoga. also it’s okay to not be okay too! \n\ntake all the time you need to heal❤️ and if you can’t trust yourself to make healthy coping decisions maybe ask someone to be with you or talk on the phone with. even chatting people online to get my energy or thoughts out has been an amazing outlet for me. \n\nagain thank you for sharing your story because now it has made a great impact on me and my perspective in recovery.\n\nsending my love❤️❤️❤️",
          "created_utc": 1615136667.0
        },
        {
          "id": "gq48cy6",
          "author": "GameofCheese",
          "body": "Omg.  Thank you for such a lovely thought out response.  It really gave me the little pep talk I needed.  I was just kinda in shock yesterday and really upset.  But today really is a much better day. \n\nI took my puppy to the dog park, opened the windows in the apt, and having been enjoying the fresh air and sunshine.  I think I really needed that. I'm gonna take a little nap with my pets and wake up and try to eat a good lunch... for 'A'.\n\nIt would make her sad to know that she triggered me in any way.  But it was the depression and grief talking and how do we deal with negative emotions?... stupid ED. Well fuck that voice and this disease...\n\nI'm gonna fight today. \n\nLove all that responded! And thank you so much for your thoughtful post!  💕",
          "created_utc": 1615139748.0
        },
        {
          "id": "gqauoyo",
          "author": "manicpanicbp",
          "body": "no thank you!!! i appreciate you so much❤️",
          "created_utc": 1615270336.0
        }
      ]
    },
    {
      "id": "gq8vgtl",
      "author": "GameofCheese",
      "body": "Yeah it's rough for sure! But your recovery comes first. If she gets too sick and resists recovery, sometimes tough love is all you can do.  I just hope you never have to go there! But I wish you guys all the best in the world!! 💕",
      "created_utc": 1615232430.0,
      "score": 2,
      "context": [
        {
          "id": "gq4rmiq",
          "author": "None",
          "body": "That regular obituary search for the friends you haven’t heard from... it’s so scary and stressful. My dearest friend died briefly last year from anorexia but luckily they were able to revive her. It was the scariest thing I’ve ever heard and she’s been in the hospital ever since. I’m just so grateful that that close scare motivated her to actually commit to recovery for the first time. I’m so proud of her. Having friends that also have Ed’s is a roller coaster. But they’re the only people that get me.",
          "created_utc": 1615147595.0
        },
        {
          "id": "gq4ypqe",
          "author": "GameofCheese",
          "body": "Omg I know.  I'm so so sorry to hear about your friend.  I hope with everything in my being she does get better. If you CAN be there for her, definitely be. I just wasn't strong enough unfortunately. Hugs!!!!",
          "created_utc": 1615150561.0
        },
        {
          "id": "gq5h9s2",
          "author": "None",
          "body": "I do my best to support her. My recovery’s going pretty well and I’m at a lot more stable place, so I try my best to help her and keep her going. She’s the greatest friend I’ve ever had and I don’t know what I would do if I lost her.",
          "created_utc": 1615158801.0
        }
      ]
    },
    {
      "id": "gq9naps",
      "author": "None",
      "body": "Thank you! Good luck on your recovery as well 💖💖💖",
      "created_utc": 1615245067.0,
      "score": 2,
      "context": [
        {
          "id": "gq4rmiq",
          "author": "None",
          "body": "That regular obituary search for the friends you haven’t heard from... it’s so scary and stressful. My dearest friend died briefly last year from anorexia but luckily they were able to revive her. It was the scariest thing I’ve ever heard and she’s been in the hospital ever since. I’m just so grateful that that close scare motivated her to actually commit to recovery for the first time. I’m so proud of her. Having friends that also have Ed’s is a roller coaster. But they’re the only people that get me.",
          "created_utc": 1615147595.0
        },
        {
          "id": "gq4ypqe",
          "author": "GameofCheese",
          "body": "Omg I know.  I'm so so sorry to hear about your friend.  I hope with everything in my being she does get better. If you CAN be there for her, definitely be. I just wasn't strong enough unfortunately. Hugs!!!!",
          "created_utc": 1615150561.0
        },
        {
          "id": "gq5h9s2",
          "author": "None",
          "body": "I do my best to support her. My recovery’s going pretty well and I’m at a lot more stable place, so I try my best to help her and keep her going. She’s the greatest friend I’ve ever had and I don’t know what I would do if I lost her.",
          "created_utc": 1615158801.0
        },
        {
          "id": "gq8vgtl",
          "author": "GameofCheese",
          "body": "Yeah it's rough for sure! But your recovery comes first. If she gets too sick and resists recovery, sometimes tough love is all you can do.  I just hope you never have to go there! But I wish you guys all the best in the world!! 💕",
          "created_utc": 1615232430.0
        }
      ]
    }
  ]
}