{
  "id": "m16hsl",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1615296893.0,
  "title": "Did I eat an entire container of yogurt covered pretzels last night?",
  "selftext": "Yes, I did. Even after eating a \"normal\" amount the whole day, and it was safe foods my ed was comfortable with. Am I still going to eat today? Yes. \n\nI left treatment two days ago and I made a promise I wouldn't let myself down again. I can't spend the rest of my life in and out of treatment centers. I'm on the waiting list somewhere from home but I'm so tired of people telling me how I need to recover and not knowing really shit about me or my body or where I should be. I was miserable and lonely at home and miserable and lonely there.\n\nI'm going to be 21 this year and the last thing I want to do is spend it a miserable, no energy ass, wreck. I want to look back and be proud of myself. \n\nI might be on a high right now but I'm going to keep pushing everyday and not expect failure. My body is hungry. I AM fucking hungry. You can't go from starving it to normal. It's something I'm going to have to accept if I ever wanna get better and stop cheating around it. \n\nSee you all at breakfast :^)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/m16hsl/did_i_eat_an_entire_container_of_yogurt_covered/",
  "score": 110,
  "num_comments": 4,
  "comments": [
    {
      "id": "gqc41h9",
      "author": "celestialee",
      "body": "yogurt covered pretzels are my favourite :) this post is amazing, you’re amazing, and thank you so much for sharing! i think i’ll go have some now too",
      "created_utc": 1615303448.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gqc5z6m",
      "author": "givemebackmybraincel",
      "body": "this made me feel sm better after the stupid ED part of my brain yelling at me all morning <3 thank you sm & i hope you're having a lovely day filled with great food !!",
      "created_utc": 1615304213.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gqcyx24",
      "author": "Imsuchamess4",
      "body": "KEEP GOING",
      "created_utc": 1615316219.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqdp6rr",
      "author": "FunkyBlueMohawkBird",
      "body": "Awh, proud of you! Your post made me feel better about what I've eaten today, and reminded me why we're doing this. Go get 'em, tiger. :)",
      "created_utc": 1615327979.0,
      "score": 3,
      "context": []
    }
  ]
}