{
  "id": "m3oqw1",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1615576364.0,
  "title": "1 whooooole ass year",
  "selftext": "I fucking did it.\n\nI made it to March 2021. I gave up purging, compulsive exercising, and food restriction every single day, for 366 days. I gained the weight, I honored my extreme hunger when there seemed to be no end in sight, I ignored the exceptionally terrible thoughts about myself every time my body demanded more food. I kept telling myself it wasn’t my fault that my brain was fucked up when I’d grip the new fat deposits distributed to my trunk and, in that moment, seriously contemplated relapse. On March 12, 2020, at approximately 10:30 am, I gave up the  simultaneously monotonous and chaotic lifestyle that is anorexia that I had been drowning in for years, and clung to recovery like it was my lifeline.\n\nI’m not foolish enough to call recovery a cakewalk, however. In fact, it’s been quite the opposite experience; the entire process has been the most difficult fucking thing I’ve ever had to do, to date. I cried almost every day for months, and I still frequently fall apart. As recently as December, I would say to myself over and over, “If I can’t be thin, I’d rather just be dead.” Absolute nothingness would have felt better than the constant psychological agony I was in every waking moment. \n\nOf course, despite the shitshow I perceived my own recovery to be, I now understand that a sick brain cannot think healthy thoughts until it is not sick anymore. A malnourished brain is a sick brain. So it’s no surprise to anyone that, when I was told things do in fact get better with time, I just had to trust them with nothing more than blind faith. “It gets better when you gain the weigh,” I naturally scoffed at such claims—I mean, haven’t we all? We all think *we’re* the exception. *I* was the exception. What if I’m always this hungry? What if I’m stuck in this disgusting blob of a meat sack for the rest of my life? What if I never accept myself post recovery? What if, what if, what if.\n\nSpoiler alert: I wasn’t the exception. I’m no longer consumed with thoughts about relapses and losing the overshoot weight.  The uncertainty will end. It just takes time, and I’m still in the midst of the unraveling of it all.\n\nNow, my fears haven’t necessarily dissipated. I’m still hyper aware of the physical sensations that my body experiences. The way fat folds when I sit, stand, bend down, breath in and out; the way my stomach dominates the space I take up, especially when I bloat; the way my shirts naturally fit tighter now that I’m no longer flat chested. I’m still terrified that this is my body now. And, naturally, it’s fucking uncomfortable. But Ive been telling myself, “I can tolerate my body just for today,” every single day for a year. What’s another year? Or two years?\n\nMy eating disorder has plagued me since childhood, and succeeded in digging it’s nails into my veins once more in early adulthood. Learning to cope with my body dysmorphia and this incessant need for control in healthy ways means flipping my whole world upside down. My body is still recovering, and the least I could do is give it some leeway. It unreasonable to expect my body to fit into such a tiny, rigid box when such rigidity is the very thing that was killing me to begin with.\n\nLong story short, I do believe recovery is worth it. And I hope you all choose it eventually, when you’re good and ready. ❤️\n\nI think I’ll do either a Q&A or a month-to-month overview of my recover and the psychological and physiological outcomes in the next day or so, so if there is anything you’d like to ask feel free to.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/m3oqw1/1_whooooole_ass_year/",
  "score": 98,
  "num_comments": 6,
  "comments": [
    {
      "id": "gqqlwu5",
      "author": "almondmilkbabie",
      "body": "Recovering in quarantine is hard af!!!! Congratulations!!!!! I started my quasi-recovery in September of 2019 and began fully allowing myself to recover around the same time as you. I am so happy I did it, but observing my body change again and again has been extremely exhausting. You’re right about it getting easier to accept. I gained so many hobbies and friends once I left my ED behind. It’s definitely worth it. I’m proud of us! :-)",
      "created_utc": 1615587045.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqreilv",
      "author": "None",
      "body": "I wish I had the balls to do this. So porud of you <3",
      "created_utc": 1615603125.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqq4tw9",
      "author": "YoungAcacia",
      "body": "Eskettit",
      "created_utc": 1615578866.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqrn2tn",
      "author": "None",
      "body": "Amazing!! So proud of you 💖",
      "created_utc": 1615608264.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqreriw",
      "author": "Sareeee48",
      "body": "I think the pandemic was what made it easier! My state went into lockdown *that night* and i am so happy it did because I went through a phase of extreme physical exhaustion for more than 2 months.\n\nI’m so glad you chose recovery as well!!! Look at us go 🥺",
      "created_utc": 1615603267.0,
      "score": 6,
      "context": [
        {
          "id": "gqqlwu5",
          "author": "almondmilkbabie",
          "body": "Recovering in quarantine is hard af!!!! Congratulations!!!!! I started my quasi-recovery in September of 2019 and began fully allowing myself to recover around the same time as you. I am so happy I did it, but observing my body change again and again has been extremely exhausting. You’re right about it getting easier to accept. I gained so many hobbies and friends once I left my ED behind. It’s definitely worth it. I’m proud of us! :-)",
          "created_utc": 1615587045.0
        }
      ]
    },
    {
      "id": "gqrejue",
      "author": "None",
      "body": "proud* sorry I'm drunk",
      "created_utc": 1615603145.0,
      "score": 2,
      "context": [
        {
          "id": "gqreilv",
          "author": "None",
          "body": "I wish I had the balls to do this. So porud of you <3",
          "created_utc": 1615603125.0
        }
      ]
    }
  ]
}