{
  "id": "m8qwyf",
  "subreddit": "fuckeatingdisorders",
  "author": "pipandmerry",
  "created_utc": 1616187511.0,
  "title": "“You’re not the first girl I’ve dated with an eating disorder...”",
  "selftext": "I just need to rant for a minute. \n\nI have been in recovery for 6 years. I do okay, sometimes I have symptoms and sometimes I act on them, but I’ll always get myself back on track. I’m in a place where I’m pretty content with the fact that I’ll always have an ED, and I’ll always be in recovery. It’s not daily excruciating pain anymore, it’s just a small occasional itch. \n\nBut it does eventually come up with any romantic partner that I get serious with. It’s still a part of my identity and I did some life long damage to my body. So it’s important to let them know about it. \n\nEVERY TIME, I swear, every single freaking time, they say “you’re not the only girl I’ve dated with an eating disorder, I wonder if that says something about me.”\n\nThese are nice, caring men. The man who said it a few days ago is someone that I’m currently head over heels for. But the second I tell ALL of them about my ED, they just lose all common sense. My ED suddenly becomes ABOUT THEM?!?\n\nAt this point, I always respond with either “I’m pretty sure everyone in this country has some type of ED” or “it’s tragically common, especially among women.” and yet they always try to bring it back to them. \n\nThere must be SOMETHING in THEIR nature that attracts them to women with EDs, or attracts women with EDs to them. It couldn’t possibly, for even a moment, be that 28.8 million Americans have a diagnosed ED. That having an ED is so glorified by TV and the internet that many more people will self diagnose. \n\nNo, not at all, it’s something about THEM. They must be so fucking caring or loving or accepting. Or maybe they’re just attracted to people with trauma? EFF ALL OF YOU!!! It makes me sick to think that my personal journey, something that took time and tears and pain to overcome, is now being used as this guy’s ego boost or weird moment of self analysis or whatever. \n\nMy ED, and the ED of all of the other women you dated, have nothing to do with you, you selfish pig. Having an ED is just an extremely common problem in our society, and if you date, you’re bound to date someone who has had one. And your refusal to acknowledge that or desire to use it as some sort of badge for yourself just continues the narrative that an ED makes a person unique. \n\nIt doesn’t make you unique, if anything it makes you human, and dating someone with one doesn’t mean you’re special, if means you’re alive and going on dates.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/m8qwyf/youre_not_the_first_girl_ive_dated_with_an_eating/",
  "score": 169,
  "num_comments": 18,
  "comments": [
    {
      "id": "grj38kq",
      "author": "None",
      "body": "Big YIKES at these comments! I hate them too! Dr. Jennifer Gaudiani is an internist with one of the biggest ED clinics in the US. She often refers to ED patients as brave, amazing, and intelligent humans. Aka regular humans who have found a way to cope with and survive their trauma and experiences like anyone else. Hate that people single it out and make it out like it’s this ultra rare and unlikely disorder.\n\nPlus, when I was in treatment I met so many different people of different kinds. All ages, sizes, races, mental illnesses, sexualities, genders and backgrounds. This is because EDs don’t discriminate and affect people of all different communities. No one is immune. So, the idea that all of someone’s exes having being alike simply because they all struggled with one of a cluster of varied mental illnesses literally means nothing lol like they could all have nothing in common at all including the eating disorder itself.",
      "created_utc": 1616191888.0,
      "score": 49,
      "context": []
    },
    {
      "id": "grjriz6",
      "author": "acousticbruises",
      "body": "Oof lady that is tough tough tough. It's especially hard when you're SO into someone and they drop a stupid bomb like that. \n\nIf you're gonna keep going out with him I'd suggest that you sit him down and say something like \"Look, I know you probably didn't mean anything offensive by what you said. However, I was trying to open up to you about something incredibly vulnerable and by saying what you did all it did was flip the conversation to being about you. EDs are an epidemic, statistically it's just a matter of time before you date a woman with one. To make it about you reduces mine and other women's struggles to being about you is hurtful.\"\n\nUghhh idk lady. ): again I'm so sorry, sending you love.",
      "created_utc": 1616205138.0,
      "score": 15,
      "context": []
    },
    {
      "id": "grjjuzp",
      "author": "StrawberryCow55",
      "body": "Its especially fun when they use *their* past experience with eating disorders to invalidate you! \"Oh my ex had an eating disorder- she literally COULDN'T eat- and you can sooo- you don't have an eating disorder 😌\"",
      "created_utc": 1616200868.0,
      "score": 33,
      "context": []
    },
    {
      "id": "grkimo8",
      "author": "dortuh",
      "body": "WOW THANKS FOR PUTTING IT INTO WORDS I HATE THIS SHIT. I hate how men react to my ED in like all ways.",
      "created_utc": 1616225203.0,
      "score": 9,
      "context": []
    },
    {
      "id": "grjofzf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1616203435.0,
      "score": 19,
      "context": []
    },
    {
      "id": "grkdjkc",
      "author": "elleareby",
      "body": "This took me right back to one of my exes worst moments: “not surprised...every girl gets skinny after me” when I told him the stress of our relationship had helped me to drop weight quickly. And he knew I was actively bulimic at the time! Total dick. But yeah, I suggest just explaining that it’s a really difficult topic for you and that you were hurt by him not listening fully to what you were trying to say. Whenever I talk about my eating issues I preface it with “I’m sensitive about this and it’s really hard to talk about” so they know I’m about to share some deep shit and to just stfu and be supportive lol",
      "created_utc": 1616220231.0,
      "score": 9,
      "context": []
    },
    {
      "id": "grjbua0",
      "author": "ontopofyourmom",
      "body": "It's such a ridiculous idea to begin with. People need to mind their own business. I know probably three women who are so thin that they are almost certainly either restricting or have a non-ED health problem. And it's none of my business. I know more than three women who have EDs, and I'd never guess by looking at them. Also none of my business. It would be creepy to even bring up the subject in any context, I think even in a committed relationship (although that is more complicated).\n\nSame goes for any other health condition. I've dated a number of women who have ADHD, and, like you say, it has nothing to do with me. There are tens of millions of people who have it. My current girlfriend has it and it often works its way into conversations, but only when it's relevant.\n\nA guy who talks this way is (consciously or not) attempting some kind of gaslighting or attempt at control by continuing to bring up a stigmatized and traumatic condition that he can hold over your head. It's not an ego boost. It's emotional abuse. \n\nSource: I've been emotionally abusive in other ways and I've learned to recognize it.\n\n(Ordinary male ego boosts generally involve success at sports, accomplishing difficult tasks, or hooking up with women who they deem to be \"out of their league.\" If a man feels like he is getting an ego boost by being violent or abusive, he is a psychopath.)",
      "created_utc": 1616196453.0,
      "score": 8,
      "context": []
    },
    {
      "id": "grj3qzm",
      "author": "pipandmerry",
      "body": "Right?!? It’s such a different experience and comes from a different place for everyone. Ugh it just really gets to me. It’s like...thanks for taking my moment of vulnerability and twisting it into your manic pixie dream girl fantasy. I get that it probably comes from a lacking or understanding and awkwardness, but it just makes me so frustrated.",
      "created_utc": 1616192152.0,
      "score": 13,
      "context": [
        {
          "id": "grj38kq",
          "author": "None",
          "body": "Big YIKES at these comments! I hate them too! Dr. Jennifer Gaudiani is an internist with one of the biggest ED clinics in the US. She often refers to ED patients as brave, amazing, and intelligent humans. Aka regular humans who have found a way to cope with and survive their trauma and experiences like anyone else. Hate that people single it out and make it out like it’s this ultra rare and unlikely disorder.\n\nPlus, when I was in treatment I met so many different people of different kinds. All ages, sizes, races, mental illnesses, sexualities, genders and backgrounds. This is because EDs don’t discriminate and affect people of all different communities. No one is immune. So, the idea that all of someone’s exes having being alike simply because they all struggled with one of a cluster of varied mental illnesses literally means nothing lol like they could all have nothing in common at all including the eating disorder itself.",
          "created_utc": 1616191888.0
        }
      ]
    },
    {
      "id": "grrwtu7",
      "author": "thanksfortalking",
      "body": "Eeeek, I had an ex who knew about my mental health history and felt the need to go on a giant rant and cry about his ex being hospitalized for EDNOS and how hard it was for him because he loved her so much. And he did it while I was in his car, not that close to my house, so it would have to be a significant amount of effort for me to get home. Having never been hospitalized myself, something about the way he was discussing things seemed obnoxious. (He loved having these weird, nonsensical pity parties all the time, usually for manipulative reasons. Like, he was THAT guy who had a random, nameless relative \"die\" every time I wanted to break up with him.)\n\nGlad I might never have to speak to that manipulator again.\n\nSorry for the rant :/",
      "created_utc": 1616383873.0,
      "score": 2,
      "context": [
        {
          "id": "grjjuzp",
          "author": "StrawberryCow55",
          "body": "Its especially fun when they use *their* past experience with eating disorders to invalidate you! \"Oh my ex had an eating disorder- she literally COULDN'T eat- and you can sooo- you don't have an eating disorder 😌\"",
          "created_utc": 1616200868.0
        }
      ]
    },
    {
      "id": "grkyntf",
      "author": "pipandmerry",
      "body": "Right?!? I had an ex once tell his friend about my ED (a friend that was actively nasty towards me on multiple occasions) because she mentioned that she might be going to my group therapy to support her friend with an ED. \n\nHis excuse was “well she’d already invested that secret in me, and I wanted to warn her that we might also be there.”\n\nI was so livid that he didn’t keep his mouth shut and then come home and warn ME that they might be there. But even more, I was pissed that these two people without EDs were just hanging out spilling secrets that weren’t theirs to spill.",
      "created_utc": 1616241918.0,
      "score": 5,
      "context": [
        {
          "id": "grkimo8",
          "author": "dortuh",
          "body": "WOW THANKS FOR PUTTING IT INTO WORDS I HATE THIS SHIT. I hate how men react to my ED in like all ways.",
          "created_utc": 1616225203.0
        }
      ]
    },
    {
      "id": "grkgw67",
      "author": "standsure",
      "body": "Don’t forget a donkey...",
      "created_utc": 1616223431.0,
      "score": 8,
      "context": [
        {
          "id": "grjofzf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1616203435.0
        }
      ]
    },
    {
      "id": "grkjv46",
      "author": "somegenerichandle",
      "body": "Glad he's your ex now.",
      "created_utc": 1616226499.0,
      "score": 7,
      "context": [
        {
          "id": "grkdjkc",
          "author": "elleareby",
          "body": "This took me right back to one of my exes worst moments: “not surprised...every girl gets skinny after me” when I told him the stress of our relationship had helped me to drop weight quickly. And he knew I was actively bulimic at the time! Total dick. But yeah, I suggest just explaining that it’s a really difficult topic for you and that you were hurt by him not listening fully to what you were trying to say. Whenever I talk about my eating issues I preface it with “I’m sensitive about this and it’s really hard to talk about” so they know I’m about to share some deep shit and to just stfu and be supportive lol",
          "created_utc": 1616220231.0
        }
      ]
    },
    {
      "id": "grj4b0a",
      "author": "None",
      "body": "Yep, I also always wonder if people who say this shit were around people who just weren’t taking their EDs seriously? I know people who have EDs who aren’t seeking treatment or attempting recovery and they have a tendency to try to normalize the ED things and make light of it all because they don’t want to ring anyone’s alarm bells. So, then the people around them only pick up on ED stuff as them being quirky or “weird with food.”\n\nEither way, it’s dumb because Google exists. Like just look up the stats and read an article or too. There’s loads of information out there. Even if their comments are coming from a place of awkwardness, they’re still very cringey!",
      "created_utc": 1616192434.0,
      "score": 11,
      "context": [
        {
          "id": "grj38kq",
          "author": "None",
          "body": "Big YIKES at these comments! I hate them too! Dr. Jennifer Gaudiani is an internist with one of the biggest ED clinics in the US. She often refers to ED patients as brave, amazing, and intelligent humans. Aka regular humans who have found a way to cope with and survive their trauma and experiences like anyone else. Hate that people single it out and make it out like it’s this ultra rare and unlikely disorder.\n\nPlus, when I was in treatment I met so many different people of different kinds. All ages, sizes, races, mental illnesses, sexualities, genders and backgrounds. This is because EDs don’t discriminate and affect people of all different communities. No one is immune. So, the idea that all of someone’s exes having being alike simply because they all struggled with one of a cluster of varied mental illnesses literally means nothing lol like they could all have nothing in common at all including the eating disorder itself.",
          "created_utc": 1616191888.0
        },
        {
          "id": "grj3qzm",
          "author": "pipandmerry",
          "body": "Right?!? It’s such a different experience and comes from a different place for everyone. Ugh it just really gets to me. It’s like...thanks for taking my moment of vulnerability and twisting it into your manic pixie dream girl fantasy. I get that it probably comes from a lacking or understanding and awkwardness, but it just makes me so frustrated.",
          "created_utc": 1616192152.0
        }
      ]
    },
    {
      "id": "grvk238",
      "author": "StrawberryCow55",
      "body": "No need to apologize!! I am so sorry- that is such a fucking uncomfortable position to be in- ahhhh it makes my skin crawl. Im so glad you got away from him!!",
      "created_utc": 1616460342.0,
      "score": 2,
      "context": [
        {
          "id": "grjjuzp",
          "author": "StrawberryCow55",
          "body": "Its especially fun when they use *their* past experience with eating disorders to invalidate you! \"Oh my ex had an eating disorder- she literally COULDN'T eat- and you can sooo- you don't have an eating disorder 😌\"",
          "created_utc": 1616200868.0
        },
        {
          "id": "grrwtu7",
          "author": "thanksfortalking",
          "body": "Eeeek, I had an ex who knew about my mental health history and felt the need to go on a giant rant and cry about his ex being hospitalized for EDNOS and how hard it was for him because he loved her so much. And he did it while I was in his car, not that close to my house, so it would have to be a significant amount of effort for me to get home. Having never been hospitalized myself, something about the way he was discussing things seemed obnoxious. (He loved having these weird, nonsensical pity parties all the time, usually for manipulative reasons. Like, he was THAT guy who had a random, nameless relative \"die\" every time I wanted to break up with him.)\n\nGlad I might never have to speak to that manipulator again.\n\nSorry for the rant :/",
          "created_utc": 1616383873.0
        }
      ]
    },
    {
      "id": "grm99ir",
      "author": "dortuh",
      "body": "Wow I want to assume that people are nice enough to know this isn't something you just tell people 😡",
      "created_utc": 1616267558.0,
      "score": 2,
      "context": [
        {
          "id": "grkimo8",
          "author": "dortuh",
          "body": "WOW THANKS FOR PUTTING IT INTO WORDS I HATE THIS SHIT. I hate how men react to my ED in like all ways.",
          "created_utc": 1616225203.0
        },
        {
          "id": "grkyntf",
          "author": "pipandmerry",
          "body": "Right?!? I had an ex once tell his friend about my ED (a friend that was actively nasty towards me on multiple occasions) because she mentioned that she might be going to my group therapy to support her friend with an ED. \n\nHis excuse was “well she’d already invested that secret in me, and I wanted to warn her that we might also be there.”\n\nI was so livid that he didn’t keep his mouth shut and then come home and warn ME that they might be there. But even more, I was pissed that these two people without EDs were just hanging out spilling secrets that weren’t theirs to spill.",
          "created_utc": 1616241918.0
        }
      ]
    },
    {
      "id": "grjes0n",
      "author": "pipandmerry",
      "body": "I think that’s totally the case. Once you start treatment and going to therapy and joining groups, you learn a new way of talking about it and expressing it. They don’t have any of that background, so they’re so insensitive. \n\nThey either dated someone that didn’t talk about it, had “strange habits” they just accepted, or was emotionally up and down (or all three) without having the vocabulary to describe communicate how they were actually feeling. \n\nI understand that people can’t Google every single thing. I wish people took the time to educate themselves, but if you’re not going to educate yourself HUSH ABOUT YOUR DUMB EXPERIENCES AND LET ME TALK! This is my moment to educate you on my challenges.",
      "created_utc": 1616198065.0,
      "score": 9,
      "context": [
        {
          "id": "grj38kq",
          "author": "None",
          "body": "Big YIKES at these comments! I hate them too! Dr. Jennifer Gaudiani is an internist with one of the biggest ED clinics in the US. She often refers to ED patients as brave, amazing, and intelligent humans. Aka regular humans who have found a way to cope with and survive their trauma and experiences like anyone else. Hate that people single it out and make it out like it’s this ultra rare and unlikely disorder.\n\nPlus, when I was in treatment I met so many different people of different kinds. All ages, sizes, races, mental illnesses, sexualities, genders and backgrounds. This is because EDs don’t discriminate and affect people of all different communities. No one is immune. So, the idea that all of someone’s exes having being alike simply because they all struggled with one of a cluster of varied mental illnesses literally means nothing lol like they could all have nothing in common at all including the eating disorder itself.",
          "created_utc": 1616191888.0
        },
        {
          "id": "grj3qzm",
          "author": "pipandmerry",
          "body": "Right?!? It’s such a different experience and comes from a different place for everyone. Ugh it just really gets to me. It’s like...thanks for taking my moment of vulnerability and twisting it into your manic pixie dream girl fantasy. I get that it probably comes from a lacking or understanding and awkwardness, but it just makes me so frustrated.",
          "created_utc": 1616192152.0
        },
        {
          "id": "grj4b0a",
          "author": "None",
          "body": "Yep, I also always wonder if people who say this shit were around people who just weren’t taking their EDs seriously? I know people who have EDs who aren’t seeking treatment or attempting recovery and they have a tendency to try to normalize the ED things and make light of it all because they don’t want to ring anyone’s alarm bells. So, then the people around them only pick up on ED stuff as them being quirky or “weird with food.”\n\nEither way, it’s dumb because Google exists. Like just look up the stats and read an article or too. There’s loads of information out there. Even if their comments are coming from a place of awkwardness, they’re still very cringey!",
          "created_utc": 1616192434.0
        }
      ]
    },
    {
      "id": "grvq8b6",
      "author": "thanksfortalking",
      "body": "Thanks! Me too :P",
      "created_utc": 1616463569.0,
      "score": 2,
      "context": [
        {
          "id": "grjjuzp",
          "author": "StrawberryCow55",
          "body": "Its especially fun when they use *their* past experience with eating disorders to invalidate you! \"Oh my ex had an eating disorder- she literally COULDN'T eat- and you can sooo- you don't have an eating disorder 😌\"",
          "created_utc": 1616200868.0
        },
        {
          "id": "grrwtu7",
          "author": "thanksfortalking",
          "body": "Eeeek, I had an ex who knew about my mental health history and felt the need to go on a giant rant and cry about his ex being hospitalized for EDNOS and how hard it was for him because he loved her so much. And he did it while I was in his car, not that close to my house, so it would have to be a significant amount of effort for me to get home. Having never been hospitalized myself, something about the way he was discussing things seemed obnoxious. (He loved having these weird, nonsensical pity parties all the time, usually for manipulative reasons. Like, he was THAT guy who had a random, nameless relative \"die\" every time I wanted to break up with him.)\n\nGlad I might never have to speak to that manipulator again.\n\nSorry for the rant :/",
          "created_utc": 1616383873.0
        },
        {
          "id": "grvk238",
          "author": "StrawberryCow55",
          "body": "No need to apologize!! I am so sorry- that is such a fucking uncomfortable position to be in- ahhhh it makes my skin crawl. Im so glad you got away from him!!",
          "created_utc": 1616460342.0
        }
      ]
    },
    {
      "id": "grmzurd",
      "author": "pipandmerry",
      "body": "He definitely saw how messed up it was when I got upset and explained it to him, but it’s bonkers to me that “she told me about her friend’s ED so it’s only fair that I tell her about yours” was his immediate thought process.",
      "created_utc": 1616279145.0,
      "score": 3,
      "context": [
        {
          "id": "grkimo8",
          "author": "dortuh",
          "body": "WOW THANKS FOR PUTTING IT INTO WORDS I HATE THIS SHIT. I hate how men react to my ED in like all ways.",
          "created_utc": 1616225203.0
        },
        {
          "id": "grkyntf",
          "author": "pipandmerry",
          "body": "Right?!? I had an ex once tell his friend about my ED (a friend that was actively nasty towards me on multiple occasions) because she mentioned that she might be going to my group therapy to support her friend with an ED. \n\nHis excuse was “well she’d already invested that secret in me, and I wanted to warn her that we might also be there.”\n\nI was so livid that he didn’t keep his mouth shut and then come home and warn ME that they might be there. But even more, I was pissed that these two people without EDs were just hanging out spilling secrets that weren’t theirs to spill.",
          "created_utc": 1616241918.0
        },
        {
          "id": "grm99ir",
          "author": "dortuh",
          "body": "Wow I want to assume that people are nice enough to know this isn't something you just tell people 😡",
          "created_utc": 1616267558.0
        }
      ]
    },
    {
      "id": "grn06bx",
      "author": "dortuh",
      "body": "Boys can be so damn dumb",
      "created_utc": 1616279285.0,
      "score": 1,
      "context": [
        {
          "id": "grkimo8",
          "author": "dortuh",
          "body": "WOW THANKS FOR PUTTING IT INTO WORDS I HATE THIS SHIT. I hate how men react to my ED in like all ways.",
          "created_utc": 1616225203.0
        },
        {
          "id": "grkyntf",
          "author": "pipandmerry",
          "body": "Right?!? I had an ex once tell his friend about my ED (a friend that was actively nasty towards me on multiple occasions) because she mentioned that she might be going to my group therapy to support her friend with an ED. \n\nHis excuse was “well she’d already invested that secret in me, and I wanted to warn her that we might also be there.”\n\nI was so livid that he didn’t keep his mouth shut and then come home and warn ME that they might be there. But even more, I was pissed that these two people without EDs were just hanging out spilling secrets that weren’t theirs to spill.",
          "created_utc": 1616241918.0
        },
        {
          "id": "grm99ir",
          "author": "dortuh",
          "body": "Wow I want to assume that people are nice enough to know this isn't something you just tell people 😡",
          "created_utc": 1616267558.0
        },
        {
          "id": "grmzurd",
          "author": "pipandmerry",
          "body": "He definitely saw how messed up it was when I got upset and explained it to him, but it’s bonkers to me that “she told me about her friend’s ED so it’s only fair that I tell her about yours” was his immediate thought process.",
          "created_utc": 1616279145.0
        }
      ]
    }
  ]
}