{
  "id": "mdkuqu",
  "subreddit": "fuckeatingdisorders",
  "author": "throwawayaway273",
  "created_utc": 1616751013.0,
  "title": "Daily reminder ED has nothing to do with how your body actually looks",
  "selftext": "It’s a demonic voice that tells you you need to look another way. It will not go away even when you “reached” your “ideal goal”—your goal will just keep changing and changing. It will just keep telling you you need to keep restricting and it will never never be enough. It’s not about how you look, it’s about how you feel about yourself and that will not change by how much you weigh and how you think you look. \n\n\nStumbled upon pictures of myself when I was 13 and I was so surprised by how extremely skinny I was. I was like a skeleton and yet I thought I was so so obese and everyone is “disgusted” by me (damn the internalized fat-phobia). I still thought I needed to restrict. I felt the same way I feel about my body now. It’s not about how my body looks or how much I weigh—if I didn’t feel happy about my body then, i will never feel happy about my body through trying to lose weight. \n\nFirst time posting here so if I broke any rules please lemme know and I will make the changes :) my Ed is relapsing recently and just wanna come to somewhere where people would understand and share some recovery thoughts. I wish everyone luck in their recovery!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mdkuqu/daily_reminder_ed_has_nothing_to_do_with_how_your/",
  "score": 107,
  "num_comments": 5,
  "comments": [
    {
      "id": "gsa222l",
      "author": "None",
      "body": "Idk I'm 100% sure that if I didn't carry the trauma of growing up overweight I wouldn't have starved myself and developed an ED. Biggest thing keeping me from recovering is my appearance because I 1) grew up fat and felt worse than during restriction, I still have the hanging skin and other things caused by it and 2) have physical abnormalities that will keep me ugly even if I'm skinny. My knock knees and overall bad posture are probably even caused by the extra weight growing up, but there are others too.\nI don't want to let myself get back to that. I've never been skinny and it's not just my own perception. For 15 years of my life I did not know what it felt like to lay down without feeling uncomfortable, sweaty folds of fat, or to be anything else than the worst at PE.\nYou live in your body everyday, and you and your body live in this world everyday. This all influences you mentally. I know it's different for everyone, but my ED is almost completely caused by my unfortunate appearance and I know it.",
      "created_utc": 1616757525.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gsa9492",
      "author": "LittlePurrx",
      "body": "At 12-13 I would wear massive hoodies to hide the \"fat\" (was underweight so there was none). But then by 15 I was actually quite alright about how my body looked - underweight anorexic still. It was not really about how my body looked. I liked feeling the bones because then I felt less abstract. It was as if seeing/feeling my bones kept me grounded. I really think ED is a lot more than just about our bodies. It's about self worth, about being allowed/deserving to eat, being allowed/deserving to relax, it can also be a subconscious way to get control if you feel you have no control over your life. My ED is always there no matter what size or shape my body is, it's so much bigger than body image alone.",
      "created_utc": 1616762185.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gsa6cf6",
      "author": "None",
      "body": "I think what OP means is the voice in your head telling you you're not good enough is just a liar. You can be objectively plus sized and have an ED, or objectively thin and have an ED, but at any size getting thinner won't make you happy, it won't make the voices to away, it won't cure the disorder. Your ED isn't a result of you being too big or too knock kneed or whatever, your ED is the one telling you it's bad to look the way you look. Think of it this way, if someone asked one of your loved ones to describe you, do you think they'd say the things you wrote about yourself? No way. They'd say all the things they love about you. Your perception of your weight may or may not be morphed by your ED but your perception of yourself is.",
      "created_utc": 1616760484.0,
      "score": 11,
      "context": [
        {
          "id": "gsa222l",
          "author": "None",
          "body": "Idk I'm 100% sure that if I didn't carry the trauma of growing up overweight I wouldn't have starved myself and developed an ED. Biggest thing keeping me from recovering is my appearance because I 1) grew up fat and felt worse than during restriction, I still have the hanging skin and other things caused by it and 2) have physical abnormalities that will keep me ugly even if I'm skinny. My knock knees and overall bad posture are probably even caused by the extra weight growing up, but there are others too.\nI don't want to let myself get back to that. I've never been skinny and it's not just my own perception. For 15 years of my life I did not know what it felt like to lay down without feeling uncomfortable, sweaty folds of fat, or to be anything else than the worst at PE.\nYou live in your body everyday, and you and your body live in this world everyday. This all influences you mentally. I know it's different for everyone, but my ED is almost completely caused by my unfortunate appearance and I know it.",
          "created_utc": 1616757525.0
        }
      ]
    },
    {
      "id": "gsln6ev",
      "author": "throwawayaway273",
      "body": "Hi there! I was the chubby kid that got picked on before I hit puberty and grew a lot of height in a short period of time and became “skinny”. I could say the reason was I was “chubby” and got picked on and it damaged my body image and self esteems too, but I realized that I would always think I’m disgusting and fat no matter how I actually look like. Having a healthy relationship with ones body means one won’t feel overwhelming and debilitating negative emotions no matter what they look like, and having Ed makes one have a very skewed and negative outlook of one’s appearance! It may seem like the reason that one developed Ed but I feel like seeing ones body very negatively to the point it’s damaging mentally is merely another symptom of ED. One could be “obese” (in quotation marks because bmi is really outdated, but anyways I’m referring to a case if one think their weight is hindering their mental and physical health), want to lose weight, and still not have overwhelming negative feelings of ones body. Those who don’t have ED or BDD won’t see their body rolls as “disgusting”, and it certainly won’t for them be the reason to restrain on an unhealthy degree and struggle with food! No one is “disgusting”, and if you think about your friends and loved ones, they may weigh more than average or the same weight / body type as you, you certainly won’t think they are “disgusting” and you still love them for who they are :) just want to say hating your body is a side effect or symptom of ED, and you deserve to be comfortable with your body no matter what. Like I said in the post, at the time when I was objectively very skinny I really thought I was physically disgusting, and think oh how my thighs and my belly are so fat my face is too chubby etc etc and it’s really just in my head. The voice that’s telling you “you look bad that’s why you don’t deserve food/you must restrict” is evil and it’s really lying to you most of the time, because in reality, 1 it is that voice that’s telling you you look bad and i can guarantee no one looks nearly nearly as bad as what their ED voice tells them 2 even when one achieve the ultimate heroin chic “beauty standard” the voice won’t go away.",
      "created_utc": 1616953985.0,
      "score": 0,
      "context": [
        {
          "id": "gsa222l",
          "author": "None",
          "body": "Idk I'm 100% sure that if I didn't carry the trauma of growing up overweight I wouldn't have starved myself and developed an ED. Biggest thing keeping me from recovering is my appearance because I 1) grew up fat and felt worse than during restriction, I still have the hanging skin and other things caused by it and 2) have physical abnormalities that will keep me ugly even if I'm skinny. My knock knees and overall bad posture are probably even caused by the extra weight growing up, but there are others too.\nI don't want to let myself get back to that. I've never been skinny and it's not just my own perception. For 15 years of my life I did not know what it felt like to lay down without feeling uncomfortable, sweaty folds of fat, or to be anything else than the worst at PE.\nYou live in your body everyday, and you and your body live in this world everyday. This all influences you mentally. I know it's different for everyone, but my ED is almost completely caused by my unfortunate appearance and I know it.",
          "created_utc": 1616757525.0
        }
      ]
    },
    {
      "id": "gslkbrq",
      "author": "throwawayaway273",
      "body": "Exactly ❤️ it is not about “achieving” certain looks it’s really about being comfortable with yourself",
      "created_utc": 1616952650.0,
      "score": 1,
      "context": [
        {
          "id": "gsa9492",
          "author": "LittlePurrx",
          "body": "At 12-13 I would wear massive hoodies to hide the \"fat\" (was underweight so there was none). But then by 15 I was actually quite alright about how my body looked - underweight anorexic still. It was not really about how my body looked. I liked feeling the bones because then I felt less abstract. It was as if seeing/feeling my bones kept me grounded. I really think ED is a lot more than just about our bodies. It's about self worth, about being allowed/deserving to eat, being allowed/deserving to relax, it can also be a subconscious way to get control if you feel you have no control over your life. My ED is always there no matter what size or shape my body is, it's so much bigger than body image alone.",
          "created_utc": 1616762185.0
        }
      ]
    }
  ]
}