{
  "id": "medjsg",
  "subreddit": "fuckeatingdisorders",
  "author": "Yeetusdeletuszefetus",
  "created_utc": 1616850796.0,
  "title": "Just occurred to me how long it's been since I last googled the amount of calories in x food.",
  "selftext": "I've even forgotten how many calories were in some of them, and gotten along to eating the fear foods I swore I'd never touch again! I can't believe I ever thought me reaching this point was unfathomable. \n\nI have to admit that it's not easy, and there is still a long road ahead of me but my attitude towards food and its natural effects on my body has improved hugely. So much that whenever I feel down I think of how far I've come and it's what keeps me going. Sorry for talking too much abt myself, I just haven't been this proud of myself in a while and felt the need to get it off my chest. \n\nAnd to those of you who may be reading this right now: Good luck on your journeys. I know you can overcome these habits. You might feel as if they'll be stuck with you forever or that you'll never be able to get rid of them, but that's just at the beginning - remember I and many others have felt that way too at the start. Last of all don't underestimate yourself. You are so much stronger than you think *hugs* <3",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/medjsg/just_occurred_to_me_how_long_its_been_since_i/",
  "score": 89,
  "num_comments": 3,
  "comments": [
    {
      "id": "gsfzpri",
      "author": "Sareeee48",
      "body": "This is awesome! I’ve recently broke calorie counting (for the most part—I’m struggling not to count in my head), and this is where I’m hoping to be 🥺",
      "created_utc": 1616851062.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gsitv5w",
      "author": "bread-babies",
      "body": "ahhh you made me realize that i'm experiencing this too!!! omg thank you for sharing, i'm so proud of your growth",
      "created_utc": 1616886872.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsg7od1",
      "author": "Yeetusdeletuszefetus",
      "body": "Sending lots of encouragement and love your way!!! Keep going, just make sure to move at a comfortable pace and don't put too much pressure on yourself. ❤️ you'll be there soon",
      "created_utc": 1616853926.0,
      "score": 4,
      "context": [
        {
          "id": "gsfzpri",
          "author": "Sareeee48",
          "body": "This is awesome! I’ve recently broke calorie counting (for the most part—I’m struggling not to count in my head), and this is where I’m hoping to be 🥺",
          "created_utc": 1616851062.0
        }
      ]
    }
  ]
}