{
  "id": "mepbxi",
  "subreddit": "fuckeatingdisorders",
  "author": "bluewaffle9",
  "created_utc": 1616887410.0,
  "title": "How did you family react when they found out you had an ED?",
  "selftext": "People are always like “honey just tell some one about your problems, you need your family’s support.” So I hoped my family would hug me and be like “oh sweetie it’s ok, tell me anything, we’ll get through this together,” but no. They screamed at me and made me feel like the most evil person in the world even after i gave a genuine apology. What about you?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mepbxi/how_did_you_family_react_when_they_found_out_you/",
  "score": 90,
  "num_comments": 28,
  "comments": [
    {
      "id": "gsiy7s6",
      "author": "Iscariiot",
      "body": "My mother has a history of being emotionally abusive toward me, especially in times of distress. I won’t get into the things she’s said/done to me- but it’s been really really bad before.\n\nThat said, telling her about my ED caused a different response than any other reveal. She jumped into action instantly- getting me into residential treatment and doing her best to support me through CONSTANT outbursts inside and outside of Res. And we’ve had a number of good conversations surrounding it in the last year. Idk why she stepped up for this one but I’m grateful.",
      "created_utc": 1616889252.0,
      "score": 38,
      "context": []
    },
    {
      "id": "gsiywzj",
      "author": "Sareeee48",
      "body": "My family and family friends knew before I even considered the possibility, but it became a pattern of them voicing their concerns as gently as they could and me becoming angry or frustrated and telling them over and over that I was fine. It got to the point that they just stopped telling me... but once I started to recover they’ve all been super supportive... save for my dad and my mom. Dad doesn’t believe in mental illness and my mom just dismisses everything I say.\n\nFuck your family. Anyone who screams at you for your mental illnesses and makes you feel bad about them are abusive as fuck and don’t deserve you. I hope you can get away from them because fucking gross.",
      "created_utc": 1616889637.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gsivuib",
      "author": "Departure_Level",
      "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
      "created_utc": 1616887976.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gsjcr4i",
      "author": "None",
      "body": "My mum and my dad sat me in the kitchen and screamed at me for like an hour making me feel like I was doing all this just to hurt them :/ . Now they're much more understanding tho",
      "created_utc": 1616895835.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gsj0mso",
      "author": "alexisseffy",
      "body": "My parents suspected my ED for a while since I hid it from them. One day, since things weren't getting better, they gave me the choice of \"just eat\" or professional help. So I chose to talk to my pediatrician and tell her about my ED. Now I see my doctor every few weeks for weigh ins, see a dietitian weekly, and am starting to see a therapist weekly. I'm grateful that my experience went fairly well!",
      "created_utc": 1616890592.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gsjko41",
      "author": "bunny_chuuuu",
      "body": "My mom didn’t believe after 3 times I told her and yelled at me because she said I couldn’t have an ED because I still ate and that I’m putting this idea in my head even after I talked to my doctor :( She finally took it seriously after my weight got really low but she didn’t take me to the therapy the doctor suggested for me. She still doesn’t call it my ED she just called it “the time I didn’t eat”",
      "created_utc": 1616900297.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gsjg5ip",
      "author": "kkzeus",
      "body": "My mom says I never had an ED, I just didn’t eat often.... I was nearly hospitalized and threatened to be tubed..",
      "created_utc": 1616897779.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gsm30ky",
      "author": "None",
      "body": "while everyone’s experiences are valid and i genuinely feel bad for all of the bad ones, this thread will probably do more harm than good in the long run. \n\nfor anyone reading this, don’t let this thread discourage you from opening up to your family about your issues. there is no way to know how they’re going to react and the reaction may very well be positive and supportive. and if they’re not, it is not the end of the world and there are ways to help you cope and heal from it. eating disorders thrive in secrecy, so opening up is a huge recovery tool.",
      "created_utc": 1616961724.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gsjlhxm",
      "author": "squareCat99",
      "body": "I'm so sorry this happened to you, it's so disappointing when you're terrified of telling them and then get a completely unhelpful reaction.   My mom was initially super supportive and just wanted me to get better, but never fully understood what was happening.  She was one of those who said, \"you just need to start eating again!\", and then when I started gaining weight, told me I was getting chubby.   BUT, my friends, who I was super nervous about telling, were incredibly supportive and were total rocks during the whole process.   You may need to look for support outside your immediate family, and that's okay!",
      "created_utc": 1616900766.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsjr67n",
      "author": "clumsycouture",
      "body": "I’m sorry this happened to you. \n\nI’ve have never told my mom or dad but my sister knows. I been in recovery for ten years now and I only told them after I had stopped b/p. My friends knew but they kind of just pretended they didn’t. Like it was too taboo to talk about unless we were blackout drunk.",
      "created_utc": 1616903946.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsjxk23",
      "author": "nikonip",
      "body": "I'm so sorry your family was so awful when you told them.\n\nI never hid my ED from my family, apart from in the last couple of years when I was purging. They watched me grow up with it and acted like it was normal, they just didn't want me to get upset about it - ie: get distressed when I binged. \n\nMy mom has had an ED and her behaviour/attitude around food is really dysfunctional.",
      "created_utc": 1616907978.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gsjqzno",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1616903843.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gsjxt26",
      "author": "onkoaikavainilluusio",
      "body": "Recently told my twin sister and she has be became my biggest support since that! (Also the reason I want to recover) no one else knows tho and I’m scared how they’d react:/ I’m sorry your experience wasn’t the most pleasant one when opening up to family :(",
      "created_utc": 1616908165.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gskf1eq",
      "author": "Retexo",
      "body": "Flip flop between wanting to help and sounding understanding to making passive aggressive comments about my ED and getting mad about it and wanting to control me. Even though they know I have a dietician and a therapist and medication. The comments are the worst. “What are you just going to go throw it all up anyway” “You don’t eat anyway” “I’m going to start weighing you every weekend” “you look gross” \n\nI regret telling them.",
      "created_utc": 1616923754.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gskggov",
      "author": "None",
      "body": "I was very lucky. my mum was extremely supportive, she had a vague idea something was wrong for a few years and when it finally came out she did everything she could to support me and educate herself.\n\nmy nan reacted by baking me brownies and fruitcake (bless her). \n\nmy dad found out through word of mouth and has never talked to me about it. he's very uncomfortable with emotions, I honestly don't even mind that, I would be uncomfortable talking about that with him too.\n\nI'm sorry you had such a terrible experience with your family :(",
      "created_utc": 1616925165.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gskiaf5",
      "author": "SellyBear32",
      "body": "My mum offered me diet suppressors. You know, as a healthy alternative. There in lies the origin of the problem.",
      "created_utc": 1616926964.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gsjjbha",
      "author": "None",
      "body": "my mom threatened to throw me in a psych ward and make me take pictures of everything I eat.\n\nMy dad asked me if I wanted to turn into a fakir??????? \n\nAnd I was like whaaaaaat what u guys talking about i'm fineeeee i lluuuuuuuv foood yum!",
      "created_utc": 1616899549.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gsk8h6x",
      "author": "-kelesy-",
      "body": "When I first told my parents, the first thing out of my mom's mouth was \"how much do you weigh?\" I was a little shocked to say the least, but trying to be honest, so I told her and her response was \"oh thank God, it's not that bad, just don't get to xx weight\"....mind you I was already fairly underweight at this point....\n\nFast forward to a month ago when I finally got the courage to tell them about my current relapse and my mom said \"oh I knew it!\" I asked her why she didn't say anything and her response was \"I wanted to see if you were going to or not\"...I was shocked to say the least.\n\nNevertheless, my parents mean well and are supportive, just a bit ignorant and short-sighted. They are not great at thinking before speaking. I'm almost 30 so I've just kind of accepted that this is the best I can expect at this point.",
      "created_utc": 1616917339.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gskjem7",
      "author": "faroffland",
      "body": "I’ve only very recently felt comfortable being more open about having an eating disorder. I actually only recently joined this sub and it is really helping me be able to talk about it and acknowledge that I did have an ED.\n\nMy family always acknowledged I struggled with depression and anxiety from when I was a younger teenager (unfortunately these disorders are chronic for me but I’ve learned to manage them) but we never up front said I had an eating disorder. It was very difficult for me because my BMI hovered around 18.5 so I was never clinically diagnosed with anorexia or an ED, even when I was hospitalised for a suicide attempt and told them I was starving myself/had lost about 2 stone in a month (which my mum confirmed to them). We always kind of skirted around it, even when my mum would put her hand around my wrist to see how thin it was or when I hugged her rubbed my back to check how prominent my spine was. It was never an open ‘I have an eating disorder’, it was always lumped in with depression for me.\n\nMy cousin has BPD and struggled with severe bulemia/anorexia for years to the point where she was in rehab for it and not allowed to walk up stairs etc because she was so incredibly underweight. On a totally selfish level it is really invalidating for me because my family just see that extreme as ‘eating disorder’ and not what I went through. I still struggle with the thoughts now I’m nearly 30 and last year was the first time I said to my mum and sister ‘I had an eating disorder’ - which they acknowledged thankfully but I could never ever tell my wider family. My cousin’s EXTREME struggles with her personality disorder mean that my own mental health issues have never really been taken seriously or validated by my wider family. My family’s support and sympathy was always poured into my cousin so they kind of assumed I ‘got better’ when I learned to manage my disorders, they have no idea I still really struggle sometimes. My grandma (who I am really close to and love dearly) has even said to me before, ‘Oh well you were never as bad as cousin,’ as if it’s a competition or what I went through wasn’t ‘as bad’ so it’s ok. Like I seriously tried to kill myself at 16, it couldn’t have been much worse.\n\nSo yeah, it’s fucking hard. I have always been pretty open about struggling with bad depression/anxiety but my ED was always this monster I kept in the closet until very very recently. Thanks for asking ❤️",
      "created_utc": 1616928055.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gskt3xn",
      "author": "0_surge",
      "body": "my parents saw it developing in me from a young age (11 or so) and instantly it was all guilt trips and “you’re going to be sent to hospital where they’ll shove a tube in your stomach if you don’t eat” it’s gotten better as i’ve grown up and gained independence but yeah, not a good start",
      "created_utc": 1616936026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsj9tgb",
      "author": "Mimolette_",
      "body": "That’s so nice to hear! I hope your relationship continues to get better.",
      "created_utc": 1616894646.0,
      "score": 12,
      "context": [
        {
          "id": "gsiy7s6",
          "author": "Iscariiot",
          "body": "My mother has a history of being emotionally abusive toward me, especially in times of distress. I won’t get into the things she’s said/done to me- but it’s been really really bad before.\n\nThat said, telling her about my ED caused a different response than any other reveal. She jumped into action instantly- getting me into residential treatment and doing her best to support me through CONSTANT outbursts inside and outside of Res. And we’ve had a number of good conversations surrounding it in the last year. Idk why she stepped up for this one but I’m grateful.",
          "created_utc": 1616889252.0
        }
      ]
    },
    {
      "id": "gsjrcaa",
      "author": "clumsycouture",
      "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
      "created_utc": 1616904038.0,
      "score": 14,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        }
      ]
    },
    {
      "id": "gsjriim",
      "author": "clumsycouture",
      "body": "My dad used to call me fat (I wasn’t) and asked why I “eat so much” this was before I developed Bulimia and Anorexia.",
      "created_utc": 1616904135.0,
      "score": 5,
      "context": [
        {
          "id": "gsjqzno",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1616903843.0
        }
      ]
    },
    {
      "id": "gsntg5l",
      "author": "Departure_Level",
      "body": "For sure my mothers in denial because she seems to notice everything in the house but not anything to do with my mental health because she thinks it’s just a phase or I’m being over dramatic. I have self harm scars and I’m certain she’s seen them and never said anything. I’m sometimes in bed for up to a week and barely take care of myself but she just calls it laziness or lack of dedication to god. She occasionally hears me purging (the bathroom is next to her room) and never says anything either :/",
      "created_utc": 1616999140.0,
      "score": 2,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        },
        {
          "id": "gsjrcaa",
          "author": "clumsycouture",
          "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
          "created_utc": 1616904038.0
        }
      ]
    },
    {
      "id": "gsk5gme",
      "author": "magpsycho",
      "body": "I might be a little dense but what's the significance of long showers? A family member if mine does that and I want to ensure they're ok.",
      "created_utc": 1616914489.0,
      "score": 2,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        },
        {
          "id": "gsjrcaa",
          "author": "clumsycouture",
          "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
          "created_utc": 1616904038.0
        }
      ]
    },
    {
      "id": "gsjrw6p",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1616904348.0,
      "score": 5,
      "context": [
        {
          "id": "gsjqzno",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1616903843.0
        },
        {
          "id": "gsjriim",
          "author": "clumsycouture",
          "body": "My dad used to call me fat (I wasn’t) and asked why I “eat so much” this was before I developed Bulimia and Anorexia.",
          "created_utc": 1616904135.0
        }
      ]
    },
    {
      "id": "gskgsf6",
      "author": "SophieKins",
      "body": "Not OP but some people use the shower to mask purging sounds or just do it there..",
      "created_utc": 1616925489.0,
      "score": 3,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        },
        {
          "id": "gsjrcaa",
          "author": "clumsycouture",
          "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
          "created_utc": 1616904038.0
        },
        {
          "id": "gsk5gme",
          "author": "magpsycho",
          "body": "I might be a little dense but what's the significance of long showers? A family member if mine does that and I want to ensure they're ok.",
          "created_utc": 1616914489.0
        }
      ]
    },
    {
      "id": "gsl6t0n",
      "author": "clumsycouture",
      "body": "What Sophikins said. I didn’t realize it was a thing to look out for in Bulimia until I was looking up help options. It’s to mask the sound of purging.",
      "created_utc": 1616946455.0,
      "score": 2,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        },
        {
          "id": "gsjrcaa",
          "author": "clumsycouture",
          "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
          "created_utc": 1616904038.0
        },
        {
          "id": "gsk5gme",
          "author": "magpsycho",
          "body": "I might be a little dense but what's the significance of long showers? A family member if mine does that and I want to ensure they're ok.",
          "created_utc": 1616914489.0
        }
      ]
    },
    {
      "id": "gskvv2j",
      "author": "Sixclynder",
      "body": "Mine was the same, instead of teaching me healthy habits he just criticized my bad habits which drove me even deeper into my problems.  You are not alone! Using these as examples of what not to do we can be better people!",
      "created_utc": 1616940937.0,
      "score": 2,
      "context": [
        {
          "id": "gsjqzno",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1616903843.0
        },
        {
          "id": "gsjriim",
          "author": "clumsycouture",
          "body": "My dad used to call me fat (I wasn’t) and asked why I “eat so much” this was before I developed Bulimia and Anorexia.",
          "created_utc": 1616904135.0
        },
        {
          "id": "gsjrw6p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1616904348.0
        }
      ]
    },
    {
      "id": "gslbcey",
      "author": "magpsycho",
      "body": "Thank you.",
      "created_utc": 1616948578.0,
      "score": 1,
      "context": [
        {
          "id": "gsivuib",
          "author": "Departure_Level",
          "body": "I recently told my mother she said ‘just eat’. Ok thanks for curing me hun <3. When I explained that I can’t just do that and that I’m in a cycle of restrict binge purge. She just goes ‘okay? When you binge you can get the nutrients you need so your body can be prepared for when you restrict’. I just gave up. I don’t think she understands the gravity of it. And she still doesn’t.",
          "created_utc": 1616887976.0
        },
        {
          "id": "gsjrcaa",
          "author": "clumsycouture",
          "body": "Yeah a lot of parents are in denial too. My mom I think knows why I used to take 2 hr showers but she just couldn’t bring herself to think that there was something wrong with her daughter. I’ve had depression and anxiety ever since I can remember and when I tried to talk to her about it she just told me I was sensitive so there was no way I was telling her I was bulimic. (I’ve been in recovery for ten years now)",
          "created_utc": 1616904038.0
        },
        {
          "id": "gsk5gme",
          "author": "magpsycho",
          "body": "I might be a little dense but what's the significance of long showers? A family member if mine does that and I want to ensure they're ok.",
          "created_utc": 1616914489.0
        },
        {
          "id": "gsl6t0n",
          "author": "clumsycouture",
          "body": "What Sophikins said. I didn’t realize it was a thing to look out for in Bulimia until I was looking up help options. It’s to mask the sound of purging.",
          "created_utc": 1616946455.0
        }
      ]
    }
  ]
}