{
  "id": "mgknzj",
  "subreddit": "fuckeatingdisorders",
  "author": "tkdaw",
  "created_utc": 1617123703.0,
  "title": "another reason EDs are the worst",
  "selftext": "yall I feel like sometimes we even fail hardcore at supporting each other to recover, like EDs are competitive as fuck so like \"omg ur doing so great eating that it makes me feel like shit that I'm not recovering\" and like yeah, sometimes I do genuinely feel like that, but sometimes I feel superior for *not* being in the healthiest place? Like how tf does that make any fcking sense this disorder could fucking kill me but I feel like I'm winning if someone else is doing better at recovery than me? \n\nTl;dr EDs are competitive and make no sense and sometimes I wonder if unmonitored ED spaces are a good idea tbh",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mgknzj/another_reason_eds_are_the_worst/",
  "score": 110,
  "num_comments": 6,
  "comments": [
    {
      "id": "gstx5yb",
      "author": "bobanyangie",
      "body": "oh yeah definitely. even recovery pages trigger me when people talk about eating less/not recovering much and validate me when i feel sicker than them. fucked up",
      "created_utc": 1617130377.0,
      "score": 32,
      "context": []
    },
    {
      "id": "gsvab10",
      "author": "featheredpeacock",
      "body": "Is no one going to mention how useless blackouts on reddit posts are? Like tf is one tap gonna stop me from; ofc I’m gonna see how many cals someone was restricting to at their worst.",
      "created_utc": 1617154812.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gsve2mm",
      "author": "hands_of_sin",
      "body": "Yes exactly.  I find ED recovery support just as triggering as pro-ana tbh, especially when I'm teetering on the brink of relapse anyway, I feel like recovery discussion almost makes me feel enabled to start restricting again, ironically.",
      "created_utc": 1617156877.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gt6qlkj",
      "author": "None",
      "body": "absolutely. i know i'm a failure at being ill physically so my ED redirected its focus to being proud of how terribly i'm doing mentally... i was SO PROUD when i struggled to make it through a meal",
      "created_utc": 1617401990.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gsu1uxn",
      "author": "tkdaw",
      "body": "Right? People are like 'I'm relapsing' and I'm like 'well now that makes 2 of us!'",
      "created_utc": 1617132494.0,
      "score": 11,
      "context": [
        {
          "id": "gstx5yb",
          "author": "bobanyangie",
          "body": "oh yeah definitely. even recovery pages trigger me when people talk about eating less/not recovering much and validate me when i feel sicker than them. fucked up",
          "created_utc": 1617130377.0
        }
      ]
    },
    {
      "id": "gsvkf48",
      "author": "tkdaw",
      "body": "Right like if there's a no numbers rule it needs to include no blacked out numbers jfc like they aren't hidden in the previews anyways \n\nAnd like tbh I'm not against 'no numbers' rules but not because of triggers bc life is triggering but bc like there's no point??? Like who cares how badly you starved yourself/other behaviors *you're in an ED sub, you're not special, your ED just wants you to* think *you are.*",
      "created_utc": 1617160553.0,
      "score": 7,
      "context": [
        {
          "id": "gsvab10",
          "author": "featheredpeacock",
          "body": "Is no one going to mention how useless blackouts on reddit posts are? Like tf is one tap gonna stop me from; ofc I’m gonna see how many cals someone was restricting to at their worst.",
          "created_utc": 1617154812.0
        }
      ]
    }
  ]
}