{
  "id": "mjmo9f",
  "subreddit": "fuckeatingdisorders",
  "author": "Sunydazee",
  "created_utc": 1617501881.0,
  "title": "Reasons to recover: read if you’re struggling",
  "selftext": "Writing this as I’m having a hard time in recovery right now. Figured it would be a good reminder for anyone else struggling, and future me. I’ve been trying to go “all in” for around 2 weeks now, no food restrictions and minimal weighing myself. There are already so many positives. A couple months ago I would have never dreamed this possible. So, reasons to recover:\n\n1. ENERGY!! Turns out I’m not inherently tired? That tends to happen when you starve yourself? I also sleep through the night. Going up and down stairs doesnt make me want to lie down for a bit. I can move without needing a break, and it’s crazy.\n\n2. Not being dizzy. Guess what? When I get out of bed and shower, I don’t feel like I’m going to faint and hit my head on the tiles! It’s a great feeling. Like I have life.\n\n3. Not missing out on social events. I mostly stopped drinking due to being scared of alcohol calories. That sucks! And when I would drink, I wouldn’t eat the whole day and wake up the day after feeling like DEATH. ACTUAL DEATH. Now I can eat, drink, and not ruin the whole weekend from the worse hangover ever.\n\n4. Food! Food tastes really good sometimes! I used to be obsessed with watching food videos and would literally scroll Uber eats imagining what I would order one day. I don’t have that desire as much anymore.\n\n5. My body needs this. I want to make it clear that you do NOT need to be underweight to recover. There are so many more reasons to recover other than being “too sick” I.e. all of the above. But one extra thing that’s pushing me on is feeling feminine again. I lost any trace of boobs or butt, my legs look horrible, and I hate the way you can see all my veins. It’s actually gross. Recovery for me will give me some of myself back.\n\nAdditions from the comments:\n\n6. Acts of Love and Service - When I'm feeding my body well, I can love and serve the people I love. I can help my friends do housework and help with grocery shopping, babysitting and doing administrative tasks for friends who are bad at forms or other admin.\n\n7. Work/Study: Instead of dragging myself through the day, obsessing about food and not really being able to concentrate, I can do my work and study well. I'm more responsive to requests from colleagues, I have more capacity to take on more work or study as needed.\n\n8. Therapy: I'm much better able to deal with deeper psychological issues rather than just focusing on ED symptoms, I can process the emotions that lead to ED symptoms leading to longer term relief and management.\n\n9. passion/interests in things you used to like. I used to read a lot and I was obsessed with fictional characters but when I had an ED all I cared about was food. During recovery I’ve noticed my giddy passion for the things I used to love coming back now that my body is nourished, it’s crazy\n\n10. Hair not falling out all the time, Sex (solo or with a partner) is much better when you fuel yourself",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mjmo9f/reasons_to_recover_read_if_youre_struggling/",
  "score": 118,
  "num_comments": 7,
  "comments": [
    {
      "id": "gtb5ocf",
      "author": "tinari07",
      "body": "Wanted to add:\nHair not falling out all the time,\nSex (solo or with a partner) is much better when you fuel yourself",
      "created_utc": 1617504036.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gtbgy0c",
      "author": "None",
      "body": "I love this list, but also add these:\n\n6. Acts of Love and Service - When I'm feeding my body well, I can love and serve the people I love. I can help my friends do housework and help with grocery shopping, babysitting and doing administrative tasks for friends who are bad at forms or other admin.\n\n7. Work/Study: Instead of dragging myself through the day, obsessing about food and not really being able to concentrate, I can do my work and study well. I'm more responsive to requests from colleagues, I have more capacity to take on more work or study as needed.\n\n8. Therapy: I'm much better able to deal with deeper psychological issues rather than just focusing on ED symptoms, I can process the emotions that lead to ED symptoms leading to longer term relief and management.",
      "created_utc": 1617511584.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gtbw2vd",
      "author": "annnieruby",
      "body": "thank you!!! i also really like the things people have added in the comments and would second them!",
      "created_utc": 1617525453.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gtcri7v",
      "author": "None",
      "body": "Could I add passion/interests in things you used to like? I used to read a lot and I was obsessed with fictional characters but when I had an ED all I cared about was food. During recovery I’ve noticed my giddy passion for the things I used to love coming back now that my body is nourished, it’s crazy",
      "created_utc": 1617549671.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtcx0iu",
      "author": "None",
      "body": "thank you ☀️☀️☀️your positivity helps so many others (including myself) stay strong and be proud of yourself - things will get better for you!!! as your body gets better nutrition your cognition will get better and your body will also get better at producing serotonin so you will feel more positive 💛",
      "created_utc": 1617552527.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtc9m30",
      "author": "fifteen-eggs",
      "body": "and your hair will be so much thicker once you've been properly eating for \\~6 months -- i was convinced that i was destined to have ultra-thin hair for life. nope. i may not have *super* thick hair, but there's definitely a visible difference between me 6 months ago and me now :)",
      "created_utc": 1617538485.0,
      "score": 5,
      "context": [
        {
          "id": "gtb5ocf",
          "author": "tinari07",
          "body": "Wanted to add:\nHair not falling out all the time,\nSex (solo or with a partner) is much better when you fuel yourself",
          "created_utc": 1617504036.0
        }
      ]
    },
    {
      "id": "gtcpww1",
      "author": "Sunydazee",
      "body": "Yes!! 6 especially. I have so much more mental space for the people I love.",
      "created_utc": 1617548823.0,
      "score": 2,
      "context": [
        {
          "id": "gtbgy0c",
          "author": "None",
          "body": "I love this list, but also add these:\n\n6. Acts of Love and Service - When I'm feeding my body well, I can love and serve the people I love. I can help my friends do housework and help with grocery shopping, babysitting and doing administrative tasks for friends who are bad at forms or other admin.\n\n7. Work/Study: Instead of dragging myself through the day, obsessing about food and not really being able to concentrate, I can do my work and study well. I'm more responsive to requests from colleagues, I have more capacity to take on more work or study as needed.\n\n8. Therapy: I'm much better able to deal with deeper psychological issues rather than just focusing on ED symptoms, I can process the emotions that lead to ED symptoms leading to longer term relief and management.",
          "created_utc": 1617511584.0
        }
      ]
    }
  ]
}