{
  "id": "mk1889",
  "subreddit": "fuckeatingdisorders",
  "author": "queenintrovert",
  "created_utc": 1617559027.0,
  "title": "have any of yall ever heard the log metaphor?",
  "selftext": "so i'm in a php right now and tbh i'm not doing too great. however, at the end of last week my therapist shared this metaphor that really struck a chord with me when thinking about how it can apply to my ED.  i figured i'd share \n\n \n\n*Imagine yourself standing in the rain on the bank of a raging river. Suddenly, the water-swollen bank gives way. You fall in and find yourself being tossed around in the rapids. Your efforts to keep afloat are futile and you are drowning. By chance, along comes a huge log and you grab it and hold on tight. The log keeps your head above water and saves your life. Clinging to the log you are swept downstream and eventually come to a place where the water is calm.*\n\n*There, in the distance, you see the riverbank and attempt to swim to shore. You are unable to do so, however, because you are still clinging to the huge log with one arm as you stroke with the other. How ironic. The very thing that saved your life is now getting in the way of your getting where you want to go. There are people on shore who see you struggle and yell, \"Let go of the log!\" But you are unable to do so because you have no confidence in your ability to make it to shore.*\n\n*And so, very slowly and carefully, you let go of the log and practice floating. When you start to sink, you grab back on. Then you let go of the log and practice treading water, and when you get tired, hold on once again. After awhile, you practice swimming around the log once, twice, ten times, twenty times, a hundred times, until you gain the strength and confidence you need to swim to shore. Only then do you completely let go of the log.*",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mk1889/have_any_of_yall_ever_heard_the_log_metaphor/",
  "score": 108,
  "num_comments": 5,
  "comments": [
    {
      "id": "gtefafa",
      "author": "heybadanamu",
      "body": "Yes!???!!?! I thought my counselor was SPECIAL LMAO!!!! It’s from a book called “Eating in the Light of the Moon”.",
      "created_utc": 1617581139.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gtds9mr",
      "author": "blondiesdiary",
      "body": "Alsana?",
      "created_utc": 1617568632.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gtemc3z",
      "author": "shimmysticks",
      "body": "Dude the therapist who made this video has so many great metaphors for eds on her youtube channel. Her name is Dr. anita johnston you should look her up!!",
      "created_utc": 1617585123.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gtdunsq",
      "author": "queenintrovert",
      "body": "nope, i’m in PA, but i’m not surprised if it’s a common metaphor in ED treatment 🌸",
      "created_utc": 1617569889.0,
      "score": 7,
      "context": [
        {
          "id": "gtds9mr",
          "author": "blondiesdiary",
          "body": "Alsana?",
          "created_utc": 1617568632.0
        }
      ]
    },
    {
      "id": "gteteb1",
      "author": "blondiesdiary",
      "body": "Okay. Yeah, I heard it for the first time about a month ago at Alsana and it’s a beautiful metaphor.!",
      "created_utc": 1617589179.0,
      "score": 5,
      "context": [
        {
          "id": "gtds9mr",
          "author": "blondiesdiary",
          "body": "Alsana?",
          "created_utc": 1617568632.0
        },
        {
          "id": "gtdunsq",
          "author": "queenintrovert",
          "body": "nope, i’m in PA, but i’m not surprised if it’s a common metaphor in ED treatment 🌸",
          "created_utc": 1617569889.0
        }
      ]
    }
  ]
}