{
  "id": "mnjetr",
  "subreddit": "fuckeatingdisorders",
  "author": "tinybirdiee",
  "created_utc": 1617981374.0,
  "title": "now that i’m fully committed to recovery, i don’t really feel like cooking or baking anymore",
  "selftext": "when i was really struggling, all i wanted to do was experiment in the kitchen. i cooked all my meals from scratch and baked myself the lowest calorie/“healthiest” desserts possible. now that i’m committed to unrestricted eating, i could not be bothered. i have all these baking supplies i spent loads of money on, but i don’t feel like it. like, i WAS planning on making a batch of granola for myself this week, but i’d rather just spend seven dollars on the kind that i like so i can eat it without the effort. i know i’m gonna want dessert throughout the week too, so i guess i’ll just buy something at the store? which seems SO crazy and foreign to me. but whatever, just trying to ride the recovery wave. but i do feel bad about all those baking supplies i bought, lol",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mnjetr/now_that_im_fully_committed_to_recovery_i_dont/",
  "score": 130,
  "num_comments": 16,
  "comments": [
    {
      "id": "gtxuyi9",
      "author": "ConfidentStrength999",
      "body": "Same thing happened to me in recovery! I take it as a good sign that I’m not obsessed with food anymore and have other things that take my focus and energy in life :) and the good thing about baking supplies is most of them don’t expire quickly at all, so you’ll be able to use them at a later time if you decide you want to",
      "created_utc": 1617982073.0,
      "score": 36,
      "context": []
    },
    {
      "id": "gty0fdf",
      "author": "MoosieGoose",
      "body": "You'll probably get back into baking once you've been working at recovery for a while.\n\nIt can be amazing all the things you see differently when you're healing. Maybe the reason you used to like it was more a control aspect, wanting everything to be low calorie or healthy as possible. This time around, maybe you'll be more interested in trying new recipes or creating your own, which requires some delicious taste testing along the way :)",
      "created_utc": 1617984460.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gty569n",
      "author": "dortuh",
      "body": "Its actually so awesome to let yourself buy a berry Chantilly cake at the store. Even a slice. Or those French cheesecakes with cherries. Finally just getting what you actually want at a restaurant. Ordering a pizza. All the fun food you were missing out on.",
      "created_utc": 1617986523.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gtyfsfz",
      "author": "Sareeee48",
      "body": "This is me! I looooooved cooking, to the point I thought about being a chef... only thing that stopped me was the fact that I’d have to taste what I ate.\n\nNow that I’m recovering, cooking is suuuuch a chore for me. I spent years cooking food I wouldn’t eat, now I just want food to be easy, and cooking takes that out of food for me.",
      "created_utc": 1617991135.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gty7tql",
      "author": "weirdo2050",
      "body": "Same here. I used to really enjoy cooking and baking (for others) while I was still actively sick, and now in recovery I don't wanna do it at all.",
      "created_utc": 1617987659.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gtyv2nz",
      "author": "eeelisabeth",
      "body": "Same! I never realized how common this was. I miss that drive to cook and bake honestly. It’s just so hard to muster up the motivation. I always blamed it on being depressed, but maybe it’s not as much of a negative thing as I thought? I’m glad to see how accepting you are of the changes that come with recovery, it’s something to look up to!",
      "created_utc": 1617998072.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtyza29",
      "author": "niacinameowde",
      "body": "I would see this as a positive! The fact that you're not fixated on food at all is a great sign for recovery. The part of ED that makes food such a large part of our lives takes away so much from us. Sometimes, making food ourselves is a way of maintaining control over our eating. There's no harm in eating food we didn't fully make ourselves. Sometimes, we really just can't be bothered to do all that.",
      "created_utc": 1618000032.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu0tzk9",
      "author": "None",
      "body": "Felt this! I used to make myself protein pancakes every morning and it was the highlight of my day... literally went to bed excited to eat the next day... haven’t made pancakes in two months now bc I’d have to clean the blender",
      "created_utc": 1618040647.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtys172",
      "author": "BluePurslane",
      "body": "Love it. Same happened to me. I bought day old bakery donuts for my family the other day because I wasn't motivated to bake but the kids still love dessert!  If someone without an ED is perusing this sub we probably all sound nuts haha.",
      "created_utc": 1617996671.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtysgxb",
      "author": "Reapermanee",
      "body": "This was me for a loooong ass time, especially the first 6 months of recovery outside of res. Reached for a lot of pre-packaged things and frozen meals as opposed to buying and cooking fresh produce. My treatment team was just like \"Honestly as long as you're following your meal plan, getting in all your exchanges throughout the day, and making sure there's variety in your meals/snacks, eating frozen & pre-packaged foods more often than homecooked/homebaked foods is more than okay.\"",
      "created_utc": 1617996874.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtzdllx",
      "author": "alexisseffy",
      "body": "This is sort of happening to me also. i used to bake and cook all the time since I wouldn't eat food with unknown calories. Now that I'm working on not counting calories, I don't really want to cook anymore. It kinda sucks though since I used to really like cooking and baking as a hobby, and for not ED related reasons, but now I have basically no hobbies.",
      "created_utc": 1618007069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gty73yh",
      "author": "Caroline_Directioner",
      "body": "yes! now that i’ve been in recovery for a while I find it fun and therapeutic to bake every once in a while without worrying about control or obsessing over calories",
      "created_utc": 1617987354.0,
      "score": 9,
      "context": [
        {
          "id": "gty0fdf",
          "author": "MoosieGoose",
          "body": "You'll probably get back into baking once you've been working at recovery for a while.\n\nIt can be amazing all the things you see differently when you're healing. Maybe the reason you used to like it was more a control aspect, wanting everything to be low calorie or healthy as possible. This time around, maybe you'll be more interested in trying new recipes or creating your own, which requires some delicious taste testing along the way :)",
          "created_utc": 1617984460.0
        }
      ]
    },
    {
      "id": "gty9hrg",
      "author": "tinylil",
      "body": "This is exactly what happened to me! When I was in the thick of my ED, I baked all the time. In recovery, I started trying to eat my fear foods and ate take-out as often as I could afford. A couple years into recovery I’ve met a happy medium and I actually feel happy and relaxed baking now. And I’m so glad I didn’t donate all my expensive kitchen tools!",
      "created_utc": 1617988384.0,
      "score": 5,
      "context": [
        {
          "id": "gty0fdf",
          "author": "MoosieGoose",
          "body": "You'll probably get back into baking once you've been working at recovery for a while.\n\nIt can be amazing all the things you see differently when you're healing. Maybe the reason you used to like it was more a control aspect, wanting everything to be low calorie or healthy as possible. This time around, maybe you'll be more interested in trying new recipes or creating your own, which requires some delicious taste testing along the way :)",
          "created_utc": 1617984460.0
        }
      ]
    },
    {
      "id": "gtyshsi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1617996884.0,
      "score": 1,
      "context": [
        {
          "id": "gtysgxb",
          "author": "Reapermanee",
          "body": "This was me for a loooong ass time, especially the first 6 months of recovery outside of res. Reached for a lot of pre-packaged things and frozen meals as opposed to buying and cooking fresh produce. My treatment team was just like \"Honestly as long as you're following your meal plan, getting in all your exchanges throughout the day, and making sure there's variety in your meals/snacks, eating frozen & pre-packaged foods more often than homecooked/homebaked foods is more than okay.\"",
          "created_utc": 1617996874.0
        }
      ]
    },
    {
      "id": "gtzdrco",
      "author": "tinybirdiee",
      "body": "me too!! i’m trying to see it as exciting though, rediscovering old and new hobbies that have nothing to do with food or my body <3",
      "created_utc": 1618007152.0,
      "score": 2,
      "context": [
        {
          "id": "gtzdllx",
          "author": "alexisseffy",
          "body": "This is sort of happening to me also. i used to bake and cook all the time since I wouldn't eat food with unknown calories. Now that I'm working on not counting calories, I don't really want to cook anymore. It kinda sucks though since I used to really like cooking and baking as a hobby, and for not ED related reasons, but now I have basically no hobbies.",
          "created_utc": 1618007069.0
        }
      ]
    },
    {
      "id": "gtyur8b",
      "author": "Reapermanee",
      "body": "Bruh...\nlol anyway OP, keep slaying the recovery game! And like another commenter mentioned, those baking supplies will probably still be around if you ever feel like using them (but it's also 100% okay to end up not using them! Do what brings you most joy in this recovery process 😁)",
      "created_utc": 1617997925.0,
      "score": 1,
      "context": [
        {
          "id": "gtysgxb",
          "author": "Reapermanee",
          "body": "This was me for a loooong ass time, especially the first 6 months of recovery outside of res. Reached for a lot of pre-packaged things and frozen meals as opposed to buying and cooking fresh produce. My treatment team was just like \"Honestly as long as you're following your meal plan, getting in all your exchanges throughout the day, and making sure there's variety in your meals/snacks, eating frozen & pre-packaged foods more often than homecooked/homebaked foods is more than okay.\"",
          "created_utc": 1617996874.0
        },
        {
          "id": "gtyshsi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1617996884.0
        }
      ]
    }
  ]
}