{
  "id": "mnzt0n",
  "subreddit": "fuckeatingdisorders",
  "author": "Notreallysurebutidc",
  "created_utc": 1618037463.0,
  "title": "How do you get rid of the mentality that “skinny looks best”",
  "selftext": "I thought i was doing so well in recovery, I eat to nourish & fuel my body, eat because food actually tastes good and I eat whatever I crave. Basically in my mind I had beaten my ED’s, but something I noticed was eg I wore some new pants today and they were loose on the back part and I was like “ooh I’m still in shape”. I hate hate hate thinking that being one size is better than being another size. I don’t know what I’m asking for but I’m wondering if someone has struggled with the same issues during/after recovery? Someone that relates or have gone past that..",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mnzt0n/how_do_you_get_rid_of_the_mentality_that_skinny/",
  "score": 119,
  "num_comments": 33,
  "comments": [
    {
      "id": "gu0uaw3",
      "author": "None",
      "body": "It’s definitely normal, that’s how you trained your brain to feel for so long. Congrats on your incredible progress in recovery regardless!!!!\n\nIt helped me to follow body positive people of all sizes, read books about how thin=good is a made up beauty standard that changes over time, and honestly just dismiss the thoughts as “ed thoughts” when they come and let them go without focusing on them. \n\nOh, and affirmations helped me too if that’s your thing.",
      "created_utc": 1618040965.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gu1ktmz",
      "author": "momunist",
      "body": "Definitely recommend curating your social media. Unfollow anyone you might consider “fitspo,” and start following lots of diverse bodies of different sizes and abilities. When you see a non-thin person, actively try to appreciate the way they look, what you like about their appearance. It’s basically a process of un-brainwashing yourself from the fatphobia society has ingrained in all of us.",
      "created_utc": 1618063382.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gu17i51",
      "author": "standsure",
      "body": "I've been both ends of the body size spectrum more than twice. \n\nSuper thin, super fat, super thin and fat again, finally a stint of orthorexia to finish...\n\nWhat I've found is that I take me with me, no matter what size I am. I also needed to be the next size down from where I was. \n\nAge helped. A lot. \n\nGetting rid of the scales was crucial. I also cut out the size tags in clothes for a while. Now I don't bother.",
      "created_utc": 1618054216.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gu10y9k",
      "author": "a0172787m",
      "body": "Had to revamp my social media content. Unfollowed diet industry fitness accounts and followed more fat artists and models etc. Lizzo's tiktok and Instagram are pretty amazing for me",
      "created_utc": 1618047765.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gu1lsfp",
      "author": "Sareeee48",
      "body": "A lot of radical acceptance has been the only thing that’s helped me. I’ve only been doing it for like two weeks, and I still have lots of terrible thoughts regarding my body, but it is beginning to help me calm down, accept that I will never be in my sick body ever again, and I might not ever have my preED body back either. Radical acceptance doesn’t mean you have to like or even love your body, it just means that you have to accept that it *is* your body. My goal is to be neutral about myself, regardless of what body I end up with.\n\nEdit for typo",
      "created_utc": 1618063935.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gu2alfw",
      "author": "PrimPup",
      "body": "Being a lesbian has really helped because I’m attracted to a wide range of body types on other people. Being able to apply “if this was on someone else, I’d still think it was attractive” was a nice way to reframe. You could do the same in a friend capacity “If my friend looked like this, I would still think they were great/attractive/speak kindly to them”",
      "created_utc": 1618076410.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gu2rf3n",
      "author": "joeygraSOFA",
      "body": "i think so many people are hot, and theyre all in a variety of body shapes and sizes. reminding myself that the only reason i think im not hot at a certain (healthy) weight is because of my corrupted ED thoughts is really helpful.",
      "created_utc": 1618085079.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu6nfft",
      "author": "iheartworms",
      "body": "I struggle with this aspect a lot! I don't have any solutions other than challenging those thoughts, refraining from casual body checking (!! extremely important), and not verbalizing those thoughts/feelings. \n\nBut I would like to add, don't beat yourself up too much about just having them. I used to feel really guilty about thinking like this until I realized that just doing the work to challenge those thoughts and trying to make sure they don't impact others (especially young people) is a lot more than most people (who don't even have mental disorders that cause them to pursue thinness at all costs) can say. We have a) a psychiatric disorder that cause us to hold this warped perception, and b) a disorder that is heavily enabled by a society that upholds thinness as the ideal.",
      "created_utc": 1618174582.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gu0u5cl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618040808.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gu34y8u",
      "author": "solskinnratel",
      "body": "First- you recognized that your automatic thought was problematic. That in itself is a huge win!\n\nI am by no means an expert in the subject matter, but cognitive psychology is fascinating to me, and I was fortunate enough to take a graduate course about it- the prof was wonderful and we had a small class size, so I was really engaged. Anyway, our brains likely have a “semantic network.” Essentially, we link different “things” together based on pop culture, features, exposure, etc, and those “things” can activate each other. Like, if I were to quickly show you the word “sleep,” and then ask you if “bed” was a real word, you would respond faster and more accurately than if I asked you if “duck” was a real word. I believe this concept is particularly important in disordered thoughts. We can also trigger automatic thought cascades. For instance, “face” is linked with “book” and “face” is also linked to “nose.” If I present you with the word “face,” you will respond equally as fast to cues for “book” and for “nose” but probably not to “duck.” Now, if I present you with just the word “book,” you will quickly respond to “face.” But you will also respond quicker to “nose” than you likely will to “duck.” This is what we call “automatic spreading activation.” Basically, when I trigger one thought, your brain lights up linked thoughts, which light up thoughts linked to that... and we do that all without any conscious control.\n\nPeople with disordered eating spend a TON of our time forming and reinforcing specific links- eg, linking “skinny” to “attractive” and then “attractive” to “worth” and “loose clothes” to “skinny.” Thus we have a network where now “loose clothes” not only activates “still in shape” but also dictates mood as it can activate the concept of self-worth. And it does this automatically, whether we want it to happen or not. \n\nWhere to go from here? Accept that it takes time to “remodel” semantic networks. You are becoming aware of them, which is fantastic. Because you recognize you don’t want these links, you can start to “unlink” them by intentionally forming new links or setting up experiences. When the thought comes up, you intentionally choose to think of things you want linked instead to attractive, in shape, and worth.\n\nOthers have suggested wonderful ways in which you can do that. Unfollowing the triggers of course is wonderful so your automatic thoughts aren’t reinforcing the links. Being presented with diverse bodies gives you more experience to “link” that diversity with positive concepts. But you also have to conscientiously choose to establish those links. Every time you think something negative about a larger-size body (which could be an automatic thing), you can reframe that thought and look for the positives and beauty of that body. \n\nYou also have to establish YOUR OWN SELF in that particular “semantic network.” For me, that means when I catch myself body-checking and activating the “ED pathway,” I consciously choose to remind myself of the beauty in whatever area I’m looking at. Many people with EDs do this by giving thanks to what their bodies do for them- eg, when they body check their thighs, reminding themselves how their legs carry them far every day. The recommendation to view your own body as if it were somebody else’s also helps you form that link because sometimes our automatic “ED pathway” makes it very difficult for us to accept us as we are- especially when we also have body dysmorphia.\n\nI hope this made some sense! The key takeaway: your brain is doing exactly what it is supposed to do, even though it causes more problems. Actively seek out diverse bodies, find the beauty and value in these people, and view yourself in them!! That can help retrain your brain to have a healthy automatic train of thought.",
      "created_utc": 1618092241.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gu15c9t",
      "author": "Oliviabovivia",
      "body": "meet a guy, fall in love with him and then find out he actually loves thicker girls with boobs and a butt...the absolute opp of what ive f struggled to maintain for over a decade. just be the healthiest u, whatever that is and let it be. peace/love",
      "created_utc": 1618052241.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gu0y4pz",
      "author": "Notreallysurebutidc",
      "body": "Thank you so much for the tips and everything. You’re definitely right about thin equaling good is just a stupid beauty standard that switches up every century. I’m definitely going to check out some books, again thank you!",
      "created_utc": 1618044811.0,
      "score": 8,
      "context": [
        {
          "id": "gu0uaw3",
          "author": "None",
          "body": "It’s definitely normal, that’s how you trained your brain to feel for so long. Congrats on your incredible progress in recovery regardless!!!!\n\nIt helped me to follow body positive people of all sizes, read books about how thin=good is a made up beauty standard that changes over time, and honestly just dismiss the thoughts as “ed thoughts” when they come and let them go without focusing on them. \n\nOh, and affirmations helped me too if that’s your thing.",
          "created_utc": 1618040965.0
        }
      ]
    },
    {
      "id": "gu1mzz6",
      "author": "a0172787m",
      "body": "This this this",
      "created_utc": 1618064610.0,
      "score": 2,
      "context": [
        {
          "id": "gu1ktmz",
          "author": "momunist",
          "body": "Definitely recommend curating your social media. Unfollow anyone you might consider “fitspo,” and start following lots of diverse bodies of different sizes and abilities. When you see a non-thin person, actively try to appreciate the way they look, what you like about their appearance. It’s basically a process of un-brainwashing yourself from the fatphobia society has ingrained in all of us.",
          "created_utc": 1618063382.0
        }
      ]
    },
    {
      "id": "gu2cbz3",
      "author": "Notreallysurebutidc",
      "body": "Ahhh definitely. You’re definitely right, I need to take time to appreciate for how they look especially when they have another body type. This definitely helped a lot, super grateful for this thank you so much!!",
      "created_utc": 1618077280.0,
      "score": 1,
      "context": [
        {
          "id": "gu1ktmz",
          "author": "momunist",
          "body": "Definitely recommend curating your social media. Unfollow anyone you might consider “fitspo,” and start following lots of diverse bodies of different sizes and abilities. When you see a non-thin person, actively try to appreciate the way they look, what you like about their appearance. It’s basically a process of un-brainwashing yourself from the fatphobia society has ingrained in all of us.",
          "created_utc": 1618063382.0
        }
      ]
    },
    {
      "id": "gu2c01o",
      "author": "Notreallysurebutidc",
      "body": "Woa, thats a good way to remind yourself no matter body you take you with you. With age do you mean the older you get or with time it gets better? Definitely agree with scales, I still live at home and unfortunately my family has a scale (I avoid it though). Maybe should throw away the batteries heh. Thank you so so much for taking the time to respond and giving these tips (:",
      "created_utc": 1618077116.0,
      "score": 1,
      "context": [
        {
          "id": "gu17i51",
          "author": "standsure",
          "body": "I've been both ends of the body size spectrum more than twice. \n\nSuper thin, super fat, super thin and fat again, finally a stint of orthorexia to finish...\n\nWhat I've found is that I take me with me, no matter what size I am. I also needed to be the next size down from where I was. \n\nAge helped. A lot. \n\nGetting rid of the scales was crucial. I also cut out the size tags in clothes for a while. Now I don't bother.",
          "created_utc": 1618054216.0
        }
      ]
    },
    {
      "id": "guc05bo",
      "author": "thanksfortalking",
      "body": "I really love that phrase \"I take me with me...\" and also your other comment. Thanks for sharing your insight!",
      "created_utc": 1618284561.0,
      "score": 1,
      "context": [
        {
          "id": "gu17i51",
          "author": "standsure",
          "body": "I've been both ends of the body size spectrum more than twice. \n\nSuper thin, super fat, super thin and fat again, finally a stint of orthorexia to finish...\n\nWhat I've found is that I take me with me, no matter what size I am. I also needed to be the next size down from where I was. \n\nAge helped. A lot. \n\nGetting rid of the scales was crucial. I also cut out the size tags in clothes for a while. Now I don't bother.",
          "created_utc": 1618054216.0
        }
      ]
    },
    {
      "id": "gu2ckd4",
      "author": "Notreallysurebutidc",
      "body": "Never thought about having “using” a radical acceptance “method”. Thank you for responding and giving me super helpful advice. Definitely going to try to implant this type of thinking (:",
      "created_utc": 1618077398.0,
      "score": 3,
      "context": [
        {
          "id": "gu1lsfp",
          "author": "Sareeee48",
          "body": "A lot of radical acceptance has been the only thing that’s helped me. I’ve only been doing it for like two weeks, and I still have lots of terrible thoughts regarding my body, but it is beginning to help me calm down, accept that I will never be in my sick body ever again, and I might not ever have my preED body back either. Radical acceptance doesn’t mean you have to like or even love your body, it just means that you have to accept that it *is* your body. My goal is to be neutral about myself, regardless of what body I end up with.\n\nEdit for typo",
          "created_utc": 1618063935.0
        }
      ]
    },
    {
      "id": "gu2cpzp",
      "author": "Notreallysurebutidc",
      "body": "I’m glad that it helped you, and true. I have so many different people around me both friends and family with wide ranges of body types. I think I need to do what you said and actively think like you said. Thanks for the tips!!",
      "created_utc": 1618077477.0,
      "score": 3,
      "context": [
        {
          "id": "gu2alfw",
          "author": "PrimPup",
          "body": "Being a lesbian has really helped because I’m attracted to a wide range of body types on other people. Being able to apply “if this was on someone else, I’d still think it was attractive” was a nice way to reframe. You could do the same in a friend capacity “If my friend looked like this, I would still think they were great/attractive/speak kindly to them”",
          "created_utc": 1618076410.0
        }
      ]
    },
    {
      "id": "gu6g14e",
      "author": "Notreallysurebutidc",
      "body": "Thank you for this, seems to be very important to reminds yourself of that (:",
      "created_utc": 1618170857.0,
      "score": 1,
      "context": [
        {
          "id": "gu2rf3n",
          "author": "joeygraSOFA",
          "body": "i think so many people are hot, and theyre all in a variety of body shapes and sizes. reminding myself that the only reason i think im not hot at a certain (healthy) weight is because of my corrupted ED thoughts is really helpful.",
          "created_utc": 1618085079.0
        }
      ]
    },
    {
      "id": "gu8jpsa",
      "author": "Notreallysurebutidc",
      "body": "You’re right, I don’t think there’s a lot of things to do about this but to challenge the thoughts, like you said. Thank your for saying that, especially the part about guilt (since it’s the constant recurring emotion for me). Thanks for taking the time to write this and help me, I really appreciate it!",
      "created_utc": 1618219799.0,
      "score": 2,
      "context": [
        {
          "id": "gu6nfft",
          "author": "iheartworms",
          "body": "I struggle with this aspect a lot! I don't have any solutions other than challenging those thoughts, refraining from casual body checking (!! extremely important), and not verbalizing those thoughts/feelings. \n\nBut I would like to add, don't beat yourself up too much about just having them. I used to feel really guilty about thinking like this until I realized that just doing the work to challenge those thoughts and trying to make sure they don't impact others (especially young people) is a lot more than most people (who don't even have mental disorders that cause them to pursue thinness at all costs) can say. We have a) a psychiatric disorder that cause us to hold this warped perception, and b) a disorder that is heavily enabled by a society that upholds thinness as the ideal.",
          "created_utc": 1618174582.0
        }
      ]
    },
    {
      "id": "gu0y1nv",
      "author": "Notreallysurebutidc",
      "body": "Eughh it’s so messed up, the mental part is probably the hardest part... I hope we can one day stop thinking like that.",
      "created_utc": 1618044726.0,
      "score": 2,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        }
      ]
    },
    {
      "id": "gu176ph",
      "author": "Sareeee48",
      "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
      "created_utc": 1618053939.0,
      "score": 3,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        }
      ]
    },
    {
      "id": "gu6h3vm",
      "author": "Notreallysurebutidc",
      "body": "Hello, I don’t even think you know how much this helped me for real. I love psychology and understanding the brain as well, so thank you so much for taking your time to explain the “linking”.  I didn’t think it was easy to unlearn this behavior, but definitely not this hard but the explanation behind how this happened makes it easier to understand. Anyways thank you for all the tips, I’m literally screenshoting this so I can actively remember it hehe. Thank you for the help and for taking your time to write this (:",
      "created_utc": 1618171402.0,
      "score": 2,
      "context": [
        {
          "id": "gu34y8u",
          "author": "solskinnratel",
          "body": "First- you recognized that your automatic thought was problematic. That in itself is a huge win!\n\nI am by no means an expert in the subject matter, but cognitive psychology is fascinating to me, and I was fortunate enough to take a graduate course about it- the prof was wonderful and we had a small class size, so I was really engaged. Anyway, our brains likely have a “semantic network.” Essentially, we link different “things” together based on pop culture, features, exposure, etc, and those “things” can activate each other. Like, if I were to quickly show you the word “sleep,” and then ask you if “bed” was a real word, you would respond faster and more accurately than if I asked you if “duck” was a real word. I believe this concept is particularly important in disordered thoughts. We can also trigger automatic thought cascades. For instance, “face” is linked with “book” and “face” is also linked to “nose.” If I present you with the word “face,” you will respond equally as fast to cues for “book” and for “nose” but probably not to “duck.” Now, if I present you with just the word “book,” you will quickly respond to “face.” But you will also respond quicker to “nose” than you likely will to “duck.” This is what we call “automatic spreading activation.” Basically, when I trigger one thought, your brain lights up linked thoughts, which light up thoughts linked to that... and we do that all without any conscious control.\n\nPeople with disordered eating spend a TON of our time forming and reinforcing specific links- eg, linking “skinny” to “attractive” and then “attractive” to “worth” and “loose clothes” to “skinny.” Thus we have a network where now “loose clothes” not only activates “still in shape” but also dictates mood as it can activate the concept of self-worth. And it does this automatically, whether we want it to happen or not. \n\nWhere to go from here? Accept that it takes time to “remodel” semantic networks. You are becoming aware of them, which is fantastic. Because you recognize you don’t want these links, you can start to “unlink” them by intentionally forming new links or setting up experiences. When the thought comes up, you intentionally choose to think of things you want linked instead to attractive, in shape, and worth.\n\nOthers have suggested wonderful ways in which you can do that. Unfollowing the triggers of course is wonderful so your automatic thoughts aren’t reinforcing the links. Being presented with diverse bodies gives you more experience to “link” that diversity with positive concepts. But you also have to conscientiously choose to establish those links. Every time you think something negative about a larger-size body (which could be an automatic thing), you can reframe that thought and look for the positives and beauty of that body. \n\nYou also have to establish YOUR OWN SELF in that particular “semantic network.” For me, that means when I catch myself body-checking and activating the “ED pathway,” I consciously choose to remind myself of the beauty in whatever area I’m looking at. Many people with EDs do this by giving thanks to what their bodies do for them- eg, when they body check their thighs, reminding themselves how their legs carry them far every day. The recommendation to view your own body as if it were somebody else’s also helps you form that link because sometimes our automatic “ED pathway” makes it very difficult for us to accept us as we are- especially when we also have body dysmorphia.\n\nI hope this made some sense! The key takeaway: your brain is doing exactly what it is supposed to do, even though it causes more problems. Actively seek out diverse bodies, find the beauty and value in these people, and view yourself in them!! That can help retrain your brain to have a healthy automatic train of thought.",
          "created_utc": 1618092241.0
        }
      ]
    },
    {
      "id": "gu3ld30",
      "author": "standsure",
      "body": "I'm in my mid forties and have had ED from the age of nine. \n\nThe joy of growing up past 40 is that suddenly I was no longer evaluated as I moved through the world. There is something about being the dreaded middle age that takes me well out of the competition to be the prettiest girl in the room. \n\nI'd love to say I'd evolved past caring on my own steam, but I'll take what I can get. I simply am not checked out anymore and that helps enormously, more than I realised it would. \n\nIt's helped me detox from my addiction to my appearance and find self worth based on substance. \n\nGetting old is not how I imagined healing from ed, but I have a choice. To celebrate the freedom that comes with, or cry to the moon and try to defeat time and age. \n\nAlso after 30 plus years of restricting and the endless wishing to be a size down, 'then I'll be ok' It's really sunk in what a crock of shit that voice is. And it always lies. I've been small enough and it wasn't enough. My belly wasn't flat enough - it never will be. \n\nI look through photos of child me and she has a little pot and its fricken adorable.",
      "created_utc": 1618101376.0,
      "score": 3,
      "context": [
        {
          "id": "gu17i51",
          "author": "standsure",
          "body": "I've been both ends of the body size spectrum more than twice. \n\nSuper thin, super fat, super thin and fat again, finally a stint of orthorexia to finish...\n\nWhat I've found is that I take me with me, no matter what size I am. I also needed to be the next size down from where I was. \n\nAge helped. A lot. \n\nGetting rid of the scales was crucial. I also cut out the size tags in clothes for a while. Now I don't bother.",
          "created_utc": 1618054216.0
        },
        {
          "id": "gu2c01o",
          "author": "Notreallysurebutidc",
          "body": "Woa, thats a good way to remind yourself no matter body you take you with you. With age do you mean the older you get or with time it gets better? Definitely agree with scales, I still live at home and unfortunately my family has a scale (I avoid it though). Maybe should throw away the batteries heh. Thank you so so much for taking the time to respond and giving these tips (:",
          "created_utc": 1618077116.0
        }
      ]
    },
    {
      "id": "gu15ta0",
      "author": "SellyBear32",
      "body": "I think it comes with practice. The more you catch yourself and correct the thoughts the easier it gets. I get a lot of bad intrusive thoughts, when I learned to recognise them and remind myself 'its okay. I know better than what my brain is telling me' it got better. Its a therapy strategy thats helped me immensely.",
      "created_utc": 1618052689.0,
      "score": 2,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu0y1nv",
          "author": "Notreallysurebutidc",
          "body": "Eughh it’s so messed up, the mental part is probably the hardest part... I hope we can one day stop thinking like that.",
          "created_utc": 1618044726.0
        }
      ]
    },
    {
      "id": "gu2qp2u",
      "author": "SellyBear32",
      "body": "No, I was talking about my issue with fatphobia and how it upset me that I still feel this way. I was not condoning it, I was expressing my sadness about the internalised fatphobia. Lots of people post a lot more triggering shit here.",
      "created_utc": 1618084696.0,
      "score": 1,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu176ph",
          "author": "Sareeee48",
          "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
          "created_utc": 1618053939.0
        }
      ]
    },
    {
      "id": "gu6hy8d",
      "author": "Notreallysurebutidc",
      "body": "This was beautifully written... I just wanted to add I’m so happy that you’ve come to the realization you’ve have now. It took some time but I guess better later than never. I don’t know if you’re fully recovered now but I really hope you are but I guess looking back at a younger pic of you with positive affirmations is a good sign (: thank you again for writing!",
      "created_utc": 1618171820.0,
      "score": 2,
      "context": [
        {
          "id": "gu17i51",
          "author": "standsure",
          "body": "I've been both ends of the body size spectrum more than twice. \n\nSuper thin, super fat, super thin and fat again, finally a stint of orthorexia to finish...\n\nWhat I've found is that I take me with me, no matter what size I am. I also needed to be the next size down from where I was. \n\nAge helped. A lot. \n\nGetting rid of the scales was crucial. I also cut out the size tags in clothes for a while. Now I don't bother.",
          "created_utc": 1618054216.0
        },
        {
          "id": "gu2c01o",
          "author": "Notreallysurebutidc",
          "body": "Woa, thats a good way to remind yourself no matter body you take you with you. With age do you mean the older you get or with time it gets better? Definitely agree with scales, I still live at home and unfortunately my family has a scale (I avoid it though). Maybe should throw away the batteries heh. Thank you so so much for taking the time to respond and giving these tips (:",
          "created_utc": 1618077116.0
        },
        {
          "id": "gu3ld30",
          "author": "standsure",
          "body": "I'm in my mid forties and have had ED from the age of nine. \n\nThe joy of growing up past 40 is that suddenly I was no longer evaluated as I moved through the world. There is something about being the dreaded middle age that takes me well out of the competition to be the prettiest girl in the room. \n\nI'd love to say I'd evolved past caring on my own steam, but I'll take what I can get. I simply am not checked out anymore and that helps enormously, more than I realised it would. \n\nIt's helped me detox from my addiction to my appearance and find self worth based on substance. \n\nGetting old is not how I imagined healing from ed, but I have a choice. To celebrate the freedom that comes with, or cry to the moon and try to defeat time and age. \n\nAlso after 30 plus years of restricting and the endless wishing to be a size down, 'then I'll be ok' It's really sunk in what a crock of shit that voice is. And it always lies. I've been small enough and it wasn't enough. My belly wasn't flat enough - it never will be. \n\nI look through photos of child me and she has a little pot and its fricken adorable.",
          "created_utc": 1618101376.0
        }
      ]
    },
    {
      "id": "gu2bof3",
      "author": "Notreallysurebutidc",
      "body": "That makes sense, I guess it takes time to unlearn the ideals that have been imprinted in mine (our?) head. Thank you for that tip, I appreciate it (:",
      "created_utc": 1618076957.0,
      "score": 1,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu0y1nv",
          "author": "Notreallysurebutidc",
          "body": "Eughh it’s so messed up, the mental part is probably the hardest part... I hope we can one day stop thinking like that.",
          "created_utc": 1618044726.0
        },
        {
          "id": "gu15ta0",
          "author": "SellyBear32",
          "body": "I think it comes with practice. The more you catch yourself and correct the thoughts the easier it gets. I get a lot of bad intrusive thoughts, when I learned to recognise them and remind myself 'its okay. I know better than what my brain is telling me' it got better. Its a therapy strategy thats helped me immensely.",
          "created_utc": 1618052689.0
        }
      ]
    },
    {
      "id": "gu2rlkz",
      "author": "Sareeee48",
      "body": "your comment is insinuating (whether it’s intentional or not) that if one is at a “healthy” BMI they don’t need to gain weight. It is not only untrue for most individuals entering recovery, but harmful as well.\n\nI am not dismissing your experience with fatphobia, I am merely telling you to edit out the fatphobia from your comment as it has the potential to be just as harmful as any other “triggering shit” I monitor as well.",
      "created_utc": 1618085173.0,
      "score": 1,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu176ph",
          "author": "Sareeee48",
          "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
          "created_utc": 1618053939.0
        },
        {
          "id": "gu2qp2u",
          "author": "SellyBear32",
          "body": "No, I was talking about my issue with fatphobia and how it upset me that I still feel this way. I was not condoning it, I was expressing my sadness about the internalised fatphobia. Lots of people post a lot more triggering shit here.",
          "created_utc": 1618084696.0
        }
      ]
    },
    {
      "id": "gu2qjwx",
      "author": "SellyBear32",
      "body": "Deconditioning is hard but worth it",
      "created_utc": 1618084619.0,
      "score": 2,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu0y1nv",
          "author": "Notreallysurebutidc",
          "body": "Eughh it’s so messed up, the mental part is probably the hardest part... I hope we can one day stop thinking like that.",
          "created_utc": 1618044726.0
        },
        {
          "id": "gu15ta0",
          "author": "SellyBear32",
          "body": "I think it comes with practice. The more you catch yourself and correct the thoughts the easier it gets. I get a lot of bad intrusive thoughts, when I learned to recognise them and remind myself 'its okay. I know better than what my brain is telling me' it got better. Its a therapy strategy thats helped me immensely.",
          "created_utc": 1618052689.0
        },
        {
          "id": "gu2bof3",
          "author": "Notreallysurebutidc",
          "body": "That makes sense, I guess it takes time to unlearn the ideals that have been imprinted in mine (our?) head. Thank you for that tip, I appreciate it (:",
          "created_utc": 1618076957.0
        }
      ]
    },
    {
      "id": "gu2s9tm",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618085528.0,
      "score": 0,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu176ph",
          "author": "Sareeee48",
          "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
          "created_utc": 1618053939.0
        },
        {
          "id": "gu2qp2u",
          "author": "SellyBear32",
          "body": "No, I was talking about my issue with fatphobia and how it upset me that I still feel this way. I was not condoning it, I was expressing my sadness about the internalised fatphobia. Lots of people post a lot more triggering shit here.",
          "created_utc": 1618084696.0
        },
        {
          "id": "gu2rlkz",
          "author": "Sareeee48",
          "body": "your comment is insinuating (whether it’s intentional or not) that if one is at a “healthy” BMI they don’t need to gain weight. It is not only untrue for most individuals entering recovery, but harmful as well.\n\nI am not dismissing your experience with fatphobia, I am merely telling you to edit out the fatphobia from your comment as it has the potential to be just as harmful as any other “triggering shit” I monitor as well.",
          "created_utc": 1618085173.0
        }
      ]
    },
    {
      "id": "gu2sh8c",
      "author": "Sareeee48",
      "body": "For the third time, your post insinuates that if you are at some baseless, arbitrary BMI then you don’t need to gain. It does not matter if that was not your intention, it *is* how it is going to be interpreted to other members. I will have to remove the comment if you are not willing to edit it.",
      "created_utc": 1618085637.0,
      "score": 0,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu176ph",
          "author": "Sareeee48",
          "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
          "created_utc": 1618053939.0
        },
        {
          "id": "gu2qp2u",
          "author": "SellyBear32",
          "body": "No, I was talking about my issue with fatphobia and how it upset me that I still feel this way. I was not condoning it, I was expressing my sadness about the internalised fatphobia. Lots of people post a lot more triggering shit here.",
          "created_utc": 1618084696.0
        },
        {
          "id": "gu2rlkz",
          "author": "Sareeee48",
          "body": "your comment is insinuating (whether it’s intentional or not) that if one is at a “healthy” BMI they don’t need to gain weight. It is not only untrue for most individuals entering recovery, but harmful as well.\n\nI am not dismissing your experience with fatphobia, I am merely telling you to edit out the fatphobia from your comment as it has the potential to be just as harmful as any other “triggering shit” I monitor as well.",
          "created_utc": 1618085173.0
        },
        {
          "id": "gu2s9tm",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618085528.0
        }
      ]
    },
    {
      "id": "gu2tcnz",
      "author": "SellyBear32",
      "body": "Fine remove it. I was talking about my personal treatment, not saying everyones the same.",
      "created_utc": 1618086098.0,
      "score": 1,
      "context": [
        {
          "id": "gu0u5cl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618040808.0
        },
        {
          "id": "gu176ph",
          "author": "Sareeee48",
          "body": "“A very healthy BMI” is not actually indicative of one’s health and can be harmful to one’s recovery if they *do* have to gain weight past that “healthy” BMI to recover. Please edit the fatphobia out of your comment.",
          "created_utc": 1618053939.0
        },
        {
          "id": "gu2qp2u",
          "author": "SellyBear32",
          "body": "No, I was talking about my issue with fatphobia and how it upset me that I still feel this way. I was not condoning it, I was expressing my sadness about the internalised fatphobia. Lots of people post a lot more triggering shit here.",
          "created_utc": 1618084696.0
        },
        {
          "id": "gu2rlkz",
          "author": "Sareeee48",
          "body": "your comment is insinuating (whether it’s intentional or not) that if one is at a “healthy” BMI they don’t need to gain weight. It is not only untrue for most individuals entering recovery, but harmful as well.\n\nI am not dismissing your experience with fatphobia, I am merely telling you to edit out the fatphobia from your comment as it has the potential to be just as harmful as any other “triggering shit” I monitor as well.",
          "created_utc": 1618085173.0
        },
        {
          "id": "gu2s9tm",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618085528.0
        },
        {
          "id": "gu2sh8c",
          "author": "Sareeee48",
          "body": "For the third time, your post insinuates that if you are at some baseless, arbitrary BMI then you don’t need to gain. It does not matter if that was not your intention, it *is* how it is going to be interpreted to other members. I will have to remove the comment if you are not willing to edit it.",
          "created_utc": 1618085637.0
        }
      ]
    }
  ]
}