{
  "id": "mpislg",
  "subreddit": "fuckeatingdisorders",
  "author": "GameofCheese",
  "created_utc": 1618248592.0,
  "title": "About to have my first meal in Intensive Outpatient (IOP). Wish me luck!!",
  "selftext": "I'm terrified this treatment for many reasons.  I've had so many and I'm in on Social Security Disability for my EDs. I'm also currently overweight/ medically obese, so that's always fun when meeting the new group.  This is my millionth treatment, but feels like this first one for a lot of reasons...\n\nMainly my therapist has gotten me to feel my feelings for the first time at 43. \n\nI can hear the fucking lunch tray cart rolling  and I haven't met the group yet. It's triggering to cry but I'm totally going to and I feel bad about that. \n\nI need support, love, prayers, words of encouragement, whatever.  This is going to be a long day with another snack and dinner before I'm done. \n\nLove you all.  I promise to fight and give it my all.  \n\n\nI fucking hate Ed!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mpislg/about_to_have_my_first_meal_in_intensive/",
  "score": 108,
  "num_comments": 8,
  "comments": [
    {
      "id": "guapycs",
      "author": "LightningOdin4",
      "body": "You have got this. My main suggestion is to trust what they're giving to you. They are trained for this. Just go with the flow!",
      "created_utc": 1618260652.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gua9t2x",
      "author": "None",
      "body": "Power to you!!!",
      "created_utc": 1618253435.0,
      "score": 8,
      "context": []
    },
    {
      "id": "guad30i",
      "author": "ABlackThaiAffair",
      "body": "One bite at a time!",
      "created_utc": 1618254894.0,
      "score": 6,
      "context": []
    },
    {
      "id": "guayk9u",
      "author": "brima24",
      "body": "I started Iop recently and was similarly terrified,and I have to say while there have definitely been huge challenges it has been overwhelmingly a positive experience that I really value more than I could hav anticipated",
      "created_utc": 1618264685.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gub4jmu",
      "author": "Reapermanee",
      "body": "You can do this!!! Screw your ED, keep fighting the fight!!!",
      "created_utc": 1618267720.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gubp7nv",
      "author": "its_me_anonymous16",
      "body": "This is going to be SO HARD but you will get through it and come out stronger!! Good for you for getting to where you are already and getting into treatment. Keep fighting, you're on your way to breaking free of this terrible disorder!",
      "created_utc": 1618278495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guc3ofv",
      "author": "kumquatcumsquat",
      "body": "I’m rooting for you!",
      "created_utc": 1618286772.0,
      "score": 1,
      "context": []
    }
  ]
}