{
  "id": "mr6fvj",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1618456466.0,
  "title": "Eating dinner tonight and I don’t fucking care that I didn’t work out",
  "selftext": "It’s been a long, stressful ass day working and running errands, and I’ve already ate two meals, and already had a snack, and didn’t work out today or yesterday, and picked up my Prozac at the pharmacy and have to pack cause I move this weekend and have to deal with the bullshit of utility transferring and security deposits, but I am eating a bowl of curry with tempeh and vegetables because my body deserves to be fueled and nourished and I deserve to feel loved by myself and the wounded child inside of me. I am beautiful no matter what I eat and no matter how much I work out and this curry is fucking delicious. \n\nFUCK anorexia and FUCK bulimia",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mr6fvj/eating_dinner_tonight_and_i_dont_fucking_care/",
  "score": 112,
  "num_comments": 12,
  "comments": [
    {
      "id": "gukidp4",
      "author": "oogiebuns",
      "body": "FUCK YEAH!! I’m so proud of you, friend. Curry with tempeh sounds soo good, wow. You definitely deserve to eat regardless of exercise or not.",
      "created_utc": 1618459102.0,
      "score": 8,
      "context": []
    },
    {
      "id": "guko1g1",
      "author": "StrawberryCow55",
      "body": "FUCK YES!! that sounds so delicious, i hope you enjoy!!",
      "created_utc": 1618463019.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gum1o73",
      "author": "Caroline_Directioner",
      "body": "YAASSS! great recovery win and Prozac is so helpful for me too, i’m so happy for you <3",
      "created_utc": 1618499256.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gulnlrz",
      "author": "annnieruby",
      "body": "FUCK EATING DISORDERS and GO YOU for eating dinner guilt-free, the way it SHOULD be and needs to be!!! ate dinner last night (pizza!) and hadn’t worked out. was ticking a lot but i did it!! go you. go ya all xxx",
      "created_utc": 1618492608.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gusv1k2",
      "author": "None",
      "body": "I skipped the gym and ate dinner too! LOOK AT US ❤️",
      "created_utc": 1618629049.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gumhou7",
      "author": "nurankm",
      "body": "So needed to see this - literally found this thread bc I was feeling guilty about eating dinner tonight bc I haven’t had time to work out today. Tysm i hope your curry was fucking fantastic xx",
      "created_utc": 1618506184.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gum2azl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1618499535.0,
      "score": 1,
      "context": [
        {
          "id": "gum1o73",
          "author": "Caroline_Directioner",
          "body": "YAASSS! great recovery win and Prozac is so helpful for me too, i’m so happy for you <3",
          "created_utc": 1618499256.0
        }
      ]
    },
    {
      "id": "gum2p0j",
      "author": "Caroline_Directioner",
      "body": "it worked really fast for me too, it makes me a lot less prone to anxious breakdowns and I can think much more rationally about food and my body now. i’ve been on it for about nine months and it has been great, it’s been super helpful in making sure that one moment of insane panic and terrible thoughts doesn’t spiral out of control into relapse or disordered behaviors",
      "created_utc": 1618499708.0,
      "score": 2,
      "context": [
        {
          "id": "gum1o73",
          "author": "Caroline_Directioner",
          "body": "YAASSS! great recovery win and Prozac is so helpful for me too, i’m so happy for you <3",
          "created_utc": 1618499256.0
        },
        {
          "id": "gum2azl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1618499535.0
        }
      ]
    }
  ]
}