{
  "id": "mrvysh",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1618548033.0,
  "title": "\"Not underweight enough for a diagnosis.\"",
  "selftext": "light heavy carpenter vast plate stupendous ghost follow vase unique\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mrvysh/not_underweight_enough_for_a_diagnosis/",
  "score": 91,
  "num_comments": 19,
  "comments": [
    {
      "id": "gupovfd",
      "author": "faroffland",
      "body": "I’ve weirdly enough recently commented on a few threads over on the UK sub about BMI being used as part of the diagnosis. It is crazy and really doesn’t make sense to me at all.\n\nMy BMI always hovered around 18.5 so I was never diagnosed with an eating disorder, even though I restricted a lot, sometimes made myself sick and lost weight very quickly. This was all reported to both my GP and hospital staff when at 16 I tried to kill myself, but I never got any treatment or help except 6 ‘counselling’ sessions (not even CBT).\n\nWe know eating disorders have one of (if not the) highest mortality rate of mental disorders. We know under 50% of sufferers of both anorexia and bulimia ever go on to have true, full recovery. People act like these are just facts of the illness but they aren’t - they are because we leave people to be literally dying before we intervene.\n\nI actively struggled with my eating disorder between the ages of 15-22. I have been struggling again recently but am fighting it. But to get any kind of diagnosis and therefore help through the NHS, I would need to weigh less than 110lbs. Were I ever to reach that point, I would probably have to actively struggle with my eating disorder for at least a year or longer. Starving myself for a good year only ever got me to about 119lbs so god knows how far I’d have to go to get to that point.\n\nYes, we need triage to ensure people who are physically dying get priority treatment, but the reality is with mental health care (at least in the UK) this means other ‘less unwell’ individuals are ignored. Even when diagnosed with an ED, you are often on waiting lists for a good year unless your BMI is something like 13 and you need immediate inpatient treatment.\n\nIt is one of the only mental illnesses where we tie the physicality of somebody to their diagnosis. In fact it’s the only one I can think of, all the rest are purely on mental and emotional symptoms, as they should be. At the moment it’s like somebody having an assessment for chronic depression, saying they feel awful, want to die all the time and have been self harming, but unable to be diagnosed with depression unless their cutting has been deep enough to hit an artery.\n\nI do think weight has a place in triaging but it shouldn’t mean anyone over a certain BMI CANNOT be diagnosed. It’s also a problem that many doctors seem to only diagnose anorexia or bulimia, and if you do not fit severe criteria of one of those two EDs you will not be diagnosed with one - even though many more exist.\n\nWe know people die of it, we know people struggle to recover, but unlike other mental health illnesses by the nature of its diagnosis including BMI we leave people to get deep into eating disorders before we intervene. Sorry for the rant but it’s fucking insane to me.",
      "created_utc": 1618573335.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gup3zga",
      "author": "starvingthearies",
      "body": "You are valid, no matter what anyone says. And you deserve to get help.",
      "created_utc": 1618554983.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gup6h2q",
      "author": "SellyBear32",
      "body": "I was 80kg at 5'0 when I struggled. Thats heavily overweight according to doctors and I was encouraged to lose weight. I'm now a lot lower than that and get praised every single time I see people, even ones that are fully aware of my ed. \n\nI'm sorry you eent through that as a kid. No one should have to go through that.",
      "created_utc": 1618557152.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gup9cjd",
      "author": "SamBrainless",
      "body": "This was me. I've had an 'eating disorder' (i still struggle to identify with the term at times) on and off for 17 years apparently, but no one realised. The first time i tried reaching out for help, when my behaviours were at their worst but my weight at its highest, i was essentially told i was 'too fat to have an eating disorder and be treated'. And that seriously fucked me up. When it once again reappeared over the past few years and people finally realised and forced me to go see my GP, he completely validated me, even though i don't think I'm 'sick enough' now. He believes that I've had an eating disorder all along, and he's absolutely livid about what was said to me back then. \n\nI suppose for me in the end, the risk was worth it, not that i was given much of a choice in the matter. I had to get help because everyone was going on at me, but it's worth trying, just speak to someone different this time, especially seen as apparently BMI and weight aren't part of the diagnostic criteria these days (not that it stops the obsession).\n\nWow i really do go off on one as soon as i start speaking/typing, sorry!",
      "created_utc": 1618559812.0,
      "score": 7,
      "context": []
    },
    {
      "id": "guq38ha",
      "author": "sunnyzombie",
      "body": "It's called atypical anorexia and it's a legitimate diagnosis  and it's what I had. The way my body is built I could never get below a certain weight and I was not considered underweight. And I was eating NOTHING. Just Slimfast all day long. \n\nYour therapist was wrong and uninformed. You need to find someone else to talk to, it doesn't have to be a specialist in ED. My first psychiatrist was freaking amazing and she was the one who put me on the path to recovery. Remember that control is a big part of what causes eating disorders. You can't control outside events or trauma so you focus on your body, something you believe you CAN control. \n\nI am almost 57 and I spent most of my life hating my body. Don't do that to yourself. You are so young still and you CAN overcome this. It's not easy and you will work at it for a long time, but the sooner you begin addressing the core issues, the sooner you will find happiness with yourself.\n\nYOU ARE WORTH IT. Get yourself another therapist and if you don't feel a groove with the new one, keep looking. I have had several in my life and some were better than others. The best one I had was a social worker who did therapy sessions. She's the one who taught me about boundaries. They don't have to be expensive or fancy to be good. You just need to click.",
      "created_utc": 1618581264.0,
      "score": 5,
      "context": []
    },
    {
      "id": "guqlygs",
      "author": "squareCat99",
      "body": "I'm so sorry this is happening to you.  There's nothing more frustrating that actively wanting to recover and having actual medical professionals tell you you're not \"sick enough\".   I'm not familiar enough with the healthcare system in NZ to offer specific advice on getting treatment, but I will just tell you I can relate, and encourage you as much as I can to not give up and keep pushing for help. \n\nI was in a very similar situation where nobody thought I was \"sick enough\" for treatment because I was always within a normal weight range - even though I had multiple overuse injuries, nutrient deficiencies, and irregular periods.   It took me over 10 years of being in my ED for me to find a doctor who was able to guide me to treatment (although to be fair, I didn't think I was sick or want help until the last year)\n\nIf you can't get diagnosed with an ED, potentially try and find a therapist for depression who has experience with EDs (if you can get that approved at least), or maybe even try to start recovery on your own if you can.  As frustrating as it is, please please do not give up.  I waited way too long and ended up doing permanent damage to my body - I'll be living with the consequences for the rest of my life and don't want that to happen to anyone else!",
      "created_utc": 1618589450.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guqnssn",
      "author": "weirdo2050",
      "body": "Where do you live? I live in Estonia and have been treated just the same as those who are underweight. I was even hospitalized and did inpatient for 3 weeks. There were many of those not underweight in the ED ward. It's a mental illness and weight doesn't define mental health.",
      "created_utc": 1618590230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guqnzl1",
      "author": "kintyre",
      "body": "I have disordered eating - no formal diagnosis. Being overweight has made me feel like I can never have an eating disorder. \n\nI feel you. But you deserve help.",
      "created_utc": 1618590309.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gur6lho",
      "author": "None",
      "body": "***HATE*** this mentality",
      "created_utc": 1618598422.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guplh05",
      "author": "MaryContrary26",
      "body": "You do realize there was a time when doctors would go from one surgery to the next without washing their hands, when they would try to cure people with leeches, when they would lock people up if they had a mental illness etc.  So better they admitted they didn't know how to treat you than lock you in a straight jacket with leeches I guess? But seriously, the medical community is made up of humans and what do they know? Here's what you know--The way you're living is not sustainable. Help is available. The ED \"voice\" is telling you not to because it doesn't want you to recover. It will always find reasons why you shouldn't.",
      "created_utc": 1618570900.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gurkha8",
      "author": "CelestialWolfMoon",
      "body": "This is why I hate that the BMI is a part of ED diagnosis.  EDs are mental illnesses, they are not physiques.  It’s so invaliding and disrespectful to you that your weight somehow disqualifies you for a proper diagnosis.  Your ED and struggles are valid, no matter your weight.  I also have never been medically underweight by BMI standards, but I have been diagnosed with orthorexia/atypical anorexia/anorexia due to my symptoms.  I’m sorry that you’re struggling with getting the proper care that you need.\n\nAnd like others have mentioned, it is extremely problematic that EDs are classified by weight/BMI.  It makes it harder for ED sufferers to get help or makes them feel like they aren’t “sick enough” to get help.  I hope that you can realize that you deserve recovery and get the help that you need.",
      "created_utc": 1618604721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guq8wjs",
      "author": "None",
      "body": "gaze possessive frame touch rock glorious entertain price encouraging ripe\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1618583817.0,
      "score": 5,
      "context": [
        {
          "id": "gupovfd",
          "author": "faroffland",
          "body": "I’ve weirdly enough recently commented on a few threads over on the UK sub about BMI being used as part of the diagnosis. It is crazy and really doesn’t make sense to me at all.\n\nMy BMI always hovered around 18.5 so I was never diagnosed with an eating disorder, even though I restricted a lot, sometimes made myself sick and lost weight very quickly. This was all reported to both my GP and hospital staff when at 16 I tried to kill myself, but I never got any treatment or help except 6 ‘counselling’ sessions (not even CBT).\n\nWe know eating disorders have one of (if not the) highest mortality rate of mental disorders. We know under 50% of sufferers of both anorexia and bulimia ever go on to have true, full recovery. People act like these are just facts of the illness but they aren’t - they are because we leave people to be literally dying before we intervene.\n\nI actively struggled with my eating disorder between the ages of 15-22. I have been struggling again recently but am fighting it. But to get any kind of diagnosis and therefore help through the NHS, I would need to weigh less than 110lbs. Were I ever to reach that point, I would probably have to actively struggle with my eating disorder for at least a year or longer. Starving myself for a good year only ever got me to about 119lbs so god knows how far I’d have to go to get to that point.\n\nYes, we need triage to ensure people who are physically dying get priority treatment, but the reality is with mental health care (at least in the UK) this means other ‘less unwell’ individuals are ignored. Even when diagnosed with an ED, you are often on waiting lists for a good year unless your BMI is something like 13 and you need immediate inpatient treatment.\n\nIt is one of the only mental illnesses where we tie the physicality of somebody to their diagnosis. In fact it’s the only one I can think of, all the rest are purely on mental and emotional symptoms, as they should be. At the moment it’s like somebody having an assessment for chronic depression, saying they feel awful, want to die all the time and have been self harming, but unable to be diagnosed with depression unless their cutting has been deep enough to hit an artery.\n\nI do think weight has a place in triaging but it shouldn’t mean anyone over a certain BMI CANNOT be diagnosed. It’s also a problem that many doctors seem to only diagnose anorexia or bulimia, and if you do not fit severe criteria of one of those two EDs you will not be diagnosed with one - even though many more exist.\n\nWe know people die of it, we know people struggle to recover, but unlike other mental health illnesses by the nature of its diagnosis including BMI we leave people to get deep into eating disorders before we intervene. Sorry for the rant but it’s fucking insane to me.",
          "created_utc": 1618573335.0
        }
      ]
    },
    {
      "id": "guqnw4m",
      "author": "Azaryxe",
      "body": "All of this. I remember when I was at my worst, I was repeatedly seeing my GP who was doing all he could to try and get me help. I was never mad at him, but unfortunately he got the brunt of most of my frustration. I remember after however many assessments they did of me to only reject me for treatment, one of those letters said to re-refer me if I met the BMI threshold for the ED service.\n\nI was sat there when my doctor brought up the NICE guidelines that say BMI should not be used as a single measure to determine if someone should have treatment. He then sent a letter to them asking what the threshold was, and they responded saying there wasn't one.\n\nI felt so hopeless. I was killing myself, my BMI was way underweight, and yet I still was being pushed away. They wanted me to get sicker before helping. The only reason I decided to recover was because I met someone that made me realise I didn't want to live like that.\n\nThey did offer me to speak to someone a few weeks after I saw my doctor about the BMI situation, but I had already gained a little weight and was doing slightly better. I do regret not taking it though, since I'm teetering on a relapse now. But who knows if they would've helped enough.\n\nBut it's utter bullshit how they decide who should be treated. Without being hospitalised, I don't think I would've gotten adequate support had I continued down that road.",
      "created_utc": 1618590269.0,
      "score": 3,
      "context": [
        {
          "id": "gupovfd",
          "author": "faroffland",
          "body": "I’ve weirdly enough recently commented on a few threads over on the UK sub about BMI being used as part of the diagnosis. It is crazy and really doesn’t make sense to me at all.\n\nMy BMI always hovered around 18.5 so I was never diagnosed with an eating disorder, even though I restricted a lot, sometimes made myself sick and lost weight very quickly. This was all reported to both my GP and hospital staff when at 16 I tried to kill myself, but I never got any treatment or help except 6 ‘counselling’ sessions (not even CBT).\n\nWe know eating disorders have one of (if not the) highest mortality rate of mental disorders. We know under 50% of sufferers of both anorexia and bulimia ever go on to have true, full recovery. People act like these are just facts of the illness but they aren’t - they are because we leave people to be literally dying before we intervene.\n\nI actively struggled with my eating disorder between the ages of 15-22. I have been struggling again recently but am fighting it. But to get any kind of diagnosis and therefore help through the NHS, I would need to weigh less than 110lbs. Were I ever to reach that point, I would probably have to actively struggle with my eating disorder for at least a year or longer. Starving myself for a good year only ever got me to about 119lbs so god knows how far I’d have to go to get to that point.\n\nYes, we need triage to ensure people who are physically dying get priority treatment, but the reality is with mental health care (at least in the UK) this means other ‘less unwell’ individuals are ignored. Even when diagnosed with an ED, you are often on waiting lists for a good year unless your BMI is something like 13 and you need immediate inpatient treatment.\n\nIt is one of the only mental illnesses where we tie the physicality of somebody to their diagnosis. In fact it’s the only one I can think of, all the rest are purely on mental and emotional symptoms, as they should be. At the moment it’s like somebody having an assessment for chronic depression, saying they feel awful, want to die all the time and have been self harming, but unable to be diagnosed with depression unless their cutting has been deep enough to hit an artery.\n\nI do think weight has a place in triaging but it shouldn’t mean anyone over a certain BMI CANNOT be diagnosed. It’s also a problem that many doctors seem to only diagnose anorexia or bulimia, and if you do not fit severe criteria of one of those two EDs you will not be diagnosed with one - even though many more exist.\n\nWe know people die of it, we know people struggle to recover, but unlike other mental health illnesses by the nature of its diagnosis including BMI we leave people to get deep into eating disorders before we intervene. Sorry for the rant but it’s fucking insane to me.",
          "created_utc": 1618573335.0
        }
      ]
    },
    {
      "id": "guq6au2",
      "author": "None",
      "body": "sense busy axiomatic treatment ripe society chop terrific beneficial sulky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1618582671.0,
      "score": 5,
      "context": [
        {
          "id": "guq38ha",
          "author": "sunnyzombie",
          "body": "It's called atypical anorexia and it's a legitimate diagnosis  and it's what I had. The way my body is built I could never get below a certain weight and I was not considered underweight. And I was eating NOTHING. Just Slimfast all day long. \n\nYour therapist was wrong and uninformed. You need to find someone else to talk to, it doesn't have to be a specialist in ED. My first psychiatrist was freaking amazing and she was the one who put me on the path to recovery. Remember that control is a big part of what causes eating disorders. You can't control outside events or trauma so you focus on your body, something you believe you CAN control. \n\nI am almost 57 and I spent most of my life hating my body. Don't do that to yourself. You are so young still and you CAN overcome this. It's not easy and you will work at it for a long time, but the sooner you begin addressing the core issues, the sooner you will find happiness with yourself.\n\nYOU ARE WORTH IT. Get yourself another therapist and if you don't feel a groove with the new one, keep looking. I have had several in my life and some were better than others. The best one I had was a social worker who did therapy sessions. She's the one who taught me about boundaries. They don't have to be expensive or fancy to be good. You just need to click.",
          "created_utc": 1618581264.0
        }
      ]
    },
    {
      "id": "guqoypd",
      "author": "None",
      "body": "vanish rainstorm consist treatment intelligent childlike hard-to-find provide piquant late\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1618590724.0,
      "score": 3,
      "context": [
        {
          "id": "guqnssn",
          "author": "weirdo2050",
          "body": "Where do you live? I live in Estonia and have been treated just the same as those who are underweight. I was even hospitalized and did inpatient for 3 weeks. There were many of those not underweight in the ED ward. It's a mental illness and weight doesn't define mental health.",
          "created_utc": 1618590230.0
        }
      ]
    },
    {
      "id": "guq89aa",
      "author": "None",
      "body": "rock cows elderly glorious gaze governor snatch handle saw friendly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1618583539.0,
      "score": 2,
      "context": [
        {
          "id": "guplh05",
          "author": "MaryContrary26",
          "body": "You do realize there was a time when doctors would go from one surgery to the next without washing their hands, when they would try to cure people with leeches, when they would lock people up if they had a mental illness etc.  So better they admitted they didn't know how to treat you than lock you in a straight jacket with leeches I guess? But seriously, the medical community is made up of humans and what do they know? Here's what you know--The way you're living is not sustainable. Help is available. The ED \"voice\" is telling you not to because it doesn't want you to recover. It will always find reasons why you shouldn't.",
          "created_utc": 1618570900.0
        }
      ]
    },
    {
      "id": "guqc4vr",
      "author": "faroffland",
      "body": "Yeah, in my opinion (which I’m just some randomer on Reddit so take it with a pinch of salt!) it’s very much like only being willing to diagnose somebody with depression after they have tried to commit suicide - so after they have physically ‘proven’ how bad their mental health is and the emotions they are self reporting. Don’t get me wrong, I think eating disorders are dangerous and do come with inherent health risks that other disorders like depression and anxiety do not due to the behaviours associated, but I also think if we left people with depression or anxiety or any other mental illness to ‘prove’ their illness was serious before we acted like we basically do with ED, the mortality rate of those illnesses would also skyrocket.\n\nSo when people are like ‘so many people die of EDs and don’t recover isn’t it sad’ I’m like well yeah it is sad but a huge contributing factor is that we intervene far later than with any other mental disorder. We all know it’s harder to claw your way back out when you’ve been addicted and got comfort from your ED long term rather than short time - but by the very diagnostic criteria medical professionals refuse to acknowledge their illness until they are critical.\n\nIt is very, very fucked up imo.",
      "created_utc": 1618585217.0,
      "score": 3,
      "context": [
        {
          "id": "gupovfd",
          "author": "faroffland",
          "body": "I’ve weirdly enough recently commented on a few threads over on the UK sub about BMI being used as part of the diagnosis. It is crazy and really doesn’t make sense to me at all.\n\nMy BMI always hovered around 18.5 so I was never diagnosed with an eating disorder, even though I restricted a lot, sometimes made myself sick and lost weight very quickly. This was all reported to both my GP and hospital staff when at 16 I tried to kill myself, but I never got any treatment or help except 6 ‘counselling’ sessions (not even CBT).\n\nWe know eating disorders have one of (if not the) highest mortality rate of mental disorders. We know under 50% of sufferers of both anorexia and bulimia ever go on to have true, full recovery. People act like these are just facts of the illness but they aren’t - they are because we leave people to be literally dying before we intervene.\n\nI actively struggled with my eating disorder between the ages of 15-22. I have been struggling again recently but am fighting it. But to get any kind of diagnosis and therefore help through the NHS, I would need to weigh less than 110lbs. Were I ever to reach that point, I would probably have to actively struggle with my eating disorder for at least a year or longer. Starving myself for a good year only ever got me to about 119lbs so god knows how far I’d have to go to get to that point.\n\nYes, we need triage to ensure people who are physically dying get priority treatment, but the reality is with mental health care (at least in the UK) this means other ‘less unwell’ individuals are ignored. Even when diagnosed with an ED, you are often on waiting lists for a good year unless your BMI is something like 13 and you need immediate inpatient treatment.\n\nIt is one of the only mental illnesses where we tie the physicality of somebody to their diagnosis. In fact it’s the only one I can think of, all the rest are purely on mental and emotional symptoms, as they should be. At the moment it’s like somebody having an assessment for chronic depression, saying they feel awful, want to die all the time and have been self harming, but unable to be diagnosed with depression unless their cutting has been deep enough to hit an artery.\n\nI do think weight has a place in triaging but it shouldn’t mean anyone over a certain BMI CANNOT be diagnosed. It’s also a problem that many doctors seem to only diagnose anorexia or bulimia, and if you do not fit severe criteria of one of those two EDs you will not be diagnosed with one - even though many more exist.\n\nWe know people die of it, we know people struggle to recover, but unlike other mental health illnesses by the nature of its diagnosis including BMI we leave people to get deep into eating disorders before we intervene. Sorry for the rant but it’s fucking insane to me.",
          "created_utc": 1618573335.0
        },
        {
          "id": "guq8wjs",
          "author": "None",
          "body": "gaze possessive frame touch rock glorious entertain price encouraging ripe\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1618583817.0
        }
      ]
    },
    {
      "id": "guqas50",
      "author": "sunnyzombie",
      "body": "Yes, the US healthcare system is beyond broken and most especially where mental health in involved. It really is tragic.\n\nI can't help you with your search for a therapist but I will tell you how I found my social worker therapist. I was broke but desperately needing someone to talk to. I googled for therapists in my area. Her name popped up as someone who offered group sessions. I contacted her and bless her, she offered cost-adjusted sessions. She asked me what I could afford and accepted the $35 a visit I could pay. Then it turned out that she gave me private sessions after all because she didn't have a group I could fit into. I wound up seeing her privately for well over a year at $35 a session (once a week). She did not specialize in ED but worked with me on problems that contributed to my ED.\n\nDon't give up just because it hasn't worked for you yet. Call directly to therapists offices and see what they offer. Some will be ridiculously expensive but some may refer you to a therapist they know who might work out for you. Don't feel like the therapist must be an ED specialist. ED is a mental illness and has root causes in many areas. \n\nUtilize ED boards online but try to find ones that actively help you work on your problem and make useful suggestions. Read everything you can about ED and body neutrality. I'm not gonna lie, it's hard work to change the brainwashing, but it can be done.\n\nAgain, please don't give up on yourself. You can and will survive this.",
      "created_utc": 1618584631.0,
      "score": 1,
      "context": [
        {
          "id": "guq38ha",
          "author": "sunnyzombie",
          "body": "It's called atypical anorexia and it's a legitimate diagnosis  and it's what I had. The way my body is built I could never get below a certain weight and I was not considered underweight. And I was eating NOTHING. Just Slimfast all day long. \n\nYour therapist was wrong and uninformed. You need to find someone else to talk to, it doesn't have to be a specialist in ED. My first psychiatrist was freaking amazing and she was the one who put me on the path to recovery. Remember that control is a big part of what causes eating disorders. You can't control outside events or trauma so you focus on your body, something you believe you CAN control. \n\nI am almost 57 and I spent most of my life hating my body. Don't do that to yourself. You are so young still and you CAN overcome this. It's not easy and you will work at it for a long time, but the sooner you begin addressing the core issues, the sooner you will find happiness with yourself.\n\nYOU ARE WORTH IT. Get yourself another therapist and if you don't feel a groove with the new one, keep looking. I have had several in my life and some were better than others. The best one I had was a social worker who did therapy sessions. She's the one who taught me about boundaries. They don't have to be expensive or fancy to be good. You just need to click.",
          "created_utc": 1618581264.0
        },
        {
          "id": "guq6au2",
          "author": "None",
          "body": "sense busy axiomatic treatment ripe society chop terrific beneficial sulky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1618582671.0
        }
      ]
    }
  ]
}