{
  "id": "msrilt",
  "subreddit": "fuckeatingdisorders",
  "author": "littlemissbones",
  "created_utc": 1618668918.0,
  "title": "officially gained 10 lbs!",
  "selftext": "its hard to say that i intentionally gained weight. i feel disgusting, bloated, a whale compared to two months ago. i miss feeling so small. i miss my sick body. \n\nbut i can bike to the forest preserve and back without getting tired. i have the energy to do my schoolwork. i can focus in conversations with friends. i can regulate my emotions. im not so cold. i don’t worry about passing out or having a heart attack. i’m more productive with less effort. i’m not as anxious. my loved ones aren’t as worried about me. my team is proud of me. i am proud of me. \n\nwhat would you like recovery to give you?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/msrilt/officially_gained_10_lbs/",
  "score": 109,
  "num_comments": 3,
  "comments": [
    {
      "id": "guuxs98",
      "author": "None",
      "body": "Hey! Just wanted to say I’m in the same boat and reading posts like yours keeps me going :) some days can be really hard wishing I was that skinny again, but then I have to look at what else I’ve gained other than weight and it really does help, wishing you the best for the future!",
      "created_utc": 1618671869.0,
      "score": 16,
      "context": []
    },
    {
      "id": "guv6g7b",
      "author": "None",
      "body": "In my experience the bloating and discomfort goes away after a proper amount of time eating enough! I ended up gaining some weight long term (I’m a few years recovered now) but I feel stronger and emotionally stable, I’m not so cold anymore, and I don’t think about food 24/7 and I can enjoy it when I eat. Keep at it everyone.",
      "created_utc": 1618674757.0,
      "score": 9,
      "context": []
    },
    {
      "id": "guy48d5",
      "author": "seinfeld-monster",
      "body": "saving to keep as a reminder!! this random person on the reddit is proud of you too",
      "created_utc": 1618730865.0,
      "score": 1,
      "context": []
    }
  ]
}