{
  "id": "mu5t23",
  "subreddit": "fuckeatingdisorders",
  "author": "beezusbooflin",
  "created_utc": 1618853474.0,
  "title": "DAE feel like it wasn’t about their body?",
  "selftext": "I actually always felt like I had a nice body. It was my face I hated.\n\nI was told by multiple men that while I had a very nice body, my face was ugly. I was a prime candidate for being a great sex object without ever getting the love or respect that they’d give to a beautiful woman. \n\nNot sure why I ever thought that starving myself would give me a beautiful face.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/mu5t23/dae_feel_like_it_wasnt_about_their_body/",
  "score": 93,
  "num_comments": 12,
  "comments": [
    {
      "id": "gv4d92j",
      "author": "faroffland",
      "body": "It’s the opposite for me, I like my face but hate my body. I have a curvy stockier frame with thickset legs so I can never ever feel ‘thin’ - even at my lowest weight I never felt dainty, fragile or frail which is really what I craved. I have always wanted to be tall, thin and waifish/androgynous since I was a kid but that unfortunately will just never be me. As much as you couldn’t change your face through losing weight, my body would never be what I wanted because I’d have to grow like 4 inches, have way longer legs and just be a totally different shape - so even though it was different reasoning it was just as irrational/impossible. It was also the punishment and satisfaction from feeling hungry and pushing myself to be ‘better and better’ by being thinner.\n\nI hope you have come through it and feel better about yourself now. Your face is a face just like my body is a body - it doesn’t owe anyone anything or make you any more or less valuable. The men who told you those things are vile.",
      "created_utc": 1618862521.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gv46ujm",
      "author": "None",
      "body": "Yep yep yep yep. Face face face. I have a naturally round, puppy-fat face, and I feel insecure about it, even when I find lots of people with similar shaped faces soooo beautiful. My ED now absolutely extends to the rest of my body, but it’s almost like, as a way of checking the progress for my face, if that makes sense? \n\nFor your last sentence, I think sometimes the logic feels like I just want a ‘different’ face, like I just wanna swap my face for another one, and seeing as I’m not gonna get plastic surgery, and makeup comes off at night, maybe losing weight will change my reflection? I’m also obsessed with skincare... keep thinking that maybe if I can just get that glowey-glass skin, it’ll be the missing link?!!",
      "created_utc": 1618859714.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gv4iqdk",
      "author": "alexisseffy",
      "body": "I feel like that too! Pre eating disorder I had body image issues that focused on my face. I knew I couldn't change my face, but my body was something I could control and I wanted to make it \"perfect\" to make up for having an ugly face. But now my body image issues have evolved and now it's more about my body than my face, lol. My ED started because I wanted to be thin and change my body. But now isn't really about controlling my weight so I can be skinny, but I use it as a coping mechanism and to feel in control. I still have body image issues but not ED related, I guess? Idk if this makes any sense lmao",
      "created_utc": 1618864915.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gv5wl4e",
      "author": "Purplebash",
      "body": "I relate to it not being \"about the body\" in that I didn't start restricting \"for\" my body (and I also relate to having way more insecurities about my face than my body). For me, my behaviors developed out of a very tumultuous and stressful personal life that just felt to be getting out of control. When my partner pointed out his worry for me, leading me to Google anorexia, I immediately identified with the notion of needing control, of using restriction just to feel centered and grounded about at least one thing in life. Not to mention its self-harming aspects. I do remember seeing the weight drop and not wanting it to worsen, yet always being attached to the new number (\"OK, it can't get lower than this, but I can't let it go back up, either\"). I've been in recovery for 2.5 months now and I'm so thankful that I started \"early\" (like so many others in this sub, I really fought myself over whether I was \"sick enough\" for help). I can look back on the recent past with so much more objectivity now, and therefore more easily direct where my behaviors came from and how I can combat them. Not that I'm fully recovered, haha, but recognizing these things, like how much the body plays a role, is an important step.",
      "created_utc": 1618889795.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gv6pvi1",
      "author": "smolmood",
      "body": "I have had a previous boyfriend remark that I will \"never achieve the body\" I want with what he called \"starvation\" in a very condescending tone. And I agree it can be abou thing that aren't your body. For me, it was more about not feeling deserving of food and whenever I felt like a failure, I would just restrict food to 'punish' myself. And him telling me I cannot achieve that body and basically making me out to be too lazy to work out enough to get \"fit\" made me feel even worse and more worthless.  \n\n\nI know it isn't like that for everyone but in a sense, it is a struggle for control over my own body for me.",
      "created_utc": 1618914307.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gv4ijed",
      "author": "Monumental-Mistake",
      "body": "It didn't start off that way. I developed mine a few months after my dad passed when I was 16. It just recently started becoming about body issues.",
      "created_utc": 1618864828.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv575el",
      "author": "its_me_anonymous16",
      "body": "yep. I even liked my face AND my body when I developed an ED. Go figure",
      "created_utc": 1618876358.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv6r62r",
      "author": "pipsqueak_pixie",
      "body": "I like how I look and my body shape, I think I look better slender vs overweight, but ultimately it's my obsession with the numbers (calories /scale) and competing with my past self to eat less weigh less. My body is just a flesh sack to be punished 🤣 I'm not doing it to look pretty to others or anything. My body looks huge or skinny depending on my brain at any given moment I have no idea what I look like really",
      "created_utc": 1618915429.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvroq3e",
      "author": "None",
      "body": "For me, it was more so trying to gain control of my body after a traumatic event. So my ED was the way I felt in control. I honestly didn’t even know what an eating disorder was until my twirling coach told my mom that she suspected anorexia.. which led to therapists and basically being stalked by my coach and fellow classmates.. it still isn’t about body image for me. Whenever I feel loss of control or mentally insecure in my jobs and tasks, and when I get “too busy”.. it triggers lapses/relapses.\nWhich makes the honesty about it more frustrating because so many providers only view it as a body image and weight insecurity.. but for me it’s really about feeling the need to keep control of my body and fear of losing that control again. I’m glad I’m not alone with this!",
      "created_utc": 1619311514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gv67kiv",
      "author": "YamikoPros",
      "body": "This definitely for me! I realizes the same thing eventually--that no matter how thin i was trying to get i couldnt make my ribcage thinner or my torso longer. I think one of the biggest things for me in recovery was recognizing that and forcing myself to make peace with my skeleton structure. You can't transform bone.",
      "created_utc": 1618897371.0,
      "score": 1,
      "context": [
        {
          "id": "gv4d92j",
          "author": "faroffland",
          "body": "It’s the opposite for me, I like my face but hate my body. I have a curvy stockier frame with thickset legs so I can never ever feel ‘thin’ - even at my lowest weight I never felt dainty, fragile or frail which is really what I craved. I have always wanted to be tall, thin and waifish/androgynous since I was a kid but that unfortunately will just never be me. As much as you couldn’t change your face through losing weight, my body would never be what I wanted because I’d have to grow like 4 inches, have way longer legs and just be a totally different shape - so even though it was different reasoning it was just as irrational/impossible. It was also the punishment and satisfaction from feeling hungry and pushing myself to be ‘better and better’ by being thinner.\n\nI hope you have come through it and feel better about yourself now. Your face is a face just like my body is a body - it doesn’t owe anyone anything or make you any more or less valuable. The men who told you those things are vile.",
          "created_utc": 1618862521.0
        }
      ]
    },
    {
      "id": "gv575v0",
      "author": "its_me_anonymous16",
      "body": "now I look worse",
      "created_utc": 1618876364.0,
      "score": 2,
      "context": [
        {
          "id": "gv575el",
          "author": "its_me_anonymous16",
          "body": "yep. I even liked my face AND my body when I developed an ED. Go figure",
          "created_utc": 1618876358.0
        }
      ]
    }
  ]
}