{
  "id": "myon0u",
  "subreddit": "fuckeatingdisorders",
  "author": "danneedefeeto",
  "created_utc": 1619407936.0,
  "title": "DUDES. RECOVERY IS WORTH IT. SEE UR EXTREME HUNGER THRU.",
  "selftext": "Holy shit,\n\nCan't believe I'm saying this, but y'all HONOR YOUR EXTREME HUNGER. EVEN IF YOU'RE \"WEIGHT RESTORED\". EVEN IF IT'S THOUSANDS OF CALORIES.\n\nLiterally I was on here like 10 day's ago freaking out bc my body was hella hungry after I've already gained like so much weight. But nonetheless, I ate. I'm talking like 4-6 k calories.\n\nI was about to give up, ngl. Felt bloated, uncomfy, and scared.\n\nbut lo and behold... not to jinx it... but yesterday and today DIDN'T HAVE ANY!!! Completely normal hunger cues and no mental hunger??? like at all??? and my headass nearly convinced myself I had BED.\n\nguys... ik it's scary. but you just gotta send it. fuck my eating disorder. fuck your eating disorder. we deserve to eat. whenever we want, whatever we want.\n\nyou're going to be okay babe. nourish your body, accept yourself for where you are, and let go of that all that metahorical (or literal hopefully bc eating enough will eventually regulate ur digestive system) shit you're holding in you!! you deserve it!!!\n\nI'm so close to full recovery, I can taste it. I hope y'all one day can experience this too.\n\nI'm gonna take a break off this thread, because I lowkey think chilling on here is still. kind of a \"control' aspect of the ED that's still lingering. However, I think I'm still going to check in monthly to let y'all know how my all in journey is going, as I know it can be pretty scary for you babes. Love you all and hope you're doing well.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/myon0u/dudes_recovery_is_worth_it_see_ur_extreme_hunger/",
  "score": 164,
  "num_comments": 6,
  "comments": [
    {
      "id": "gvwdd5l",
      "author": "throwaway1234326786",
      "body": "Yay!!! I’m so happy for you!!! When this happened to me I was so hesitant to trust it cause it went back and forth for a few days but after that it’s been so nice!",
      "created_utc": 1619414307.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gvwl1f9",
      "author": "SlitherDuck",
      "body": "That’s fantastic! Thank you for posting this... it’s so reassuring to see this :)",
      "created_utc": 1619420550.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gvxndzz",
      "author": "matalia0",
      "body": "yesss i’m so happy for you!! and thank you so much for this post!!!! i had such a bad day yesterday because i gave in to all my mental hunger but it’s good to be reminded that things get better",
      "created_utc": 1619448186.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvxhg76",
      "author": "blondiesdiary",
      "body": "Yes!!!! I’ve been through treatment a couple of times and I was about to give up because even on my meal plan I seemed to always be hungry physically and definitely mentally! This time, they’ve kept me on a slightly higher meal plan the whole time and I’ve felt satisfied physically and mentally! It’s uncomfortable at first-for quite a bit- but it’s worth it to be able to focus on things other than food 24/7.!",
      "created_utc": 1619445420.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvxu4tj",
      "author": "HaloTopHoe",
      "body": "Youre my hero!!! I've actually gained weight recently and im no longer underweight,  just the low end of normal. However, im stuck on this stupid quasi recovery BS....Ive bern giving into my hunger including mental, every weekend,  but i end up eating like you said 4000-6000 , hence i freak out and restrict and exercise all week, then rinse and repeat.  Im maintaining my weight this way, but i know my body wants to go up more,  im just not mentally ready yet. Im just now getting used to not being severely underweight,  and sometimes long to look like that again even though I KNOW how miserable i was. \nAnyway sorry for the book lol, you're an inspiration and i really hope by the end of this year I'll be where you are!! You're freaking amazing and THANK YOU for posting this!",
      "created_utc": 1619451121.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw0iwn2",
      "author": "danneedefeeto",
      "body": "Totally been there. Life without mental hunger is amazing. Today I ate a spoonful of PB and then like just went and did stuff? Only a couple weeks ago I had to eat the whole jar to feel satisfied lol. Keep seeing it through!! It'll be worth it!",
      "created_utc": 1619496662.0,
      "score": 3,
      "context": [
        {
          "id": "gvxndzz",
          "author": "matalia0",
          "body": "yesss i’m so happy for you!! and thank you so much for this post!!!! i had such a bad day yesterday because i gave in to all my mental hunger but it’s good to be reminded that things get better",
          "created_utc": 1619448186.0
        }
      ]
    }
  ]
}