{
  "id": "n0espi",
  "subreddit": "fuckeatingdisorders",
  "author": "internerderner2",
  "created_utc": 1619616483.0,
  "title": "Why is it that often \"stop restricting\" is interpreted as \"don't eat less than your meal plan\"?",
  "selftext": "It's not the same thing!\n\nI so often see people in recovery saying that they stopped restricting, or that they don't restrict, and encouraging others to do the same...yet when they show what they actually eat it's just a very normal meal plan with normal or even small-ish portions.\n\nI mean...I don't wanna invalidate or gatekeep them, I'm sure they believe what they say, but is it possible that for every single person in recovery out there \"stop restricting\" magically means \"eating in a very balanced way according to a perfectly crafted meal plan that just allows you to maintain your weight and maybe slowly gain a bit over time\"? Meanwhile I'm here binging my ass off everytime I try to \"stop restricting\".\n\nAnd I'm not just talking about people who are \"in recovery\" but actually not. I'm also referring to youtubers/instagrammers/whatever who do seem to be genuinely in recovery. And actually even dietitian themselves now that I think about it.\n\nMaybe it's just me. Maybe I'm misinterpreting everything. But it's just that for me personally I can't imagine how \"stopping restricting\" and \"eating normal meals\" can go together. \"Normal meals\" feel restrictive and these people make me feel even crazier. I saw someone the other day telling something along the lines of oh, I used to obsess so much about this food but since I stopped restricting it I no longer think about it. Girl you eat like two mouthfuls of it once a day, please tell me your secret and how you managed to stop obsessing over it with those measly amounts!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/n0espi/why_is_it_that_often_stop_restricting_is/",
  "score": 83,
  "num_comments": 34,
  "comments": [
    {
      "id": "gw656gf",
      "author": "cirkei",
      "body": "I agree and that’s why I stay away from all the “what I eat in a day”-videos. I don’t need to see what ‘normal’ sized meals looks like because I already know :’) I’m very pleased with my all-in, no-restriction, some times spontaneous, but trying to be ‘normal’ eating, thank you ✊",
      "created_utc": 1619617003.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gw6m3ha",
      "author": "tinylil",
      "body": "In my experience (mostly recovered, have been eating my full recommended calorie intake for the most part for ~2 years), “normal” meals didn’t feel like enough until about a year in. Sometimes they still don’t and I get seconds or have a small snack later.\n\n It takes so much longer for some of us and that’s ok. At the beginning of recovery until like, six months ago, I would lose my shit for oreos and binged them whenever they were around. That’s a year and a half long oreo obsession that just kind of fizzled out a couple months ago when I was eating one and realized it wasn’t scratching whatever itch I expected it to. \n\nI am deeply suspicious of anyone recovered that posts “what I eat in a day” videos. I unfollow immediately. I don’t need that in my life, even if they seem to be eating a lot or otherwise earnest about their recovery.",
      "created_utc": 1619624537.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gw6e3nc",
      "author": "baswild",
      "body": "that is also why i stay away from that type of content. i find the online recovery community in general on instagram, youtube, and tik tok fairly toxic and i only engage in content from people that are CLEARLY fully recovered and not pseudo recovered or just beginning recovery. for me, being recovered means being able to eat an entire bowl of ice cream for a snack and then pizza for dinner in the same day. food is just fuel. eating according to hunger cues instead of the perfectly portioned levels of food. and i rarely see that online.",
      "created_utc": 1619621116.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gw7q4ro",
      "author": "awesomeblosom",
      "body": "I think if you're following a strict meal plan, even if it's a \"normal\" amount to eat in a day, if you want to be eating more, you're still restricting yourself. You can be eating a normal amount in a day and be restricting, the word doesn't only mean starving yourself. A strict meal plan is restriction, because you're restricting yourself from eating what you would otherwise, and restricting yourself to only those foods. That's literally the definition of \"restriction\".\n\nIn my recovery from my restriction, yeah I did binge. Because recovery is a process. It's not one day that you decide I'm in recovery now because I'm following this non-restrictive meal plan and am never going to make myself throw up or binge again. It's slow. I started paying attention to my body and that I want to feel good. I *had* to mess up sometimes, otherwise I wouldn't have those moments to stop and reflect and think about how it made me feel. I allowed myself to eat an entire box of macaroni and cheese (a few times), and instead of shaming myself or hating myself, I reminded myself that I was allowed to, but also payed attention to my body and how I felt and I felt, physically, like absolute shit from it. Slowly I have learned what makes my body feel good and have prioritized that, and I am making great progress.\n\nAt the same time, I know that not everybody's recovery looks like mine, and I think that if a meal plan is in place to get somebody with restrictive issues to eat *more,* that is the healthiest thing for them, and it isn't my place to decide whether it is. That being said, there are super toxic diet culture doctors out there, and someone working on a meal plan with their doctor *does not* inherently make it healthy or something we shouldn't talk about whether it is healthy.\n\nI also am really not into the comments saying that the fear of binging or talking about recovery from restriction being eating what we want to eat scares people away from recovery. If eating what you want is so scary that you are continuing to do harm by restricting and not starting recovery, *that* is what you need to work on, not your meal plan. Eating what you want is scary to people in ED recovery, why? Because it will make them fat. Heaven forbid you look like me, right? We need to make sure they know they can recover without ending up looking like me, because that would be the *worst thing* to happen, and will keep them from choosing recovery.... I don't subscribe to catering to that. Deal with your internalized fatphobia first. See a therapist and deal with your overwhelming fear of looking like I look. Restricting yourself from binging when in \"recovery\" from restricting more is not actually being in recovery. It's putting a band aid and not addressing the root. You're still restricting yourself from your other eating disorder that you haven't addressed, binge eating disorder and it's going to stay with you forever until you get to the root cause and change that. You will be restricting yourself on a meal plan forever, wanting to eat more, fearing it, and shaming yourself when you do. Healthy relationships with food do exist after recovery, I know first hand, but yeah restricting yourself from a need to binge without working on intuitive eating, is not the road to a healthy relationship with food. Maybe a first step towards it, but it's not it.\n\nTo reiterate, though - smaller portioned meals to make sure that you are eating the right amount and avoiding refeeding syndrome and other health issues that come in the beginning stages of recovery may be necessary for some people, and it's absolutely NOT my place to decide for them, based on me looking in from the outside. This is *far* from being every case, and it is a problem, but it still isn't my place to decide that for others without knowing the details.\n\nEdit to add: Also if somebody is on a restrictive meal plan that aids to their recovery, like in the examples I mentioned above, there is NO reason for them to be sharing that on social media saying they \"aren't restricting,\" and maybe that's where some of my strong feelings on this come from. Like, yeah maybe restricting in that way is necessary for some people's recovery, but it's still restricting. You're not \"recovered\" in your relationship with food if you'd be binging like crazy if you allowed yourself to.",
      "created_utc": 1619641209.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gw6msl2",
      "author": "dudadantas",
      "body": "I’ve been “recovering” like that and honestly at this point I think it won’t do it for me, I’m not underweight anymore so there’s that, but my period still nowhere to be found.",
      "created_utc": 1619624829.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gw7yl1y",
      "author": "Sareeee48",
      "body": "This is everything I’ve wanted to say and never had the words for.\n\nPeople just straight up don’t know or choose to ignore that “eating normally” isn’t physically possible right away when choosing to recover. It takes a looooot of time—I’m almost 14 months into all in and my appetite *just* balanced out. \n\nI think many people are just terrified of eating freely/intuitively and the fear of weight gain 100% holds them back and so they think as long as they’re eating “normal” means they’re fine, despite still ignoring their hunger and only eating within their meal plan... when meal plans are meant to be a guideline and if you are hungry you can absolutely eat more.",
      "created_utc": 1619644755.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gw6pydu",
      "author": "None",
      "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
      "created_utc": 1619626086.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gw70gtv",
      "author": "ferlin__elvis",
      "body": "I see it as \"stop restricting to an abnormal/unhealthy extent\", I think most (normal) people recognize that moderation is key, that's why most adults don't retain the eating habits of Kevin McAllister on his first day home alone....but I'm one of those meal plan people which I recognize isn't \"normal\" either so IDK",
      "created_utc": 1619630435.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw6sfu7",
      "author": "Janawa",
      "body": "Just because their \"normal\" meals seem small to you, that is their journey and their \"not restricting\".  Everyone's eating disorder and recovery is different.  Binging is not \"stopping restricting\".  Eating carelessly or overeating is the other side of the spectrum, and should not be encouraged as an alternative to restricting, as it will scare people away from recovery.  Their meal plans and eating three meals a day is how they stop restricting, as they might have not ate any full meals a day before recovery.  I personally only ate partial meals or snacks throughout the day, staying below a certain calorie limit, so for me, \"not restricting\" was learning to eat three full meals a day and a small snack in between.  Was I binging or gaining ridiculous amounts??  No.  And if I was, it would have discouraged me from continuing recovery.",
      "created_utc": 1619627121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gw8g7vu",
      "author": "None",
      "body": "I agree. Even though I loved my second nutritionist, her mealplan for me, a college student, was very idealistic. As I got healthier I realized how small my portions actually were in comparison to my daily activity. So, I just decided to listen to my body and follow my friends in what they were eating (non-ED friends, of course).",
      "created_utc": 1619653005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gycf5nd",
      "author": "tkdaw",
      "body": "A huge part of restrictive ED is that we trade volume for caloric density. E.g., we eat 3k, or more, but we still use so many safe foods that the volume is HUGE. More professional meal plans probably have like, same calories, but done in a way that 3k looks like \"normal\" portions (whatever the fuck that means). Like, I've seen people doing MinnieMaud with HaloTop and im like...why. that's a whole ass pint of ice cream for like, 300 kcals. Where you getting your other 2700+? \n\nUltimately, it's caloric and macro/micronutrient sufficiency that drives satiation. A professionally designed meal plan may be able to achieve that while the portions don't look 'insane.' \n\nThere's also a mental part of restriction, too. For me, if I know I have a whole jar of peanut butter in the fridge, and that it's mine, and that I can have it *whenever,* I just...stop caring. Same for cereal, etc. When it's not in limited supply, food gets less interesting. Being able to look at a meal plan and see that XYZ is literally REQUIRED can help as much as all-in HOLY FUCK I CAN HAVE ALL THE FOOD type recovery - meal planning works well for me because I struggle with decisions, and all-in terrifies me because I don't know *what* I want, but planning meals according to nutrition goals? Can do. If I want something else? ...working on it. Recovery is a process.",
      "created_utc": 1621185832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gw6mzvf",
      "author": "dudadantas",
      "body": "Oh and not to mention the extreme hunger days when it’s clear that the meal plan is not enough 🤡",
      "created_utc": 1619624914.0,
      "score": 6,
      "context": [
        {
          "id": "gw6msl2",
          "author": "dudadantas",
          "body": "I’ve been “recovering” like that and honestly at this point I think it won’t do it for me, I’m not underweight anymore so there’s that, but my period still nowhere to be found.",
          "created_utc": 1619624829.0
        }
      ]
    },
    {
      "id": "gw6sqqy",
      "author": "Janawa",
      "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
      "created_utc": 1619627246.0,
      "score": 7,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        }
      ]
    },
    {
      "id": "gw70ux0",
      "author": "internerderner2",
      "body": "While I do get your point, my personal experience pre-ED was that I had a very moderate, balanced diet but I didn't really \"restrict\". To me restriction is voluntary, whereas pre-ED I just happened to eat like a normal person without really \"applying\" moderation if that makes sense. Right now though anything close to \"normal\" would be restriction for me. But again that's really just my experience fwiw...",
      "created_utc": 1619630594.0,
      "score": 2,
      "context": [
        {
          "id": "gw70gtv",
          "author": "ferlin__elvis",
          "body": "I see it as \"stop restricting to an abnormal/unhealthy extent\", I think most (normal) people recognize that moderation is key, that's why most adults don't retain the eating habits of Kevin McAllister on his first day home alone....but I'm one of those meal plan people which I recognize isn't \"normal\" either so IDK",
          "created_utc": 1619630435.0
        }
      ]
    },
    {
      "id": "gw707wv",
      "author": "selkieflying",
      "body": "Yes exactly!",
      "created_utc": 1619630335.0,
      "score": 2,
      "context": [
        {
          "id": "gw6sfu7",
          "author": "Janawa",
          "body": "Just because their \"normal\" meals seem small to you, that is their journey and their \"not restricting\".  Everyone's eating disorder and recovery is different.  Binging is not \"stopping restricting\".  Eating carelessly or overeating is the other side of the spectrum, and should not be encouraged as an alternative to restricting, as it will scare people away from recovery.  Their meal plans and eating three meals a day is how they stop restricting, as they might have not ate any full meals a day before recovery.  I personally only ate partial meals or snacks throughout the day, staying below a certain calorie limit, so for me, \"not restricting\" was learning to eat three full meals a day and a small snack in between.  Was I binging or gaining ridiculous amounts??  No.  And if I was, it would have discouraged me from continuing recovery.",
          "created_utc": 1619627121.0
        }
      ]
    },
    {
      "id": "gw6teyu",
      "author": "None",
      "body": "I understand. That's why I said that's my personal definition of not restricting. I didn't say that it was for everyone.",
      "created_utc": 1619627526.0,
      "score": 4,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        }
      ]
    },
    {
      "id": "gw70ds1",
      "author": "internerderner2",
      "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
      "created_utc": 1619630402.0,
      "score": 4,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        }
      ]
    },
    {
      "id": "gw7z2mv",
      "author": "Sareeee48",
      "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
      "created_utc": 1619644968.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        }
      ]
    },
    {
      "id": "gw97l9n",
      "author": "ferlin__elvis",
      "body": "I use the meal plan stuff as more of a guideline at this point so I don't get too off-track (which I know isn't a pre-ED mindset but I don't have faith that that Pandora's Box can ever be re-closed) but I'm open to endless amendments depending on circumstances/how I feel? So I guess it's sort of a mid-way point between full intuitiveness and persistent deliberate deprivation. I feel that it's helped me consciously re-learn intuitive eating after the trauma of ED, maybe it's keeping the ED around and a full reset would be better in the long run though (I just don't see that it's possible for me save full erasure of those memories).",
      "created_utc": 1619666533.0,
      "score": 1,
      "context": [
        {
          "id": "gw70gtv",
          "author": "ferlin__elvis",
          "body": "I see it as \"stop restricting to an abnormal/unhealthy extent\", I think most (normal) people recognize that moderation is key, that's why most adults don't retain the eating habits of Kevin McAllister on his first day home alone....but I'm one of those meal plan people which I recognize isn't \"normal\" either so IDK",
          "created_utc": 1619630435.0
        },
        {
          "id": "gw70ux0",
          "author": "internerderner2",
          "body": "While I do get your point, my personal experience pre-ED was that I had a very moderate, balanced diet but I didn't really \"restrict\". To me restriction is voluntary, whereas pre-ED I just happened to eat like a normal person without really \"applying\" moderation if that makes sense. Right now though anything close to \"normal\" would be restriction for me. But again that's really just my experience fwiw...",
          "created_utc": 1619630594.0
        }
      ]
    },
    {
      "id": "gw79d9d",
      "author": "Janawa",
      "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
      "created_utc": 1619634137.0,
      "score": -1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        }
      ]
    },
    {
      "id": "gw83u58",
      "author": "Janawa",
      "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
      "created_utc": 1619647098.0,
      "score": 0,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        }
      ]
    },
    {
      "id": "gw7sdzj",
      "author": "awesomeblosom",
      "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
      "created_utc": 1619642128.0,
      "score": 2,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        }
      ]
    },
    {
      "id": "gw8aiiw",
      "author": "Sareeee48",
      "body": "It’s defined as a *psychiatric disorder*. Feeding and eating disorders are not about food alone, which is why they’re recognized as psychiatric disorders. People typically develop them as a way of dealing with a deeper issue or another psychological condition, such as anxiety or depression.\n\nAgain, it’s not about the food. It is a psychiatric disorder for a reason. Telling people that it’s not healthy to eat what they want when they want (as long as it makes them feel good) as unhealthy is harmful af.",
      "created_utc": 1619650244.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        },
        {
          "id": "gw83u58",
          "author": "Janawa",
          "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
          "created_utc": 1619647098.0
        }
      ]
    },
    {
      "id": "gw7ywgx",
      "author": "Janawa",
      "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
      "created_utc": 1619644893.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        }
      ]
    },
    {
      "id": "gw8bdhi",
      "author": "Janawa",
      "body": "Yes, and there can be deeper emotions tied to it.  But, this *psychiatric disorder* can also be defined as an *addiction*, and an *addiction* does not strictly need to have a specific emotion or other mental disorder tied to it.  As I stated, in my case I was addicted to food, but I didnt eat it because I was sad, or depressed, or bored, or anxious.  I ate it because I was hungry, because I had been starving myself.  I went beyond intuitive eating, and ate until I was bloated, because I could not stop myself.  I did not target my depression, anxiety, or any other disorder when I stopped binging.\n\nIt absolutely can be unhealthy to eat whatever you want whenever.  It was unhealthy for me.  Eating whatever I had a craving for whenever I wanted led to me gaining weight rapidly.  I was constantly bloated to the point my stomach was hard and distended, so much that people would question if I was pregnant.  I was constantly in physical and emotional pain.  I would eat because I couldn't stop myself, and then hate myself for it and cut later at night because I was upset that I was gaining weight uncontrollably.  Eating whatever whenever or trying to learn to intuitively eat without support, or guidance, absolutely can lead you to the other side of the spectrum, which is over Eating and binge eating, and is harmful to your body and mind.",
      "created_utc": 1619650656.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        },
        {
          "id": "gw83u58",
          "author": "Janawa",
          "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
          "created_utc": 1619647098.0
        },
        {
          "id": "gw8aiiw",
          "author": "Sareeee48",
          "body": "It’s defined as a *psychiatric disorder*. Feeding and eating disorders are not about food alone, which is why they’re recognized as psychiatric disorders. People typically develop them as a way of dealing with a deeper issue or another psychological condition, such as anxiety or depression.\n\nAgain, it’s not about the food. It is a psychiatric disorder for a reason. Telling people that it’s not healthy to eat what they want when they want (as long as it makes them feel good) as unhealthy is harmful af.",
          "created_utc": 1619650244.0
        }
      ]
    },
    {
      "id": "gw88ft6",
      "author": "awesomeblosom",
      "body": "I absolutely never stated that eating whatever whenever is recovery or inherently healthy, or that not caring about macros or calories is a requirement, either. I said the root of the unhealthy eating that you're describing has not been addressed.   \n\n\nI also absolutely never stated that people can't eat healthily and have meal plans. In fact I stated that even though it's restriction, there are times it is healthiest for people.   \n\n\nPlease don't put words in my mouth again.   \n\n\nIf you are restricting yourself from eating what you want to eat, that is literally restriction. I agree that there are times that it is appropriate and healthy to restrict what you eat, but that's the literal definition of the word.  \n\n\nRecovery is in some ways being able to eat what you want, but so much more, like learning to \\*want\\* to eat healthy and be healthy, how to listen to our bodies, to want to fill them with nutrients, to crave vegetables and fresh things that make our bodies *feel* good so that we feel good and are healthy. This work / journey isn't happening if I am thinking about how I want to be eating the thing that I can't have, because I'm restricting myself from it by being on a meal plan. I'm not building that healthy relationship with food, so the eating disorder is still there, just masked. People can eat healthily with masked eating disorders for long periods of time. And like I said, this is a perfectly valid place to be, and is part of a lot of people's journey's towards recovery and that's great that it helps people. It is still restricting.",
      "created_utc": 1619649257.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        }
      ]
    },
    {
      "id": "gycftjv",
      "author": "tkdaw",
      "body": "Yes. My recovery involves figuring out nutritional goals and trying to restore \"normal\" eating, with a little flexibility. One, because flexibility *is* normal, but two, I'm ok with cutting myself a little slack in the aftermath of a, well, starvation hobby.",
      "created_utc": 1621186111.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        }
      ]
    },
    {
      "id": "gw8kak3",
      "author": "Sareeee48",
      "body": "“I was constantly in physical and emotional pain. . . and cut later at night because I was upset.” You *just* said there were no underlying psychological reasons, but those sound like underlying psychological reasons.\n\nI can get behind eating disorders having an addictive aspect to it, we know that’s true due to science. But we *also* know that developing binge eating disorder after a restrictive eating disorder is extreme uncommon, and impossible to have at concurrently. It is harmful to say that people shouldn’t attempt to practice intuitive eating after a restrictive eating disorder because *some* people might develop BED. *that* scares people from recovery, especially people who don’t have the luxury to afford a professional in IE.",
      "created_utc": 1619654975.0,
      "score": 2,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        },
        {
          "id": "gw83u58",
          "author": "Janawa",
          "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
          "created_utc": 1619647098.0
        },
        {
          "id": "gw8aiiw",
          "author": "Sareeee48",
          "body": "It’s defined as a *psychiatric disorder*. Feeding and eating disorders are not about food alone, which is why they’re recognized as psychiatric disorders. People typically develop them as a way of dealing with a deeper issue or another psychological condition, such as anxiety or depression.\n\nAgain, it’s not about the food. It is a psychiatric disorder for a reason. Telling people that it’s not healthy to eat what they want when they want (as long as it makes them feel good) as unhealthy is harmful af.",
          "created_utc": 1619650244.0
        },
        {
          "id": "gw8bdhi",
          "author": "Janawa",
          "body": "Yes, and there can be deeper emotions tied to it.  But, this *psychiatric disorder* can also be defined as an *addiction*, and an *addiction* does not strictly need to have a specific emotion or other mental disorder tied to it.  As I stated, in my case I was addicted to food, but I didnt eat it because I was sad, or depressed, or bored, or anxious.  I ate it because I was hungry, because I had been starving myself.  I went beyond intuitive eating, and ate until I was bloated, because I could not stop myself.  I did not target my depression, anxiety, or any other disorder when I stopped binging.\n\nIt absolutely can be unhealthy to eat whatever you want whenever.  It was unhealthy for me.  Eating whatever I had a craving for whenever I wanted led to me gaining weight rapidly.  I was constantly bloated to the point my stomach was hard and distended, so much that people would question if I was pregnant.  I was constantly in physical and emotional pain.  I would eat because I couldn't stop myself, and then hate myself for it and cut later at night because I was upset that I was gaining weight uncontrollably.  Eating whatever whenever or trying to learn to intuitively eat without support, or guidance, absolutely can lead you to the other side of the spectrum, which is over Eating and binge eating, and is harmful to your body and mind.",
          "created_utc": 1619650656.0
        }
      ]
    },
    {
      "id": "gw89dah",
      "author": "Janawa",
      "body": "\"Someone on a meal plan so they don't binge is not recovered\".  Which is untrue.  \"If you are restricting yourself from eating what you want to eat, that is literally restriction.\"  It might be literal restriction, but does not mean that they are anorexic or not recovered.  Someone who is recovered but says no to a food craving every now and then is still recovered.  Someone who is recovered and follows a meal plan to make sure they hit their caloric and nutrient needs, is still recovered.  Someone who is regularly eating at or above their caloric and nutritional needs every day is recovered.  It doesn't matter if they follow a meal plan, if they are working with a nutritionist to know what to eat or what their caloric and nutritional needs are, or if they eat smaller portions than Someone else, they are still recovered.  They are recovered even if they still feel anxiety once in a blue moon over a certain meal.  They are recovered even if they deny themselves a certain sweet treat every now and then, because these are things healthy people do, that people with eating disorders do to the *extreme*.  \n\n\"[Recovery] isn't happening if I am thinking about the thing I want to have but am not letting myself eat it.\" Yes, it is, and you can be recovered and still crave a food, and think \"I should not eat that right now.\"  For example, Someone in Recovery could finish a meal, crave dessert, and decide not to eat it because they know they would feel bloated or sick eating more at that point.  The difference between casual or occasion restriction and restricting in the form of an eating disorder is the frequency.  If they always restrict that food, if they never eat it because they are scared of it, that is unhealthy.  If they allow themselves to eat it, but decide occasionally it isn't the right thing to have right now, that is not unhealthy.",
      "created_utc": 1619649698.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        },
        {
          "id": "gw88ft6",
          "author": "awesomeblosom",
          "body": "I absolutely never stated that eating whatever whenever is recovery or inherently healthy, or that not caring about macros or calories is a requirement, either. I said the root of the unhealthy eating that you're describing has not been addressed.   \n\n\nI also absolutely never stated that people can't eat healthily and have meal plans. In fact I stated that even though it's restriction, there are times it is healthiest for people.   \n\n\nPlease don't put words in my mouth again.   \n\n\nIf you are restricting yourself from eating what you want to eat, that is literally restriction. I agree that there are times that it is appropriate and healthy to restrict what you eat, but that's the literal definition of the word.  \n\n\nRecovery is in some ways being able to eat what you want, but so much more, like learning to \\*want\\* to eat healthy and be healthy, how to listen to our bodies, to want to fill them with nutrients, to crave vegetables and fresh things that make our bodies *feel* good so that we feel good and are healthy. This work / journey isn't happening if I am thinking about how I want to be eating the thing that I can't have, because I'm restricting myself from it by being on a meal plan. I'm not building that healthy relationship with food, so the eating disorder is still there, just masked. People can eat healthily with masked eating disorders for long periods of time. And like I said, this is a perfectly valid place to be, and is part of a lot of people's journey's towards recovery and that's great that it helps people. It is still restricting.",
          "created_utc": 1619649257.0
        }
      ]
    },
    {
      "id": "gw8kg47",
      "author": "Janawa",
      "body": "Those are not causes of my binging.  Those were the emotional turmoil caused by binging.  It did not encourage the binging.  I never said they shouldn't attempt intuitive eating. I said they should seek support, especially professional support, when doing it.  And it is NOT uncommon for peoples disordered eating to change.  Most people with eating disorders experience symptoms of other disorders, and they change over time.  I am NOT claiming that recovery causes BED.  I am saying misinformation about what recovery entails can lead to symptoms of it, though.  Eating \"whatever whenever\" can cause or be binge eating.  Intuitive eating, and knowing to stop before you get sick, is not.",
      "created_utc": 1619655050.0,
      "score": 2,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        },
        {
          "id": "gw83u58",
          "author": "Janawa",
          "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
          "created_utc": 1619647098.0
        },
        {
          "id": "gw8aiiw",
          "author": "Sareeee48",
          "body": "It’s defined as a *psychiatric disorder*. Feeding and eating disorders are not about food alone, which is why they’re recognized as psychiatric disorders. People typically develop them as a way of dealing with a deeper issue or another psychological condition, such as anxiety or depression.\n\nAgain, it’s not about the food. It is a psychiatric disorder for a reason. Telling people that it’s not healthy to eat what they want when they want (as long as it makes them feel good) as unhealthy is harmful af.",
          "created_utc": 1619650244.0
        },
        {
          "id": "gw8bdhi",
          "author": "Janawa",
          "body": "Yes, and there can be deeper emotions tied to it.  But, this *psychiatric disorder* can also be defined as an *addiction*, and an *addiction* does not strictly need to have a specific emotion or other mental disorder tied to it.  As I stated, in my case I was addicted to food, but I didnt eat it because I was sad, or depressed, or bored, or anxious.  I ate it because I was hungry, because I had been starving myself.  I went beyond intuitive eating, and ate until I was bloated, because I could not stop myself.  I did not target my depression, anxiety, or any other disorder when I stopped binging.\n\nIt absolutely can be unhealthy to eat whatever you want whenever.  It was unhealthy for me.  Eating whatever I had a craving for whenever I wanted led to me gaining weight rapidly.  I was constantly bloated to the point my stomach was hard and distended, so much that people would question if I was pregnant.  I was constantly in physical and emotional pain.  I would eat because I couldn't stop myself, and then hate myself for it and cut later at night because I was upset that I was gaining weight uncontrollably.  Eating whatever whenever or trying to learn to intuitively eat without support, or guidance, absolutely can lead you to the other side of the spectrum, which is over Eating and binge eating, and is harmful to your body and mind.",
          "created_utc": 1619650656.0
        },
        {
          "id": "gw8kak3",
          "author": "Sareeee48",
          "body": "“I was constantly in physical and emotional pain. . . and cut later at night because I was upset.” You *just* said there were no underlying psychological reasons, but those sound like underlying psychological reasons.\n\nI can get behind eating disorders having an addictive aspect to it, we know that’s true due to science. But we *also* know that developing binge eating disorder after a restrictive eating disorder is extreme uncommon, and impossible to have at concurrently. It is harmful to say that people shouldn’t attempt to practice intuitive eating after a restrictive eating disorder because *some* people might develop BED. *that* scares people from recovery, especially people who don’t have the luxury to afford a professional in IE.",
          "created_utc": 1619654975.0
        }
      ]
    },
    {
      "id": "gw89w6g",
      "author": "awesomeblosom",
      "body": "That's literally the exact point I'm making, though. \" Someone in Recovery could finish a meal, crave dessert, and decide not to eat it because they know they would feel bloated or sick eating more at that point. \" This is literally intuitive eating, and not restricting yourself because of a meal plan, because you want to feel good. That isn't not eating it because it's not part of the meal plan. It's not eating it because you don't want to because you know you won't feel good.",
      "created_utc": 1619649947.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        },
        {
          "id": "gw88ft6",
          "author": "awesomeblosom",
          "body": "I absolutely never stated that eating whatever whenever is recovery or inherently healthy, or that not caring about macros or calories is a requirement, either. I said the root of the unhealthy eating that you're describing has not been addressed.   \n\n\nI also absolutely never stated that people can't eat healthily and have meal plans. In fact I stated that even though it's restriction, there are times it is healthiest for people.   \n\n\nPlease don't put words in my mouth again.   \n\n\nIf you are restricting yourself from eating what you want to eat, that is literally restriction. I agree that there are times that it is appropriate and healthy to restrict what you eat, but that's the literal definition of the word.  \n\n\nRecovery is in some ways being able to eat what you want, but so much more, like learning to \\*want\\* to eat healthy and be healthy, how to listen to our bodies, to want to fill them with nutrients, to crave vegetables and fresh things that make our bodies *feel* good so that we feel good and are healthy. This work / journey isn't happening if I am thinking about how I want to be eating the thing that I can't have, because I'm restricting myself from it by being on a meal plan. I'm not building that healthy relationship with food, so the eating disorder is still there, just masked. People can eat healthily with masked eating disorders for long periods of time. And like I said, this is a perfectly valid place to be, and is part of a lot of people's journey's towards recovery and that's great that it helps people. It is still restricting.",
          "created_utc": 1619649257.0
        },
        {
          "id": "gw89dah",
          "author": "Janawa",
          "body": "\"Someone on a meal plan so they don't binge is not recovered\".  Which is untrue.  \"If you are restricting yourself from eating what you want to eat, that is literally restriction.\"  It might be literal restriction, but does not mean that they are anorexic or not recovered.  Someone who is recovered but says no to a food craving every now and then is still recovered.  Someone who is recovered and follows a meal plan to make sure they hit their caloric and nutrient needs, is still recovered.  Someone who is regularly eating at or above their caloric and nutritional needs every day is recovered.  It doesn't matter if they follow a meal plan, if they are working with a nutritionist to know what to eat or what their caloric and nutritional needs are, or if they eat smaller portions than Someone else, they are still recovered.  They are recovered even if they still feel anxiety once in a blue moon over a certain meal.  They are recovered even if they deny themselves a certain sweet treat every now and then, because these are things healthy people do, that people with eating disorders do to the *extreme*.  \n\n\"[Recovery] isn't happening if I am thinking about the thing I want to have but am not letting myself eat it.\" Yes, it is, and you can be recovered and still crave a food, and think \"I should not eat that right now.\"  For example, Someone in Recovery could finish a meal, crave dessert, and decide not to eat it because they know they would feel bloated or sick eating more at that point.  The difference between casual or occasion restriction and restricting in the form of an eating disorder is the frequency.  If they always restrict that food, if they never eat it because they are scared of it, that is unhealthy.  If they allow themselves to eat it, but decide occasionally it isn't the right thing to have right now, that is not unhealthy.",
          "created_utc": 1619649698.0
        }
      ]
    },
    {
      "id": "gw8af5i",
      "author": "awesomeblosom",
      "body": ">I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered.\n\nAlso \\^ this was my original point. I am not saying that everyone on a meal plan is on a meal plan so they don't binge. I'm talking about the people who *are* on a meal plan so they don't binge.",
      "created_utc": 1619650200.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        },
        {
          "id": "gw88ft6",
          "author": "awesomeblosom",
          "body": "I absolutely never stated that eating whatever whenever is recovery or inherently healthy, or that not caring about macros or calories is a requirement, either. I said the root of the unhealthy eating that you're describing has not been addressed.   \n\n\nI also absolutely never stated that people can't eat healthily and have meal plans. In fact I stated that even though it's restriction, there are times it is healthiest for people.   \n\n\nPlease don't put words in my mouth again.   \n\n\nIf you are restricting yourself from eating what you want to eat, that is literally restriction. I agree that there are times that it is appropriate and healthy to restrict what you eat, but that's the literal definition of the word.  \n\n\nRecovery is in some ways being able to eat what you want, but so much more, like learning to \\*want\\* to eat healthy and be healthy, how to listen to our bodies, to want to fill them with nutrients, to crave vegetables and fresh things that make our bodies *feel* good so that we feel good and are healthy. This work / journey isn't happening if I am thinking about how I want to be eating the thing that I can't have, because I'm restricting myself from it by being on a meal plan. I'm not building that healthy relationship with food, so the eating disorder is still there, just masked. People can eat healthily with masked eating disorders for long periods of time. And like I said, this is a perfectly valid place to be, and is part of a lot of people's journey's towards recovery and that's great that it helps people. It is still restricting.",
          "created_utc": 1619649257.0
        },
        {
          "id": "gw89dah",
          "author": "Janawa",
          "body": "\"Someone on a meal plan so they don't binge is not recovered\".  Which is untrue.  \"If you are restricting yourself from eating what you want to eat, that is literally restriction.\"  It might be literal restriction, but does not mean that they are anorexic or not recovered.  Someone who is recovered but says no to a food craving every now and then is still recovered.  Someone who is recovered and follows a meal plan to make sure they hit their caloric and nutrient needs, is still recovered.  Someone who is regularly eating at or above their caloric and nutritional needs every day is recovered.  It doesn't matter if they follow a meal plan, if they are working with a nutritionist to know what to eat or what their caloric and nutritional needs are, or if they eat smaller portions than Someone else, they are still recovered.  They are recovered even if they still feel anxiety once in a blue moon over a certain meal.  They are recovered even if they deny themselves a certain sweet treat every now and then, because these are things healthy people do, that people with eating disorders do to the *extreme*.  \n\n\"[Recovery] isn't happening if I am thinking about the thing I want to have but am not letting myself eat it.\" Yes, it is, and you can be recovered and still crave a food, and think \"I should not eat that right now.\"  For example, Someone in Recovery could finish a meal, crave dessert, and decide not to eat it because they know they would feel bloated or sick eating more at that point.  The difference between casual or occasion restriction and restricting in the form of an eating disorder is the frequency.  If they always restrict that food, if they never eat it because they are scared of it, that is unhealthy.  If they allow themselves to eat it, but decide occasionally it isn't the right thing to have right now, that is not unhealthy.",
          "created_utc": 1619649698.0
        }
      ]
    },
    {
      "id": "gw9wjp7",
      "author": "internerderner2",
      "body": "> Eating \"whatever whenever\" can cause or be binge eating.\n\nWell, speaking of things that scare people away from recocery...this definitely does.",
      "created_utc": 1619685243.0,
      "score": 2,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw7z2mv",
          "author": "Sareeee48",
          "body": "BED is driven by emotions, not the food itself. Eating freely/intuitively is also a growing treatment plan for BED. Learning to trust your body also means to know when to stop eating (which those with BED ignore as an unhealthy emotional response—it’s not that food itself prevents them from not being able to stop). Not to say meal plans might not be helpful in some way for BED, but they don’t target the psychological aspect of the disorder.",
          "created_utc": 1619644968.0
        },
        {
          "id": "gw83u58",
          "author": "Janawa",
          "body": "BED can be driven or a symptom of a deeper emotional disorder, but it is literally defined as a consumption of unusually large amount of food in one sitting.  There is more than one cause for BED.  When I was diagnosed with BED, it was not tied to an underlying emotional problem.  It was literally an addiction to food caused by trying to intuitively eat without any professional support after starving myself for two years at that point.",
          "created_utc": 1619647098.0
        },
        {
          "id": "gw8aiiw",
          "author": "Sareeee48",
          "body": "It’s defined as a *psychiatric disorder*. Feeding and eating disorders are not about food alone, which is why they’re recognized as psychiatric disorders. People typically develop them as a way of dealing with a deeper issue or another psychological condition, such as anxiety or depression.\n\nAgain, it’s not about the food. It is a psychiatric disorder for a reason. Telling people that it’s not healthy to eat what they want when they want (as long as it makes them feel good) as unhealthy is harmful af.",
          "created_utc": 1619650244.0
        },
        {
          "id": "gw8bdhi",
          "author": "Janawa",
          "body": "Yes, and there can be deeper emotions tied to it.  But, this *psychiatric disorder* can also be defined as an *addiction*, and an *addiction* does not strictly need to have a specific emotion or other mental disorder tied to it.  As I stated, in my case I was addicted to food, but I didnt eat it because I was sad, or depressed, or bored, or anxious.  I ate it because I was hungry, because I had been starving myself.  I went beyond intuitive eating, and ate until I was bloated, because I could not stop myself.  I did not target my depression, anxiety, or any other disorder when I stopped binging.\n\nIt absolutely can be unhealthy to eat whatever you want whenever.  It was unhealthy for me.  Eating whatever I had a craving for whenever I wanted led to me gaining weight rapidly.  I was constantly bloated to the point my stomach was hard and distended, so much that people would question if I was pregnant.  I was constantly in physical and emotional pain.  I would eat because I couldn't stop myself, and then hate myself for it and cut later at night because I was upset that I was gaining weight uncontrollably.  Eating whatever whenever or trying to learn to intuitively eat without support, or guidance, absolutely can lead you to the other side of the spectrum, which is over Eating and binge eating, and is harmful to your body and mind.",
          "created_utc": 1619650656.0
        },
        {
          "id": "gw8kak3",
          "author": "Sareeee48",
          "body": "“I was constantly in physical and emotional pain. . . and cut later at night because I was upset.” You *just* said there were no underlying psychological reasons, but those sound like underlying psychological reasons.\n\nI can get behind eating disorders having an addictive aspect to it, we know that’s true due to science. But we *also* know that developing binge eating disorder after a restrictive eating disorder is extreme uncommon, and impossible to have at concurrently. It is harmful to say that people shouldn’t attempt to practice intuitive eating after a restrictive eating disorder because *some* people might develop BED. *that* scares people from recovery, especially people who don’t have the luxury to afford a professional in IE.",
          "created_utc": 1619654975.0
        },
        {
          "id": "gw8kg47",
          "author": "Janawa",
          "body": "Those are not causes of my binging.  Those were the emotional turmoil caused by binging.  It did not encourage the binging.  I never said they shouldn't attempt intuitive eating. I said they should seek support, especially professional support, when doing it.  And it is NOT uncommon for peoples disordered eating to change.  Most people with eating disorders experience symptoms of other disorders, and they change over time.  I am NOT claiming that recovery causes BED.  I am saying misinformation about what recovery entails can lead to symptoms of it, though.  Eating \"whatever whenever\" can cause or be binge eating.  Intuitive eating, and knowing to stop before you get sick, is not.",
          "created_utc": 1619655050.0
        }
      ]
    },
    {
      "id": "gw8b0fv",
      "author": "Janawa",
      "body": "And I am just saying that someone could be on a meal plan, have small portions, and still be recovered as long as they are meeting their nutritional and caloric needs, and are not scared or anxious to eat certain foods.  You can be on a meal plan and still have a snack or food outside of the meal plan.  I was never suggesting that people on a meal plan who are recovered have to follow the meal plan exactly.  If they are scared to eat anything outside of the meal plan, I would agree that would not be a recovered mindset.  The goal is to not be anxious about eating or consuming any food, and you can be that way with a meal plan.  So I believe we do agree, and I misunderstood your original comment.  I should have elaborated, as I did here, that a meal plan does not necessarily mean you only eat the meal plan and never eat anything over it.  I see a meal plan as a \"minimum\" and that it is perfectly fine to eat outside of planned meal times, as long as you are not at a threat of refeeding syndrome.",
      "created_utc": 1619650484.0,
      "score": 1,
      "context": [
        {
          "id": "gw6pydu",
          "author": "None",
          "body": "I agree. To me, \"not restricting\" is letting myself eat what I want and however much I want. I'm still struggling right now but I know that restricting in any way can just make things a lot worse for me. Plus I know that I need to eat. So whatever and whenever I can get myself to eat, I will. It doesn't have to be a \"healthy diet.\" I just need to eat. And I'm really trying to stop worrying about it.",
          "created_utc": 1619626086.0
        },
        {
          "id": "gw6sqqy",
          "author": "Janawa",
          "body": "But implying that this is how recovery is for everyone is damaging, as it scares people away from recovery.  People who have struggled with BED and used anorexia to get away from that will be terrified of eating whatever and whenever, and would rather follow a meal plan or a healthy diet that a professional helped them make, so they know they're eating enough without fearing that it's a \"binge\".",
          "created_utc": 1619627246.0
        },
        {
          "id": "gw70ds1",
          "author": "internerderner2",
          "body": "I'd just like to point out though that what you say might be true, but at the same time being terrified of something doesn't make it any less of a reality.\n\nI never had BED and I'm also terrified of eating \"whatever and whenever\" (I mean, pretty much any ED sufferer is), but I also know that that's what \"stopping restricting\" would mean for me, at least in the short term.\n\nObviously everyone should do recovery as they feel most comfortable, I don't think the two things necessarily contradict each other. Actually I think a common therapy approach is to let people gradually ease restrictions starting with the smaller ones.",
          "created_utc": 1619630402.0
        },
        {
          "id": "gw79d9d",
          "author": "Janawa",
          "body": "Being terrified of something does not make it any less reality, but it being reality doesn't mean it's the right course of action.  Binging or eating anything anytime you want it may work for you, but isn't everyone's recovery.  Thats how I tried to self recover, just eating anything I had a craving for.  I ended up with lots of half eaten food packages, lots of money spent on food, and gaining 50 pounds over three months because I was eating over 4000 calories a day.  Things like this are not only harmful mentally, but also physically.  Refeeding syndrome, bloating, swelling stomachs, constipation, diahreea, are all realities if you just eat any food you crave without considering the nutrients your body needs and the things that will be easier on your stomach after restricting.  Following this course of \"self recovery\" led me into BED, which led me to begin purging and eventually relapsing harder into restriction than before I started trying to \"recover\" in the first place.  \n\nMy advice is this; I only chose to comment on this post because you seem judgeful of people posting their recovery stories and meal plans on instagram because it doesn't align with your own.  That is what I found harmful.  Someone who has smaller portioned meal plans is someone who isn't restricting, if they are following a plan set by their doctor it is whats best for their recovery journey and should not be judged.  We should not be judging each other for how much or little one another eats during recovery, we should just be encouraging that we chose the path to recovery in the first place.  If you find people with smaller portioned meal plans triggering to you, you should stop following those people and tags on social media.",
          "created_utc": 1619634137.0
        },
        {
          "id": "gw7sdzj",
          "author": "awesomeblosom",
          "body": "I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered. There may be instances in which restriction is healthiest for the person, between them and their doctor, but if somebody is restricting themselves to only eating a certain amount per day through a meal plan...... that's restriction. It's fine to be at that point in your recovery, it's not fine to share that and say \"I'm recovered.\" The root of the unhealthy relationship with food has not been addressed.",
          "created_utc": 1619642128.0
        },
        {
          "id": "gw7ywgx",
          "author": "Janawa",
          "body": "It is not restriction to follow a meal plan, plan meals, or have nutritional goals.  It is not considered recovery only when you eat whatever whenever.  People can eat healthily and have meal plans.  This is ridiculous to say.  It's as if youre saying that you are only \"recovered\" if you eat whatever, whenever, and only if you don't care at all what macros or calories you digest.  This is also unhealthy eating and should not be encouraged.  There's two sides to the spectrum, finding a healthy middle is the balance and recovery.",
          "created_utc": 1619644893.0
        },
        {
          "id": "gw88ft6",
          "author": "awesomeblosom",
          "body": "I absolutely never stated that eating whatever whenever is recovery or inherently healthy, or that not caring about macros or calories is a requirement, either. I said the root of the unhealthy eating that you're describing has not been addressed.   \n\n\nI also absolutely never stated that people can't eat healthily and have meal plans. In fact I stated that even though it's restriction, there are times it is healthiest for people.   \n\n\nPlease don't put words in my mouth again.   \n\n\nIf you are restricting yourself from eating what you want to eat, that is literally restriction. I agree that there are times that it is appropriate and healthy to restrict what you eat, but that's the literal definition of the word.  \n\n\nRecovery is in some ways being able to eat what you want, but so much more, like learning to \\*want\\* to eat healthy and be healthy, how to listen to our bodies, to want to fill them with nutrients, to crave vegetables and fresh things that make our bodies *feel* good so that we feel good and are healthy. This work / journey isn't happening if I am thinking about how I want to be eating the thing that I can't have, because I'm restricting myself from it by being on a meal plan. I'm not building that healthy relationship with food, so the eating disorder is still there, just masked. People can eat healthily with masked eating disorders for long periods of time. And like I said, this is a perfectly valid place to be, and is part of a lot of people's journey's towards recovery and that's great that it helps people. It is still restricting.",
          "created_utc": 1619649257.0
        },
        {
          "id": "gw89dah",
          "author": "Janawa",
          "body": "\"Someone on a meal plan so they don't binge is not recovered\".  Which is untrue.  \"If you are restricting yourself from eating what you want to eat, that is literally restriction.\"  It might be literal restriction, but does not mean that they are anorexic or not recovered.  Someone who is recovered but says no to a food craving every now and then is still recovered.  Someone who is recovered and follows a meal plan to make sure they hit their caloric and nutrient needs, is still recovered.  Someone who is regularly eating at or above their caloric and nutritional needs every day is recovered.  It doesn't matter if they follow a meal plan, if they are working with a nutritionist to know what to eat or what their caloric and nutritional needs are, or if they eat smaller portions than Someone else, they are still recovered.  They are recovered even if they still feel anxiety once in a blue moon over a certain meal.  They are recovered even if they deny themselves a certain sweet treat every now and then, because these are things healthy people do, that people with eating disorders do to the *extreme*.  \n\n\"[Recovery] isn't happening if I am thinking about the thing I want to have but am not letting myself eat it.\" Yes, it is, and you can be recovered and still crave a food, and think \"I should not eat that right now.\"  For example, Someone in Recovery could finish a meal, crave dessert, and decide not to eat it because they know they would feel bloated or sick eating more at that point.  The difference between casual or occasion restriction and restricting in the form of an eating disorder is the frequency.  If they always restrict that food, if they never eat it because they are scared of it, that is unhealthy.  If they allow themselves to eat it, but decide occasionally it isn't the right thing to have right now, that is not unhealthy.",
          "created_utc": 1619649698.0
        },
        {
          "id": "gw8af5i",
          "author": "awesomeblosom",
          "body": ">I would strongly argue that somebody on a meal plan with their doctor so they don't binge, may be on the path towards recovery, but is not recovered.\n\nAlso \\^ this was my original point. I am not saying that everyone on a meal plan is on a meal plan so they don't binge. I'm talking about the people who *are* on a meal plan so they don't binge.",
          "created_utc": 1619650200.0
        }
      ]
    }
  ]
}