{
  "id": "n3408t",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1619953089.0,
  "title": "fuck this. I'm not even underweight or \"sick enough\" according to my own brain but I'm recovering",
  "selftext": "I'm a teenage boy holy fuck. I shouldn't be thinking about the calories in everything I eat or \"saving\" calories for dinner because I'm only \"allowed\" to eat 1200 or below. I shouldn't fucking dream about eating a pint of halotop icecream, and my hair shouldn't be thinning. Honestly this has been coming for a while, I've been slowly increasing the amount of calories I \"allow\" myself to have, solely bc the chest pain got, very concerning and I really didn't want to die just yet, but this is the first week I'm going to eat three meals a day with snacks, weight or reflection be damned, I deserve to eat enough to grow and to not slowly starve and I hate that it took me this long to realise that but, thank fuck I did at all.  \n\n\nALSO    \n\n\nFUCK my brain for ever thinking I have to eat \"only as much\" as my bf does. He struggles with an ED too and i REFUSE to let my behaviour impact him negatively any more than it already has.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/n3408t/fuck_this_im_not_even_underweight_or_sick_enough/",
  "score": 144,
  "num_comments": 3,
  "comments": [
    {
      "id": "gwnohva",
      "author": "amerynpeters",
      "body": "YES BITCH YES YOU FUCKING DO!! YOU FUCKING DESERVE EVERYTHING YOU MENTION HERE AND MORE!!! YOU DESERVE NOT TO SPEND EVERY WAKING SECOND THINKING ABOUT FOOD AND YOUR BODY AND YOUR WEIGHT!!! AND SO DOES YOUR BOYFRIEND!!! I HOPE YOU GUYS CAN HELP EACH OTHER THROUGH RECOVER BECAUSE _FUCK EATING DISORDERS!!!!!!_",
      "created_utc": 1619960727.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gwpqw99",
      "author": "ginajadesmith",
      "body": "YES, you've got this. Fuck the ED, how dare it ruin your life. Challenge this illness and see your happiness grow!",
      "created_utc": 1619992739.0,
      "score": 7,
      "context": []
    }
  ]
}