{
  "id": "n3sy68",
  "subreddit": "fuckeatingdisorders",
  "author": "J_LGD",
  "created_utc": 1620038339.0,
  "title": "I deleted my thinspo folder on my computer",
  "selftext": "I'm ten months in recovery. And up until now, the thinspo folder's just been looming in the background, covered up by other files, ignored. Up until now, I couldn't get myself to let go of it. But I looked through all the photos in there (being the obsessive person I am), all the pictures of people with stick thighs, concave stomachs, and skeletal fingers; the pictures of \"diets\", and workouts, and tips, and all I felt was that I had no desire to be that, there was nothing in me that was attracted to that. Why on earth would I want to eat the prescribed >!200!< calories a day? That sounds thoroughly miserable. Why would I want to look flat as a piece of cardboard? I wondered how many of the people in those pictures had died, and how many are still trapped in their ED today. I looked through the (probably 100-ish) pictures of skinny people, and absolutely no part of me wanted to look like that. With some of them, if you looked closely enough, you could see how flabby they were, how restriction had eaten away at their muscles. All I felt was pity at how miserably obsessive their daily lives must have been. \n\nAfterwards, I ate a very nice, probably very calorie-dense cookie and some full-fat milk, and I massaged my stomach and thighs (my two \"problem areas\" that I'm learning to love), and I felt grateful for them. I felt the muscle that had just started coming back, a sign that my body was returning to the way it used to be before my eating disorder. My stomach pokes out a little, especially with all the bloating. I can't wrap my hands around my thighs. But those parts of me are signs that I am happy and healthy, that I can eat freely without restriction, that my life isn't controlled by rules and obsessions and numbers. If being chubby means freedom, that's a tradeoff I'll take any day of the week.  I'm more confident now than I ever was at my thinnest. I'm experimenting more with fashion and self-expression. Nothing about the ED life appeals to me anymore. I don't need to be skinny to feel comfortable in my body, and I wouldn't want to be skinny anyways.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/n3sy68/i_deleted_my_thinspo_folder_on_my_computer/",
  "score": 208,
  "num_comments": 7,
  "comments": [
    {
      "id": "gwrxrf7",
      "author": "sirvulva",
      "body": "congrats!",
      "created_utc": 1620045383.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gwtdatm",
      "author": "lmkast",
      "body": "That’s really inspiring. I’m 5 months into recovery and am still really struggling with learning to love my body. My stomach and thighs are my problem areas too and I’m trying so hard to not think they’re shit. I still have my thinspo folder on my laptop but I think this made me want to delete it. Thank you so much for sharing.",
      "created_utc": 1620067994.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gwtofpl",
      "author": "PinkieePie_",
      "body": "Yes! This is amazing progress, well done!",
      "created_utc": 1620072813.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwu9j07",
      "author": "barbiebruise",
      "body": "go you!",
      "created_utc": 1620082319.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwvbjao",
      "author": "standsure",
      "body": "If being chubby means freedom, that's a tradeoff I'll take any day of the week.\n\n\nGo Team!!",
      "created_utc": 1620101618.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwvdlmz",
      "author": "J_LGD",
      "body": "love your username! and thanks!",
      "created_utc": 1620102934.0,
      "score": 3,
      "context": [
        {
          "id": "gwrxrf7",
          "author": "sirvulva",
          "body": "congrats!",
          "created_utc": 1620045383.0
        }
      ]
    },
    {
      "id": "gwvi27k",
      "author": "J_LGD",
      "body": "It took me a really long time not to think my thighs and stomach were shit, too. I think part of it was that my body only just finished changing maybe a month ago, so it’s hard to get used to something that’s not constant. Another thing for me was trying to look through the dysmorphia and see my body objectively. It’s not inherently good or bad, it just _is_. I also had to get used to the idea that my body does not define my worth, or my attractiveness. The bodies that we see on social media, in porn, and the media in general are not the limits of what can be seen as attractive. I also had to think in terms of trade offs. What am I willing to sacrifice to be skinny? The ability to eat freely and enjoy food? A social life? Hobbies? A personality in general? Freedom? Happiness? The list goes on and on. I’ve just come to accept that this is the way that my body is and unless I relapse, I have to live with what I’ve got. Sorry if this is mildly incoherent and poorly formatted, but I hope this helps.",
      "created_utc": 1620106024.0,
      "score": 2,
      "context": [
        {
          "id": "gwtdatm",
          "author": "lmkast",
          "body": "That’s really inspiring. I’m 5 months into recovery and am still really struggling with learning to love my body. My stomach and thighs are my problem areas too and I’m trying so hard to not think they’re shit. I still have my thinspo folder on my laptop but I think this made me want to delete it. Thank you so much for sharing.",
          "created_utc": 1620067994.0
        }
      ]
    }
  ]
}