{
  "id": "n5hw41",
  "subreddit": "fuckeatingdisorders",
  "author": "cerealisreallygood",
  "created_utc": 1620226717.0,
  "title": "It's recovery or death, and I'm choosing fucking life.",
  "selftext": "My mom told me yesterday she will no longer pay any of my healthcare. So if I was to drop off again, I wouldn't have any help. I don't have insurance now, can't see a therapist or dietician anymore without paying out of pocket. My ED is screaming to really throw in the towel, but instead I'm using this as fuel to really become a better me by myself, for myself. \n\nI'm basically homeless right now, I stay with my grandma after leaving treatment AMA. I'm almodt 21 and I feel like such a loser. I feel like a stranger here, and everywhere. Haven't slept in my own bed in months. Instead of using this to break me further, I'm using this to find my purpose. \n\nI sold my shitty car, bought an SUV, and I plan on taking a road trip, living out of it for minimum a week in a few weeks. I've wanted to do this for ages and it's finally a possibility, albeit my ED. I won't have access to make all my safe foods, be so rigid, and it's exactly what I feel I need. To learn how to eat to survive instead of please my ED. To really find my roots and beliefs outside of what this disorder has brainwashed me to believe I want. To be okay with the bare minimum because I hate this health addicted-trying to be perfect mold I've shrunk myself into. I realized how comfortable I was living in groundhog day, doing, eating, living the same boring life everyday and finally I've hit my breaking point. It's not what I want for my life. \n\nI'm still struggling, but mentally I'm the free-st I've been in so so long. I feel like I'm taking my life back, for me, and not for anyone else or my stupid ed. If I can do this, I can break the chains I feel like are wrapped around me. \n\nClaim your life back. Do what feels authentic to you, and I promise your ed will start to shrink even a tiny bit. \"Show em who's boss\" so to say. \n\nAlso, share your favorite roadtrip snacks. The ones you got as a kid, or what you'd get if your ed was never present at all. I'm sure I might get around to some of em along the way. :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/n5hw41/its_recovery_or_death_and_im_choosing_fucking_life/",
  "score": 108,
  "num_comments": 17,
  "comments": [
    {
      "id": "gx1e7t8",
      "author": "tinylil",
      "body": "Nothing beats an Arizona iced tea on a road trip. When I was a kid my parents would grab me one from the gas station. \n\nAlso if you stop at any local delis or cafes, ask the person working what their favorite thing is and then try that - it gets you out of your comfort zone and sometimes the thing is really good! \n\nGlad you’re doing this. Good luck 💘",
      "created_utc": 1620229632.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gx1hda7",
      "author": "justsomenobody2",
      "body": "A real adventure! I'm so happy for you. \n\nI loved trail mix and chex mix with a nice big fountain soda, usually ginger ale.",
      "created_utc": 1620230916.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gx1skmy",
      "author": "cat0verlord",
      "body": "You are doing exactly what I want to do. I've been looking at vans/ trailers for 2 weeks straight and am planning on going full-time nomad in less than 6 months. We. Got. This. It's going to be so fucking hard but worth it, I promise. \n\nMy favorite road trip snacks are gardetto's ❤",
      "created_utc": 1620235461.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gx1p1ro",
      "author": "oogiebuns",
      "body": "That’s wonderful, friend! That takes a lot of strength to do. Might not be for everyone but I love white chocolate covered dried fruit.",
      "created_utc": 1620234013.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gx1y1qc",
      "author": "Caroline_Directioner",
      "body": "That’s great advice and I wish you the best!!! my favorite road trip snack is probably a kinder bueno or trail mix with chocolate, dried fruit, cashews, and pretzels",
      "created_utc": 1620237767.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gx19l6d",
      "author": "sid_recovering",
      "body": "that’s amazing!! congrats on your recovery and good luck ❤️",
      "created_utc": 1620227737.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gx2te5v",
      "author": "lcords13",
      "body": "We use to buy bags of m&ms and you put them in your front window so the sun melts the chocolate but not the outside so when you bit them it’s melted chocolate. Haven’t had them in forever but they were like magical to a younger me",
      "created_utc": 1620250989.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gx1shby",
      "author": "None",
      "body": "Trail mix!!",
      "created_utc": 1620235423.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx3a6wl",
      "author": "fuuwuu",
      "body": "stay safe op!! and enjoy your freedom! I hope you find a comfortable balance of adventure and stability in your life. \n\nAs for snacks, you gotta go with classic trail mix, but I’m partial to hot Cheetos and gummi worms as well. Throw in a tall can of Arizona green tea and you’re set 👌",
      "created_utc": 1620258805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx3gcj7",
      "author": "caffeinegrl",
      "body": "yogurt pretzels & iced coffee :) have fun and be safe!",
      "created_utc": 1620261799.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gx3mdpc",
      "author": "uhhhhhhhbro",
      "body": "I loved getting lemon lays and hot cheeto puffs when I was younger and going on a road trip!",
      "created_utc": 1620264794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx6xq5r",
      "author": "Internet_Soup",
      "body": "DUDE IM SO FRIGGIN PROUD OF YOU! I’m 22 and decided to get help last year; best decision ever! I still struggle but it’s part of the process. I want nothing but happiness and healthy for you. Do what you love and have no regrets. If you ever need someone to talk or just listen while you rant. I got you. Much love 💕",
      "created_utc": 1620332226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxhikqq",
      "author": "Silver_Oakleaf",
      "body": "This was so inspiring to read! Gotta say, drywoers (South African marinated dried sausage) is without doubt my fav road trip snack - brings back wonderful memories of trips with friends",
      "created_utc": 1620558207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx2d4kr",
      "author": "cerealisreallygood",
      "body": "As a kid I FUCKED up the honey nut chex mix oh myyyy",
      "created_utc": 1620244146.0,
      "score": 4,
      "context": [
        {
          "id": "gx1hda7",
          "author": "justsomenobody2",
          "body": "A real adventure! I'm so happy for you. \n\nI loved trail mix and chex mix with a nice big fountain soda, usually ginger ale.",
          "created_utc": 1620230916.0
        }
      ]
    },
    {
      "id": "gx3ic0w",
      "author": "meowmehungry",
      "body": "Trail mix is love!",
      "created_utc": 1620262789.0,
      "score": 2,
      "context": [
        {
          "id": "gx1hda7",
          "author": "justsomenobody2",
          "body": "A real adventure! I'm so happy for you. \n\nI loved trail mix and chex mix with a nice big fountain soda, usually ginger ale.",
          "created_utc": 1620230916.0
        }
      ]
    },
    {
      "id": "gx2def7",
      "author": "cerealisreallygood",
      "body": "I'm glad there's another aspiring nomad in this group, I plan on half ass converting my Honda CRV to fit some sort of bed and basic necessities, preparing myself mentally and physically, and giving it my first go. I'm planning on going to Denver and exploring and seeing a show at red rocks and I'm so pumped although nervous as hell I'm so ready. We got this shit 💕",
      "created_utc": 1620244257.0,
      "score": 3,
      "context": [
        {
          "id": "gx1skmy",
          "author": "cat0verlord",
          "body": "You are doing exactly what I want to do. I've been looking at vans/ trailers for 2 weeks straight and am planning on going full-time nomad in less than 6 months. We. Got. This. It's going to be so fucking hard but worth it, I promise. \n\nMy favorite road trip snacks are gardetto's ❤",
          "created_utc": 1620235461.0
        }
      ]
    },
    {
      "id": "gx2h3qt",
      "author": "pabstpumpkinbeer",
      "body": "Omg I loooved the cheerio snack mix as a kid... was so mad when they discontinued it in Canada. You also can't buy chex mix here! Bullshittt",
      "created_utc": 1620245816.0,
      "score": 4,
      "context": [
        {
          "id": "gx1hda7",
          "author": "justsomenobody2",
          "body": "A real adventure! I'm so happy for you. \n\nI loved trail mix and chex mix with a nice big fountain soda, usually ginger ale.",
          "created_utc": 1620230916.0
        },
        {
          "id": "gx2d4kr",
          "author": "cerealisreallygood",
          "body": "As a kid I FUCKED up the honey nut chex mix oh myyyy",
          "created_utc": 1620244146.0
        }
      ]
    }
  ]
}