{
  "id": "nasqd8",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1620836593.0,
  "title": "Whenever someone says they haven't eaten in x amount of time",
  "selftext": "It really triggers me whenever someone says they haven't eaten in X amount of time. It doesn't matter if it's a disordered or non-disordered person saying it, or what their reason is. Sometimes non-disordered people are like \"Omg I'm so busy, I forgot to eat! I haven't eaten all day!\" or maybe their reason for not eating is more intentional like \"I'm doing this water fast and I haven't eaten in x amount of hours/days.\" Other times it's a person with an ED being like \"I haven't eaten in x days/weeks.\" Both of these are so triggering to me, I almost feel jealous when people say shit like this, even though I know I shouldn't. Even when my ED was at its worst, I never went a full day without eating, let alone multiple days or weeks. It makes me feel like my ED wasn't real or valid, and also I beat myself up for not having the \"discipline\" for being able to go for that long without food.\n\nI guess this kind of goes without saying, but on a somewhat related note, I also get triggered/jealous when someone says their weight and it's lower than mine, regardless of whether they have an ED or not. It's like, if they have an ED and their weight is that low, I feel like they're \"better at\" their ED than me. If they don't have an ED and they're just \"naturally skinny\" then I envy them for being able to maintain that weight without even trying, yet I still feel like maybe they just intrinsically have more discipline/self-control than me. \n\nI'm supposedly \"in recovery\" now (it's been rough tho), and idk how to NOT get triggered by this stuff... idk if I'm looking for advice or just wanted to rant, but if you have any advice that \\*actually\\* works, feel free to share",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nasqd8/whenever_someone_says_they_havent_eaten_in_x/",
  "score": 108,
  "num_comments": 11,
  "comments": [
    {
      "id": "gxw32f8",
      "author": "natts13",
      "body": "I don't have any advice but I just wanted to say that I completely relate to everything you wrote and that your feelings are valid. Hang in there.",
      "created_utc": 1620847761.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gxw62vs",
      "author": "pistachiopanda2",
      "body": "I totally feel the same. I got lunch with a friend recently and when we sat down she goes “omg I’m so hungry, I haven’t eaten anything today yet” and I had already eaten breakfast and I immediately started spiraling and panicking that I didn’t “deserve” to eat lunch and was mad that I was eating more than her. People don’t realize how harmful those comments can be.",
      "created_utc": 1620848990.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gxw8uto",
      "author": "Halaros",
      "body": "Very relatable... Especially considering I eat four meals a day... My mind just counts down till my next meal, and I feel like I cannot possibly have an ED when I eat that often.",
      "created_utc": 1620850120.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gxyqwhg",
      "author": "MaryContrary26",
      "body": "When someone healthy who has not been restricting long term misses a meal or two, that's very different from someone  who's  just barely hanging on trying to do it. Your body probably needs every calorie it gets. Theirs doesn't. Also, I found a lot of the hyper focus on other people's bodies and eating habits, the frustration, the anger, all of it was related to hunger. When I wasn't hungry anymore, my whole focus shifted. My world was very small when I was in my ED. If you're feeling attached to the idea of self discipline ask yourself if you have enough to recover because at this point it would probably take more discipline to eat consistently than to restrict.",
      "created_utc": 1620904369.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gxwgpdv",
      "author": "None",
      "body": "Keep in mind that many people lie or exaggerate things like weight and what they eat in our fat-phobic culture.",
      "created_utc": 1620853377.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gxy1z6c",
      "author": "kianathebutt",
      "body": "i never understood how anyone could \"forget\" to eat all day. I'm not even functional if I don't have breakfast",
      "created_utc": 1620882644.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gxxfibm",
      "author": "MmmAioli",
      "body": "This is beyond relatable. Every word.",
      "created_utc": 1620869692.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gxywk77",
      "author": "None",
      "body": "i feel the same way about posts titled „after not having eaten for x days i finally had a meal“",
      "created_utc": 1620908131.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxywox9",
      "author": "natts13",
      "body": "I’ve never thought of the self discipline thing that way...thank you.",
      "created_utc": 1620908209.0,
      "score": 5,
      "context": [
        {
          "id": "gxyqwhg",
          "author": "MaryContrary26",
          "body": "When someone healthy who has not been restricting long term misses a meal or two, that's very different from someone  who's  just barely hanging on trying to do it. Your body probably needs every calorie it gets. Theirs doesn't. Also, I found a lot of the hyper focus on other people's bodies and eating habits, the frustration, the anger, all of it was related to hunger. When I wasn't hungry anymore, my whole focus shifted. My world was very small when I was in my ED. If you're feeling attached to the idea of self discipline ask yourself if you have enough to recover because at this point it would probably take more discipline to eat consistently than to restrict.",
          "created_utc": 1620904369.0
        }
      ]
    },
    {
      "id": "gxxfut5",
      "author": "MmmAioli",
      "body": "So true! People rarely mean “nothing,” they just mean they’ve barely eaten but our version of barely or “nothing” is still less than theirs. For example, got coffee with a friend one morning and she ordered a latte and muffin and I had black coffee - later that afternoon we met another friend for lunch and she goes, “I’m starving I barely ate anything all day.” In her head she had coffee and a muffin (low, volume wise) but in my head I counted her calories and was like wait what...but that’s how the non ED brain works I guess. Kinda envy that LOL love that for her!",
      "created_utc": 1620869856.0,
      "score": 9,
      "context": [
        {
          "id": "gxwgpdv",
          "author": "None",
          "body": "Keep in mind that many people lie or exaggerate things like weight and what they eat in our fat-phobic culture.",
          "created_utc": 1620853377.0
        }
      ]
    },
    {
      "id": "gxz1jpr",
      "author": "MaryContrary26",
      "body": "Hope it helps!",
      "created_utc": 1620910947.0,
      "score": 3,
      "context": [
        {
          "id": "gxyqwhg",
          "author": "MaryContrary26",
          "body": "When someone healthy who has not been restricting long term misses a meal or two, that's very different from someone  who's  just barely hanging on trying to do it. Your body probably needs every calorie it gets. Theirs doesn't. Also, I found a lot of the hyper focus on other people's bodies and eating habits, the frustration, the anger, all of it was related to hunger. When I wasn't hungry anymore, my whole focus shifted. My world was very small when I was in my ED. If you're feeling attached to the idea of self discipline ask yourself if you have enough to recover because at this point it would probably take more discipline to eat consistently than to restrict.",
          "created_utc": 1620904369.0
        },
        {
          "id": "gxywox9",
          "author": "natts13",
          "body": "I’ve never thought of the self discipline thing that way...thank you.",
          "created_utc": 1620908209.0
        }
      ]
    }
  ]
}