{
  "id": "nccljb",
  "subreddit": "fuckeatingdisorders",
  "author": "edsarebs",
  "created_utc": 1621009451.0,
  "title": "furious over what I did to myself",
  "selftext": "TW: numbers\n\nBefore my ED, I truly did have a good relationship with food. I ate whatever I wanted, whenever I wanted. I ate milkshakes and ice cream sundaes and fried foods and cookies dunked in cider. Food was a source of joy. I overate sometimes but I never binged. I tried new foods all the time and never got the same thing twice. Every Friday I drank a grande frappuccino with whole milk or ate a chocolate croissant before school. But I stopped when I had enough. I went out to eat with friends, got what I wanted, and enjoyed it. I didn't care about how many calories I burned when I exercised. I ate more than most of my friends but I never cared.\n\nAnd guess what? Back then, I was only FIVE pounds heavier than I am now after quasi recovery. I work out almost every day, eat 95% healthy, and keep my meals much smaller than back then. And all that's separating me from before, when I maybe worked out twice a week and ate EVERYTHING i wanted, is five pounds.\n\nMy life was great before. I had lots of friends and felt good about myself. My Snapchat memories are filled with mirror selfies of me before that I really thought I looked great in when I took them. I used to post on Instagram every month, even if the pic was taken after I'd eaten or at the end of the day.\n\nMy body was fine. I was even at the lower end of a healthy BMI. I thought I looked good, and I probably did. I see pictures from back then, and my boobs look huge and I don't know why I did this to myself. \n\nEvery day is a struggle over 5 pounds. A tiny, tiny amount that literally no one cares about, except for me.\n\nI just can't believe I did this to myself. I want to believe that I can get back to my before, but I just don't know if that's possible.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nccljb/furious_over_what_i_did_to_myself/",
  "score": 128,
  "num_comments": 7,
  "comments": [
    {
      "id": "gy4z9u3",
      "author": "tears_of_an_angel_",
      "body": "why do I feel like I’m reading about myself? 😢😢😢 except I’m 10 lb heavier than I was when I ate whatever I wanted. I miss the days when I had a life, had a healthy relationship with food, and didn’t give it a second thought. I miss being too busy having fun with my friends, not stressing out every time we went out to eat, not planning my days around exercise. I hate how I screwed myself over. I hope both of us can get back to how we used to be 🥺",
      "created_utc": 1621021900.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gy5hhkt",
      "author": "flowerscatsandqs",
      "body": "This is exactly how I was. Albeit I did have some bingey tendencies, my relationship with food was largely healthy and normal. Then I decided I wanted to “trim down” a bit or “tone up”; nearly a year later I’m a wreck who can’t even look at a slice of bread without anxiety.",
      "created_utc": 1621030335.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gy5rp01",
      "author": "SoundSecret",
      "body": "I understand what you mean, completely, and I'm so sorry that you're hurting. You will get better, and you're so strong. I felt the same way for a long fucking time, and trust me, please, you can and will get out of this.",
      "created_utc": 1621035578.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy5llqp",
      "author": "awaythr0w444",
      "body": "I relate to this so much, best of luck on your recovery I know how hard it is :,)",
      "created_utc": 1621032400.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy61zc9",
      "author": "verysadvanilla",
      "body": "me too :( I ate whatever I wanted whenever, loved free food, tried new things, went out to eat with friends without a second thought etc. the difference between that me and now is insecurity and 5 lbs less :/",
      "created_utc": 1621041288.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy621kd",
      "author": "verysadvanilla",
      "body": "I believe that you will be able to achieve a healthy relationship with food again though <3",
      "created_utc": 1621041323.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy6rwx6",
      "author": "cardigan_bee",
      "body": "This is where I’m at now too and I feel so mad at myself. People don’t realise that EDs don’t look a certain way. It can be a suppression of 5lbs that can send someone spiralling down this hell.\n\nI’ve committed to full recovery now and although I feel like I’m feel like I’m on the verge of a break down most times, I’m beginning to get hope that I can get back to the life I used to have before. Sending you so much love OP, we’re all here with you ❤️",
      "created_utc": 1621058367.0,
      "score": 3,
      "context": []
    }
  ]
}