{
  "id": "ncz0vq",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1621085707.0,
  "title": "14 months in recovery",
  "selftext": "***TW for calorie numbers***\n\nHaiiiiiiii, it’s me again. I’ve been meaning to make this post since my one year mark back in March, but I’ve just been so busy with... well, not being fucking sick for the first time in Y E A R S. And truthfully, I was unsure about how recovery had made me feel, not only physically but psychologically as well... but after January, I think I finally discovered myself again, and immersed myself in my creative endeavors all over again. It was as if I never fell out of it... but I digress.\n\nI’m going to go over my recovery month-by month, in detail, in hopes that it will be of some use to somebody in this sub. If you have any questions, feel free to ask!\n\n**Month 1:** I decided to recover the day my state went into lockdown. My extreme hunger kicked in *immediately*, which scared the shit out of me. I remember telling myself I would “allow” myself to eat, but only after I restricted for x amount of hours and only after I exercised... of course, I then found out gyms would remain closed for the foreseeable future (including my apartment’s sad excuse for a gym), and I was really forced to loosen my obsessive grip on exercise, which in turn convinced me to eat as well. It took me a few days, but I was able to throw myself into the throes of extreme hunger and eat according to my body’s needs. I ate every hour, as I’d feel physically ill and faint if I didn’t. I ate, and and, and then ate some more. Extreme hunger gave me no leniency during  the nighttime hours, either; I’d wake up every at least three times just to eat. Fuck, I remember counting up all of my calories once and I ate close to 11,000kcals in one day.\n\nI was constantly shoveling food into my mouth (particularly nutrient/caloric dense food—i.e., “processed junk food”), yet i was still hungry 30 minutes later. I suffered from gastroparisis long before recovery, so all that food just sat in my stomach for hours. I was so bloated that I looked as if I was in my third trimester of pregnancy. I immediately retained water, specifically in my hands, feet, legs, the entirety of my midsection, and my face. \n\nAround week 3, my emotions, which I’ve been numbing for literal *years*, were flipped back on. Everything made me cry; to my friend jokingly saying I hurt his feelings to my boyfriend’s tone shifting slightly. Everything f elt so overwhelming all the time.\n\nExtreme physical exhaustion basically forced me into hibernation, as I slept for 14 hours a day. The night sweats (aka, hypermetabolism) were so severe that I had to lay down a blanket underneath and use my own sheet to guarantee my partner’s side of the bed wouldn’t be soaked as well; everything I put into my body was immediately burned off because it just didn’t know what the fuck to do with it all. This stage was so miserable because I was constantly changing out of wet clothes and ensuring I ate more and more so I wouldn’t lose more weight. At this point, I have gained approximately 15 lbs of pure water and water weight, but have not gained true weight just yet.\n\n**Month 2-3:** by this time, I was no longer struggling with night sweats associated with hypermetabolism, though I still slept half the day away, cried frequently, and ate at a significant surplus. I could not be physically active for too long, as my legs would swell and I’d begin to feel faint. Month two was when I finally started gaining true weight. It felt rapid at first, but looking back I truly believe it was probably about 1.5-2 lbs a week. \n\nAt about two months, none of my ED jeans or shorts fit and I would have regular meltdowns, ranting and raving about how this is a nightmare and I must have gained a million pounds. But I continued eating.\n\n**Month 4-7:** these next three months were messy for me. Most of my pre-ED clothes didn’t fit at all, and my body image was at an all time low; my body dysmorphia was constantly being triggered every time I caught a glance at my\nown reflection. I was body checking at an all time high, compulsively checking every single angle, pinching my flesh, and begging my friends for reassurance they learned quickly not to give me. \n\nBut I still didn’t know what I looked like. Looking at photos from before I entered recover were surreal. I didn’t realized how emancipated I was—not just my weight, but my hair, the dark circles under my eyes, how pale and physically fragile I was, as if I’d shatter if I fell too hard (that was a real concern of mine, by the way). But when I looked at myself at this time in my recovery, I saw some hideous monster and that was very difficult for me. I developed a phobia of my own reflection and I began to miss my ED body.\n\nExtreme hunger had reduced around month 4, but was still present in my every day life. I had read so much about how others weight restored after just four months, and My rigid, OCD brain somehow convinced me that I absolutely **had** to be weight restored now, so I began to ignore the remnants of my extreme hunger and only allowed myself to eat [redacted] calories a day. Nothing as low as during my active anorexia, but still not enough to support my recovering body, which unfortunately still required a lot of food. I’m not completely sure as I never weighed myself once at this point, but I believe I lost a little bit of weight and my body was not happy about it.\n\nCouple all that with extreme food boredom and I fucking relapsed, got stuck in a state of quasi recovery, whatever you wanna call it, for 3.5 months. I was constantly hungry, but had zero appetite. It was especially bad at night.\n\n**Month 8-9:** I was able to pull myself out of that relapse and began honoring my extreme hunger once more. I was averaging about 4,000kcals a day for two months. I got rid of my ED clothes, and I started therapy after realizing that I was not recovering psychologically at all, my OCD was flairing up and my body dysmorphia forced me to think about the way I looked every hour of every day. The new clothes I’d bought suddenly felt tight and I noticed new fat deposits in places I’ve never had fat before. My face was swollen and my body felt tight from the water retention.\n\nI have a short short torso and long legs, which resulted in any weight gain I had to my trunk/abdomin region looked compact and too heavy. My ass, thighs, and upper arms also held a lot of weight, whereas my wrists, feet, calves and neck seemingly gained nothing at all. The best description for this foreign body would be, an adult sized toddler. It was uncomfortable and I felt alien in my body, all of the time.\n\nI had gotten a physical done for my new job, and I’d requested not to know what my weight is.... so they told me my BMI instead. I cried for an hour.\n\nThese months were very difficult for me, because recovery just felt hopeless and not at all worth it.\n\n**Months 10-12:** new year, new me—literally. I finally began to see the brighter side of recovery, just dimly. My extreme hunger vanished completely, for the first time in almost a year. I was still eating about 3,400-3,800kcals daily, but my body was still doing a lot of internal healing. I no longer thought about food and every once  in awhile I’d experience fullness. \n\nI dropped some water weight and no longer felt uncomfortably bloated and swollen. I stayed a consistent clothing size and no longer had to continuously buy new leggings and underwear.\n\nI still struggled immensely with my body dysmorphia, and an inability to look at myself from the neck down... but I suddenly had more energy to go back to weight lifting  purely for enjoyment and no aesthetic goal despite my (perceived) uneven weight distribution. I found motivation to start making art again. I laughed a lot more.\n\n**Month 13-14 (present):** my appetite has stabilized and I now experience hunger. I feel like I did, pre-ED  as far as hunger cues and my physical health feels. I have loads of energy to do the things I want, such as hiking, going on walks, and I’m able to be present no matter what food I might have to eat or if I might have to skip a workout (fun story, I dropped a weight on my foot and haven’t worked out properly in about 2 weeks). \n\nI have “overshot” by quite a lot compared to what I lost. My body feels extremely foreign to me, and my weight has yet to redistribute (all in the belly). However I’m slowly moving away from the concept that I’ll lose it. I want to feel comfortable in my body regardless of my size. My relationship has improved, I’m excelling at my job, and I get to eat freely and I can be present with friends, family and my therapist.\n\nThat isn’t to say I don’t have my struggles. I still can’t look in mirrors without feeling immense embarrassment and disgust. I’m currently struggling to ensure I’m eating enough when I’m stressed (going through a really rough time in my life). I have a bad habit of buying clothes that are too big and then crying about the size. But I am actively working on dismantling my own internalized fatphobia and practicing radical acceptance about this new body. I am aware of the things that trigger me and have to make the conscious decision to not give into compulsive ED thoughts, because at the end of the day I am responsible for my own mental health.\n\nTo sum this post up, recovery is fucking hard, often for a long damn time. But it is soooososososo worth it if you wade through the really fucking bad parts, when it feels like it isn’t worth it at all. You have a mental disorder, but you are not broken and you deserve to live a life without your eating disorder whispering in your eat every second of every single day. I hope this helped at least one person. 🥰",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ncz0vq/14_months_in_recovery/",
  "score": 97,
  "num_comments": 21,
  "comments": [
    {
      "id": "gy7q6fn",
      "author": "sailormiffy",
      "body": "Wow, that's so awesome that you were able to push through to the other side even when it got tough. Thank you for sharing. Do you ever have days now where you don't think about food or weight? I'm looking forward to mental freedom.",
      "created_utc": 1621086546.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gy88t8b",
      "author": "Aliinga",
      "body": "What made you decide one day to just go all in (if you want to call it that way)? Some people challenge their ED step by step (food rule by food rule, fear food by fear food), but it sounds like you made the decision to just go in 100% from day 1. Curious about how you came to this decision. It sounds very brave and strong.",
      "created_utc": 1621095851.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gy9tunn",
      "author": "retawknird",
      "body": "Hey!\nI’ve been going from quasi recovery where I felt like I had normal signals and weight redistributed to eating intuitively and it feels like my extreme hunger has reawakened with more weight gain and uncomfortable bloating. Any advice?\nThanks so much for taking the time to write this out and help us <3",
      "created_utc": 1621124914.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gy8vj42",
      "author": "weirdo2050",
      "body": "Oh hey, almost recovery twins! I'm 15 months in. My timeline is very similar to yours, except that I have had quite a few relapses and have struggled a ton overall, got even hospitalized in February of this year. I'm currently pretty much at the same position where you are, mostly doing pretty ok, I actually recognize and feel hunger (hospitalization and mechanical eating have helped a ton, I ate mostly intuitively for a little less than a year and even tho I had extreme hunger on some days, there were also days where I either didn't feel or recognize hunger cues, now I feel slight hunger before every meal). I also overshot by a lot, and I mean A LOT. But that's okay, it happens often in ED recovery and I just need to accept that it also happened to me. At least I have emotions now, ukno. :D",
      "created_utc": 1621106831.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy9l6r5",
      "author": "Mimolette_",
      "body": "Thanks so much for this post. I relate to a lot of aspects of it. Hope things continue to go well for you!",
      "created_utc": 1621120191.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gy8t4nr",
      "author": "dafodilla",
      "body": "I have a question about relationships and ED:\n\nYou clearly had an ED and as you stated it was visible both physically and mentally. \n\nHow did your partner react to your eating habits during ED? Did she/he comment  on your looks? Was she/he trying to help you or just ignored it?\n\nAnd how did the partner react to your recovery phase?",
      "created_utc": 1621105620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gy8v5oh",
      "author": "thenewmeredith",
      "body": "How do you plan what to get at the store? I've been at it for 2 years now and I still don't get how to eat intuitively but also plan for grocery shopping.",
      "created_utc": 1621106642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h70ze5e",
      "author": "AbbyH03",
      "body": "How did you know the weight the first month was water? Especially eating in significant surplus. Im asking because I’m going through the same rn",
      "created_utc": 1627606478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hobm2xl",
      "author": "carolb007",
      "body": "Reading this brought tears to my eyes because I’ve had such a similar experience with my ED. This is my 3rd time in recovery from serious relapses (trips to inpatient), and I’m at the stage where I’m just about weight restored, but mentally and emotionally I still significantly struggle with ED thoughts. However, this time was different, because this time I actively chose recovery instead of my ass getting dragged to another inpatient facility. It took 6 months of hard work, but I look and feel healthy again. Even though I’m physically healthy, my body dysmorphia is at an all time high and I tend to cry and isolate a lot of the time. When I find myself wanting to cling on to ED behaviors again to find some type of “relief”, I just try to remember how I felt deep in my ED, and how nothing is worth going down that hole again. Knowing that I’m not the only one who struggles with extreme hunger, body image anxiety, and revolving thoughts about food makes me feel less alone in this. I want to thank you for sharing your story and I applaud you for working your ass off for recovery. Recovery seems impossible sometimes, but it’s so fucking worth it. Proud of you!!",
      "created_utc": 1639358356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipuhpib",
      "author": "notsure22222",
      "body": "did you have a job the entire time you were recovering?",
      "created_utc": 1664118162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gy7qgy7",
      "author": "Sareeee48",
      "body": "I do, actually! I never think of food unless I’m hungry, but it’s no longer this gnawing, I’m-going-to-die-if-I-don’t-eat hunger. I rarely think about my weight, but it also helps that I don’t weigh myself at all. The mental freedom took some time but it is absolutely the best part, alongside food freedom.",
      "created_utc": 1621086708.0,
      "score": 9,
      "context": [
        {
          "id": "gy7q6fn",
          "author": "sailormiffy",
          "body": "Wow, that's so awesome that you were able to push through to the other side even when it got tough. Thank you for sharing. Do you ever have days now where you don't think about food or weight? I'm looking forward to mental freedom.",
          "created_utc": 1621086546.0
        }
      ]
    },
    {
      "id": "gy9a0f2",
      "author": "Sareeee48",
      "body": "I’m an all or nothing type of person, so the step by step process just didn’t work for me. Diving right in was the best thing for me, but I did do a fuckload of research beforehand as well.\n\nI was originally planning on half adding recovery by still restricting most of the day and continuing exercise, if I’m being honest. But the pandemic came on so suddenly that it kind of forced me into a rock and a hard place in terms of my ED, if that makes sense.\n\nEdit: I just wanna say that if this step by step method works for you, definitely do that! Push yourself, but don’t push yourself too much.",
      "created_utc": 1621114228.0,
      "score": 7,
      "context": [
        {
          "id": "gy88t8b",
          "author": "Aliinga",
          "body": "What made you decide one day to just go all in (if you want to call it that way)? Some people challenge their ED step by step (food rule by food rule, fear food by fear food), but it sounds like you made the decision to just go in 100% from day 1. Curious about how you came to this decision. It sounds very brave and strong.",
          "created_utc": 1621095851.0
        }
      ]
    },
    {
      "id": "gy9ud0t",
      "author": "Sareeee48",
      "body": "Honestly, just honor that hunger and gain the weight if that’s what you need to do. If you have a therapist, talk to them about it as well. My extreme hunger lasted about as long as I relapsed for, but idk if that’s significant info or not lol. It’s super shitty but the quicker you honor it the quicker you make it out the other end! It also helped reading up on extreme hunger stories vis this sub specifically, IG and blog posts. For me, knowing I wasn’t alone was super helpful.",
      "created_utc": 1621125206.0,
      "score": 4,
      "context": [
        {
          "id": "gy9tunn",
          "author": "retawknird",
          "body": "Hey!\nI’ve been going from quasi recovery where I felt like I had normal signals and weight redistributed to eating intuitively and it feels like my extreme hunger has reawakened with more weight gain and uncomfortable bloating. Any advice?\nThanks so much for taking the time to write this out and help us <3",
          "created_utc": 1621124914.0
        }
      ]
    },
    {
      "id": "gy9k9t8",
      "author": "Sareeee48",
      "body": "Ahhh I’m glad you’re okay! Hopefully your hunger cues come back eventually.\n\nThe overshoot I think is the worst because it really exacerbated my body dysmorphia and I want nothing more than to just peel my skin from my bones some days. Obviously that has nothing to do with my body itself, but the acceptance is hard nonetheless. I know it’s an important part of recovery, if not a permanent state altogether.",
      "created_utc": 1621119697.0,
      "score": 4,
      "context": [
        {
          "id": "gy8vj42",
          "author": "weirdo2050",
          "body": "Oh hey, almost recovery twins! I'm 15 months in. My timeline is very similar to yours, except that I have had quite a few relapses and have struggled a ton overall, got even hospitalized in February of this year. I'm currently pretty much at the same position where you are, mostly doing pretty ok, I actually recognize and feel hunger (hospitalization and mechanical eating have helped a ton, I ate mostly intuitively for a little less than a year and even tho I had extreme hunger on some days, there were also days where I either didn't feel or recognize hunger cues, now I feel slight hunger before every meal). I also overshot by a lot, and I mean A LOT. But that's okay, it happens often in ED recovery and I just need to accept that it also happened to me. At least I have emotions now, ukno. :D",
          "created_utc": 1621106831.0
        }
      ]
    },
    {
      "id": "gy9ahe1",
      "author": "Sareeee48",
      "body": "Tbh he just... didn’t know what to do and would always make the “you’re so small...” comments, and I only now realize that he was vocalizing concern and not entirely complimenting me. He didn’t ignore it but I was so deep in my own shit that it wouldn’t have matter if he’d said anything (my sister tried to bring it up to me and it just caused me to sink further down).\n\nRecovery has improved my relationship soooo much though. He was extremely supportive when I told him I needed help and when I decided to recover. He never once made me feel bad about the weight gain,  buying a new wardrobe, nothing. I couldn’t have ended up with a better partner to recover with.",
      "created_utc": 1621114472.0,
      "score": 4,
      "context": [
        {
          "id": "gy8t4nr",
          "author": "dafodilla",
          "body": "I have a question about relationships and ED:\n\nYou clearly had an ED and as you stated it was visible both physically and mentally. \n\nHow did your partner react to your eating habits during ED? Did she/he comment  on your looks? Was she/he trying to help you or just ignored it?\n\nAnd how did the partner react to your recovery phase?",
          "created_utc": 1621105620.0
        }
      ]
    },
    {
      "id": "gy9jof2",
      "author": "Sareeee48",
      "body": "Tbh it helps that I have a partner who basically decides what meals we’re going to eat. I bought all the things I restricted and ate them for months, but now I’m just indifferent about food. I’m that stereotypical “idk what I want, you pick” kinda girl, lmfao.\n\nThat said, there are a few things I know I really enjoy, so I try to get them regularly/semi regularly and rotate foods out. I try new foods and a lot and so my diet is constantly changing. Most times I’ll eat chicken, but I’ll try to change up the way it’s prepared, or I’ll eat a lotta beef one week instead. Or I’ll try tofu dishes instead.\n\nHope that somewhat answered your question!",
      "created_utc": 1621119380.0,
      "score": 3,
      "context": [
        {
          "id": "gy8v5oh",
          "author": "thenewmeredith",
          "body": "How do you plan what to get at the store? I've been at it for 2 years now and I still don't get how to eat intuitively but also plan for grocery shopping.",
          "created_utc": 1621106642.0
        }
      ]
    },
    {
      "id": "h71346u",
      "author": "Sareeee48",
      "body": "From a scientific perspective, it makes sense. The body’s first response to food after starvation is to rehydrate the body. It’s physically improbable that I gained 10+ lbs in true weight in only a week; plus, my whole body swelled for months. It felt tight and uncomfortable to move—not like gaining weight.\n\nHope that makes sense!",
      "created_utc": 1627608214.0,
      "score": 1,
      "context": [
        {
          "id": "h70ze5e",
          "author": "AbbyH03",
          "body": "How did you know the weight the first month was water? Especially eating in significant surplus. Im asking because I’m going through the same rn",
          "created_utc": 1627606478.0
        }
      ]
    },
    {
      "id": "ipujjd1",
      "author": "Sareeee48",
      "body": "Yes, save for like 2-3 months. I didn’t start working full time until about 6 months in though. Of course, not everyone has the luxury of doing that. But if you do, definitely try to take advantage of that.",
      "created_utc": 1664118956.0,
      "score": 1,
      "context": [
        {
          "id": "ipuhpib",
          "author": "notsure22222",
          "body": "did you have a job the entire time you were recovering?",
          "created_utc": 1664118162.0
        }
      ]
    },
    {
      "id": "gyao80r",
      "author": "dafodilla",
      "body": "I am so happy for you!❤",
      "created_utc": 1621143876.0,
      "score": 1,
      "context": [
        {
          "id": "gy8t4nr",
          "author": "dafodilla",
          "body": "I have a question about relationships and ED:\n\nYou clearly had an ED and as you stated it was visible both physically and mentally. \n\nHow did your partner react to your eating habits during ED? Did she/he comment  on your looks? Was she/he trying to help you or just ignored it?\n\nAnd how did the partner react to your recovery phase?",
          "created_utc": 1621105620.0
        },
        {
          "id": "gy9ahe1",
          "author": "Sareeee48",
          "body": "Tbh he just... didn’t know what to do and would always make the “you’re so small...” comments, and I only now realize that he was vocalizing concern and not entirely complimenting me. He didn’t ignore it but I was so deep in my own shit that it wouldn’t have matter if he’d said anything (my sister tried to bring it up to me and it just caused me to sink further down).\n\nRecovery has improved my relationship soooo much though. He was extremely supportive when I told him I needed help and when I decided to recover. He never once made me feel bad about the weight gain,  buying a new wardrobe, nothing. I couldn’t have ended up with a better partner to recover with.",
          "created_utc": 1621114472.0
        }
      ]
    },
    {
      "id": "h714f41",
      "author": "AbbyH03",
      "body": "Yes it does! I think mine is true weight tho which I’m totally fine with! But it’s weird because it’s all kinda hard? Like it’s not really jiggly? Like it moves but my body feels quite firm and tough to the touch I’m not sure what that’s about. It almost feels fake? It’s so hard to explain",
      "created_utc": 1627608828.0,
      "score": 2,
      "context": [
        {
          "id": "h70ze5e",
          "author": "AbbyH03",
          "body": "How did you know the weight the first month was water? Especially eating in significant surplus. Im asking because I’m going through the same rn",
          "created_utc": 1627606478.0
        },
        {
          "id": "h71346u",
          "author": "Sareeee48",
          "body": "From a scientific perspective, it makes sense. The body’s first response to food after starvation is to rehydrate the body. It’s physically improbable that I gained 10+ lbs in true weight in only a week; plus, my whole body swelled for months. It felt tight and uncomfortable to move—not like gaining weight.\n\nHope that makes sense!",
          "created_utc": 1627608214.0
        }
      ]
    },
    {
      "id": "h714rdm",
      "author": "AbbyH03",
      "body": "Also it’s painful to touch certain areas! My underarms are in such pain when I shave and the top of my stomach is sore 24/7 (maybe from the skin stretching?). I don’t believe it’s edema because the skin doesn’t pit",
      "created_utc": 1627608991.0,
      "score": 1,
      "context": [
        {
          "id": "h70ze5e",
          "author": "AbbyH03",
          "body": "How did you know the weight the first month was water? Especially eating in significant surplus. Im asking because I’m going through the same rn",
          "created_utc": 1627606478.0
        },
        {
          "id": "h71346u",
          "author": "Sareeee48",
          "body": "From a scientific perspective, it makes sense. The body’s first response to food after starvation is to rehydrate the body. It’s physically improbable that I gained 10+ lbs in true weight in only a week; plus, my whole body swelled for months. It felt tight and uncomfortable to move—not like gaining weight.\n\nHope that makes sense!",
          "created_utc": 1627608214.0
        }
      ]
    }
  ]
}