{
  "id": "nepnl0",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1621280308.0,
  "title": "Eating disorders are NOT rooted in fatphobia",
  "selftext": "Two of the people I'm following are saying this and laughing about how people are mad cause they know it's true but it's not. I'm not an expert so its hard to voice what exactly they're rooted in but I just feel like you have to be in a bubble to take all the pain and suffering and death and minimize it to \"they hated fatness that much\", no just no. We live in a fatphobic society that places value on beauty so obviously fatphobia only encourages and strengthens eating disorders. It would be the exact same as if addicts lived in a world that valued hard drugs and how much you could take without dying. And this is a major criticism I have with some fat liberationists (not politics as a whole because these are very specific people who are interested in living out revenge fantasies). You can't deny facts about mental and physical health to fit an agenda because that means you don't want a world where people can just be, you want a world where the roles are reversed. And I'm referring to ideas of \"you can never have too much fat\" or \"eating disorders are rooted in fatphobia\" or \"nutrition is fatphobic\" like no, you can have too much fat just like you can not have enough fat on your body but that's something HIGHLY personal to you and your body distribution, no stranger on the internet is ever going to be able to tell how healthy you are based on how fat you look to them (obviously extremes are outliers) and there are nutrient-dense foods and non-nutrient dense foods, the idea that all foods are equally nutritious completely invalidates the struggles of people who live in food deserts, HOWEVER not everything you eat needs to be dense in nutrients, our bodies can take a couple of McDonald's cheeseburgers. It's just so frustrating because it feels like I have to clarify and fight on two different fronts, one against diet culture and another against people who SHOULD know better. I'm thinking about unfollowing them based on their response.\n\n&#x200B;\n\nedt: Thank you all for the support and for sharing your stories. If you want to know what fat acceptance and liberation is really about, this video gives some good background and sources. It's nothing like what those people are trying to push. I love you all!\n\n[https://www.youtube.com/watch?v=18tP2Uh83AA&ab\\_channel=TeeNoirTeeNoir](https://www.youtube.com/watch?v=18tP2Uh83AA&ab_channel=TeeNoirTeeNoir)\n\n ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nepnl0/eating_disorders_are_not_rooted_in_fatphobia/",
  "score": 221,
  "num_comments": 34,
  "comments": [
    {
      "id": "gyhhbqb",
      "author": "ConfidentStrength999",
      "body": "“You have to be in a bubble to take all the pain and suffering and death and minimize it to “they hated fatness that much”” -YES! Thank you for putting this in words. \n\nEating disorders can be rooted in a lot of things - family issues, trauma, loneliness, perfectionism, etc - and those things can vary from person to person! But saying that fat phobia is THE root of eating disorders just minimizes a mental illness down to a vanity issue. (And it completely disregards the many people with eating disorders who aren’t fat phobic).",
      "created_utc": 1621281567.0,
      "score": 120,
      "context": []
    },
    {
      "id": "gyizhb3",
      "author": "nnogales",
      "body": "i think it's as simple as understanding that EDs are not rooted in fatphobia, but unlearning fatphobia is crucial to recovery.",
      "created_utc": 1621307763.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gyiyr2x",
      "author": "helgatitsbottom",
      "body": "I mean, my ED IS partially rooted in not wanting to be fat. I am fat and the constant messaging of oh it’s so easy to be thin, just put down the cheeseburgers was destroying me from the inside. So I just stopped eating. And as I got thinner, I got so much praise for it that had I not had a good psychologist who picked up on it, I would have kept going until there was nothing left\n\nFor me there’s also perfectionism and control issues but internalised fat phobia is indeed a big part",
      "created_utc": 1621307357.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gyhzs0f",
      "author": "ikillsouls",
      "body": "I recently started following a bunch of recovery instagram pages (not individuals, but more educational). A lot of them are run by BIPOC which I think is amazing and so helpful for me. \n\n I've had to unfollow 2 or 3 of them at this point bc that's their main thing that they post, no actual resources or information anymore just guilting shit like \"your ED is rooted in fat phobia and anti-Blackness\". Yes, I can acknowledge that the western beauty standard is rooted in those things, but when you make a page just to tell people that they either need to get fat or you're going to assume they're fatphobic and anti-Black just bc they're thin/ haven't gained weight/ haven't chosen to recover you need more info and education yourself. \n\nIt got so frustrating to just hear that and no actual acknowledgement of different EDs or situations. It was so toxic and shaming.",
      "created_utc": 1621289815.0,
      "score": 32,
      "context": []
    },
    {
      "id": "gyjeyl0",
      "author": "throwaway-m1",
      "body": "THIS!! All eating disorders being rooted in fatphobia is SUCH a hurtful lie. Fatphobia made my eating disorder 10x worse and made it much harder to recover, yes. But it wasn’t the cause, fixing my internalized fatphobia will never cure my eating disorder, and saying that it would is extremely minimizing and reductive and quite honestly pretty ableist.",
      "created_utc": 1621317904.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gyhw99f",
      "author": "faroffland",
      "body": "I avoid any kind of ‘body positivity’ that is rooted in things that are factually untrue such as ‘obesity is healthy’, ‘being obese doesn’t cause any health issues’, ‘you can be healthy at ANY size’. Not because I hate fat people or judge them at all for their size, I myself am currently overweight - but because I see many parallels between the rhetoric of that kind of us versus them/we are healthy in spite of medical studies and science, and the pro ana/thinspiration/they just hate you cos you’re what they want to be/you’re doing the right thing regardless of what your doctor says shit that used to encourage me to restrict.\n\nBoth ends of the extreme are damaging. Nobody should be judged or hated for their size but one of my friends, who really helped me see I had a problem and get help when I was active in my ED, is very much into this ‘being obese is totally healthy and none of the stuff that shows it isn’t is true’ and I’m just like... you made me see I was damaging my body and get help when I was underweight and starving, but you see the same thing for very overweight people as offensive?? How was healthy at every size working out for you when I was underweight?\n\nIdk I just see people with EDs at both ends of the spectrum justifying their illness with that junk. There’s obviously a range of healthy that is different for each individual but saying it’s healthy to be extremely overweight is like someone saying ‘well for ME 500 calories a day is plenty’. Like there’s an point at which it obviously isn’t regardless of your body/metabolism/cardio/whatever.",
      "created_utc": 1621288198.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gyjt46l",
      "author": "internerderner2",
      "body": "When I first started recovery, I even had to google some of these concepts because they were so alien to my reality lol. \n\nOver time, it has become widely known and public that fat people can also have EDs - and this awareness in itself is a good thing of course, but their minority has now become dominant in the recovery discourse, and the recovery strategies that are meant to help them have now started to trample any other idea that might be helpful to someone else. For the same reason I've even had someone telling me that \"EDs are rooted in racism\" (?).\n\nDon't get me wrong: I DO believe fatphobia is a thing, I DO praise fat people with EDs for being able to recover and accept their bodies, I DO sympathize with whatever struggle they might face, I DO believe that eating without restriction is the only true key to recover and I am the first one to call out those who bullshit their way into restriction by telling \"I jUsT wAnNa bE HeAlThY!\".\n\nBut. I also believe that the whole challenge your inner fatphobia, your ED is rooted in fatphobia etc., is also primarily directed towards fat people themselves and it is meant to help THEM deal with THEIR struggle. And while I do believe that certain parts of this discourse can be helpful for everyone, I also believe that if you just blanket apply the same rhetoric to every possible ED on the planet it just becomes yet another fad trend like the whole 90s media frenzy about fashion catwalks causing teens to starve into anorexia, or those outdated ideas about EDs being caused by young females having mommy issues. It just trivializes both sides of the debate and ultimately doesn't really help anyone - and yes, it also leads to extremes such as the pseudoscience claims you listed.\n\nBy the way, as I said to someone else before, all of this is extremely American centered. Some of these concepts don't really make that much sense to non-US cultures.",
      "created_utc": 1621330346.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyk9gev",
      "author": "OuterKitKat",
      "body": "I think giving a single cause to EDs is so condescending and reductive, not to mention disrespectful. They are such a complex thing that are experienced so differently by different people.\n\nSome trans people get EDs becuase of dysphoria, some people do it to feel in control, some people find comfort in the feeling of emptiness/on binging/on purging, some people make it an habit and don't even know why they keep going anymore with exception that it is the only constant in their lives. Most ED sufferers have a mix of them all.\n\nFatphobia CAN be an issue, but to say it is the \\*only\\* one only perpetuates that EDs are physical and not, you know, a mental illness.",
      "created_utc": 1621341991.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyjpkl3",
      "author": "Lapamasa",
      "body": "How about some EDs are caused by fat phobia, and some aren't?\n\nI can assure you that fat phobia is a big part of some cultures, and denying that doesn't help. Also, many parents impart EDs unto their kids just by being extremely judgmental towards fat. EDs can be genetically predisposed, or caused by trauma, but there are MANY factors, and fat phobia is absolutely relevant for the EDs of many people. Let's not pretend reality isn't complex and multifocal.",
      "created_utc": 1621327034.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gyj3v1e",
      "author": "Sareeee48",
      "body": "I don’t think eating disorders as a whole are rooted in fatphobia (though it is a big contributing factor in the perpetuation of EDs), but I do think there are cases in which that is true. IMO, fatphobia is a trauma in and of itself that often starts in childhood and, yes, absolutely contributes to the rise in eating disorders over the past few years. A connective trauma, I guess.\n\n[Some] risk factors for eating disorders include weight stigma and a history of dieting; of course, you need to meet psychological criteria to be diagnosed, but the line between disordered eating and eating disorders often become blurred, so is important to understand that, at the end of the day, EDs are mental disorders. Therefore, I think it’s worth noting that many eating disorders do stem from fatphobic ideologies at a young age... not all, but some.",
      "created_utc": 1621310277.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gyjadog",
      "author": "atomixturquoise",
      "body": "Lol I love how even supposed authorititative figures on ED'S will repeat this lie. Dumb shit. Even treatment providers have bought into this propaganda which has made me decide that if I relapse bad enough that I will legit just not seek treatment bc their \"cure\" is oversimplifiying a complex condition.",
      "created_utc": 1621314487.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyjosm5",
      "author": "LittlePurrx",
      "body": "My eating disorder is/was rooted in a need to control something - anything - in my life, as a young child. I also felt safer when I could see and feel my bones, as then I did not feel so abstract. Make sense of it if you can, but it was not rooted in fatphobia. Whilst I mainly have EDNOS now, it still drops into anorexia during times when I feel I have no control over my life. And I'm really quite fat now, as my body no longer accepts the idea of losing weight, no matter how much I restrict. I did have a while of having some fatphobic ideas in my teens, but had already had ED for many years before that age with absolutely no relevance to fatphobia.",
      "created_utc": 1621326303.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gyivuxc",
      "author": "Discalced-diapason",
      "body": "Like a lot of others here and many people I’ve encountered in many many treatment programs (close to 100, maybe?), my ED is based in trauma. Full stop. I didn’t stop eating because I was afraid of being fat. I stopped eating because I thought if I were smaller I could disappear and be less of a target—that there would be less of my body that could be hurt and traumatised. I also hated myself but didn’t want to unalive myself, so I did the “next best thing”.\n\nI won’t deny that fat-phobia can be a factor for some people’s eating disorders, but others making it as a blanket statement of fact is invalidating, hurtful, and completely untrue. I’m sorry, my eating disorder isn’t about you (the general you, not you personally), so stop trying to impose your clearly false interpretations of my struggle. \n\n/rant\n\nThank you for this post. EDs are such nuanced things and while there are definite similarities in a lot of people who have one, they are also very personal and not everyone developed one for the same reason, whether it be trauma, depression/anxiety, or fat-phobia.",
      "created_utc": 1621305805.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gyjvrsr",
      "author": "daintydaisyxo",
      "body": "My ed started with a diet. I gained a lot of weight because of antipsychotics and antidepressants. I refused to take them after some time. So I started this diet but I was depressed and anxious. For me, the success made me feel like I am not worthless like my depression always convinced me. In therapy turned out I am having bpd, it was kind of self harm and slow suicide. Now I am back on antidepressants, learned my lesson to not refusing medication and I am a lot better now. I have never dealt with problems that comes with fatphobia. 4 years before anorexia and receiving any treatment for my mental health, I had an anorexic-bulimic episode due to suicidal thoughts and the desperate need of control. I felt like an alien, I had nowhere a place where I belong. My parents dealt with their own shit, at work I got another ward to work on. I felt so alone and starving/purging gave me some control. Bcz  of depression, I lost my appetite but when I ate I felt the need to purge. After I got to my old ward, I stopped this behavior and got outpatient treatment.",
      "created_utc": 1621332721.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gyilk7m",
      "author": "yogak06",
      "body": "THIS SO MUCH THIS- I have not had my ed for 16 + years and destroyed my life due to fat phobia.",
      "created_utc": 1621300588.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h5yly2n",
      "author": "boringbooklvr",
      "body": "i don’t think eating disorders are rooted in fatphobia, mine started because of my ocd and need for control, but i do believe that fatphobia is a part of a very large majority of eating disorders, in all forms. i think the root cause is only occasionally fatphobia, but that fatphobia develops as an eating disorder goes on, especially because of the social climate we live in. does that make sense?\nalso, i’m currently unlearning the fatphobia that is rooted in my eating disorder and learning to neutralize how i feel about my body because in the end my body is my body <33",
      "created_utc": 1626839274.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gyj1tfy",
      "author": "lolaboats",
      "body": "Oh you didn't know? The only acceptable eating disorders to have are the ones that make you obese, and thin people are \"naturally fatphobic\" the \"body positivity movement\" is toxic af. Just leave it, and continue being a person that doesn't look down on others for their bodies. It's a lot more peaceful, and it's much easier without the drama of it all. Stand up for what you know is right, but leave the toxicity behind.",
      "created_utc": 1621309078.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gyhna5r",
      "author": "TheShortGerman",
      "body": "Amen! My eating disorder is rooted in sexual abuse, rape, PTSD, OCD, anxiety, etc. I don't think it has a single thing to do with fatphobia.",
      "created_utc": 1621284135.0,
      "score": 51,
      "context": [
        {
          "id": "gyhhbqb",
          "author": "ConfidentStrength999",
          "body": "“You have to be in a bubble to take all the pain and suffering and death and minimize it to “they hated fatness that much”” -YES! Thank you for putting this in words. \n\nEating disorders can be rooted in a lot of things - family issues, trauma, loneliness, perfectionism, etc - and those things can vary from person to person! But saying that fat phobia is THE root of eating disorders just minimizes a mental illness down to a vanity issue. (And it completely disregards the many people with eating disorders who aren’t fat phobic).",
          "created_utc": 1621281567.0
        }
      ]
    },
    {
      "id": "gyizv5m",
      "author": "None",
      "body": "100%",
      "created_utc": 1621307979.0,
      "score": 5,
      "context": [
        {
          "id": "gyizhb3",
          "author": "nnogales",
          "body": "i think it's as simple as understanding that EDs are not rooted in fatphobia, but unlearning fatphobia is crucial to recovery.",
          "created_utc": 1621307763.0
        }
      ]
    },
    {
      "id": "gyizskc",
      "author": "None",
      "body": "I'm sorry that happened to you. That idea that fat people are just gorging down food all the time is compleltey false and not rooted in any logic. And hearing you say how you were praised for hurting yourself really shows how fatphobia puts people who suffer from eating disorders in an even more dangerous position. I also don't agree with the idea that you are a bad person (not that you were implying it but the people I'm talking about are) because your eating disorder was rooted in fatphobia. We see how people treat us when we're fat versus when we're skinny. I feel like there's this idea that people should be martyrs. I believe we should blame the system and not the people.",
      "created_utc": 1621307938.0,
      "score": 5,
      "context": [
        {
          "id": "gyiyr2x",
          "author": "helgatitsbottom",
          "body": "I mean, my ED IS partially rooted in not wanting to be fat. I am fat and the constant messaging of oh it’s so easy to be thin, just put down the cheeseburgers was destroying me from the inside. So I just stopped eating. And as I got thinner, I got so much praise for it that had I not had a good psychologist who picked up on it, I would have kept going until there was nothing left\n\nFor me there’s also perfectionism and control issues but internalised fat phobia is indeed a big part",
          "created_utc": 1621307357.0
        }
      ]
    },
    {
      "id": "gyhyaf6",
      "author": "sorcerers_apprentice",
      "body": "I love this comment so much--could not agree more. I am *so sick* of people pretending that either extreme is in any way healthy, *especially* when it comes from ED treatment providers! Please, for the love of God, I just want a treatment team that will have an honest conversation with me about making predominately balanced food choices, maintaining a healthy weight, and getting a moderate amount of exercise. I'm severely underweight right now due to an AN relapse, and I fully acknowledge that it's not healthy, and that I need to gain some weight and eat more regularly to be in a better spot. But just because I'm at one extreme does not mean encouraging me to go to the other extreme is a good strategy... I'm a big girl, lol, I can handle the truth about nutrition, and I'd respect the hell out of any treatment provider that gave me actual scientific, evidence-based information instead of feel-good BS.",
      "created_utc": 1621289117.0,
      "score": 18,
      "context": [
        {
          "id": "gyhw99f",
          "author": "faroffland",
          "body": "I avoid any kind of ‘body positivity’ that is rooted in things that are factually untrue such as ‘obesity is healthy’, ‘being obese doesn’t cause any health issues’, ‘you can be healthy at ANY size’. Not because I hate fat people or judge them at all for their size, I myself am currently overweight - but because I see many parallels between the rhetoric of that kind of us versus them/we are healthy in spite of medical studies and science, and the pro ana/thinspiration/they just hate you cos you’re what they want to be/you’re doing the right thing regardless of what your doctor says shit that used to encourage me to restrict.\n\nBoth ends of the extreme are damaging. Nobody should be judged or hated for their size but one of my friends, who really helped me see I had a problem and get help when I was active in my ED, is very much into this ‘being obese is totally healthy and none of the stuff that shows it isn’t is true’ and I’m just like... you made me see I was damaging my body and get help when I was underweight and starving, but you see the same thing for very overweight people as offensive?? How was healthy at every size working out for you when I was underweight?\n\nIdk I just see people with EDs at both ends of the spectrum justifying their illness with that junk. There’s obviously a range of healthy that is different for each individual but saying it’s healthy to be extremely overweight is like someone saying ‘well for ME 500 calories a day is plenty’. Like there’s an point at which it obviously isn’t regardless of your body/metabolism/cardio/whatever.",
          "created_utc": 1621288198.0
        }
      ]
    },
    {
      "id": "gyjtut5",
      "author": "internerderner2",
      "body": "I've always found that denying that weight can cause health issues *in the context of an illness that can literally cause people to get too thin and die* is pretty ironic. If I was deeply into my worst restrictive phase, I could easily just say: well since correlation is not causation and my weight is not correlated to my health, what's the problem if I just stay very underweight? \n\nBut even now, when I'm met with this kind of idea, I always reply that smokers can also be healthy, and I've yet to meet someone that can give a meaningful explanation why the two things are different.\n\nI guess the point in recovery is not and cannot be to just deny that obesity, or any other kind of weight extreme, can cause negative health outcomes. The point is to ask yourself: what does healthy mean for *me*? How can *I* achieve true, solid and long-lasting physical and mental health? And for some people, for whatever reason, that might entail having a higher weight than others, because other alternatives may be worse for them.",
      "created_utc": 1621331025.0,
      "score": 10,
      "context": [
        {
          "id": "gyhw99f",
          "author": "faroffland",
          "body": "I avoid any kind of ‘body positivity’ that is rooted in things that are factually untrue such as ‘obesity is healthy’, ‘being obese doesn’t cause any health issues’, ‘you can be healthy at ANY size’. Not because I hate fat people or judge them at all for their size, I myself am currently overweight - but because I see many parallels between the rhetoric of that kind of us versus them/we are healthy in spite of medical studies and science, and the pro ana/thinspiration/they just hate you cos you’re what they want to be/you’re doing the right thing regardless of what your doctor says shit that used to encourage me to restrict.\n\nBoth ends of the extreme are damaging. Nobody should be judged or hated for their size but one of my friends, who really helped me see I had a problem and get help when I was active in my ED, is very much into this ‘being obese is totally healthy and none of the stuff that shows it isn’t is true’ and I’m just like... you made me see I was damaging my body and get help when I was underweight and starving, but you see the same thing for very overweight people as offensive?? How was healthy at every size working out for you when I was underweight?\n\nIdk I just see people with EDs at both ends of the spectrum justifying their illness with that junk. There’s obviously a range of healthy that is different for each individual but saying it’s healthy to be extremely overweight is like someone saying ‘well for ME 500 calories a day is plenty’. Like there’s an point at which it obviously isn’t regardless of your body/metabolism/cardio/whatever.",
          "created_utc": 1621288198.0
        }
      ]
    },
    {
      "id": "gylm4ow",
      "author": "None",
      "body": "Thank you!",
      "created_utc": 1621362717.0,
      "score": 2,
      "context": [
        {
          "id": "gyk9gev",
          "author": "OuterKitKat",
          "body": "I think giving a single cause to EDs is so condescending and reductive, not to mention disrespectful. They are such a complex thing that are experienced so differently by different people.\n\nSome trans people get EDs becuase of dysphoria, some people do it to feel in control, some people find comfort in the feeling of emptiness/on binging/on purging, some people make it an habit and don't even know why they keep going anymore with exception that it is the only constant in their lives. Most ED sufferers have a mix of them all.\n\nFatphobia CAN be an issue, but to say it is the \\*only\\* one only perpetuates that EDs are physical and not, you know, a mental illness.",
          "created_utc": 1621341991.0
        }
      ]
    },
    {
      "id": "gykc3ep",
      "author": "None",
      "body": "Thank you!!! I agree with this. My ED was 100% rooted in fatphobia. \n\nI was always on the slim (and tall) side, though not thin, and I thought not being short, petite and skinny made me «less special.» When I lost weight I felt so much pride because I felt like I’d done the best thing a person could possibly do (be thin) and I bragged about it to everyone. I would judge anyone at a higher weight (meaning literally anyone bigger than I was) and that was my entire life purpose. I completely lost all sense of purpose in life because I felt thinness was the only worthwhile goal.\n\nI absolutely know that EDs are often rooted in causes other than fatphobia, but individual experiences shouldn’t be discounted.",
      "created_utc": 1621343343.0,
      "score": 10,
      "context": [
        {
          "id": "gyjpkl3",
          "author": "Lapamasa",
          "body": "How about some EDs are caused by fat phobia, and some aren't?\n\nI can assure you that fat phobia is a big part of some cultures, and denying that doesn't help. Also, many parents impart EDs unto their kids just by being extremely judgmental towards fat. EDs can be genetically predisposed, or caused by trauma, but there are MANY factors, and fat phobia is absolutely relevant for the EDs of many people. Let's not pretend reality isn't complex and multifocal.",
          "created_utc": 1621327034.0
        }
      ]
    },
    {
      "id": "h60a90g",
      "author": "None",
      "body": "I never said they weren’t or couldn’t be rooted in fat phobia. I guess it goes to show no matter how balanced you try to be, someone will find fault",
      "created_utc": 1626878308.0,
      "score": 1,
      "context": [
        {
          "id": "gyjpkl3",
          "author": "Lapamasa",
          "body": "How about some EDs are caused by fat phobia, and some aren't?\n\nI can assure you that fat phobia is a big part of some cultures, and denying that doesn't help. Also, many parents impart EDs unto their kids just by being extremely judgmental towards fat. EDs can be genetically predisposed, or caused by trauma, but there are MANY factors, and fat phobia is absolutely relevant for the EDs of many people. Let's not pretend reality isn't complex and multifocal.",
          "created_utc": 1621327034.0
        }
      ]
    },
    {
      "id": "gyk8kfm",
      "author": "None",
      "body": "I'm very sorry to hear that. I don't want that to be the future for you and I suggest telling treatment providers that hearing this type of talking turns you off to treatment so they know to use different methods. Better safe than sorry",
      "created_utc": 1621341514.0,
      "score": 3,
      "context": [
        {
          "id": "gyjadog",
          "author": "atomixturquoise",
          "body": "Lol I love how even supposed authorititative figures on ED'S will repeat this lie. Dumb shit. Even treatment providers have bought into this propaganda which has made me decide that if I relapse bad enough that I will legit just not seek treatment bc their \"cure\" is oversimplifiying a complex condition.",
          "created_utc": 1621314487.0
        }
      ]
    },
    {
      "id": "gyj6l6n",
      "author": "None",
      "body": "Hmm I would say that fat people are never viewed to have eating disorders, they're just called \"lazy\" and \"greedy\". These people didn't even think about binge eating disorders, if they did they woulnt have said something so ignorant.",
      "created_utc": 1621311959.0,
      "score": 6,
      "context": [
        {
          "id": "gyj1tfy",
          "author": "lolaboats",
          "body": "Oh you didn't know? The only acceptable eating disorders to have are the ones that make you obese, and thin people are \"naturally fatphobic\" the \"body positivity movement\" is toxic af. Just leave it, and continue being a person that doesn't look down on others for their bodies. It's a lot more peaceful, and it's much easier without the drama of it all. Stand up for what you know is right, but leave the toxicity behind.",
          "created_utc": 1621309078.0
        }
      ]
    },
    {
      "id": "gyhuwv5",
      "author": "cattail31",
      "body": "Mine shows up in school because it’s the only thing I can control",
      "created_utc": 1621287580.0,
      "score": 17,
      "context": [
        {
          "id": "gyhhbqb",
          "author": "ConfidentStrength999",
          "body": "“You have to be in a bubble to take all the pain and suffering and death and minimize it to “they hated fatness that much”” -YES! Thank you for putting this in words. \n\nEating disorders can be rooted in a lot of things - family issues, trauma, loneliness, perfectionism, etc - and those things can vary from person to person! But saying that fat phobia is THE root of eating disorders just minimizes a mental illness down to a vanity issue. (And it completely disregards the many people with eating disorders who aren’t fat phobic).",
          "created_utc": 1621281567.0
        },
        {
          "id": "gyhna5r",
          "author": "TheShortGerman",
          "body": "Amen! My eating disorder is rooted in sexual abuse, rape, PTSD, OCD, anxiety, etc. I don't think it has a single thing to do with fatphobia.",
          "created_utc": 1621284135.0
        }
      ]
    },
    {
      "id": "gyleyzd",
      "author": "atomixturquoise",
      "body": "Thanks! I appreciate your kindness. I have discussed this with providers in the past- but programming where I live really tends to be one size fits all. What had worked for me is to take what makes sense out of treatment and discard the bs, hard to do when there is a lot of bs to sort through but yeah lol.",
      "created_utc": 1621359822.0,
      "score": 3,
      "context": [
        {
          "id": "gyjadog",
          "author": "atomixturquoise",
          "body": "Lol I love how even supposed authorititative figures on ED'S will repeat this lie. Dumb shit. Even treatment providers have bought into this propaganda which has made me decide that if I relapse bad enough that I will legit just not seek treatment bc their \"cure\" is oversimplifiying a complex condition.",
          "created_utc": 1621314487.0
        },
        {
          "id": "gyk8kfm",
          "author": "None",
          "body": "I'm very sorry to hear that. I don't want that to be the future for you and I suggest telling treatment providers that hearing this type of talking turns you off to treatment so they know to use different methods. Better safe than sorry",
          "created_utc": 1621341514.0
        }
      ]
    }
  ]
}