{
  "id": "nf6k5w",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1621331580.0,
  "title": "My mom enabled my eating disorder and I’m mad about it",
  "selftext": "She would buy me binge food, large amounts of binge food and it became a big problem. Everyday she would go to the supermarket and buy me binge food, ask me what I wanted and bought me it with no questions asked. Then she would shame me, guilt me. Tell me how much she does for me, how much I owe her etc which would make me feel like shit and I would binge to cope. It was this vicious cycle. \n\nI’m trying to recover now but it’s so difficult. I wish she just gave me the help I needed not straight up enable my eating disorder\n\n\nIn therapy so please don’t tell me to go there",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nf6k5w/my_mom_enabled_my_eating_disorder_and_im_mad/",
  "score": 89,
  "num_comments": 2,
  "comments": [
    {
      "id": "gyjzayi",
      "author": "LittlePurrx",
      "body": "I feel you. Not that way but my mother absolutely refused to acknowledge my anorexia, and when I was trying to recover (and struggling) she just cut me out of family meals unless it was a special occasion like Christmas or something. So then I had no access to cooked/warm food to try to recover (she was too controlling in the kitchen for me to sort out my own, and also I was just a teenager and did not want to recover).",
      "created_utc": 1621335581.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gyllm0j",
      "author": "Intelligent-Pear-115",
      "body": "My mom usually gets herself food (this dumb Ed shit has been going on for generations, my granny’s mom died of not eating, my granny very visibly struggles with the obsessive clean and “healthy” eating thing, my mom binges usually for a few days to years and then looses the weight by eating raw and vegan only and doing sports excessively, my granny told me her granny wasn’t eating anything if someone was in the same room with her and died after not eating at all for quite some time, both may aunts struggle with obvious Ed’s as well, my sister obviously has problems with binges and I’m struggling with a nice mix of stuff with a nice constant bulimia thing going on) anyway, she makes herself food and because she is ashamed of eating she makes me feel guilty for making myself food as well. It doesn’t matter if it’s the first thing I ate, it doesn’t matter if I have half of what she had, the only thing that matters is her guilt and the fact that I’m overweight. But I’m overweight because I binge in secret cause I can’t eat when she’s there cause she will make me feel so bad about myself and then I’ll eat to stop the brain. I’m actively planing on getting professional help as soon as I’m 18 cause my mom doesn’t think anything is wrong besides me being too lazy. I just wish I wouldn’t have these problems with food. I just wish I could eat without feeling so bad afterwards and I wish I could stop binging. If I didnt binge I’d be a normal weight. People would finally stop thinking I’m dumb/poor/lazy. I’m so tired of spending all my money on binges..I’m so tired of this bullshit and I’m pretty sure the things my mom said are like 45% of the reasons. In conclusion: moms are shit, I hope u get better, my mom won’t get grandchildren cause damn I won’t make more mentally ill kids.",
      "created_utc": 1621362510.0,
      "score": 7,
      "context": []
    }
  ]
}