{
  "id": "nglnh0",
  "subreddit": "fuckeatingdisorders",
  "author": "aquite",
  "created_utc": 1621470066.0,
  "title": "One month",
  "selftext": "One month of diving fully into recovery. \n\nOkay, so first the bad:\n\n* extreme hunger (terrifying)\n* bloating (miserable)\n* mood swings (exhausting)\n* body image (uncomfortable)\n\nBut the good, you guys:\n\n* I feel so infinitely less alone. I don't isolate myself. I can suddenly see that people love and care about me - those things used to just bounce off me without me even noticing. I thought I was all alone and that everyone was only worried/exasperated/angry. I couldn't feel love from them or from myself - now I can!\n* Feeling strong. My ED used to tell me that any feeling of energy and strength meant I wasn't sick enough. But I have energy to play, now, to step on crunchy leaves or kick rocks down the sidewalk or chase after a dropped napkin. I'm able to take a simple joy and wonder from those things. It feels good.\n* Pride and confidence. I'm doing something that isn't easy. Something that I've been afraid of for so long. And I can see how far I've already come and I know that I'm going to get out for real. No quasi-recovery for me. I'm winning. Maybe I'm just competitive, but it feels good to know I'm winning.\n* Freedom. I don't have to manage my body and calories every minute of every day. Which means I can go to parties and agree to hang out no matter what time without having to plan for it or be afraid. I can do things without overthinking it. All the rules and compulsions can be broken - I'm not going to pretend they don't crop up still, but they're just voices. And if I break the rules, I don't have to hate myself for it anymore, so they don't really have any power.\n* Learning new things about myself. Like - it turns out that people like me! And it turns out I love parties! And it turns out that I do have a good relationship with my mom, after all. And I want a dog!\n\nMostly, there's no comparing life in recovery to life in the ED. Life in recovery is kind of shitty in a lot of ways, but it's *life*. Life in the ED is so, so, so, lonely, and it isn't really life at all. Just obsessions and fears and compulsions. I'm so grateful for every day I put between myself and that hell. I'm not going to pretend that life is all sunshine and flowers on the way out, it's more like the world's most nauseating rollercoaster. But I don't regret a single step I've taken that's gotten me farther away from that dark, miserable hole.\n\nHere's to one month, and here's hoping for many more. Love to you all. Fuccccck eating disorders!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nglnh0/one_month/",
  "score": 110,
  "num_comments": 7,
  "comments": [
    {
      "id": "gyrk8be",
      "author": "rileyyj001",
      "body": "This is easily my favorite recovery post I have read in *so* long. Cheers to you, OP. You’re giving so many people hope and it sounds like you are choosing life for yourself, on your own terms. Kudos.",
      "created_utc": 1621470956.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gyrjfui",
      "author": "ginajadesmith",
      "body": "Loving this post, you're doing so well - you're right, it is far from easy.. but feeling strong for powering on is bloody amazing. You got thissss! This post is SO inspiring too, sticking my middle finger up to my bloating right now and appreciating life a little more.",
      "created_utc": 1621470553.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gysefyz",
      "author": "OhCrumbs96",
      "body": "You can just sense the joy of life coming from this post. It sounds like you've come out of that weird state of hibernation that restriction puts us in and it is so wonderful to read. There are amazing and exciting things out there for you, keep pushing on💜",
      "created_utc": 1621487095.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gyta5j7",
      "author": "jenlet78",
      "body": "This makes me happy! Happy for you and happy for myself. I started recovery therapy yesterday and to read your post gives me sooo so much hope. 🖤 so thank you!!",
      "created_utc": 1621512453.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gytijzr",
      "author": "aquite",
      "body": "Thank you! You got this too!",
      "created_utc": 1621517067.0,
      "score": 3,
      "context": [
        {
          "id": "gyrjfui",
          "author": "ginajadesmith",
          "body": "Loving this post, you're doing so well - you're right, it is far from easy.. but feeling strong for powering on is bloody amazing. You got thissss! This post is SO inspiring too, sticking my middle finger up to my bloating right now and appreciating life a little more.",
          "created_utc": 1621470553.0
        }
      ]
    },
    {
      "id": "gytihua",
      "author": "aquite",
      "body": "Thank you! I’m excited to see what’s in store :)",
      "created_utc": 1621517038.0,
      "score": 2,
      "context": [
        {
          "id": "gysefyz",
          "author": "OhCrumbs96",
          "body": "You can just sense the joy of life coming from this post. It sounds like you've come out of that weird state of hibernation that restriction puts us in and it is so wonderful to read. There are amazing and exciting things out there for you, keep pushing on💜",
          "created_utc": 1621487095.0
        }
      ]
    },
    {
      "id": "gytfkxi",
      "author": "aquite",
      "body": "I’m so proud and happy for you :) It’s gonna be really uncomfortable sometimes. But it’s such a badass decision to pursue recovery when it feels very very scary. I wish success and happiness to us both!",
      "created_utc": 1621515555.0,
      "score": 3,
      "context": [
        {
          "id": "gyta5j7",
          "author": "jenlet78",
          "body": "This makes me happy! Happy for you and happy for myself. I started recovery therapy yesterday and to read your post gives me sooo so much hope. 🖤 so thank you!!",
          "created_utc": 1621512453.0
        }
      ]
    }
  ]
}