{
  "id": "ni7327",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1621644382.0,
  "title": "I cannot believe I used to live for breakfast",
  "selftext": "So I've been in all-in recovery for 4 months but I was quasi recovered for a year previously.\n\nDuring my quasi recovery I had a protein pancake obsession and literally ate them every fuckin morning. The thought now makes me 1. Feel extremely ill and 2. Feel sorry for my past self because I literally handwashed our blender on a daily basis -- yet it was so worth it to me because breakfast was the highlight of my day. ESPECIALLY because it took a full hour to make and eat. I liked to spend as much time with food as possible.\n\nI can't wrap my head around it since food is so insignificant to me now, though I know that fixation was natural for a body experiencing famine.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ni7327/i_cannot_believe_i_used_to_live_for_breakfast/",
  "score": 114,
  "num_comments": 15,
  "comments": [
    {
      "id": "gz0g0wf",
      "author": "Sorry-Day-744",
      "body": "I had the same thing but for regular pancakes. I ate a biiig stack of pancakes every morning for months, I'd wake up every night at like 4-5 am half asleep and get annoyed that it wasn't pancake time yet.",
      "created_utc": 1621648326.0,
      "score": 46,
      "context": []
    },
    {
      "id": "gz0dpa1",
      "author": "hummusenthusiasts",
      "body": "My obsession with oatmeal and crackers  will like seem completely bizarre to my future self",
      "created_utc": 1621646990.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gz0gdh3",
      "author": "Mimolette_",
      "body": "I used to really look forward to eating an apple and a protein bar before going to the gym each afternoon (\"earned\" through exercise of course) and now I couldn't care less- I'll often eat a snack before exercise for energy, but don't really care about the eating aspect. Also now sometimes it's an Oreo dipped in peanut butter.",
      "created_utc": 1621648523.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gz0nz7n",
      "author": "lcords13",
      "body": "Mine was 10 calorie jello, I used to get so excited back when I counted that I could reward myself when calories burned being higher than calories eaten with a cup of 10 calorie sugar free jello as “dessert”. I would eat the tiniest bits and slivers of it to savor it. Now I eat jello everyonce in a while but not as a dessert. I am back to eating some cake and ice cream every so often without breaking down.",
      "created_utc": 1621652953.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gz19kuy",
      "author": "Aliinga",
      "body": "I've been cycling through food obsessions. Fruit salad, oatmeal, also pancakes and brownies. I used a pancake mix and just added a scoop of protein powder. Much quicker! But yeah, foods stop being novel all of the sudden when you actually allow yourself to eat them.",
      "created_utc": 1621669242.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gz26tli",
      "author": "amberempyre",
      "body": "My current obsession is with peanut butter and oatmeal. I go to different stores just to find different flavors of each of them and then I mix the peanut butters into the oatmeal based on what types taste best together lmao. It’s the highlight of my day.",
      "created_utc": 1621695199.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gz1ocxm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621683493.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gz8kvtb",
      "author": "The_Saltiest_One",
      "body": "God, the obsession with protein oatmeal back in my ED days was God-awful. I'd literally be craving that stuff all day.\n\nNowadays, I can't even eat oatmeal without gagging. I'd rather eat cardboard than force myself to consume that stuff again.",
      "created_utc": 1621828890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gz2atr5",
      "author": "None",
      "body": "Yeah, I think we were basically the same person!!! Making breakfast was my #1 passion.\n\nLmao some mornings I went for a run before I ate breakfast and I spent the whole run fantasising about my stack of pancakes...God help my past self",
      "created_utc": 1621697333.0,
      "score": 8,
      "context": [
        {
          "id": "gz0g0wf",
          "author": "Sorry-Day-744",
          "body": "I had the same thing but for regular pancakes. I ate a biiig stack of pancakes every morning for months, I'd wake up every night at like 4-5 am half asleep and get annoyed that it wasn't pancake time yet.",
          "created_utc": 1621648326.0
        }
      ]
    },
    {
      "id": "gz8nbvn",
      "author": "greciamarzz",
      "body": "HOLY Shit. For about a year and a half, my husband would take me out for Sunday breakfast to get pancakes from the same restaurant. EVERY SUNDAY. I would wake up Saturday nights unable to fall asleep because I was too excited for my pancakes. Family and friends all think pancakes are like my favorite food/obsession but lately the thought of them makes me feel kinda ill and we haven’t been going nearly as frequently. We still have a 100 gift card that my mother in law gave \n me on my birthday but I keep putting off using it. I feel like I should try something else on the menu but the staff would probably freak out because they know my order by fucking heart and start making it as soon as I walk in the door. They literally probably secretly think I’m fucking crazy for eating the same shit for as long as I have. 😭",
      "created_utc": 1621830544.0,
      "score": 2,
      "context": [
        {
          "id": "gz0g0wf",
          "author": "Sorry-Day-744",
          "body": "I had the same thing but for regular pancakes. I ate a biiig stack of pancakes every morning for months, I'd wake up every night at like 4-5 am half asleep and get annoyed that it wasn't pancake time yet.",
          "created_utc": 1621648326.0
        }
      ]
    },
    {
      "id": "gz0dtkm",
      "author": "hummusenthusiasts",
      "body": "Also OP congrats on being 4 months into all in recovery, sounds like your body and mind are doing much better",
      "created_utc": 1621647061.0,
      "score": 23,
      "context": [
        {
          "id": "gz0dpa1",
          "author": "hummusenthusiasts",
          "body": "My obsession with oatmeal and crackers  will like seem completely bizarre to my future self",
          "created_utc": 1621646990.0
        }
      ]
    },
    {
      "id": "gz0ixz9",
      "author": "edanon1234",
      "body": "CHEESE MEAT AND CRACKERS\n\nLiterally ate that 5+ times/day in recovery wow",
      "created_utc": 1621649990.0,
      "score": 9,
      "context": [
        {
          "id": "gz0dpa1",
          "author": "hummusenthusiasts",
          "body": "My obsession with oatmeal and crackers  will like seem completely bizarre to my future self",
          "created_utc": 1621646990.0
        }
      ]
    },
    {
      "id": "gz1kcdo",
      "author": "Nuitella",
      "body": "oh my god. i live for my morning oatmeal",
      "created_utc": 1621679879.0,
      "score": 3,
      "context": [
        {
          "id": "gz0dpa1",
          "author": "hummusenthusiasts",
          "body": "My obsession with oatmeal and crackers  will like seem completely bizarre to my future self",
          "created_utc": 1621646990.0
        }
      ]
    },
    {
      "id": "gz2eaub",
      "author": "bitch_interrupted",
      "body": "Oreos and peanut butter are SUPER underrated. Also oreos and nutella lol",
      "created_utc": 1621699132.0,
      "score": 4,
      "context": [
        {
          "id": "gz0gdh3",
          "author": "Mimolette_",
          "body": "I used to really look forward to eating an apple and a protein bar before going to the gym each afternoon (\"earned\" through exercise of course) and now I couldn't care less- I'll often eat a snack before exercise for energy, but don't really care about the eating aspect. Also now sometimes it's an Oreo dipped in peanut butter.",
          "created_utc": 1621648523.0
        }
      ]
    },
    {
      "id": "gz29wf0",
      "author": "None",
      "body": "I wouldn’t consider myself fully recovered yet, since my body image is still shit BUT I am weight restored (and beyond) and I’m not gaining weight despite eating around waaaaaay more than “average” since my body trusts me to feed it now.\n\nThis method isn’t for everyone, but I basically just decided to stop exercising and to eat whenever I was hungry/whatever I was craving (people refer to this as going “all-in”). My aim in doing this was 1. To stop being hungry all the time and 2. To regain my passionate personality.\n\nSince I’d been in a calorie deficit for two years, I was starving all the time at first. A lot of people say their hunger settles after the first month but it took me like 2 months just to stop needing >!10,000ish calories!< a day (although I did get my period back after the first month since I’d gained about half the weight back by then) and I’m still eating a lot (though no longer gaining).\n\nA lot of people have a difficult time with this because it requires completely ignoring your ED and trusting that your body knows what it’s doing AND learning to like your body at a higher weight— all of which are insanely hard, so it’s good to have support if you go for it. Personally, I read around 10 recovery books as well as every single recovery blog post I could find, and watched a bunch of Tabitha Farrar’s YouTube videos and that helped me warm up to the idea and challenge preconceived notions I had eg that “thin people are more attractive.“\n\nThe reason “all-in” works is because, as well as restoring the weight you lost which allows for greater clarity of mind, you are wiring your brain to no longer be afraid of weight gain by eating all the foods you were scared to eat previously. In a nutshell, you’re teaching your brain that weight gain is a good thing because you’re going out of your way to gain weight.\n\nOtherwise, there are other great recovery methods so you could look into those too— this is just what worked for me.",
      "created_utc": 1621696843.0,
      "score": 10,
      "context": [
        {
          "id": "gz1ocxm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621683493.0
        }
      ]
    },
    {
      "id": "gz2ajsf",
      "author": "None",
      "body": "Thank you! I completely get you on the oatmeal thing, it’s delicious and I definitely went through an oatmeal phase... I had it with peanut butter, an apple, and a single walnut (dear god) for crunch.",
      "created_utc": 1621697186.0,
      "score": 6,
      "context": [
        {
          "id": "gz0dpa1",
          "author": "hummusenthusiasts",
          "body": "My obsession with oatmeal and crackers  will like seem completely bizarre to my future self",
          "created_utc": 1621646990.0
        },
        {
          "id": "gz0dtkm",
          "author": "hummusenthusiasts",
          "body": "Also OP congrats on being 4 months into all in recovery, sounds like your body and mind are doing much better",
          "created_utc": 1621647061.0
        }
      ]
    }
  ]
}