{
  "id": "njrjkc",
  "subreddit": "fuckeatingdisorders",
  "author": "witchystoneyslutty",
  "created_utc": 1621838568.0,
  "title": "(TW: scales and gaining) Had to weigh myself, felt neutral at the number instead of hating myself",
  "selftext": "My damn cat scared the crap out of me today by eating my toxic houseplant. I needed to know her weight to tell the vet on the pet poison control hotline, so I borrowed my super sweet neighbor’s bathroom scale and weighed myself and my cat, then myself alone to subtract the weights and get the weight of my cat. \n\nI haven’t weighed myself in over a year, and I even turn around at the doctors office to avoid looking at the number. I’m currently struggling to recover from my second bout of anorexia, and I’ve gained a very small amount of weight back over the last month, partially muscle and partially fat. I feel ok about it other than the return of my period. \n\nI’m pleased to report that I felt super neutral when I saw the number on the scale. It wasn’t as low as I expected it to be, which wasn’t quite triggering because I know I NEED to gain weight.  \n\nAnyone else have any experiences or tips about getting over being triggered by numbers/scales?  I feel like it was a huge step for me today to not have that sinking, disgusted feeling when the number on the scale wasn’t as low as my ED wants it to be.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/njrjkc/tw_scales_and_gaining_had_to_weigh_myself_felt/",
  "score": 119,
  "num_comments": 2,
  "comments": [
    {
      "id": "gz9droj",
      "author": "banana-itch",
      "body": "This is so awesome!!! You have made great progress and you can be really proud of yourself <3 you're doing amazing!",
      "created_utc": 1621854111.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gzbt4ff",
      "author": "witchystoneyslutty",
      "body": "Thank you so much!! I’m trying soooo hard😭",
      "created_utc": 1621896727.0,
      "score": 2,
      "context": [
        {
          "id": "gz9droj",
          "author": "banana-itch",
          "body": "This is so awesome!!! You have made great progress and you can be really proud of yourself <3 you're doing amazing!",
          "created_utc": 1621854111.0
        }
      ]
    }
  ]
}