{
  "id": "nkk8a9",
  "subreddit": "fuckeatingdisorders",
  "author": "killhappy0",
  "created_utc": 1621929206.0,
  "title": "wtf",
  "selftext": "i finally told my sister about my eating disorder and i confessed that i haven’t eaten in over 2 days. she acted like she cared then she came in my room asking me if her cheeks look fatter and pulled up her shirt to show me that her stomach got bigger (she’s taking these pills that can cause weight gain). shes 5'6 and 110. she said that the pills are dumb because they’re causing her the gain weight... doesn’t she think about how that might make me feel?? like what the fuck. now i’m crying because i feel even more disgusting than i did before.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nkk8a9/wtf/",
  "score": 89,
  "num_comments": 5,
  "comments": [
    {
      "id": "gzeabgv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621953794.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gzdskzd",
      "author": "Substantial-Aside005",
      "body": "thats the most horrible thing ever. she did that to make herself feel powerful sm how bc she's insecure. ur not disgusting at all honey. tons of hugs for you.",
      "created_utc": 1621944761.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gzdugjp",
      "author": "None",
      "body": "why are some people so fucking mean its just unbelievable. she sounds like she has some serious problems.",
      "created_utc": 1621945885.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gzf93vn",
      "author": "NordicGirl2019",
      "body": "Your sister is an ego-centric narc.  Sorry...the world is full of them.  She is getting off on hurting you.  It is not your fault and really has nothing to do with you.....she just needs a target.  Just take care of YOU....and pray that someday the spirit of empathy and charity may come into her.",
      "created_utc": 1621968694.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gzej4os",
      "author": "weenie-jeanie",
      "body": "Misery loves company and trauma bonding is a hell of a drug. I can just imagine this as a mix of hinting at /the struggle/ and sheer ignorance of ed’s and OPs experiences \n\nOP- my favorite thing to say to people is “That is inappropriate” or “ooooh I’m uncomfortable” you will see who gives a damn + it’s versatile + to the point.",
      "created_utc": 1621957673.0,
      "score": 6,
      "context": [
        {
          "id": "gzeabgv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621953794.0
        }
      ]
    }
  ]
}