{
  "id": "nx34c1",
  "subreddit": "fuckeatingdisorders",
  "author": "sorcerers_apprentice",
  "created_utc": 1623372044.0,
  "title": "My boss brought in donuts today, and I ate one.",
  "selftext": "This is the first time I’ve had non-safe food in over 5 months. I’m freaking out right now and want to skip dinner to compensate.\n\nI could really use some support :(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nx34c1/my_boss_brought_in_donuts_today_and_i_ate_one/",
  "score": 91,
  "num_comments": 7,
  "comments": [
    {
      "id": "h1ck6kw",
      "author": "pbpankeiks",
      "body": "You’re doing amazing, you need to allow yourself to enjoy the things you deprived yourself from having! This is something you enjoy, you wanted and you decided to eat because every day you will get stronger than your ED brain. I promise. I felt like that at the beginning of my recovery and right now I honestly barely care. Only some days when I get really sad about shit that doesn’t matter- because I realize “this doesn’t matter!! it’s just FOOD!” I hope you’re proud of what you did today and you push yourself to keep trying. You are brave and loved ❤️",
      "created_utc": 1623372591.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h1cuawv",
      "author": "ForestRagamuffin",
      "body": "i know today is hard, but you did good by eating that donut. you deserved every last bite of it and your body needed it. likewise, you 100% deserve to eat a full and delicious dinner! the voice in your head saying otherwise is just getting frantic cuz you're fighting back; your ed is desperate to stay in control. you did a powerful thing today and i'm proud of you! 💚",
      "created_utc": 1623377911.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h1csqo6",
      "author": "zedem124",
      "body": "babes i’m so proud of u!!! it’s not easy and you chose to actually enjoy!!! keep it up ❤️❤️",
      "created_utc": 1623377124.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h1cz2dp",
      "author": "StrawberryCow55",
      "body": "everything is going to be okay!! you're so strong for going against your ED, you deserve to enjoy treats no matter what it tells you- and you don't need to skip meals to compensate!! i'm so proud of you <3",
      "created_utc": 1623380463.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h1dgvyc",
      "author": "threadofhope",
      "body": "Maybe sit with the feelings until they pass. \n\nA few months ago, I had a large dessert with my boyfriend. I felt full and I was miserable. I felt like the world was crashing down. But I didn't do anything at all. The fullness passed and I didn't act out using an ED behavior. And then I was so damned proud that I ate a dessert and nothing happened. That was pretty special for me. \n\nMaybe sit with the feelings and let time pass. Maybe you'll see you deserve a gold star and not a punishment.",
      "created_utc": 1623391687.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h1diluz",
      "author": "None",
      "body": "doughnuts are not a replacement for dinner. doughnuts are a snack that you can eat and move on from. \n\nchallenge yourself by eating dinner too, I promise it won't do all the damage you think it will do to your body. you know your fear is illogical, ignoring those fears will not hurt you.",
      "created_utc": 1623393022.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1e88d8",
      "author": "Briannna0",
      "body": "So proud of you for challenging a fearful food, and the guilt along eating it will pass. I hope you had a nice dinner and remember your body needs food at regular intervals to maintain not only your energy and metabolism, but your mental health too. Now I want a donut hehe but I will be making apple crisp today and first I will enjoy that! Cheers to feeding ourselves delicious foods that we deserve to enjoy💗",
      "created_utc": 1623414068.0,
      "score": 5,
      "context": []
    }
  ]
}