{
  "id": "nxdkkk",
  "subreddit": "fuckeatingdisorders",
  "author": "Acanthusm",
  "created_utc": 1623410397.0,
  "title": "when will my boobs return from the war",
  "selftext": "Hey, y'all. Currently in recovery from AN for a year. Pre-ED my chest size was average/above average. Then I dropped weight and it got considerably smaller. Eventually  I decided to recover, but even though I'm almost up to my pre-disorder weight now, my boobs are still very small. I literally went from a D to A cup :( On the bright side my WTH ratio got smaller, so I feel like the disorder changed my body shape and the way fat distributes. Wondering if anyone else has similar experiences?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/nxdkkk/when_will_my_boobs_return_from_the_war/",
  "score": 133,
  "num_comments": 19,
  "comments": [
    {
      "id": "h1efs7s",
      "author": "elijahkibo",
      "body": "The title of this is hilarious, btw.\n\nI had a similar experience with my boobs, though not as big of a change, and they didnt really go back to normal until i started taking birth control again. Ive heard of other afab people though who it takes them a year or two to get them back.",
      "created_utc": 1623418188.0,
      "score": 37,
      "context": []
    },
    {
      "id": "h1ekgc7",
      "author": "metempsychosis99",
      "body": "Upvoted for the title",
      "created_utc": 1623420424.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h1ek3h3",
      "author": "Little_Sal",
      "body": "Same here, still waiting for mine to return from Afghanistanorexia.",
      "created_utc": 1623420259.0,
      "score": 57,
      "context": []
    },
    {
      "id": "h1eutk1",
      "author": "emilylikesturtles",
      "body": "So when I first gained back all my weight, it distributed in very weird places. Which definitely didn't help my dysmorphia lol. I had decently size boobs before, but when I regained initially, I was still a cup smaller and 2 pant sizes larger. After about a year and a half of maintaining (if not gaining about 7 more pounds from my initial weight before dropping) my body decided to reshape itself better and my boobs came back and I went down to my regular pant size. Im not exactly sure why. But I've heard that happening with other people as well. The annoying part is that it takes so goddamn long haha.",
      "created_utc": 1623425059.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h1egfst",
      "author": "Sareeee48",
      "body": "Same thing happened to me, and they only came back with adequate refeeding.",
      "created_utc": 1623418517.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h1ena8j",
      "author": "_Ima_bean_",
      "body": "lmaoo im waiting for mine to come in, im a double A cup (rip) while everyone in my family have very large chests, even my sister whos shorter and younger than me is bigger.\n\nNot complaining, its honestly just hard finding a bra that fits :((",
      "created_utc": 1623421728.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1ey2or",
      "author": "somegenerichandle",
      "body": "For me a smaller chest size was an advantage. I really am not sure if my chest returned because i actually started getting properly sized bras (for when i do occasionally wear them). If your bra size is upsetting you, the system on /r/ABraThatFits tends to make the number >!smaller and the letter larger!< Anyway, weight redistribution can take years once you've regained the weight, so I encourage some patience.",
      "created_utc": 1623426488.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h1fb5c3",
      "author": "doomer1111",
      "body": "Same. I don’t fit into any of my bras. Went from a C cup to probably AA (if that’s even a size?)",
      "created_utc": 1623432145.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h1g6ahx",
      "author": "gingerarsehair",
      "body": "Sometimes for a while in recovery your body is a bit funny and stores fat in your belly rather than other places but it usually evens out over time. If it's worth anything I've had the same experience, going from a B cup to an AA and never going back lol. I say embrace the small tiddies, at least we won't have to worry about back pain",
      "created_utc": 1623445993.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1gtn0j",
      "author": "bigdaddytexas420",
      "body": "I was anorexic since age 13 and always had tiny a cups until I recovered. Now I have D cups and everyone always asks me if they’re fake smhh. I also found out I had a big butt when I recovered and gained weight. Weight gain will def make them grow again I wouldn’t worry",
      "created_utc": 1623458598.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1fhdbg",
      "author": "Iamfat123",
      "body": "I was literally stressing about the same thing a couple days ago omg. ;-;-;-;\n\nMad relatable. I hope we get our biddies back",
      "created_utc": 1623434873.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1eyibe",
      "author": "somegenerichandle",
      "body": "For me a smaller chest size was an advantage. I really am not sure if my chest returned because i actually started getting properly sized bras (for when i do occasionally wear them). If your bra size is upsetting you, the system on /r/ABraThatFits tends to be a whole new size, so that may alleviate your feelings that you need to get back to a certain size. Anyway, weight redistribution can take years once you've regained the weight, so I encourage some patience.",
      "created_utc": 1623426674.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1gcme2",
      "author": "newprofilewhodis1352",
      "body": "I never had big boobs. I’m two ish years into recovery. My boobs used to be TINY. Gained weight and it took a while I think because of fat redistribution but now they’re enormous compared to what they were… but still considered small lmao. I never thought my boobs would be as big as they are now tho, and it’s the only reason I don’t want to lose again when I feel like I want to restrict.",
      "created_utc": 1623449037.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1fcgg4",
      "author": "None",
      "body": "As a man who’s seen a large bump in chest size after all this...can I borrow your bras?",
      "created_utc": 1623432711.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h227qct",
      "author": "None",
      "body": "They take a while, I find they're one of the first things to go and last to return. Recent stress has seen me drop like 5kg and that was enough to drop a cup size. Building the muscles under can help though.",
      "created_utc": 1623911544.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1er7dz",
      "author": "Acanthusm",
      "body": "I've honestly considered start taking BC again solely for this reason lol. I stopped years ago because it gave me some nasty mood swings. :/",
      "created_utc": 1623423456.0,
      "score": 9,
      "context": [
        {
          "id": "h1efs7s",
          "author": "elijahkibo",
          "body": "The title of this is hilarious, btw.\n\nI had a similar experience with my boobs, though not as big of a change, and they didnt really go back to normal until i started taking birth control again. Ive heard of other afab people though who it takes them a year or two to get them back.",
          "created_utc": 1623418188.0
        }
      ]
    },
    {
      "id": "h1f2kmz",
      "author": "evacia",
      "body": "absolutely",
      "created_utc": 1623428435.0,
      "score": 7,
      "context": [
        {
          "id": "h1ekgc7",
          "author": "metempsychosis99",
          "body": "Upvoted for the title",
          "created_utc": 1623420424.0
        }
      ]
    },
    {
      "id": "h1epz5o",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1623422915.0,
      "score": 38,
      "context": [
        {
          "id": "h1ek3h3",
          "author": "Little_Sal",
          "body": "Same here, still waiting for mine to return from Afghanistanorexia.",
          "created_utc": 1623420259.0
        }
      ]
    },
    {
      "id": "h1fm5iy",
      "author": "Iamfat123",
      "body": "I've been praying every night 😭😭😭",
      "created_utc": 1623436996.0,
      "score": 7,
      "context": [
        {
          "id": "h1ek3h3",
          "author": "Little_Sal",
          "body": "Same here, still waiting for mine to return from Afghanistanorexia.",
          "created_utc": 1623420259.0
        },
        {
          "id": "h1epz5o",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1623422915.0
        }
      ]
    }
  ]
}