{
  "id": "o027su",
  "subreddit": "fuckeatingdisorders",
  "author": "jengamonsoon",
  "created_utc": 1623720170.0,
  "title": "Recovery - Coping with thigh weight gain (loss of thigh gap)",
  "selftext": "TW possibly triggering talk about thigh gaps\nHey guys\nI’ve been in an outpatient recovery program for 6 weeks now, and i’ve gained quite a bit of weight. My outlook has been improving and i feel my relationship with my body has been getting better\nexcept for one part - my thighs\nbefore recovery, i had an almost thigh gap. I was really happy with my thighs, and there was only a tiny bit at the top that touched, but i didn’t care because it didn’t rub together. the skin around my knees would brush past eachother but my thighs wouldn’t touch (or they’d only barely)\nbut since i’ve began recovery, every stride i take my thighs rub together\ni cannot walk without being reminded of my weight gain. and i cannot wear leggings because my area is in the middle of a heat wave and, yknow, summer\neven around the house in my lounge shorts i can’t relax\nit’s a CONSTANT REMINDER, and honestly just generally feels extremely unpleasant. I can let go of my collarbones and ribs and waist but losing my thigh gap feels like a different kind of evil - the physical sensation of having it gone feels like hell. And i don’t know how to get used to it. It’s hard to recover when taking a step is a trigger. Does anyone have any advice? has anyone experienced this?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o027su/recovery_coping_with_thigh_weight_gain_loss_of/",
  "score": 90,
  "num_comments": 10,
  "comments": [
    {
      "id": "h1swu62",
      "author": "squareCat99",
      "body": "I had the exact same issue - my thighs rubbing was the first change in my body that I really noticed and it was pretty upsetting.  That being said, it passed pretty fast.  Wearing lose pajama pants around the house helps a lot, and cropped leggings or bigger jeans helped when I’m going out.  It won’t bug you forever, just like everything else you get used to it.  \n\nI’d also recommend you examine why it freaks you out so much - for me, it was the first real sign I would actually gain weight and it forced me to confront all the negative things I associated with being bigger.",
      "created_utc": 1623722730.0,
      "score": 55,
      "context": []
    },
    {
      "id": "h1swj41",
      "author": "Redrose12345678",
      "body": "your body needs that weight there! it is thanking you for giving it the nutrition it needs to thrive. instead of thinking of it as a punishment, think of it as a trophy for taking a step towards being the healthiest version of you. lots of love you got this!",
      "created_utc": 1623722569.0,
      "score": 25,
      "context": []
    },
    {
      "id": "h1tb23v",
      "author": "stonebitchblues",
      "body": "yep, i used to be really bothered by the same thing. it takes a while to feel okay with, since it's a) a new sensation and b) an old fixation. you might not ever be as happy with your thighs (that's the mental illness talking), but eventually it stops mattering",
      "created_utc": 1623730896.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h1ts5eg",
      "author": "lasaucerouge",
      "body": "There’s no secret trick to getting used to it; just time. Focus on distracting yourself and halting any rumination/repetitive thoughts about it. \n\nI’m guessing you’re in therapy as part of your program anyway? So they might help you with some techniques specifically for you, but in the meantime what helped me (and still does) is just telling myself out loud to stop thinking about whatever my mind is obsessing over and go do something else. So I literally say ‘Quit it (my name), go get on with the laundry’ or whatever. There’s a science reason why this works, but I forget what it is because it’s been so long since I learned it! \n\nYour body will get used to any new sensations, and you’ll find it easier and easier to stop focusing attention on them. Breaking the cycle is really hard in the beginning but doing the hard work now is going to really pay off later. Youve got this.",
      "created_utc": 1623744763.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h1txay7",
      "author": "None",
      "body": "it sounds like we had the same body type, before and after recovery.\n\nI have always worn bicycle shorts under my outfit to prevent my thighs touching, even when I was thinner because I suffered sever burns a few years ago and the feeling of that damaged skin touching (even when just sitting down) almost gave me mild PTSD and it would remind me of that injury.\n\nthis has had the inadvertent effect of helping me ignore my leg weight gain because I can't feel my legs touching. so when I walk or sit down and have my legs touching, I can't feel it at all.\n\nhowever, I'm at a point now that not wearing the shorts is pretty unbearable, because I'm essentially dependant on them to cope with the trauma. so I don't recommend wearing them all the time, maybe just try having a extra layer when you go out and allowing yourself to sit with that uncomfortable feeling when you're at home? I don't find myself getting too hot wearing them in the summer.",
      "created_utc": 1623749836.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h1sti3w",
      "author": "Peanut2ur_Tostito",
      "body": "I was thinking the same the other day. I went to the store & could feel my thighs touch as I walked. I'm so disappointed in myself.",
      "created_utc": 1623720994.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1u3m4l",
      "author": "Scary-Part-7714",
      "body": "if it makes you feel any better thigh gaps just look kinda creepy anyway lmao having thigh fat is normal, for me working out made me feel better because i knew i was healthy and the thigh rubbing didnt mean i was fat it was just how i was built just dont workout excessively. you'll probably get used to it its just a new change",
      "created_utc": 1623755468.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1vwph4",
      "author": "None",
      "body": "I saw a funny video on TikTok saying that if you were subject to the tumblr thigh gap craze years back you should be entitled to financial compensation.. but in all seriousness, it’s just an inevitable part of this. Fluttery shorts are a blessing to help keep it airy down there and also to give you a barrier to avoid uncomfortable rubbing. Congrats on your progress and hang in there <3",
      "created_utc": 1623786749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h225djt",
      "author": "None",
      "body": "I hated that part, always hated my thighs but at stick thin I finally liked them. One thing that got me past that was finally being able to hold/sit things between my legs. Losing stuff on my lap and dropping things I put there to hold was the one thing that drove me nuts so I just focused on that and that kept me going until I didn't really notice them any more. Sure I don't wear short shorts any more but I also have a cycle and aren't constantly freezing to death so it's a trade-off I can live with.",
      "created_utc": 1623909673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1ujxg1",
      "author": "petitelinotte212",
      "body": "I agree, use this as a jumping off point to examine the things you fixate on, like your thighs. What did having a thigh gap *mean about you* that you're afraid won't be true anymore? Where does that fear come from? The more curious you are about your disordered thoughts, the more you will be able to look at them objectively and show yourself some compassion.",
      "created_utc": 1623765455.0,
      "score": 6,
      "context": [
        {
          "id": "h1swu62",
          "author": "squareCat99",
          "body": "I had the exact same issue - my thighs rubbing was the first change in my body that I really noticed and it was pretty upsetting.  That being said, it passed pretty fast.  Wearing lose pajama pants around the house helps a lot, and cropped leggings or bigger jeans helped when I’m going out.  It won’t bug you forever, just like everything else you get used to it.  \n\nI’d also recommend you examine why it freaks you out so much - for me, it was the first real sign I would actually gain weight and it forced me to confront all the negative things I associated with being bigger.",
          "created_utc": 1623722730.0
        }
      ]
    }
  ]
}