{
  "id": "o184wm",
  "subreddit": "fuckeatingdisorders",
  "author": "izixpizi",
  "created_utc": 1623858947.0,
  "title": "My dad shames me for eating ensure",
  "selftext": "I am diagnosed with ARFID, a type of eating disorder characterized by restrictive food intake (and in my case, a general lack of interest in food- I just do not experience hunger so it’s hard for me to eat).\n\nDuring my recovery process I was prescribed the eating supplement ensure (a drink packed with calories and nutritions). By doctor orders, I am to take it between meals and as a supplement when I can’t bring myself to eat food. \n\nI only started taking it the last couple of months, but almost EVERY TIME I drink it this asshole straight out scolds bc eating “junkfood” and “candy” is not real food?? \nHe straight out threatened to stop buying it for me as a punishment one time, and cherry on top called me an “incapable toddler” for relying on it. \n\nLike bruh",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o184wm/my_dad_shames_me_for_eating_ensure/",
  "score": 112,
  "num_comments": 13,
  "comments": [
    {
      "id": "h1zgyp1",
      "author": "None",
      "body": "he's a dick. drinking it is saving your life. \n\nany food is better than no food, always.",
      "created_utc": 1623861153.0,
      "score": 72,
      "context": []
    },
    {
      "id": "h1zvfto",
      "author": "petitelinotte212",
      "body": "Talk to your doctor, and ask them to call your father and have a chat. Seriously, doctors have to do this with recalcitrant parents all of the time, sadly. \n\nThen after that, you can feel free to tell him to fuck off with his comments, as he knows better now but is simply choosing to be cruel. Ugh, I'm so sorry your Dad is such a douche. My father was also a real asshole during my ED and it pretty much led to our relationship crumbling for many years. We've since made amends, but its still a sore area for me. Parents are just people, unfortunately, and they carry the same prejudices and dysfunction as everyone else.",
      "created_utc": 1623867366.0,
      "score": 45,
      "context": []
    },
    {
      "id": "h20bw2l",
      "author": "DoorEmotional",
      "body": "I’m pregnant rn and I was losing so much weight (we never did find out why) but my doctor told me to start drinking ensure. My boss at work kept giving me shit until I mentioned it to my doctor and she called up my work- he never once tried to make fun of me or discourage it again. Now I don’t need ensure and I’m gaining weight as I should. \n\nI’m proud of you. Keep doing what you need to do.",
      "created_utc": 1623874423.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h1zjms8",
      "author": "Sareeee48",
      "body": "Ew, abusive dads are extremely gross. I’m so sorry, I wish you had someone more supportive. :(",
      "created_utc": 1623862294.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h20dhcj",
      "author": "grotesquegoblinoid",
      "body": "He’s literally insane & needs to leave you alone & realize ensures are healthier than a lottttt of things. And adults drinking them is normal I have like 2 boxes of those rn",
      "created_utc": 1623875121.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h20dhu3",
      "author": "None",
      "body": "I'm sorry you're dad is abusive 😔 his words are meaningless, you're drinking ensure to fuel your body so you can live your life. For whatever reason, that threatens him. Maybe it's a loss of control over you? Regardless, it's no reflection on you or the morality of drinking ensure to obtain your calories. You're doing good 💕",
      "created_utc": 1623875127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h21b7qj",
      "author": "hemlock_cupcakes",
      "body": "May I ask you age and nationality?",
      "created_utc": 1623891938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h22fhmq",
      "author": "Pizzacanzone",
      "body": "wow, I wonder what your eating disorder stems from. Damn.",
      "created_utc": 1623918473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h25o0xb",
      "author": "PrimPup",
      "body": "I also have disinterest ARFID and my family also shames the supplements I drink for being \"unhealthy\". I remind them that not eating anything is much more unhealthy than the ensure. It has also been eyeopening re: how disordered they are themselves and how they impose their disorder on me. Sounds like you're doing great, don't let them deter you from recovery.",
      "created_utc": 1623977512.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2vjvet",
      "author": "BittersweetDreams420",
      "body": "I struggle with ARFID too and last week I tried ensure. The first 4/6 bottles went fine, I only had a sore throat and thought it was from other things. Yesterday I had one and had an allergic reaction. Just keep an eye out on any side effects.",
      "created_utc": 1624536242.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h22k9u5",
      "author": "ismokecusitlookscool",
      "body": "Unless it has laxative effects...",
      "created_utc": 1623922244.0,
      "score": -4,
      "context": [
        {
          "id": "h1zgyp1",
          "author": "None",
          "body": "he's a dick. drinking it is saving your life. \n\nany food is better than no food, always.",
          "created_utc": 1623861153.0
        }
      ]
    },
    {
      "id": "h20vy39",
      "author": "DisabledMuse",
      "body": "Seconded. I have had to have my doctor call and explain things to my mom on my health problems as he kept insisting I was being lazy and not just chronically ill. It makes a huge difference when the information comes from an official.\n\nARFID is a pain in the butt. Some specialists can help with getting creative with meals or training yourself (slowly) to expand what food you can eat.",
      "created_utc": 1623883866.0,
      "score": 8,
      "context": [
        {
          "id": "h1zvfto",
          "author": "petitelinotte212",
          "body": "Talk to your doctor, and ask them to call your father and have a chat. Seriously, doctors have to do this with recalcitrant parents all of the time, sadly. \n\nThen after that, you can feel free to tell him to fuck off with his comments, as he knows better now but is simply choosing to be cruel. Ugh, I'm so sorry your Dad is such a douche. My father was also a real asshole during my ED and it pretty much led to our relationship crumbling for many years. We've since made amends, but its still a sore area for me. Parents are just people, unfortunately, and they carry the same prejudices and dysfunction as everyone else.",
          "created_utc": 1623867366.0
        }
      ]
    },
    {
      "id": "h22rrox",
      "author": "None",
      "body": "what does that have to do with absolutely anything i said?",
      "created_utc": 1623928331.0,
      "score": 6,
      "context": [
        {
          "id": "h1zgyp1",
          "author": "None",
          "body": "he's a dick. drinking it is saving your life. \n\nany food is better than no food, always.",
          "created_utc": 1623861153.0
        },
        {
          "id": "h22k9u5",
          "author": "ismokecusitlookscool",
          "body": "Unless it has laxative effects...",
          "created_utc": 1623922244.0
        }
      ]
    }
  ]
}