{
  "id": "o19wb4",
  "subreddit": "fuckeatingdisorders",
  "author": "thingsivegottenridof",
  "created_utc": 1623863474.0,
  "title": "1 year in recovery",
  "selftext": "When I was just out of college I confided in a l coworker who was slim that I was frustrated with my weight. Even at the time I thought she kind of was a mess, but hey: she was thin, and in my disorder, worth asking for advice from because of it.\n\nShe told me some of her tips to lose and maintain her weight—involved a lot of ziplock bags—and she left me with, “You’ll figure it out by the time you’re 30.”\n\nWell, I’m 30. I hit 1 year in recovery recently. I have had disordered eating habits since I was 7. Here’s where I’m at.\n\nNot too long after posting my review for 6 months I ended up having a panic attack about the whole process. I had to take to bed for two days, watch videos online, and order in a bunch of take out while aching. I got through it. So often the answer seems to be to just keep keeping on. In fact, so much of this entire process has surprised me in its parallels to handling and combating my anxiety—oh, you’re scared of that? Do it. Can you do it again with less fear? Can you create boundaries where appropriate, push through in the ways you need to to live your life?\n\nI began having so many odd physical symptoms that I put a moratorium on stressing out about them they came on and left so fast.\n\nFor two weeks my privates smelled horrific for no reason I could discern. Fun.\n\nFor another two weeks my elbows had a dull, consistent pain in the joint. Why my elbows, and why then?\n\nI gained more stretch marks, this time on my left inner bicep. They were deeper and scarier than the ones on my right. Why? Why did they begin to ache a month later?\n\nOne terrifying day my pee smelled sweet, and then the next day it didn’t, and it hasn’t again since. What did I eat that made that happen?\n\nMy energy improves, and then degrades. A weekend is spent on the couch barely moving. Feet swell, then dissipate, then swell again. One day the bloat on my stomach went down really significantly—then it was back to pregnancy belly by the end of the day. I am discovering, over and over again, how early on 1 year really is for me.\n\nLots of things are worth pointing out as improvements, though. My joints don’t crack in the way they used to. I remember at one point getting up from my desk about a year and a half ago and hearing three distinct, loud cracking noises break out across the quiet office space I was working in. It was intense, and kind of gross. This doesn’t happen as much.\n\nThe TMJ that set in “permanently” (one click each side per mouth open) at the beginning of my last and final restrictive episode four years ago is lessening in severity substantially. In early 2020 it had worsened to the point that I popped both sides of my jaw multiple times to open my mouth fully, and sometimes this would give me a shock of excruciating pain. Now, it’s only on one side, and it’s a dull pop. I hope to make a full recovery from this, but I’m willing to be patient. I remember when this first set in how furious was—it was so annoying, so frustrating, and then… I got used to it. It’s incredible how we can normalize pain for evolutionary reasons, but it also shows how dangerous our EDs really are. It was very, very bad for me to have normalized that pain. It was very, very bad that I normalized my hunger.\n\nI continue to mostly have good poops. Occasionally I’ll get constipated (and when it happens my mood definitely dips) but for the most part I have at least one good poop a day. I don’t have the chonkers I did at the beginning of this process, but I’m still weirdly proud of all of them, and the fact that I poop at all. I sometimes admire them as a marker of how far I’ve come.\n\nIn February I realized I looked tan. Not because I was, but because my skin was less shallow. I had gotten used to it being somewhat gray, and it being not-gray was a shock, even in the middle of winter. The feeling continues into summer. I had taken my paleness at face-value, never assuming that a slightly deeper color was perhaps my more natural state.\n\nMy extreme hunger let up at 10 months. At first I didn’t have much to say about this, but I realize over and over again how shocking it is to feel full. I haven’t, didn’t, never felt full—I was always using willpower to stop. Now I just stop because I don’t want more, and it’s still surprising how easy and natural it is. I stop at odd points in meals–not, “when the plate is empty”, or, “when the person across from me is done”, but… when I don’t feel like any more. It’s so natural, perhaps, that I suspect I’ll lose this feeling of awe over the whole thing before I have any right to. I stop at weird points—there will be a bite and a half left of something, and I’ll just be done. That said, I still eat a lot. I probably eat a normal amount, but it feels like a lot because for so long, I didn’t eat enough. My brain is still trying to catch up.\n\nMy body seems to have stopped/slowed gaining around 6-10 months. The stretch marks on my legs I wrote about at month 6 continue to fade, although they are still prominent, and there are new ones on my inner biceps. They look worse on the backs of my legs than the front. I gained a great deal with a “normal” starting weight, likely more than twice what I ever lost. It is uncomfortable, but I still trust the process, trust in a future where I feel less uncomfortable.\n\nI see the numbers people post here sometimes with a wizened cynicism. There will always be someone in a worse boat, someone for whom what you are going through would be infinitely preferable to what they are going through, and there is comfort in that even for me.\n\nI realized that the extreme water retention in my upper thighs and face dissipated at some point, although I noticed it in month 10. This isn’t to say I don’t have water retention and/or bloat (I definitely do), but simply that the puffy, angry retention that caused my skin to appear red has faded and I’m left with “regular” recovery retention. My belly, for example, is still the “pregnancy belly” and my breasts seem to just sit on it, causing a lot of uncomfortable sweat throughout the day.\n\nI began having weird dreams in month 11. I’d be on my way to class, but couldn’t get there because I needed to organize my dorm first. I’d try to drive to the airport, but would get stuck on the bridge with a boat passing through, needing to wait. I wanted to be elsewhere, but circumstances would always dictate I stay, however frustrated I was.\n\nI still experience the aches in my legs that onset around month 4. I can still run out of breath easily doing simple stuff. I will think I have improved, and then it will get worse again. It’s all so slow that it’s hard to tell. My energy continues to be low generally. I struggle with my energy levels not matching the ambitions I have for my favorite energy-heavy hobby. I’m both bored and tired, and need a lot of sleep. [I still lack shape.](https://edinstitute.org/paper/2012/11/23/phases-of-recovery-from-an-eating-disorder-part-5#_edn17) I am still comparatively very large to past-me and often ruminate on this process and my body. I still experience anxiety when thinking about attending large gatherings of people I haven’t seen in a long time. So, I make myself go. It’s never as bad as I think it will be. I survive, keep on.\n\nMany aspects of this have been lonely for me. It’s a relatively unique and uncomfortable experience. I think most people string along mildly disordered habits off and on until they die, or never started them in the first place. I seem to only know people in the first category, which is frustrating because finding people who eat “normally” is a suggested component of the recovery process and my two options seem to be my teenage brother who I don’t live with and my dog. I get frustrated I have to go through this at all. I hope very dearly it will all let up. I suffer from the idea that it will be different for me, it won’t happen for me, that the pain and edema and exhaustion are forever permanent. I know logically that’s unlikely. I queue up recovery podcasts and let the same facts and calm assurances wash over me, again and again.\n\nI gained a lot of weight publicly and without explanation. I don’t think I owe anyone an explanation, but it sucks that I don’t even feel I have the wherewithal to properly give one. Too few would understand, and I worry about debating causing a relapse. With close friends I haven’t seen in a while I’ll sometimes try and broach the topic to test the waters, and more often than not they’ll begin telling me about their latest diet. It’s shocking how progressive and avant-garde “eating what you want, how much you want, when you want” is in the broader culture I’m in. It’s lonely knowing that the repercussions for following that common sense after long periods of not will be dramatic and confusing and garner looks. I wish this process could be a physiological one instead of a psycho-societal-cultural one. But it is what it is, so I trudge on.\n\nIt’s tough that my energy levels are so low, and people around me don’t understand. Many people I know are vaccinated and want to do fun things, go fun places, and I’m physically not ready. I’m tired.\n\nAt various points I’ve cried a lot. I am often frustrated and delicate, or perfectly peachy—it’s hard to know which it will be. I feel like a large baby when I sit and it can make me upset. I sometimes wish I could be coddled and taken care of, but I am mostly recovering alone. It’s yet another frustration I have—how poorly life is set up for being very sick despite chronic illnesses being a fact of life. I am both very lucky and grateful that a full recovery should be possible for me and really fucking pissed that I am currently sick, and that healing takes time it does. Recovery is, continues to be, an exercise in my patience.\n\nI am trying to get used to the sight of my body, which has been tough. I think when our eating disorder is most threatened, it screams the loudest. I’m dealing with the mental schism that comes from caring so, so deeply about one thing for so long—thinness—and then pointedly, purposefully saying that it does not matter, it will not matter, I will do what I need to achieve my recovery without it mattering, it needs to not matter. I think I would cry if I had cancer and knew that no outcomes were certain, and that healing would take years. That’s what ED recovery is, is it not? No real certainty, and years in the process. I honestly feel sometimes as if I am only ⅓ ways in at the year mark. But who can know? I think the worker bees in my body do, but they’re not sharing their secrets. And that alone can bring me back down from the despair. I don’t know where I’ll end up, but I know I’m going there, and that’s what I get, and that alone has to be enough. A small part of me has always wanted to be there, has always known I would be happy there, if I could just get to it.\n\nThere are glimpses of normalcy. I didn’t write for five years. It was like the spigot of creativity was swallowed by my calorie tracker until I felt I had nothing to say anymore. Now I seem to write incessantly.\n\nSometimes, my partner and I will be watching something, or talking about something, and something funny will happen, and I laugh like the fat mouse in Cinderella—gleefully, loudly, with abandon. Nothing was truly funny for so long that these episodes feel like untamed emotional spills. I am so lucky to be able to laugh again.\n\nI meet my neighbors on the street walking my dog, and instead of being annoyed that they’re curious about her, I feel patient. I have nice conversations with strangers, and see people who, even though I’m an adult, and it’s hard to make friends as an adult, that I could imagine being friends with. I see potential paths in my future a little more clearly. The uncertainty feels less scary, more like possibility.\n\nI’ve thought a lot about my disorder, how I ended up in my predicament. I blame no one while looking at a whirlwind of circumstances that created, in my opinion, the perfect storm. I am happy, though, that the learnings I take into my future are simple—whatever happens in the future, I must keep eating when I am hungry, eating what I want, when I want, and eventually this will be my past.\n\nIn April I visited my grandmother with my shrinking mother, my too-thin sister. I got the confused once-over that every woman in my family tries and fails to do subtly with me. Conversation was light. I asked my grandmother after a chat about food what her favorite sandwich was. My mother interjected before she had a chance to respond that, “Mother doesn’t like sandwiches. As long as I can remember lunch has either been a salad, or a pretzel with mustard.”\n\nAnd there it was, in the silence that followed. Our rotted inheritance. Three generations of women who had spent their entire lives trying to make themselves as small as they possibly could. How far back did it stretch, I wondered? Of all the legacies one could have, was this mine? Had any of us achieved the goal in the way we wanted, or was it a fool’s errand from the get-go?\n\nIn that small sitting room there was a buzzing, an emanation. It was a feeling that used to propel me to restrict a little harder, push myself a little more, chastise more strictly, fall apart over my scale more dramatically as fuel for tomorrow. The anxious energy to not stop moving, and it rose and suffocated the room, distortions of the cultural learnings that kept all of us in that room trapped.\n\nMe, in my new casing, a small island. With this as our birthrights, can we get better?\n\nI have my answer for myself. If that’s all I will ever get, I will be grateful. I am like an inlet that is developing off of the river, a slight refuge from getting swept away. The difference between reaching dry ground and drowning.\n\nA common refrain here is that eating disorders will kill you. I don’t wish to refute it, but I propose an alternate scenario for your consideration, one in which you do not get better, one in which you stay alive until your old age. You string along attempting to stay as small as you possibly can, hating yourself more vehemently as your biology fights you, having been alive but in some ways never having lived. A life which you spent in flight and fear over the time spent alone in your bathroom, over the food in your cabinet, over the numbers attached to the clothes on your back. A life without a favorite sandwich, perhaps.\n\nWe went to Panera afterward for lunch, which I hadn’t realized meant only unsweetened iced tea until after I’d ordered a full meal. I wasn’t super hungry, but it was lunchtime, and I wanted to not be hungry on the long ride home, and I wanted to see my family a little longer. My mother ended up taking all of my potato chips after I said I’d be happy to share, and my sister ended up eating half of my sandwich after complaining about being cold in beautiful 80 degree weather. I felt like I was feeding hungry cats, but I didn’t mind. As I got into my car to leave them I reflected on how I had food at home, food I was allowed to eat it. Even though I am fat, and they are not. We all deserved to eat, but I was the one who would.\n\nAround the same time that I confided in that one coworker, I got a fortune out of a fortune cookie that said, “You will make many changes before settling down happily.”  It’s been 7 years since I taped that small slip of paper to my desk. It’s been over two decades since I began feeling I was wrong, too large. I’m 30. I’m making many changes.\n\n[6 Months in Recovery](https://www.reddit.com/r/fuckeatingdisorders/comments/l9wits/6_months_in_recovery/) | [15 Months in Recovery](https://www.reddit.com/r/fuckeatingdisorders/comments/pzij8m/15_months/)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o19wb4/1_year_in_recovery/",
  "score": 81,
  "num_comments": 11,
  "comments": [
    {
      "id": "h1zxhkp",
      "author": "tinylil",
      "body": "This was beautiful. Thank you for sharing. I teared up reading about the dynamic between the women in your family - so much of it resonated with me, though the conversations and topics are different the theme is the same. I have a feeling your words are going to stick with me and I’ll be thinking about them later.",
      "created_utc": 1623868249.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h21gx34",
      "author": "allinspite",
      "body": "This is a very powerful and well written piece! I wish something like this could be available for more people to read because I feel like it explains a lot about eating disorders in general.",
      "created_utc": 1623895050.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h22fzgv",
      "author": "eaklv",
      "body": "Gosh, this had me so emotional. You write beautifully! \nI related to a lot of what you've written. I was so unwell during my eating disorder that I didn't really hold off during recovery, my body didn't really give me a choice. I gained an ungodly amount of water weight in the first few months and it was horrible to go out in public in such a state when I was so underweight before. People I knew definitely gave me some weird looks, but it was very apparent that I had been struggling with an ED for years so I think it was understood without speaking what was happening. \n\nI didn't really stick with recovery properly, I relapsed more often then I truly committed to it because of a lot of the things you wrote about. I've been dealing with bulimia and anorexia since I was 17 and I'm 27 now so I know true recovery will take a lot of work in my case. But I can say at this point right now I'm doing a lot better. If I relapse for a little while I pick myself up where I left off with recovery. \n\nI have a hard time letting myself \"just eat what I want\" because I'm just not mentally there yet, I did do it in the beginning when reactive eating gave me no say in the matter, but I'd rather eat enough but not too much right now as it keeps me eating consistently without compensation to feel better about it. I feel unable to give up full control but I'm hoping at some point to get there.\n\nThanks for writing this, it was the most relatable recovery post I've read. Good luck with the rest of your recovery journey and go live the best life you can♥️♥️",
      "created_utc": 1623918948.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hsiiw96",
      "author": "onlythisfar",
      "body": "I know I'm...really incredibly late here but this is all just. Very well written, which I say because I don't know what else to say. It isn't all happy and it isn't all unhappy...it's just real and I really love that.",
      "created_utc": 1642096411.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h208r8u",
      "author": "schrodigender",
      "body": "❤️❤️❤️❤️❤️",
      "created_utc": 1623873078.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h21tiwk",
      "author": "heathbar1318",
      "body": "Thank you for sharing something so vulnerable, this resonated with me as well and I’m grateful for your words. Wishing you the best 💕",
      "created_utc": 1623901774.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kqndeby",
      "author": "ProfileFit5797",
      "body": "Your writing is absolutely incredible and speaks in so much resonance to my own journey, thank you for sharing. 🤍 I'm over a year in, after 14 years of living with one. The illness was hard, but recovery was harder. Trusting our bodies to take the lead after years of controlling them made no sense to my mind up until a couple of months ago. Full surrendering and acceptance has been an everyday practice. The only way out is through! How are you feeling now? Hope you've found your peace, your true self and the comfort of finally feeling at home in your body, knowing it was always on your side. God bless you! 💕",
      "created_utc": 1708061805.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h20c4ky",
      "author": "thingsivegottenridof",
      "body": "💓",
      "created_utc": 1623874527.0,
      "score": 3,
      "context": [
        {
          "id": "h1zxhkp",
          "author": "tinylil",
          "body": "This was beautiful. Thank you for sharing. I teared up reading about the dynamic between the women in your family - so much of it resonated with me, though the conversations and topics are different the theme is the same. I have a feeling your words are going to stick with me and I’ll be thinking about them later.",
          "created_utc": 1623868249.0
        }
      ]
    },
    {
      "id": "h23owv8",
      "author": "thingsivegottenridof",
      "body": "I hope you’re able to do what you need to. We deserve to get better, regardless of the size of the body we end up in.",
      "created_utc": 1623945283.0,
      "score": 4,
      "context": [
        {
          "id": "h22fzgv",
          "author": "eaklv",
          "body": "Gosh, this had me so emotional. You write beautifully! \nI related to a lot of what you've written. I was so unwell during my eating disorder that I didn't really hold off during recovery, my body didn't really give me a choice. I gained an ungodly amount of water weight in the first few months and it was horrible to go out in public in such a state when I was so underweight before. People I knew definitely gave me some weird looks, but it was very apparent that I had been struggling with an ED for years so I think it was understood without speaking what was happening. \n\nI didn't really stick with recovery properly, I relapsed more often then I truly committed to it because of a lot of the things you wrote about. I've been dealing with bulimia and anorexia since I was 17 and I'm 27 now so I know true recovery will take a lot of work in my case. But I can say at this point right now I'm doing a lot better. If I relapse for a little while I pick myself up where I left off with recovery. \n\nI have a hard time letting myself \"just eat what I want\" because I'm just not mentally there yet, I did do it in the beginning when reactive eating gave me no say in the matter, but I'd rather eat enough but not too much right now as it keeps me eating consistently without compensation to feel better about it. I feel unable to give up full control but I'm hoping at some point to get there.\n\nThanks for writing this, it was the most relatable recovery post I've read. Good luck with the rest of your recovery journey and go live the best life you can♥️♥️",
          "created_utc": 1623918948.0
        }
      ]
    },
    {
      "id": "hsindrt",
      "author": "thingsivegottenridof",
      "body": "So glad it helped. I hope you’re doing well.",
      "created_utc": 1642098054.0,
      "score": 3,
      "context": [
        {
          "id": "hsiiw96",
          "author": "onlythisfar",
          "body": "I know I'm...really incredibly late here but this is all just. Very well written, which I say because I don't know what else to say. It isn't all happy and it isn't all unhappy...it's just real and I really love that.",
          "created_utc": 1642096411.0
        }
      ]
    },
    {
      "id": "kqndgrd",
      "author": "ProfileFit5797",
      "body": "Ps you should write a book! ☺️",
      "created_utc": 1708061843.0,
      "score": 1,
      "context": [
        {
          "id": "kqndeby",
          "author": "ProfileFit5797",
          "body": "Your writing is absolutely incredible and speaks in so much resonance to my own journey, thank you for sharing. 🤍 I'm over a year in, after 14 years of living with one. The illness was hard, but recovery was harder. Trusting our bodies to take the lead after years of controlling them made no sense to my mind up until a couple of months ago. Full surrendering and acceptance has been an everyday practice. The only way out is through! How are you feeling now? Hope you've found your peace, your true self and the comfort of finally feeling at home in your body, knowing it was always on your side. God bless you! 💕",
          "created_utc": 1708061805.0
        }
      ]
    }
  ]
}