{
  "id": "o6kolq",
  "subreddit": "fuckeatingdisorders",
  "author": "Gold_Albatross_6844",
  "created_utc": 1624478351.0,
  "title": "My wife's ED has restarted and I don't know how to support myself",
  "selftext": "My wife had an ED in the past, knew it when I married her. But it wasn't till last year it resurfaced. \n\nNow I've done my best to help her and get her the help she needs. But I've come to realize that what I don't know how to handle, is myself.\n\nI'm not attracted to this underweight woman. I find myself looking away from her because it worries me so much. Not touching her because of the bones I feel. Instead of trying to lift her up sometimes I find myself in a depressed state just trying to do the things I need to do.\n\nI'm sure some people would suggest I take more time for myself, but we just had our second kid and my wife has some serious post pregnancy issues. I get maybe an hour a day of \"me\" time and it's mostly spent working on the house and car issues.\n\nI'm definitely more irritable at work and have a short temper with coworkers.\n\nAll that to say... Not sure. Just figured maybe someone here has ideas, experience, or knowledge on this.\n\nThanks",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o6kolq/my_wifes_ed_has_restarted_and_i_dont_know_how_to/",
  "score": 107,
  "num_comments": 9,
  "comments": [
    {
      "id": "h2t2obh",
      "author": "egglover_",
      "body": "I guess people often get confused about how they can help loved ones who struggle with an ED. You can't be her therapist, and your love and care CAN'T replace professional help. Surely you are trying your best and you're giving her all your strength, but it's just not enough, as eating disorders are so complex and deep. \n\nDon't feel bad about it because at the end, it's not your responsibility. \nDoes it mean that you should ignore it and let her fight all alone? No. No, damn, never do that. \nBut it does mean that you can't be harming your own mental/physical/emotional health trying to help her. \nWhat can you do? Reach someone else, someone specialised on eating disorders; therapists, psychologists, or even an hospital, whatever she needs. \n\nAll you can do is staying at her side and telling her that she isn't alone. Please never comment on her body as it would be so harmful. Just be nice and neutral, supportive and try to be comprehensive. \n\nAlso remember eating disorders cause behaviour changes, so don't take personally if she's rude or something. \n\nhope you both the best!! xx",
      "created_utc": 1624479326.0,
      "score": 63,
      "context": []
    },
    {
      "id": "h2tg54c",
      "author": "_Ima_bean_",
      "body": "ask her to seek professional help.\n\nAlso never mention her weight, including telling her that shes skinny, because this will only make her want to lose more weight. \n\nYou can also get therapy for yourself to help deal with this, as much as her ED affects her, i know it can also affect other people.",
      "created_utc": 1624485444.0,
      "score": 46,
      "context": []
    },
    {
      "id": "h2u07ev",
      "author": "alliebbb",
      "body": "Feel like my fiancé could have written this. Here are a couple things that help:\n- do NOT mention her weight, whether you think she’s lost or gain. Don’t even use healthy, use words like glowing, beautiful, etc. \n- tell her you are worried for the future and that you want both of you to live long, healthy, loving lives together.  That in order to bear children she needs to be at a good weight. That in order to enjoy hobbies and do the things you love together, she needs to be healthy. When my fiancé says these things it really puts it into perspective for me. \n- fix meals and sit down and eat together. Express how much eating together means to you \n\nGood luck xx it’s fcking horrible on both sides",
      "created_utc": 1624495904.0,
      "score": 37,
      "context": []
    },
    {
      "id": "h2tov71",
      "author": "mij3i",
      "body": "Have you talked to her about seeking treatment? Because it really sounds like her ED is taking a toll on not only her, but also you, and we don't want it to get to a point where it starts affecting the kids. \n\nYou're in a tough position, and I really empathize with you, OP. It's so hard to watch a loved one get sick with anything. It's even harder when you don't know how to help and you feel like you're at a loss. There's only so much you yourself can do, and you're doing a lot already, so I would encourage you guys to seek some form of treatment. Couples therapy may be beneficial for you guys to improve on communication and for you to get your feelings out there. Maybe you could even look into an individual therapist for yourself, so you can say whatever you need to say without feeling the need to hold back. But I also understand that it really sounds like you don't have much time in your day as it is.\n\nI'm sorry your family is going through this, OP. And I'm wishing you all the best. Give yourself some grace. This is a lot for anyone to shoulder",
      "created_utc": 1624489878.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h2uo1cd",
      "author": "katarina-stratford",
      "body": "It might be worth seeking a therapist. \nThere can be so many stressors involved when your spouse has a significant mental health condition and it may be beneficial for you to have someone to help *you* work through this",
      "created_utc": 1624509217.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h2v2w1t",
      "author": "LeslieKnope2k20",
      "body": "Just like substance use disorders, eating disorders can be (and often are) family illnesses. Supporting a loved one with an ED can be incredibly difficult and you deserve to take time to care for yourself. You are allowed to feel depressed, frustrated, hurt, and tired. Look into getting therapy for yourself if you can afford it and yes, do try to take extra time for yourself. Use that time to do something that you truly enjoy, even if it’s just 30 minutes. You can also try to encourage her to seek treatment, but ultimately that’s up to her. Be kind to yourself in the meantime and understand that you shouldn’t neglect yourself in order to support someone else.",
      "created_utc": 1624521158.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2yypzu",
      "author": "Cornershadows",
      "body": "I feel ya. I'm in a very similar boat as you(minus the children). There are days where I absolutely hate myself and I just need a break. But then I start to think if I take a break then she will start to relapse even further. My mind plays tricks on me everyday. \n\nIt is alot to deal with. It's so difficult to ask for help but it's so absolutely necessary. If you can't take care of yourself first then you can't take care of anyone else. I could really go on and on.\n\nMessage me if you want.",
      "created_utc": 1624604921.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2tpgav",
      "author": "meowmehungry",
      "body": "If youre disgusted by her body, chances are pretty good she knows.  It isnt going to help her health at all",
      "created_utc": 1624490189.0,
      "score": -20,
      "context": []
    },
    {
      "id": "h2uskkz",
      "author": "dafodilla",
      "body": "It is so much better that he is disgusted by it than atracted to it",
      "created_utc": 1624512430.0,
      "score": 13,
      "context": [
        {
          "id": "h2tpgav",
          "author": "meowmehungry",
          "body": "If youre disgusted by her body, chances are pretty good she knows.  It isnt going to help her health at all",
          "created_utc": 1624490189.0
        }
      ]
    }
  ]
}