{
  "id": "o7tq3t",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1624646368.0,
  "title": "Y’all, stop making “eat this instead of that” comments here",
  "selftext": "Holy hell, I’m monitoring way too many people commenting on posts regarding extreme hunger with something along the lines of “just eat more protein/fruits/veggies/vegan or vegetarian options/low cal options instead of [insert “uNhEaLtHy” food here],”  this is NOT a dieting sub and we do not give out dieting advice, let alone unsolicited. It’s literally in the rules.\n\nThere is a big fucking difference between encouraging others to explore more foods, especially later in recovery, and flat out telling others to eat less sugar or less carbs because some of you are afraid of swinging entirely in the other direction after restriction (which does not happen as often as people think).\n\nLook, extreme hunger is shitty, and it can be so, so hard. I went through a whole 10 months of it. It can be scary eating a lot of food, especially caloric/nutrient dense foods that are labeled “processed” and morally “bad” according to society, despite our bodies craving them because they get us out of that energy deficit the quickest (which is exactly what your body wants). This is even more true when they are fear foods we’ve avoided for months, or even years. Honoring those cravings, that hunger, and listening to your body (at your own pace, of course), is the only way to get over extreme hunger. Physical and mental restriction at bedt only prolongs the recovery process, at worst causes a full blown relapse.\n\nI’m **not** telling you what or how to recover; if you wanna cut out certain foods, you do you—but don’t discourage others from eating them either. Instead of making people feel bad about it, say “you’re doing great!”, “I’m proud of you,” “I’m going through the same and it sucks,” or just… don’t say anything at all. \n\nThanks for coming to another one of my TED Talks, bye.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o7tq3t/yall_stop_making_eat_this_instead_of_that/",
  "score": 193,
  "num_comments": 16,
  "comments": [
    {
      "id": "h312wf5",
      "author": "squareCat99",
      "body": "It’s hard, I completely understand the tendency because breaking your ED “food rules” is super scary.  But just shifting into orthorexia is not going to help anyone’s recovery - trust me, I tried.\n\nAlso, what many people don’t realize is that your body likely NEEDS processed foods in the beginning.  Many of us jack up our digestive systems so much that eating processed, easy to digest foods is all our systems can handle when we kick start our digestion again . It was MONTHS before I could eat a salad or whole wheat without having terrible reflux and cramping.  Peanut butter sandwiches on white bread and potato chips got me through the worst of my hypermetabolism with a lot less pain than tons of vegetables would have.",
      "created_utc": 1624649562.0,
      "score": 63,
      "context": []
    },
    {
      "id": "h31nkgm",
      "author": "ForestRagamuffin",
      "body": "thank you for this and for being serious about keeping all the \"diet tips\" off this sub. this is why this sub is such a safe place. thank you x a million",
      "created_utc": 1624659577.0,
      "score": 24,
      "context": []
    },
    {
      "id": "h30yrg5",
      "author": "MentallyFuckedBerry",
      "body": "Thank you!\n\nSome of the biggest triggers for me is when I’ve used the search bar in the sub to find out about experiences from others only to find diet advice in the comments. If I’m worried about overshooting, I need kindness and compassion, not “wow yeah you ARE eating too much try this instead.” \n\nI feel like CICO is not law, unlike what many people think. Bodies are weird, man. And like sure, “processed” food can be addictive, but tbh I think most people get really tired of it once you follow and allow the cravings to pass, yk? \n\nBut yeah, I wholeheartedly agree with you. It’s annoying. And unnecessary.",
      "created_utc": 1624647633.0,
      "score": 31,
      "context": []
    },
    {
      "id": "h33tau5",
      "author": "Fornicorn",
      "body": "I’d like to share some of my experience just to support this post——\n\nWhen I began recovery I was at a dangerously low weight. I was anorexic with purging behaviors and was throwing up up to ten times a day, every day. I very badly needed to have been in inpatient for my recovery, I should have had a nasogastric tube but due to something traumatic that happened in residential in my teenage years, going to a facility would have triggered exactly what triggered my ED to begin with. \n\nI was facing refeeding syndrome trying to keep ANY solid food down. The only way I was able to gain weight was by eating over processed food. I could eat ensures, potato chips and v8 for fucks sake—— I think this was my diet for several months until my body could begin to handle denser food. \n\nI won’t pretend to know exactly how or why refeeding syndrome occurs, or how to treat it, but I remember one day my mother got impatient with me and forced me to eat a full meal. Mind you it was healthy food, lots of vegetables, quality meat and mashed potato’s. I was fucking starving and terrified so I obliged, and an hour later my heart began to pound so heavily, my legs and arms got so heavy I couldn’t barely move them and I was pouring sweat until I ended up relapsing in order to try to get my electrolytes back to what they were accustomed to. \n\nRecovery is a delicate process. Although I can understand the impulse to share a “safe” way to maneuver it by the ED standards—— health comes first. And that looks very different for many people.\n\nChallenge your disordered thoughts but listen to your body—- try to find a way to differentiate the  two.\n\nI am very happy to say I have been weight restored for two years now and almost all of my behaviors have been locked away in a hole to hell. Good riddance. I wish nothing more than to see others who are struggling to recover, in body and mind. Do whatever it takes to get some more weight on, get into therapy, scream and yell and get the feelings out in any other way, I promise you it’s worth it. Do what works for you, just survive this <3",
      "created_utc": 1624715123.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h3179jk",
      "author": "rileyyj001",
      "body": "👌🏻👌🏻👌🏻",
      "created_utc": 1624651566.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h5no1ny",
      "author": "tkdaw",
      "body": "Honestly yes plus when EH hits, \"health food\" is not going to make a dent in the caloric needs you're looking at. Like, volume + macros are for when you're kinda in energy balance and looking to optimize things, if you're into that... extreme hunger is about calories and mental/physical restriction, pure and simple.",
      "created_utc": 1626631323.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h31jqd1",
      "author": "Beginning-Toe-470",
      "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
      "created_utc": 1624657598.0,
      "score": -11,
      "context": []
    },
    {
      "id": "h31tgun",
      "author": "Sareeee48",
      "body": "Eactly! Poptarts ,super sugary lattes, and overall “processed” foods was the easiest thing on my digestion and the easiest way to honor my extreme hunger without being uncomfortably full… I still can’t touch salads, but it took me… 6 months to be able to eat vegetables regularly again.\n\nAnd in top of that, fiber is not your friend in early recovery and can cause *a lot* of gastrointestinal distress. So it always gets me so mad when people recommend more veggies/fruits and less sugar.",
      "created_utc": 1624662713.0,
      "score": 26,
      "context": [
        {
          "id": "h312wf5",
          "author": "squareCat99",
          "body": "It’s hard, I completely understand the tendency because breaking your ED “food rules” is super scary.  But just shifting into orthorexia is not going to help anyone’s recovery - trust me, I tried.\n\nAlso, what many people don’t realize is that your body likely NEEDS processed foods in the beginning.  Many of us jack up our digestive systems so much that eating processed, easy to digest foods is all our systems can handle when we kick start our digestion again . It was MONTHS before I could eat a salad or whole wheat without having terrible reflux and cramping.  Peanut butter sandwiches on white bread and potato chips got me through the worst of my hypermetabolism with a lot less pain than tons of vegetables would have.",
          "created_utc": 1624649562.0
        }
      ]
    },
    {
      "id": "h3rofwo",
      "author": "tkdaw",
      "body": "I was the opposite, my body was so unused to sugar and processed foods that I couldn't eat enough calories of them without literally feeling sick from grease/sugar, what got me through was dense-ish foods that didn't have a ton of sugar and grease, so like...peanut butter sandwiches and pancakes with nut butter, basically.",
      "created_utc": 1625200538.0,
      "score": 3,
      "context": [
        {
          "id": "h312wf5",
          "author": "squareCat99",
          "body": "It’s hard, I completely understand the tendency because breaking your ED “food rules” is super scary.  But just shifting into orthorexia is not going to help anyone’s recovery - trust me, I tried.\n\nAlso, what many people don’t realize is that your body likely NEEDS processed foods in the beginning.  Many of us jack up our digestive systems so much that eating processed, easy to digest foods is all our systems can handle when we kick start our digestion again . It was MONTHS before I could eat a salad or whole wheat without having terrible reflux and cramping.  Peanut butter sandwiches on white bread and potato chips got me through the worst of my hypermetabolism with a lot less pain than tons of vegetables would have.",
          "created_utc": 1624649562.0
        }
      ]
    },
    {
      "id": "h31xqtk",
      "author": "Sareeee48",
      "body": "Yaaay, I’m glad it makes you feel safe here, I would never want someone to view this sub as an unsafe space ❤️❤️",
      "created_utc": 1624665089.0,
      "score": 11,
      "context": [
        {
          "id": "h31nkgm",
          "author": "ForestRagamuffin",
          "body": "thank you for this and for being serious about keeping all the \"diet tips\" off this sub. this is why this sub is such a safe place. thank you x a million",
          "created_utc": 1624659577.0
        }
      ]
    },
    {
      "id": "h31tutf",
      "author": "Sareeee48",
      "body": "Food addiction isn’t even real (scientifically speaking, it has been disproven many times), the issue is that restriction leads to food fixation, which makes biological sense when you consider that, brain senses body is hungry, so brain makes you think about food, so you eat food. It’s literally that simple. Sure, it might take some time like you said, but eventually that fixation goes away after you’ve allowed yourself those foods long enough.",
      "created_utc": 1624662930.0,
      "score": 13,
      "context": [
        {
          "id": "h30yrg5",
          "author": "MentallyFuckedBerry",
          "body": "Thank you!\n\nSome of the biggest triggers for me is when I’ve used the search bar in the sub to find out about experiences from others only to find diet advice in the comments. If I’m worried about overshooting, I need kindness and compassion, not “wow yeah you ARE eating too much try this instead.” \n\nI feel like CICO is not law, unlike what many people think. Bodies are weird, man. And like sure, “processed” food can be addictive, but tbh I think most people get really tired of it once you follow and allow the cravings to pass, yk? \n\nBut yeah, I wholeheartedly agree with you. It’s annoying. And unnecessary.",
          "created_utc": 1624647633.0
        }
      ]
    },
    {
      "id": "h31wvpc",
      "author": "Sareeee48",
      "body": "Well firstly, this is not a dieting sub, that is why we do not comment on what others “should” be eating. We are a recovery focused space. I dont care how well intentioned you are, these comments are hurtful and invalidating and lead people to question their hunger and possibly even a relapse.\n\nI find it weird you mentioned my support of all in, despite even saying in my post, and many times previously, that going at your own pace is totally fine. If you need a meal plan, follow a meal plan; just make sure you’re eating enough. If it’s easier to slowly add foods back in rather than going all-in (pun intended), then that’s okay. Some people work best with structure, others would rather just get it over with. Recovery is very subjective and everyone will recover at their own pace.. That’s totally fine. I have no qualms about that.\n\nThe fact remains, however, that restriction is inherently unhealthy, both psychologically and physiologically. I don’t care if you don’t wanna go all in, that’s fine, but you don’t get to talk about your restriction here, nor encourage it on others’ posts—especially considering this is one of very few subs that are predominantly supportive of the all-in method.\n\nYou ask why we should guard ourselves from diet talk if we hear about it anyway, and I just… don’t know why this is even a question you’re asking? You wouldn’t tell an addict at rehab that it’s pointless because the substance of choice (for lack of a better phrase) is everywhere outside regardless. This is a safe space where members don’t have to worry about whether or not they’ll be triggered, where individuals can discuss their recovery or their struggles with their ED that doesn’t explicitly discuss in detail methods of restriction or “DiEtInG,” specifically because it *encourages* disordered behaviors. My opinions on dieting are irrelevant; discussing it is harmful to members and encourages ED behaviors (whether intentional or otherwise).\n\nOn top of that, there are *countless* other subs dedicated to dieting and pro-Ana content where you could go, here is not the place to do it for all the aforementioned reasons. It doesn’t matter that you have a different opinion on what is considered healthy, because you aren’t entitled to anyone else’s health and therefore you don’t get to comment, in an ED recovery sub, what is and isn’t healthy. It doesn’t matter that you don’t feel a responsibility to make sure other members don’t feel guilty, because it’s mine. It is my job to enforce the rules, and that includes rule 10 (No Diet Tips), which includes encouraging weight loss and restriction. You don’t have to like or agree with the rules, but you do have to follow them.",
      "created_utc": 1624664600.0,
      "score": 25,
      "context": [
        {
          "id": "h31jqd1",
          "author": "Beginning-Toe-470",
          "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
          "created_utc": 1624657598.0
        }
      ]
    },
    {
      "id": "h3229m4",
      "author": "squareCat99",
      "body": "While I understand your point of view, I think what you're missing is context.  You're in a space that is intended and designed for eating disorder recovery.   Telling people that some diets are fine, and changing your body's appearance are fine are like going to a sub for Alcoholics Anonymous and telling people that reasonable amounts of drinking are normal and should be fine.  \n\nWhat you might recommend for the general public is VERY different that what you would recommend for people with a tendency toward disordered body image and eating - especially people who may be struggling with their disorder and need encouragement to recover - NOT encouragement to continue with a life threatening condition.   I've NEVER met an eating disorder professional (and I've seen a lot) who believes that recovery is compatible with dieting or desire to alter your body.  Yes, the entire rest of the world will tell you to diet - that's why we NEED safe spaces like this to find support and encouragement for our recovery, especially for people who are struggling or in the beginning stages.",
      "created_utc": 1624667684.0,
      "score": 20,
      "context": [
        {
          "id": "h31jqd1",
          "author": "Beginning-Toe-470",
          "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
          "created_utc": 1624657598.0
        }
      ]
    },
    {
      "id": "h32qeu7",
      "author": "attic-dweller-",
      "body": "I think it's honestly as simple as \"this is a safe space, so anything that triggers multiple people is unwelcome.\" Same with putting TW before many posts. we're all just doing our best here and it feels counterproductive to be anything other than wholesome and suppprtive.",
      "created_utc": 1624682268.0,
      "score": 7,
      "context": [
        {
          "id": "h31jqd1",
          "author": "Beginning-Toe-470",
          "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
          "created_utc": 1624657598.0
        }
      ]
    },
    {
      "id": "h38dt24",
      "author": "Beginning-Toe-470",
      "body": "Hello, thank you for your point of view! Little side note about the AA thing, actually some addiction sufferers choose a moderation route for their treatment instead of a complete avoidance one. I believe it's the harm-reduction method. It's all personal choice at the end of the day, regarding one's history and background, some folks can't just quit the substance (or other drugs they may be experimenting with) altogether and instead incorporate it in a controlled (supervised) way. \n\nI should have clarified what I meant by dieting. I didn't just mean the regular dieting strategy to shrink one's body or eat less because this or that food is labeled as bad. I meant diet as in a particular way of eating to achieve some goals : wellness (to lessen some symptoms of chronic/inflammatory diseases), fitness (to win a competition/get better performance/endurance) or even to be more in line with our religious/ethical values if we have any. I believe that those diets can 100% be compatible with life after an ed. I meant that the end goal for us ed-sufferers is to approach normality in all its forms, there is a life after an eating disorder, a life that involves drinking or not, exercising or not, socializing, having faith (or not!), dealing with health issues that come with age or pregnancy or stress ETC. \n\nThough now that you explain the necessity to protect and help people at the beginning stages of recovery, I understand better the reasoning. It's totally sensible and I can agree with some points you made. Good luck with your journey :) xx",
      "created_utc": 1624815910.0,
      "score": 3,
      "context": [
        {
          "id": "h31jqd1",
          "author": "Beginning-Toe-470",
          "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
          "created_utc": 1624657598.0
        },
        {
          "id": "h3229m4",
          "author": "squareCat99",
          "body": "While I understand your point of view, I think what you're missing is context.  You're in a space that is intended and designed for eating disorder recovery.   Telling people that some diets are fine, and changing your body's appearance are fine are like going to a sub for Alcoholics Anonymous and telling people that reasonable amounts of drinking are normal and should be fine.  \n\nWhat you might recommend for the general public is VERY different that what you would recommend for people with a tendency toward disordered body image and eating - especially people who may be struggling with their disorder and need encouragement to recover - NOT encouragement to continue with a life threatening condition.   I've NEVER met an eating disorder professional (and I've seen a lot) who believes that recovery is compatible with dieting or desire to alter your body.  Yes, the entire rest of the world will tell you to diet - that's why we NEED safe spaces like this to find support and encouragement for our recovery, especially for people who are struggling or in the beginning stages.",
          "created_utc": 1624667684.0
        }
      ]
    },
    {
      "id": "h38hdtt",
      "author": "Beginning-Toe-470",
      "body": "Hi, thank you for explaining simply :) ! I hope this comment doesn't go in twice; I don't know why reddit kinda banned my first attempt to reply. Anyways , I understand where you're coming from. Wishing you good luck on your journey xx",
      "created_utc": 1624817656.0,
      "score": 4,
      "context": [
        {
          "id": "h31jqd1",
          "author": "Beginning-Toe-470",
          "body": "I'm having trouble understanding what the issue is when people give advice such as \"don't eat this/eat that instead\". At the end of the day, foods do have a nutritional value and there is scientific data (research papers, meta-analysis) and anecdotal findings that back up some of the stuff we may say. Some foods affect our blood sugar levels more than others, some make us feel energized, nourished or on the contrary drowsy and hungry again soon later.  It's unrealistic to expect everyone to be on board with the all-in method for recovery, just like it's unrealistic to ask people to follow meal plans as it erases individual needs.\n\nI took a look at your posts and you are a mod of this sub so I understand that you have to police around some of the content here. I also understand through your posts that you defend the all-in route which you chose, great job on putting in the work to recover, that is so challenging yet you're doing it!! Bravo, for real!\n\nMy opinion is clearly different and I respect that it might not be in line with yours; I see recovery as being a personal choice and responsibility. The whole world cannot freeze or align with our recovery process. Like, there are so many different diets and eating patterns around the world and most of them will trigger some of us to some extent. In the real world people DO follow specific diets, some are suited for diabetics, for vegans, for Muslims, for people with inflammatory diseases like arthritis and so on and so forth. \"Dieting\" isn't inherently a bad thing, nor is trying to shift your body's appearance (which is an entirely different debate but I'm putting it out there regardless).\n\nOutside of reddit some comments will be made about healthy or less healthy foods, so why guard ourselves from that? We're all so different and need more or less carbs to function, feel drowsy or not when we eat certain foods etc...\n\nLast point, I fail to understand why we should \"de-guilt\" each other. I don't believe that we're entitled to make people feel good about their food choices. Food shouldn't spark such emotional responses from us, be it overly positive or negative. Maybe it's a part of the remission process to question why we need constant validation, reassurance (which is different from occasional support like is provided by this sub many times!).\n\nHopefully this doesn't come off as an attack but I genuinely don't understand why all-in should be exempt from critics and skepticism when all restorative approaches are questioned all the time. Take care! xx",
          "created_utc": 1624657598.0
        },
        {
          "id": "h32qeu7",
          "author": "attic-dweller-",
          "body": "I think it's honestly as simple as \"this is a safe space, so anything that triggers multiple people is unwelcome.\" Same with putting TW before many posts. we're all just doing our best here and it feels counterproductive to be anything other than wholesome and suppprtive.",
          "created_utc": 1624682268.0
        }
      ]
    }
  ]
}