{
  "id": "o9qtqq",
  "subreddit": "fuckeatingdisorders",
  "author": "throwaway0706199",
  "created_utc": 1624906544.0,
  "title": "Why do so many Instagram ED recovery pages post so many pics of their bodies?",
  "selftext": "I’m just wondering. I made a new Instagram account to focus on recovery and follow more inspiring pages (like body positivity and recovery pages). I’m going through trying to find pages to follow, and so many of them post a lot of pictures of them showing off their stomachs and abs and whatever else. \n\nWhich is disappointingly triggering to me I guess. It just doesn’t really make sense to me why recovery pages would post so much of that. I know people can post what they want, I’m just venting. \n\nIt makes me feel like I’m not sick enough because I don’t get to start my recovery at a low weight and gain muscle and abs the way they do. I don’t know if that makes sense. I’m considered “healthy weight” and my body is soft and squishy.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/o9qtqq/why_do_so_many_instagram_ed_recovery_pages_post/",
  "score": 107,
  "num_comments": 13,
  "comments": [
    {
      "id": "h3cowbm",
      "author": "Dizzy_Bother",
      "body": "I think it's often a way for them to deal with weight gain and muscle gain. When they show their new body in the best way, and they receive positive responses, they will feel more confident about the choice they made, to go into recovery... I assume.",
      "created_utc": 1624906850.0,
      "score": 45,
      "context": []
    },
    {
      "id": "h3dvlat",
      "author": "OhCrumbs96",
      "body": "I agree completely. I honestly think it's every bit as much of an ED behaviour as posting triggering body check pictures when severely underweight. \n\nWhy is it that in 2021, having an eating disorder seems synonymous with constantly posting half naked pictures of yourself? In all my years of having anorexia I haven't had one moment where I felt confident enough to strip off down to my underwear and post myself on the internet. Am I missing something here?",
      "created_utc": 1624926597.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h3d7u4l",
      "author": "Sareeee48",
      "body": "Tbh it’s very common with accounts that tend to hold onto some disordered behaviors and use these posts as a form of validation. I noticed this is most common with socially acceptable, “thin” bodies… not to say larger bodied people don’t post photos of their bodies either but it’s just not the same, imo, when one is demonized and the other is fetishized.\n\nIt took me a long time to find recovery accounts that didn’t trigger me or make me feel bad for not being “sick enough” because I wasn’t hospitalized or forced into treatment.",
      "created_utc": 1624914985.0,
      "score": 33,
      "context": []
    },
    {
      "id": "h3ddy1g",
      "author": "PinkieePie_",
      "body": "I was actually thinking about this earlier. It’s so so lovely to see people sharing their recovery. But as an overweight person with an ED, it’s so triggering and I just find myself thinking that people in recovery are still skinnier than I am. It just makes the ED tendancies worse.",
      "created_utc": 1624917728.0,
      "score": 19,
      "context": []
    },
    {
      "id": "h3e2c30",
      "author": "None",
      "body": "I hate all of these recovery Instagram accounts that have photos all over it. I'm pretty overweight and all of the body photos are triggering for me. Seeing girls so much skinnier than me is really triggering, because I want to be that thin, but also seeing recovery photos that are more overweight than me makes me feel triggered because I don't want to my weight to get that high either.\n\nI'm damned if I do, damned if I don't, really.",
      "created_utc": 1624930124.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3ewmg4",
      "author": "kirbbabble",
      "body": "rock chunky tap numerous station squeal bells humor subsequent steer\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1624948981.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3f7s5f",
      "author": "None",
      "body": "they’re stuck in quasi-recovery.",
      "created_utc": 1624959504.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h3f9zsg",
      "author": "chicadoro16",
      "body": "How about being happy for them, is their body is acceptable and beautiful as it is? If that's the narrative we are pushing for heavier women, why are slimmer bodies still wrong?",
      "created_utc": 1624961603.0,
      "score": -1,
      "context": []
    },
    {
      "id": "h3dw86i",
      "author": "throwaway0706199",
      "body": "I completely get it. I feel that way too. Maybe it’s because I take pictures of myself in crop tops and bikinis to body-check. So I see them doing that and it feels like they’re body-checking too.",
      "created_utc": 1624926933.0,
      "score": 5,
      "context": [
        {
          "id": "h3dvlat",
          "author": "OhCrumbs96",
          "body": "I agree completely. I honestly think it's every bit as much of an ED behaviour as posting triggering body check pictures when severely underweight. \n\nWhy is it that in 2021, having an eating disorder seems synonymous with constantly posting half naked pictures of yourself? In all my years of having anorexia I haven't had one moment where I felt confident enough to strip off down to my underwear and post myself on the internet. Am I missing something here?",
          "created_utc": 1624926597.0
        }
      ]
    },
    {
      "id": "h3dw22x",
      "author": "throwaway0706199",
      "body": "Me too. I’m like a healthy weight with a little bit extra. I feel like I’m not sick enough, or that I need to lose more weight in order to start out with “thin” as the baseline. It definitely triggers me.",
      "created_utc": 1624926844.0,
      "score": 5,
      "context": [
        {
          "id": "h3ddy1g",
          "author": "PinkieePie_",
          "body": "I was actually thinking about this earlier. It’s so so lovely to see people sharing their recovery. But as an overweight person with an ED, it’s so triggering and I just find myself thinking that people in recovery are still skinnier than I am. It just makes the ED tendancies worse.",
          "created_utc": 1624917728.0
        }
      ]
    },
    {
      "id": "h3e2znf",
      "author": "throwaway0706199",
      "body": "I’m going through and following the accounts that mostly post quotes and food pictures, because those make me feel good. I’ve only made one post but I plan to post my daily mantra (today’s was “I deserve to eat what I’m craving”) and pictures of my yummy meals. I also want to keep it as a sort of diary for how I’m feeling.",
      "created_utc": 1624930466.0,
      "score": 5,
      "context": [
        {
          "id": "h3e2c30",
          "author": "None",
          "body": "I hate all of these recovery Instagram accounts that have photos all over it. I'm pretty overweight and all of the body photos are triggering for me. Seeing girls so much skinnier than me is really triggering, because I want to be that thin, but also seeing recovery photos that are more overweight than me makes me feel triggered because I don't want to my weight to get that high either.\n\nI'm damned if I do, damned if I don't, really.",
          "created_utc": 1624930124.0
        }
      ]
    },
    {
      "id": "h3facx6",
      "author": "throwaway0706199",
      "body": "I’m not saying it’s wrong. I’m saying that even though they’re allowed to post what they want to (as I said), some people‘s feeds are filled with constant pictures of their bodies, which seems an awful lot like body-checking to me. I’m wondering the “why”, not saying that it’s wrong.",
      "created_utc": 1624961940.0,
      "score": 3,
      "context": [
        {
          "id": "h3f9zsg",
          "author": "chicadoro16",
          "body": "How about being happy for them, is their body is acceptable and beautiful as it is? If that's the narrative we are pushing for heavier women, why are slimmer bodies still wrong?",
          "created_utc": 1624961603.0
        }
      ]
    }
  ]
}