{
  "id": "om5c5a",
  "subreddit": "fuckeatingdisorders",
  "author": "lovenote123",
  "created_utc": 1626532262.0,
  "title": "I don’t understand how people who “diet the healthy way” and count calories don’t eventually develop disordered thoughts",
  "selftext": "Obviously this is my disordered brain speaking and not thinking it could be normal in the long term to always track everything you eat, but how is that possible to do long term without leading to disordered thoughts?\n\nThe moment I discovered counting calories and seeing how easy it was to make the number on the scale go down, I went from eating whatever I want (just small servings) to a very restrictive diet of the same safe foods. I also went from not thinking about food (still very insecure about my body since I was like 12 though), to dreaming about the food I can’t eat 24/7. I went through a year of this until COVID happened and extreme hunger hit and I finally ate all the foods I’ve been craving and missing. I’ve been free from the shackles of tracking everything I eat and craving everything, to just letting myself eat what I fucking want and not binging on it when I felt like that would be the only time I could eat it.\n\nI truly want to understand how this can be healthy in the long term",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/om5c5a/i_dont_understand_how_people_who_diet_the_healthy/",
  "score": 128,
  "num_comments": 15,
  "comments": [
    {
      "id": "h5jbqyu",
      "author": "BeastieBeck",
      "body": ">Obviously this is my disordered brain speaking and not thinking it could be normal in the long term to always track everything you eat, **but how is that possible to do long term without leading to disordered thoughts?**\n\nThey *do* develop disordered thoughts. Just look at all the diet subs on reddit alone! \n\nThere is a *lot* of  disordered thinking around food and exercise on there but people on dieting subs/boards usually believe they have \"a healthy mindset\" going on around these things.",
      "created_utc": 1626543335.0,
      "score": 51,
      "context": []
    },
    {
      "id": "h5iw2em",
      "author": "its_me_anonymous16",
      "body": "They do. Check out r/antidiet and r/intuitiveeating. Most people have disordered thoughts around food and movement, but many times certain behaviors are viewed as \"healthy\"",
      "created_utc": 1626535878.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h5izqje",
      "author": "Less-Feature6263",
      "body": "Because eating disorders are a mental illness. Just like a lot of people have periods in their life where they're \"down\" but they don't develop chronic depression, some people may develop disordered thoughts about food but never an eating disorder. Some people may even never develop disordered thoughts. I find eating disorders to be really complex and often not only caused by a single thing.",
      "created_utc": 1626537654.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h5ix528",
      "author": "Sareeee48",
      "body": "Actually, studies show that at least 70% of women have a disordered relationship with food and their bodies. They may not have eating disorders, but just because many people intentionally lose weight doesn’t mean they’re automatically healthy. Weight is not synonymous to health. It’s also worth mentioning that studies have shown that people at higher weights are generally healthy; the ones who aren’t usually have gained weight as a symptom of a chronic illness rather than the weight being the illness itself. Therefore, losing weight doesn’t diminish the illness (oftentimes it exacerbated it) but individuals who aren’t fat are less likely to face discrimination in the medical community and receive the care the initially needed when they came in with a larger body.\n\nEdit: are you asking how dieting can be healthy in the long term, or how intuitive eating can be healthy in the long term? If IE has lead you to eating freely without reactive binging, whereas “dieting” has lead to all the aforementioned consequences, remember that eating disorders are a mental disorder—however, the affects of starvation are the same regardless of how disordered one’s thoughts are. You will still experience extreme hunger, reactive binges, extreme fatigue, hair loss, amenorrhea (if you are an individual with a uterus), slowing heart rate, dizziness, etc. I think it’s safe to assume dieting (in terms of restriction outside of allergies) is going to lead to at least a few of those symptoms.",
      "created_utc": 1626536407.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h5jifet",
      "author": "taystorm",
      "body": "this isn’t going to help because same. I’ve tried to “diet the healthy way” many, many times lol. it always turned into what you’ve described :/",
      "created_utc": 1626546574.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h5k0cj8",
      "author": "Various-List",
      "body": "I think trauma, significant life stress and other psychological issues being present can often make the difference between someone dieting simply to lose weight (then stopping when they arrive at their goal) and someone using dieting to try to feel in control of ones life or to solve low self-esteem. It’s a fine line though because what person hasn’t experienced something that makes them vulnerable to that temptation..",
      "created_utc": 1626555595.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h5kl6f9",
      "author": "petitelinotte212",
      "body": "Gently, don’t worry about other people. What works for you? I’m def in the camp that can never even dabble in diets or weight-conscious exercise regimes. There is no healthy way for me to try and lose weight, because that’s just not something I can monitor and control: like an alcoholic who can’t just have one drink. I don’t spend a lot of time wondering why this is, but I instead work on accepting that’s what it is for me. Acceptance is the balm to my insecurities.",
      "created_utc": 1626566600.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h5k9xjp",
      "author": "YourFrogMom",
      "body": "Totally agree with what everyone else is saying, wanted to add-[EDs are considered genetic](https://www.eatingdisorderhope.com/blog/genetic-factors-eating-disorders) (Link to a source about it)  \nNot everyone who goes into a deficit develops that \"survival from food scarcity\" type mindset (which seems so unfair aaaa)   \nIn my opinion, being healthy long term food wise without disordered thoughts requires:   \nFull recovery, Intuitive eating (this takes practice! Which I found really surprising because it seems \"normal\" but a lot of people are so used to dieting that it feels odd); then, gradually adding more protein/greens/drinking enough water, without cutting out other stuff?  \nI'm just rambling lol, not a dietician or anything like that haha. I hope you're having a good day!",
      "created_utc": 1626560615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h5koz7x",
      "author": "momunist",
      "body": "They do. Most people who diet or attempt weight loss do not have a healthy relationship with food or their bodies. Even if they don’t have a full-blown eating disorder, intentionally restricting what you eat in an attempt to lose weight is inherently disordered eating.",
      "created_utc": 1626568623.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h5l8isa",
      "author": "None",
      "body": "If you're below your set point or you've lost some weight, it can set off your ED and automatically trigger disordered thoughts and feelings like you've described. Look at the [Minnesota](https://bodymatters.com.au/exploring-impact-restrictive-eating-body-mind-minnesota-starvation-experiment/) [Starvation](https://www.refinery29.com/en-us/minnesota-starvation-experiment) Experiment",
      "created_utc": 1626578721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5jav0z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1626542914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5iwjj4",
      "author": "Sareeee48",
      "body": "I came here to say this!",
      "created_utc": 1626536113.0,
      "score": 6,
      "context": [
        {
          "id": "h5iw2em",
          "author": "its_me_anonymous16",
          "body": "They do. Check out r/antidiet and r/intuitiveeating. Most people have disordered thoughts around food and movement, but many times certain behaviors are viewed as \"healthy\"",
          "created_utc": 1626535878.0
        }
      ]
    },
    {
      "id": "h5kor86",
      "author": "ontopofyourmom",
      "body": "(I'm a six-foot guy with an above-average build, my numbers probably work differently than yours.)\n\nI had a disordered thought once when my weight dipped below >!190!< from an original >!205!<, due to lack of interest in eating. I was till chubby at >!190!<, but unintentionally starving myself is not a good way to lose weight. \n\nWhen I hit >!189!<, I had a disordered thought - \"what if I keep going?\" Choosing to do that would have moved me from poor eating habits to restricting. I know and knew that I would be very healthy at >!10 or 15!< pounds less than that, but I was not going to go there. \n\nMy response was to be deliberate about eating more, and I am back up to a stable >!205!<. And I'm not counting calories or anything, just weighing myself every couple of weeks and using more butter and cream in my cooking if I feel the number isn't high enough. It's a good way to add nutrition when you aren't interested in eating. \n\nSo, I have felt the feeling - but because I don't have an ED, it did not negatively affect my behavior or everyday thoughts about food.",
      "created_utc": 1626568506.0,
      "score": 7,
      "context": [
        {
          "id": "h5izqje",
          "author": "Less-Feature6263",
          "body": "Because eating disorders are a mental illness. Just like a lot of people have periods in their life where they're \"down\" but they don't develop chronic depression, some people may develop disordered thoughts about food but never an eating disorder. Some people may even never develop disordered thoughts. I find eating disorders to be really complex and often not only caused by a single thing.",
          "created_utc": 1626537654.0
        }
      ]
    },
    {
      "id": "h5jrm3y",
      "author": "plesiadapiform",
      "body": "I'm glad it works for you! I've tried counting calories a few times and have had to stop because I just end up not eating.",
      "created_utc": 1626551163.0,
      "score": 2,
      "context": [
        {
          "id": "h5jav0z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1626542914.0
        }
      ]
    }
  ]
}