{
  "id": "oplr8t",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1626983925.0,
  "title": "it's time for me to leave this sub",
  "selftext": "I posted on this sub for the first time 10 months ago, worried about going to uni with an ED. since then, i went to uni and dropped out 6 weeks later, did a 20 week recovery programme, moved house with my family, got a job and finally recovered and i'm now getting ready to go back to uni and actually be happy and successful.\n\nlast October I thought I was beyond hope, I was planning my suicide, food was my 24/7 obsession, I couldn't sleep, couldn't think, couldn't feel happiness. I cried more that I spoke actually words. last October was the worst month of my life. I'm sure if I didn't force myself to accept help I would have ended up dead or in hospital.\n\nI have been living with anorexia for 5 years, it took 5 years of my life away and only now do I feel like I can actually breathe again. \n\nif you told my past self that in the summer of 2021 I would feel confident enough to wear dresses and short sleeves, and well enough to eat whatever I want, whenever I want, I would not have believed you. I truly thought I would never recover.\n\ndon't get me wrong, everyday I am vigilant of signs of relapse, but now I actually care about myself enough to take care of my mind and body, instead of thinking I deserved to starve. \n\nI think it's time for me to leave this sub, so I can take the final few steps required to close this dark chapter for good.\n\nif there is one thing that everyone here needs to know, it's this: you're not the exception, you're not beyond help and you deserve recovery, but unfortunately you won't believe that until you're well, so you're just going to have to take my word for it.\n\nGood luck.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/oplr8t/its_time_for_me_to_leave_this_sub/",
  "score": 198,
  "num_comments": 10,
  "comments": [
    {
      "id": "h65zki1",
      "author": "None",
      "body": "I'm so proud of you!!!",
      "created_utc": 1626983957.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h6617gc",
      "author": "baltimorejulia",
      "body": "I'm so proud of you.\n\nThis has brought such happiness to my day.\n\nHave an amazing journey forward<3",
      "created_utc": 1626984678.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h66ing6",
      "author": "batboiben",
      "body": "that's incredible. im so happy for you!! good luck, friend:)",
      "created_utc": 1626992507.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h66j5yt",
      "author": "hurrsadurr",
      "body": "We are all so proud of you - kick ass at uni!",
      "created_utc": 1626992753.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h6822gp",
      "author": "violetmoz",
      "body": "so happy for you!",
      "created_utc": 1627024517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h68e8i7",
      "author": "hannacken",
      "body": "This brought a tear to my eye because I know that feeling so well. It feels amazing, even though it’s scary, doesn’t it? Choosing life will be the best decision you have ever made and I know you can recover fully. I’m so happy for your progress and I wish you so much love and luck. Here’s to recovery! ❤️",
      "created_utc": 1627035524.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h69a9ld",
      "author": "petitelinotte212",
      "body": "Inspired by your strength and resilience! Congratulations on coming so far and best of luck with your studies!!",
      "created_utc": 1627053589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6752dz",
      "author": "telavarone",
      "body": "You are doing great and that is really good: but why leave the sub? From someone with over thirty years of sobriety from alcohol, and over 12 years abstinent from flour and sugar, staying 'green' about the fact that you have a problem and not forgetting about it or ignoring it can be very important. Why not stay on the sub and keep checking in occasionally to help others, and that way keep reminding yourself that you need to stay conscious and alert and to remember your previous struggles? Whatever you decide, good luck!",
      "created_utc": 1627004132.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h68ma8h",
      "author": "None",
      "body": "thanks! it's liberating and scary all at the same time, you have to learn who you are and how to live without this crutch, but recovery is always 110% worth it",
      "created_utc": 1627041593.0,
      "score": 2,
      "context": [
        {
          "id": "h68e8i7",
          "author": "hannacken",
          "body": "This brought a tear to my eye because I know that feeling so well. It feels amazing, even though it’s scary, doesn’t it? Choosing life will be the best decision you have ever made and I know you can recover fully. I’m so happy for your progress and I wish you so much love and luck. Here’s to recovery! ❤️",
          "created_utc": 1627035524.0
        }
      ]
    },
    {
      "id": "h68fo2t",
      "author": "None",
      "body": "for the past few months I've stayed on this sub just to give my advice and reassurance, and I will probably still do that occasionally because I have been given some really great advice from wonderful people here in the past.\n\nI also left the r/EDanonymemes sub a while ago because I was conscious of the fact that I was no longer relating to any of the memes on the sub, which gave me a mild feeling of 'missing out'. I knew that staying on that sub would have a detrimental effect on my recovery in the long run.\n\nin order to recover, you have to live as if you don't have an ED, any people who have EDs don't seek out ED content everyday, so that's what I'm doing. :)",
      "created_utc": 1627036731.0,
      "score": 3,
      "context": [
        {
          "id": "h6752dz",
          "author": "telavarone",
          "body": "You are doing great and that is really good: but why leave the sub? From someone with over thirty years of sobriety from alcohol, and over 12 years abstinent from flour and sugar, staying 'green' about the fact that you have a problem and not forgetting about it or ignoring it can be very important. Why not stay on the sub and keep checking in occasionally to help others, and that way keep reminding yourself that you need to stay conscious and alert and to remember your previous struggles? Whatever you decide, good luck!",
          "created_utc": 1627004132.0
        }
      ]
    }
  ]
}