{
  "id": "ovt5hl",
  "subreddit": "fuckeatingdisorders",
  "author": "poopystinky7",
  "created_utc": 1627828291.0,
  "title": "never underestimate the power of eating peanut butter straight from the jar",
  "selftext": "capturing this moment as it is my white whale & who knows when i’ll feel this way again.\n\nwithin the past almost 2 weeks, ive demolished about two jars of peanut butter. i’m making pb&js whenever possible, & just goin ham on the pb otherwise. ive decided just to let my body figure out what it wants, & trying so hard to trust it again. bodies aren’t dumb, & i need to rebuild that trusting relationship again. i need to trust that it knows what its doing, i wouldn’t be eating if i didn’t need it. for all i know, im healing internally in ways i can’t see, & even if i’m not, when was the last time i allowed myself food like this?\n\n& something absolutely redundant & crazy ive noticed, is sometimes, the more you eat, the less you think about it. you just have to keep yourself distracted for now. because when you give your brain actual power, it can WORK, & you realize just how much brain fog you put up with daily. i’m trying to sit with the fact that food doesn’t have to be the focus of my life, but instead is an avenue to get me to where i want to go. i wanna have good relationships? eat. i wanna draw & make art again? eat. and so on. \n\nthis is a huge revelation for me, as i’ve been gearing up for the past month to enter residential. i’ve been doing everything i can while i wait to prepare myself, & i won’t lie, its been so fucking hard. there have been so many times i thought i was going to make it. but i’m still holding on. i swear i’m going to make it to residential & kick this thing in the ass, and im savoring this moment of clarity for when the AN voice gets too strong again. waiting for my admit date is like watching paint dry.\n\nso yeah. peanut butter",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ovt5hl/never_underestimate_the_power_of_eating_peanut/",
  "score": 109,
  "num_comments": 3,
  "comments": [
    {
      "id": "h7bkdbm",
      "author": "Mimolette_",
      "body": "I agree so much! Peanut butter is both a huge symbol of my recovery for me, and a major actual force in it. While I was in my eating disorder, I would never allow myself to have a jar of peanut butter at home, because I love it so much and I was scared I’d eat it all at once (I never binged so this fear didn’t even make sense) or that I’d end up gaining weight from eating it all the time. For some reason I let myself have my other favorite foods like cheese and ice cream in small measured portions regularly, but not peanut butter. Whenever I visited relatives I would sneak a tiny spoonful of peanut butter from their jar in the cabinet. I was in quasi recovery for years and I can mark the tipping point to real recovery with buying my own jar of peanut butter. After I got comfortable with it I went through a phase where I was going through a jar a week. That was a year and a half ago and I still love peanut butter but my desire for it has calmed down and as you said I don’t think about it at all besides when I’m deciding what to eat. It’s very freeing! And I did end up gaining weight from eating peanut butter all the time and cutting back exercise and all the other recovery stuff but it’s what my body needed to be healthy, and many days I feel great in my body. To the power of peanut butter!",
      "created_utc": 1627830845.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h7dylcd",
      "author": "YourFrogMom",
      "body": "This post made me smile, I remember when I first started recovery and I was *ravenous* and routinely would eat peanut butter and nutella from the jar, or heaped it on bananas or toast or just on a spoon- It's the best feeling, to be so free after so much anxiety, after so many rules. Good memories:) I'm so excited for you and your recovery! I wish you all the best",
      "created_utc": 1627873465.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h7do4ua",
      "author": "lbc08001",
      "body": "Are you, me?! When I allow myself to just have scoops of peanut butter when I want it (finally allowed myself this past week) I stop thinking about food and obsessing over peanut butter. Like, duh, it should be obvious but actually allowing myself to do it and realize it...brilliant. and delicious.",
      "created_utc": 1627867880.0,
      "score": 4,
      "context": []
    }
  ]
}