{
  "id": "owyw9m",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1627978192.0,
  "title": "\"It's okay for me to treat myself like a human being.\"",
  "selftext": "That's a line I've had in my head for a few days now. When I feel triggered, when my weight fluctuates, when I get that stupid \"I feel fat\" feeling, when I feel like I don't look good enough or thin enough..\n\nIt's really hitting home that I actually treated myself like some kind of object in my ED: A stupid, malfunctioning object that should somehow be okay on such little food, nutrition and energy, that can and should follow and adhere to all these crazy, restrictive rules. \n\nIt's *really* okay for me to treat myself like a human being.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/owyw9m/its_okay_for_me_to_treat_myself_like_a_human_being/",
  "score": 84,
  "num_comments": 6,
  "comments": [
    {
      "id": "h7k4xdk",
      "author": "Front_Lecture_580",
      "body": "thank you i needed to read this ❤️ and i’m so glad your able to recognise this for yourself as well",
      "created_utc": 1628002648.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h7kfd9u",
      "author": "lilyskins",
      "body": "There’s this really amazing poem by Mary Oliver that has low-key saved my life; it’s titled Wild Geese and starts with the words “You do not have to be good.” Every time I think about engaging in disordered behaviors I repeat that to myself, because I really don’t have to be “good” according to my ED. I only have to be me, and that’s all I can ask of myself :)",
      "created_utc": 1628007261.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h7kv07y",
      "author": "None",
      "body": "I’m going to write down that quote to remember, what a lovely and powerful reminder that we deserve the same love and care we give to others and that we are human, not machines, and we need food and water and love just like everyone else.",
      "created_utc": 1628013709.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7m6y4l",
      "author": "andthestarslookdown",
      "body": "Sounds like a great mindset! Thank you for sharing your insight.",
      "created_utc": 1628034562.0,
      "score": 1,
      "context": []
    }
  ]
}