{
  "id": "ozyffr",
  "subreddit": "fuckeatingdisorders",
  "author": "Retexo",
  "created_utc": 1628360361.0,
  "title": "Unpopular opinion: eating disorder treatment centers are fucked.",
  "selftext": "I was listening to a podcast (I had no idea it would turn out to be about EDs) and an anorexic woman spoke of her time there and how it “saved her life” despite that she had relapses later on that were bad. She also spoke about how hard it was to be there and the constant sobbing and misery. She spoke of the mealtimes and that no one was allowed to talk about food, their struggles, their experiences, their hardships. Nothing like that. Silence. Eat in silence. \n\nI understand that that method can give one time to think and get used to the THOUGHTS of eating, but at the same time, I realized how pointless a center could be. Being around a bunch of others like yourself, you KNOW they’re comparing to you, and you’re comparing to them. It’s a game. Who is the sickest? Who can heal the best? Who can maintain the lowest weight? Who can gain the most weight? Judgment. Arguing. Struggling. Hating. \n\nIt’s fucking stupid. And then when you get out, you’re not “healed” you just go through life a few months longer, maybe years, of being at a weight that you’re not dying at. Then you relapse. Everyone relapses. So what’s the point? A prolonged life by maybe a few months or a few years? \n\nShe also spoke of how her depression has never gone away, even though she is now “recovered.” \n\nI do not believe in recovery. Don’t misunderstand, I believe that recovery is for some people and if it helps them, I am glad. But me personally, no. \n\nI just don’t understand eating disorder centers. It’s a comparison nightmare, and we all know that EDs are FUELED majorly on comparisons. It’s a big part of a lot of people’s identity, even. For a while or for forever. So being thrown into a place where not only are you miserable every single day and uncomfortable every single day, you get to be around people who will judge you all the time, and people who you will compare yourself to every day, all day. \n\nThe best treatment for EDs I can think of is individual hospital care, and individual therapy. MAYBE a small support group once in a while. But NOT in a facility where you have to be around others who are like you, who share the same internal and external judgment, who are just as miserable. Misery loves company. What hope do you get from that? It doesn’t make sense to me. \n\nThis is only a vent post as well, just something that was on my mind that I needed to get out. In no way am I intending to give anyone a reason to be hopeless. If treatment centers are needed for you, or work for you, I hope it goes well and that you stay happy and healthy, or at least find some peace with yourself and heal. \n\nI just don’t see it in my cards. And I don’t see a reason for this type of treatment after listening to a first hand account of someone who stayed in patient. It’s pretty sad and hopeless to me. It makes me lose even more hope for ever recovering. Which I haven’t much anymore. If any at all. \n\nThanks for reading",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ozyffr/unpopular_opinion_eating_disorder_treatment/",
  "score": 142,
  "num_comments": 35,
  "comments": [
    {
      "id": "h83b8qp",
      "author": "Sareeee48",
      "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
      "created_utc": 1628366626.0,
      "score": 67,
      "context": []
    },
    {
      "id": "h83l3zf",
      "author": "avocadoland",
      "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
      "created_utc": 1628371494.0,
      "score": 30,
      "context": []
    },
    {
      "id": "h83lc5u",
      "author": "sorcerers_apprentice",
      "body": "I honestly don't think this is an unpopular opinion...it's pretty well-acknowledged amongst the ED circles I'm in that treatment centers are, at best, problematic, and, at worst, actively harmful.\n\nLike you, I think that hospitalization for medical issues (and/or severe psychiatric issues like acute suicidality) followed by individual treatment in the community is the way to go. A few things, though:\n\nFirst, community-based treatment often relies upon meeting the patient where they're at and working with them to minimize harm/practice harm reduction where it's indicated. The problem with harm reduction is that (a) in the U.S., insurance companies usually have strict criteria for how much progress you \"should\" be making and how fast, and they might not cover services that practice a harm-reductive/patient-centered approach, and (b) individual providers may be hesitant to take on ED patients who they think of as a \"liability,\" especially if they are not making \"enough\" progress or working towards the goals that the provider thinks should be prioritized.\n\nSecond, I don't think there's a good solution for treating children and teenagers who point-blank refuse help. The best practice is to use family-based treatment, but FBT will not work in a number of situations. For example, FBT is time- and resource-intensive and probably won't be possible in a family where both parents/caregivers work full-time or in a single-parent household. Also, in a situation where there is abuse, FBT will not be effective. In those situations, it might be in the best interests of the child or teenager to get help in a residential setting. But as someone who received treatment as a teenager in an ethically-questionable facility that has fucked with me long-term, I still feel uneasy saying that.\n\nFinally (and this is purely me playing devil's advocate), I *do* want to point out that you can be grateful that a facility saved your life AND resent the way they went about doing it. Which is certainly the case for me and probably lots of people who have been in inpatient/residential treatment.",
      "created_utc": 1628371607.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h84v9l9",
      "author": "vegn_",
      "body": "I totally agree that treatment centers very rarely cure eating disorders. However, they do serve an important purpose by providing symptom interruption when someone is completely unable to improve their eating disorder behaviors at home even with maximum outpatient support.  Although inpatient ED treatment certainly has not led to me being recovered, it has helped me immensely by forcing me to “reset” my eating and ED behaviors when I’ve dug myself too deep into the hole of relapse. Additionally, each time I get nutritionally restored through inpatient treatment it results in my body being healthier overall than if I had not received that period of healthy nutrition (even if I don’t maintain it afterwards). It has definitely saved my life multiple times and/or my body would have lots of extensive damage. \n\nIn terms of actually addressing the psychological piece of eating disorders, I’ve found I make the most progress through receiving outpatient therapy and psychiatric care after an inpatient stay because I’m in a better nutrition and health state and thus more able to handle that work.",
      "created_utc": 1628396548.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h83far9",
      "author": "None",
      "body": "Yeah I agree, unfortunately.\n\nI was at inpatient hospital for 6 months when I was 18, I was mixed with people who had eating disorders and other mental illnesses. \nI made friends with a girl who was suicidal, and guess what? She taught me how to self harm. I would NEVER have done self harm if it wasn’t for being in that hospital. I didn’t even know it was a thing. So after I was released that’s what I did instead of restricting because I couldn’t restrict anymore.\nTo this day, 10 fucking years later I’m still struggling with eating disorders. Obviously impatient and eating disorders help SAVE lives when the person is critically ill but apart from that I agree they are shit. I’m sorry it’s such a shit post but I need to vent too, I’ve never recovered mentally from that",
      "created_utc": 1628368630.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h86364d",
      "author": "shetlandduck",
      "body": "i did a partial hospitalization and it felt like we couldn’t talk about anything ED related. no food, numbers and we couldn’t even name behaviors. what the hell was i doing there if i couldn’t even talk about why i was there?\n\ni was also overweight with EDNOS, struggling with binging, restricting, and purging. for most of my time there i was the biggest person surrounded by thin people needing to gain weight. i was the only one that didn’t get a meal replacement shake if i didn’t finish. i slipped through the cracks by finding meals that felt sad enough and eating the same ones every day. no one noticed, probably because i wasn’t skinny.\n\nright now i haven’t been struggling with behaviors. mostly because my medication stops my binging, which makes it easier not to restrict. but the thoughts are all still there. all of them. yet i wouldn’t even qualify for ED treatment, despite a thin person being able to. if treatment is built to exclude people like me, how am i supposed to recover? if i’m not taken seriously, how am i supposed to recover?",
      "created_utc": 1628430470.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h83kgd7",
      "author": "rileyyj001",
      "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
      "created_utc": 1628371170.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h855aii",
      "author": "tilly-fin",
      "body": "Like so many, I completely agree. While inpatient clinics are amazing for saving your life, they aren’t the best at treating EDs. I’ve found I’ve usually left with more destructive behaviours than I went in with. Individual therapy has been working for me, but like the OP I have resolved within myself that I may ‘recover’ but I will always have disordered thoughts in regards to food.",
      "created_utc": 1628403641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h8ctsbe",
      "author": "categoryischeesecake",
      "body": "I don't think it's that unpopular. I do think that I needed to go to res and should have stayed for longer, but I missed my son so much it was so painful to not see him for a month. \n\nI felt so completely unsafe and I was so unsafe, running around in the dark alone and on no food, feeling like my heart was going to beat out of my chest while I looked for places I could overdose that no one would find me. I couldn't stop crying, at work, on the train, at mass. I had never been in a place where I could think about all the trauma memories and then talk about them, in my entire 30+ years. I needed to be somewhere, longer than a few days, where I was being watched and where I couldn't hurt myself, and where I could think and cry and it was okay. I couldn't do that at home safely. So yes treatment saved my life in that I was actively suicidal and had a plan and intent and means. Did it fix my ED? No.",
      "created_utc": 1628557370.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvoqms8",
      "author": "dudeinablackhoodie4",
      "body": "From my experience I wish the staff would be more understanding and open-minded and listen. And not have us feel like we have to eat until we hurt and get put down  for not being able to finish because of the pain and trying. I personally was trying to eat and would but at a certain point it hurts so bad that I was are in bad pain( could just be the staff where I was at though that would put me down a little) and have us try to talk about more of our disorder instead of us not being able to really talk about it. It felt stupid being there and not talking about it in groups.  I wish they would let us outside but we couldn't. Only a place with bars surrounding it and an open sky. No grass just a floor. It was a box room. \nFelt like a version of prison. Where I was at they would even lie to my family to keep me there. I was accused of doing stuff like excersizing and purging when not doing any of that and kind of got punished for it.. just because my weight kept fluctuating. Why get frustrated at me when my weight is fluctuating and I'm not doing anything wrong? Once again this could just be my experience and other places might be better but damn.",
      "created_utc": 1710907200.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h84hiv6",
      "author": "yogak06",
      "body": "I don't think this is an unpopular opinion. I fully agree",
      "created_utc": 1628388554.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l56bfbc",
      "author": "Vast_Neck5327",
      "body": "In it in tampa rn and i am fuming there everyday it’s ridiculous that we can’t say “triggering” anymore bc they”challenge us to dig deeper”",
      "created_utc": 1716388298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jghevoh",
      "author": "Nearby_Button",
      "body": "Just a question for all of you:\n\nWere you allowed to wear make up in your residential facility? I wasn't. I have scars due to skin picking and I wasn't even allowed to cover them. 😢",
      "created_utc": 1681654284.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k987jlk",
      "author": "LillyPulitzer14",
      "body": "Took the words right out of my heart",
      "created_utc": 1699978374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jxeroc0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1692797427.0,
      "score": 1,
      "context": [
        {
          "id": "h83b8qp",
          "author": "Sareeee48",
          "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
          "created_utc": 1628366626.0
        }
      ]
    },
    {
      "id": "l4z1zby",
      "author": "ninehhs",
      "body": "where did you go?",
      "created_utc": 1716262633.0,
      "score": 1,
      "context": [
        {
          "id": "h83l3zf",
          "author": "avocadoland",
          "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
          "created_utc": 1628371494.0
        }
      ]
    },
    {
      "id": "k3ispfk",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1696472503.0,
      "score": 1,
      "context": [
        {
          "id": "h83l3zf",
          "author": "avocadoland",
          "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
          "created_utc": 1628371494.0
        }
      ]
    },
    {
      "id": "i3lug6a",
      "author": "None",
      "body": "Agree my friend!",
      "created_utc": 1649238974.0,
      "score": 5,
      "context": [
        {
          "id": "h83kgd7",
          "author": "rileyyj001",
          "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
          "created_utc": 1628371170.0
        }
      ]
    },
    {
      "id": "jghe26x",
      "author": "Nearby_Button",
      "body": "Absolutely agree with you.\nIt was living hell.",
      "created_utc": 1681653901.0,
      "score": 5,
      "context": [
        {
          "id": "h83kgd7",
          "author": "rileyyj001",
          "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
          "created_utc": 1628371170.0
        }
      ]
    },
    {
      "id": "l6uc8wu",
      "author": "SnooGiraffes3978",
      "body": "in it now and it is living hell still",
      "created_utc": 1717374394.0,
      "score": 3,
      "context": [
        {
          "id": "h83kgd7",
          "author": "rileyyj001",
          "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
          "created_utc": 1628371170.0
        }
      ]
    },
    {
      "id": "h8h13iy",
      "author": "Retexo",
      "body": "How do you cry in front of someone and think it’s okay? I don’t know about that part for me I guess. Hard to imagine. And it kept you from hurting yourself..but didn’t you do it again soon after getting out of the hospital?",
      "created_utc": 1628638851.0,
      "score": 1,
      "context": [
        {
          "id": "h8ctsbe",
          "author": "categoryischeesecake",
          "body": "I don't think it's that unpopular. I do think that I needed to go to res and should have stayed for longer, but I missed my son so much it was so painful to not see him for a month. \n\nI felt so completely unsafe and I was so unsafe, running around in the dark alone and on no food, feeling like my heart was going to beat out of my chest while I looked for places I could overdose that no one would find me. I couldn't stop crying, at work, on the train, at mass. I had never been in a place where I could think about all the trauma memories and then talk about them, in my entire 30+ years. I needed to be somewhere, longer than a few days, where I was being watched and where I couldn't hurt myself, and where I could think and cry and it was okay. I couldn't do that at home safely. So yes treatment saved my life in that I was actively suicidal and had a plan and intent and means. Did it fix my ED? No.",
          "created_utc": 1628557370.0
        }
      ]
    },
    {
      "id": "k988mxo",
      "author": "LillyPulitzer14",
      "body": "Uggg where was that? Yes at all my places",
      "created_utc": 1699978775.0,
      "score": 1,
      "context": [
        {
          "id": "jghevoh",
          "author": "Nearby_Button",
          "body": "Just a question for all of you:\n\nWere you allowed to wear make up in your residential facility? I wasn't. I have scars due to skin picking and I wasn't even allowed to cover them. 😢",
          "created_utc": 1681654284.0
        }
      ]
    },
    {
      "id": "jxewihr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1692799427.0,
      "score": 1,
      "context": [
        {
          "id": "h83b8qp",
          "author": "Sareeee48",
          "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
          "created_utc": 1628366626.0
        },
        {
          "id": "jxeroc0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692797427.0
        }
      ]
    },
    {
      "id": "l4z6bf9",
      "author": "avocadoland",
      "body": "I went to 2 places, Montecatini and Center For Discovery. I liked Montecatini more, and I was there for about 9 months. Center For Discovery was for the last part of my treatment, a 3 month stint. I’ve heard that the people who work there have changed so I don’t know how much it is like it originally was, but I still feel that it’s a good treatment center.",
      "created_utc": 1716264925.0,
      "score": 2,
      "context": [
        {
          "id": "h83l3zf",
          "author": "avocadoland",
          "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
          "created_utc": 1628371494.0
        },
        {
          "id": "l4z1zby",
          "author": "ninehhs",
          "body": "where did you go?",
          "created_utc": 1716262633.0
        }
      ]
    },
    {
      "id": "k3j9kvk",
      "author": "avocadoland",
      "body": "Hey! I’m happy to help as much as I can :) it depends a bit on how old you are (some places are adolescents only) and what area you are in. I only personally have experience with the treatment centers I went to in my area, but I also have friends I can get information from who have been to some all over the country (US). Feel free to message me if you prefer!",
      "created_utc": 1696481023.0,
      "score": 1,
      "context": [
        {
          "id": "h83l3zf",
          "author": "avocadoland",
          "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
          "created_utc": 1628371494.0
        },
        {
          "id": "k3ispfk",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1696472503.0
        }
      ]
    },
    {
      "id": "l7h3d4v",
      "author": "rileyyj001",
      "body": "So, so sorry friend. Sending you every ounce of love I have in me!! Please take good care, we love you.",
      "created_utc": 1717729332.0,
      "score": 3,
      "context": [
        {
          "id": "h83kgd7",
          "author": "rileyyj001",
          "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
          "created_utc": 1628371170.0
        },
        {
          "id": "l6uc8wu",
          "author": "SnooGiraffes3978",
          "body": "in it now and it is living hell still",
          "created_utc": 1717374394.0
        }
      ]
    },
    {
      "id": "h8h56mo",
      "author": "categoryischeesecake",
      "body": "Well I mean it kind of wasn't okay that I couldn't stop crying all the time. It wasn't like that was what I wanted to be doing lol. I spent a lot of time crying in bathrooms or with my door closed at work. If I could not be crying in front of people then that would be great. There's a reason why I had to take off work and why my office even approved the short term disability. I wasn't super in control of anything. I couldnt do it anymore. But I also don't think crying in front of people is the worst thing. At least in res I could cry and couldn't then go into a spiral of I am going to hurt myself, or have someone get mad at me for being so upset. Most people in res, idk it's not like they're just in there bc they have an Ed. Most people in there are in really bad shape, and I don't mean physically. \n\nIn terms of did I go back to all of that as soon as I got out, yes and no. It put a complete stop to so many of my behaviors, php was not helpful for this but res was, and this is why I wished I had gone to res first and also stayed a little longer. I had been weighing myself 100+ times a day, I have cracked and bought a scale but I have not spent hours getting on and off the scale. I have not cut in a year. I haven't taken laxatives in a year. I have not hoarded my meds to od on in a year. I have been tempted to start scoping out places to go od, but I have not, which is a plus. Am I still restricting and over exercising? Yes. Do I still weigh myself? Yes. Have I still had a lot of si? Yes. I think if you have a good outpatient support system, family, friends, long term providers who get it, then it might be different? I had/have no one outside of people I pay to care about me to help me with my mental health. Grim but true. \n\nTreatment is funny, you are only ready to recover when you are ready to recover. And you have to fake it for awhile until it becomes a new pattern. Was it hard to have people around me tubed and not completing when I was finishing all my meals and snacks? But was I one of those people (not tubed) but sitting frantically trying to push grains of rice around? Also yes. It's a weird thing. \n\nI also am not trying to push treatment, bc idk honestly. I have been out of treatment for almost a year and have not honestly made a ton of progress on the front in the past year, in fact probably slid back from where I was when I discharged from iop. So who knows.",
      "created_utc": 1628640867.0,
      "score": 1,
      "context": [
        {
          "id": "h8ctsbe",
          "author": "categoryischeesecake",
          "body": "I don't think it's that unpopular. I do think that I needed to go to res and should have stayed for longer, but I missed my son so much it was so painful to not see him for a month. \n\nI felt so completely unsafe and I was so unsafe, running around in the dark alone and on no food, feeling like my heart was going to beat out of my chest while I looked for places I could overdose that no one would find me. I couldn't stop crying, at work, on the train, at mass. I had never been in a place where I could think about all the trauma memories and then talk about them, in my entire 30+ years. I needed to be somewhere, longer than a few days, where I was being watched and where I couldn't hurt myself, and where I could think and cry and it was okay. I couldn't do that at home safely. So yes treatment saved my life in that I was actively suicidal and had a plan and intent and means. Did it fix my ED? No.",
          "created_utc": 1628557370.0
        },
        {
          "id": "h8h13iy",
          "author": "Retexo",
          "body": "How do you cry in front of someone and think it’s okay? I don’t know about that part for me I guess. Hard to imagine. And it kept you from hurting yourself..but didn’t you do it again soon after getting out of the hospital?",
          "created_utc": 1628638851.0
        }
      ]
    },
    {
      "id": "k99rvh2",
      "author": "Nearby_Button",
      "body": "The Netherlands, nearby Breda",
      "created_utc": 1699998870.0,
      "score": 2,
      "context": [
        {
          "id": "jghevoh",
          "author": "Nearby_Button",
          "body": "Just a question for all of you:\n\nWere you allowed to wear make up in your residential facility? I wasn't. I have scars due to skin picking and I wasn't even allowed to cover them. 😢",
          "created_utc": 1681654284.0
        },
        {
          "id": "k988mxo",
          "author": "LillyPulitzer14",
          "body": "Uggg where was that? Yes at all my places",
          "created_utc": 1699978775.0
        }
      ]
    },
    {
      "id": "jxf9kab",
      "author": "Sareeee48",
      "body": "Just because they are being a troll gives you absolutely no reason to be a fatphobic asshole yourself. Please read the rules before you comment, thanks.",
      "created_utc": 1692804441.0,
      "score": 0,
      "context": [
        {
          "id": "h83b8qp",
          "author": "Sareeee48",
          "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
          "created_utc": 1628366626.0
        },
        {
          "id": "jxeroc0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692797427.0
        },
        {
          "id": "jxewihr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692799427.0
        }
      ]
    },
    {
      "id": "jxf0cwe",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1692800964.0,
      "score": 1,
      "context": [
        {
          "id": "h83b8qp",
          "author": "Sareeee48",
          "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
          "created_utc": 1628366626.0
        },
        {
          "id": "jxeroc0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692797427.0
        },
        {
          "id": "jxewihr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692799427.0
        }
      ]
    },
    {
      "id": "l4z82f6",
      "author": "ninehhs",
      "body": "thanks for the reply! :)",
      "created_utc": 1716265919.0,
      "score": 1,
      "context": [
        {
          "id": "h83l3zf",
          "author": "avocadoland",
          "body": "I understand where you are coming from, and I can agree that ED treatment centers are lacking in a lot of ways. However, I think some are better than others. My experience with ED treatment centers was actually quite good. In no way was it perfect, but I think I got lucky with the centers that I went to. I was in treatment for a full year (inpatient, residential and then outpatient) and I can honestly say it made a huge, positive difference in my life. I don’t believe I would be here if it wasn’t for the centers I went to. \n\nWe played word games during meals, or had conversations about whatever we felt like talking about (within reason). We were allowed to talk about how we were feeling, or what we were struggling with. In fact, it was encouraged in a supportive setting. We had different groups for all different therapy types, we learned how to cook and portion our meals in a positive way. \n\nI haven’t relapsed in the 5 years since I was in treatment, and I have friends from there that also haven’t relapsed since then. But I have other friends from the same centers who have, multiple times. So I count myself lucky that I haven’t relapsed. That’s not to say it’s been easy the whole time, I’ve had to be careful to stay on track with recovery. I believe there will always be that possibility that I could go back to my eating disorder if I’m not aware of how I’m doing in that regard. \n\nI guess I felt the need to rant a little myself, and wanted to offer an alternative viewpoint/experience in regards to treatment centers. Different things will work very differently for each individual person. I know many people have not had the same experience as me, and I completely understand it. In short, many things still need to change and there are unfortunately many bad treatment centers out there.",
          "created_utc": 1628371494.0
        },
        {
          "id": "l4z1zby",
          "author": "ninehhs",
          "body": "where did you go?",
          "created_utc": 1716262633.0
        },
        {
          "id": "l4z6bf9",
          "author": "avocadoland",
          "body": "I went to 2 places, Montecatini and Center For Discovery. I liked Montecatini more, and I was there for about 9 months. Center For Discovery was for the last part of my treatment, a 3 month stint. I’ve heard that the people who work there have changed so I don’t know how much it is like it originally was, but I still feel that it’s a good treatment center.",
          "created_utc": 1716264925.0
        }
      ]
    },
    {
      "id": "l7wi2no",
      "author": "SnooGiraffes3978",
      "body": "thank you so much <3. its weird but im getting by and trying to see it as a learning opportunity. much love <3",
      "created_utc": 1717984201.0,
      "score": 2,
      "context": [
        {
          "id": "h83kgd7",
          "author": "rileyyj001",
          "body": "I absolutely *refuse* to ever go back to inpatient ED treatment, no matter what it offers. I don’t care if this is a poor mindset or triggering. The places I have been have utterly wrecked me and only worsened my illness and made it stronger.",
          "created_utc": 1628371170.0
        },
        {
          "id": "l6uc8wu",
          "author": "SnooGiraffes3978",
          "body": "in it now and it is living hell still",
          "created_utc": 1717374394.0
        },
        {
          "id": "l7h3d4v",
          "author": "rileyyj001",
          "body": "So, so sorry friend. Sending you every ounce of love I have in me!! Please take good care, we love you.",
          "created_utc": 1717729332.0
        }
      ]
    },
    {
      "id": "jgheswh",
      "author": "Nearby_Button",
      "body": "Were you allowed to wear make up in your residential facility? I wasn't. I have scars due to skin picking and I wasn't even allowed to cover them. 😢",
      "created_utc": 1681654249.0,
      "score": 1,
      "context": [
        {
          "id": "h8ctsbe",
          "author": "categoryischeesecake",
          "body": "I don't think it's that unpopular. I do think that I needed to go to res and should have stayed for longer, but I missed my son so much it was so painful to not see him for a month. \n\nI felt so completely unsafe and I was so unsafe, running around in the dark alone and on no food, feeling like my heart was going to beat out of my chest while I looked for places I could overdose that no one would find me. I couldn't stop crying, at work, on the train, at mass. I had never been in a place where I could think about all the trauma memories and then talk about them, in my entire 30+ years. I needed to be somewhere, longer than a few days, where I was being watched and where I couldn't hurt myself, and where I could think and cry and it was okay. I couldn't do that at home safely. So yes treatment saved my life in that I was actively suicidal and had a plan and intent and means. Did it fix my ED? No.",
          "created_utc": 1628557370.0
        },
        {
          "id": "h8h13iy",
          "author": "Retexo",
          "body": "How do you cry in front of someone and think it’s okay? I don’t know about that part for me I guess. Hard to imagine. And it kept you from hurting yourself..but didn’t you do it again soon after getting out of the hospital?",
          "created_utc": 1628638851.0
        },
        {
          "id": "h8h56mo",
          "author": "categoryischeesecake",
          "body": "Well I mean it kind of wasn't okay that I couldn't stop crying all the time. It wasn't like that was what I wanted to be doing lol. I spent a lot of time crying in bathrooms or with my door closed at work. If I could not be crying in front of people then that would be great. There's a reason why I had to take off work and why my office even approved the short term disability. I wasn't super in control of anything. I couldnt do it anymore. But I also don't think crying in front of people is the worst thing. At least in res I could cry and couldn't then go into a spiral of I am going to hurt myself, or have someone get mad at me for being so upset. Most people in res, idk it's not like they're just in there bc they have an Ed. Most people in there are in really bad shape, and I don't mean physically. \n\nIn terms of did I go back to all of that as soon as I got out, yes and no. It put a complete stop to so many of my behaviors, php was not helpful for this but res was, and this is why I wished I had gone to res first and also stayed a little longer. I had been weighing myself 100+ times a day, I have cracked and bought a scale but I have not spent hours getting on and off the scale. I have not cut in a year. I haven't taken laxatives in a year. I have not hoarded my meds to od on in a year. I have been tempted to start scoping out places to go od, but I have not, which is a plus. Am I still restricting and over exercising? Yes. Do I still weigh myself? Yes. Have I still had a lot of si? Yes. I think if you have a good outpatient support system, family, friends, long term providers who get it, then it might be different? I had/have no one outside of people I pay to care about me to help me with my mental health. Grim but true. \n\nTreatment is funny, you are only ready to recover when you are ready to recover. And you have to fake it for awhile until it becomes a new pattern. Was it hard to have people around me tubed and not completing when I was finishing all my meals and snacks? But was I one of those people (not tubed) but sitting frantically trying to push grains of rice around? Also yes. It's a weird thing. \n\nI also am not trying to push treatment, bc idk honestly. I have been out of treatment for almost a year and have not honestly made a ton of progress on the front in the past year, in fact probably slid back from where I was when I discharged from iop. So who knows.",
          "created_utc": 1628640867.0
        }
      ]
    },
    {
      "id": "jxf7r2y",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking rule 7 (No drama). Please contact the kids if you have any doubts.",
      "created_utc": 1692803770.0,
      "score": 2,
      "context": [
        {
          "id": "h83b8qp",
          "author": "Sareeee48",
          "body": "ED treatment—especially within treatment centers—is severely lacking in *a lot* of ways due to fatphobic/diet culture rhetoric and an overall lack of understanding in terms of how EDs function, as well as a lack of access due to funds/insurance coverage, there is absolutely a need for some type of reform. You’re absolutely right, many people leave treatment fully determined to go right back to their eating disorder because centers did the absolute bare minimum of refeeding and cognitive rewiring.\n\nThat said, I’ve noticed more centers are taking on approaches that don’t emphasize target weights, limited intake, etc. and that’s awesome. Still a long way to go, if course. Especially considering how rampant EDs have become over the last decade alone.\n\nThe one thing I do feel the need to say is that treatment centers aren’t meant to be a cure for all of your mental health woes. depression and anxiety can exist outside of your eating disorder—treatment isnt guaranteed to fix that, nor is it guaranteed to fix your eating disorder for that matter. You can learn all the of the skills at at the best treatment centers in the world to manage your ED but if even if you use them and still relapse, it’s not on them. \n\nAnd it might sound depressing to say I’ll always have an eating disorder, even when recovering, and that my anxiety and depression were worse afterwards because I wasn’t numbing myself anymore; but holy shit I’d rather be depressed here and there and maybe have a relapse once in a blue moon than *always* being in my eating disorder every waking moment with no time for anything else that’s important to me. 🤷🏼‍♀️",
          "created_utc": 1628366626.0
        },
        {
          "id": "jxeroc0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692797427.0
        },
        {
          "id": "jxewihr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692799427.0
        },
        {
          "id": "jxf0cwe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1692800964.0
        }
      ]
    }
  ]
}