{
  "id": "p1q01w",
  "subreddit": "fuckeatingdisorders",
  "author": "honeycakies",
  "created_utc": 1628604795.0,
  "title": "I don't regret weight restoration or recovery at all",
  "selftext": "A few years ago, that August, I was at my worst both mentally and physically. I could've listed a million excuses regarding why I would \"never\" get better. I became anorexic at 11 and couldn't remember anything different. I'd never managed more than a few months of recovery and my relapses progressively worsened. I'd maintained a deathly low weight for 2-3 years and recovery only seemed manageable for anorexics who had less weight to gain. Even my treatment team told me that if I didn't die, I'd likely be sick for the rest of my life (v optimistic!!).\n\nIt took a really long time. But 5 or 6 years later, I'm (TW?) >!45lb heavier,!< yet not ONE part of me misses anorexia anymore. Literally not a single part. This isn't me sugarcoating things; I'm far from full recovery, but even on my worst days, I never, ever think that I want it back or regret where I am now. This is coming from the person who thought that if I ever reached my pre-ED weight again, I'd be suicidal over it forever.\n\nFor a long time, I cried looking at pictures from my LW/teen years in general because I missed my body and \"self control\" so badly. Now, I just feel...numb?? looking at them. It almost feels like looking at another person because my brain blocks out the emotional trauma associated with them, and I genuinely just can't understand why I put myself through that for so long because it makes no sense to me anymore. Honestly, I have little to no memories to look back on outside of starvation when it was severe at 14-18, and as sounds overdramatic as it sounds, it literally makes me cry whenever I start to *really* think about what my days were like, because there's so many tiny things I take for granted nowadays that I would've never even dreamed of back then. Sometimes I'll pass by extremely underweight girls the day after I ate/drank a lot of calories-- but I realize, no, I'd much rather be able to have drinks with my friends and go out dancing, or share food on cute dates and be happy to get treated to food, than to have a fear of consuming anything and feel numb, weak, and empty the entire night just to be \"fragile and skinny.\" And sure, I'm super far from being \"the sickest\" now, and most people wouldn't be able to guess I have an ED-- but there's been so many things in my life that are more meaningful than the title of being sick.\n\nI just always feel \\~weird in August and seeing a lot of posts here made me realize how different my life is now than a few years ago. Yes, I went through it all too: showering with the lights off and not being able to bear touching my body at ALL, extreme hunger, rapid weight gain and overshooting, refeeding syndrome. Being freshly WRed was the hardest few months of my life. That being said, I only ever wonder \"How good would my life be now had I not gone through my worst years?\", not \"How good would my life be now if I'd kept restricting?\"\n\nMy point is, you CAN get better, no matter how far gone you think you are. You're NOT too sick to have hope-- even if you don't believe full recovery is possible for yourself, I cannot express how worth it it is to at least partially heal and get to the point where the thoughts don't have so much power over you anymore. I'm not saying this in the \"uwu IG recovery influencer\" way, but, like, actually mean it in all seriousness. IME, recovery was *very* rough before it got better, so if you're going through a difficult time, please remember that it's a process and likely won't stay like this forever!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/p1q01w/i_dont_regret_weight_restoration_or_recovery_at/",
  "score": 128,
  "num_comments": 9,
  "comments": [
    {
      "id": "h8ez6ni",
      "author": "throwawayseaurchin",
      "body": "Thank you so much for sharing this. I’m currently experiencing the overshoot while in a PHP program and have been feeling suicidal over it. This is just what I needed to read this morning and congratulations on your journey so far!",
      "created_utc": 1628606862.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h8ezmse",
      "author": "lilacpainter001",
      "body": "I'm so glad you got to this point in your life where you understand how good life can get if you stop obsessing over food! I know it will always be hard, but I'm sure your words will inspire a lot of people here<3 I hope you have an amazing day and a wonderful full recovery!!",
      "created_utc": 1628607052.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h8fngp4",
      "author": "None",
      "body": "I am so proud of you <3 your post is helping me push my way towards recovery:)",
      "created_utc": 1628617099.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h8g5iyt",
      "author": "chihuahuaorrat",
      "body": "I really needed this today ❤️",
      "created_utc": 1628624708.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h8hpud4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1628651232.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h8f4ua4",
      "author": "honeycakies",
      "body": "Thank you! :) I overshot by A LOT >!(40lb)!<, but I also developed bulimia straight after anorexia (before beginning recovery), so that was more of the reason since binging is an actual disordered behavior of mine that I've had to work to give up too. That being said, once I stopped both restricting and binging regularly, that's when I progressively returned to the \"natural weight\" and body shape I'd always had by just...going about my life. I'm definitely at my set point now and can maintain it without restriction :)",
      "created_utc": 1628609297.0,
      "score": 12,
      "context": [
        {
          "id": "h8ez6ni",
          "author": "throwawayseaurchin",
          "body": "Thank you so much for sharing this. I’m currently experiencing the overshoot while in a PHP program and have been feeling suicidal over it. This is just what I needed to read this morning and congratulations on your journey so far!",
          "created_utc": 1628606862.0
        }
      ]
    },
    {
      "id": "h8f55ls",
      "author": "honeycakies",
      "body": "Thanks so much, I really do hope people can take it to heart! :') I feel like not feeling sick enough for recovery is a common sentiment I see around on this sub, but feeling TOO sick and hopeless deep down is just as damaging.",
      "created_utc": 1628609432.0,
      "score": 7,
      "context": [
        {
          "id": "h8ezmse",
          "author": "lilacpainter001",
          "body": "I'm so glad you got to this point in your life where you understand how good life can get if you stop obsessing over food! I know it will always be hard, but I'm sure your words will inspire a lot of people here<3 I hope you have an amazing day and a wonderful full recovery!!",
          "created_utc": 1628607052.0
        }
      ]
    },
    {
      "id": "h8gjyve",
      "author": "honeycakies",
      "body": "Ty so much and good luck!! Recovery can go slowwwwly, but sometimes you’ll look back and see how far you managed to come anyway.",
      "created_utc": 1628630938.0,
      "score": 3,
      "context": [
        {
          "id": "h8fngp4",
          "author": "None",
          "body": "I am so proud of you <3 your post is helping me push my way towards recovery:)",
          "created_utc": 1628617099.0
        }
      ]
    },
    {
      "id": "h8gk00w",
      "author": "honeycakies",
      "body": "So glad to hear it helped at least a little!!",
      "created_utc": 1628630952.0,
      "score": 2,
      "context": [
        {
          "id": "h8g5iyt",
          "author": "chihuahuaorrat",
          "body": "I really needed this today ❤️",
          "created_utc": 1628624708.0
        }
      ]
    },
    {
      "id": "h8ji1ta",
      "author": "honeycakies",
      "body": "best realization everrr I'm happy for you too!",
      "created_utc": 1628694178.0,
      "score": 1,
      "context": [
        {
          "id": "h8hpud4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628651232.0
        }
      ]
    }
  ]
}