{
  "id": "p2oly4",
  "subreddit": "fuckeatingdisorders",
  "author": "MooneBoy",
  "created_utc": 1628723610.0,
  "title": "Did anyone else just sort of... Stop having an eating disorder?",
  "selftext": "So i began recovery around this time last year. Went all in, gained weight, got scared, relapsed yada yada yada y'all know the process lol\n\nI started recovery again recently but its completely different. Im just sort of vibing? I know I need to gain weight and thats fine I'll do it. Calories dont scare me anymore, taking rest doesnt scare me, I just wanna get back to normal so Im recovering in order to do so\n\nIm \"all in\" again but honestly its going really easily and im just enjoying my food\n\nIts a really bizarre experience and hard to explain but can anyone relate?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/p2oly4/did_anyone_else_just_sort_of_stop_having_an/",
  "score": 125,
  "num_comments": 26,
  "comments": [
    {
      "id": "h8m2bkn",
      "author": "dollydaze666",
      "body": "Happened to me! I’ve been “recovering” for 4 years, I just decided one day that I love food & I don’t hate myself enough to deny myself it. \n\nI still have ED thoughts, not constantly though & I can forget about them. Maybe twice a year I’ll engage in some form of behaviours for a bit but it’s usually in a crisis.",
      "created_utc": 1628739089.0,
      "score": 62,
      "context": []
    },
    {
      "id": "h8lo7ke",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1628727455.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h8m9gl3",
      "author": "None",
      "body": "yes i totally relate to this, i've had some scant negative thoughts here and there, but i'm able to ignore them and it never stops me from eating (and enjoying) my food.  i'm never skipping meals or even thinking about doing that, now i just wonder what i'm gonna eat and when i'm gonna eat it!  just kind of....fizzled out one day.  took a lot of work to get here, but i'm proud of myself :)",
      "created_utc": 1628743289.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h8mfvaz",
      "author": "ontopofyourmom",
      "body": "I've read that half of all alcoholics who stop drinking manage to stop drinking on their own, or with a little therapy/self-help books. Half.\n\nDifferent thing, of course, but it's not unfair to make an analogy in this context.",
      "created_utc": 1628747524.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h8mx101",
      "author": "internerderner2",
      "body": "I actually had a similar experience early on in my recovery.\n\nI had been restricting heavily for a while, lost a lot of weight, was very underweight and had no idea what was happening to me. I was cold, weak, numb, obsessed with food. I was no longer myself. One day I got so fed up (pun intended) that I just decided to do what felt obvious to me: eat. Eat until I felt truly satisfied and at least until I reached my pre-ED weight.\n\nAnd so I did. I enjoyed it. I didn't really care. It was awesome - I got to eat all the food! Got to get rid of my stupid looping thoughts about eating! And leave this scary beast behind for good! \n\nThen, as I approached my pre-ED weight, I started to get scared that I'd never stop eating. And I turned to the internet for comfort. So I found the recovery community...and weirdly enough, it gave me so many fears and rules and obsessive thoughts that I regret even finding out about it. It taught me how I \"should\" feel as a recovering anorexic, what I \"should\" be scared of, how to recover \"the right way\" and what I should expect in recovery and it simply triggered me into relapse. And I've been struggling since then.\n\nI still feel that I missed my golden chance at full recovery, and that if I had been sick 20 years ago when reddit/youtube/forums etc. weren't a thing yet, today I'd be fully recovered. I'm so f*cking mad about it.",
      "created_utc": 1628761706.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h8mheqx",
      "author": "None",
      "body": "Yes every time I go into remission after a major relapse (except for the first time when I was a minor and weight restore was involuntary)\n\nMy major relapses last for several years, and recovery is usually peppered with minor relapses before I even get anywhere close to healthy weight.\n\nUsing my latest episode as an example, I’ve seriously maxed out my efforts, and to no avail, for a couple years now and it seemed like I was fighting a losing battle. Only in the last month or two I’ve broken a plateau and reached my highest weight since 2019.\n\nThe bizarre thing is I’ve realized that I’m putting relatively way less effort into it now, it seems to be just fading into background noise.\n\nI am relieved and also hopeful bc from previous experiences (particularly the longest relapse I had lasting from 1998 until 2003) I know that once this happens I’m out of the woods.\n\nI still have several more kilos to restore but I consider myself in remission now. I’ve come so far in such a short space of time, relative to the length of the relapse. I’m a full 3 BMI points higher since this time last year!\n\nDetermination and courage finally pays off. Give yourself credit, congratulations on your recovery wins!",
      "created_utc": 1628748660.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h8n8dmx",
      "author": "Sareeee48",
      "body": "I kinda went through something similar; my first “round” of recovery, if you can even call it that, was thrown completely out the window after 1) I started retaining water after only increasing my intake by a small margin, and 2) I realized how much I *actually* had to eat during the refeeding process.\n\nAfter finally choosing recovery in 2020 (when I was 1000% convinced I’d never recover *ever*), and realized I actually had zero access to a gym and lockdown meant I couldn’t hide my exercise addiction and weird food habits from my partner anymore, I just… let go. And it was awesome, for the first time in ***years*** I ate without any anxiety, and I even felt okay initially gaining and retaining a shitload of water. I really felt like I’d be able to recover pretty easily.\n\nHowever, it only lasted about a month or so. The honeymoon phase, if you will, wore off. The anxiety I hadn’t felt in weeks came crashing down and I relapsed for a few months. Not to say this will happen to you, of course.  It’s awesome when you aren’t full of anxiety and dread about weight gain, etc. but be cautious at the very least.",
      "created_utc": 1628769931.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h8ma28x",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1628743657.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h8nb843",
      "author": "Various-List",
      "body": "It can feel like it when life is going smoothly. Then something happens and in the blink of an eye you’re back relying on those old familiar coping skills.",
      "created_utc": 1628771570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8nkoay",
      "author": "HaloTopHoe",
      "body": "Yep! Was in a quasi recovery mode for like 2 years where i maintained a barely underweight bmi. I have lots of mental and physical illnesses  (4 autoimmune diseases including Lupus) so anyway after trying like 20 different med cocktails i was just recently put on the last resort med lol last resort because they actually give it to nursing home pts that wont eat to stimulate their appetite lol my last med trial did the same but gave NO MENTAL BENEFITS at all so i stopped that after 2 months. The 1 I've recently added however (aka the fat pill) has helped my anxiety and OCD intrusive thoughts  TREMENDOUSLY . Like, better than anything i ever tried. So much so that even though I've gained weight,  the relief from my debilitating anxiety outweighs  (hehe) the weight gain. I'm currently at the lower end of a healthy weight now and feel so much better!! I gained alot quite fast but my mental state is the best it's EVER been.  So im just trying to control my intake and exercise,  but unlike before, i don't have a total breakdown if i overeat or don't exercise.  I honestly didn't believe i would keep taking it  because of the weight gain aspect, but damn it's helped me so much mentally that i plan to try to stick with it!",
      "created_utc": 1628776304.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8nzczf",
      "author": "shetlandduck",
      "body": "i relate, kinda. i started Vyvanse for my ADHD and it completely stopped my binging. therefore, it stopped my binge/restrict cycle. breaking that cycle calmed my mind enough to not need to restrict. i was hovering around my usual weight without effort. for some reason that was okay.\n\ni have ED thoughts to the point that i still tell mental health professionals i have an ED because i’m still very aware of potential triggers. it feels weird to say i’m in recovery because i didn’t /do/ anything, and coming off of Vyvanse would likely trigger my binging again.\n\nit’s nice to read this post and the comments to know i’m not the only one that didn’t have the “typical” recovery process.",
      "created_utc": 1628782605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8ob4v4",
      "author": "Caroline_Directioner",
      "body": "that’s incredible! i’m so happy for you :)",
      "created_utc": 1628787372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8ocb5a",
      "author": "alcvline",
      "body": "Weirdly enough, a very intense manic episode kind of allowed me to \"recover\" for a while. I know people tend to usually eat less during mania, but I was so happy and carefree that I just ... stopped everything. \nI didn't have the time nor the focus necessary to keep up with my ED. I couldn't bother counting calories or even weighing myself. I have no clue if that will last,and I might relapse someday, but at least it showed me that being \"ED-free\" is possible. Even though it was triggered by my mental health, it allowed me to have hope to reach this point someday at a normal state.",
      "created_utc": 1628787843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8pew5r",
      "author": "dude_duh",
      "body": "Same here! I got into an extremely healthy relationship and my confidence went through the roof. Seven years later, still together and still have a good relationship with food and my body. I do sometimes have to deal with mild insecurities but it's never gotten bad since.",
      "created_utc": 1628803705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8mbuaj",
      "author": "MooneBoy",
      "body": "That's so great that you can forget about the thoughts, congrats!",
      "created_utc": 1628744786.0,
      "score": 14,
      "context": [
        {
          "id": "h8m2bkn",
          "author": "dollydaze666",
          "body": "Happened to me! I’ve been “recovering” for 4 years, I just decided one day that I love food & I don’t hate myself enough to deny myself it. \n\nI still have ED thoughts, not constantly though & I can forget about them. Maybe twice a year I’ll engage in some form of behaviours for a bit but it’s usually in a crisis.",
          "created_utc": 1628739089.0
        }
      ]
    },
    {
      "id": "h8mbsmk",
      "author": "MooneBoy",
      "body": "If it helps, it took me one big HUGE relapse, and a real life situation where I realised I was weak and too thin, in order for me to feel this way\n\nSometimes your motivation doesn't come from within. Hang in there, friend \n\nYour time will come :)",
      "created_utc": 1628744756.0,
      "score": 12,
      "context": [
        {
          "id": "h8lo7ke",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628727455.0
        }
      ]
    },
    {
      "id": "h8mc001",
      "author": "MooneBoy",
      "body": "You should be proud its amazing to think so freely! Its almost like U've mentally recovered and I can just think to myself \"just gotta gain weight, keep the weight on and then I'll be fine\" Im so excited for recovery",
      "created_utc": 1628744888.0,
      "score": 3,
      "context": [
        {
          "id": "h8m9gl3",
          "author": "None",
          "body": "yes i totally relate to this, i've had some scant negative thoughts here and there, but i'm able to ignore them and it never stops me from eating (and enjoying) my food.  i'm never skipping meals or even thinking about doing that, now i just wonder what i'm gonna eat and when i'm gonna eat it!  just kind of....fizzled out one day.  took a lot of work to get here, but i'm proud of myself :)",
          "created_utc": 1628743289.0
        }
      ]
    },
    {
      "id": "h8mggn9",
      "author": "MooneBoy",
      "body": "Not an unbelievable statistic at all. I feel at some point a lot of people can just say \"nope. Fuck this. Ive had enough. This is awful\" and snap themselves into recovering",
      "created_utc": 1628747960.0,
      "score": 15,
      "context": [
        {
          "id": "h8mfvaz",
          "author": "ontopofyourmom",
          "body": "I've read that half of all alcoholics who stop drinking manage to stop drinking on their own, or with a little therapy/self-help books. Half.\n\nDifferent thing, of course, but it's not unfair to make an analogy in this context.",
          "created_utc": 1628747524.0
        }
      ]
    },
    {
      "id": "h8nbliq",
      "author": "Enduendada",
      "body": "Oh, I had pretty much the same experience. My best attempt at recovery was the first one: I got fed up with the looping thoughts, the rules, the hunger, and so I committed to just eating whenever I was hungry, stopping when I was full, and challenging fear foods. It was awesome! It was entirely intuitive, back when I didn't even know how feel the IE rabbit hole goes, like I was just truly doing my best to mend my relationship with food while also trying to not let it be such a big part of my life. And it worked? I was truly free and I think I would've recovered—\n\nExcept that a couple of days later I had to weight myself for a procedure and the number they told me (which, in retrospect, wasn't even that big of a deal???) Triggered right back into my behaviours 😔 With the pandemic the relapse got worst and I was going insane with the loneliness of not being able to talk to anyone who understood, so I somehow found Reddit and yeah, it helps but sometimes you pick up others fears and it's kind of bad lol\n\nEdit: sent comment before I was done writing",
      "created_utc": 1628771773.0,
      "score": 5,
      "context": [
        {
          "id": "h8mx101",
          "author": "internerderner2",
          "body": "I actually had a similar experience early on in my recovery.\n\nI had been restricting heavily for a while, lost a lot of weight, was very underweight and had no idea what was happening to me. I was cold, weak, numb, obsessed with food. I was no longer myself. One day I got so fed up (pun intended) that I just decided to do what felt obvious to me: eat. Eat until I felt truly satisfied and at least until I reached my pre-ED weight.\n\nAnd so I did. I enjoyed it. I didn't really care. It was awesome - I got to eat all the food! Got to get rid of my stupid looping thoughts about eating! And leave this scary beast behind for good! \n\nThen, as I approached my pre-ED weight, I started to get scared that I'd never stop eating. And I turned to the internet for comfort. So I found the recovery community...and weirdly enough, it gave me so many fears and rules and obsessive thoughts that I regret even finding out about it. It taught me how I \"should\" feel as a recovering anorexic, what I \"should\" be scared of, how to recover \"the right way\" and what I should expect in recovery and it simply triggered me into relapse. And I've been struggling since then.\n\nI still feel that I missed my golden chance at full recovery, and that if I had been sick 20 years ago when reddit/youtube/forums etc. weren't a thing yet, today I'd be fully recovered. I'm so f*cking mad about it.",
          "created_utc": 1628761706.0
        }
      ]
    },
    {
      "id": "h8mhjy3",
      "author": "MooneBoy",
      "body": "Wow I'm sorry to hear you struggled for so long, but it looks like you have your head straight and are ready for full recovery. Best wishes on your journey :)",
      "created_utc": 1628748770.0,
      "score": 3,
      "context": [
        {
          "id": "h8mheqx",
          "author": "None",
          "body": "Yes every time I go into remission after a major relapse (except for the first time when I was a minor and weight restore was involuntary)\n\nMy major relapses last for several years, and recovery is usually peppered with minor relapses before I even get anywhere close to healthy weight.\n\nUsing my latest episode as an example, I’ve seriously maxed out my efforts, and to no avail, for a couple years now and it seemed like I was fighting a losing battle. Only in the last month or two I’ve broken a plateau and reached my highest weight since 2019.\n\nThe bizarre thing is I’ve realized that I’m putting relatively way less effort into it now, it seems to be just fading into background noise.\n\nI am relieved and also hopeful bc from previous experiences (particularly the longest relapse I had lasting from 1998 until 2003) I know that once this happens I’m out of the woods.\n\nI still have several more kilos to restore but I consider myself in remission now. I’ve come so far in such a short space of time, relative to the length of the relapse. I’m a full 3 BMI points higher since this time last year!\n\nDetermination and courage finally pays off. Give yourself credit, congratulations on your recovery wins!",
          "created_utc": 1628748660.0
        }
      ]
    },
    {
      "id": "h8n8rl2",
      "author": "MooneBoy",
      "body": "Thanks for the warning, don't worry I am very, very aware of how powerful anorexia can be. I've been extremely wary the last few days and I still notice some compulsions, but at least I call myself out on my bullshit and put a stop to them asap\n\nBest of luck with your recovery, I hope you find your freedom again",
      "created_utc": 1628770163.0,
      "score": 0,
      "context": [
        {
          "id": "h8n8dmx",
          "author": "Sareeee48",
          "body": "I kinda went through something similar; my first “round” of recovery, if you can even call it that, was thrown completely out the window after 1) I started retaining water after only increasing my intake by a small margin, and 2) I realized how much I *actually* had to eat during the refeeding process.\n\nAfter finally choosing recovery in 2020 (when I was 1000% convinced I’d never recover *ever*), and realized I actually had zero access to a gym and lockdown meant I couldn’t hide my exercise addiction and weird food habits from my partner anymore, I just… let go. And it was awesome, for the first time in ***years*** I ate without any anxiety, and I even felt okay initially gaining and retaining a shitload of water. I really felt like I’d be able to recover pretty easily.\n\nHowever, it only lasted about a month or so. The honeymoon phase, if you will, wore off. The anxiety I hadn’t felt in weeks came crashing down and I relapsed for a few months. Not to say this will happen to you, of course.  It’s awesome when you aren’t full of anxiety and dread about weight gain, etc. but be cautious at the very least.",
          "created_utc": 1628769931.0
        }
      ]
    },
    {
      "id": "h8mc45l",
      "author": "MooneBoy",
      "body": "I love what you say about your body I feel the exact same way. I don't love my body but.. it is what it is and its not important",
      "created_utc": 1628744965.0,
      "score": 2,
      "context": [
        {
          "id": "h8ma28x",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1628743657.0
        }
      ]
    },
    {
      "id": "h8nbflx",
      "author": "MooneBoy",
      "body": "Might sound strange but this is oddly encouraging as life is certainly not going smoothly for me right now lol I've just been coping differently I guess. I'll be sure to stay on top of things, thanks!",
      "created_utc": 1628771683.0,
      "score": 1,
      "context": [
        {
          "id": "h8nb843",
          "author": "Various-List",
          "body": "It can feel like it when life is going smoothly. Then something happens and in the blink of an eye you’re back relying on those old familiar coping skills.",
          "created_utc": 1628771570.0
        }
      ]
    },
    {
      "id": "h8nzjtm",
      "author": "MooneBoy",
      "body": "I absolutely agree. I feel strange saying I'm in recovery when all I do is eat lol, but I don't dare say I'm recovered because then I'll start taking it easy. I'm also relieved to know that others just sort of snapped out of it like I did",
      "created_utc": 1628782683.0,
      "score": 2,
      "context": [
        {
          "id": "h8nzczf",
          "author": "shetlandduck",
          "body": "i relate, kinda. i started Vyvanse for my ADHD and it completely stopped my binging. therefore, it stopped my binge/restrict cycle. breaking that cycle calmed my mind enough to not need to restrict. i was hovering around my usual weight without effort. for some reason that was okay.\n\ni have ED thoughts to the point that i still tell mental health professionals i have an ED because i’m still very aware of potential triggers. it feels weird to say i’m in recovery because i didn’t /do/ anything, and coming off of Vyvanse would likely trigger my binging again.\n\nit’s nice to read this post and the comments to know i’m not the only one that didn’t have the “typical” recovery process.",
          "created_utc": 1628782605.0
        }
      ]
    },
    {
      "id": "h8ncw1u",
      "author": "dollydaze666",
      "body": "It’s not that I can forget them really, but I can dismiss them. I have the ED thoughts every day.",
      "created_utc": 1628772480.0,
      "score": 9,
      "context": [
        {
          "id": "h8m2bkn",
          "author": "dollydaze666",
          "body": "Happened to me! I’ve been “recovering” for 4 years, I just decided one day that I love food & I don’t hate myself enough to deny myself it. \n\nI still have ED thoughts, not constantly though & I can forget about them. Maybe twice a year I’ll engage in some form of behaviours for a bit but it’s usually in a crisis.",
          "created_utc": 1628739089.0
        },
        {
          "id": "h8mbuaj",
          "author": "MooneBoy",
          "body": "That's so great that you can forget about the thoughts, congrats!",
          "created_utc": 1628744786.0
        }
      ]
    },
    {
      "id": "h8mifnl",
      "author": "ontopofyourmom",
      "body": "Most cigarette smokers, too. But that is a very straightforward addiction, as difficult as it is to beat. \n\nAlcohol has social and self-medication elements on top of the addiction itself, but it seems like people who are ready to stop can deal with those things.\n\nEDs can be the worst psychiatric conditions that people are capable of recovering from, combinations of multiple disorders that vary from person to person. \n\nVery different things, but none can be treated without first making a decision to stop. Even if you have to make that decision a bunch of times.",
      "created_utc": 1628749434.0,
      "score": 7,
      "context": [
        {
          "id": "h8mfvaz",
          "author": "ontopofyourmom",
          "body": "I've read that half of all alcoholics who stop drinking manage to stop drinking on their own, or with a little therapy/self-help books. Half.\n\nDifferent thing, of course, but it's not unfair to make an analogy in this context.",
          "created_utc": 1628747524.0
        },
        {
          "id": "h8mggn9",
          "author": "MooneBoy",
          "body": "Not an unbelievable statistic at all. I feel at some point a lot of people can just say \"nope. Fuck this. Ive had enough. This is awful\" and snap themselves into recovering",
          "created_utc": 1628747960.0
        }
      ]
    },
    {
      "id": "h8nf95s",
      "author": "Sareeee48",
      "body": "Thanks! I’m actually 1.5 years into recovery, weigh restored and eat normally… I still have ED thoughts and impulses, I just don’t act on them.",
      "created_utc": 1628773710.0,
      "score": 1,
      "context": [
        {
          "id": "h8n8dmx",
          "author": "Sareeee48",
          "body": "I kinda went through something similar; my first “round” of recovery, if you can even call it that, was thrown completely out the window after 1) I started retaining water after only increasing my intake by a small margin, and 2) I realized how much I *actually* had to eat during the refeeding process.\n\nAfter finally choosing recovery in 2020 (when I was 1000% convinced I’d never recover *ever*), and realized I actually had zero access to a gym and lockdown meant I couldn’t hide my exercise addiction and weird food habits from my partner anymore, I just… let go. And it was awesome, for the first time in ***years*** I ate without any anxiety, and I even felt okay initially gaining and retaining a shitload of water. I really felt like I’d be able to recover pretty easily.\n\nHowever, it only lasted about a month or so. The honeymoon phase, if you will, wore off. The anxiety I hadn’t felt in weeks came crashing down and I relapsed for a few months. Not to say this will happen to you, of course.  It’s awesome when you aren’t full of anxiety and dread about weight gain, etc. but be cautious at the very least.",
          "created_utc": 1628769931.0
        },
        {
          "id": "h8n8rl2",
          "author": "MooneBoy",
          "body": "Thanks for the warning, don't worry I am very, very aware of how powerful anorexia can be. I've been extremely wary the last few days and I still notice some compulsions, but at least I call myself out on my bullshit and put a stop to them asap\n\nBest of luck with your recovery, I hope you find your freedom again",
          "created_utc": 1628770163.0
        }
      ]
    },
    {
      "id": "h8nfhrm",
      "author": "MooneBoy",
      "body": "Oh that's great! Im hoping I can stop acting on all of mine too. I'm still taking it day by day despite the huge leap forward",
      "created_utc": 1628773832.0,
      "score": 0,
      "context": [
        {
          "id": "h8n8dmx",
          "author": "Sareeee48",
          "body": "I kinda went through something similar; my first “round” of recovery, if you can even call it that, was thrown completely out the window after 1) I started retaining water after only increasing my intake by a small margin, and 2) I realized how much I *actually* had to eat during the refeeding process.\n\nAfter finally choosing recovery in 2020 (when I was 1000% convinced I’d never recover *ever*), and realized I actually had zero access to a gym and lockdown meant I couldn’t hide my exercise addiction and weird food habits from my partner anymore, I just… let go. And it was awesome, for the first time in ***years*** I ate without any anxiety, and I even felt okay initially gaining and retaining a shitload of water. I really felt like I’d be able to recover pretty easily.\n\nHowever, it only lasted about a month or so. The honeymoon phase, if you will, wore off. The anxiety I hadn’t felt in weeks came crashing down and I relapsed for a few months. Not to say this will happen to you, of course.  It’s awesome when you aren’t full of anxiety and dread about weight gain, etc. but be cautious at the very least.",
          "created_utc": 1628769931.0
        },
        {
          "id": "h8n8rl2",
          "author": "MooneBoy",
          "body": "Thanks for the warning, don't worry I am very, very aware of how powerful anorexia can be. I've been extremely wary the last few days and I still notice some compulsions, but at least I call myself out on my bullshit and put a stop to them asap\n\nBest of luck with your recovery, I hope you find your freedom again",
          "created_utc": 1628770163.0
        },
        {
          "id": "h8nf95s",
          "author": "Sareeee48",
          "body": "Thanks! I’m actually 1.5 years into recovery, weigh restored and eat normally… I still have ED thoughts and impulses, I just don’t act on them.",
          "created_utc": 1628773710.0
        }
      ]
    }
  ]
}