{
  "id": "p7jlwn",
  "subreddit": "fuckeatingdisorders",
  "author": "cerealisreallygood",
  "created_utc": 1629394609.0,
  "title": "Minimum intake means minimal life",
  "selftext": "We all know that *minimum* number, the ones apps won't let you set lower than, the one thats what a toddler should be eating around but is praised and followed by people everywhere, and a number that has convinced my brain I was in recovery by eating at. \n\nI tried to go back to work and realized how this minimum was holding me back. How it is only giving me enough energy to do just that, the bare minimum. I have simply just been existing without having the energy to do much of anything else. And it's a shitty existence. I want a life again. \n\nI ended up \"binging\" last night after working on my feet for three days and trying to keep up this magic number and I'm trying to use it as fuel to get myself to eat more so I can get to the point where I am ACTUALLY functioning. I still feel guilty, yes, but I just have to lie to myself and give myself grace even if I really feel like shit about it. Beating myself up will only fuel that guilt and shame and keep me in these unhealthy patterns. \n\nAfter a period of restriction you can't just eat a normal amount and expect to go back to your old life and habits scotch free. The body is keeping the score and mine was NOT HAPPY working on my feet for 6 hours 3 days in a row. \n\nA couple months ago, I would've torn myself to shreds after overeating, continued to torture my body and break it down until it had no choice but to make me absolutely desperate for as much nutrition as possible in the shortest period of time. But I got up, gave myself a reality check, and made breakfast. It's kinda cool to start listening to my body for once and finding out what makes it feel good and when it's like fuck no. I have a long way to go, but I knew real recovery would be a lot of trial and error. Here's to moving forward 🥳",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/p7jlwn/minimum_intake_means_minimal_life/",
  "score": 83,
  "num_comments": 0,
  "comments": []
}