{
  "id": "pbj4dg",
  "subreddit": "fuckeatingdisorders",
  "author": "Kind_Term6662",
  "created_utc": 1629921710.0,
  "title": "So many \"edrecovery\" posts feature skinny girls??",
  "selftext": "Aight it might just be my personal turmoil but the eating disorder recovery hashtag is FULL of young white girls who are skinny as skinny gets, posting abt their recovery. \n\nI'm not saying they cant go through eating disorders-- of course they can!! But.. why are so many of them filling the edrecovery hashtag? \n\nI'm following it so I can get better... but I think those posts are making me worse. I see how they are \"better\" and managed to keep their small bodies. What?? Is going on??\n\nHow are they able to do that? It kinda pisses me off. I'm not sure why. I feel like-- it's not fair, it's a lie. How come I have to stay in a big body while they get to live out their lives, skinny and mentally sound? What the hell?? Their posts are almost thinspo at this point, showing off their small bodies staring how many stretch marks they have when in actuality they are still small-- small enough to have visible collarbones. \n\nI think I'm just jealous. It's so tiring looking at myself while seeing how they are still preaching recovery and looking like that. It pisses me off too bc I feel like they are furthering eating disorders, their posts make me think they're saying \"oh! You can recover and look as good as me.\" When that's a lie.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/pbj4dg/so_many_edrecovery_posts_feature_skinny_girls/",
  "score": 123,
  "num_comments": 18,
  "comments": [
    {
      "id": "haci31t",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1629928191.0,
      "score": 54,
      "context": []
    },
    {
      "id": "hacq81n",
      "author": "Aspenisbi",
      "body": "sharp cats lavish close knee fanatical fragile longing stupendous rain\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1629931734.0,
      "score": 10,
      "context": []
    },
    {
      "id": "had41lu",
      "author": "None",
      "body": "part of the discomfort is mourning exactly what you said: that some ppl get to recover into a small body while a lot of us have to live with the reality of being bigger--including social ostracism, medical weight bias, lack of accessibility... another part is that a lot of those girls are 100% fooling themselves and are not recovered at all and spreading dangerous messages to vulnerable ppl, and often profiting off it as well.\n\nfor me, following anti diet registered dietitians and body positive/recovery accounts with ppl who looked like me and bigger were helpful, and just straight up never looking at tags and keeping to that little group i'd curated.",
      "created_utc": 1629938045.0,
      "score": 10,
      "context": []
    },
    {
      "id": "haefete",
      "author": "absolute_boy",
      "body": "They're popular because their audience is disordered people not in recovery or in quasi-recovery who want to believe they can get better without gaining weight.",
      "created_utc": 1629965710.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hacpxrb",
      "author": "Sareeee48",
      "body": "Thin privilege is very real, and it is very prevalent in the ED recovery community. I think a huge reason we mainly see these types of bodies is because they are still socially acceptable, whereas others in larger bodies are not. You’ll get praised for living in a privileged body (white, thin girls are told they’re strong, beautiful and deserve to eat) while those in larger bodies either get a whole different kind of praise or straight up disgust and encouragement to engage in ED behaviors (think, the “you’re so brave” comments for doing basic things just because they’re bigger or being told they should eat less solely due to their size).\n\nI don’t follow these accounts anymore. Tbh, I don’t follow most thin ED accounts because quite frankly, they make me feel fucking terrible about myself and I ask myself the same questions you’ve asked here: why can’t I look like that?\n\nEdit: I’m not saying recovering into a thin body isn’t okay, it absolutely is, but I feel like there is a stark difference between those who recover into a thin body (or play the role of recovered while still actively engaging in behaviors) and those who don’t. And those who don’t often have a significantly harder time trying to navigate recovery and accepting their body at a higher weight compared to those who gained very little. EDs are mental disorders and everyone with an ED is a victim worthy of recovery, but to say “it’s hard for everyone” ignores the pain those in larger bodies go through just for simply existing in a society that literally condemns being fat at all costs.",
      "created_utc": 1629931606.0,
      "score": 19,
      "context": []
    },
    {
      "id": "haebmgu",
      "author": "Aliinga",
      "body": "I understand the frustration. I don't enjoy seeing quasi-body checks of skinny people in gym clothes under the edrecovery hashtag (implying that there is a way *somehow* to keep the skinny body, reap all the \"benefits\" of an ED yet be rid of all the behaviors and thoughts. Oh, and you should hit the gym, contrary to all recovery advice ever). Neither do I like seeing people contort themselves into impossible positions to show off belly rolls and cellulite (implying this time that recovery means attaining 'unattractive' attributes that you now must reclaim as attractive, an exposure therapy in all the things your ED fears. Yet, half the people who post these are still really hot).\n\nI think the issue is with body pictures per se. If you feel the need to post your body checks to show off your recovered body I suspect you are not fully healed yet. I am not saying \"don't post pictures of yourself\" but rather \"dont post body checks\". The ED was already so body-focused, recovery should not be the same. Instead show me other things you've 'gained': Outings, new hobbies, even the new sport you are doing, but show it to me in a way that it is not about how it changes your body. \n\nAnd not surprising that this is mostly done by, as you word it, \"young white girls who are skinny as skinny gets\", because they fit the bill of what mainstream media portrays as attractive. There are also recovery accounts of those who do not look like that, but they receive far more backlash (\"you are trading one ED for the other!!\"). They do not sell a fantasy of 'recovery in a skinny body that stays skinny', so that's why they are probably not on trending.",
      "created_utc": 1629962564.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hacy1n0",
      "author": "GuiltyVictem",
      "body": "I understand why this is frustrating but I also feel like the frustration is somewhat misdirected? I think we agree that there is a small population of people that do genuinely recover into smaller than average bodies. This is better directed at society than people who may just be publicly celebrating an improvement in their mental health?\n\nI don’t know if this is just a one off strange issue that I had, but I feel like part of my ED was feeling like I had to “pay” for the generic lottery I had won by naturally having a body that society accepted, in addition to developing an OCD fear of losing that privilege. Thin privilege is absolutely real.\n\nI think not every recovery account is helpful for everyone. These might be helpful to some people. I don’t know. Personally I’ve found accounts with people who are a bit larger than I was pre Ed most helpful because I can see someone who is bigger than me living a happy life.",
      "created_utc": 1629935312.0,
      "score": 12,
      "context": []
    },
    {
      "id": "had3p58",
      "author": "AGhostInTheDungeon",
      "body": "I feel you; it can take a huge hit off your self esteem to see girls in recovery who still seem very small, almost suspiciously so. While I can't speak for everyone, I've observed that a lot of people with restrictive EDs tend to be competitive and quick to make comparisons, especially toward other ED sufferers that seem \"sicker.\" There was even a while there that I thought of myself as \"bad at recovery\" because I kept relapsing into b/p while those on my recovery feeds seemed to go weeks and months with no episodes. Made me want to give up, but it helped to remember that that was just the ED talking. The little voice in your head driving you toward ED behaviors will say anything to drag you back in.\n\nWhat I had to do to get over this, that may help you out too, is to unfollow and unsub a lot of ED related stuff entirely. Even pro recovery blogs. It takes a lot of mental focus off the ED because it's not constantly in your feed. That's not to say you can never revisit, but constantly comparing your body and your recovery process to others' isn't going to make you feel any better, and it sounds like you may not be at a point yet where you can control those thoughts. Taking a break gives you time to think about other things -- hobbies you may have abandoned, projects you never finished, relationships that may have suffered. Making peace with your body is a whole other beast (idk anything about that one man,) but recovery is often minute by minute, and maybe it's time to think about whether you really want to spend those minutes staring at other girls on social media and tearing yourself up over them.\n\nTake care of yourself. 💞",
      "created_utc": 1629937887.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hae3cuh",
      "author": "crycry_chemtrails",
      "body": "Social media creates a lot of barriers for people who are anything but white and thin to get noticed by the algorithm. I’d also caution you to direct your anger towards systemic fatphobia rather than at thin bodies. I completely empathize with the sentiment that it pisses you off that these influencers remain thin by societal standards in recovery. But here’s some stuff to keep in mind. A) there is a sizable percentage of “recovery influencers” that are still very much in their eating disorders. Tbh most recovery accounts are really strict about “clean eating” which is far more concerning that the volume of thin bodies on hashtags. B) the only reason you want to be thin I’m the first place is because someone told you that you should. We don’t come programmed caring about this shit. Disordered eating and body image make a lot of businesses a lot of money. So they spend a lot on making you feel like shit about yourself. It’s all prey on the desire for a “solution” to whatever is really bothering you in your life. Part of the game is to feel a sense of jealousy and pit people against each other. And c) never believe what you see on social media. Editing technology has gotten to the point where you can’t tell the difference between a real human and CGI. Again I understand the jealousy but I challenge you to look deeper into why your desire to take up less space  is so strong.",
      "created_utc": 1629956342.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hacu1xa",
      "author": "givemebackmybraincel",
      "body": "you literally just took the words out of my mouth. its a whole new type of frustration & pain, its nice to see someone else addressing it",
      "created_utc": 1629933472.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hb34fsz",
      "author": "None",
      "body": "Agreed. I really appreciate this post. I'm gonna be honest as someone who has had an eating disorder for 13 years (I'm 27) - I've been in the recovery space for a long time and a lot of people are not recovered when they post those body checks and \"perfect\" meals. \n\n&#x200B;\n\nI have a weird, funky, short, thick/strong trans masc body. The anger, IMO, isn't misdirected. People with eating disorders (I have an eating disorder still and am probably going back to treatment soon, with my non-normative body) have RESPONSIBILITY still. We have social responsibility. Too many of us struggle and lose our lives, and especially those of us who are thin and white have got to own up to the role we play in all of it.",
      "created_utc": 1630433395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivvppzf",
      "author": "Worm_net",
      "body": "especially since most ppl with eds never become underweight. it feels artificial that everyone preaching recovery is part of that small percentage.",
      "created_utc": 1668122604.0,
      "score": 1,
      "context": []
    },
    {
      "id": "had083d",
      "author": "AGhostInTheDungeon",
      "body": "You hit the nail on the head. I consider myself mostly recovered and the only time I ever come back to ED subs is when I'm struggling with thoughts/impulses regarding the ED.",
      "created_utc": 1629936311.0,
      "score": 16,
      "context": [
        {
          "id": "haci31t",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1629928191.0
        }
      ]
    },
    {
      "id": "hag8gq1",
      "author": "BeastieBeck",
      "body": "Like a dream coming true. Being recovered but still/finally skinny.",
      "created_utc": 1629999730.0,
      "score": 6,
      "context": [
        {
          "id": "haefete",
          "author": "absolute_boy",
          "body": "They're popular because their audience is disordered people not in recovery or in quasi-recovery who want to believe they can get better without gaining weight.",
          "created_utc": 1629965710.0
        }
      ]
    },
    {
      "id": "haefsfj",
      "author": "BeastieBeck",
      "body": "I fully agree and had to think of this:\n\nhttps://www.scienceofeds.org/2014/11/06/eating-disorder-recovery-in-a-non-normative-body/",
      "created_utc": 1629966043.0,
      "score": 3,
      "context": [
        {
          "id": "hacpxrb",
          "author": "Sareeee48",
          "body": "Thin privilege is very real, and it is very prevalent in the ED recovery community. I think a huge reason we mainly see these types of bodies is because they are still socially acceptable, whereas others in larger bodies are not. You’ll get praised for living in a privileged body (white, thin girls are told they’re strong, beautiful and deserve to eat) while those in larger bodies either get a whole different kind of praise or straight up disgust and encouragement to engage in ED behaviors (think, the “you’re so brave” comments for doing basic things just because they’re bigger or being told they should eat less solely due to their size).\n\nI don’t follow these accounts anymore. Tbh, I don’t follow most thin ED accounts because quite frankly, they make me feel fucking terrible about myself and I ask myself the same questions you’ve asked here: why can’t I look like that?\n\nEdit: I’m not saying recovering into a thin body isn’t okay, it absolutely is, but I feel like there is a stark difference between those who recover into a thin body (or play the role of recovered while still actively engaging in behaviors) and those who don’t. And those who don’t often have a significantly harder time trying to navigate recovery and accepting their body at a higher weight compared to those who gained very little. EDs are mental disorders and everyone with an ED is a victim worthy of recovery, but to say “it’s hard for everyone” ignores the pain those in larger bodies go through just for simply existing in a society that literally condemns being fat at all costs.",
          "created_utc": 1629931606.0
        }
      ]
    },
    {
      "id": "haeebqe",
      "author": "BeastieBeck",
      "body": ">Thin privilege is absolutely real.\n\nCan of worms, especially on ED and/or diet subs.\n\nBut I absolutely agree that thin privilege is all too real.\n\nRegarding recovery accounts: I avoid them like the plague after I've clicked on some that were linked on various boards. They seem to feature *thin* girls/young women (doesn't matter what ED they've recovered from) in 99% of the cases, either still thin after having gained some weight or having no loose skin after losing weight at all.\n\nThat's not my reality. My reality is having to deal with the health consequences of long-term ED.\n\nI prefer not to feel like shit by comparing myself to these girls/women. I'm a 44 year old hag with loose skin planning to have skin removal surgery and not a 19 year old skinnyminny posting pictures of their overnight oats with a body considered \"good\".",
      "created_utc": 1629964776.0,
      "score": 7,
      "context": [
        {
          "id": "hacy1n0",
          "author": "GuiltyVictem",
          "body": "I understand why this is frustrating but I also feel like the frustration is somewhat misdirected? I think we agree that there is a small population of people that do genuinely recover into smaller than average bodies. This is better directed at society than people who may just be publicly celebrating an improvement in their mental health?\n\nI don’t know if this is just a one off strange issue that I had, but I feel like part of my ED was feeling like I had to “pay” for the generic lottery I had won by naturally having a body that society accepted, in addition to developing an OCD fear of losing that privilege. Thin privilege is absolutely real.\n\nI think not every recovery account is helpful for everyone. These might be helpful to some people. I don’t know. Personally I’ve found accounts with people who are a bit larger than I was pre Ed most helpful because I can see someone who is bigger than me living a happy life.",
          "created_utc": 1629935312.0
        }
      ]
    },
    {
      "id": "hajl0q9",
      "author": "Sareeee48",
      "body": "I don’t think it’s misplaced frustration at all—yes, many people do recover into smaller bodies, but those who do are much more accepted in the IG recovery community and gain large followings pretty easily, and a lot of those individuals are still engaging in behaviors (think “I can eat a lot now because I weight train/exercise a lot to stay thin!”). I don’t think it’s misguided to point out the contrasting views and following between these influencers and those in larger bodies. Are all of them like this? No, there are a lot of amazing influencers who just happen to be thin, but I’ve been in the recovery community long enough to observe that *a lot* of them are not truly in recovery and it’s keeping people stuck.",
      "created_utc": 1630063903.0,
      "score": 4,
      "context": [
        {
          "id": "hacy1n0",
          "author": "GuiltyVictem",
          "body": "I understand why this is frustrating but I also feel like the frustration is somewhat misdirected? I think we agree that there is a small population of people that do genuinely recover into smaller than average bodies. This is better directed at society than people who may just be publicly celebrating an improvement in their mental health?\n\nI don’t know if this is just a one off strange issue that I had, but I feel like part of my ED was feeling like I had to “pay” for the generic lottery I had won by naturally having a body that society accepted, in addition to developing an OCD fear of losing that privilege. Thin privilege is absolutely real.\n\nI think not every recovery account is helpful for everyone. These might be helpful to some people. I don’t know. Personally I’ve found accounts with people who are a bit larger than I was pre Ed most helpful because I can see someone who is bigger than me living a happy life.",
          "created_utc": 1629935312.0
        }
      ]
    },
    {
      "id": "hak4zqt",
      "author": "GuiltyVictem",
      "body": "Oh I have interpreted this post as frustration toward the unfairness that some people recover into small bodies and receive a large amount of attention online, not as an accusation that these people are not actually recovered (The lie being that your recovery will look like theirs). \n\nI agree people who are not recovered posting about recovery are dangerous and that would be well directed frustration. And I will admit I’ve done it myself (luckily I have no public following but I really hope I didn’t trigger anyone I know personally 😔). I’ve gone through periods of being in deep in denial of my restriction. \n\nThis crap is so tricky. I try not to spend a bunch of time trying to decipher a stranger’s inner wold and just unfollow if the posts are not making me feel good, but sometimes it does become obvious that they are still obsessed with food and their appearance.",
      "created_utc": 1630073813.0,
      "score": 2,
      "context": [
        {
          "id": "hacy1n0",
          "author": "GuiltyVictem",
          "body": "I understand why this is frustrating but I also feel like the frustration is somewhat misdirected? I think we agree that there is a small population of people that do genuinely recover into smaller than average bodies. This is better directed at society than people who may just be publicly celebrating an improvement in their mental health?\n\nI don’t know if this is just a one off strange issue that I had, but I feel like part of my ED was feeling like I had to “pay” for the generic lottery I had won by naturally having a body that society accepted, in addition to developing an OCD fear of losing that privilege. Thin privilege is absolutely real.\n\nI think not every recovery account is helpful for everyone. These might be helpful to some people. I don’t know. Personally I’ve found accounts with people who are a bit larger than I was pre Ed most helpful because I can see someone who is bigger than me living a happy life.",
          "created_utc": 1629935312.0
        },
        {
          "id": "hajl0q9",
          "author": "Sareeee48",
          "body": "I don’t think it’s misplaced frustration at all—yes, many people do recover into smaller bodies, but those who do are much more accepted in the IG recovery community and gain large followings pretty easily, and a lot of those individuals are still engaging in behaviors (think “I can eat a lot now because I weight train/exercise a lot to stay thin!”). I don’t think it’s misguided to point out the contrasting views and following between these influencers and those in larger bodies. Are all of them like this? No, there are a lot of amazing influencers who just happen to be thin, but I’ve been in the recovery community long enough to observe that *a lot* of them are not truly in recovery and it’s keeping people stuck.",
          "created_utc": 1630063903.0
        }
      ]
    }
  ]
}