{
  "id": "pnsdub",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1631580722.0,
  "title": "Y’all NEED to remember that restriction isn’t encouraged here",
  "selftext": "Even if your ED tells you to, even if you haven’t eaten all day but don’t feel hungry, even if you’re experiencing extreme hunger and you *just ate* but want more, even if you’re weight restored, even if you’re binging out of hunger, even if you have BED, even if someone previously told you that you need to eat some arbitrary amount to maintain some arbitrary weight/BMI. \n\nFirstly, if you’re binging due to hunger, then you’re going to need to make sure you aren’t restricting (aka listening to your body and honoring your hunger); restriction leads to reactive binging and the body wants to compensate for that; hense why those with restrictive EDs eat a whole fucking lot in recovery. And if you have ensured you’re honoring your body’s need for food but still experiencing relentless hunger, then look into other possibilities such as chronic health conditions, etc. \n\nSecondly, suffering from BED doesn’t mean you need to restrict either (I *really* wanna address the one). BED isn’t driven by hunger and restricting isn’t going to fix the binging—if anything, it’s going to exacerbate it and make it worse in the long term. Not that I’m saying it’s easy, and I understand why restriction seems like a logical response to overeating in a society that basically encourages undereating, especially for those in larger bodies. It’s hard when it feels like you can’t trust your body and that food is the enemy. But if you want to stop binging then learning to cope with the emotional responses and reactions that lead to a binge and those that happen after a binge, hopefully with the help of a professional, is going to be a lot more effective than restricting to “manage” them. Telling others who have restrictive EDs that they need to eat (and eat  *a god damn lot* if they are in recovery) according to their hunger isn’t encouraging BED and tbh I’m a little confused why some of y’all are reporting comments for that.\n\nBottom line: I understand “recommending” a minimum number of calories to people, especially those who are still terrified of eating (regardless of your ED), might not sit well with others but if you’re struggling with an ED and you’re hungry, then you 99.9% of the time, you should eat. \n\nYou are absolutely allowed to believe that restriction would work for you or whoever else, but there are other subs more suited for that kind of talk so I don’t really think this is the place for it and I am not going to argue with y’all about it.\n\nSo… Thanks for coming to another one of my TED Talks. Good night.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/pnsdub/yall_need_to_remember_that_restriction_isnt/",
  "score": 95,
  "num_comments": 0,
  "comments": []
}