{
  "id": "pr6t19",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1632053607.0,
  "title": "Things to keep in mind during recovery",
  "selftext": "Hey guys, I’m gonna keep this short and sweet so I can get right to the point; I realize that many people don’t know what’s going on with their body when they start recovery from a restrictive ED. There are so many things I myself wish I knew before diving into recovery, so I thought I’d compile the most common/important things together in a list for you all, in hopes that it will help y’all who are just starting recoveru.\n\n1. **Your body is gonna do some wack shit for awhile:** you’ll likely retain a fuckload of water within the first few days/weeks (I promise, it’s not true weight gain yet); you’ll be hit with severe body aches and extreme exhaustion to the point you can’t leave the bed and sleep for 14+ hours every day. You’ll be bloated and bowel irregularities are basically a nonnegotiable, necessary evil. Take this time to really, *truly* rest for at least a few weeks, if possible.\n\n2. **No, you’re not developing BED. Yes, it’s normal to eat thousands of calories in a single day:** I can’t tell you how many times I’ve seen y’all freak out over the possibility of having BED right after choosing to recover from your restrictive ED (not talking shit, I absolutely understand the fear and the lack of knowledge surrounding extreme hunger). But that’s just not how BED works; the DSM-5 has made it clear that true binging cannot coincide with restrictive behaviors as it is then classified as an abnormal circumstance that leads to rhe large consumption of food. In other words, it is impossible to binge early on in recovery when your body is struggling with months/years of malnutrition. You need to eat back *all* of those calories you restricted over the span of your ED, *on top* of your normal daily caloric intake (which can range anywhere from 2500-3500kcal). This can round out to a lot of food, but I’m telling you right now it’s normal. I ate upwards to 11,000kcal the first month or so. The most important rule to follow is, if you’re eating out of hunger, it’s not binging.\n\n3. **Extreme/mental hunger should always be honored:** even if you’re at a “normal” BMI. Even if you’re technically overweight by BMI standards. Even if your doctor or psychiatrist (who aren’t nutritionists or dietitians, btw, and have little to no academic learning in nutrition) tell you to eat at some arbitrary number that leaves you feeling unsatisfied and hungry. Extreme/mental hunger can be so hard to cope with, especially if you don’t fit into the “emaciated anorexic” stereotype. But you can’t work around it either; the only way out is through.\n\n4. **2000 calories ain’t it:** you need to eat more, probably *much* more than this in recovery, and very likely *after* recovery as well. 2000 is what most 10 year olds eat. And on a similar note, you also dont need to follow some made up TDEE you got from the internet. Those calories are what you’d need if you were in a coma and not moving and don’t account for the various factors in your life. Walking, breathing, typing, even eating burns energy. Honor your hunger.\n\n5. **A starved brain is incapable of doing the important psychological work and the neural rewiring essential for long-term recovery:** this is the paradox of why eating disorders are so difficult to treat; the starved brain is irrationally terrified of food and weight gain to the point it can be fatal, but the only way to overcome those fears for good is to is first eat and gain the weight. You can prep yourself and brace for the inevitable panic attacks and emotional breakdowns, but you cannot rewire your brain when it is still malnourished. You have to gain the weight first and allow your brain to heal as well.\n\n6. **Dont expect weight restoration to solve all of your problems:** this might seem to contradict number 5, but bear with me. I read all of these things about how weight restoration would bring me mental clarity and miraculous neural rewiring… that wasn’t the case whatsoever. I mean, don’t get me wrong—I’m definitely *much* better off, but you need to learn the skills to fight off relapse for long term recovery/remission, hopefully with a professional if you have the option of doing so. Don’t assume you just need to gain weight to get rid of the eating disorder.\n\n7. **Your body decides your set point, not you:** I feel like so many of us get caught up by this one. Our weight is influenced by any *number* of factors, including genetics, sex, height, and environment. Your body knows what weight it functions best at and it will probably be at a weight higher than what you’re comfortable with. But you *cannot* fully recover until you accept that your body calls the shots. Please challenge that fear of weight gain and of being at a higher weight because it’s going to hinder your recovery if you don’t. Ask yourself these important questions: what’s so wrong with being at a higher weight? Who told you being at a higher weight was unacceptable? Would you tell a loved one that they are any less deserving of kindness, love and respect because they are at a higher weight?\n\n8. **Youll probably overshoot, and it might not taper off:** basically, you gain “extra” weight above your preED set point weight. One thing I read (I can try to find the source if you’d like) that suggested that the longer and/or more severe we restricted, the higher we’d overshoot. But here’s the thing: overshoot weight is *necessary* weight. The body has a set fat to fat free mass (muscle) ratio; it first must regain optimal fat levels before it can restore muscle mass, hense why we look soft and dough-y after weight restoration. The excess fat will be used to support long term healing, balance hormones levels, and overall used as an insurance policy of sorts in case you decide to restrict again and it will have energy to keep you going if that happens for however many months/years. If you developed your ED as a child/teen, it may not taper off as weight gain is a normal, healthy part of aging into adults and we typically don’t stop growing until age 25. I restricted pretty dedicatedly both as a child for 3ish years and as an adult for 6 years and I overshot by *a lot.* I kept hoping and hoping it would taper off soon because so many people said it would, but it hasn’t and as much as I hate to admit, it may never will. This is also something you will have to accept and work through in order to prevent a relapse.\n\n9. **Let go of exercising and compulsive movement:** At least temporarily for conventional exercise or general movement, until your weight and body have stabilized. Firstly, the severe swelling, bloating, body aches, extreme fatigue, and extreme hunger will not only make it exceedingly difficult to maintain an exercise routine, it will likely make these symptoms significantly worse. Your body is severely depleted of energy and requires a ridiculous amount of rest. Now, obviously you don’t need to do absolutely nothing for a few months to a couple of years, but you may require bed rest the first month or so (I did); after you finally start to experience the benefits of increased energy, I still suggest to keep it away from conventional exercise until you are sure your weight is stable and you can choose to exercise from a place of enjoyment rather than a compulsive need or as compensatory behaviors. I know some people say the continue to exercise but I don’t really recommend it, personally.\n\n10. **Weight loss is not compatible with recovery:** you cannot focus on weight loss while actively trying to recover. You have an eating disorder; you can’t just tell your brain, “I’m gonna restrict again but this time will be different!” It won’t. On top of that, your body gives fuck all about what you *want* to happen, all it knows is that suddenly there’s not enough food coming in and you’re back to square one before you know it. You cannot choose to lose weight and actively remain in recovery. It’s counterintuitive. I encourage you to let go of the idea of manipulating your body/weight and accept your body at whatever weight it ends up at because you are worth more than some arbitrary BMI number that was created to represent white European men *only* (yup, no women or non white individuals whatsoever) in the 1830s. \n\n11. **Junk food and sugar are your FRIENDS:** firstly, I want to say that you should stop giving moral value to food altogether. ALL food is good food. ALL food has nutrients. Take an apple and a cupcake for example; we know the two are different nutritionally speaking. An apple has fiber and various different vitamins and nutrients such as vitamin C and potassium… but what you might not know is that a chocolate cupcake has magnesium and other essential minerals including calcium, sulfur, zinc, iron, copper, potassium; flavonoids with antioxidant properties; and vitamins B1, B2, B3, B5, B9 and E. Not only this, it is a great choice for those in an energy deficit due to restriction due to its higher calorie content. I tell y’all all the time here to honor your cravings for these foods because they hold a significant purpose in recovery, contrary to what diet culture will have you believe. Junk food will literally save your life where low calorie foods such as fruits and veggies will fail you. You are going to suffer from gastrointestinal distress that will be exacerbated by fibrous fruits, vegetables and whole grains, leading to painful gas, bloating, cramps, and irregular bowel movements. High calorie, nutrient dense foods will actually be easier on your digestion and metabolize much quicker, which will promote faster healing. And remember: once you’re weight restored, you *do not* have to go back to restricting these foods. Eat them when you want, because restricting them will cause you to fall back into ED habits, even if you think you have control over them. You are allowed to eat the foods you crave for the rest of your life.\n\n12. **As much as your ED will try to convince you, you aren’t the exception to recovery:** We often feel like we’re the exception to the rules of recovery, that it won’t work for us because [insert ED reasoning here]. it will most likely feel like you’ll eat endlessly forever, you’ll be hungry forever, you’ll gain forever. That your metabolism is irreversibly damaged… and as someone who thought the same exact thing, I can tell you with certainty that your eating, hunger, and weight will normalize (“normalize” meaning your body will find the middle ground that is healthiest for you). Your body isn’t stupid, it’s the result of millions of years of complex evolution whose sole purpose is to keep you alive; the last thing your body has in mind is to keep you eating and gaining until you die. I promise you that you aren’t gaining as quickly as you probably think. In fact, there is no “too quick” in recovery.\n\n13. ***DON’T*** **compare yourself to everyone else and their recovery:** everyone is different. Don’t compare your progress with some YouTube or IG influencers who only gained x or xx lbs while you gained more or look different or eat more. *Your* recovery is *yours* and you are doing what you need to do. Try not to stress about others whose background you don’t know, because for all you know they could still be struggling. You’re doing your best and that’s what matters.\n\n14. **Recovery isn’t linear, so take your time:** challenge yourself and your ED with opposite actions and unlearning societal norms that harm you, but don’t push yourself too far too quickly. Take your time, go at your own pace. You have an eating disorder and deserve to be kind to yourself. Recovery will have ups and downs and sometimes you might slip for a little while, tomorrow is a new day, fuck even a minute from now is a new moment. Don’t beat yourself up for small mistakes and learn from the big ones. Okay? Okay.\n\n\nIf you have anyting else to add, or have any questions feel free to leave a comment! Hope this helps some of you out. ❤️\n\n***Edit:*** y’all thanks so much for all the rewards. 🥺❤️",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/pr6t19/things_to_keep_in_mind_during_recovery/",
  "score": 812,
  "num_comments": 75,
  "comments": [
    {
      "id": "i46zzof",
      "author": "Sareeee48",
      "body": "I have stickied this post again because many are asking many early recovery related questions and I don’t always have the time to reply to all of them. If you are new to recovery, or considering recovery, please give this a read and don’t hesitate to ask any questions you may have about the process or any of the bullet points.",
      "created_utc": 1649615240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdgqhal",
      "author": "problematicbeing",
      "body": "This is a great post :) \n\n\nOften your ED will convince you that you are the exception and you will be the one to gain infinitely if you respect your hunger or anything else. Remember that you are not the exception.  That being said, recovery is your path to healing, and you get to choose what works for you and doesn't, which doesn't matter as long as you are healing ♡\n\n\n\nI will say, after 1.5 years in recovery, it does get easier ♡ all of it gets more bearable until the ED shrinks and becomes small enough to stuff into your pocket while you lead a whole and fulfilling life.",
      "created_utc": 1632060723.0,
      "score": 72,
      "context": []
    },
    {
      "id": "hdhd67k",
      "author": "thingsivegottenridof",
      "body": "This post is awesome, I honestly think it should be stickied.\n\nRe: point 6, the way I think of it is that weight restoration gives you the brain space to do the neural rewiring that’s important to full recovery—but you still have to do the neural rewiring. That’s not easy. \n\nRe: point 14, recovery takes years for most. So definitely give yourself some grace :)",
      "created_utc": 1632070383.0,
      "score": 31,
      "context": []
    },
    {
      "id": "he5ipz7",
      "author": "no_uapples",
      "body": "Is point 9 valid if you are REALLY passionate about a sport and use that as a way to reduce the ed? I've finally thrown away my smart watch (finally) and decided to just eat whole foods (that I enjoy) to improve my energy and performance :) I am finally honouring my hunger for once and I feel great ✨✨",
      "created_utc": 1632525404.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hdhz1b6",
      "author": "throwaway-m1",
      "body": "THIS!! Every person who has an eating disorder or know someone with an eating disorder needs to read this.",
      "created_utc": 1632078986.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hfdwjol",
      "author": "Alwaysweirdellie",
      "body": "I just HAD to reward this after I read it. Thank you so so much for this post, it means way more than you know 😊",
      "created_utc": 1633374006.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hn9y7le",
      "author": "curiogirlx",
      "body": "As notable modern thinker Lil Peep once said…. Save That Shit [on Reddit so you can read it 100 times during the ups and downs of recovery]",
      "created_utc": 1638672388.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hkvokoj",
      "author": "Complex_Professor873",
      "body": "Hi is it ok if i ask for some advice?\nI just went through my first 3 weeks of recovery and am currently going through extreme hunger. i cant stop eating even before going to bed!! I dont mind the eating part, but is it really ok for me to eat before sleep?? Because i swear i get soooo hungry before bed 😩",
      "created_utc": 1637085262.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i3b2gxr",
      "author": "momonomino",
      "body": "I know I'm late to the party, but I'm a few days into recovery so this was really helpful to read. I was just barely in the \"normal weight\" category but I've been heavily restricting for almost 2 years now, and over my life I've cycled between heavily restricting with purging and BED, so this time around it's been really hard to keep in mind that just because I'm eating more doesn't mean I'm going back to my binge tendencies. The extreme hunger has been the hardest part for me but this will help me power through. Thank you.",
      "created_utc": 1649041723.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i7dhqwa",
      "author": "MercyDivineOF",
      "body": "I didn't know I needed to read this until I finished reading it. \n\nI've been allowing my obsessive behaviours linger back into my brain, and toyed with the idea of starting to restrict SOME food. But no. Absolutely not. Heck no. \n\nThank you for this.",
      "created_utc": 1651716195.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hdhbua3",
      "author": "flannelonflannel",
      "body": "thank u for this post! 💓",
      "created_utc": 1632069837.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hionqbc",
      "author": "moon_nibs",
      "body": "this helped me so much to cope today i cant say how grateful i am, i even told it to my mom who knows about my ed, because i always think that my body is stupid and it doesnt know how to use the food i eat every day therefore it needs my \"help\" to work properly by counting cals, restricting and exercising, and if i eat \"bad foods\" instead of \"healthy foods\" my body will pick that food and instantly make me fat, but actually it will make more good than harm since i tend to only eat clean because im still afraid of junk foods, my weight rn its at a set point where i dont gain nor lose weight, so this all really makes sense, sometimes i eat too much and think im going to gain a lot of weight but now i see that is not the case at all, im really glad i discovered this community to help us thru this healing journey, thank you for this post ❤",
      "created_utc": 1635625358.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hhyzpgr",
      "author": "seshprinny",
      "body": "I just reread this post again this morning, it's really informative. I'm wondering about the weight gain that is expected and necessary during recovery, I'm sure people gain across the board, but everything I've read has been from an UW Anorexic recovery perspective.\n\nWould it be different for people who are already a normal weight? Or people with different EDs? Or would they be likely to need to gain the same proportionate amount as someone underweight? I'm sorry if this is a silly question. I think I may have jumped ahead on the food journey on my own and now I have lots of questions for my therapist tomorrow 😬😂",
      "created_utc": 1635159518.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hfkgiug",
      "author": "Rainbow_violist731",
      "body": "Thank you so much for your beautiful advice!!!",
      "created_utc": 1633494606.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hp77nm9",
      "author": "None",
      "body": "You seriously don't know how much this means to me. I just started recovery yesterday and was scared out of my mind about the amount (and types) of foods my body was telling me to eat. Everything you mentioned in this post has reassured me so much and challenged my deeply rooted ed thoughts and beliefs. I know that whenever I doubt myself, this will be the post I read to keep me going. All my feelings and cravings just make so much sense now and I feel so comforted and understood. I can't put into words how much this post affected me positively, for lack of better phrasing. Thank you a million times over <3",
      "created_utc": 1639940644.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hq41si3",
      "author": "have-a-great-day1",
      "body": "Helpful af 💓 this post has shifted me into full on recovery mode. I’ve been wanting and trying to recover for a while and this post has shifted some perspectives and mindsets that we’re holding me back. Thank you for sharing 😊",
      "created_utc": 1640581048.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i47ejcl",
      "author": "Prestigious-Bug-7641",
      "body": "OMG I wish I could have you as a therapist.. I keep saying the same about Dr Edith Eger.. You're making such a huge difference doing what you do.. Thankyou for this post and all the comments I see.. Before I recover, I am learning how to.. nothing like mental prep.. ❤️",
      "created_utc": 1649621274.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4cxnhp",
      "author": "Coffeegreysky12",
      "body": "what if you are suddenly losing weight without trying and you have had anorexia for many years, and remained at a low weight for years and never actually recovered from it? does this mean recovery is no longer a possibility for someone like me. I feel like harm reduction is my only option at this point. feel like I ruined myself and I can't be one of the people who recovers and gets healthy",
      "created_utc": 1649719980.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i8a4yzz",
      "author": "mintyylemonade",
      "body": "I hope I’m not too late. I’ve been in recovery for about 4 months now and have been sticking to the three meals and three snacks and doing pretty okay with eating/not relapsing. The only thing is I’ve started being really conscious of my weight gain around people I know, thinking they know I’ve put on weight and spend a lot of time thinking about it when I’m around people. Also seeing the weight gain in photos. Do you have any thoughts/tips around this? My psychologist is currently unavailable but she’s also kind of harsh around these thoughts, sort of getting me to question I’ve /really/ put on weight (plot twist, I have) or why did I feel like I looked bigger in a photo (because I do?). Anyway I’m just finding a lot of resources which focus on the food side and I’m doing really well there, and even accepting my body mostly when I’m at home/alone. I’ve bought new clothes when I grew out of all my old ones, etc. thank you",
      "created_utc": 1652331099.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i9cn5g1",
      "author": "moonring_",
      "body": "I am incredibly late to this sub in general, but can I just say how helpful this was. Genuinely thought this was only happening to me and I couldn’t understand how I could swing from restriction to BED after getting therapy, but it’s all the process of letting go and being okay with food and hunger cues. Thank you so much for sharing this and pinning it.",
      "created_utc": 1653066014.0,
      "score": 4,
      "context": []
    },
    {
      "id": "il7q8jk",
      "author": "Quiirky_Turtle",
      "body": "as someone who went through recovery and is now an ed dietitian, THIS is so important to hear and to share with people going through recovery. thank you for making this post",
      "created_utc": 1661102066.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7sx5w9",
      "author": "No-Gap8808",
      "body": "Thank you so much for this post. I know it’s 2 years old but this is the first time I’ve seen something so relatable regarding recovery. I thought I was going crazy.\n\nI still struggle so much with my body changes and forever wish I could go back to when I was unwell, the insecurities I’ve unlocked are tenfold but I’m glad to know I’m not alone. You’ve really made me feel so much better.\n\nI noticed some of the thoughts and behaviours were starting to get the better of me again just recently and I really thought I could restrict food without it becoming a problem again. Now I see that it’s not possible.\n\nThank you for talking some sense into my lil ol brain, this is a really kind and important post to make. It’s something I wish I could have been told in therapy. Thank you 🙏🏻",
      "created_utc": 1717933863.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hfpnyw9",
      "author": "Frog-Features",
      "body": "Thank you for this. Having a big wobble 23 months into recovery ❤️‍🩹",
      "created_utc": 1633602486.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibxpjz7",
      "author": "PieceUnfair8375",
      "body": "just joined this server and actually recovering from my eating problems. thank you!",
      "created_utc": 1654918102.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibxpl3e",
      "author": "PieceUnfair8375",
      "body": "just joined this server and actually recovering from my eating problems. thank you!",
      "created_utc": 1654918118.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ilat9o2",
      "author": "None",
      "body": "what if you’re feeling out of control when you’re eating and cannot stop and feel so guilty after. about 1 month i to recovery i had a “binge” and then another one like a month later and then it started becoming a few times a week, and now for the past month it has been everyday and i’ve legit gained nearly 10kg and an almost back at a “normal” BMI. i feel OUT of control and cannot stop eating even if i am physically STUFFED and feel sick. i have a history of binging and purging before anorexia so i’m scared it’s that. but i’m genuinely gaining weight so fast and i’m TERRIFIED i cannot stop eating i’m legit even stealing food from shops and stuff to eat",
      "created_utc": 1661159739.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hjh8pbw",
      "author": "None",
      "body": "One of the best I've ever seen.",
      "created_utc": 1636152409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hlnah0n",
      "author": "None",
      "body": "Thank you so much!🥺❤️",
      "created_utc": 1637594478.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibv8qib",
      "author": "StepdadLRAD",
      "body": "Thank you for writing this. I’m about to enter recovery and I really needed reminders on some of this, but a lot of it was straight up new info.",
      "created_utc": 1654875986.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l18meen",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1714072436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lj4xjp8",
      "author": "None",
      "body": "Just dropping by to say how amazing this post. I am currently 4 months into recovery with a dietitian and a therapist. I am having so many blood sugar problems, and my bowels are werid, my reactions to cabs just sucks, and my bowels feel like they are on OT trying to digest all this food. My body aches in ways I didn't know was possible. \n\nSo thank you for validating that.",
      "created_utc": 1724202035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3f28i7",
      "author": "ramsaybanna1",
      "body": "Brilliant thank you",
      "created_utc": 1734948890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m85u92x",
      "author": "Baseball-East",
      "body": "Bless you friend ",
      "created_utc": 1737382322.0,
      "score": 1,
      "context": []
    },
    {
      "id": "il49gex",
      "author": "Georgia__432",
      "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
      "created_utc": 1661032327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgi07ep",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1681663375.0,
      "score": 0,
      "context": []
    },
    {
      "id": "l89codl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1718194906.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m0vjvqe",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1733583456.0,
      "score": 0,
      "context": []
    },
    {
      "id": "it4b1ie",
      "author": "decentscenario",
      "body": "Thank you for sharing this I needed this today.",
      "created_utc": 1666298994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kp34vw3",
      "author": "Hungry_Nectarine3326",
      "body": "Hello, I just started recovery twelve days ago ..I developed loose skin on my face arms and legs and that was what made me realize I needed to start eating (I was doing keto, over exercising /heavy weight lifting + IF fasting for months) ...I stopped the gym, am eating every 2.5 hours..it's been twelve days and I feel heavier but have noticed no changes in body fat...I would be able to tell cuz the loose skin would refill with expanded fat cells...how long does it take for subcutaneous fat to regrow ? And will the fat come back on my face ? I have had a huge fear that I WONT gain. The weight back ..and I look very weird in the face right now bcuz of the loose skin ...I know this is an odd fear, and I may seem dumb for asking...but I have had a gripping anxiety that I won't gain the fat back in my face and body",
      "created_utc": 1707169641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdh2ozu",
      "author": "Sareeee48",
      "body": "This is a good one! I’ll definitely add them, thanks for your comment. 🙂",
      "created_utc": 1632066040.0,
      "score": 12,
      "context": [
        {
          "id": "hdgqhal",
          "author": "problematicbeing",
          "body": "This is a great post :) \n\n\nOften your ED will convince you that you are the exception and you will be the one to gain infinitely if you respect your hunger or anything else. Remember that you are not the exception.  That being said, recovery is your path to healing, and you get to choose what works for you and doesn't, which doesn't matter as long as you are healing ♡\n\n\n\nI will say, after 1.5 years in recovery, it does get easier ♡ all of it gets more bearable until the ED shrinks and becomes small enough to stuff into your pocket while you lead a whole and fulfilling life.",
          "created_utc": 1632060723.0
        }
      ]
    },
    {
      "id": "jgi0awo",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1681663416.0,
      "score": 0,
      "context": [
        {
          "id": "hdgqhal",
          "author": "problematicbeing",
          "body": "This is a great post :) \n\n\nOften your ED will convince you that you are the exception and you will be the one to gain infinitely if you respect your hunger or anything else. Remember that you are not the exception.  That being said, recovery is your path to healing, and you get to choose what works for you and doesn't, which doesn't matter as long as you are healing ♡\n\n\n\nI will say, after 1.5 years in recovery, it does get easier ♡ all of it gets more bearable until the ED shrinks and becomes small enough to stuff into your pocket while you lead a whole and fulfilling life.",
          "created_utc": 1632060723.0
        }
      ]
    },
    {
      "id": "hdhid2x",
      "author": "Sareeee48",
      "body": "Thank you! I’ll see about getting it stickied. 😊\n\nYou’re totally right about point 6. Weight restoration is absolutely necessary so that you can begin the rewiring; but the rewiring is a process in and of itself that shouldn’t be perceived as a byproduct of weight restoration.",
      "created_utc": 1632072447.0,
      "score": 10,
      "context": [
        {
          "id": "hdhd67k",
          "author": "thingsivegottenridof",
          "body": "This post is awesome, I honestly think it should be stickied.\n\nRe: point 6, the way I think of it is that weight restoration gives you the brain space to do the neural rewiring that’s important to full recovery—but you still have to do the neural rewiring. That’s not easy. \n\nRe: point 14, recovery takes years for most. So definitely give yourself some grace :)",
          "created_utc": 1632070383.0
        }
      ]
    },
    {
      "id": "he5l5bc",
      "author": "Sareeee48",
      "body": "Yes. Your body needs to rest in order to recover and exercise burns more calories, which means you have to eat *more* on top of recovery amounts (that are already particularly high, especially if you have extreme hunger). This makes physical repairs of the body significantly more difficult because you’re burning off much needed energy that it needs to heal. And to top it off, it can cause even more weight gain in the long run because your body is literally fighting you to gain weight at all. The desire to continue exercising when you want to recover is counterintuitive and disordered; you can *always* go back to exercising or sports once you are weight restored and nutritionally rehabilitated. It isn’t going anywhere!\n\nI also really encourage you to reflect on why you only allow yourself “whole foods.” All foods are processed in some way. All foods have a purpose; continuing to give moral value to food (aka, “whole foods is better”) will set you back in recovery.",
      "created_utc": 1632526513.0,
      "score": 19,
      "context": [
        {
          "id": "he5ipz7",
          "author": "no_uapples",
          "body": "Is point 9 valid if you are REALLY passionate about a sport and use that as a way to reduce the ed? I've finally thrown away my smart watch (finally) and decided to just eat whole foods (that I enjoy) to improve my energy and performance :) I am finally honouring my hunger for once and I feel great ✨✨",
          "created_utc": 1632525404.0
        }
      ]
    },
    {
      "id": "hdkph13",
      "author": "Sareeee48",
      "body": "I’m glad you found it helpful!",
      "created_utc": 1632133877.0,
      "score": 5,
      "context": [
        {
          "id": "hdhz1b6",
          "author": "throwaway-m1",
          "body": "THIS!! Every person who has an eating disorder or know someone with an eating disorder needs to read this.",
          "created_utc": 1632078986.0
        }
      ]
    },
    {
      "id": "hfmq9p1",
      "author": "Sareeee48",
      "body": "Hey thanks! I’m so glad you found it helpful!",
      "created_utc": 1633543158.0,
      "score": 3,
      "context": [
        {
          "id": "hfdwjol",
          "author": "Alwaysweirdellie",
          "body": "I just HAD to reward this after I read it. Thank you so so much for this post, it means way more than you know 😊",
          "created_utc": 1633374006.0
        }
      ]
    },
    {
      "id": "hdhiedi",
      "author": "Sareeee48",
      "body": "You’re welcome! ❤️",
      "created_utc": 1632072460.0,
      "score": 4,
      "context": [
        {
          "id": "hdhbua3",
          "author": "flannelonflannel",
          "body": "thank u for this post! 💓",
          "created_utc": 1632069837.0
        }
      ]
    },
    {
      "id": "hip7m6q",
      "author": "Sareeee48",
      "body": "Yayyy, I’m so glad this post has helped you! Welcome to the sub!",
      "created_utc": 1635634511.0,
      "score": 3,
      "context": [
        {
          "id": "hionqbc",
          "author": "moon_nibs",
          "body": "this helped me so much to cope today i cant say how grateful i am, i even told it to my mom who knows about my ed, because i always think that my body is stupid and it doesnt know how to use the food i eat every day therefore it needs my \"help\" to work properly by counting cals, restricting and exercising, and if i eat \"bad foods\" instead of \"healthy foods\" my body will pick that food and instantly make me fat, but actually it will make more good than harm since i tend to only eat clean because im still afraid of junk foods, my weight rn its at a set point where i dont gain nor lose weight, so this all really makes sense, sometimes i eat too much and think im going to gain a lot of weight but now i see that is not the case at all, im really glad i discovered this community to help us thru this healing journey, thank you for this post ❤",
          "created_utc": 1635625358.0
        }
      ]
    },
    {
      "id": "hi1jm1r",
      "author": "Sareeee48",
      "body": "Essentially, yes. Starvation affects all bodies the same, regardless of weight. Only 6% of ED sufferers are clinically underweight, which means that 96% are either “normal” weight or overweight. So that in and of itself should say something. If you’ve been restricting for long periods of time, regardless of your weight, you’re going to have to basically eat back all the calories you denied yourself to fix the damages of your eating disorder.\n\nSince all bodies are different and no two recoveries are the same, nobody will gain the same amount of weight. It all depends on your set point, the severity of your illness, and the duration of it. It may or may not be proportionate to someone who is underweight, but if you were overweight prior to your ED, you may be overweight *after* your eating disorder and that’s totally fine. Even if you are currently underweight. Even if you are currently at a “normal” weight, and so on.\n\nWeight isn’t a sole indicator of health and BMI is a shitty, unscientific method that shouldn’t be used at all, tbh. It doesn’t matter if it’s anorexia, ARFID, OSFED, atypical anorexia, bulimia, weight gain is basically inevitable and should be encouraged. The only exception would be BED, in which case refeeding isn’t the goal. *However*, restriction should still be discouraged as it only perpetuates the desire to binge and doesn’t resolve the real problem—resolve/cope with the emotional stressors and/or trauma that leads to binging and you’ll stop the binging.",
      "created_utc": 1635200842.0,
      "score": 8,
      "context": [
        {
          "id": "hhyzpgr",
          "author": "seshprinny",
          "body": "I just reread this post again this morning, it's really informative. I'm wondering about the weight gain that is expected and necessary during recovery, I'm sure people gain across the board, but everything I've read has been from an UW Anorexic recovery perspective.\n\nWould it be different for people who are already a normal weight? Or people with different EDs? Or would they be likely to need to gain the same proportionate amount as someone underweight? I'm sorry if this is a silly question. I think I may have jumped ahead on the food journey on my own and now I have lots of questions for my therapist tomorrow 😬😂",
          "created_utc": 1635159518.0
        }
      ]
    },
    {
      "id": "hp798r5",
      "author": "Sareeee48",
      "body": "Hey, thanks so much! Im so happy to hear that you found it helpful! I hope this sub as a whole will be a safe place for you throughout your recovery, especially on the hard days. ❤️",
      "created_utc": 1639941305.0,
      "score": 2,
      "context": [
        {
          "id": "hp77nm9",
          "author": "None",
          "body": "You seriously don't know how much this means to me. I just started recovery yesterday and was scared out of my mind about the amount (and types) of foods my body was telling me to eat. Everything you mentioned in this post has reassured me so much and challenged my deeply rooted ed thoughts and beliefs. I know that whenever I doubt myself, this will be the post I read to keep me going. All my feelings and cravings just make so much sense now and I feel so comforted and understood. I can't put into words how much this post affected me positively, for lack of better phrasing. Thank you a million times over <3",
          "created_utc": 1639940644.0
        }
      ]
    },
    {
      "id": "i4d23c9",
      "author": "Sareeee48",
      "body": "I mean anyone can recover if they make the decision of doing so. It doesn’t matter what state you are in. Obviously that does *not* make it easy.\n\nBut yes, sometimes harm reduction is really the best thing you’ve got. As much as I hate to suggest it, palliative care is the better option for some.",
      "created_utc": 1649721975.0,
      "score": 2,
      "context": [
        {
          "id": "i4cxnhp",
          "author": "Coffeegreysky12",
          "body": "what if you are suddenly losing weight without trying and you have had anorexia for many years, and remained at a low weight for years and never actually recovered from it? does this mean recovery is no longer a possibility for someone like me. I feel like harm reduction is my only option at this point. feel like I ruined myself and I can't be one of the people who recovers and gets healthy",
          "created_utc": 1649719980.0
        }
      ]
    },
    {
      "id": "i8g45o1",
      "author": "SecondTriggerEvent",
      "body": "You're doing great! Hunger can cause anxiety, so if you're feeling overly anxious, consider eating more. It is also worth combatting whatever you feel anxious about with logic (and this should get easier the further along recovery you are):  \n\n\nYour body will gain the weight it needs to function properly. It will probably be more than you've idealized. It is what it is. If anyone thinks you should sacrifice your happiness, passion, life, so you can maintain some abritrary weight, then they are sorely mistaken—and that includes your eating disorder. From brain to boot, tummy to thighs, every part of you is worth loving, no matter the configuration.  \n\n\nNow, go and do something fun! Read a book, watch a TV show, play a game. Whatever makes you happy, since you deserve to be happy.",
      "created_utc": 1652447428.0,
      "score": 6,
      "context": [
        {
          "id": "i8a4yzz",
          "author": "mintyylemonade",
          "body": "I hope I’m not too late. I’ve been in recovery for about 4 months now and have been sticking to the three meals and three snacks and doing pretty okay with eating/not relapsing. The only thing is I’ve started being really conscious of my weight gain around people I know, thinking they know I’ve put on weight and spend a lot of time thinking about it when I’m around people. Also seeing the weight gain in photos. Do you have any thoughts/tips around this? My psychologist is currently unavailable but she’s also kind of harsh around these thoughts, sort of getting me to question I’ve /really/ put on weight (plot twist, I have) or why did I feel like I looked bigger in a photo (because I do?). Anyway I’m just finding a lot of resources which focus on the food side and I’m doing really well there, and even accepting my body mostly when I’m at home/alone. I’ve bought new clothes when I grew out of all my old ones, etc. thank you",
          "created_utc": 1652331099.0
        }
      ]
    },
    {
      "id": "ilaxk5s",
      "author": "Sareeee48",
      "body": "You’re experiencing reactive eating episodes. You need to let yourself eat as much as you want without fighting it and it will eventually dissipate. That being said, you don’t have to eat yourself sick either. Take a half hour or so break to let some food digest, sip on some peppermint or ginger tea, lie on your side for a time. Then resume eating when it’s not so uncomfortable.",
      "created_utc": 1661163249.0,
      "score": 2,
      "context": [
        {
          "id": "ilat9o2",
          "author": "None",
          "body": "what if you’re feeling out of control when you’re eating and cannot stop and feel so guilty after. about 1 month i to recovery i had a “binge” and then another one like a month later and then it started becoming a few times a week, and now for the past month it has been everyday and i’ve legit gained nearly 10kg and an almost back at a “normal” BMI. i feel OUT of control and cannot stop eating even if i am physically STUFFED and feel sick. i have a history of binging and purging before anorexia so i’m scared it’s that. but i’m genuinely gaining weight so fast and i’m TERRIFIED i cannot stop eating i’m legit even stealing food from shops and stuff to eat",
          "created_utc": 1661159739.0
        }
      ]
    },
    {
      "id": "l18megw",
      "author": "AutoModerator",
      "body": "This post has been removed because our automoderator detected it as spam. If you believe this action was made in error, please **report** this comment to bring it to the attention of the moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fuckeatingdisorders) if you have any questions or concerns.*",
      "created_utc": 1714072437.0,
      "score": 1,
      "context": [
        {
          "id": "l18meen",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1714072436.0
        }
      ]
    },
    {
      "id": "il4avh0",
      "author": "Sareeee48",
      "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
      "created_utc": 1661032965.0,
      "score": 5,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        }
      ]
    },
    {
      "id": "jgi0ife",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1681663504.0,
      "score": 1,
      "context": [
        {
          "id": "jgi07ep",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1681663375.0
        }
      ]
    },
    {
      "id": "l89o2b4",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).\n\n100% of this still applies even years into recovery. Your experience is yours and you are free to do what you want, but you won’t come onto this sub and encourage disordered behaviors such as restricting food because you think they lack nutrients. All food has nutritional value, and therefore all food offers you sustenance. Many members, including those on the mod team, are several years into recovery and still abide by the advice given in this post. You might not relate to it—which is fine—but many other members do.",
      "created_utc": 1718199595.0,
      "score": 1,
      "context": [
        {
          "id": "l89codl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1718194906.0
        }
      ]
    },
    {
      "id": "m0vvoz1",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 1 (No pro-ana/mia content). Please contact the mods if you have any doubts.\n\nEverything you addressed is disordered. If you keep labeling food, you’re never going to be able to recover. All food is is good food. * All food is is good food.* ***ALL FOOD IS GOOD FOOD.*** Point blank, period, end of story.\n\n1. You can crave “JuNk FoOd” and be hungry? Your body gives fuck all about what you think is healthy vs what isn’t—all it knows it that the foods you label as “bad” are high calorie and nutrient-dense, easily digestible, and quickly metabolized into energy your body *desperately needs.\n\n2. Again refer to my first point above again. Mental hunger *only* goes away when you honor it—both the hunger *and* the cravings.\n\nYour nutritionist is not a registered dietitian who went through vigorous medical schooling and hours of internships to gain their degree—nothing they say would fly under a medical setting, let alone an eating disorder treatment center. And if they are, that’s malpractice. You need to be eating 2500-3500kcal *daily* at least, and more if you’re hungry (yes, mental hunger is real hunger, even in the absence of physical hunger, which can be impacted by restriction). These are nonnegotiable. You also should not be engaging in any physical activity as it compromises the body’s ability to heal.",
      "created_utc": 1733587446.0,
      "score": 1,
      "context": [
        {
          "id": "m0vjvqe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1733583456.0
        }
      ]
    },
    {
      "id": "jgi0h9u",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1681663491.0,
      "score": 1,
      "context": [
        {
          "id": "hdgqhal",
          "author": "problematicbeing",
          "body": "This is a great post :) \n\n\nOften your ED will convince you that you are the exception and you will be the one to gain infinitely if you respect your hunger or anything else. Remember that you are not the exception.  That being said, recovery is your path to healing, and you get to choose what works for you and doesn't, which doesn't matter as long as you are healing ♡\n\n\n\nI will say, after 1.5 years in recovery, it does get easier ♡ all of it gets more bearable until the ED shrinks and becomes small enough to stuff into your pocket while you lead a whole and fulfilling life.",
          "created_utc": 1632060723.0
        },
        {
          "id": "jgi0awo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1681663416.0
        }
      ]
    },
    {
      "id": "he5n0ga",
      "author": "no_uapples",
      "body": "Thank you! I have always liked stuff like meats and seafood and have restricted a lot of fatty meat in my ed as well as dairy products which I also really like- even nut butter and fruits which I miss. I have restricted a lot of what society considers as 'whole foods' due to the 'high calorie' in my ed which I really miss due to the fact that I really loved those foods when I was younger..",
      "created_utc": 1632527365.0,
      "score": 5,
      "context": [
        {
          "id": "he5ipz7",
          "author": "no_uapples",
          "body": "Is point 9 valid if you are REALLY passionate about a sport and use that as a way to reduce the ed? I've finally thrown away my smart watch (finally) and decided to just eat whole foods (that I enjoy) to improve my energy and performance :) I am finally honouring my hunger for once and I feel great ✨✨",
          "created_utc": 1632525404.0
        },
        {
          "id": "he5l5bc",
          "author": "Sareeee48",
          "body": "Yes. Your body needs to rest in order to recover and exercise burns more calories, which means you have to eat *more* on top of recovery amounts (that are already particularly high, especially if you have extreme hunger). This makes physical repairs of the body significantly more difficult because you’re burning off much needed energy that it needs to heal. And to top it off, it can cause even more weight gain in the long run because your body is literally fighting you to gain weight at all. The desire to continue exercising when you want to recover is counterintuitive and disordered; you can *always* go back to exercising or sports once you are weight restored and nutritionally rehabilitated. It isn’t going anywhere!\n\nI also really encourage you to reflect on why you only allow yourself “whole foods.” All foods are processed in some way. All foods have a purpose; continuing to give moral value to food (aka, “whole foods is better”) will set you back in recovery.",
          "created_utc": 1632526513.0
        }
      ]
    },
    {
      "id": "i6u43vv",
      "author": "Flat-Lettuce-2706",
      "body": "how would you quantify “long periods of restriction?” \n\nas in years or months? bc i had maybe like a month or 2 of severe restriction, then i upped my intake because i went to live with my parents. however, i’ve been in a ~reasonable~ deficit for months. \n\ndoes everything in this thread still apply to me? i know this might sound like a stupid question because i know i’m anorexic, but i feel like i haven’t been sick for long enough to have mental hunger or extreme hunger or anything else.",
      "created_utc": 1651355004.0,
      "score": 3,
      "context": [
        {
          "id": "hhyzpgr",
          "author": "seshprinny",
          "body": "I just reread this post again this morning, it's really informative. I'm wondering about the weight gain that is expected and necessary during recovery, I'm sure people gain across the board, but everything I've read has been from an UW Anorexic recovery perspective.\n\nWould it be different for people who are already a normal weight? Or people with different EDs? Or would they be likely to need to gain the same proportionate amount as someone underweight? I'm sorry if this is a silly question. I think I may have jumped ahead on the food journey on my own and now I have lots of questions for my therapist tomorrow 😬😂",
          "created_utc": 1635159518.0
        },
        {
          "id": "hi1jm1r",
          "author": "Sareeee48",
          "body": "Essentially, yes. Starvation affects all bodies the same, regardless of weight. Only 6% of ED sufferers are clinically underweight, which means that 96% are either “normal” weight or overweight. So that in and of itself should say something. If you’ve been restricting for long periods of time, regardless of your weight, you’re going to have to basically eat back all the calories you denied yourself to fix the damages of your eating disorder.\n\nSince all bodies are different and no two recoveries are the same, nobody will gain the same amount of weight. It all depends on your set point, the severity of your illness, and the duration of it. It may or may not be proportionate to someone who is underweight, but if you were overweight prior to your ED, you may be overweight *after* your eating disorder and that’s totally fine. Even if you are currently underweight. Even if you are currently at a “normal” weight, and so on.\n\nWeight isn’t a sole indicator of health and BMI is a shitty, unscientific method that shouldn’t be used at all, tbh. It doesn’t matter if it’s anorexia, ARFID, OSFED, atypical anorexia, bulimia, weight gain is basically inevitable and should be encouraged. The only exception would be BED, in which case refeeding isn’t the goal. *However*, restriction should still be discouraged as it only perpetuates the desire to binge and doesn’t resolve the real problem—resolve/cope with the emotional stressors and/or trauma that leads to binging and you’ll stop the binging.",
          "created_utc": 1635200842.0
        }
      ]
    },
    {
      "id": "i4d3gkk",
      "author": "Coffeegreysky12",
      "body": "I was told I had the option of palliative care but it really scared me. I am hoping somehow  to still turn this around with harm reduction and try to at least feel better.",
      "created_utc": 1649722590.0,
      "score": 2,
      "context": [
        {
          "id": "i4cxnhp",
          "author": "Coffeegreysky12",
          "body": "what if you are suddenly losing weight without trying and you have had anorexia for many years, and remained at a low weight for years and never actually recovered from it? does this mean recovery is no longer a possibility for someone like me. I feel like harm reduction is my only option at this point. feel like I ruined myself and I can't be one of the people who recovers and gets healthy",
          "created_utc": 1649719980.0
        },
        {
          "id": "i4d23c9",
          "author": "Sareeee48",
          "body": "I mean anyone can recover if they make the decision of doing so. It doesn’t matter what state you are in. Obviously that does *not* make it easy.\n\nBut yes, sometimes harm reduction is really the best thing you’ve got. As much as I hate to suggest it, palliative care is the better option for some.",
          "created_utc": 1649721975.0
        }
      ]
    },
    {
      "id": "ilt7hrp",
      "author": "None",
      "body": "i’m freaking out tho like i’m genuinly eating several thousand calories and i feel so guilty and embarrased bc i’m at uni and everyone is so diet culturey and i’m gaining weight and facing so much edema/bloating. i could genuinly eat a packet of muffins and 5 chocolate bars and still eat 3 meals and snacks and more and i HATE IT",
      "created_utc": 1661475864.0,
      "score": 2,
      "context": [
        {
          "id": "ilat9o2",
          "author": "None",
          "body": "what if you’re feeling out of control when you’re eating and cannot stop and feel so guilty after. about 1 month i to recovery i had a “binge” and then another one like a month later and then it started becoming a few times a week, and now for the past month it has been everyday and i’ve legit gained nearly 10kg and an almost back at a “normal” BMI. i feel OUT of control and cannot stop eating even if i am physically STUFFED and feel sick. i have a history of binging and purging before anorexia so i’m scared it’s that. but i’m genuinely gaining weight so fast and i’m TERRIFIED i cannot stop eating i’m legit even stealing food from shops and stuff to eat",
          "created_utc": 1661159739.0
        },
        {
          "id": "ilaxk5s",
          "author": "Sareeee48",
          "body": "You’re experiencing reactive eating episodes. You need to let yourself eat as much as you want without fighting it and it will eventually dissipate. That being said, you don’t have to eat yourself sick either. Take a half hour or so break to let some food digest, sip on some peppermint or ginger tea, lie on your side for a time. Then resume eating when it’s not so uncomfortable.",
          "created_utc": 1661163249.0
        }
      ]
    },
    {
      "id": "il5xara",
      "author": "Georgia__432",
      "body": "Thankyou for this wake up call!!! My thyroid is functioning low and my cortisol is very high :( I try to follow the meal plan I have from the hospital but it’s so big and I get let down by the constant cinstipation /bloating and don’t know how to fix it :(",
      "created_utc": 1661063629.0,
      "score": 3,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        }
      ]
    },
    {
      "id": "itj0lkr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1666570476.0,
      "score": 0,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        }
      ]
    },
    {
      "id": "he86ydc",
      "author": "Sareeee48",
      "body": "I totally know the struggle, it can be hard reintroducing foods you’ve restricted back in. Unfortunately, you can’t fully recover until you allow all foods into your diet, whenever you want them at whatever amount your body demands. Wishing you the best!",
      "created_utc": 1632581394.0,
      "score": 11,
      "context": [
        {
          "id": "he5ipz7",
          "author": "no_uapples",
          "body": "Is point 9 valid if you are REALLY passionate about a sport and use that as a way to reduce the ed? I've finally thrown away my smart watch (finally) and decided to just eat whole foods (that I enjoy) to improve my energy and performance :) I am finally honouring my hunger for once and I feel great ✨✨",
          "created_utc": 1632525404.0
        },
        {
          "id": "he5l5bc",
          "author": "Sareeee48",
          "body": "Yes. Your body needs to rest in order to recover and exercise burns more calories, which means you have to eat *more* on top of recovery amounts (that are already particularly high, especially if you have extreme hunger). This makes physical repairs of the body significantly more difficult because you’re burning off much needed energy that it needs to heal. And to top it off, it can cause even more weight gain in the long run because your body is literally fighting you to gain weight at all. The desire to continue exercising when you want to recover is counterintuitive and disordered; you can *always* go back to exercising or sports once you are weight restored and nutritionally rehabilitated. It isn’t going anywhere!\n\nI also really encourage you to reflect on why you only allow yourself “whole foods.” All foods are processed in some way. All foods have a purpose; continuing to give moral value to food (aka, “whole foods is better”) will set you back in recovery.",
          "created_utc": 1632526513.0
        },
        {
          "id": "he5n0ga",
          "author": "no_uapples",
          "body": "Thank you! I have always liked stuff like meats and seafood and have restricted a lot of fatty meat in my ed as well as dairy products which I also really like- even nut butter and fruits which I miss. I have restricted a lot of what society considers as 'whole foods' due to the 'high calorie' in my ed which I really miss due to the fact that I really loved those foods when I was younger..",
          "created_utc": 1632527365.0
        }
      ]
    },
    {
      "id": "i6u9vgt",
      "author": "Sareeee48",
      "body": "There are no stupid questions, I promise!\n\nI wrote this awhile ago and thinking back now, I should have used “extended period” of restriction rather than “long periods.” Essentially, yes, all of this still applies to you; you still restricted, and thus you’ve caused damages that require repairs, which can only occur with enough energy (aka food). Food is something our bodies *need* to survive, even a day of not eating enough can result in negative symptoms that can only be remedied by eating enough. Even if you don’t not restricted for a few months, weeks, or even hours, *you still deserve to eat and honor your hunger.* if you are physically and/or mentally hungry, you need to eat. Even if it feels like a lot.",
      "created_utc": 1651357829.0,
      "score": 5,
      "context": [
        {
          "id": "hhyzpgr",
          "author": "seshprinny",
          "body": "I just reread this post again this morning, it's really informative. I'm wondering about the weight gain that is expected and necessary during recovery, I'm sure people gain across the board, but everything I've read has been from an UW Anorexic recovery perspective.\n\nWould it be different for people who are already a normal weight? Or people with different EDs? Or would they be likely to need to gain the same proportionate amount as someone underweight? I'm sorry if this is a silly question. I think I may have jumped ahead on the food journey on my own and now I have lots of questions for my therapist tomorrow 😬😂",
          "created_utc": 1635159518.0
        },
        {
          "id": "hi1jm1r",
          "author": "Sareeee48",
          "body": "Essentially, yes. Starvation affects all bodies the same, regardless of weight. Only 6% of ED sufferers are clinically underweight, which means that 96% are either “normal” weight or overweight. So that in and of itself should say something. If you’ve been restricting for long periods of time, regardless of your weight, you’re going to have to basically eat back all the calories you denied yourself to fix the damages of your eating disorder.\n\nSince all bodies are different and no two recoveries are the same, nobody will gain the same amount of weight. It all depends on your set point, the severity of your illness, and the duration of it. It may or may not be proportionate to someone who is underweight, but if you were overweight prior to your ED, you may be overweight *after* your eating disorder and that’s totally fine. Even if you are currently underweight. Even if you are currently at a “normal” weight, and so on.\n\nWeight isn’t a sole indicator of health and BMI is a shitty, unscientific method that shouldn’t be used at all, tbh. It doesn’t matter if it’s anorexia, ARFID, OSFED, atypical anorexia, bulimia, weight gain is basically inevitable and should be encouraged. The only exception would be BED, in which case refeeding isn’t the goal. *However*, restriction should still be discouraged as it only perpetuates the desire to binge and doesn’t resolve the real problem—resolve/cope with the emotional stressors and/or trauma that leads to binging and you’ll stop the binging.",
          "created_utc": 1635200842.0
        },
        {
          "id": "i6u43vv",
          "author": "Flat-Lettuce-2706",
          "body": "how would you quantify “long periods of restriction?” \n\nas in years or months? bc i had maybe like a month or 2 of severe restriction, then i upped my intake because i went to live with my parents. however, i’ve been in a ~reasonable~ deficit for months. \n\ndoes everything in this thread still apply to me? i know this might sound like a stupid question because i know i’m anorexic, but i feel like i haven’t been sick for long enough to have mental hunger or extreme hunger or anything else.",
          "created_utc": 1651355004.0
        }
      ]
    },
    {
      "id": "ilt9fwj",
      "author": "Sareeee48",
      "body": "I feel you, it’s really hard! Especially if you’re in an environment like college. If it’s any consolation, i was eating 10,000 calories a day the first few months.",
      "created_utc": 1661476747.0,
      "score": 2,
      "context": [
        {
          "id": "ilat9o2",
          "author": "None",
          "body": "what if you’re feeling out of control when you’re eating and cannot stop and feel so guilty after. about 1 month i to recovery i had a “binge” and then another one like a month later and then it started becoming a few times a week, and now for the past month it has been everyday and i’ve legit gained nearly 10kg and an almost back at a “normal” BMI. i feel OUT of control and cannot stop eating even if i am physically STUFFED and feel sick. i have a history of binging and purging before anorexia so i’m scared it’s that. but i’m genuinely gaining weight so fast and i’m TERRIFIED i cannot stop eating i’m legit even stealing food from shops and stuff to eat",
          "created_utc": 1661159739.0
        },
        {
          "id": "ilaxk5s",
          "author": "Sareeee48",
          "body": "You’re experiencing reactive eating episodes. You need to let yourself eat as much as you want without fighting it and it will eventually dissipate. That being said, you don’t have to eat yourself sick either. Take a half hour or so break to let some food digest, sip on some peppermint or ginger tea, lie on your side for a time. Then resume eating when it’s not so uncomfortable.",
          "created_utc": 1661163249.0
        },
        {
          "id": "ilt7hrp",
          "author": "None",
          "body": "i’m freaking out tho like i’m genuinly eating several thousand calories and i feel so guilty and embarrased bc i’m at uni and everyone is so diet culturey and i’m gaining weight and facing so much edema/bloating. i could genuinly eat a packet of muffins and 5 chocolate bars and still eat 3 meals and snacks and more and i HATE IT",
          "created_utc": 1661475864.0
        }
      ]
    },
    {
      "id": "itj4hbs",
      "author": "Sareeee48",
      "body": "It means that your body is in complete control over where your set point is. Weight is primarily genetic; hense why 95% of all diets fail and similar percentages of individuals gain back all of the weight back, if not more, within 2-5 years. And it’s not due to lack of willpower. It might make you uncomfortable, but that discomfort doesn’t change the fact that some people are born in larger bodies and that doesn’t inherently mean they are unhealthy. Especially considering that BMI was never designed to measure health (which is multi-faceted as it is).\n\nIf someone with BED gains weight from binging, then they should absolutely not focus on weight loss as a cure for their binging. They should find the reasons behind *why* they binge and work on managing that, which will in turn manage the binging. If weight loss naturally comes from that, that is fine, but it certainly shouldn’t be something someone fixates on. Consider the fact that many people with a “binging” problem initially come from restriction as it is, and restriction merely reinforces the urge to binge. Just like any other ED, they still have learn to feed themselves *enough* and listen to their hunger. Weight loss has nothing to do with recovering, it’s simply a possible byproduct.\n\nAs for feeling discomfort in a larger body, that is directly influenced by society, that pushes thinness at all costs and tells us from a very young age that fat is morally inferior. You might say that you wouldn’t intentionally be mean to fat people, but implying that nobody should want to weigh xxx lbs and weight loss is compatible with recovery is directly causing harm to fat people, especially those struggling with eating disorders. That’s the thing about fatphobia—it’s engrained, and it’s often so normalized that people don’t see a problem with it.\n\nLastly, the reason weight loss is not compatible with recovery is due to the fact that you cannot engage in behaviors that are keeping you sick (specifically a hyperfixation on your appearance that lead to restriction, purging, compulsive movement, etc.) and expect to remain in a healthy place emotionally and physically. Remember that many people develop their ED from dieting, and many others use it as a form of control. Learning to accept yourself wherever your body may land in terms of weight is essential in recovery because you need to learn to trust your body and let go of the pressure to live up to societal beauty standards that often harm us in the long term.",
      "created_utc": 1666572293.0,
      "score": 2,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        },
        {
          "id": "itj0lkr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666570476.0
        }
      ]
    },
    {
      "id": "itj6r4l",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1666573341.0,
      "score": 1,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        },
        {
          "id": "itj0lkr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666570476.0
        },
        {
          "id": "itj4hbs",
          "author": "Sareeee48",
          "body": "It means that your body is in complete control over where your set point is. Weight is primarily genetic; hense why 95% of all diets fail and similar percentages of individuals gain back all of the weight back, if not more, within 2-5 years. And it’s not due to lack of willpower. It might make you uncomfortable, but that discomfort doesn’t change the fact that some people are born in larger bodies and that doesn’t inherently mean they are unhealthy. Especially considering that BMI was never designed to measure health (which is multi-faceted as it is).\n\nIf someone with BED gains weight from binging, then they should absolutely not focus on weight loss as a cure for their binging. They should find the reasons behind *why* they binge and work on managing that, which will in turn manage the binging. If weight loss naturally comes from that, that is fine, but it certainly shouldn’t be something someone fixates on. Consider the fact that many people with a “binging” problem initially come from restriction as it is, and restriction merely reinforces the urge to binge. Just like any other ED, they still have learn to feed themselves *enough* and listen to their hunger. Weight loss has nothing to do with recovering, it’s simply a possible byproduct.\n\nAs for feeling discomfort in a larger body, that is directly influenced by society, that pushes thinness at all costs and tells us from a very young age that fat is morally inferior. You might say that you wouldn’t intentionally be mean to fat people, but implying that nobody should want to weigh xxx lbs and weight loss is compatible with recovery is directly causing harm to fat people, especially those struggling with eating disorders. That’s the thing about fatphobia—it’s engrained, and it’s often so normalized that people don’t see a problem with it.\n\nLastly, the reason weight loss is not compatible with recovery is due to the fact that you cannot engage in behaviors that are keeping you sick (specifically a hyperfixation on your appearance that lead to restriction, purging, compulsive movement, etc.) and expect to remain in a healthy place emotionally and physically. Remember that many people develop their ED from dieting, and many others use it as a form of control. Learning to accept yourself wherever your body may land in terms of weight is essential in recovery because you need to learn to trust your body and let go of the pressure to live up to societal beauty standards that often harm us in the long term.",
          "created_utc": 1666572293.0
        }
      ]
    },
    {
      "id": "itj8pnc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1666574271.0,
      "score": 0,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        },
        {
          "id": "itj0lkr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666570476.0
        },
        {
          "id": "itj4hbs",
          "author": "Sareeee48",
          "body": "It means that your body is in complete control over where your set point is. Weight is primarily genetic; hense why 95% of all diets fail and similar percentages of individuals gain back all of the weight back, if not more, within 2-5 years. And it’s not due to lack of willpower. It might make you uncomfortable, but that discomfort doesn’t change the fact that some people are born in larger bodies and that doesn’t inherently mean they are unhealthy. Especially considering that BMI was never designed to measure health (which is multi-faceted as it is).\n\nIf someone with BED gains weight from binging, then they should absolutely not focus on weight loss as a cure for their binging. They should find the reasons behind *why* they binge and work on managing that, which will in turn manage the binging. If weight loss naturally comes from that, that is fine, but it certainly shouldn’t be something someone fixates on. Consider the fact that many people with a “binging” problem initially come from restriction as it is, and restriction merely reinforces the urge to binge. Just like any other ED, they still have learn to feed themselves *enough* and listen to their hunger. Weight loss has nothing to do with recovering, it’s simply a possible byproduct.\n\nAs for feeling discomfort in a larger body, that is directly influenced by society, that pushes thinness at all costs and tells us from a very young age that fat is morally inferior. You might say that you wouldn’t intentionally be mean to fat people, but implying that nobody should want to weigh xxx lbs and weight loss is compatible with recovery is directly causing harm to fat people, especially those struggling with eating disorders. That’s the thing about fatphobia—it’s engrained, and it’s often so normalized that people don’t see a problem with it.\n\nLastly, the reason weight loss is not compatible with recovery is due to the fact that you cannot engage in behaviors that are keeping you sick (specifically a hyperfixation on your appearance that lead to restriction, purging, compulsive movement, etc.) and expect to remain in a healthy place emotionally and physically. Remember that many people develop their ED from dieting, and many others use it as a form of control. Learning to accept yourself wherever your body may land in terms of weight is essential in recovery because you need to learn to trust your body and let go of the pressure to live up to societal beauty standards that often harm us in the long term.",
          "created_utc": 1666572293.0
        },
        {
          "id": "itj6r4l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666573341.0
        }
      ]
    },
    {
      "id": "itjpnt6",
      "author": "Sareeee48",
      "body": "I never said wanting to lose weight means you have an ED…? I said weight loss isn’t compatible with recovery. And it isn’t.\n\nAlso, various studies actually indicate that being at a higher BMI leads to longer lifespans and makes it easier to combat diseases supposedly caused by being in a larger body. I understand where you are coming from in terms of a diet culture mindset, but I’ve already explained everything to you in my initial reply. Just because you don’t think what you are saying is fatphobic doesn’t negate the fact that it is and it harms the well-being of fat people on a systemic level.",
      "created_utc": 1666582421.0,
      "score": 1,
      "context": [
        {
          "id": "il49gex",
          "author": "Georgia__432",
          "body": "I’m gaining weight on 1800 cals I wish I could eat that many :(",
          "created_utc": 1661032327.0
        },
        {
          "id": "il4avh0",
          "author": "Sareeee48",
          "body": "You can, and you need to. If you’re gaining on 1800 it’s because your body has reached its limit and it’s attempting to store whatever it can to keep you alive. Only difference is none of the weight you are gaining is going toward long term repairs and rewiring your brain.",
          "created_utc": 1661032965.0
        },
        {
          "id": "itj0lkr",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666570476.0
        },
        {
          "id": "itj4hbs",
          "author": "Sareeee48",
          "body": "It means that your body is in complete control over where your set point is. Weight is primarily genetic; hense why 95% of all diets fail and similar percentages of individuals gain back all of the weight back, if not more, within 2-5 years. And it’s not due to lack of willpower. It might make you uncomfortable, but that discomfort doesn’t change the fact that some people are born in larger bodies and that doesn’t inherently mean they are unhealthy. Especially considering that BMI was never designed to measure health (which is multi-faceted as it is).\n\nIf someone with BED gains weight from binging, then they should absolutely not focus on weight loss as a cure for their binging. They should find the reasons behind *why* they binge and work on managing that, which will in turn manage the binging. If weight loss naturally comes from that, that is fine, but it certainly shouldn’t be something someone fixates on. Consider the fact that many people with a “binging” problem initially come from restriction as it is, and restriction merely reinforces the urge to binge. Just like any other ED, they still have learn to feed themselves *enough* and listen to their hunger. Weight loss has nothing to do with recovering, it’s simply a possible byproduct.\n\nAs for feeling discomfort in a larger body, that is directly influenced by society, that pushes thinness at all costs and tells us from a very young age that fat is morally inferior. You might say that you wouldn’t intentionally be mean to fat people, but implying that nobody should want to weigh xxx lbs and weight loss is compatible with recovery is directly causing harm to fat people, especially those struggling with eating disorders. That’s the thing about fatphobia—it’s engrained, and it’s often so normalized that people don’t see a problem with it.\n\nLastly, the reason weight loss is not compatible with recovery is due to the fact that you cannot engage in behaviors that are keeping you sick (specifically a hyperfixation on your appearance that lead to restriction, purging, compulsive movement, etc.) and expect to remain in a healthy place emotionally and physically. Remember that many people develop their ED from dieting, and many others use it as a form of control. Learning to accept yourself wherever your body may land in terms of weight is essential in recovery because you need to learn to trust your body and let go of the pressure to live up to societal beauty standards that often harm us in the long term.",
          "created_utc": 1666572293.0
        },
        {
          "id": "itj6r4l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666573341.0
        },
        {
          "id": "itj8pnc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666574271.0
        }
      ]
    }
  ]
}