{
  "id": "pusjlm",
  "subreddit": "fuckeatingdisorders",
  "author": "Fuzzy_sleep",
  "created_utc": 1632517454.0,
  "title": "What’s the stupidest thing you’ve heard diet culture say?",
  "selftext": "They like their bullshit. Two of my favs: “bananas are bad for you” and “smoothies are bad for you”. Yes, we live in an age where people believe fruit is bad for you. Round of applause to diet culture.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/pusjlm/whats_the_stupidest_thing_youve_heard_diet/",
  "score": 124,
  "num_comments": 98,
  "comments": [
    {
      "id": "he55mcd",
      "author": "Sareeee48",
      "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
      "created_utc": 1632519604.0,
      "score": 125,
      "context": []
    },
    {
      "id": "he514fd",
      "author": "asoftyam",
      "body": "The whole notion of “good food vs bad food” lol",
      "created_utc": 1632517675.0,
      "score": 52,
      "context": []
    },
    {
      "id": "he59pxf",
      "author": "NutelllaBellla",
      "body": "Lol my Dad once told my sister to \"slow down on eating all those grapes! They have a lot of sugar , that's why you have a muffin top\". K, noted and recorded. Also \"U can't mix fat and carbs in a meal bc your body will instantly convert all of it to fat\", and \"Adding salt to your food makes you gain fat\" and \"Eating faster makes your body absorb more calories so eat as slow as possible\" and \"Don't eat a single carb after 6 pm, your body will store it all as belly fat\"   and \"Any white carb is the devil... thou shall NEVER eat white rice\".",
      "created_utc": 1632521385.0,
      "score": 36,
      "context": []
    },
    {
      "id": "he5ls09",
      "author": "its_me_anonymous16",
      "body": "Hearing my 90 year old grandma still not fully able to enjoy eating ice cream. Every time, “ooh, I’m so bad!” \n\nLike, Grandma, you’re 90. You’re good",
      "created_utc": 1632526801.0,
      "score": 36,
      "context": []
    },
    {
      "id": "he52rvl",
      "author": "Sareeee48",
      "body": "“Table sugar is bad for you but fruit sugar is good for you” despite the fact that both fructose and glucose come from fruit and other naturally sweet things 🙃\n\nNow obviously I’m not saying eating only sugar is gonna be healthy (all foods will be bad if eaten in mass quantities, including fruits and veggies), but maybe if we didn’t have these dumb ass myths surrounding sugar that prevent us from consuming it at all costs then we wouldn’t crave it so god damn much.",
      "created_utc": 1632518383.0,
      "score": 32,
      "context": []
    },
    {
      "id": "he5adld",
      "author": "YourFrogMom",
      "body": "Having some fun with this because diet culture is horrible and triggering and mean:  \n\"Grapes are too high calorie\"/\"Fruit is basically candy so never ever eat it\"   \nbut also \"Eat nothing but fruit, sadness, and vegetables, but not with starch or carbs!!\" \"Anyone can be \"thin\", it's just a matter of Self Control (tm)\"  \n\"People who eat a lot are FAT and if they're NOT then they are just BLESSED\"   \n\"Bread/carbs is the devil\"   \n\"Milk is bad and full of sugar, only drink skim milk or unsweetened almond milk (even though you can tolerate lactose), both of which are basically white-ish water because it's low calorie and will remove precisely 60% of the remaining joy in your life-\"  \n\"Low calorie = good stuff:))) high calorie = always bad!! very scary!! instant become fat lose all of your friends?! Oh god oh no a croissant will ruin my life-\"\n\nand my personal favorite as a 5'0 AFAB: \"Short women only need 1200 calories (or less!) a day uwu\"  \nYou just can't win man it's so dumb lol",
      "created_utc": 1632521670.0,
      "score": 23,
      "context": []
    },
    {
      "id": "he5ml1h",
      "author": "None",
      "body": "tw calories??\n\n\n1200 calories is enough… like even if you’re short just no!! you need more!! it’s ok!!",
      "created_utc": 1632527169.0,
      "score": 19,
      "context": []
    },
    {
      "id": "he55wyz",
      "author": "standsure",
      "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
      "created_utc": 1632519731.0,
      "score": 18,
      "context": []
    },
    {
      "id": "he643yl",
      "author": "sorcerers_apprentice",
      "body": "\"Fruit is bad for you. You'll gain weight.\"\n\n*Ok, so what should I eat to lose weight?*\n\n\"Coffee with butter in it.\"",
      "created_utc": 1632535311.0,
      "score": 17,
      "context": []
    },
    {
      "id": "he5n8iv",
      "author": "Sareeee48",
      "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
      "created_utc": 1632527466.0,
      "score": 16,
      "context": []
    },
    {
      "id": "he59sgb",
      "author": "missprizma",
      "body": "Making carbs the devil, this shit is so stupid",
      "created_utc": 1632521416.0,
      "score": 13,
      "context": []
    },
    {
      "id": "he6klxl",
      "author": "HELL-thy_LIE-festyle",
      "body": "Processed carbs cause \"brain fog\" and keto cures it \n\nDa fuck is this mystical condition that I had never heard of before people started putting butter in coffee? Is it like when you're tired and can't concentrate? Because everyone gets that from time to time, it's called being a human and having life stress. \n\nNo diet will give you perfect energy all the time, thank you for coming to my TED talk *munched bagel*",
      "created_utc": 1632543587.0,
      "score": 12,
      "context": []
    },
    {
      "id": "he5ie22",
      "author": "None",
      "body": "Ugh this reminds me of an ad I keep getting on Pinterest showing a picture of a little girl and claiming she’s never eaten sugar or carbs, ‘look at her now!’. It kills me every time. Carbs??? No carbs at all ever? She probably looks dead.",
      "created_utc": 1632525256.0,
      "score": 12,
      "context": []
    },
    {
      "id": "he5wafg",
      "author": "rileyyj001",
      "body": "*Nature’s cereal* that stupid meme of fruit salad in a bowl of ice water 🙄🙄🙄",
      "created_utc": 1632531676.0,
      "score": 11,
      "context": []
    },
    {
      "id": "he5n2wf",
      "author": "Kind_Term6662",
      "body": "It might have already been commented but... yknow that surgery that was apparently popular in the 80s? Where people would get their jaws wired shut so they wouldnt eat?\n\nThat stuff makes me so pissed off, both at the stupidity and the desperation. The irony is the weight would always come back so quickly! People would spend months only drinking liquids, to then eventually end up eating solids again and gain back all the weight.",
      "created_utc": 1632527396.0,
      "score": 12,
      "context": []
    },
    {
      "id": "he5pv4w",
      "author": "None",
      "body": "Not really diet culture but my mom once yelled at me for eating carbs. It was hummus and a slice of bread",
      "created_utc": 1632528683.0,
      "score": 10,
      "context": []
    },
    {
      "id": "he72ynr",
      "author": "BeastieBeck",
      "body": "\"Keto\" is about the worst fad diet culture has produced so far that went mainstream.",
      "created_utc": 1632556085.0,
      "score": 10,
      "context": []
    },
    {
      "id": "he5iquc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1632525415.0,
      "score": 8,
      "context": []
    },
    {
      "id": "he6wyor",
      "author": "chokonyan",
      "body": "Why eat a meal when you can eat a bowl of only blueberries and feel just as “full”?!\n\nSeriously ridiculous.",
      "created_utc": 1632551647.0,
      "score": 8,
      "context": []
    },
    {
      "id": "he7a9mt",
      "author": "messythelioma",
      "body": "That being fat is bad or having fat on you is bad.",
      "created_utc": 1632561992.0,
      "score": 9,
      "context": []
    },
    {
      "id": "he6w8mi",
      "author": "labana93",
      "body": "You've gotta lose fat before trying to build muscle because FaT bEcOmEs MuScLE aNd YoU mAy GeT bUlKy.",
      "created_utc": 1632551123.0,
      "score": 7,
      "context": []
    },
    {
      "id": "he7kpz8",
      "author": "metempsychosis99",
      "body": "The fact that they try to moralize food.",
      "created_utc": 1632569940.0,
      "score": 7,
      "context": []
    },
    {
      "id": "he7thez",
      "author": "mermaidsthrowaway",
      "body": "\"Nothing tastes as good as skinny feels!\"",
      "created_utc": 1632574937.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hejbkkm",
      "author": "isthised",
      "body": "MFP told me I went over my sugar goal when I added kale but then told me “this food has a lot of protein” when I added a Justin’s cashew butter cup. I was like… really?!",
      "created_utc": 1632789169.0,
      "score": 7,
      "context": []
    },
    {
      "id": "he7ko5e",
      "author": "metempsychosis99",
      "body": "When they confidently say that negative calories are a thing.",
      "created_utc": 1632569908.0,
      "score": 5,
      "context": []
    },
    {
      "id": "heawk6u",
      "author": "residentinhell",
      "body": "Vilifying carbs. Like yeah, we totally don’t need an entire essential macronutrient group. Plus as a cross country athlete, half my diet is supposed to be carbs lmao so Keto culture is extra humorous to me.\n\nAlso 1200 calorie diets. In my ED restriction I really struggled to stick to this number even as a short woman, cause hey I worked out 6 times a week and THAT MADE A DIFFERENCE PEOPLE. \n\nAlso short women who think they maintain at 1500. I always get super suspicious of this, like how do you know? I find a lot of people who have been dieting in the past claim this, so have they actually stuck to 1500 for months after being in a deficit and found they maintain? Or did they do it for a week, found they didn’t lose weight (most likely due to water retention, fluctuations, or literally anything else) and so now think they maintain? I bet a lot of them used a calculator that spit out that number and ran with it, unaware that the multipliers for sedentary actually refer to someone who is bed bound. Because even though I’m a short woman, 1500 still made my body feel whacky shit even when I wasn’t an athlete.",
      "created_utc": 1632626554.0,
      "score": 6,
      "context": []
    },
    {
      "id": "he7dwe2",
      "author": "None",
      "body": "Pasta causes more weight gain",
      "created_utc": 1632564971.0,
      "score": 5,
      "context": []
    },
    {
      "id": "he7kydl",
      "author": "metempsychosis99",
      "body": "All those skinny teas and crappy weight loss products that basically make you shit yourself and shed some water weight. They don't do anything for you, are expensive and can even be harmful to your body.",
      "created_utc": 1632570086.0,
      "score": 5,
      "context": []
    },
    {
      "id": "he7l3vc",
      "author": "metempsychosis99",
      "body": "Anything that has to do with detox. Your body naturally does that (as in gets rid of toxins), it's basic anatomy. You don't need shitty detox products lol.",
      "created_utc": 1632570181.0,
      "score": 6,
      "context": []
    },
    {
      "id": "he8h5c7",
      "author": "None",
      "body": "The fruit is bad for you thing really messed up my brain for years",
      "created_utc": 1632586035.0,
      "score": 5,
      "context": []
    },
    {
      "id": "he8sxgw",
      "author": "None",
      "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
      "created_utc": 1632591216.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hec6ufi",
      "author": "None",
      "body": "The stupidest thing duet culture has said isn’t about what it’s said at all, but how colossally it’s failed.\n\nDespite it being a billion-dollar industry, the obesity epidemic has only gotten worse, and it’s increasing exponentially, nearing mind-boggling levels. \n\nSo despite billions of dollars in ads, bullshit products, fake foods, and millions of people living in shame as a result, not a dollar of it has contributed any good to the world.",
      "created_utc": 1632658816.0,
      "score": 3,
      "context": []
    },
    {
      "id": "he5vaaz",
      "author": "LightningDuat",
      "body": "Counting cals in fruits and vegetables.\nI never count those cals.",
      "created_utc": 1632531205.0,
      "score": 3,
      "context": []
    },
    {
      "id": "he7irak",
      "author": "saladflambe",
      "body": "Probably the demonization of carbohydrates.",
      "created_utc": 1632568615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "he7ur94",
      "author": "Daisy13892",
      "body": "r/Diettea",
      "created_utc": 1632575577.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hebrpi5",
      "author": "Fuzzy_sleep",
      "body": "I JUST READ AN ARTICLE THAT SAYS EATING APPLES MAKES YOU GAIN WEIGHT IM SORRY WHAT- SHSJSJKSJWSKAJKSKK",
      "created_utc": 1632647270.0,
      "score": 2,
      "context": []
    },
    {
      "id": "he57ura",
      "author": "Fuzzy_sleep",
      "body": "Me: I’m hungry\n\nDiet culture: no",
      "created_utc": 1632520572.0,
      "score": 92,
      "context": [
        {
          "id": "he55mcd",
          "author": "Sareeee48",
          "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
          "created_utc": 1632519604.0
        }
      ]
    },
    {
      "id": "he5lkj1",
      "author": "its_me_anonymous16",
      "body": "Omg that is exactly this video https://youtu.be/5Ua-WVg1SsA",
      "created_utc": 1632526707.0,
      "score": 11,
      "context": [
        {
          "id": "he55mcd",
          "author": "Sareeee48",
          "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
          "created_utc": 1632519604.0
        }
      ]
    },
    {
      "id": "he733l1",
      "author": "BeastieBeck",
      "body": "Genius. 😂\n\nThat's diet culture reality at its worst. Your post is unfortunately not too good to be true but too true to be good.",
      "created_utc": 1632556188.0,
      "score": 7,
      "context": [
        {
          "id": "he55mcd",
          "author": "Sareeee48",
          "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
          "created_utc": 1632519604.0
        }
      ]
    },
    {
      "id": "he524jy",
      "author": "Fuzzy_sleep",
      "body": "They try and make good vs bad, but then literally convince everyone that everything is bad in some way. “Yes, u can eat fruit, but not any fruit because it’s too high in sugar. Stick to vegetables, but don’t have vegetables because they’re too carby and carbs are terrible for u. But don’t u dare touch anything else!”",
      "created_utc": 1632518107.0,
      "score": 28,
      "context": [
        {
          "id": "he514fd",
          "author": "asoftyam",
          "body": "The whole notion of “good food vs bad food” lol",
          "created_utc": 1632517675.0
        }
      ]
    },
    {
      "id": "he5egw4",
      "author": "no_uapples",
      "body": "Salt does not make you gain fat smh how did it cheat the laws of thermodynamics the only reason why I weigh more after eating salt is BC sodium retains water and you will piss it out anyways. Anyways ur dad is kinda a bitch for shaming y'all 😾😾",
      "created_utc": 1632523484.0,
      "score": 27,
      "context": [
        {
          "id": "he59pxf",
          "author": "NutelllaBellla",
          "body": "Lol my Dad once told my sister to \"slow down on eating all those grapes! They have a lot of sugar , that's why you have a muffin top\". K, noted and recorded. Also \"U can't mix fat and carbs in a meal bc your body will instantly convert all of it to fat\", and \"Adding salt to your food makes you gain fat\" and \"Eating faster makes your body absorb more calories so eat as slow as possible\" and \"Don't eat a single carb after 6 pm, your body will store it all as belly fat\"   and \"Any white carb is the devil... thou shall NEVER eat white rice\".",
          "created_utc": 1632521385.0
        }
      ]
    },
    {
      "id": "he8qq7s",
      "author": "None",
      "body": "Ditto, my grandma when she was wasting away on her literal death bed continued to make remarks about feeling terrible she was so fat. She was emaciated.",
      "created_utc": 1632590268.0,
      "score": 9,
      "context": [
        {
          "id": "he5ls09",
          "author": "its_me_anonymous16",
          "body": "Hearing my 90 year old grandma still not fully able to enjoy eating ice cream. Every time, “ooh, I’m so bad!” \n\nLike, Grandma, you’re 90. You’re good",
          "created_utc": 1632526801.0
        }
      ]
    },
    {
      "id": "he57psg",
      "author": "Fuzzy_sleep",
      "body": "I was reading some article on fruit, and get this: apparently eating fruit on its own is great, but when blended with other fruits into a smoothie WITHOUT added sugar (so just pure fruit blended), it’s classed as “bad” sugar…. Yes, that is exactly what I read. I had to read it again, like, ten times before I realised I was just reading pure bullshit. I can’t for the life of me find this article else I would post it, but jeez, it triggered me lmao",
      "created_utc": 1632520510.0,
      "score": 17,
      "context": [
        {
          "id": "he52rvl",
          "author": "Sareeee48",
          "body": "“Table sugar is bad for you but fruit sugar is good for you” despite the fact that both fructose and glucose come from fruit and other naturally sweet things 🙃\n\nNow obviously I’m not saying eating only sugar is gonna be healthy (all foods will be bad if eaten in mass quantities, including fruits and veggies), but maybe if we didn’t have these dumb ass myths surrounding sugar that prevent us from consuming it at all costs then we wouldn’t crave it so god damn much.",
          "created_utc": 1632518383.0
        }
      ]
    },
    {
      "id": "he5cgs1",
      "author": "throwaway-m1",
      "body": "Yep!! The only difference between table sugar and fruit sugar is that fruits also have fiber & vitamins which helps your body process the sugar without having a blood sugar drop, and keeps you full longer. But you can also have something with fiber or protein with candy or w/e to have a similar effect (or not!)",
      "created_utc": 1632522585.0,
      "score": 10,
      "context": [
        {
          "id": "he52rvl",
          "author": "Sareeee48",
          "body": "“Table sugar is bad for you but fruit sugar is good for you” despite the fact that both fructose and glucose come from fruit and other naturally sweet things 🙃\n\nNow obviously I’m not saying eating only sugar is gonna be healthy (all foods will be bad if eaten in mass quantities, including fruits and veggies), but maybe if we didn’t have these dumb ass myths surrounding sugar that prevent us from consuming it at all costs then we wouldn’t crave it so god damn much.",
          "created_utc": 1632518383.0
        }
      ]
    },
    {
      "id": "he6nbh3",
      "author": "mehperson",
      "body": "HONESTLY.\n\nI really hate it whenever people say \"unless you're a 5'0 woman, you can't live off of 1200 calories\". Sure, I could but I'd have to be quite sedentary to do that. I like running and shit, so there's no way I could eat only 1200 calories without fainting",
      "created_utc": 1632545211.0,
      "score": 10,
      "context": [
        {
          "id": "he5adld",
          "author": "YourFrogMom",
          "body": "Having some fun with this because diet culture is horrible and triggering and mean:  \n\"Grapes are too high calorie\"/\"Fruit is basically candy so never ever eat it\"   \nbut also \"Eat nothing but fruit, sadness, and vegetables, but not with starch or carbs!!\" \"Anyone can be \"thin\", it's just a matter of Self Control (tm)\"  \n\"People who eat a lot are FAT and if they're NOT then they are just BLESSED\"   \n\"Bread/carbs is the devil\"   \n\"Milk is bad and full of sugar, only drink skim milk or unsweetened almond milk (even though you can tolerate lactose), both of which are basically white-ish water because it's low calorie and will remove precisely 60% of the remaining joy in your life-\"  \n\"Low calorie = good stuff:))) high calorie = always bad!! very scary!! instant become fat lose all of your friends?! Oh god oh no a croissant will ruin my life-\"\n\nand my personal favorite as a 5'0 AFAB: \"Short women only need 1200 calories (or less!) a day uwu\"  \nYou just can't win man it's so dumb lol",
          "created_utc": 1632521670.0
        }
      ]
    },
    {
      "id": "he8t1w8",
      "author": "YourFrogMom",
      "body": "THIS!!! (tw: weight, blanked out) Being a very short person (Barely 5'0) with small bones and having all of the dumb calculators say \"Oh yeah you need 1000 calories a day :DDDD\" \"Oh yeah you're not even underweight until you're >!80 pounds!< or less :)))))) In fact, being>! 115 pounds!< is overweight and you, a 15 year old, should diet:((((\" I swear these stupid numbers partially caused me to have an ED in the first place lol",
      "created_utc": 1632591268.0,
      "score": 3,
      "context": [
        {
          "id": "he5ml1h",
          "author": "None",
          "body": "tw calories??\n\n\n1200 calories is enough… like even if you’re short just no!! you need more!! it’s ok!!",
          "created_utc": 1632527169.0
        }
      ]
    },
    {
      "id": "he57y27",
      "author": "Fuzzy_sleep",
      "body": "Wait, why are grapes bad now? I knew that bananas are apparently filled with “bad” carbs, but wtf have grapes done?",
      "created_utc": 1632520613.0,
      "score": 11,
      "context": [
        {
          "id": "he55wyz",
          "author": "standsure",
          "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
          "created_utc": 1632519731.0
        }
      ]
    },
    {
      "id": "he73cmx",
      "author": "BeastieBeck",
      "body": ">\"Coffee with butter in it.\"\n\nTell me you're a Ketotarian without using the word keto. 😂",
      "created_utc": 1632556373.0,
      "score": 8,
      "context": [
        {
          "id": "he643yl",
          "author": "sorcerers_apprentice",
          "body": "\"Fruit is bad for you. You'll gain weight.\"\n\n*Ok, so what should I eat to lose weight?*\n\n\"Coffee with butter in it.\"",
          "created_utc": 1632535311.0
        }
      ]
    },
    {
      "id": "he77ln2",
      "author": "Fuzzy_sleep",
      "body": "Diet culture has entered the chat: NO BUTTER!!!!! BUTTERRR BAD BUTYTER FAT!!!!!!!",
      "created_utc": 1632559798.0,
      "score": 2,
      "context": [
        {
          "id": "he643yl",
          "author": "sorcerers_apprentice",
          "body": "\"Fruit is bad for you. You'll gain weight.\"\n\n*Ok, so what should I eat to lose weight?*\n\n\"Coffee with butter in it.\"",
          "created_utc": 1632535311.0
        }
      ]
    },
    {
      "id": "he8ljet",
      "author": "lilyskins",
      "body": "The hunger = thirst one is so heinous bc I totally fell for it without even realizing that I was already the most hydrated person on the planet (Like I need way more water than my friends to function) so there was no way it could even have been true for me 😭😭😭",
      "created_utc": 1632587998.0,
      "score": 5,
      "context": [
        {
          "id": "he5n8iv",
          "author": "Sareeee48",
          "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
          "created_utc": 1632527466.0
        }
      ]
    },
    {
      "id": "he8taqq",
      "author": "YourFrogMom",
      "body": "Oh wait... I didn't realize the water one wasn't true... Oh no",
      "created_utc": 1632591377.0,
      "score": 1,
      "context": [
        {
          "id": "he5n8iv",
          "author": "Sareeee48",
          "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
          "created_utc": 1632527466.0
        }
      ]
    },
    {
      "id": "he73a69",
      "author": "BeastieBeck",
      "body": "Yeah, and before that the bad guy was \"dietary fat\". I wonder what will be the next villain of the decade.",
      "created_utc": 1632556324.0,
      "score": 4,
      "context": [
        {
          "id": "he59sgb",
          "author": "missprizma",
          "body": "Making carbs the devil, this shit is so stupid",
          "created_utc": 1632521416.0
        }
      ]
    },
    {
      "id": "he8hdgt",
      "author": "Sareeee48",
      "body": "Say it louder for the people in the back 👏👏",
      "created_utc": 1632586134.0,
      "score": 3,
      "context": [
        {
          "id": "he6klxl",
          "author": "HELL-thy_LIE-festyle",
          "body": "Processed carbs cause \"brain fog\" and keto cures it \n\nDa fuck is this mystical condition that I had never heard of before people started putting butter in coffee? Is it like when you're tired and can't concentrate? Because everyone gets that from time to time, it's called being a human and having life stress. \n\nNo diet will give you perfect energy all the time, thank you for coming to my TED talk *munched bagel*",
          "created_utc": 1632543587.0
        }
      ]
    },
    {
      "id": "he77trk",
      "author": "Fuzzy_sleep",
      "body": "Oh god yeah, and I’ve seen about the gastric sleeve or something? Where something is fitted around the stomach to stop it from filling up properly, but I’ve heard there’s a lot of dangers associated with that procedure",
      "created_utc": 1632559978.0,
      "score": 6,
      "context": [
        {
          "id": "he5n2wf",
          "author": "Kind_Term6662",
          "body": "It might have already been commented but... yknow that surgery that was apparently popular in the 80s? Where people would get their jaws wired shut so they wouldnt eat?\n\nThat stuff makes me so pissed off, both at the stupidity and the desperation. The irony is the weight would always come back so quickly! People would spend months only drinking liquids, to then eventually end up eating solids again and gain back all the weight.",
          "created_utc": 1632527396.0
        }
      ]
    },
    {
      "id": "he8h8y1",
      "author": "Sareeee48",
      "body": "I actually read a fucking terrifying article about how medical professionals were trying to make this procedure popular again and I’m like…. Excuse the fuck out of me???",
      "created_utc": 1632586079.0,
      "score": 6,
      "context": [
        {
          "id": "he5n2wf",
          "author": "Kind_Term6662",
          "body": "It might have already been commented but... yknow that surgery that was apparently popular in the 80s? Where people would get their jaws wired shut so they wouldnt eat?\n\nThat stuff makes me so pissed off, both at the stupidity and the desperation. The irony is the weight would always come back so quickly! People would spend months only drinking liquids, to then eventually end up eating solids again and gain back all the weight.",
          "created_utc": 1632527396.0
        }
      ]
    },
    {
      "id": "he77qud",
      "author": "Fuzzy_sleep",
      "body": "I actually hadn’t read the stuff about grapes, funnily enough I’ve had a portion of grapes today as a snack and my instant thought was “I don’t f’ing care” when I read the stuff about grapes",
      "created_utc": 1632559912.0,
      "score": 3,
      "context": [
        {
          "id": "he5iquc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1632525415.0
        }
      ]
    },
    {
      "id": "he8tt6e",
      "author": "YourFrogMom",
      "body": "This. It's so stupid.   \n\"God forbid your body tries to insulate your organs!! It might make it so you can't be a size -000000! If you're not fighting against your set point 24/7, it must mean you have \"no willpower\" and are, therefore \"being lazy\". Quick! Replace that enjoyable food with ice cubes and blueberries, hurry hurry!!\"",
      "created_utc": 1632591609.0,
      "score": 4,
      "context": [
        {
          "id": "he7a9mt",
          "author": "messythelioma",
          "body": "That being fat is bad or having fat on you is bad.",
          "created_utc": 1632561992.0
        }
      ]
    },
    {
      "id": "he7kylb",
      "author": "Fuzzy_sleep",
      "body": "Yeah, this is the main issue of diet culture. Having any % of body fat is demonised.",
      "created_utc": 1632570090.0,
      "score": 3,
      "context": [
        {
          "id": "he7a9mt",
          "author": "messythelioma",
          "body": "That being fat is bad or having fat on you is bad.",
          "created_utc": 1632561992.0
        }
      ]
    },
    {
      "id": "he77yl7",
      "author": "Fuzzy_sleep",
      "body": "Reading this one has reminded me, apparently men can eat way more than women because apparently all their energy goes to their muscles (no where else because men can get fat in society’s standards) but women have to eat as little as possible because as soon as they hold a little bit of fat theyre now overweight and a burden to society?",
      "created_utc": 1632560085.0,
      "score": 7,
      "context": [
        {
          "id": "he6w8mi",
          "author": "labana93",
          "body": "You've gotta lose fat before trying to build muscle because FaT bEcOmEs MuScLE aNd YoU mAy GeT bUlKy.",
          "created_utc": 1632551123.0
        }
      ]
    },
    {
      "id": "he7l34e",
      "author": "Fuzzy_sleep",
      "body": "But end up saying every food is bad in some way. Even fruit and veg. Like, how!?",
      "created_utc": 1632570168.0,
      "score": 3,
      "context": [
        {
          "id": "he7kpz8",
          "author": "metempsychosis99",
          "body": "The fact that they try to moralize food.",
          "created_utc": 1632569940.0
        }
      ]
    },
    {
      "id": "he849x2",
      "author": "Fuzzy_sleep",
      "body": "ew, the forbidden quote. Yes, I felt great being skinny, with my hair falling out, freezing cold, delusional, horrible mood swings, general depression, starving, literally dying, yeah it sure tasted good! Ffs, this quote is wrong in so many ways.",
      "created_utc": 1632580165.0,
      "score": 8,
      "context": [
        {
          "id": "he7thez",
          "author": "mermaidsthrowaway",
          "body": "\"Nothing tastes as good as skinny feels!\"",
          "created_utc": 1632574937.0
        }
      ]
    },
    {
      "id": "he8u53z",
      "author": "YourFrogMom",
      "body": "Ugh, a classic. Mmm... the sweet taste of my body eating itself while I lose my hair, have psychotic episodes and slowly die at 14... Good soup. I hate this quote so much, glad someone commented it. I remember this being a mantra when I was sick- Yikessss",
      "created_utc": 1632591759.0,
      "score": 5,
      "context": [
        {
          "id": "he7thez",
          "author": "mermaidsthrowaway",
          "body": "\"Nothing tastes as good as skinny feels!\"",
          "created_utc": 1632574937.0
        }
      ]
    },
    {
      "id": "hekp1xd",
      "author": "Fuzzy_sleep",
      "body": "People just have no idea about nutrition and it’s pretty funny when you think about it",
      "created_utc": 1632819798.0,
      "score": 3,
      "context": [
        {
          "id": "hejbkkm",
          "author": "isthised",
          "body": "MFP told me I went over my sugar goal when I added kale but then told me “this food has a lot of protein” when I added a Justin’s cashew butter cup. I was like… really?!",
          "created_utc": 1632789169.0
        }
      ]
    },
    {
      "id": "he7mpb8",
      "author": "Fuzzy_sleep",
      "body": "I see one drink a lot that is supposed to “fill you up” so u don’t eat anything. It has some weird chemical that expands in your stomach, like it releases gas or something that makes u feel full. I mean, what the actual fuck.",
      "created_utc": 1632571150.0,
      "score": 6,
      "context": [
        {
          "id": "he7kydl",
          "author": "metempsychosis99",
          "body": "All those skinny teas and crappy weight loss products that basically make you shit yourself and shed some water weight. They don't do anything for you, are expensive and can even be harmful to your body.",
          "created_utc": 1632570086.0
        }
      ]
    },
    {
      "id": "he7msl8",
      "author": "Fuzzy_sleep",
      "body": "“im having a detox day where I’m only drinking green tea and fasting” I’m sorry what",
      "created_utc": 1632571205.0,
      "score": 3,
      "context": [
        {
          "id": "he7l3vc",
          "author": "metempsychosis99",
          "body": "Anything that has to do with detox. Your body naturally does that (as in gets rid of toxins), it's basic anatomy. You don't need shitty detox products lol.",
          "created_utc": 1632570181.0
        }
      ]
    },
    {
      "id": "he8uid6",
      "author": "YourFrogMom",
      "body": "I have a friend that strongly believes in this. Her mom only lets her and her siblings eat stevia because \"sugar is bad for your immune system and it'll ruin your body and make you die young\" ?? And they get fruit as DESSERT, once a week or on special occasions. It's scary, I'm always worried that she's going to fall deep into ED land. Diet culture sucks.",
      "created_utc": 1632591925.0,
      "score": 4,
      "context": [
        {
          "id": "he8h5c7",
          "author": "None",
          "body": "The fruit is bad for you thing really messed up my brain for years",
          "created_utc": 1632586035.0
        }
      ]
    },
    {
      "id": "heb1tyh",
      "author": "thingsivegottenridof",
      "body": "The veganism thing is really insidious. People get really defensive about it as well.",
      "created_utc": 1632629286.0,
      "score": 1,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        }
      ]
    },
    {
      "id": "hecm429",
      "author": "Fuzzy_sleep",
      "body": "That’s actually a really interesting take on everything. You’re completely right. Another thing I think as well is that extreme dieting can lead to obesity. This subreddit is filled with information and knowledge on extreme hunger and what causes it, and I bet every extreme dieter probably experiences something along those lines as soon as their body goes “hell no” and starts craving the junk again. I wonder if part of the rising obesity rate has anything to do with extreme dieting and diet culture? I haven’t seen anything about the two being linked anywhere before, you’ve just got me thinking.",
      "created_utc": 1632666578.0,
      "score": 3,
      "context": [
        {
          "id": "hec6ufi",
          "author": "None",
          "body": "The stupidest thing duet culture has said isn’t about what it’s said at all, but how colossally it’s failed.\n\nDespite it being a billion-dollar industry, the obesity epidemic has only gotten worse, and it’s increasing exponentially, nearing mind-boggling levels. \n\nSo despite billions of dollars in ads, bullshit products, fake foods, and millions of people living in shame as a result, not a dollar of it has contributed any good to the world.",
          "created_utc": 1632658816.0
        }
      ]
    },
    {
      "id": "he7l0rk",
      "author": "Fuzzy_sleep",
      "body": "The human body: literally runs on carbs\n\ndiet culture: I don’t think so",
      "created_utc": 1632570127.0,
      "score": 3,
      "context": [
        {
          "id": "he7irak",
          "author": "saladflambe",
          "body": "Probably the demonization of carbohydrates.",
          "created_utc": 1632568615.0
        }
      ]
    },
    {
      "id": "he58l2c",
      "author": "Sareeee48",
      "body": "Lmfao where is the LIE",
      "created_utc": 1632520892.0,
      "score": 26,
      "context": [
        {
          "id": "he55mcd",
          "author": "Sareeee48",
          "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
          "created_utc": 1632519604.0
        },
        {
          "id": "he57ura",
          "author": "Fuzzy_sleep",
          "body": "Me: I’m hungry\n\nDiet culture: no",
          "created_utc": 1632520572.0
        }
      ]
    },
    {
      "id": "he5mply",
      "author": "Sareeee48",
      "body": "OMG I REMEMBER THIS VIDEO! 💀",
      "created_utc": 1632527226.0,
      "score": 6,
      "context": [
        {
          "id": "he55mcd",
          "author": "Sareeee48",
          "body": "Diet culture: processed sugar is bad.\n\nMe: k I’ll eat fruit.\n\nDiet culture: well actually all sugar is bad.\n\nMe: oh well I’ll cut it out.\n\nDiet culture: but you need energy\n\nMe: then I’ll eat carbs\n\nDiet culture: complex carbs are also bad.\n\nMe: oh okay then I’ll only eat whole grains.\n\nDiet culture: on second thought, all carbs are bad for you and make you fat.\n\nMe: so what do I eat?\n\nDiet culture: vegetables.\n\nMe: okay I’ll eat leafy greens and broccoli and corn and potatoes—\n\nDiet culture: starches are also a no go. And so are vegetables that aren’t lettuce or leafy greens and kale.\n\nMe: okay then I’ll eat salads with dressing—\n\nDiet culture: fat is bad for you too.\n\nMe: … well I’ll buy the low fat kind.\n\nDiet culture: well, fat is good for you if you aren’t eating carbs.\n\nMe: so… coconut oil and meat would be good?\n\nDiet culture: well no, it’s saturated fat. Which is bad for you. \n\nMe: what about meat?\n\nDiet culture: Red meat is a big fat nope. White meat only.\n\nMe: so I’ll eat fish.\n\nDiet culture: it’s chalk full of mercury… which is bad for you. \n\nMe: chicken? \n\nDiet culture: pumped full of hormones.\n\nMe: pork? It’s technically a white meat.\n\nDiet culture: full of fat and a dirty animal.\n\nMe: so what do I eat then?\n\nDiet culture: nothing? Idk man figure it out.",
          "created_utc": 1632519604.0
        },
        {
          "id": "he5lkj1",
          "author": "its_me_anonymous16",
          "body": "Omg that is exactly this video https://youtu.be/5Ua-WVg1SsA",
          "created_utc": 1632526707.0
        }
      ]
    },
    {
      "id": "he52fxq",
      "author": "asoftyam",
      "body": "Yeah exactly. Nothing is ever good enough and nobody knows wtf they’re doing lmao",
      "created_utc": 1632518242.0,
      "score": 7,
      "context": [
        {
          "id": "he514fd",
          "author": "asoftyam",
          "body": "The whole notion of “good food vs bad food” lol",
          "created_utc": 1632517675.0
        },
        {
          "id": "he524jy",
          "author": "Fuzzy_sleep",
          "body": "They try and make good vs bad, but then literally convince everyone that everything is bad in some way. “Yes, u can eat fruit, but not any fruit because it’s too high in sugar. Stick to vegetables, but don’t have vegetables because they’re too carby and carbs are terrible for u. But don’t u dare touch anything else!”",
          "created_utc": 1632518107.0
        }
      ]
    },
    {
      "id": "he5so19",
      "author": "NutelllaBellla",
      "body": "Omg right?!! Salt has no calories! And correct about the water retention haha. Yeah him and my grandparents body shame a lot and vomit unsolicited diet advice. 😵",
      "created_utc": 1632529986.0,
      "score": 12,
      "context": [
        {
          "id": "he59pxf",
          "author": "NutelllaBellla",
          "body": "Lol my Dad once told my sister to \"slow down on eating all those grapes! They have a lot of sugar , that's why you have a muffin top\". K, noted and recorded. Also \"U can't mix fat and carbs in a meal bc your body will instantly convert all of it to fat\", and \"Adding salt to your food makes you gain fat\" and \"Eating faster makes your body absorb more calories so eat as slow as possible\" and \"Don't eat a single carb after 6 pm, your body will store it all as belly fat\"   and \"Any white carb is the devil... thou shall NEVER eat white rice\".",
          "created_utc": 1632521385.0
        },
        {
          "id": "he5egw4",
          "author": "no_uapples",
          "body": "Salt does not make you gain fat smh how did it cheat the laws of thermodynamics the only reason why I weigh more after eating salt is BC sodium retains water and you will piss it out anyways. Anyways ur dad is kinda a bitch for shaming y'all 😾😾",
          "created_utc": 1632523484.0
        }
      ]
    },
    {
      "id": "he59lm2",
      "author": "Sareeee48",
      "body": "Lmfaooo I hate it here 😭 like they might as well tell us to eat nothing starve ourselves.\n\nIt’s so shitty because I went YEARS avoiding fruit, carbs, most vegetables, meats and dairy because I got to the point where everything I read reaffirmed everything was bad for me.",
      "created_utc": 1632521331.0,
      "score": 12,
      "context": [
        {
          "id": "he52rvl",
          "author": "Sareeee48",
          "body": "“Table sugar is bad for you but fruit sugar is good for you” despite the fact that both fructose and glucose come from fruit and other naturally sweet things 🙃\n\nNow obviously I’m not saying eating only sugar is gonna be healthy (all foods will be bad if eaten in mass quantities, including fruits and veggies), but maybe if we didn’t have these dumb ass myths surrounding sugar that prevent us from consuming it at all costs then we wouldn’t crave it so god damn much.",
          "created_utc": 1632518383.0
        },
        {
          "id": "he57psg",
          "author": "Fuzzy_sleep",
          "body": "I was reading some article on fruit, and get this: apparently eating fruit on its own is great, but when blended with other fruits into a smoothie WITHOUT added sugar (so just pure fruit blended), it’s classed as “bad” sugar…. Yes, that is exactly what I read. I had to read it again, like, ten times before I realised I was just reading pure bullshit. I can’t for the life of me find this article else I would post it, but jeez, it triggered me lmao",
          "created_utc": 1632520510.0
        }
      ]
    },
    {
      "id": "he5lwl1",
      "author": "Sareeee48",
      "body": "Exactly! and let’s be real; no one with a healthy relationship with food is eating straight table sugar lol. Chocolate treats, for example, have magnesium, calcium, sulfur, zinc, iron, copper, potassium, vitamins B1, B2, B3, B5, B9 and E.\n\nAnd even if it didn’t? Sugar gives you energy and is delicious. It saves my diabetic family members’ lives when their blood sugar drops.",
      "created_utc": 1632526858.0,
      "score": 10,
      "context": [
        {
          "id": "he52rvl",
          "author": "Sareeee48",
          "body": "“Table sugar is bad for you but fruit sugar is good for you” despite the fact that both fructose and glucose come from fruit and other naturally sweet things 🙃\n\nNow obviously I’m not saying eating only sugar is gonna be healthy (all foods will be bad if eaten in mass quantities, including fruits and veggies), but maybe if we didn’t have these dumb ass myths surrounding sugar that prevent us from consuming it at all costs then we wouldn’t crave it so god damn much.",
          "created_utc": 1632518383.0
        },
        {
          "id": "he5cgs1",
          "author": "throwaway-m1",
          "body": "Yep!! The only difference between table sugar and fruit sugar is that fruits also have fiber & vitamins which helps your body process the sugar without having a blood sugar drop, and keeps you full longer. But you can also have something with fiber or protein with candy or w/e to have a similar effect (or not!)",
          "created_utc": 1632522585.0
        }
      ]
    },
    {
      "id": "he8gc12",
      "author": "fifteen-eggs",
      "body": "This post has been deleted.",
      "created_utc": 1632585667.0,
      "score": 7,
      "context": [
        {
          "id": "he5adld",
          "author": "YourFrogMom",
          "body": "Having some fun with this because diet culture is horrible and triggering and mean:  \n\"Grapes are too high calorie\"/\"Fruit is basically candy so never ever eat it\"   \nbut also \"Eat nothing but fruit, sadness, and vegetables, but not with starch or carbs!!\" \"Anyone can be \"thin\", it's just a matter of Self Control (tm)\"  \n\"People who eat a lot are FAT and if they're NOT then they are just BLESSED\"   \n\"Bread/carbs is the devil\"   \n\"Milk is bad and full of sugar, only drink skim milk or unsweetened almond milk (even though you can tolerate lactose), both of which are basically white-ish water because it's low calorie and will remove precisely 60% of the remaining joy in your life-\"  \n\"Low calorie = good stuff:))) high calorie = always bad!! very scary!! instant become fat lose all of your friends?! Oh god oh no a croissant will ruin my life-\"\n\nand my personal favorite as a 5'0 AFAB: \"Short women only need 1200 calories (or less!) a day uwu\"  \nYou just can't win man it's so dumb lol",
          "created_utc": 1632521670.0
        },
        {
          "id": "he6nbh3",
          "author": "mehperson",
          "body": "HONESTLY.\n\nI really hate it whenever people say \"unless you're a 5'0 woman, you can't live off of 1200 calories\". Sure, I could but I'd have to be quite sedentary to do that. I like running and shit, so there's no way I could eat only 1200 calories without fainting",
          "created_utc": 1632545211.0
        }
      ]
    },
    {
      "id": "he8sawf",
      "author": "YourFrogMom",
      "body": "Right?? I'm a competitive dancer and back in the day I was like \"Oh yeah that sounds like plenty, I'm short!\" (Conveniently forgetting that four dance classes a week isn't sedentary) followed up with \"This feels good! Why don't I do intermittent fasting too?\"  \nCut to losing nearly half my body weight in a year LMAO   \nLooking back I want to scream \"***STOP***!! You are 13!! YOU DON'T NEED TO DIET\" (I'm 15 now and it's been a wild few years)",
      "created_utc": 1632590944.0,
      "score": 3,
      "context": [
        {
          "id": "he5adld",
          "author": "YourFrogMom",
          "body": "Having some fun with this because diet culture is horrible and triggering and mean:  \n\"Grapes are too high calorie\"/\"Fruit is basically candy so never ever eat it\"   \nbut also \"Eat nothing but fruit, sadness, and vegetables, but not with starch or carbs!!\" \"Anyone can be \"thin\", it's just a matter of Self Control (tm)\"  \n\"People who eat a lot are FAT and if they're NOT then they are just BLESSED\"   \n\"Bread/carbs is the devil\"   \n\"Milk is bad and full of sugar, only drink skim milk or unsweetened almond milk (even though you can tolerate lactose), both of which are basically white-ish water because it's low calorie and will remove precisely 60% of the remaining joy in your life-\"  \n\"Low calorie = good stuff:))) high calorie = always bad!! very scary!! instant become fat lose all of your friends?! Oh god oh no a croissant will ruin my life-\"\n\nand my personal favorite as a 5'0 AFAB: \"Short women only need 1200 calories (or less!) a day uwu\"  \nYou just can't win man it's so dumb lol",
          "created_utc": 1632521670.0
        },
        {
          "id": "he6nbh3",
          "author": "mehperson",
          "body": "HONESTLY.\n\nI really hate it whenever people say \"unless you're a 5'0 woman, you can't live off of 1200 calories\". Sure, I could but I'd have to be quite sedentary to do that. I like running and shit, so there's no way I could eat only 1200 calories without fainting",
          "created_utc": 1632545211.0
        }
      ]
    },
    {
      "id": "hea7390",
      "author": "None",
      "body": "whattttt that’s so messed up :( i hope ur doing better now, numbers don’t define u!!",
      "created_utc": 1632614148.0,
      "score": 3,
      "context": [
        {
          "id": "he5ml1h",
          "author": "None",
          "body": "tw calories??\n\n\n1200 calories is enough… like even if you’re short just no!! you need more!! it’s ok!!",
          "created_utc": 1632527169.0
        },
        {
          "id": "he8t1w8",
          "author": "YourFrogMom",
          "body": "THIS!!! (tw: weight, blanked out) Being a very short person (Barely 5'0) with small bones and having all of the dumb calculators say \"Oh yeah you need 1000 calories a day :DDDD\" \"Oh yeah you're not even underweight until you're >!80 pounds!< or less :)))))) In fact, being>! 115 pounds!< is overweight and you, a 15 year old, should diet:((((\" I swear these stupid numbers partially caused me to have an ED in the first place lol",
          "created_utc": 1632591268.0
        }
      ]
    },
    {
      "id": "he63317",
      "author": "standsure",
      "body": "I think it's the high sugar content.",
      "created_utc": 1632534835.0,
      "score": 4,
      "context": [
        {
          "id": "he55wyz",
          "author": "standsure",
          "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
          "created_utc": 1632519731.0
        },
        {
          "id": "he57y27",
          "author": "Fuzzy_sleep",
          "body": "Wait, why are grapes bad now? I knew that bananas are apparently filled with “bad” carbs, but wtf have grapes done?",
          "created_utc": 1632520613.0
        }
      ]
    },
    {
      "id": "he80wm5",
      "author": "Notreallysurebutidc",
      "body": "Grapes should be fine lmao, not for diabetics tho.. spikes their sugar levels way too much.",
      "created_utc": 1632578574.0,
      "score": 2,
      "context": [
        {
          "id": "he55wyz",
          "author": "standsure",
          "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
          "created_utc": 1632519731.0
        },
        {
          "id": "he57y27",
          "author": "Fuzzy_sleep",
          "body": "Wait, why are grapes bad now? I knew that bananas are apparently filled with “bad” carbs, but wtf have grapes done?",
          "created_utc": 1632520613.0
        }
      ]
    },
    {
      "id": "he7a825",
      "author": "messythelioma",
      "body": "I actually used to do this not for keto, but because I heard somewhere that the fat in butter binds to the caffeine molecules, which makes it harder to metabolize, so it essentially elongates the window of time that the caffeine affects you.",
      "created_utc": 1632561956.0,
      "score": 2,
      "context": [
        {
          "id": "he643yl",
          "author": "sorcerers_apprentice",
          "body": "\"Fruit is bad for you. You'll gain weight.\"\n\n*Ok, so what should I eat to lose weight?*\n\n\"Coffee with butter in it.\"",
          "created_utc": 1632535311.0
        },
        {
          "id": "he73cmx",
          "author": "BeastieBeck",
          "body": ">\"Coffee with butter in it.\"\n\nTell me you're a Ketotarian without using the word keto. 😂",
          "created_utc": 1632556373.0
        }
      ]
    },
    {
      "id": "he8mp3i",
      "author": "Sareeee48",
      "body": "Yeah that one never made sense to me and yet I STILL followed it.",
      "created_utc": 1632588515.0,
      "score": 6,
      "context": [
        {
          "id": "he5n8iv",
          "author": "Sareeee48",
          "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
          "created_utc": 1632527466.0
        },
        {
          "id": "he8ljet",
          "author": "lilyskins",
          "body": "The hunger = thirst one is so heinous bc I totally fell for it without even realizing that I was already the most hydrated person on the planet (Like I need way more water than my friends to function) so there was no way it could even have been true for me 😭😭😭",
          "created_utc": 1632587998.0
        }
      ]
    },
    {
      "id": "he911jf",
      "author": "Sareeee48",
      "body": "Oh yeah 1000% fake. Studies have concluded as much.",
      "created_utc": 1632594803.0,
      "score": 2,
      "context": [
        {
          "id": "he5n8iv",
          "author": "Sareeee48",
          "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
          "created_utc": 1632527466.0
        },
        {
          "id": "he8taqq",
          "author": "YourFrogMom",
          "body": "Oh wait... I didn't realize the water one wasn't true... Oh no",
          "created_utc": 1632591377.0
        }
      ]
    },
    {
      "id": "he7ozl7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1632572496.0,
      "score": 5,
      "context": [
        {
          "id": "he5iquc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1632525415.0
        },
        {
          "id": "he77qud",
          "author": "Fuzzy_sleep",
          "body": "I actually hadn’t read the stuff about grapes, funnily enough I’ve had a portion of grapes today as a snack and my instant thought was “I don’t f’ing care” when I read the stuff about grapes",
          "created_utc": 1632559912.0
        }
      ]
    },
    {
      "id": "he9kbso",
      "author": "messythelioma",
      "body": "And it makes me angry still when people try to combat diet culture by saying \"you're not fat!\" as a compliment when it still equates fat as bad (and unattractive).",
      "created_utc": 1632603388.0,
      "score": 5,
      "context": [
        {
          "id": "he7a9mt",
          "author": "messythelioma",
          "body": "That being fat is bad or having fat on you is bad.",
          "created_utc": 1632561992.0
        },
        {
          "id": "he8tt6e",
          "author": "YourFrogMom",
          "body": "This. It's so stupid.   \n\"God forbid your body tries to insulate your organs!! It might make it so you can't be a size -000000! If you're not fighting against your set point 24/7, it must mean you have \"no willpower\" and are, therefore \"being lazy\". Quick! Replace that enjoyable food with ice cubes and blueberries, hurry hurry!!\"",
          "created_utc": 1632591609.0
        }
      ]
    },
    {
      "id": "hebd9li",
      "author": "None",
      "body": "Yeah it drives me nuts!",
      "created_utc": 1632636114.0,
      "score": 1,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        },
        {
          "id": "heb1tyh",
          "author": "thingsivegottenridof",
          "body": "The veganism thing is really insidious. People get really defensive about it as well.",
          "created_utc": 1632629286.0
        }
      ]
    },
    {
      "id": "he52okf",
      "author": "Fuzzy_sleep",
      "body": "People: eat fruit / diet culture: NO WHATSFF ARE DOIG NG!!.!!?!???!??!!!!",
      "created_utc": 1632518345.0,
      "score": 7,
      "context": [
        {
          "id": "he514fd",
          "author": "asoftyam",
          "body": "The whole notion of “good food vs bad food” lol",
          "created_utc": 1632517675.0
        },
        {
          "id": "he524jy",
          "author": "Fuzzy_sleep",
          "body": "They try and make good vs bad, but then literally convince everyone that everything is bad in some way. “Yes, u can eat fruit, but not any fruit because it’s too high in sugar. Stick to vegetables, but don’t have vegetables because they’re too carby and carbs are terrible for u. But don’t u dare touch anything else!”",
          "created_utc": 1632518107.0
        },
        {
          "id": "he52fxq",
          "author": "asoftyam",
          "body": "Yeah exactly. Nothing is ever good enough and nobody knows wtf they’re doing lmao",
          "created_utc": 1632518242.0
        }
      ]
    },
    {
      "id": "he77cou",
      "author": "Fuzzy_sleep",
      "body": "Ok, I never actually knew that about salt. I still believed that one 😵 I’ve never put salt on my meals since! I didn’t even realise that diet culture had still got me with that one!! Damnnnnm",
      "created_utc": 1632559598.0,
      "score": 8,
      "context": [
        {
          "id": "he59pxf",
          "author": "NutelllaBellla",
          "body": "Lol my Dad once told my sister to \"slow down on eating all those grapes! They have a lot of sugar , that's why you have a muffin top\". K, noted and recorded. Also \"U can't mix fat and carbs in a meal bc your body will instantly convert all of it to fat\", and \"Adding salt to your food makes you gain fat\" and \"Eating faster makes your body absorb more calories so eat as slow as possible\" and \"Don't eat a single carb after 6 pm, your body will store it all as belly fat\"   and \"Any white carb is the devil... thou shall NEVER eat white rice\".",
          "created_utc": 1632521385.0
        },
        {
          "id": "he5egw4",
          "author": "no_uapples",
          "body": "Salt does not make you gain fat smh how did it cheat the laws of thermodynamics the only reason why I weigh more after eating salt is BC sodium retains water and you will piss it out anyways. Anyways ur dad is kinda a bitch for shaming y'all 😾😾",
          "created_utc": 1632523484.0
        },
        {
          "id": "he5so19",
          "author": "NutelllaBellla",
          "body": "Omg right?!! Salt has no calories! And correct about the water retention haha. Yeah him and my grandparents body shame a lot and vomit unsolicited diet advice. 😵",
          "created_utc": 1632529986.0
        }
      ]
    },
    {
      "id": "he8qzjr",
      "author": "None",
      "body": "Yeah like I totally *can* do that at 5'1\" and that would be called having an eating disorder",
      "created_utc": 1632590380.0,
      "score": 5,
      "context": [
        {
          "id": "he5adld",
          "author": "YourFrogMom",
          "body": "Having some fun with this because diet culture is horrible and triggering and mean:  \n\"Grapes are too high calorie\"/\"Fruit is basically candy so never ever eat it\"   \nbut also \"Eat nothing but fruit, sadness, and vegetables, but not with starch or carbs!!\" \"Anyone can be \"thin\", it's just a matter of Self Control (tm)\"  \n\"People who eat a lot are FAT and if they're NOT then they are just BLESSED\"   \n\"Bread/carbs is the devil\"   \n\"Milk is bad and full of sugar, only drink skim milk or unsweetened almond milk (even though you can tolerate lactose), both of which are basically white-ish water because it's low calorie and will remove precisely 60% of the remaining joy in your life-\"  \n\"Low calorie = good stuff:))) high calorie = always bad!! very scary!! instant become fat lose all of your friends?! Oh god oh no a croissant will ruin my life-\"\n\nand my personal favorite as a 5'0 AFAB: \"Short women only need 1200 calories (or less!) a day uwu\"  \nYou just can't win man it's so dumb lol",
          "created_utc": 1632521670.0
        },
        {
          "id": "he6nbh3",
          "author": "mehperson",
          "body": "HONESTLY.\n\nI really hate it whenever people say \"unless you're a 5'0 woman, you can't live off of 1200 calories\". Sure, I could but I'd have to be quite sedentary to do that. I like running and shit, so there's no way I could eat only 1200 calories without fainting",
          "created_utc": 1632545211.0
        },
        {
          "id": "he8gc12",
          "author": "fifteen-eggs",
          "body": "This post has been deleted.",
          "created_utc": 1632585667.0
        }
      ]
    },
    {
      "id": "heawq10",
      "author": "YourFrogMom",
      "body": "Thanks for your reply! Yes, I’m in recovery now and doing a bit better:) Numbers still suck though>:(\nOne of the numerous reasons BMI is bunk is that can’t get it through its head that muscle≠fat. I’m an athlete and obv gain muscle weight during competition season and this sent me down some dark rabbit holes let me tell you- but hopefully I’m through with that!!",
      "created_utc": 1632626631.0,
      "score": 5,
      "context": [
        {
          "id": "he5ml1h",
          "author": "None",
          "body": "tw calories??\n\n\n1200 calories is enough… like even if you’re short just no!! you need more!! it’s ok!!",
          "created_utc": 1632527169.0
        },
        {
          "id": "he8t1w8",
          "author": "YourFrogMom",
          "body": "THIS!!! (tw: weight, blanked out) Being a very short person (Barely 5'0) with small bones and having all of the dumb calculators say \"Oh yeah you need 1000 calories a day :DDDD\" \"Oh yeah you're not even underweight until you're >!80 pounds!< or less :)))))) In fact, being>! 115 pounds!< is overweight and you, a 15 year old, should diet:((((\" I swear these stupid numbers partially caused me to have an ED in the first place lol",
          "created_utc": 1632591268.0
        },
        {
          "id": "hea7390",
          "author": "None",
          "body": "whattttt that’s so messed up :( i hope ur doing better now, numbers don’t define u!!",
          "created_utc": 1632614148.0
        }
      ]
    },
    {
      "id": "he8rpmi",
      "author": "ForestRagamuffin",
      "body": "i'm diabetic and grapes work great for my blood sugar. the fibre in them slows down sugar absorption and if you add fat and/or protein to your grape snack (milk! peanut butter! cheese!), that'll slow sugar absorption further. grapes for aaaaaaall!!!!!",
      "created_utc": 1632590687.0,
      "score": 2,
      "context": [
        {
          "id": "he55wyz",
          "author": "standsure",
          "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
          "created_utc": 1632519731.0
        },
        {
          "id": "he57y27",
          "author": "Fuzzy_sleep",
          "body": "Wait, why are grapes bad now? I knew that bananas are apparently filled with “bad” carbs, but wtf have grapes done?",
          "created_utc": 1632520613.0
        },
        {
          "id": "he80wm5",
          "author": "Notreallysurebutidc",
          "body": "Grapes should be fine lmao, not for diabetics tho.. spikes their sugar levels way too much.",
          "created_utc": 1632578574.0
        }
      ]
    },
    {
      "id": "he961j7",
      "author": "YourFrogMom",
      "body": "That's such a relief omg. Thank you!!! <3",
      "created_utc": 1632597025.0,
      "score": 1,
      "context": [
        {
          "id": "he5n8iv",
          "author": "Sareeee48",
          "body": "fat people have slow metabolisms and skinny people have fast metabolisms; actually, fat folk actually have faster metabolisms in order to support their larger body’s energy needs.\n\nThirst is frequently mistaken for hunger. This one is just… dumb.\n\nIf you eat within three hours before sleep, you’ll gain weight since the metabolism slows during sleep (which somehow means you gain fat??? Your body is still gonna metabolize what you ate regardless).\n\nEating high volume, low calorie foods will make you fuller. Similarly, eating caloric dense foods with allow you to eat far more calories and gain weight… umm excuse me, so you know how our metabolism and energy needs work?\n\nThe entire fucking concept of the keto diet.\n\nTelling people it’s healthy to starve themselves and then calling it “fasting.”",
          "created_utc": 1632527466.0
        },
        {
          "id": "he8taqq",
          "author": "YourFrogMom",
          "body": "Oh wait... I didn't realize the water one wasn't true... Oh no",
          "created_utc": 1632591377.0
        },
        {
          "id": "he911jf",
          "author": "Sareeee48",
          "body": "Oh yeah 1000% fake. Studies have concluded as much.",
          "created_utc": 1632594803.0
        }
      ]
    },
    {
      "id": "he7r560",
      "author": "Fuzzy_sleep",
      "body": "It’s probably the same in the USA, but here in the UK we have the ‘5-a-day’ rule: we’re supposed to eat 5 fruits and veg a day, but I can guarantee not one person I know does this. And probably most people in the UK don’t anyway. And you’re also only allowed 30g of sugar a day here, which it’s literally impossible to only eat 30g in modern days. Everything has sugar in it.",
      "created_utc": 1632573695.0,
      "score": 2,
      "context": [
        {
          "id": "he5iquc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1632525415.0
        },
        {
          "id": "he77qud",
          "author": "Fuzzy_sleep",
          "body": "I actually hadn’t read the stuff about grapes, funnily enough I’ve had a portion of grapes today as a snack and my instant thought was “I don’t f’ing care” when I read the stuff about grapes",
          "created_utc": 1632559912.0
        },
        {
          "id": "he7ozl7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1632572496.0
        }
      ]
    },
    {
      "id": "hehopxk",
      "author": "thingsivegottenridof",
      "body": "I haven’t been on the receiving end of any defensiveness but I’ve watched it in action, and I find myself at a loss for words. I know some vegans who are infinitely more disordered than I was at my worst. Idk what you say to someone you’re worried about who’s hissing at you that they are beyond healthy because they eat vegan, _you’re_ the one who’s so unhealthy because you eat x, y, and z.",
      "created_utc": 1632761853.0,
      "score": 1,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        },
        {
          "id": "heb1tyh",
          "author": "thingsivegottenridof",
          "body": "The veganism thing is really insidious. People get really defensive about it as well.",
          "created_utc": 1632629286.0
        },
        {
          "id": "hebd9li",
          "author": "None",
          "body": "Yeah it drives me nuts!",
          "created_utc": 1632636114.0
        }
      ]
    },
    {
      "id": "he8s4mk",
      "author": "Notreallysurebutidc",
      "body": "Oh really? My sister and mom are type one diabetic and it doesn’t work for them. But if they do work for you, I love that!(:",
      "created_utc": 1632590866.0,
      "score": 1,
      "context": [
        {
          "id": "he55wyz",
          "author": "standsure",
          "body": "Bananas are bad. Also grapes. \n\nSkim milk exists. \n\nCalories in Calories out is *still* touted as the successful option.",
          "created_utc": 1632519731.0
        },
        {
          "id": "he57y27",
          "author": "Fuzzy_sleep",
          "body": "Wait, why are grapes bad now? I knew that bananas are apparently filled with “bad” carbs, but wtf have grapes done?",
          "created_utc": 1632520613.0
        },
        {
          "id": "he80wm5",
          "author": "Notreallysurebutidc",
          "body": "Grapes should be fine lmao, not for diabetics tho.. spikes their sugar levels way too much.",
          "created_utc": 1632578574.0
        },
        {
          "id": "he8rpmi",
          "author": "ForestRagamuffin",
          "body": "i'm diabetic and grapes work great for my blood sugar. the fibre in them slows down sugar absorption and if you add fat and/or protein to your grape snack (milk! peanut butter! cheese!), that'll slow sugar absorption further. grapes for aaaaaaall!!!!!",
          "created_utc": 1632590687.0
        }
      ]
    },
    {
      "id": "hehrntw",
      "author": "None",
      "body": "Yeah it seems to be impossible to get through to people on it because there’s so much self righteousness. I don’t think it’s inherently disordered to be vegan, but I do think it’s a slippery slope as far as food rules go. And I think the fact that people won’t give up veganism for even a short time to recover or whatever is a good sign it’s very connected to their ED.",
      "created_utc": 1632763230.0,
      "score": 2,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        },
        {
          "id": "heb1tyh",
          "author": "thingsivegottenridof",
          "body": "The veganism thing is really insidious. People get really defensive about it as well.",
          "created_utc": 1632629286.0
        },
        {
          "id": "hebd9li",
          "author": "None",
          "body": "Yeah it drives me nuts!",
          "created_utc": 1632636114.0
        },
        {
          "id": "hehopxk",
          "author": "thingsivegottenridof",
          "body": "I haven’t been on the receiving end of any defensiveness but I’ve watched it in action, and I find myself at a loss for words. I know some vegans who are infinitely more disordered than I was at my worst. Idk what you say to someone you’re worried about who’s hissing at you that they are beyond healthy because they eat vegan, _you’re_ the one who’s so unhealthy because you eat x, y, and z.",
          "created_utc": 1632761853.0
        }
      ]
    },
    {
      "id": "hehty6b",
      "author": "thingsivegottenridof",
      "body": "I guess this is the line where my antidiet stance gets quite rigid. I don’t personally think food rules are healthy—much better to eat what your body is hungry for.\n\nI know that veganism goes beyond diet and is also about ethical consumption but this argument falls somewhat flat for me for a variety of reasons. That aside, though, it comes from me from a place of concern for others’ well-being. It’s airplane logic. If you need to recover from restriction put your own air mask on before helping others.",
      "created_utc": 1632764234.0,
      "score": 2,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        },
        {
          "id": "heb1tyh",
          "author": "thingsivegottenridof",
          "body": "The veganism thing is really insidious. People get really defensive about it as well.",
          "created_utc": 1632629286.0
        },
        {
          "id": "hebd9li",
          "author": "None",
          "body": "Yeah it drives me nuts!",
          "created_utc": 1632636114.0
        },
        {
          "id": "hehopxk",
          "author": "thingsivegottenridof",
          "body": "I haven’t been on the receiving end of any defensiveness but I’ve watched it in action, and I find myself at a loss for words. I know some vegans who are infinitely more disordered than I was at my worst. Idk what you say to someone you’re worried about who’s hissing at you that they are beyond healthy because they eat vegan, _you’re_ the one who’s so unhealthy because you eat x, y, and z.",
          "created_utc": 1632761853.0
        },
        {
          "id": "hehrntw",
          "author": "None",
          "body": "Yeah it seems to be impossible to get through to people on it because there’s so much self righteousness. I don’t think it’s inherently disordered to be vegan, but I do think it’s a slippery slope as far as food rules go. And I think the fact that people won’t give up veganism for even a short time to recover or whatever is a good sign it’s very connected to their ED.",
          "created_utc": 1632763230.0
        }
      ]
    },
    {
      "id": "hehynws",
      "author": "None",
      "body": "Yeah I honestly think veganism is stupid and most people who are knowledgeable and passionate about animal rights and sustainable agriculture know that consuming animal products isn’t inherently wrong in all situations. Having such rigid food rules isn’t helpful. I just think for some people it doesn’t necessarily make such a negative impact on their life that it’s necessarily a disorder. But yeah veganism in ED spaces is just all around 👎👎",
      "created_utc": 1632766391.0,
      "score": 1,
      "context": [
        {
          "id": "he8sxgw",
          "author": "None",
          "body": "That veganism is the end all be all of \\*health\\* - anyone notice how many people with eating disorders are vegan? Do you actually care about sustainable food production or do you just like having rigid food rules to give you a sense of control?\n\nEating monstrous amounts of protein to lose fat (hint: your body can still convert everything to fat). \n\nIf you can get away with eating fewer calories you should always choose that option, the concept that you will feel better and function better if you give your body enough food (even if you're not super hungry) seems to be lost on them. \n\nI can't eat gluten (certainly not by choice, I would do so much to get it back) and the fact that so many of the foods I can eat are marketed as 'healthy alternatives' when they have the same macros as gluten food. It also drives me nuts that every recipe I search for gluten free always has weird fucking ingredient substitutions like almond flour, not because it tastes better but because it's 'healthier'. Let me eat my chocolate cake in peace! Gluten isn't bad! Gluten is delicious and those that can should enjoy the fuck out of it.\n\nShirataki noodles. Non-fat dairy. 100 calorie snack packs. Sugar-free anything (although I know this is helpful for certain medical conditions, that's not who they're marketing to).",
          "created_utc": 1632591216.0
        },
        {
          "id": "heb1tyh",
          "author": "thingsivegottenridof",
          "body": "The veganism thing is really insidious. People get really defensive about it as well.",
          "created_utc": 1632629286.0
        },
        {
          "id": "hebd9li",
          "author": "None",
          "body": "Yeah it drives me nuts!",
          "created_utc": 1632636114.0
        },
        {
          "id": "hehopxk",
          "author": "thingsivegottenridof",
          "body": "I haven’t been on the receiving end of any defensiveness but I’ve watched it in action, and I find myself at a loss for words. I know some vegans who are infinitely more disordered than I was at my worst. Idk what you say to someone you’re worried about who’s hissing at you that they are beyond healthy because they eat vegan, _you’re_ the one who’s so unhealthy because you eat x, y, and z.",
          "created_utc": 1632761853.0
        },
        {
          "id": "hehrntw",
          "author": "None",
          "body": "Yeah it seems to be impossible to get through to people on it because there’s so much self righteousness. I don’t think it’s inherently disordered to be vegan, but I do think it’s a slippery slope as far as food rules go. And I think the fact that people won’t give up veganism for even a short time to recover or whatever is a good sign it’s very connected to their ED.",
          "created_utc": 1632763230.0
        },
        {
          "id": "hehty6b",
          "author": "thingsivegottenridof",
          "body": "I guess this is the line where my antidiet stance gets quite rigid. I don’t personally think food rules are healthy—much better to eat what your body is hungry for.\n\nI know that veganism goes beyond diet and is also about ethical consumption but this argument falls somewhat flat for me for a variety of reasons. That aside, though, it comes from me from a place of concern for others’ well-being. It’s airplane logic. If you need to recover from restriction put your own air mask on before helping others.",
          "created_utc": 1632764234.0
        }
      ]
    }
  ]
}