{
  "id": "q5l8bd",
  "subreddit": "fuckeatingdisorders",
  "author": "mustardlyy",
  "created_utc": 1633915544.0,
  "title": "I just hate diet fads so much",
  "selftext": "I don’t want to trigger anyone who does keto if it actually works out for you and keeps you happy and healthy. So if you’re one of those people, pls don’t read further because I’m about to vent about how much I personally dislike it. \n\nHOLY CRAP FUCK KETO. I’m sorry but it’s the stupidest fucking diet trend I’ve seen in the past few years and I will actually scream if I see one more keto influencer pretend like eating cream cheese and iceberg lettuce every day is satisfying. I hate it so much I can’t even put it into words. I hate diets that restrict massive food groups like that. I don’t understand how it’s healthy. It’s so triggering to me when people suggest I do keto or IF or one of the other many poopy diet trends out there. The quality of my day goes down slightly whenever I’m grocery shopping and see some keto-branded food item. Am I the only one who hates the keto fad this much? Maybe I just have some personal issues to work out because I don’t think it’s normal to get this worked up over keto 😂 Goddamn. Like yes honey let me just pack my lunch of plain ground turkey wrapped in lettuce and cream cheese stuffed peppers. Like holy fuck that sounds like hell. I would rather eat box macaroni every day for the rest of my life than cut out carbs completely. \n\nI think what bothers me the most is how people will just automatically recommend keto to anyone and everyone as a weight loss method. Like no, get out of my face with that. I’d rather enjoy life thank you. \n\n I feel like in a few years we’re going to start hearing of health complications people are getting from this stupid fad considering it was originally for epileptic people, not your aunt trying to shed a few pounds after hearing about keto on Dr. Oz.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/q5l8bd/i_just_hate_diet_fads_so_much/",
  "score": 100,
  "num_comments": 19,
  "comments": [
    {
      "id": "hg6dn7a",
      "author": "Carodactyl",
      "body": "I don’t trust any diet that says to be careful around blueberries. Don’t get me wrong, a perfectly rounded diet contains all foods, but blueberries??? Really?? We’re demonizing fruit now??? What a ridiculous fad, can’t wait for it to blow over",
      "created_utc": 1633915941.0,
      "score": 62,
      "context": []
    },
    {
      "id": "hg6lb7k",
      "author": "horchata-latte",
      "body": "I feel this. I used to have a coworker who would point at my lunch and analyze when something I had wasn’t keto despite me telling her I wasn’t doing it alongside her lol it’s also funny how lots of the folks who do diets like that are also claiming “organic” and “health and wellness culture” when in reality to get pre-made keto snacks and keto foods such as low carb breads or sugar free ice creams you have to process the shit out of the food to get it up to par. which i don’t think is an issue i just find it interesting the overlap between “keto is healthier” and the folks who preach “organic whole food living” — Idk. i also can’t stand it at all just because it’s sold as this one solution cures all. It’s so restrictive it’s one of many diets that if not done carefully is absolutely a slippery slope into a full blown ED in my opinion",
      "created_utc": 1633919745.0,
      "score": 25,
      "context": []
    },
    {
      "id": "hg823n9",
      "author": "IamNotABaldEagle",
      "body": "Oh my god IF is basically a fast track to anorexia for me. I still have the demon in the back of my head telling me I can 'just' do a fasting day and have 500 calories.",
      "created_utc": 1633957148.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hg6kz01",
      "author": "fuego09",
      "body": "I hate it too!! With a passion. I learned in an anatomy and physiology class last year just HOW harmful it is to do long term and holy shit, it can get scary. What kills me is that one of my BEST friends has been on and off of it for YEARS. I just want to shake him and shout that he needs carbs. I'm legitimately concerned for his health but I don't want to overstep.\n\nI also agree with the above poster. Like according to keto you have to only have a tiny bit of fruits and vegetables? What kind of ass-backwards shit is that? Agree 1000%.",
      "created_utc": 1633919576.0,
      "score": 28,
      "context": []
    },
    {
      "id": "hg7j06n",
      "author": "Less-Feature6263",
      "body": "I'm not from the US and I feel like keto it's slowly taking over as the new fad diet even in my country, however from an outside perspective I feel like it's all over the US. Idk it feels like anyone is on keto and it's so weird because to me it's obvious it's a fad diet. Like it's clearly just the new fashion and people would slowly move away from it and start demonize some other food, at this point probably protein.\n\nAlso the fact that keto as an actual history as a medical protocol for certain problems probably made these people worse because now they all believe themselves expert on literally any subject: nutrition, medicine, history, anthropology, you name it and they know the answer because they've read the title of some paper online and they literally believe keto cures everything. \n\nA pet peeve of mine is when they always talk about \"our ancestors\" girl wtf are you talking about you don't even know what your grandmother was eating and you want to talk about cavemen. These people know nothing about nutrition and evolution and they want you to believe they are expert. I'm not saying that today we are the epitome of health (though we certainly live better than cavemen) but if you want to be less unhealthy you only have to look at your great grandparents, you don't have to bother those poor cave people.",
      "created_utc": 1633942823.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hg6th46",
      "author": "Sareeee48",
      "body": "Keto is terrible, it literally fueled my anorexia for 4 years and made it insanely easy to get away with restricting. Unless you are epileptic, nobody and I mean, *nobody* should be doing keto. Our bodies run off carbs and sugars to survive. I don’t care who you are, keto is just another way for people to continue with their eating disorder or disordered eating habits. I said what I said.",
      "created_utc": 1633924083.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hg94sh6",
      "author": "Sel_et_enchre",
      "body": "CW: calories\n\nTotally agree. In my pre-recovery days I definitely tried keto. I even went so far as to do a stall-buster \"keto fast\" where you eat 1000 calories a day, 80% of which come from fat. It's 5 200 calorie meals.  It was so fucking unhealthy. I was like microwaving heavy whipping cream with ground flax seed and cinnamon and calling it \"dessert.\" Like fuck that. My hair and skin got so greasy. I'm so much happier with carbs in my life.",
      "created_utc": 1633974189.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hg83vh4",
      "author": "SignificantGiraffe5",
      "body": "I do also",
      "created_utc": 1633958114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hg87d5w",
      "author": "Notreallysurebutidc",
      "body": "I love you for this.",
      "created_utc": 1633959903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hg87gi5",
      "author": "None",
      "body": "I totally agree!!!! My mum has been doing keto for over 4 years and it really worked for her and she claims she feels better doing it but I can't help but wonder what the long term effects will be. It also totally skewed her view of what's healthy and unhealthy so I kinda just have to tune it out.",
      "created_utc": 1633959948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hg8br16",
      "author": "jenlet78",
      "body": "I love this post lol.\n\nI am upfront with just about all aspects of my life. I have no shame in telling friends I struggle with disordered eating. So, imagine my frustration when I tell people this… and then I’m going through perimenopause and struggle with hormonal weight gain… and the same friends that know my history blindly say to me months later, “have you tried IF or Keto?” \n\nAre you fucking listening to me? No! Plus, I’ve tried Keto and it makes my IBS-C far worse than it already is! 😆",
      "created_utc": 1633961983.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hgfl2y1",
      "author": "None",
      "body": "Forever and ever AMEN",
      "created_utc": 1634090267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hg828hc",
      "author": "Corrupted-angel",
      "body": "Honestly i love keto because carbs make me bloat and they make my head fuzzy. I’m on the adhd/autism spectrum and theres studies linking gut health to better or worse symptoms depending on the amount of carbohydrates consumed in your diet. Sorry im not very educated, i just remember that processed carbs = a bad time for me. Unfortunately(or fortunately) i have a dairy allergy so im not a crazy butter drinker and cheese eater. I feel happy, healthy and satisfied when i eat tons of protein and fat. Its just what my body feels best with. I have a hard time sticking to a true keto diet though because i love fruits and vegetables. So i just kinda aim for a diet low in processed carbs. I’m not going to demonize fruit and veg, that’s ridiculous and triggering. I think people go pretty overboard with keto, and i don’t agree with pushing your diet on others. If it works for you then great, if it doesn’t match up with your lifestyle then great, do whats best for yourself. Try to ignore all the idiot fad dieters, and the intense keto people that treat their diet like a damn religion. Anyways ya thats my 2cents.",
      "created_utc": 1633957223.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hgfshtc",
      "author": "PastelSprite",
      "body": "I hate it too. Obviously people see results in diets that restrict food groups, but I don’t think that a lot of people understand that’s the reason they’re losing weight. Carbs in particular can cause water weight- but that’s most of what I suspect is lost.\n\n&nbsp;\n\nFunny thing about keto products is that I’ve found some that are astonishingly high in carbs, while say, the same item from the same brand-just not the keto-version, is lower in carbs and higher in protein. Isn’t keto supposed to be avoid carbs and prioritize protein? I unfortunately burst out laughing in the store when I saw that the first time. That said, there are some “keto” products that I really love. I’m also grateful for all the almond flour foods now because I have either gluten or fodmap sensitivity and while exploring, I found that I just genuinely love almond flour lol.\n\n&nbsp;\n\nI just hate diets in general. The popularity of them makes it very difficult to co-exist  with people while trying to recover too. Keto, GF used as a diet(for reasons unrelated to celiac or general GI upsets), and intermittent fasting have a special place in hell for me honestly. I especially hate IF and find it extremely triggering to see all over magazines at the grocery store. I’m just over here minding my own business picking out some foods that I want to be friends with and **bam** IF all over every magazine at checkout. Idk how that one ever became so widely acceptable.",
      "created_utc": 1634093827.0,
      "score": 1,
      "context": []
    },
    {
      "id": "il79gvm",
      "author": "None",
      "body": "So many people are focused on what the best diet is or what the latest recommendations are but forget the simple principles of [what healthy eating is](https://www.healthcoachkenny.com/blog/what-healthy-eating-is).",
      "created_utc": 1661095192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hg6ebdt",
      "author": "mustardlyy",
      "body": "Virgin blueberries vs Chad bacon grease. We just don’t know what true HEALTH is like. Your piss better be BLACK from all the ketones in your bloodstream or you’re not truly in health mode.",
      "created_utc": 1633916263.0,
      "score": 44,
      "context": [
        {
          "id": "hg6dn7a",
          "author": "Carodactyl",
          "body": "I don’t trust any diet that says to be careful around blueberries. Don’t get me wrong, a perfectly rounded diet contains all foods, but blueberries??? Really?? We’re demonizing fruit now??? What a ridiculous fad, can’t wait for it to blow over",
          "created_utc": 1633915941.0
        }
      ]
    },
    {
      "id": "hg6um6z",
      "author": "mustardlyy",
      "body": "I 10000000% agree! I didn’t wanna go full “this is literally unhealthy for most people” in my post because I really didn’t wanna trigger anyone. I know especially in a group about eating disorders that criticizing it could mean criticizing someone’s “safe” way of eating and I didn’t wanna do that. But yeah I think at it’s core keto is SO fucking unhealthy. Like, how is depriving your body of its literal fuel source good for you? Oh yeah, diet culture 🙄 Like no thanks I’ll eat a whole pint of blueberries just to spite the keto freaks lol",
      "created_utc": 1633924701.0,
      "score": 12,
      "context": [
        {
          "id": "hg6th46",
          "author": "Sareeee48",
          "body": "Keto is terrible, it literally fueled my anorexia for 4 years and made it insanely easy to get away with restricting. Unless you are epileptic, nobody and I mean, *nobody* should be doing keto. Our bodies run off carbs and sugars to survive. I don’t care who you are, keto is just another way for people to continue with their eating disorder or disordered eating habits. I said what I said.",
          "created_utc": 1633924083.0
        }
      ]
    },
    {
      "id": "hg82nnk",
      "author": "Corrupted-angel",
      "body": "Okay i don’t “love” keto. Considering i cant realistically stick to how restricting the diet is. I meant i love eating less carbs. It’s unrealistic to be eating literally no carbs, its crazy",
      "created_utc": 1633957458.0,
      "score": 5,
      "context": [
        {
          "id": "hg828hc",
          "author": "Corrupted-angel",
          "body": "Honestly i love keto because carbs make me bloat and they make my head fuzzy. I’m on the adhd/autism spectrum and theres studies linking gut health to better or worse symptoms depending on the amount of carbohydrates consumed in your diet. Sorry im not very educated, i just remember that processed carbs = a bad time for me. Unfortunately(or fortunately) i have a dairy allergy so im not a crazy butter drinker and cheese eater. I feel happy, healthy and satisfied when i eat tons of protein and fat. Its just what my body feels best with. I have a hard time sticking to a true keto diet though because i love fruits and vegetables. So i just kinda aim for a diet low in processed carbs. I’m not going to demonize fruit and veg, that’s ridiculous and triggering. I think people go pretty overboard with keto, and i don’t agree with pushing your diet on others. If it works for you then great, if it doesn’t match up with your lifestyle then great, do whats best for yourself. Try to ignore all the idiot fad dieters, and the intense keto people that treat their diet like a damn religion. Anyways ya thats my 2cents.",
          "created_utc": 1633957223.0
        }
      ]
    },
    {
      "id": "hg8o224",
      "author": "mustardlyy",
      "body": "And that’s totally okay! That’s why I put in that little disclaimer at the beginning, there’s always exceptions and I definitely didn’t wanna take a big poop on someone’s preferred way of eating if it works out for them :)  Thank you for giving your perspective, I was unaware of the link between gut health and adhd/autism, that’s super interesting.",
      "created_utc": 1633967313.0,
      "score": 2,
      "context": [
        {
          "id": "hg828hc",
          "author": "Corrupted-angel",
          "body": "Honestly i love keto because carbs make me bloat and they make my head fuzzy. I’m on the adhd/autism spectrum and theres studies linking gut health to better or worse symptoms depending on the amount of carbohydrates consumed in your diet. Sorry im not very educated, i just remember that processed carbs = a bad time for me. Unfortunately(or fortunately) i have a dairy allergy so im not a crazy butter drinker and cheese eater. I feel happy, healthy and satisfied when i eat tons of protein and fat. Its just what my body feels best with. I have a hard time sticking to a true keto diet though because i love fruits and vegetables. So i just kinda aim for a diet low in processed carbs. I’m not going to demonize fruit and veg, that’s ridiculous and triggering. I think people go pretty overboard with keto, and i don’t agree with pushing your diet on others. If it works for you then great, if it doesn’t match up with your lifestyle then great, do whats best for yourself. Try to ignore all the idiot fad dieters, and the intense keto people that treat their diet like a damn religion. Anyways ya thats my 2cents.",
          "created_utc": 1633957223.0
        }
      ]
    }
  ]
}