{
  "id": "qczfe6",
  "subreddit": "fuckeatingdisorders",
  "author": "hyppop",
  "created_utc": 1634844520.0,
  "title": "ED recovery without being underweight is hard",
  "selftext": "Hey everyone, sorry if this has already been a topic here but I just have to get my feelings out there today.  I am trying to recover from a restrictive ED without being ever underweight or losing too much weight. It has taken me so much time (1 year of \"recovery\" and therapy and all that shit) to just be able to acknowledge that I in fact have an ED.\n\nIt is so hard to let oneself eat more when every recovery content I see is just about needing to gain weight because of being underweight. It makes eating more and listening to my body almost impossible. I know that if I listened to my extreme mental hunger for a while, it will potentially calm down. But I just cannot let myself even near the possibility that I might gain weight in the process. All the arguments like \"your body needs it\" and \"you need your body to be healthy\" don't really work for me because technically, my body IS healthy. \n\nDoes anyone feel the same and/or know how to deal with that?\n\nThanks and stay safe!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/qczfe6/ed_recovery_without_being_underweight_is_hard/",
  "score": 124,
  "num_comments": 14,
  "comments": [
    {
      "id": "hhjjono",
      "author": "thingsivegottenridof",
      "body": "You can't say your body is healthy because it's a certain size the same way you can't say your body _isn't_ healthy because it's a certain size. Health is complicated and multifaceted, and having an eating disorder shows that your mind isn't healthy—and what are our minds but part of our bodies? The way we think certainly affects how we treat our bodies, that's for sure.\n\nI'm in the same boat. I was never underweight, and was typically closer to the higher end of the BMI. Now that I'm in recovery, I'm much heavier. I deal with it by getting on with it; when I'm eating and sleeping and resting properly, I'm better equipped to keep a good head on my shoulders to remind myself that my body is healing and is doing what it needs to. Reading stuff like _Anti-Diet_ and listening to plus-sized podcasters really helps too. I'm sorry you're feeling this way. Believe me: I get it.",
      "created_utc": 1634852042.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hhj3u1h",
      "author": "woolooooooooo",
      "body": "I do feel the same, and I still struggle with it every day. Truth is, just because we cannot see the damage we’ve done to our body doesn’t mean it isn’t there. It’s easy to think you’re healthy when you aren’t underweight but the size and shape of bodies are a spectrum and it is impossible to gauge on sight how your ED has affected your health. \n\nIf you have suffered from a restrictive ED recovery will include healing the damage done by that restriction, weight aside. It’s valid and it’s just as real. I wish you the best of luck. There are others out there just like me and you. ❤️",
      "created_utc": 1634845564.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hhjdvy4",
      "author": "lilyskins",
      "body": "Are we the same person omg. I had a little lapse recently where I had the ability to weigh myself for the first time in 3 months and it turns out my weight has for now stabilized a kilo or 2 above my lowest — which was also a “healthy” BMI. So that + other bad events in my life have me slipping back into fear of weight gain, thoughts about maintaining this specific weight, restricting, yada yada. \n\nWhat’s keeping me going is the physical proof that I may have been a “healthy” weight, but I was still sick— I lost so much hair, my resting heart rate was ridiculously low, I was the most rude and manipulative bitch on the planet to everyone I loved. Those other two are fixed, but only now can I see any regrowth in my hair, and I’m slowly feeling ok with the fact that I may at some point in recovery have a larger body than i ever have— but it’s ok because my hair will have all the nutrients to get thick and curly again :) the only way out is through. wishing you the best!",
      "created_utc": 1634849569.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hhk2r7t",
      "author": "keepmyheadabovewater",
      "body": "I hear ya. Every time I read something about gaining weight my brain immediately goes to “I don’t actually have an ED because I don’t need to gain weight at all I’m not sick enough to recover”, but then I have to remind myself why I want to recover. The fact that even though my BMI is healthy this ED has stolen my personality (literally have no personality anymore and I’m boring as f to be around), damaged my heart, consumed my mind, and hurt my husband. Everyone deserves recovery, no matter their BMI or the amount they’ve lost or any of that crap your ED tries to use against you to keep you hooked. Just remind yourself why you’re recovering and want to be healthy. You’ve got this!",
      "created_utc": 1634860824.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hhkc2le",
      "author": "Live-Arm7068",
      "body": "Honestly, I'm struggling with the same. I always feel like I have a fake eating disorder because I've always been overweight. I developed an eating disorder trying to \"rectify\" being overweight. I ended up gaining more weight. I had to feed the mental hunger for a while and I've stayed the same weight the entire time. I feel like that never made sense because I was eating so much food but it happened. You don't know what will happen with your weight and it is so difficult to accept your body will change in ways you don't want it to. I'm struggling so much too but I get your struggles I guess.",
      "created_utc": 1634865191.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hhjlqs5",
      "author": "None",
      "body": "I'm current in a very similar position, which had me admitting to my psychologist just yesterday that while I am determined to recover, stabilise my weight loss, and avoid admission, it comes with the overwhelming caveat that 'I don't gain weight' either. That that is at the top of my priority list is surely a warning sign that my thinking has a ways to go, even if my body doesn't. And if we don't launch cognitive intervention, things will eventually tip over for our bodies too, on more that just the scale. Just this week, the sheer pain of movement and forcing myself through exercise despite this is, when thinking logically, a definite pathway to long-term damage I am causing to myself inside and out whether or not other people see it. \n\nBut of course it's convenient to feel as though we've finally neutralised all of the dysmorphic thoughts that otherwise disturb our relationship with food (and exercise for me) and our body. That such physical pain can register as a symbol of my capacity to push through, to burn and earn my 'fuel', all while giving me the body I've longed for. *Aesthetically*. Because the irony is that I'm becoming less functional that I've ever been in every way that isn't directed towards my ED, including how physically able I feel when I'm not motivated by those thoughts alone. Because in reality, just like people do every day without seeing their weight significantly fluctuate (even though this is normal too), we could give our body what it needs, and double in functionality, mood etc.   \n\n\nThe point I'm trying to make is that perhaps looking at the other ways our body is *under* performing - and don't forget our brain is part of that - can be markers of how possessed we still are by something that we no longer want to be at the mercy of. That being afraid to even consume what drives our body because we're driven instead by a likely ~~irrational~~ fear of any meaningful weight gain means that we neglect all the other way we could be - WANT to be - 'healthy'. Sometimes, I try to remind myself that before I was officially diagnosed, I had many problematic thoughts and behaviours that led me here, and perhaps this is now an opportunity to properly recalibrate and learn about all the ways that nourishing my body empowers me with choice that I never previously had before. That being in control of that relationship can actually afford me a better *perception* of myself as much as an improved tangible relationship to food and exercise that have otherwise becomes tool of self-destruction. Otherwise, I don't think you or I would be on this forum looking for pathways to resist this, if we didn't believe that we had something worthy of resisting!   \n\n\nHere if you want to chat, and keep up the good fight for all the ways you deserve wellbeing!",
      "created_utc": 1634852933.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hhlfhda",
      "author": "SufficientEvent7238",
      "body": "I’m really struggling with this, too. I haven’t encountered anything I’ve found to be helpful in this aspect apart from data detailing how unhealthy I can be while at a healthy weight so I’ve really got nothing. But definitely feel the same way.",
      "created_utc": 1634889189.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hhlztif",
      "author": "hyppop",
      "body": "Wau, thank you all so much for the comments <3\n\nI went to sleep pretty down yesterday and just saw all that writing and it really warmed my heart and made me feel validated and not alone just to see that there are a lot of you out there who are going through the same thing. \n\nI think it's just the issue of constantly reminding myself that my issues and struggles are valid even if they don't \"fit\" into a category that exists in our society. Also, it is a lot about trusting my own feelings and trusting that what my body is telling me IS in fact serious, no matter what some charts or some IG accounts say.\n\nWe just have to remind ourselves constantly that we **DESERVE** recovery no matter what it entails - if that is gaining more weight, that that's what's healthy for our bodies!\n\nPlease keep writing your stories and thoughts, I really do think it helps to hear them and to know that this is not something uncommon.\n\nHave a great day and always be kind to yourselves ;)",
      "created_utc": 1634904914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hhj3b66",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1634845355.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hhlyja9",
      "author": "messythelioma",
      "body": "I've felt so invalidated as well by this... especially from \"ED recovery\" accounts where they show how skinny/bony they were (listing out their weights, heights, or BMIs, talking about the specific number of calories they'd eat, their thigh gaps, etc.). Then, they'd encourage weight gain and say things about how thigh gaps aren't important (whilst still looking very thin, unfortunately it makes me question if they are really in recovery). \n\nI don't know, it just makes me feel like I can't gain weight or eat more if I never got as skinny as they did (never got a thigh gap, never restricted to the x amount of calories they ate, never got to x amount of steps or worked out for x amount of time for x amount of days). \n\nIt's hard to get past these thoughts, but it's most helpful when I find other accounts that are actually encouraging. The bottom line is that these numbers don't mean shit. Eating disorders look different for people but recovery is relatively the same. You deserve to eat and you deserve to do it unconditionally because your body and your mind needs it. It's not something you have to earn, it's something you SHOULD have.",
      "created_utc": 1634904153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhlq4tk",
      "author": "lapetitepapillon",
      "body": "It is SO hard :/ but weight definitely doesn’t = health. You can be severely ill from an ED and morbidly obese, but non disordered and very thin, as well as the opposite.",
      "created_utc": 1634898457.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhlvu99",
      "author": "kespen9",
      "body": "I feel this. like, in my soul.\n\nI've been all the things at one point or another more than once and no matter what, **it's always valid.** the things that are helping me work through this special circle of ED hell is when my dietitian told me that EDs are not weight disorders, they are mental health disorders....I always thought they were *both,* turns out that was a hard nope and just my ED's opinion, not reality.\n\ni also created a separate IG account just to follow ED recovery dietitians (very niche lol), anti-diet culture accounts, HAES influencers, fat influencers, and ED recovery influencers making sure that they didn't have any of that 'before/after' shit, were way far along in recovery or considered themselves recovered, or their IGs were more text posts than pictures of themselves/food, a handful influencers that look more like me and not this like incredibly ideal version of life, and general mental health accounts. It took a lot of searching and scrolling!!! but its been super helpful. i also started unfollowing triggering accounts on my main IG and plan on eventually following all the new accounts i found.... but my thumbs can only handle so much right now lol",
      "created_utc": 1634902514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhnqg7r",
      "author": "None",
      "body": "I’m struggling with this too. I was always considered “normal” weight until a couple years ago when I gained a huge amount of weight in a short time due to a medication I was put on. It’s extremely frustrating because everything I see online is all “your body needs this” when that doesn’t apply to me, while at the same time I feel like I can’t actually talk to my psychologist about my struggles with food because they always discourage me from ever eating anything unhealthy ever (a la my 600lb life), so then I will feel extremely guilty for something like eating cake on my birthday or grabbing a latte with a friend, and fall back into a whole other purge/restrict cycle which eventually then leads to me overeating. It’s extremely frustrating and makes me feel so hopeless.",
      "created_utc": 1634931312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhkg6fc",
      "author": "Shelbyknows-no",
      "body": "That is so right on...totally what I think and do...it’s a really hard balancing act...agree on all your points. I don’t want to gain much weight, I want I be healthy and fuel my body and get back to the “athlete” I was so I’ll eat the foods, but it will be slow for me too.. some people talk about then mad hunger I don’t have that ..and some people talk about just eating what ever silly nilly...I’m not down with that either. I’d like to fuel with good healthy foods, and yes I will eat danger foods but not go crazy ... I don’t know it’s all really hard....and ten acceptance and letting go of control is the hardest part... I have to keep reminding myself that at my early recover period I do need to eat more to heal the damage and let the body recover worry about the rest as I progress...but my disease and coping skills still begs me to take “control”.... keep talking about it and reaching out..",
      "created_utc": 1634867099.0,
      "score": 2,
      "context": [
        {
          "id": "hhjlqs5",
          "author": "None",
          "body": "I'm current in a very similar position, which had me admitting to my psychologist just yesterday that while I am determined to recover, stabilise my weight loss, and avoid admission, it comes with the overwhelming caveat that 'I don't gain weight' either. That that is at the top of my priority list is surely a warning sign that my thinking has a ways to go, even if my body doesn't. And if we don't launch cognitive intervention, things will eventually tip over for our bodies too, on more that just the scale. Just this week, the sheer pain of movement and forcing myself through exercise despite this is, when thinking logically, a definite pathway to long-term damage I am causing to myself inside and out whether or not other people see it. \n\nBut of course it's convenient to feel as though we've finally neutralised all of the dysmorphic thoughts that otherwise disturb our relationship with food (and exercise for me) and our body. That such physical pain can register as a symbol of my capacity to push through, to burn and earn my 'fuel', all while giving me the body I've longed for. *Aesthetically*. Because the irony is that I'm becoming less functional that I've ever been in every way that isn't directed towards my ED, including how physically able I feel when I'm not motivated by those thoughts alone. Because in reality, just like people do every day without seeing their weight significantly fluctuate (even though this is normal too), we could give our body what it needs, and double in functionality, mood etc.   \n\n\nThe point I'm trying to make is that perhaps looking at the other ways our body is *under* performing - and don't forget our brain is part of that - can be markers of how possessed we still are by something that we no longer want to be at the mercy of. That being afraid to even consume what drives our body because we're driven instead by a likely ~~irrational~~ fear of any meaningful weight gain means that we neglect all the other way we could be - WANT to be - 'healthy'. Sometimes, I try to remind myself that before I was officially diagnosed, I had many problematic thoughts and behaviours that led me here, and perhaps this is now an opportunity to properly recalibrate and learn about all the ways that nourishing my body empowers me with choice that I never previously had before. That being in control of that relationship can actually afford me a better *perception* of myself as much as an improved tangible relationship to food and exercise that have otherwise becomes tool of self-destruction. Otherwise, I don't think you or I would be on this forum looking for pathways to resist this, if we didn't believe that we had something worthy of resisting!   \n\n\nHere if you want to chat, and keep up the good fight for all the ways you deserve wellbeing!",
          "created_utc": 1634852933.0
        }
      ]
    },
    {
      "id": "hhjdzn3",
      "author": "yourfavrocketship",
      "body": "How long would you say this took, if you don’t mind me asking?",
      "created_utc": 1634849612.0,
      "score": 1,
      "context": [
        {
          "id": "hhj3b66",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1634845355.0
        }
      ]
    }
  ]
}