{
  "id": "qhpg5i",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1635434606.0,
  "title": "Here is your reminder that you don’t need to be underweight for your eating disorder to be valid",
  "selftext": "The latest trend, for lack of a better work, I’ve been seeing lately is being a “nOrMaL/hEaLtHy” weight and therefore less deserving of recovery, especially when it comes to eating.\n\nEating disorders are *mental disorders*, the body and therefore it’s weight is not something that specifically defines an eating disorder. Did you know that only 6% of those diagnosed with eating disorders are clinically underweight? That means the other 94%—you know, the vast, **vast** fucking majority—struggle with an “atypical” eating disorder due to their weight, despite suffering from the very same consequences of malnutrition. You are sick enough. *You are sick enough.* **You are sick enough.** ***YOU ARE SICK ENOUGH***. And you deserve to nourish yourself and to eat.\n\nAnd let me be perfectly clear: I don’t give a flying fuck what your weight is, *if you are restricting, especially for extended periods, you need to eat and you need to eat a fucking lot.* point blank, period, end of story. And if anyone tells you otherwise, I will personally square up with them (not really, I’m a baby, but I will support you emotionally because fuck them).\n\nObviously this isn’t a “shut up and eat” post, because never is it ever that simple. This isn’t a post encouraging you to recover (there are countless posts already doing that here). But sometimes we need the validation and reassurance that we are sick enough, and we *do* deserve to eat just as much as anyone else even if we don’t fit into the “typical” definition of eating disorders.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/qhpg5i/here_is_your_reminder_that_you_dont_need_to_be/",
  "score": 107,
  "num_comments": 10,
  "comments": [
    {
      "id": "hiefp0o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1635439658.0,
      "score": 24,
      "context": []
    },
    {
      "id": "hiegsqs",
      "author": "moripeji",
      "body": "Thank you so much for posting this-- I REALLY needed this reminder today. Was feeling super terrible about myself after this morning's weigh-in/ meeting with my dietician. I started recovery about a month ago only a few lbs away from \"healthy,\" and in just one month I've gone well into the \"healthy\" range-- but still no end in sight for my refeeding/ weight restoration plan until my body decides to give me a period back. I feel guilty for gaining more weight and eating so much all the time when I'm \"healthy,\" so I cannot thank you enough for this reminder T\\_T",
      "created_utc": 1635440083.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hienk2j",
      "author": "lilyskins",
      "body": "Yes!! all the “but I’m normal/healthyyyy” stuff has made me see how mentally clouded I was bc that train of thought prolonged my recovery from starting and allowed me to actually get worse than ever. Ur ED is an ugly little liar and you are not special or different from anyone else with an ED. You know deep down your disorder just wants you to make excuses for it’s continued existence! it’s never too early to recover!",
      "created_utc": 1635442704.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hifguod",
      "author": "Discalced-diapason",
      "body": "My most medically unstable due to the ED was at the arbitrary “normal/overweight” point on the useless BMI scale. I’ve been what’s considered to be underweight before, and while I had some health issues there, the worst cardiac and hemotological consequences happened when I was at a “healthy” weight. \n\nEven without the physical health stuff going on, the agony of living a day to day life consumed with food, behaviors, and the depression and anxiety that comes along with it was so miserable. And I didn’t need my body to be at a particular weight or size to suddenly become “deserving” of recovery. Because, the truth is, we all are deserving of recovery, regardless and without reservations. You are deserving of living a life free from an eating disorder today, at this moment.",
      "created_utc": 1635454301.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hifwo5d",
      "author": "hellhellhellhell",
      "body": "Tell that to my insurance.",
      "created_utc": 1635461152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hifau3u",
      "author": "animalcrossingluvr09",
      "body": "This is an AMAZING post. It should be pinned to the top of this subreddit tbh",
      "created_utc": 1635451888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hiezm2i",
      "author": "ForestRagamuffin",
      "body": "thank you, i reeeeally needed this today 💚",
      "created_utc": 1635447406.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hieoju1",
      "author": "IamNotABaldEagle",
      "body": "I feel exactly the same! It's ridiculous but I feel I have to instantly stop getting help as soon as my weight gets into the 'healthy' range or my period returns. It's a stupid cycle because I need to gain weight for my brain to work properly to actually tackle the mental side of the ED but I feel like I can't gain too much weight or I won't be considered sick any more so won't be deserving of help for the actual mental problem.",
      "created_utc": 1635443084.0,
      "score": 6,
      "context": [
        {
          "id": "hiefp0o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635439658.0
        }
      ]
    },
    {
      "id": "hieh7rg",
      "author": "woolooooooooo",
      "body": "I feel you, this is how I am too. 😭 I haven’t been able to address the underlying trauma that my ED stems from though so it makes sense",
      "created_utc": 1635440242.0,
      "score": 5,
      "context": [
        {
          "id": "hiefp0o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635439658.0
        }
      ]
    },
    {
      "id": "hievdov",
      "author": "Sareeee48",
      "body": "Totally understandable. Just because you know this doesn’t mean you currently have the resources/skills to stop it all and that’s okay!",
      "created_utc": 1635445737.0,
      "score": 4,
      "context": [
        {
          "id": "hiefp0o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1635439658.0
        }
      ]
    },
    {
      "id": "hifxnt1",
      "author": "hellhellhellhell",
      "body": "Same. I was so much closer to death when I was slightly overweight and bulimic than when I was moderately to severely underweight and considered AN b/p. I was relatively high functioning at my LW, but at my HW my behaviors were so out of control I couldn't perform basic life functions. Yet, I was considered a lower priority case at my ED worst just because of my weight. The behaviors I had when I had an AN b/p diagnosis and a BN diagnosis were the same but when I was considered BN the behaviors were 100x worse, yet only when I had AN b/p was I considered urgent enough to get ED treatment coverage from my insurance.",
      "created_utc": 1635461605.0,
      "score": 3,
      "context": [
        {
          "id": "hifguod",
          "author": "Discalced-diapason",
          "body": "My most medically unstable due to the ED was at the arbitrary “normal/overweight” point on the useless BMI scale. I’ve been what’s considered to be underweight before, and while I had some health issues there, the worst cardiac and hemotological consequences happened when I was at a “healthy” weight. \n\nEven without the physical health stuff going on, the agony of living a day to day life consumed with food, behaviors, and the depression and anxiety that comes along with it was so miserable. And I didn’t need my body to be at a particular weight or size to suddenly become “deserving” of recovery. Because, the truth is, we all are deserving of recovery, regardless and without reservations. You are deserving of living a life free from an eating disorder today, at this moment.",
          "created_utc": 1635454301.0
        }
      ]
    }
  ]
}