{
  "id": "qrvai6",
  "subreddit": "fuckeatingdisorders",
  "author": "tkdaw",
  "created_utc": 1636665489.0,
  "title": "What I've learned about extreme hunger",
  "selftext": "I've cycled through ED-recovery-lapse-relapse-lapse-quasi-lapse-relapse\\[...\\] (I'll be 23 in a week and started this bullshit when I was 20).\n\nNote: I know there are different EDs (BED, bulimia, etc.) but I really only have experience with restrictive ED so...sorry. I can't write to everyone's experiences, only my own.\n\nThere's a LOT of panic in this sub about extreme hunger, and it's been a while since anyone's bumped a post about what it's like when you're NOT experiencing extreme hunger, so I figured I'd attempt one. Please call me out if I say stuff that isn't helpful for people in early recovery and I'll edit ASAP.\n\nAlso, if you have weird cardiac symptoms, REGARDLESS of level of restriction, PLEASE seek medical attention if you can.  \n\nThat being said, here's what I've learned/experienced/would advise:\n\n1. Stay the FUCK away from IG/TikTok \"extreme hunger\" or \"What I eat in a day - ED recovery\" posts. You don't know if they're still restricting (they probably are), how far into recovery they are (I seriously doubt anyone documents their first 2-3 days of extreme hunger on social media because you're too busy with the insane feeding frenzy that is extreme hunger). If you're panicked about how much you're eating, comment and we can talk through it. (If you've gone through extreme hunger and you want to also offer to support, feel free to do so in the comments!)\n2. DO NOT COMPENSATE. None of this \"okay that was fun but since I CLEARLY ate \\[amount\\] over \\[allowed amount\\], tomorrow needs to be more reasonable!\" Whatever you ate *today* is whatever you ate *today*. Tomorrow is a new day. If you're still hungry, EAT. If you're not hungry, stick to 3 meals and add a snack or two. Stay hydrated but don't water-load (this does bad stuff to your electrolytes in addition to just being miserable). \n3. Don't fight it. Seriously, loading up on, idk, iceberg lettuce or whatever \"diet hacks\" you've heard is really just setting you up to be simultaneously STILL REALLY HUNGRY and also full of...lettuce. See \"water-loading,\" because really, that's what veggie-loading is.\n4. It's okay if you literally find yourself just wanting high-carb, processed foods like yknow...PopTarts. They're quick energy. Your body wants (and needs!) quick energy. Don't try to \"slow-carb-Peak-Nutrition\" your way through extreme hunger. \n5. DO NOT WEIGH YOURSELF THE DAY (OR WEEK) AFTER IT SETS IN (OR HELL, AT ALL). DO NOT. DO NOT. DO NOT. It is ALL water and food weight. (Eventually, your brain might reset to realize that gaining weight is actually the better alternative to endless physical/psychological suffering and/or death, but for now, I'll just tell you - REAL weight gain takes TIME. A LOT OF TIME. Mathematically and physiologically, you need a LOT of extra food over a substantial period of time.) \n6. Don't set a time limit. Ideally, free-eating will be your LIFE, not just X days/weeks \"while I'm recovering.\" Extreme hunger won't last forever, but freedom with food is the *goal.* \n7. It's okay to enjoy food. It's okay to enjoy eating. It's okay to enjoy giving yourself freedom to eat unrestrictedly for the first time in however long it's been. It's okay. You have not somehow failed, you are not somehow lesser. You're killing it. \n8. ...don't try to safe-food your way through extreme hunger. please. it's miserable and I'm experiencing second-hand misery just thinking about it. Get some goddamn Nutella, REAL ice cream (none of that Halo Top bullshit), cook pasta and rice instead of shirataki noodles and cauliflower, eat the egg yolk. Get a cookie (or several!) without the protein content as the main attraction, get a Starbucks drink that makes your ED tremble in fear. Conquer the weeds and the gremlins because make no mistake, they want nothing more than for you to continue suffering. \n9. Food is energy. That doesn't mean you will feel energized. I'm sorry but your body is TIRED. Even if you didn't realize it beforehand, restriction is EXHAUSTING and if you find yourself literally ONLY eating and sleeping, that's normal.\n10. You don't get a say in when it ends, and the more you fight it, the longer it will take. If you can listen to your body through extreme hunger and recovery, you get your life back. It'll be worth every minute, but you just gotta stick it out. \n\nAlso, here's a sample of *one* of my days with extreme hunger, for anyone curious:\n\n* Entire large pizza (16-18\")\n* order of mozzarella sticks (8)\n* 9-12 poptarts\n* 1-2 pints of ice cream\n* ice cream sandwich\n* 3-4 nut butter sandwiches\n* 2-3 sleeves of saltines\n* 2 protein shakes\n* cereal\n* 1-2 apples\n* tiramisu\n* steak sandwich\n* probably more things that I'm forgetting because this seems too little for extreme hunger\n\n...and I was still hungry the next day, so I ate. There were no \"protein oatmeal bowls\" or \"green smoothies\" involved. I wanted some *fucking calories* on an order of magnitude that  spinach was *not* going to deliver, and so I *fucking got some calories*.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/qrvai6/what_ive_learned_about_extreme_hunger/",
  "score": 517,
  "num_comments": 77,
  "comments": [
    {
      "id": "hk941ka",
      "author": "eggyeoh",
      "body": "love this post so much! I'm 3.5 weeks into recovery and extreme hunger was so extremely terrifying for me when it first started. also I thought eating more would give me energy but I was just napping all the time and thought something was seriously wrong with me lol so this is really reaffirming. thank you!",
      "created_utc": 1636666147.0,
      "score": 89,
      "context": []
    },
    {
      "id": "hk9lp9k",
      "author": "fishonthesun",
      "body": "I love this so much. Like... Finally, someone whose extreme hunger resonates with me. I've seen people say that it's an excuse to binge and it would make me feel so awful. But, can it even be a binge if you are still hungry? I've mentioned this before but I was eating probably triple my TDEE if I was exercising, but I wasn't exercising. And it took 2 months of that before I gained a single (real) pound. My body had a lot of repairing to do! On a different ED sub someone said that \"don't restrict yourself\" just means \"don't eat a very low amount of calories, not eat whatever you want whenever you want\" specifically in ED recovery. And that's just bullshit. If I'm so hungry my stomach feels like a hollow empty pit, and I say \"nope gotta stick to my meal plan of >reasonable calories for someone not recovering from a restrictive eating disorder< or else it's binging!\" That would just be denial. That *would* be restricting. Idk. I never fully let my extreme hunger and my body repairing run its course, so my body never fully recovered. And I did that because I was still so scared of not being fully in control, of binging, and people online made me think I was binging. \n\nSo anyways, thank you again for this post. When I'm financially able to afford eating as much as needed and fully recovering, I'll remember this ❤️",
      "created_utc": 1636673854.0,
      "score": 60,
      "context": []
    },
    {
      "id": "hkc655r",
      "author": "MooneBoy",
      "body": "Tik tok \"extreme hunger\" is like... Maybe am extra apple during the day\n\nLike ???? Bitch shut up\n\nExtreme hunger for me was a BOX of chocolate granola with whole milk & like 4 nutella sandwiches, and that was just breakfast part 1\n\nHonestly I dont even remember a lot of my EH meals because i just blanked and ate\n\nIts physically and mentally upsetting, uncomfortable and sometimes disturbing honestly, but you'll be so glad you allowed it once its gone",
      "created_utc": 1636728593.0,
      "score": 54,
      "context": []
    },
    {
      "id": "hk9lxnc",
      "author": "Sareeee48",
      "body": "This is an awesome post! The only thing I would add is that it is normal for even no disordered individuals to experience hunger every few hours it is totally normal, and even once extreme hunger dissipates it’s still important to make sure you’re eating frequently.\n\nFor me, a day of EH looked like this in order:\n\n•Coffee with a lotttt of coffee creamer\n\n•2 Starbucks breakfast sandwiches with a lotta mayo \n\n•Two poptarts\n\n•Oatmeal with whole milk or heavy cream, a banana, and a shit ton of butter\n\n•3 bowls of cereal\n\n•Two slices of toast with more butter and jelly\n\n•Cheese cubes\n\n•Half a family sized bag of pretzels\n\n•A bowl of yogurt with high carb fruit, granola and soooo much honey\n\n•3 fat peanut butter sandwiches with a tall glass of whole milk\n\n•A Wendy’s 4 for 4 (sandwich, nuggets, fries and unreasonably sweet lemonade)\n\n•A spoonful of peanut butter every hour or so\n\n•Hot chocolate made out of heavy cream\n\n•A whole pack of those mini hostess donuts\n\n•A sleeve of Oreos\n\n•A sleeve of Ritz crackers\n\n•Two huge bowls of spaghetti\n\nAnd then I’d wake up and snack at night. Lol",
      "created_utc": 1636673963.0,
      "score": 80,
      "context": []
    },
    {
      "id": "hkd1xir",
      "author": "messythelioma",
      "body": "I'm actually crying, because so often I see \"WIEIAD - Extreme Hunger Edition\" and it's literally nothing compared to what I eat. Seeing your post look similar to the amount that I eat has really helped reassure me that extreme hunger looks different for people.",
      "created_utc": 1636741630.0,
      "score": 29,
      "context": []
    },
    {
      "id": "hk94dcb",
      "author": "AnArticulateCrab",
      "body": "Really needed this. You have no idea how important this post is. Thank you thank you thank you!",
      "created_utc": 1636666286.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hn05vqz",
      "author": "Goth_Lizard",
      "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
      "created_utc": 1638491339.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hxdshma",
      "author": "ryvnosuke",
      "body": "You have no *fucking* idea how much I love you (/p). Going through recovery ig/TikTok posts about what they eat in a day is genuinely the worst recovery decision I have ever made, I haven't been able to honour my extreme hunger at all. Thank you for being so honest.",
      "created_utc": 1645144192.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hkb202y",
      "author": "LivingZesty",
      "body": "I kinda try to relate it to puberty; both processes require “extreme” amounts of energy in order to make physical developments. Just as it is normal for someone going through puberty to experience increased appetite and desire to eat, someone recovering from a restrictive eating disorder should expect and (as tough as it may be) act on the impulse to eat. It is not “bingeing” or “unhealthy” in the same way that it is not “bingeing” or “unhealthy” for anyone to respond to hunger cues by eating. \n\nAnd yes, I think most of us can agree that the best advice is to just eat whatever you want. One of my struggles is just feeling hungry at random times and really not knowing what to eat; fortunately it really doesn’t matter, so long as you continue to eat to physical and mental satisfaction!",
      "created_utc": 1636701123.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hk9cytl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636669921.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hk9en0e",
      "author": "Arabella-Verne",
      "body": "This is so important, it's really difficult to conceptualize extreme hunger and I think you explained perfectly. I remember how hard it was to see me eating this and that amount and feeling like the hunger never went away.",
      "created_utc": 1636670644.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hy56nib",
      "author": "mirjam98",
      "body": "I feel like everyone is saying that their extreme hunger started out bad and got gradually better. I feel like for me it's the exact opposite, the more I eat and gain weight the worse it gets. At this point I'm eating insane amounts and still can't feel full. I've already passed the healthy BMI range but there is no sign of it getting better. The ed thoughts are so strong and I'm constantly trying figure if I'm doing something wrong.",
      "created_utc": 1645647207.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hl6o401",
      "author": "inflammatoryessays",
      "body": "thank you for this post. im really struggling right now because i \"only\" restricted this time around for about 2-3 months before getting back on track but... god this hunger is worse than ive ever experienced before, and it's hard not to feel like a fraud or like im \"secretly\" using this as an excuse to eat. but no matter what i eat, i dont feel mentally full! my list is looking a lot like yours and ive gained almost 20 pounds in water/food/bloat in the past 2 weeks, which has scared the everliving fuck out of me. thank you i really needed the reminder that im not alone in this",
      "created_utc": 1637277777.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hkcn124",
      "author": "thingsivegottenridof",
      "body": "Another candidate for sticky-ing, honestly. So many seem terrified of this phenomenon before they’re finally told it’s a normal, natural progression of our disorders.",
      "created_utc": 1636735591.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hk9u9o1",
      "author": "emptyhellebore",
      "body": "Thanks for this.",
      "created_utc": 1636678104.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iwoiu7m",
      "author": "Same-Owl-5811",
      "body": "i know you wrote this a year ago but thank you so much for this post. ive had an ED since i was 14 (18 now) recovered during the pandemic, then went right back to old habits, and im now recovering (or trying) and its the scariest its ever been. pandemic was easy cause i didnt see anyone, but now i see my bf everyday and hes very thin and eats way less than me and the extreme hunger is terrifying. i feel like im doing everything wrong, but this post helped so much and makes me feel so much less alone. thank you so much. fuck eating disorders",
      "created_utc": 1668657592.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hkatkba",
      "author": "moripeji",
      "body": "Thank you so much for posting this... I literally just made a post on the panic you describe (I am... sorry... LOL) at finally having actual physical extreme hunger kick in (after 2 full months of all-in recovery, so the delay/ panic was real), and having what you ate on a typical EH day as an example really, REALLY helped me to alleviate some of the pressure and guilt I was feeling about how much/ how often I've been eating. I know we're all different with different needs etc, but this seriously helped.  \n\n\nIf you don't mind me asking, did this kinda EH \"menu\" continue after you hit the \"healthy weight\" (BS) marker, too? I think that's my biggest mental hurdle to get over in terms of just totally giving into the extreme hunger. That damned BMI marker is getting to me and convincing me I should noooot be eating this much. Ty for posting!!!",
      "created_utc": 1636695369.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jab9n6n",
      "author": "LilythTempest",
      "body": "I know this is a year late, but I just wanted to thank you for this post. I had been seriously struggling with recovery for months. Everytime I tried to recover, I would relapse and become even more sick than before. I was unaware of the concept of extreme hunger before seeing this post, but after learning about it, it truly changed my life. Your post motivated me to start recovery again a few months ago, and I've been honoring my extreme hunger ever since. Thank you so much for your positivity. You're an inspiration and I wish you all the best!",
      "created_utc": 1677558646.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hkbcogk",
      "author": "OhCrumbs96",
      "body": "This entire post and everyone's comments are just amazing. I've definitely fallen off track a little bit recently and this has given me the kick I needed to get back to more recovery-oriented decisions. Thank you all so much for sharing your EH experiences 💜",
      "created_utc": 1636710126.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkbp9w5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1636719951.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkd2u4v",
      "author": "pabstpumpkinbeer",
      "body": "You are amazing. I'm well past the extreme hunger stage THANK FUCK but this is a great reminder for the folks here going through it. Thank you for taking the time to write it out.",
      "created_utc": 1636742011.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k45rrnv",
      "author": "Direct-Bug-8081",
      "body": "still helping people two years later with this post\n\nive been obsessively scrolling through reddit and if im honest with myself, trying to find a reason not to honour my hunger.\n\nthere are so many people on this site who \"disagree\" with extreme hunger and say its an excuse to binge, explaining that it \"didn't work for them\". \n\nthis is the post i needed to pull myself back uo and out of the depths of anorexia.\n\nthankyou friend\n\ni hope your recovery is going well <3",
      "created_utc": 1696873826.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hqv0vp2",
      "author": "ificouldbeonething",
      "body": "Saving this post! I feel like mine is lasting forever, like longer than it “should” even though there is no “should” so I had to find some reassurance. Thank you!",
      "created_utc": 1641077334.0,
      "score": 4,
      "context": []
    },
    {
      "id": "im8up42",
      "author": "Fuck-being-Alive",
      "body": "I know this post is real old and that you(op) probably won't see my comment, but if heaven was real you’d be in it. This post helped me so much no one ever told me extreme hunger was a thing",
      "created_utc": 1661774264.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkad5z7",
      "author": "fifteen-eggs",
      "body": "This post has been deleted.",
      "created_utc": 1636686907.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hmrwv4q",
      "author": "Embarrassed_Stop_647",
      "body": "I found this just when I needed it thanks!",
      "created_utc": 1638347776.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iyt3har",
      "author": "fernCWM",
      "body": "I've been struggling with anorexia since I was 10/11. I'm now 24, and just beginning to make a real attempt at self-recovery (don't currently have access to professional help). Experiencing extreme hunger for the first time in over a decade is TERRIFYING. This post helps so much. Thank you, thank you, thank you. This gives me hope. I often feel as though because I've been at a very low weight and restricting without any type of binging or extreme hunger for 10+ years, it's \"too late\" to recover and my body is \"too broken.\" I am trying to push through, but this is terrifying.\n\n\\*I am aware of the risks of refeeding syndrome after a period of very low restriction; I did get my labs checked and am currently on phosphorus supplements for this.",
      "created_utc": 1670109283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j9vunfv",
      "author": "BenjitheHerd",
      "body": "Love this so much, thank you for it! Has anyone dealt with this while weight restored? Just curious as to your experiences. Thanks for your time!",
      "created_utc": 1677278654.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iyo46zt",
      "author": "None",
      "body": "Also it’s completely normal and necessary to gain weight and EH has made me gain weight these last 2 months but my body needs to repair a lot of damage I caused so EMBRACE the weight gain even though it is scary and all you want to do is cry. I keep going because I noticed EH does go away slowly when you just let your body trust you again. It’s amazing how my mind doesn’t think of food all the time anymore it’s like I’m actually becoming my actual self again 😭",
      "created_utc": 1670015017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "krje5r2",
      "author": "iheartm4rina",
      "body": "is mental hunger (constantly thinking ab food, planning meals, wanting to eat, etc) considered extreme hunger even if I'm not physically hungry?",
      "created_utc": 1708563275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuwnw72",
      "author": "SufficientDate8562",
      "body": "Hello, it’s been a while since you wrote this but I am currently going through extreme hunger. I want to know what will happen afterwards or how will I know when extreme hunger is over? I guess part of me is freaking out thinking it will never end but I know it will. I’m just wondering what is like after it.",
      "created_utc": 1710455823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktslxf1",
      "author": "None",
      "body": "I'm recovering from anorexia and orthorexia and I just hit this stage over the past couple of days. I really needed this post. It's scary, but I gotta remind myself I'll feel better physically and mentally because otherwise I'm constantly starving, have brain fog, eat but don't feel satisfied or full, and am constantly thinking about nothing else but the next meal in between.",
      "created_utc": 1709833042.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky0jpdx",
      "author": "Ok-Maximum2228",
      "body": "A month in and it’s hitting me like crazy… I’m so nervous but still trying to trust the process.",
      "created_utc": 1712239838.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3ldwss",
      "author": "wongdong77",
      "body": "I honestly don’t know what to do. Im on my first week of recovery and I have a lot of cravings for junk food and I think Im supposed to give in, so I do. But then afterwards, I feel like shit. So it’s really hard not to restrict right after to make the full feeling go away. It stresses me out when I eat, so then I eat more to try and calm it. I don’t know how to identify when Im hungry and when Im full. I can’t keep living like this. I just want to eat normally and live a happy life! How long is it going to take!",
      "created_utc": 1715445613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4rqt3y",
      "author": "ram_with_crown",
      "body": "I know this was two years ago, but I fucking love you. Holy shit.",
      "created_utc": 1716144376.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq498y6",
      "author": "cilly111",
      "body": "Im going through this right now, thank you sm<3",
      "created_utc": 1727953189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq74m7p",
      "author": "Clear_Record7951",
      "body": "What if im no longer in my extteme hunger but j still eat alot? What if I never stop eating like that? I constantly get these questions when I try and eat and, though I eat anyways - it’s like my body won’t let me restrict anymore, I feel dats and I dread the day my extreme hunger atops and I realise I can’t stop eating so much biscuits and crackers with nutella. What do i do? There’s more to say but I’ll mention later if needed",
      "created_utc": 1727988509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxlex60",
      "author": "Agitated-Control-300",
      "body": "Okay the real question is how do I not feel like shit while going through extreme hunger? My stomach hurts sooo bad",
      "created_utc": 1731852896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0ycq86",
      "author": "exvelyn",
      "body": "thank you so much for this post. genuinely. ive been feeling SO guilty for the past week for my EXTREME hunger ever since ive tried to stop restricting. i keep thinking i have gotten bigne eating disorder or something because i find myself eating SO much in one sitting and STILL never being satiated. i tried limiting it to try and 'control'myself from 'binging'. its so hard recovering, i eat 2-3x my tdee and i feel tired all the damn time. I've only recently started my recovery and i feel guilty everytime i eat, thinking something is wrong with me. yesterday i ate a pint of ice cream, 2 big plates of alfredo pasta, a family size bag of dorities, a big ass bowl of fruit salad and pita bread with hummus in one sitting and i still felt hungry. i also felt tired as hell too even though im eating alot and i was worried i had some problem or something but hey good to know its normal but im still suffering from feeling guilty for my extreme hunger😭 wishing everyone recovering from their ed goodluck🙏",
      "created_utc": 1733616732.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ihkapp3",
      "author": "None",
      "body": "i’m so scared",
      "created_utc": 1658747312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0gwsa9",
      "author": "Miserable_Thought933",
      "body": "Am eating what I want when I want but I mainly just eat chocolates biscuits ice creams lots and lots of these food every day and I feel like a bus has ran me over my legs are aching so so much I hate this",
      "created_utc": 1694643236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k1ekpaq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1695211151.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k2ibako",
      "author": "Busy_Relationship911",
      "body": "Please help me, this hunger is so scary.",
      "created_utc": 1695859782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kp6fng8",
      "author": "LivingLengthiness150",
      "body": "Should i keep working out during this time?",
      "created_utc": 1707228457.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kp8ah5s",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1707251839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ioqsinx",
      "author": "None",
      "body": "hey i am 3 weeks into recovery right now...and i have hadonly 1 night of extreme hunger the rest of my days i am SO STUFFED AND PREGNANT LOOKING\nwill i ever get the extreme hunger? I feel like shit all day from eating so much and i WISH i had extreme hunger",
      "created_utc": 1663378755.0,
      "score": 3,
      "context": [
        {
          "id": "hk941ka",
          "author": "eggyeoh",
          "body": "love this post so much! I'm 3.5 weeks into recovery and extreme hunger was so extremely terrifying for me when it first started. also I thought eating more would give me energy but I was just napping all the time and thought something was seriously wrong with me lol so this is really reaffirming. thank you!",
          "created_utc": 1636666147.0
        }
      ]
    },
    {
      "id": "hk9pqs7",
      "author": "tkdaw",
      "body": "Bingeing is a mindset. Eating because you're hungry is not a binge. \n\nAren't meal plans a minimum? Do they legitimately tell you not to exceed them? Cuz that sounds like BS to me.",
      "created_utc": 1636675979.0,
      "score": 33,
      "context": [
        {
          "id": "hk9lp9k",
          "author": "fishonthesun",
          "body": "I love this so much. Like... Finally, someone whose extreme hunger resonates with me. I've seen people say that it's an excuse to binge and it would make me feel so awful. But, can it even be a binge if you are still hungry? I've mentioned this before but I was eating probably triple my TDEE if I was exercising, but I wasn't exercising. And it took 2 months of that before I gained a single (real) pound. My body had a lot of repairing to do! On a different ED sub someone said that \"don't restrict yourself\" just means \"don't eat a very low amount of calories, not eat whatever you want whenever you want\" specifically in ED recovery. And that's just bullshit. If I'm so hungry my stomach feels like a hollow empty pit, and I say \"nope gotta stick to my meal plan of >reasonable calories for someone not recovering from a restrictive eating disorder< or else it's binging!\" That would just be denial. That *would* be restricting. Idk. I never fully let my extreme hunger and my body repairing run its course, so my body never fully recovered. And I did that because I was still so scared of not being fully in control, of binging, and people online made me think I was binging. \n\nSo anyways, thank you again for this post. When I'm financially able to afford eating as much as needed and fully recovering, I'll remember this ❤️",
          "created_utc": 1636673854.0
        }
      ]
    },
    {
      "id": "hkc7cxm",
      "author": "tkdaw",
      "body": "Yea extreme hunger tiktok is like wow I put an extra strawberry on my single-serve yogurt cup and made mini pitas for lunch. \n\n...if you're eating mini-ANYTHING, it's not \"extreme.\"",
      "created_utc": 1636729120.0,
      "score": 25,
      "context": [
        {
          "id": "hkc655r",
          "author": "MooneBoy",
          "body": "Tik tok \"extreme hunger\" is like... Maybe am extra apple during the day\n\nLike ???? Bitch shut up\n\nExtreme hunger for me was a BOX of chocolate granola with whole milk & like 4 nutella sandwiches, and that was just breakfast part 1\n\nHonestly I dont even remember a lot of my EH meals because i just blanked and ate\n\nIts physically and mentally upsetting, uncomfortable and sometimes disturbing honestly, but you'll be so glad you allowed it once its gone",
          "created_utc": 1636728593.0
        }
      ]
    },
    {
      "id": "hk9mw3h",
      "author": "tkdaw",
      "body": "Yes good point! Recovery and no longer having extreme hunger does *not* mean you no longer need to eat...lol we need to eat regularly no matter what.",
      "created_utc": 1636674438.0,
      "score": 25,
      "context": [
        {
          "id": "hk9lxnc",
          "author": "Sareeee48",
          "body": "This is an awesome post! The only thing I would add is that it is normal for even no disordered individuals to experience hunger every few hours it is totally normal, and even once extreme hunger dissipates it’s still important to make sure you’re eating frequently.\n\nFor me, a day of EH looked like this in order:\n\n•Coffee with a lotttt of coffee creamer\n\n•2 Starbucks breakfast sandwiches with a lotta mayo \n\n•Two poptarts\n\n•Oatmeal with whole milk or heavy cream, a banana, and a shit ton of butter\n\n•3 bowls of cereal\n\n•Two slices of toast with more butter and jelly\n\n•Cheese cubes\n\n•Half a family sized bag of pretzels\n\n•A bowl of yogurt with high carb fruit, granola and soooo much honey\n\n•3 fat peanut butter sandwiches with a tall glass of whole milk\n\n•A Wendy’s 4 for 4 (sandwich, nuggets, fries and unreasonably sweet lemonade)\n\n•A spoonful of peanut butter every hour or so\n\n•Hot chocolate made out of heavy cream\n\n•A whole pack of those mini hostess donuts\n\n•A sleeve of Oreos\n\n•A sleeve of Ritz crackers\n\n•Two huge bowls of spaghetti\n\nAnd then I’d wake up and snack at night. Lol",
          "created_utc": 1636673963.0
        }
      ]
    },
    {
      "id": "i50cxf0",
      "author": "None",
      "body": "thank you so much for posting this, i keep seeing WIEIAD on tiktok for extreme hunger and the amount of food is just like, eh. like it may be extreme hunger for them but idk",
      "created_utc": 1650147074.0,
      "score": 8,
      "context": [
        {
          "id": "hk9lxnc",
          "author": "Sareeee48",
          "body": "This is an awesome post! The only thing I would add is that it is normal for even no disordered individuals to experience hunger every few hours it is totally normal, and even once extreme hunger dissipates it’s still important to make sure you’re eating frequently.\n\nFor me, a day of EH looked like this in order:\n\n•Coffee with a lotttt of coffee creamer\n\n•2 Starbucks breakfast sandwiches with a lotta mayo \n\n•Two poptarts\n\n•Oatmeal with whole milk or heavy cream, a banana, and a shit ton of butter\n\n•3 bowls of cereal\n\n•Two slices of toast with more butter and jelly\n\n•Cheese cubes\n\n•Half a family sized bag of pretzels\n\n•A bowl of yogurt with high carb fruit, granola and soooo much honey\n\n•3 fat peanut butter sandwiches with a tall glass of whole milk\n\n•A Wendy’s 4 for 4 (sandwich, nuggets, fries and unreasonably sweet lemonade)\n\n•A spoonful of peanut butter every hour or so\n\n•Hot chocolate made out of heavy cream\n\n•A whole pack of those mini hostess donuts\n\n•A sleeve of Oreos\n\n•A sleeve of Ritz crackers\n\n•Two huge bowls of spaghetti\n\nAnd then I’d wake up and snack at night. Lol",
          "created_utc": 1636673963.0
        }
      ]
    },
    {
      "id": "hkd2e4x",
      "author": "tkdaw",
      "body": "EDs are competitive, so I suspect a lot of \"extreme hunger recovery\" videos are neither EH nor recovery. They're still-disordered individuals trying to capitalize on the social media trend of \"recovery uwu\" without actually going through the grueling process of recovery.",
      "created_utc": 1636741824.0,
      "score": 18,
      "context": [
        {
          "id": "hkd1xir",
          "author": "messythelioma",
          "body": "I'm actually crying, because so often I see \"WIEIAD - Extreme Hunger Edition\" and it's literally nothing compared to what I eat. Seeing your post look similar to the amount that I eat has really helped reassure me that extreme hunger looks different for people.",
          "created_utc": 1636741630.0
        }
      ]
    },
    {
      "id": "hn0912p",
      "author": "tkdaw",
      "body": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.",
      "created_utc": 1638492774.0,
      "score": 13,
      "context": [
        {
          "id": "hn05vqz",
          "author": "Goth_Lizard",
          "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
          "created_utc": 1638491339.0
        }
      ]
    },
    {
      "id": "hxdtahg",
      "author": "tkdaw",
      "body": "Extreme hunger is literally \"body wants as many calories as it can process as quickly as it can process them.\" The less you resist, the better.",
      "created_utc": 1645144548.0,
      "score": 13,
      "context": [
        {
          "id": "hxdshma",
          "author": "ryvnosuke",
          "body": "You have no *fucking* idea how much I love you (/p). Going through recovery ig/TikTok posts about what they eat in a day is genuinely the worst recovery decision I have ever made, I haven't been able to honour my extreme hunger at all. Thank you for being so honest.",
          "created_utc": 1645144192.0
        }
      ]
    },
    {
      "id": "hk9dvdh",
      "author": "tkdaw",
      "body": "Self-talk. Come up with mantras and reminders of why you want to recover. Some of mine: \n\n\"The only way out is through.\"\n\n\"Fuck the gremlins, we do not claim them as our own.\" \n\n\"No food will hurt you like starvation did.\" \n\n\"I'm done with my bullshit, even if it isn't done with me.\"",
      "created_utc": 1636670317.0,
      "score": 38,
      "context": [
        {
          "id": "hk9cytl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636669921.0
        }
      ]
    },
    {
      "id": "hk9vyk9",
      "author": "squareCat99",
      "body": "Totally agree with OP on the self talk - another thing is to just know that it might be really hard, but that it’s normal and you’ll get through it.  \n\nI would literally be slumped on the counter sobbing in a panic attack, or laying on the kitchen floor on my back hyperventilating because I was absolutely starving and so terrified of eating at the same time.  \n\nSo I cried and hyperventilated and did deep breathing and then got up and finished making food and ate it, because the only way to get used to eating again is to do it.  But for me at least, every time I did it, it got a little easier.",
      "created_utc": 1636678891.0,
      "score": 18,
      "context": [
        {
          "id": "hk9cytl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636669921.0
        }
      ]
    },
    {
      "id": "hkc5uay",
      "author": "None",
      "body": "I like to tell myself that whatever I’m eating will just go in and out— that it will pass through me like a brief warm breeze or a car going through a tunnel. Sometimes imagining that it’s really simple, unimportant, and temporary helps pull me out of that panic.",
      "created_utc": 1636728459.0,
      "score": 5,
      "context": [
        {
          "id": "hk9cytl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636669921.0
        }
      ]
    },
    {
      "id": "kfofnp4",
      "author": "Maximum-Flamingo-976",
      "body": "Hey I know this post was a long time ago now but I wonder if it ever got better? I am experiencing this now and it's scary AF!",
      "created_utc": 1704013485.0,
      "score": 4,
      "context": [
        {
          "id": "hy56nib",
          "author": "mirjam98",
          "body": "I feel like everyone is saying that their extreme hunger started out bad and got gradually better. I feel like for me it's the exact opposite, the more I eat and gain weight the worse it gets. At this point I'm eating insane amounts and still can't feel full. I've already passed the healthy BMI range but there is no sign of it getting better. The ed thoughts are so strong and I'm constantly trying figure if I'm doing something wrong.",
          "created_utc": 1645647207.0
        }
      ]
    },
    {
      "id": "k0gxglb",
      "author": "Miserable_Thought933",
      "body": "Am exactly the same",
      "created_utc": 1694643501.0,
      "score": 1,
      "context": [
        {
          "id": "hy56nib",
          "author": "mirjam98",
          "body": "I feel like everyone is saying that their extreme hunger started out bad and got gradually better. I feel like for me it's the exact opposite, the more I eat and gain weight the worse it gets. At this point I'm eating insane amounts and still can't feel full. I've already passed the healthy BMI range but there is no sign of it getting better. The ed thoughts are so strong and I'm constantly trying figure if I'm doing something wrong.",
          "created_utc": 1645647207.0
        }
      ]
    },
    {
      "id": "hkc0dyi",
      "author": "tkdaw",
      "body": "Without extreme hunger, I have no desire for that EH menu. At all. I'm also a distance runner, so my daily menu CAN be fairly intense if I need more fuel for running or recovering from running. But no, I don't want an entire large pizza with 2 pints of ice cream and a fuckton of pb sandwiches lol. I mostly just want pancakes and mashed potatoes and eggs and veggie burgers and sautéed veggies (because fuck that oil-free cooking BS). \n\n...and ice cream. I still eat ice cream LITERALLY every day.",
      "created_utc": 1636725942.0,
      "score": 8,
      "context": [
        {
          "id": "hkatkba",
          "author": "moripeji",
          "body": "Thank you so much for posting this... I literally just made a post on the panic you describe (I am... sorry... LOL) at finally having actual physical extreme hunger kick in (after 2 full months of all-in recovery, so the delay/ panic was real), and having what you ate on a typical EH day as an example really, REALLY helped me to alleviate some of the pressure and guilt I was feeling about how much/ how often I've been eating. I know we're all different with different needs etc, but this seriously helped.  \n\n\nIf you don't mind me asking, did this kinda EH \"menu\" continue after you hit the \"healthy weight\" (BS) marker, too? I think that's my biggest mental hurdle to get over in terms of just totally giving into the extreme hunger. That damned BMI marker is getting to me and convincing me I should noooot be eating this much. Ty for posting!!!",
          "created_utc": 1636695369.0
        }
      ]
    },
    {
      "id": "hkazrl1",
      "author": "None",
      "body": "My LW is/was right on the brink between UW and N. It's only the beginning but yesterday looked like:\n\n-oatmeal with a lot of PB\n\n-bagel with lots of PB and banana\n\n-yogurt with nuts, granola and berries\n\n-apple\n\n-cereal and nuts\n\n-couscous, veggies and a greasy burger cooked in oil\n\n-big bowl of cereal\n\n-half a pint of ben and jerry's\n\n-(at this point i couldn't sleep despite trying for 3 hours) 2 big bowls of cereal \n\n-(still couldn't sleep - it was past 4 am at this point and to my shock, i was starting to feel hungry) crackers with several spoonfuls of PB + more from the jar\n\nI woke up thinking about food again, like every single morning.\n\nEdit: I mean the beginning of EH. I haven't properly restricted in a year.",
      "created_utc": 1636699467.0,
      "score": 6,
      "context": [
        {
          "id": "hkatkba",
          "author": "moripeji",
          "body": "Thank you so much for posting this... I literally just made a post on the panic you describe (I am... sorry... LOL) at finally having actual physical extreme hunger kick in (after 2 full months of all-in recovery, so the delay/ panic was real), and having what you ate on a typical EH day as an example really, REALLY helped me to alleviate some of the pressure and guilt I was feeling about how much/ how often I've been eating. I know we're all different with different needs etc, but this seriously helped.  \n\n\nIf you don't mind me asking, did this kinda EH \"menu\" continue after you hit the \"healthy weight\" (BS) marker, too? I think that's my biggest mental hurdle to get over in terms of just totally giving into the extreme hunger. That damned BMI marker is getting to me and convincing me I should noooot be eating this much. Ty for posting!!!",
          "created_utc": 1636695369.0
        }
      ]
    },
    {
      "id": "hkbvh3n",
      "author": "tkdaw",
      "body": "This is where it really helped to be living with a single roommate. Yes, I was eating a fuckton more than him, but also, we didn't eat together and he literally did not care what or how much I ate. I don't think he even paid any attention tbh cuz like... healthy people aren't monitoring other people's food intake unless they need to for whatever reason.",
      "created_utc": 1636723488.0,
      "score": 13,
      "context": [
        {
          "id": "hkbp9w5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636719951.0
        }
      ]
    },
    {
      "id": "k4619zq",
      "author": "tkdaw",
      "body": "It's going well!! I'm vibing, still have my days in the weeds but the highs are higher and the low points aren't as low. The EH didn't last forever and getting out on the other side is very freeing.",
      "created_utc": 1696877195.0,
      "score": 3,
      "context": [
        {
          "id": "k45rrnv",
          "author": "Direct-Bug-8081",
          "body": "still helping people two years later with this post\n\nive been obsessively scrolling through reddit and if im honest with myself, trying to find a reason not to honour my hunger.\n\nthere are so many people on this site who \"disagree\" with extreme hunger and say its an excuse to binge, explaining that it \"didn't work for them\". \n\nthis is the post i needed to pull myself back uo and out of the depths of anorexia.\n\nthankyou friend\n\ni hope your recovery is going well <3",
          "created_utc": 1696873826.0
        }
      ]
    },
    {
      "id": "l3vwigj",
      "author": "tkdaw",
      "body": "A while. But you'll be ok. You find a balance eventually.",
      "created_utc": 1715624553.0,
      "score": 1,
      "context": [
        {
          "id": "l3ldwss",
          "author": "wongdong77",
          "body": "I honestly don’t know what to do. Im on my first week of recovery and I have a lot of cravings for junk food and I think Im supposed to give in, so I do. But then afterwards, I feel like shit. So it’s really hard not to restrict right after to make the full feeling go away. It stresses me out when I eat, so then I eat more to try and calm it. I don’t know how to identify when Im hungry and when Im full. I can’t keep living like this. I just want to eat normally and live a happy life! How long is it going to take!",
          "created_utc": 1715445613.0
        }
      ]
    },
    {
      "id": "lw170c5",
      "author": "Fantastic-Anxiety401",
      "body": "Has it gotten better? I’m in the same boat",
      "created_utc": 1731043148.0,
      "score": 1,
      "context": [
        {
          "id": "lq498y6",
          "author": "cilly111",
          "body": "Im going through this right now, thank you sm<3",
          "created_utc": 1727953189.0
        }
      ]
    },
    {
      "id": "k1ekv3c",
      "author": "None",
      "body": "The more I look at other people's versions of EH I realise mine is a really regular amount of food, so I hope that's not triggering or hurtful for anyone if I present it like it is some \"crazy\" amount. <3",
      "created_utc": 1695211230.0,
      "score": 1,
      "context": [
        {
          "id": "k1ekpaq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1695211151.0
        }
      ]
    },
    {
      "id": "k2iubvz",
      "author": "tkdaw",
      "body": "Calories calories calories, drink if you're thirsty but don't chug water to feel full. It's terrifying but the only way out is through. Sending hugs",
      "created_utc": 1695867676.0,
      "score": 2,
      "context": [
        {
          "id": "k2ibako",
          "author": "Busy_Relationship911",
          "body": "Please help me, this hunger is so scary.",
          "created_utc": 1695859782.0
        }
      ]
    },
    {
      "id": "kp6kzey",
      "author": "tkdaw",
      "body": "No. Stretching or gentle yoga or short walks, maybe! But drop the gym and chill 😎 it'll be OK",
      "created_utc": 1707230631.0,
      "score": 2,
      "context": [
        {
          "id": "kp6fng8",
          "author": "LivingLengthiness150",
          "body": "Should i keep working out during this time?",
          "created_utc": 1707228457.0
        }
      ]
    },
    {
      "id": "kp8bxi1",
      "author": "tkdaw",
      "body": "Recovery does sometimes entail weight gain. Odds are that most of that is water and food/waste in your intestines. Maybe 5-7lbs of *weight* weight, max.\n\nDon't weigh in recovery. It will not serve you.",
      "created_utc": 1707252319.0,
      "score": 1,
      "context": [
        {
          "id": "kp8ah5s",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1707251839.0
        }
      ]
    },
    {
      "id": "hkbawte",
      "author": "fishonthesun",
      "body": "To clarify, I was not on a meal plan, it was on a post in which someone was saying they wanted to eat more than their meal plan and someone commented that. I think I've seen a couple times people who were not supposed to eat more than their plan but in general yeah, as far as I know it's a minimum",
      "created_utc": 1636708530.0,
      "score": 9,
      "context": [
        {
          "id": "hk9lp9k",
          "author": "fishonthesun",
          "body": "I love this so much. Like... Finally, someone whose extreme hunger resonates with me. I've seen people say that it's an excuse to binge and it would make me feel so awful. But, can it even be a binge if you are still hungry? I've mentioned this before but I was eating probably triple my TDEE if I was exercising, but I wasn't exercising. And it took 2 months of that before I gained a single (real) pound. My body had a lot of repairing to do! On a different ED sub someone said that \"don't restrict yourself\" just means \"don't eat a very low amount of calories, not eat whatever you want whenever you want\" specifically in ED recovery. And that's just bullshit. If I'm so hungry my stomach feels like a hollow empty pit, and I say \"nope gotta stick to my meal plan of >reasonable calories for someone not recovering from a restrictive eating disorder< or else it's binging!\" That would just be denial. That *would* be restricting. Idk. I never fully let my extreme hunger and my body repairing run its course, so my body never fully recovered. And I did that because I was still so scared of not being fully in control, of binging, and people online made me think I was binging. \n\nSo anyways, thank you again for this post. When I'm financially able to afford eating as much as needed and fully recovering, I'll remember this ❤️",
          "created_utc": 1636673854.0
        },
        {
          "id": "hk9pqs7",
          "author": "tkdaw",
          "body": "Bingeing is a mindset. Eating because you're hungry is not a binge. \n\nAren't meal plans a minimum? Do they legitimately tell you not to exceed them? Cuz that sounds like BS to me.",
          "created_utc": 1636675979.0
        }
      ]
    },
    {
      "id": "hkd4o8m",
      "author": "messythelioma",
      "body": "For sure! I didn't want to say that and discredit them because I do feel bad but I honestly and genuinely believe they aren't actually honoring their extreme hunger. \n\nI'm very much glad whenever I see something like that I scroll past/indicate \"not interested\" to avoid seeing posts like that in the future.",
      "created_utc": 1636742779.0,
      "score": 7,
      "context": [
        {
          "id": "hkd1xir",
          "author": "messythelioma",
          "body": "I'm actually crying, because so often I see \"WIEIAD - Extreme Hunger Edition\" and it's literally nothing compared to what I eat. Seeing your post look similar to the amount that I eat has really helped reassure me that extreme hunger looks different for people.",
          "created_utc": 1636741630.0
        },
        {
          "id": "hkd2e4x",
          "author": "tkdaw",
          "body": "EDs are competitive, so I suspect a lot of \"extreme hunger recovery\" videos are neither EH nor recovery. They're still-disordered individuals trying to capitalize on the social media trend of \"recovery uwu\" without actually going through the grueling process of recovery.",
          "created_utc": 1636741824.0
        }
      ]
    },
    {
      "id": "hn0rs0g",
      "author": "Goth_Lizard",
      "body": "Right but I feel like the last few times physically I am not hungry I just have these intense cravings for sweets",
      "created_utc": 1638501061.0,
      "score": 3,
      "context": [
        {
          "id": "hn05vqz",
          "author": "Goth_Lizard",
          "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
          "created_utc": 1638491339.0
        },
        {
          "id": "hn0912p",
          "author": "tkdaw",
          "body": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.",
          "created_utc": 1638492774.0
        }
      ]
    },
    {
      "id": "hxdx9bg",
      "author": "ryvnosuke",
      "body": "When you put it like that, it makes a lot more sense. School threw me off, I was doing good with it but the time between lunch and going home and a bit before lunch makes me so so hungry, but at home I lose my appetite. Also, does the amount of time eh lasts depend on how long you restricted? Or does it just go at one point (?)",
      "created_utc": 1645146325.0,
      "score": 2,
      "context": [
        {
          "id": "hxdshma",
          "author": "ryvnosuke",
          "body": "You have no *fucking* idea how much I love you (/p). Going through recovery ig/TikTok posts about what they eat in a day is genuinely the worst recovery decision I have ever made, I haven't been able to honour my extreme hunger at all. Thank you for being so honest.",
          "created_utc": 1645144192.0
        },
        {
          "id": "hxdtahg",
          "author": "tkdaw",
          "body": "Extreme hunger is literally \"body wants as many calories as it can process as quickly as it can process them.\" The less you resist, the better.",
          "created_utc": 1645144548.0
        }
      ]
    },
    {
      "id": "hkjyd6r",
      "author": "RevolutionaryPeak550",
      "body": "The second one SPEAKS to me",
      "created_utc": 1636868522.0,
      "score": 5,
      "context": [
        {
          "id": "hk9cytl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1636669921.0
        },
        {
          "id": "hk9dvdh",
          "author": "tkdaw",
          "body": "Self-talk. Come up with mantras and reminders of why you want to recover. Some of mine: \n\n\"The only way out is through.\"\n\n\"Fuck the gremlins, we do not claim them as our own.\" \n\n\"No food will hurt you like starvation did.\" \n\n\"I'm done with my bullshit, even if it isn't done with me.\"",
          "created_utc": 1636670317.0
        }
      ]
    },
    {
      "id": "m0n5p56",
      "author": "Prize-Injury-4308",
      "body": "How are you doing today?",
      "created_utc": 1733451409.0,
      "score": 1,
      "context": [
        {
          "id": "hkatkba",
          "author": "moripeji",
          "body": "Thank you so much for posting this... I literally just made a post on the panic you describe (I am... sorry... LOL) at finally having actual physical extreme hunger kick in (after 2 full months of all-in recovery, so the delay/ panic was real), and having what you ate on a typical EH day as an example really, REALLY helped me to alleviate some of the pressure and guilt I was feeling about how much/ how often I've been eating. I know we're all different with different needs etc, but this seriously helped.  \n\n\nIf you don't mind me asking, did this kinda EH \"menu\" continue after you hit the \"healthy weight\" (BS) marker, too? I think that's my biggest mental hurdle to get over in terms of just totally giving into the extreme hunger. That damned BMI marker is getting to me and convincing me I should noooot be eating this much. Ty for posting!!!",
          "created_utc": 1636695369.0
        },
        {
          "id": "hkazrl1",
          "author": "None",
          "body": "My LW is/was right on the brink between UW and N. It's only the beginning but yesterday looked like:\n\n-oatmeal with a lot of PB\n\n-bagel with lots of PB and banana\n\n-yogurt with nuts, granola and berries\n\n-apple\n\n-cereal and nuts\n\n-couscous, veggies and a greasy burger cooked in oil\n\n-big bowl of cereal\n\n-half a pint of ben and jerry's\n\n-(at this point i couldn't sleep despite trying for 3 hours) 2 big bowls of cereal \n\n-(still couldn't sleep - it was past 4 am at this point and to my shock, i was starting to feel hungry) crackers with several spoonfuls of PB + more from the jar\n\nI woke up thinking about food again, like every single morning.\n\nEdit: I mean the beginning of EH. I haven't properly restricted in a year.",
          "created_utc": 1636699467.0
        }
      ]
    },
    {
      "id": "k63q6jq",
      "author": "boxfishblorps",
      "body": "Thank you both for making this post, and for bumping it! Just what I needed to see. Sending the best of vibes for your continued recoveries.",
      "created_utc": 1698068333.0,
      "score": 2,
      "context": [
        {
          "id": "k45rrnv",
          "author": "Direct-Bug-8081",
          "body": "still helping people two years later with this post\n\nive been obsessively scrolling through reddit and if im honest with myself, trying to find a reason not to honour my hunger.\n\nthere are so many people on this site who \"disagree\" with extreme hunger and say its an excuse to binge, explaining that it \"didn't work for them\". \n\nthis is the post i needed to pull myself back uo and out of the depths of anorexia.\n\nthankyou friend\n\ni hope your recovery is going well <3",
          "created_utc": 1696873826.0
        },
        {
          "id": "k4619zq",
          "author": "tkdaw",
          "body": "It's going well!! I'm vibing, still have my days in the weeds but the highs are higher and the low points aren't as low. The EH didn't last forever and getting out on the other side is very freeing.",
          "created_utc": 1696877195.0
        }
      ]
    },
    {
      "id": "ly3b1sc",
      "author": "cilly111",
      "body": "It does get better but as OP said, you cannot compensate. I did and my hunger got even more intense, that's why it's really important that you don't do it. Right now, I manage to think of stuff other than food so that's a win in my book. I'm still not there yet, but going in the right direction. Good luck on your recovery journey♡♡",
      "created_utc": 1732107204.0,
      "score": 1,
      "context": [
        {
          "id": "lq498y6",
          "author": "cilly111",
          "body": "Im going through this right now, thank you sm<3",
          "created_utc": 1727953189.0
        },
        {
          "id": "lw170c5",
          "author": "Fantastic-Anxiety401",
          "body": "Has it gotten better? I’m in the same boat",
          "created_utc": 1731043148.0
        }
      ]
    },
    {
      "id": "hn5pu9p",
      "author": "tkdaw",
      "body": "Cravings can be mental hunger. Or just cravings. Who knows? Normies eat because of cravings all the time, it's not like they Only Ever Eat When Desperately In Need Of Food. \n\nhonestly, I hear the best part of recovery is not going through a 10-step checklist to determine whether you should eat or not.",
      "created_utc": 1638592319.0,
      "score": 16,
      "context": [
        {
          "id": "hn05vqz",
          "author": "Goth_Lizard",
          "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
          "created_utc": 1638491339.0
        },
        {
          "id": "hn0912p",
          "author": "tkdaw",
          "body": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.",
          "created_utc": 1638492774.0
        },
        {
          "id": "hn0rs0g",
          "author": "Goth_Lizard",
          "body": "Right but I feel like the last few times physically I am not hungry I just have these intense cravings for sweets",
          "created_utc": 1638501061.0
        }
      ]
    },
    {
      "id": "hxgq49o",
      "author": "tkdaw",
      "body": "No idea, honestly. I think it varies. Probably roughly depends on how long you restricted for, though.",
      "created_utc": 1645202412.0,
      "score": 2,
      "context": [
        {
          "id": "hxdshma",
          "author": "ryvnosuke",
          "body": "You have no *fucking* idea how much I love you (/p). Going through recovery ig/TikTok posts about what they eat in a day is genuinely the worst recovery decision I have ever made, I haven't been able to honour my extreme hunger at all. Thank you for being so honest.",
          "created_utc": 1645144192.0
        },
        {
          "id": "hxdtahg",
          "author": "tkdaw",
          "body": "Extreme hunger is literally \"body wants as many calories as it can process as quickly as it can process them.\" The less you resist, the better.",
          "created_utc": 1645144548.0
        },
        {
          "id": "hxdx9bg",
          "author": "ryvnosuke",
          "body": "When you put it like that, it makes a lot more sense. School threw me off, I was doing good with it but the time between lunch and going home and a bit before lunch makes me so so hungry, but at home I lose my appetite. Also, does the amount of time eh lasts depend on how long you restricted? Or does it just go at one point (?)",
          "created_utc": 1645146325.0
        }
      ]
    },
    {
      "id": "hn8fq7h",
      "author": "Goth_Lizard",
      "body": "I’m doing so much better today and yesterday !!",
      "created_utc": 1638648554.0,
      "score": 3,
      "context": [
        {
          "id": "hn05vqz",
          "author": "Goth_Lizard",
          "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
          "created_utc": 1638491339.0
        },
        {
          "id": "hn0912p",
          "author": "tkdaw",
          "body": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.",
          "created_utc": 1638492774.0
        },
        {
          "id": "hn0rs0g",
          "author": "Goth_Lizard",
          "body": "Right but I feel like the last few times physically I am not hungry I just have these intense cravings for sweets",
          "created_utc": 1638501061.0
        },
        {
          "id": "hn5pu9p",
          "author": "tkdaw",
          "body": "Cravings can be mental hunger. Or just cravings. Who knows? Normies eat because of cravings all the time, it's not like they Only Ever Eat When Desperately In Need Of Food. \n\nhonestly, I hear the best part of recovery is not going through a 10-step checklist to determine whether you should eat or not.",
          "created_utc": 1638592319.0
        }
      ]
    },
    {
      "id": "hn8y65e",
      "author": "tkdaw",
      "body": "That's great!!",
      "created_utc": 1638656531.0,
      "score": 3,
      "context": [
        {
          "id": "hn05vqz",
          "author": "Goth_Lizard",
          "body": "This post is single handledly saving me from relapsing. The past week has been brutal. Between the extreme hunger or the extreme cravings. Today was brutal, the guilt is overwhelming and I just hate this so much.  I’m convinced I have a binge eating disorder now, but I guess I don’t. Today I ate 3 normal meals wasn’t hungry until after dinner I went off the rails and ate 2 sleeves of Oreos, 4 rice crispies 5 gingerbread pillsbury, alot of Lindt chocolate, and some trail mix cookies. This sucks.",
          "created_utc": 1638491339.0
        },
        {
          "id": "hn0912p",
          "author": "tkdaw",
          "body": "Bingeing is a mindset. Eating a fuckton because you're mentally or physically hungry is entirely different than a binge. \n\nI wish you the best in recovery.",
          "created_utc": 1638492774.0
        },
        {
          "id": "hn0rs0g",
          "author": "Goth_Lizard",
          "body": "Right but I feel like the last few times physically I am not hungry I just have these intense cravings for sweets",
          "created_utc": 1638501061.0
        },
        {
          "id": "hn5pu9p",
          "author": "tkdaw",
          "body": "Cravings can be mental hunger. Or just cravings. Who knows? Normies eat because of cravings all the time, it's not like they Only Ever Eat When Desperately In Need Of Food. \n\nhonestly, I hear the best part of recovery is not going through a 10-step checklist to determine whether you should eat or not.",
          "created_utc": 1638592319.0
        },
        {
          "id": "hn8fq7h",
          "author": "Goth_Lizard",
          "body": "I’m doing so much better today and yesterday !!",
          "created_utc": 1638648554.0
        }
      ]
    }
  ]
}