{
  "id": "qurroe",
  "subreddit": "fuckeatingdisorders",
  "author": "TerrifyinglyAlive",
  "created_utc": 1637013972.0,
  "title": "Using my dog as a benchmark (numbers)",
  "selftext": "This is something I've been keeping in mind lately that I've found helpful.\n\nMy dog weighs 62 pounds.\n\nShe is *not* active.  She's a low-energy breed, spends maybe 40 minutes a day walking at a very relaxed pace and the rest of the time lying down.\n\nHer brain is smaller than a lemon, and about 1/3 the size of a human's relative to body size.  It is much less expensive to run than a human brain.\n\nWith all that in mind, my sedentary, lemon-brained dog needs to eat 1300 calories a day, minimum.\n\nThe idea that I (or you), a much larger animal with a much more energy-demanding brain, could subsist on that amount or less is profoundly ludicrous.  *Of course* I need way more food than that!  Even if I'm small and short for a human.  Even if I don't exercise.  I need more food than a lazy dog.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/qurroe/using_my_dog_as_a_benchmark_numbers/",
  "score": 116,
  "num_comments": 11,
  "comments": [
    {
      "id": "hkt1tjz",
      "author": "I_SAID_NO_CHEESE",
      "body": "I remember when my calories were <1200. I never understood why I was so tired and had no motivation. Shocked pikachu face.",
      "created_utc": 1637031825.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hkrzc71",
      "author": "Sareeee48",
      "body": "THIS. The human brain burns a surprising amount of calories just to *think*, not to mention all of the other insanely complex things it does does. So in other words, the harder you work your brain, the more calories it needs to function.",
      "created_utc": 1637014944.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hks6hcv",
      "author": "SadNAloneOnChristmas",
      "body": "I definitely don't eat enough and I get baffled when I eat salty foods in the evening and weigh more in the morning and my brain immediately says \"Wow you gained that much overnight? Time to not eat!\"\n\n&#x200B;\n\nI hate it. I just want to not care.",
      "created_utc": 1637017930.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hkttkop",
      "author": "lilacpainter001",
      "body": "I'm glad you shared this. It really helps to understand how fucked up this disorder is. Thank you so much, hug your lemon-brained doggy for me!",
      "created_utc": 1637047743.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hkvxnpl",
      "author": "butterflybyloona",
      "body": "I needed to see this today, wow",
      "created_utc": 1637088787.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hkvvmoi",
      "author": "cat0verlord",
      "body": "i love this post so much! thank you!",
      "created_utc": 1637087997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hoi2ids",
      "author": "None",
      "body": "my stupid aunt kept trying to convince me that a woman my size should eat under 1200 calories to \"look good\". i don't want to trigger anyone so i don't want to state my numbers, but i'm tall and rather heavy; i'm kind of pear-built so i have naturally heavier/bulkier legs. i was criticising an outdated \"dieting\" book my stupid father gave me (i don't even know why; talk about tone deaf) which said that women should eat between 850 and 1000 calories a day. i said \"i need at least double that! even more if i'm active\". she got so irrationally angry. she said i could NEVER look good eating that many calories. drives me fucking insane. i would 100% die in a few years if i ate the way she says i should hahahah",
      "created_utc": 1639483387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hkvq0dh",
      "author": "callmedylanelliot",
      "body": "I was a complete zombie eating 1200 a day. Couldn't think, couldn't feel. I was always cold and so tired. And I'm only 5'2. Humans need way more calories to function than most people think.",
      "created_utc": 1637085811.0,
      "score": 11,
      "context": [
        {
          "id": "hkt1tjz",
          "author": "I_SAID_NO_CHEESE",
          "body": "I remember when my calories were <1200. I never understood why I was so tired and had no motivation. Shocked pikachu face.",
          "created_utc": 1637031825.0
        }
      ]
    },
    {
      "id": "hoi1to4",
      "author": "None",
      "body": "i recently went through my food diary from a few years ago when i was at my worst (i've been recovering for a couple of years now), and it's shocking; i was eating between 800 and 900 calories a day for months, working out all the time, i don't understand how i was even awake or able to do anything in my day. it's no wonder i couldn't study, that i kept injuring my knees and hips working out (these injuries still impact me today btw, even if i'm at a very healthy weight and have a lot more muscle), it's no wonder that i couldn't sleep well, or drink a lot of water, or even think clearly. awful. recovery has been the best gift i've given myself. no one deserves to be mistreated like that\n\nedit: i need to mention that i'm also really tall and i was athletic to begin with because i was a very healthy, playful kid. the ed WRECKED my body. absolutely wrecked me emotionally, psychologically. it ruined all of my relationships, and most importantly my relationship with myself. still have some open wounds, scabs i pull at. it's a long journey but i finally feel like myself again, and it's been plenty of years since my ed first started. best luck to you all. you are all SO brave, and SO worthy of LOVE, of PATIENCE, of CARE. i love every single one of you. never EVER disrespect yourself. you are your best friend and your most valuable player. you deserve all the love in the world, so give yourself that",
      "created_utc": 1639482918.0,
      "score": 2,
      "context": [
        {
          "id": "hkt1tjz",
          "author": "I_SAID_NO_CHEESE",
          "body": "I remember when my calories were <1200. I never understood why I was so tired and had no motivation. Shocked pikachu face.",
          "created_utc": 1637031825.0
        }
      ]
    },
    {
      "id": "hks7b5h",
      "author": "TerrifyinglyAlive",
      "body": "Things definitely got easier when I stopped weighing.  It’s hard at first but worth the effort to start thinking about.",
      "created_utc": 1637018283.0,
      "score": 10,
      "context": [
        {
          "id": "hks6hcv",
          "author": "SadNAloneOnChristmas",
          "body": "I definitely don't eat enough and I get baffled when I eat salty foods in the evening and weigh more in the morning and my brain immediately says \"Wow you gained that much overnight? Time to not eat!\"\n\n&#x200B;\n\nI hate it. I just want to not care.",
          "created_utc": 1637017930.0
        }
      ]
    }
  ]
}