{
  "id": "qz8pkf",
  "subreddit": "fuckeatingdisorders",
  "author": "saintmary23",
  "created_utc": 1637541396.0,
  "title": "ed ruined my nieces bday",
  "selftext": "tonight was truly awful. i prioritized my eating disorder over my niece who i consider to be my world. i left her party early so i could eat my sad dinner alone in my bed when i live 2 hours away. if i had just eaten at the party this would not have happened. if i had even eaten during the day i wouldve managed. i have convinced myself i dont really have an eating disorder because i do eat. that in pretending or over exaggerating. but tonight i think it solidified it for me. i am disgusted with myself. i saw myself in the mirror tonight and i look gaunt, sickly and pale. i couldnt hold a conversation at the party because i was so malnourished. i just watched other people eat. and tracked their calories in my head. i didnt even want to eat there because i am in such a state of malnutrition. im so used to restriction i wasnt tempted to eat, my disorder has convinced me im okay with watching others. my niece offered me some of her mac and cheese, which made me so happy because she does not share food with ANYONE.  i felt so special. but i failed her. i couldnt take a bite of a whole pasta noodle, just the tiniest bit of the end. i pretended to eat a full bite because i KNEW it was fucking weird. anybody watching me would think that behavior was weird because it is weird. the things my eating disorder convinces me to do are weird. its not normal to walk by the bakery at work a million times a day just to smell the food. or to run past restaurants on my jogs to watch other people eat and imagine the meals there. its not normal to leave a party early after barely talking to anyone so i can go home and eat crackers and carrots and watch videos of other people eat meals id rather be eating. i threw away the piece of candy my niece gave to me (again after refusing to share with anyone else) because i couldn't have a simple lollipop. i drove 2 hours and didnt stop for gas because i needed to get home and do my routine. this solidified for me that my eating disorder will not let me do anything. i have to go home and live this groundhog day and eat my sad pathetic food over and over.  i cant go anywhere because i cant eat unless its at a specific time in a specific place with specific food. i cant eat beforehand, and im a starving mess if i dont do this routine. i live inside old memories of me enjoying life not being hungry. i constantly fantasize about looking at christmas lights with my family, enjoying and being present in the moment without being miserable because i am starving. about waking up in the middle of the night to my dad leaving work and wanting to watch him leave, instead of being woken up because i am hungry. i know deep down i am so, so, hungry. even if i dont really feel it anymore. if i dont suppress my hunger with liquids before bed so i can sleep at night. im at the point that eating anything is considered a binge to me. my eating disorder will not let me have a life. i have been living this routine for months now and today was the day i couldnt work around it. it has taken over my life and taken time away from the person i consider to be my everything. how can i say that if i chose this over her? i dont know of anybody noticed me not eating or acting strange, because i know healthy people dont fixate on what others eat so much. but regardless, the memory of this birthday was tainted for me and i hope to God my niece did not see me throw out her candy or that she does not internalize the memory of me unable to eat one fucking mac and cheese noodle. i dont want her to be anything like this. i hope when she grows up she continues to ask for seconds of mac and cheese and continues to eat cake and candy and eat snacks before her meals as carefree as she did today. i want to change for her. to be a role model for her. i dont want to admire a toddler for her eating habits. i dont want this for myself but i dont know how to stop or how to make myself eat. i need help. but i have no idea how to ask for it or if im truly deserving because half the time im convinced this isnt an issue. this eating disorder has taken so much from me, for years it has stolen good memories. i dont know how to get them back.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/qz8pkf/ed_ruined_my_nieces_bday/",
  "score": 84,
  "num_comments": 10,
  "comments": [
    {
      "id": "hlkw9kg",
      "author": "Adghnm",
      "body": "That's really sad but don't be angry at yourself. I find that the more i hate myself, the worse my behavior gets. Clearly lots of people love you",
      "created_utc": 1637541861.0,
      "score": 36,
      "context": []
    },
    {
      "id": "hll25sz",
      "author": "Purple_bee552",
      "body": "it is an issue and you absolutely deserve help. you deserve to have a life free from counting calories and spending half the time on a scale. you should try and tell someone you really trust or get a therapist to help approach getting better. youve got this <3",
      "created_utc": 1637544649.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hll8b07",
      "author": "GangOfNone",
      "body": "Take this as the moment you decided to get better. Then go get help and get better.\nYou can do this.\n\nAll the best to you.",
      "created_utc": 1637547513.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hlllip6",
      "author": "None",
      "body": "You are so brave for recognizing your disorder and speaking of it with so much perspective and self-awareness. This might be the point where you now realize you have yo take action. I relate so much to your story, I used to not be able to have a bite of goat cheese on picnics with friends, I would just sit there in the sun freezing to death with a bag full of broccoli and celery sticks… it was miserable. I chose to recover and now I go out to eat with friends and family without thinking and I eat all I want and can focus on the people I love rather than the food. I really wish for you to get to that place, you have to start eating again and breaking free from psychological ties. I believe in you, you can do this. I am sure that if your niece knew about your disorder, the first thing she would want is for you to recover and be your best, happiest self.",
      "created_utc": 1637553924.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hllh3t2",
      "author": "tobelostinliterature",
      "body": "I relate to this so, so hard. I have been in recovery for a couple years now and because of that I can promise you that you can get better and you can do this. I still struggle with thinking of all the memories and experiences I lost to my ED, but I just take that pain and turn it into determination and motivation to make sure I keep fighting forward in a better direction away from this horrible, horrible disease. Sometimes it is hard and I beat myself up so much, but I know that, in the end, that doesn't help. You deserve to be happy. You deserve to find help and to get better. We all support you.",
      "created_utc": 1637551727.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hlmd2mu",
      "author": "cottagecoreprincess5",
      "body": "This made me cry because of just how much I relate and how far in denial I am. I admire you so much for being able to write about this so openly and honestly. I’ve been through nearly the exact same situation and it just,,hurts. I feel awful for hurting my family this way but my ed has convinced me it’s the only way I deserve to live.",
      "created_utc": 1637573043.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hm3ulhw",
      "author": "saintmary23",
      "body": "i wasnt ready to reply to the comments when i first wrote this but i want u to know i read this so many times and had no hope for myself that this could ever be my reality. but tonight i broke the cycle and i ate a full real meal for the first time in a long, long time. thank u for writing this it meant so much to me <3 im officially all in today and even tho im scared shitless im so hopeful that i can recover and my nieces next birthday will be full of cake and candy and happiness :)",
      "created_utc": 1637892523.0,
      "score": 4,
      "context": [
        {
          "id": "hlllip6",
          "author": "None",
          "body": "You are so brave for recognizing your disorder and speaking of it with so much perspective and self-awareness. This might be the point where you now realize you have yo take action. I relate so much to your story, I used to not be able to have a bite of goat cheese on picnics with friends, I would just sit there in the sun freezing to death with a bag full of broccoli and celery sticks… it was miserable. I chose to recover and now I go out to eat with friends and family without thinking and I eat all I want and can focus on the people I love rather than the food. I really wish for you to get to that place, you have to start eating again and breaking free from psychological ties. I believe in you, you can do this. I am sure that if your niece knew about your disorder, the first thing she would want is for you to recover and be your best, happiest self.",
          "created_utc": 1637553924.0
        }
      ]
    },
    {
      "id": "hm3uxs2",
      "author": "saintmary23",
      "body": "sorry for the late reply but i wanted to thank u for writing this. i really needed to hear recovery was possible and the encouragement and because of u and many others support today i was able to eat and be FULL :) my recovery starts today and im so relieved honestly. anyways thank u again this helped more than u know <33333",
      "created_utc": 1637892705.0,
      "score": 2,
      "context": [
        {
          "id": "hllh3t2",
          "author": "tobelostinliterature",
          "body": "I relate to this so, so hard. I have been in recovery for a couple years now and because of that I can promise you that you can get better and you can do this. I still struggle with thinking of all the memories and experiences I lost to my ED, but I just take that pain and turn it into determination and motivation to make sure I keep fighting forward in a better direction away from this horrible, horrible disease. Sometimes it is hard and I beat myself up so much, but I know that, in the end, that doesn't help. You deserve to be happy. You deserve to find help and to get better. We all support you.",
          "created_utc": 1637551727.0
        }
      ]
    },
    {
      "id": "hm3vond",
      "author": "saintmary23",
      "body": "sorry for the late reply but i totally understand that feeling :( i want u to know that today i actually started recovery. i honestly did not think i could do it. i thought i was too trapped in my routine i honestly didnt see a way out. but i ate!!! i ate and it was amazing and i promise things just feel so much better already. its going to be a long road ahead but there is no better time to start than now. u dont have to wait until ur sick enough because u already are. i always say, if u had a broken bone u wudnt wait until it was \"broken enough\" to go to the doctors. it hurts NOW. and u deserve to feel better. food freedom is the most magical thing. it is a MASSIVE relief to let those behaviors go. i hope u find recovery soon and just know u are so worthy and so deserving of it <33",
      "created_utc": 1637893103.0,
      "score": 3,
      "context": [
        {
          "id": "hlmd2mu",
          "author": "cottagecoreprincess5",
          "body": "This made me cry because of just how much I relate and how far in denial I am. I admire you so much for being able to write about this so openly and honestly. I’ve been through nearly the exact same situation and it just,,hurts. I feel awful for hurting my family this way but my ed has convinced me it’s the only way I deserve to live.",
          "created_utc": 1637573043.0
        }
      ]
    },
    {
      "id": "hm3wbb2",
      "author": "None",
      "body": "OMG HOORAY!!!! YES I knew you would make it! This makes me so incredibly happy! Keep eating and having fun exploring the new foods in your life, it will only get better from here ❤️",
      "created_utc": 1637893442.0,
      "score": 3,
      "context": [
        {
          "id": "hlllip6",
          "author": "None",
          "body": "You are so brave for recognizing your disorder and speaking of it with so much perspective and self-awareness. This might be the point where you now realize you have yo take action. I relate so much to your story, I used to not be able to have a bite of goat cheese on picnics with friends, I would just sit there in the sun freezing to death with a bag full of broccoli and celery sticks… it was miserable. I chose to recover and now I go out to eat with friends and family without thinking and I eat all I want and can focus on the people I love rather than the food. I really wish for you to get to that place, you have to start eating again and breaking free from psychological ties. I believe in you, you can do this. I am sure that if your niece knew about your disorder, the first thing she would want is for you to recover and be your best, happiest self.",
          "created_utc": 1637553924.0
        },
        {
          "id": "hm3ulhw",
          "author": "saintmary23",
          "body": "i wasnt ready to reply to the comments when i first wrote this but i want u to know i read this so many times and had no hope for myself that this could ever be my reality. but tonight i broke the cycle and i ate a full real meal for the first time in a long, long time. thank u for writing this it meant so much to me <3 im officially all in today and even tho im scared shitless im so hopeful that i can recover and my nieces next birthday will be full of cake and candy and happiness :)",
          "created_utc": 1637892523.0
        }
      ]
    }
  ]
}