{
  "id": "r2a332",
  "subreddit": "fuckeatingdisorders",
  "author": "saintmary23",
  "created_utc": 1637885157.0,
  "title": "accidental recovery",
  "selftext": "so it happened. i ate. the damn felt like it broke and it flooded open. i was at a chinese food restaurant, smth i had known abt for weeks and been stressing abt for weeks since my mom first told me. i researched the menu, studied it and the calories and chose the things i would eat days before. i got there stressed and tired and hungry. i was exhausted today. and for weeks before coming home i was telling myself i would use this chance to get better but knowing id never do it. little did i know they werent serving my \"safe food\" options due to the holidays. so i was beginning to have a quiet meltdown and everyone saw the tears start to well in my eyes. but then my dad said something to me that hurt worse than the stupid food i was crying over. i was picking at my plate. barely eating green beans. i was so sick of this and my self. disgusted with what ive become. i was well past this point but in that moment i was particularly angry at myself. and my dad made a comment. he just said. \"eat!!\". the way he said it was just so....hurt. he told me i looked bird like and the reality hit more than anything of how bad i look and how stupid i looked shaking at a plate of green beens. seeing your child like that must be agonizing. so i ate. i ate everything ravenously. and i couldnt stop smiling because i was so full by the end. and then i got hot chocolate with my family and didnt look at the menu. and then i got home and ate more dessert. the floodgates OPENED. ive never been so hungry. like i KNEW i was hungry but actually honoring it? feels like a dream. u cant imagine how good mac and cheese tastes. right now im battling the aftermath of being so full. fighting the urge to run tomorrow. to starve myself to make up for the food i ate tonight. but instead im focusing on breakfast since i think if i eat anymore tonight i'll burst. but im going to have waffles tomorrow. with syrup and butter. and im going to have coffee that is not black. im focusing so hard on that because right now i feel like i have to roll myself to bed im so full hahaha. i love my dad so much he has no idea that the way he said that simple phrase mightve saved me. that restaurant has no idea their greasy salty food mightve saved me. im just tired of hurting. my body is in pain. its exhausted. im exhausted. of course its hard, the mental part. but i can do it. the reality sunk in after my first real meal in months that im going to have to commit to this. that i have to eat again, and again, and again. i have to keep eating everytime im hungry. everytime the voice tells me i should run or i should starve or i shouldnt eat this or that. i have to eat everytime. because i cannot let the eating disorder win. i want to be like how i was when i was a kid. being w my family and watching old videos tonight reminds me of that. in that moment at the restaurant i had a choice. to either hurt my dad, let him down like i let my niece down, and my friends, and countless others, or eat the fucking food. i was so angry with the ed voice i ate out of SPITE. i ate for my dad, for my niece, for myself, and most of all for my child self that i admire so greatly for how they ate. im terrfied. scared shitless right now. but my body will sort itself out. its smart. it knows best. i have been living like this for way too long. years of denial, of downplaying it, and then my attempts at recovery that was just more restriction in different forms. im over it. i want to live. i dont want to look at myself in the mirror and be disgusted anymore. i dont want to look half dead anymore. i want my period. i want to be warm again. i want my life back. to be in love someday. im so sick of doing anything and everything to suppress my hunger. im sick of missing out on life because im stuck at home living my sick little routine over and over. im just so done. i posted here about hitting my rock bottom a week or so ago. my ed tricked me and told me i needed to get worse before i could eat. well i dont want to get any worse. im sick enough. if i broke a bone i wouldnt wait until it was \"broken enough\" to go to the doctors. im so done waiting. i just want to be well. im ready to live. im really loving the name of this subreddit because tonight was one big FUCK YOU to my eating disorder.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/r2a332/accidental_recovery/",
  "score": 110,
  "num_comments": 19,
  "comments": [
    {
      "id": "hm3pqid",
      "author": "EvoFume",
      "body": "Please tell me your dad's reaction when you started eating at the restaurant lmaoo. That story was incredible, thank you for sharing it really helped me",
      "created_utc": 1637889982.0,
      "score": 33,
      "context": []
    },
    {
      "id": "hm3rvnp",
      "author": "Kind_Term6662",
      "body": "damn dude I dont really know how to put this in words but just reading your post just made me cry. Like, really cry. Im so happy for you, kick your eating disorders ass",
      "created_utc": 1637891086.0,
      "score": 25,
      "context": []
    },
    {
      "id": "hm3jc5g",
      "author": "flamingflamingo244",
      "body": "Dude, I'm so proud of u!! Keep going and stay strong <33",
      "created_utc": 1637886609.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hm3murn",
      "author": "Sareeee48",
      "body": "YAYYYY this is such a huge turning point for you and I am so proud of you! Keep going, even when it gets hard. We are all here rooting for you. ❤️",
      "created_utc": 1637888456.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hm3t1n2",
      "author": "cupswithfaces",
      "body": "I'm so happy for you !",
      "created_utc": 1637891707.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hm3twez",
      "author": "AudreyHW",
      "body": "I'm so happy for you!!",
      "created_utc": 1637892161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm41odo",
      "author": "its_me_anonymous16",
      "body": "YESSSS go you!! This made me cry a little",
      "created_utc": 1637896285.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm44n4a",
      "author": "kstocc",
      "body": "man this made me so emotional. i’m really glad that you were able to be somewhat happy with your family and let your body just do it’s thing",
      "created_utc": 1637897871.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm48c7h",
      "author": "ForestRagamuffin",
      "body": "ngl, i am literally cryin a lil right now. i am so fucking proud of you, SO fucking happy for you, like damn. you're powerful 💚 keep kicking ass!",
      "created_utc": 1637899894.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm5okjv",
      "author": "None",
      "body": "Please give us an update tomorrow :) Fuck the ED, don't try to compensate for allowing yourself basic needs!",
      "created_utc": 1637937140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hm5oo2j",
      "author": "None",
      "body": "So so so happy for you❤️❤️",
      "created_utc": 1637937192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hm5vi3r",
      "author": "elsacouchnaps",
      "body": "Literally tearing up right now because I am so happy for you!",
      "created_utc": 1637940616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hm3t1bn",
      "author": "saintmary23",
      "body": "im so glad it helped u that makes me so so happy :) n yes haha it was really great he smiled SO BIG and said \"its good isnt it?\" and i literally couldnt stop smiling either. he was laughing bc i was eating like a caveman but i think he understood i needed to ahahha. when i wanted hot chocolate he was DETERMINED to find it for me and we drove everywhere to find a dunkins open on thanksgiving. my family is really awesome im rlly lucky to have them 🥺 it was crazy because everything at the restaurant felt so loud and stressful and exhausting. but once i ate things felt SO much better and the world was instantly less harsh. only good things come from eating and nourishing ourselves !! its going to take a while but im determined to convince my brain of that, i hope u do too :')",
      "created_utc": 1637891702.0,
      "score": 46,
      "context": [
        {
          "id": "hm3pqid",
          "author": "EvoFume",
          "body": "Please tell me your dad's reaction when you started eating at the restaurant lmaoo. That story was incredible, thank you for sharing it really helped me",
          "created_utc": 1637889982.0
        }
      ]
    },
    {
      "id": "hm3tl7x",
      "author": "saintmary23",
      "body": "thank u <3333 it was really just me being so fed up and sick of the ed voice in that moment. it felt like it was sitting there with me at the table and i finally got the courage to say \"shut up\" and it felt AMAZING. im ready to kick some ed ass haha. im so relieved to finally be free even tho its just the first step, and i have a long long ways to go. im so excited to get my life back :')",
      "created_utc": 1637891998.0,
      "score": 8,
      "context": [
        {
          "id": "hm3rvnp",
          "author": "Kind_Term6662",
          "body": "damn dude I dont really know how to put this in words but just reading your post just made me cry. Like, really cry. Im so happy for you, kick your eating disorders ass",
          "created_utc": 1637891086.0
        }
      ]
    },
    {
      "id": "hm3jthr",
      "author": "saintmary23",
      "body": "thank u so much 🥺 ❤️",
      "created_utc": 1637886863.0,
      "score": 6,
      "context": [
        {
          "id": "hm3jc5g",
          "author": "flamingflamingo244",
          "body": "Dude, I'm so proud of u!! Keep going and stay strong <33",
          "created_utc": 1637886609.0
        }
      ]
    },
    {
      "id": "hm3nngv",
      "author": "saintmary23",
      "body": "thank u so much that means a lot 🥺🥺 im rlly nervous but hopeful for the first time in a long time<3",
      "created_utc": 1637888879.0,
      "score": 7,
      "context": [
        {
          "id": "hm3murn",
          "author": "Sareeee48",
          "body": "YAYYYY this is such a huge turning point for you and I am so proud of you! Keep going, even when it gets hard. We are all here rooting for you. ❤️",
          "created_utc": 1637888456.0
        }
      ]
    },
    {
      "id": "hm5wxtl",
      "author": "saintmary23",
      "body": "im really glad too :))) thank u so much for the kind words !! <3",
      "created_utc": 1637941290.0,
      "score": 1,
      "context": [
        {
          "id": "hm44n4a",
          "author": "kstocc",
          "body": "man this made me so emotional. i’m really glad that you were able to be somewhat happy with your family and let your body just do it’s thing",
          "created_utc": 1637897871.0
        }
      ]
    },
    {
      "id": "hm5wufn",
      "author": "saintmary23",
      "body": "thank u so much !!! update is today i ate waffles and brownies for breakfast and it was amazing. i also had cinnamon toast my dad made for me as a snack. the amount of hunger im experiencing is incredible !!! im struggling a lot mentally but im focusing on all of the improvements im already seeing from nourishing my body :)",
      "created_utc": 1637941246.0,
      "score": 5,
      "context": [
        {
          "id": "hm5okjv",
          "author": "None",
          "body": "Please give us an update tomorrow :) Fuck the ED, don't try to compensate for allowing yourself basic needs!",
          "created_utc": 1637937140.0
        }
      ]
    },
    {
      "id": "hm60vzj",
      "author": "None",
      "body": "YOU'RE AMAZING ❤️❤️❤️",
      "created_utc": 1637943091.0,
      "score": 2,
      "context": [
        {
          "id": "hm5okjv",
          "author": "None",
          "body": "Please give us an update tomorrow :) Fuck the ED, don't try to compensate for allowing yourself basic needs!",
          "created_utc": 1637937140.0
        },
        {
          "id": "hm5wufn",
          "author": "saintmary23",
          "body": "thank u so much !!! update is today i ate waffles and brownies for breakfast and it was amazing. i also had cinnamon toast my dad made for me as a snack. the amount of hunger im experiencing is incredible !!! im struggling a lot mentally but im focusing on all of the improvements im already seeing from nourishing my body :)",
          "created_utc": 1637941246.0
        }
      ]
    }
  ]
}