{
  "id": "rhr1fg",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1639662286.0,
  "title": "Been seeing this A LOT lately so here is your reminder",
  "selftext": "That this isn’t a dieting sub, so do not recommend dieting/cutting out food groups/restricting calories or weight loss here. Dieting/weight loss is *not* compatible with recovery. Even if you’re overweight, even if you’re a “normal” weight, and so on.\n\nIf that’s what you’re into, fine, you do you, but this is not the place to do it. Members are already struggling to listen to their bodies and nourish themselves, they don’t need y’all telling them that they should be eating less or differently or changing their body. Recovery requires you to eat according to your body’s hunger cues—yes, even BED and bulimia—and telling people to practice restraint  (such as “don’t keep binge food in the house!”) is damaging at best and just reinforces the concept that food is the reason we struggle so much, that it should be avoided. \n\nThanks for coming to my December TED talk!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rhr1fg/been_seeing_this_a_lot_lately_so_here_is_your/",
  "score": 82,
  "num_comments": 10,
  "comments": [
    {
      "id": "hoso7h9",
      "author": "Notreallysurebutidc",
      "body": "Thank you for this!!! I feel like we need a daily reminder on this sub 🙄",
      "created_utc": 1639671728.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hosjbjo",
      "author": "None",
      "body": "Hear, hear!",
      "created_utc": 1639669789.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hougyzx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1639697384.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hotalbt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1639680383.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hosvsie",
      "author": "Sareeee48",
      "body": "It goes through waves, but usually we are a lot better about it here. I’m constantly having to monitor posts because some of the advice people offer here is… not great lol.",
      "created_utc": 1639674665.0,
      "score": 8,
      "context": [
        {
          "id": "hoso7h9",
          "author": "Notreallysurebutidc",
          "body": "Thank you for this!!! I feel like we need a daily reminder on this sub 🙄",
          "created_utc": 1639671728.0
        }
      ]
    },
    {
      "id": "houilw5",
      "author": "Sareeee48",
      "body": "Hey thanks! I’ve honestly been thinking about coaching 😅",
      "created_utc": 1639698109.0,
      "score": 2,
      "context": [
        {
          "id": "hougyzx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1639697384.0
        }
      ]
    },
    {
      "id": "hotnbwe",
      "author": "None",
      "body": "your personal feelings abt your own choices don’t change the reality that weight loss and cutting out food groups is an absolute no-no in ed recovery. if an alcoholic went from binge drinking to having a glass of wine every saturday and felt hurt when ppl didn’t call him sober, it’s not other ppl’s problem.",
      "created_utc": 1639685382.0,
      "score": 13,
      "context": [
        {
          "id": "hotalbt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1639680383.0
        }
      ]
    },
    {
      "id": "hotjw97",
      "author": "Sareeee48",
      "body": "I entirely disagree. It borders both fatphobia and pro-ana/mia content which break the rules and it’s my job as a mod to make sure members feel safe here. The issue with “lose weight” on an ED sub is as follows:\n\n1. It implies that being overweight means you cannot be energy deficient and that’s entirely not true.\n\n2. It’s extremely dismissive of overweight people with EDs who need to be able to eat freely, and yes, even very likely gain weight, in order to recover. Only 6% of restrictive ED sufferers are underweight. If your ED has caused you to gain past your set point, restriction isn’t going to fix that; in fact, it’s going to make it exceptionally worse and lead to other negative health consequences. Plus, restricting actually *reinforces* binge urges, hense why a lot of BED treatments are beginning to be tailored around an intuitive eating and HAES friendly approach. I do agree with what you said about unintentional weight loss, i should have clarified when I said *intentional* weight loss isn’t compatible with recovery. And it’s not. If you fix your relationship with food and you naturally lose weight, as some people do, then this doesn’t apply to you. This is something that is frequently talked about in this sub so I didn’t think it needed clarification. My bad.\n\n3. If you are struggling with hormonal issues (as I have myself), restriction doesn’t fix them. Now you just weigh less with hormonal issues. And as someone who’s family struggles with insulin resistance and diabetes (and therefore I myself am at a higher risk for), losing weight doesn’t magically fix these things and there’s really no scientific basis that universally claims it does. In fact, exercise, and treatments that don’t fixate on weight as a whole, has been documented to manage these things a lot more effectively. Theres a reason more than 90% of all diets fail, and why virtually everyone who loses will gain more weight back than they initially lost.\n\n4. Even *if* intentional weight loss and restriction worked, EDs are extremely competitive disorders. You don’t know who you’re encouraging weight loss or food restriction to, or how damaging it can be to others reading the posts/comments and feeling invalidated in their disorder, like they aren’t good at having an ED and need to try harder (the way many atypical ED sufferers feel).\n\nI understand what you are trying to say, and your struggles are valid, but these are pretty specific instances that you are describing; the whataboutism you’re playing is irrelevant because you’re discussing an entirely different scenario to discredit my initial claim that encouraging dieting and intentional weight loss *while in ED recovery* is not okay. Yes, everyone’s recovery is different, but you should be focusing on nutritional rehabilitation (again, even if you have BED or bulimia) and healing your relationship with food and your body. Some people will end up fat and that’s entirely okay and is not synonymous to being unhealthy either (not to mention the science to prove otherwise just isn’t there). If you naturally lose weight in the process, sure. But I think it’s weird to seek out faults in my post, with nothing but hypotheticals and anecdotes, because you feel defensive.",
      "created_utc": 1639684044.0,
      "score": 12,
      "context": [
        {
          "id": "hotalbt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1639680383.0
        }
      ]
    },
    {
      "id": "hotnsns",
      "author": "lvl0rg4n",
      "body": "You're 100% wrong, friend.",
      "created_utc": 1639685564.0,
      "score": 0,
      "context": [
        {
          "id": "hotalbt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1639680383.0
        }
      ]
    },
    {
      "id": "hotey9y",
      "author": "Notreallysurebutidc",
      "body": "Yeah I feel yah, I love this sub but it happens accidentally now and then. I also made a similar post a couple months ago about people being borderline pro-ED.",
      "created_utc": 1639682091.0,
      "score": 7,
      "context": [
        {
          "id": "hoso7h9",
          "author": "Notreallysurebutidc",
          "body": "Thank you for this!!! I feel like we need a daily reminder on this sub 🙄",
          "created_utc": 1639671728.0
        },
        {
          "id": "hosvsie",
          "author": "Sareeee48",
          "body": "It goes through waves, but usually we are a lot better about it here. I’m constantly having to monitor posts because some of the advice people offer here is… not great lol.",
          "created_utc": 1639674665.0
        }
      ]
    }
  ]
}