{
  "id": "rommmc",
  "subreddit": "fuckeatingdisorders",
  "author": "TerrifyinglyAlive",
  "created_utc": 1640483826.0,
  "title": "For the first time in 23 years, I did not throw up on Christmas",
  "selftext": "I don’t feel particularly good, but I didn’t throw up. It’s something.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rommmc/for_the_first_time_in_23_years_i_did_not_throw_up/",
  "score": 158,
  "num_comments": 7,
  "comments": [
    {
      "id": "hpzcul4",
      "author": "keepmyheadabovewater",
      "body": "I’m proud of you! This is great and I appreciate you sharing. Merry Christmas 💚❤️",
      "created_utc": 1640485503.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hq0842q",
      "author": "OhCrumbs96",
      "body": "I hope you can silence the ED noise long enough to feel some pride in yourself, because this really is a huge achievement.\n\nIt's ok if you're not feeling ecstatic joy about it right now. You've made the most important first step - you managed to put a stop to that pattern of behaviour - hopefully next holiday you can build on this and feel some happiness and peace about this progress.",
      "created_utc": 1640506017.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hpzpjrm",
      "author": "OhNoOreos",
      "body": "Good job, I know that habit is hard to break especially one days like these. 💕",
      "created_utc": 1640492600.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hq05pzc",
      "author": "None",
      "body": "Fuck yeah! I get the mixed feelings, it’s hard and confusing and so many things. But we’re all out here rooting for you cause even if it doesn’t feel great it’s still a win!",
      "created_utc": 1640503927.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hq1b5ly",
      "author": "haleighhuman",
      "body": "It definitely is something!!! It’s a fucking win!!!!!! (Especially on Christmas?! Crazy awesome of you. The holidays are so stressful and triggering and yet you coped with those situations and took a step towards healing!! That’s amazing.)\n\nI hope you feel better soon. I hope you can celebrate your progress with pride and joy. You’re doing incredible!!",
      "created_utc": 1640534650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hq0ep3z",
      "author": "None",
      "body": "Periodt",
      "created_utc": 1640512168.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hq3apjk",
      "author": "selkieflying",
      "body": "Holy shit congrats!!",
      "created_utc": 1640567530.0,
      "score": 2,
      "context": []
    }
  ]
}