{
  "id": "rqocna",
  "subreddit": "fuckeatingdisorders",
  "author": "Fuzzy_sleep",
  "created_utc": 1640721919.0,
  "title": "Recovering into an overweight body",
  "selftext": "To all the people who are recovering/ have recovered into an overweight body, can you drop a comment so I can see more of us exist?See, I feel kinda alone in a way. I see lots of comments on how it’s common to recover into an overweight body, including overweight by (stupid) BMI standards and people who are classed as plus size. Yet, all the recovery influencers I see are always still super thin and look malnourished, yet are like “recovery’s so worth it I feel so great and happy in my body hehe!!!” Now I’m definitely not saying that recovering into a smaller body is wrong or anything, people are naturally petite and I get all that. But I just don’t wanna feel like I’m the only person who has recovered from an ED and recovered into a larger body. I would rather be in a bigger body and happy than in a smaller body and miserable/sick. But if other people could say, like, “hey! I recovered into a larger body! I exist!” Just so I know that I’m not the only one chilling over here then I would really appreciate it. This post is kinda stupid really but I just wanna feel like theres other people who are the same and understand me :’)\n\n&#x200B;\n\nEDIT: thank you all so so much for the comments!!! You have all made me feel so happy and so grateful. I’m so glad I chose recovery. Now I don’t feel alone anymore, there’s so many of us in the same boat. Thanks for the comments, I’ve read every single one and they’ve made me feel so positive <33333",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rqocna/recovering_into_an_overweight_body/",
  "score": 131,
  "num_comments": 53,
  "comments": [
    {
      "id": "hqbmrr5",
      "author": "PMKG",
      "body": "Gained a fuck ton of weight. Its been rlly hard cuz I see those “in recovery” girls on TikTok with bodies still considered skinny. Yet i no longer fit that standard. It’s disheartening, but I’m here.",
      "created_utc": 1640724336.0,
      "score": 78,
      "context": []
    },
    {
      "id": "hqcbydl",
      "author": "Sareeee48",
      "body": "Tbh thank you for this post, it is exactly what I needed. I was *just* crying about how much weight I’ve gained. Idk what my weight is precisely, but I went from relatively underweight to overweight in the span of less than a year (according to my physical back in January 2021, didn’t read the weight but it said BMI: high), and I continued to gain for at least another 3 months beyond that. I feel super embarrassed because preED I was within the “nOrMaL” BMI range and now I’ve overshot (for lack of a better term), and it is something I’m really struggling with despite how hard I advocate for fat acceptance, etc. but I am trying so hard to work on that. I wish it was talked about more.",
      "created_utc": 1640734859.0,
      "score": 39,
      "context": []
    },
    {
      "id": "hqbxnwe",
      "author": "EtherealWaifGoddess",
      "body": "You’re not alone!! I’m plus size and have recovered before after shrinking down into non plus sizes. It’s a little upsetting, ngl, but it’s still worth it. I’ve relapsed again now but I know that just based on my own body and my family history that no matter how small I get the odds are when I eventually go through recovery again I’ll be back in a plus size.",
      "created_utc": 1640728809.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hqc2vmz",
      "author": "mermaidmagick",
      "body": "I'm probably considered \"obese\" now but I am much happier and healthier now than I was before.  You're not alone, I'm here too!",
      "created_utc": 1640730975.0,
      "score": 26,
      "context": []
    },
    {
      "id": "hqc01qn",
      "author": "Fuzzy_sleep",
      "body": "Thanks so much everyone who’s commented. I really appreciate it and we’re all in this together <3333",
      "created_utc": 1640729796.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hqd9yjc",
      "author": "babysfirstreddit_yx",
      "body": "Oh, we're here. I gained a massive of weight >!(like, precariously close to triple-digits)!< and am now firmly in the >!obese!< bmi category. It has been extremely difficult and has high-key sucked to be so acutely aware of how far away I am from any standard of beauty. Mentally, I still feel so much better and honestly wonder I ever survived my old mindset. But, I hold a HUGE amount of shame about my body and \"what I've done to it/myself\". I also barely have any clothes and finding a bra is now basically impossible so I just live in constant discomfort in that area lol. I just try not to look at myself too closely anymore and have resigned myself to the idea of \"body respect/body neutrality.\" - it's probably the best I'll be able to do at this point in my life. I always dreamed of the day I would actually like and feel comfortable with how I look but I just don't see that happening anymore.  Long story short my fear seems to have become my reality and while it certainly isn't fun I'm surviving okay all in all.",
      "created_utc": 1640750357.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hqbvvqb",
      "author": "ForestRagamuffin",
      "body": "i'm here! my lw wasn't thin and i'm sure not thin now. my body is meant to be kinda chubby and i'm tryna be at peace with it (and some days i succeed!). this is just the shape my body wants to be and physically it feels good (emotionally, it is sometimes hard). i feel strong and powerful. anyway, i exist and i see you!",
      "created_utc": 1640728077.0,
      "score": 25,
      "context": []
    },
    {
      "id": "hqd096m",
      "author": "honeycakies",
      "body": "When I initially overshot, I was extremely close to overweight (literally over twice my LW). I’ve been back to my pre-ED weight range for quite a while now, but was above it for years so I felt rly alone and shocked after my weight gain too. I’m glad to see a bit more recognition of those who don’t immediately weight restore into a borderline UW BMI and effortlessly maintain that — I feel like almost nobody brought this up a few years ago out of shame.",
      "created_utc": 1640745773.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hqdsf6b",
      "author": "oogiebuns",
      "body": "I’m here!! I’ve been “overweight” my whole life and I’ve always seen something wrong with that. This is the first time in my life I’m much more accepting of the fact that my body isn’t meant to be thin. The only way that’s possible or even happened before was all through my ED. It’s just not meant to be. I’m happy, healthy, and most importantly strong. It’s definitely disheartening to see those who recover into a societally acceptable body compared to my own but I try to look at the benefits. Having a healthier mind this time around, back in the body I used to despise, has made me realize there was never anything wrong with me to begin with. \n\nSending happiness to everyone here!! And you OP for this post",
      "created_utc": 1640760906.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hqdhtcp",
      "author": "None",
      "body": "I’ve been in recovery for nearly 2 years. I am at the highest weight I’ve ever been. To cope, I remind myself I would take this situation over being so sick I couldn’t even function 1000x over.",
      "created_utc": 1640754419.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hqe6icq",
      "author": "reunitedthrowaway",
      "body": "I recovered to overweight. I had to revere myself like I did other overweight bodies. It wasn't difficult. I still have thoughts of going back at my worst points. But most of the time I can manage to think my body is fine and it's society that is wrong",
      "created_utc": 1640771849.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hqdnkgw",
      "author": "mar_ivy15",
      "body": "Dude I was literally just talking about this with my therapist last week. I was saying how I feel like I’m recovering wrong because everyone I see is still so small and I’ve gotten big.",
      "created_utc": 1640757726.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hqfkf3k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640798647.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hqbj3sj",
      "author": "cassandygee",
      "body": "🙋🏻‍♀️ \n\nWent up 2 sizes yet feel better than I did when 2 sizes smaller. I was already at the highest part of my BMI when 2 sizes smaller (I have always had a lot of muscle) so am definitely considered overweight by both BMI and societal standards now.",
      "created_utc": 1640722838.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hqc0z5g",
      "author": "Emergency-Parsley-51",
      "body": "Here! When I was taking antidepressants for GAD and my usual corticosteroids for rhinitis and astma, I developed Cushing's syndrome, so I gained quite a lot of weight extremely fast and when you have it, you can't lose weight even with the gratest deficit. And all of this while also having an ED, that I was denying so hard having. So all my fears were becoming a reality. But I got to a point where I couldn't take any more of weighing food, counting calories precisely, thinking about food so much, thinking I'm a total failure because I'm not skinny, so I started recovery. It was a quasi-recovery at first, but after a pretty bad relapse, I decided to start real recovery. And I'm so glad I did it. Even when I was at my worst and before having Cushing's, I was never underweight. I was eating next to nothing and I was still only at a \"healthy weight\" on the BullshitMI. Genetically, I was never meant to be skinny either, but thanks to diet culture and misinformation, I thought that I can simply change that by eating very little all my life and I never thought that it can have any health consequences. You can tell the level of mental health awareness in my country :)). It really helps to know there are other overweight people that are recovering from an ED and I know there are so many, but due to stigma and social media it seems like an oddity. I hope it will change and everyone, regardless of their weight, are worthy of recovery and deserves good mental and physical health.",
      "created_utc": 1640730177.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqcdvw3",
      "author": "jaysxiu",
      "body": "Yes. I’m back in a body that I used to hate, but now I don’t mind. At the end of the day, I like to see the weight even though sometimes the mirror disheartens me. But, I have to constantly remind myself of where I once was and how it’s a place I never want to be again. That i’m treating my body with kindness and nourishment. This stuff isn’t easy, you’re definitely not alone. ♡ Stay strong",
      "created_utc": 1640735694.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqcfk62",
      "author": "Cuglas",
      "body": "Yes, I'm here.",
      "created_utc": 1640736428.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqdo3cx",
      "author": "croutonsinmycoffee",
      "body": "Yes, hi I have also recovered into an overweight body by BMI standards although I personally feel good about myself and where I am (been working on recovery for 8 years)",
      "created_utc": 1640758046.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqf0v9t",
      "author": "jellyfishfresh",
      "body": "I've gained quite a bit of weight since starting recovery. Some days it's really really hard because I'm getting better, but society sees this as \"giving up\" or \"letting myself go\". \nBut I feel better! I'm not hungry and dizzy all the time! I don't have constant headaches, among other things. \nI'm working very hard to love my body as it is, and I hope you are able to do that too. I know it's hard, but you're doing a good thing.",
      "created_utc": 1640790725.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hqci55z",
      "author": "standsure",
      "body": "Checking in. \n\nFat and happy.",
      "created_utc": 1640737572.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hqcy1h8",
      "author": "None",
      "body": "I have struggled for over a decade and havent been underweight or even a normal weight since i was 16.\n\nHonestly i dont like the way my body looks and i dont think i ever will. It doesnt matter to me any more (except on days that it does, and thats okay too). My body is meant to do more than look pretty. I wont fight it any more.",
      "created_utc": 1640744750.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqewm24",
      "author": "Throwaway1284738595",
      "body": "Thanks OP for asking this question.  Trying to commit to recovery knowing that I will return to my previously “overweight/obese” body.  I’ve been overweight all my life and only got thin through this life-destroying disorder.  I know I’m not meant to be thin, but when you see so many happily recovered tiny thin girls are pretty much the only standard of successful recovery, it can be hard to know that definitely won’t be you and to try to do it anyway.  So thanks everyone!  You give me hope that I can get there too!",
      "created_utc": 1640788790.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqg6r5j",
      "author": "moripeji",
      "body": "yuuuup, right here with ya! started underweight, now borderline obese. all in the span of five months. 🙃",
      "created_utc": 1640807241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hqcc2hk",
      "author": "LemonLozenge777",
      "body": "I think technically I am now but I don’t know bc no scales! But after 14 years im like oh my god wearing a larger size and just eating meals has got to be better than the ED!!!! Like I couldn’t stay that size and be healthy, wasn’t meant to be. It is hard!!! But i would back you or anyone else up and so I know I should for myself too!!",
      "created_utc": 1640734909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hqcplgm",
      "author": "PreservativeAloe",
      "body": "Yes das meeee!",
      "created_utc": 1640740899.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqd78py",
      "author": "fluorescent-adult",
      "body": "Sounding in!!",
      "created_utc": 1640749042.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqdxy8m",
      "author": "whatuptoke",
      "body": "I’ve had …disordered eating habits… since I was 12. I don’t really feel worthy of saying I’ve had a real ED since it was never that serious, and also I have no excuse I eat like shit and refuse to workout. I am constantly dieting though. Been on so many throughout my life. This year I finally said… enough is enough. Just stopped caring what my body looked like and just ate until I was happy and actually checked myself and realized sometimes I wasn’t hungry. I’m at my highest weight ever and for some reason I feel rather confident. 🥺 I might even wear a bra as a shirt for New Years… which is BIG for me. I’ve never worn anything even remotely revealing before, never worn a crop top or really any tight clothing except pants that suck you in ha. I have always worn baggy oversized clothes because I’m so afraid of people “knowing” that I’m fat? Isn’t that ridiculous. Like I’ve somehow pulled off a facade that I don’t have an extremely unattractive stomach. Or at least I think I have. :/ I’m literally always scared when I meet someone new “what if they think I’m fat”. I’m so… so so tired. But feeling confident enough to want to wear a bra in public is absolutely insane to me, so it feels like things are on the up and up. Especially when I’m ~20 lbs heavier than I was at the end of last year :(\n\nTake care <3 you’re not alone",
      "created_utc": 1640765006.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hqeeugg",
      "author": "Catcatcitybitty",
      "body": "Hi! I'm here too! Borderline overweight/obese and it was super hard for a while but ultimately (solidly in recovery now) i actually like myself and my body now more than I ever did when I was underweight. I tried to distract myself from my body by throwing myself into new things like friends and new hobbies. As a result, I reached body neutrality, amazing new friendships/stronger old friendships, found a new hobby, got a puppy to keep me busy, and ended up quitting my soul sucking desk job to be a dog trainer apprentice. So many things I was always waiting to do until I was thin enough and it turns out I could do all those things and more in a larger body. It gave me a sense of confidence with friends and dating to know that I never needed to be thin in the first place - people like me for me. If i hadn't gotten to a larger body, I'd probably always wonder if it was thin privilege or me that got me to where I am.",
      "created_utc": 1640778369.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hqgikdq",
      "author": "None",
      "body": "🙋🏻‍♀️ it’s not easy to recover in a fat body in such a fatphobic society, but it’s much harder to slowly die.",
      "created_utc": 1640811791.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqi1raf",
      "author": "a0172787m",
      "body": "I'm recovered and considered 'obese' by the medical industry (both before and after my ED) but I live such a full life now compared to when I was deep in my ED, there's just so many parts of myself I've come to embrace and enjoy and reclaim through recovery! Sure, dating and medical stuff and anything that involves superficial judgement in the beginning is hard but I've learned to see it as a kind of filter for people who I wouldn't want in my life anyway. Feel free to look at my comment history on this subreddit if it helps!",
      "created_utc": 1640835084.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hqd5a5q",
      "author": "crycry_chemtrails",
      "body": "Hey! I’m in the same boat",
      "created_utc": 1640748105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqfviff",
      "author": "essentialimperial",
      "body": "thank you so much for this post! I needed to read that today!",
      "created_utc": 1640802897.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqc7nf3",
      "author": "Goth_Lizard",
      "body": "Hey, not technically overweight, but definetly not in a nice thin body. I carry weight in my stomach, and was considered quite chubby. I lost all the weight and got to underweight status, not a healthy weight for me at all.\n\nI’m recovering now and gained a lot in my tummy face and boobs. I know I’ll likely go back to the same physique and I’m sad but I know I have too. Trying to tackle my internalized fat phobia has been tough, but I’m doing some work.",
      "created_utc": 1640732990.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqbtsdh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640727216.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyxr3nw",
      "author": "Minik_Gulen",
      "body": "Hello, how are u now?",
      "created_utc": 1732556420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqbro73",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1640726347.0,
      "score": -7,
      "context": []
    },
    {
      "id": "hqbvis5",
      "author": "ThR0wnAway_x52495",
      "body": "Same! I’m here whether I like it or not lol no but for real I’m so proud of all of you <3",
      "created_utc": 1640727927.0,
      "score": 11,
      "context": [
        {
          "id": "hqbmrr5",
          "author": "PMKG",
          "body": "Gained a fuck ton of weight. Its been rlly hard cuz I see those “in recovery” girls on TikTok with bodies still considered skinny. Yet i no longer fit that standard. It’s disheartening, but I’m here.",
          "created_utc": 1640724336.0
        }
      ]
    },
    {
      "id": "hqed0yo",
      "author": "Fuzzy_sleep",
      "body": "When a mod says thank you for a post…. I feel like I’ve been blessed by a god haha",
      "created_utc": 1640776999.0,
      "score": 15,
      "context": [
        {
          "id": "hqcbydl",
          "author": "Sareeee48",
          "body": "Tbh thank you for this post, it is exactly what I needed. I was *just* crying about how much weight I’ve gained. Idk what my weight is precisely, but I went from relatively underweight to overweight in the span of less than a year (according to my physical back in January 2021, didn’t read the weight but it said BMI: high), and I continued to gain for at least another 3 months beyond that. I feel super embarrassed because preED I was within the “nOrMaL” BMI range and now I’ve overshot (for lack of a better term), and it is something I’m really struggling with despite how hard I advocate for fat acceptance, etc. but I am trying so hard to work on that. I wish it was talked about more.",
          "created_utc": 1640734859.0
        }
      ]
    },
    {
      "id": "hqg1bd5",
      "author": "Fuzzy_sleep",
      "body": "“There was never anything wrong with me to begin with”\n\nbro, *that.* That sums up it all.",
      "created_utc": 1640805129.0,
      "score": 6,
      "context": [
        {
          "id": "hqdsf6b",
          "author": "oogiebuns",
          "body": "I’m here!! I’ve been “overweight” my whole life and I’ve always seen something wrong with that. This is the first time in my life I’m much more accepting of the fact that my body isn’t meant to be thin. The only way that’s possible or even happened before was all through my ED. It’s just not meant to be. I’m happy, healthy, and most importantly strong. It’s definitely disheartening to see those who recover into a societally acceptable body compared to my own but I try to look at the benefits. Having a healthier mind this time around, back in the body I used to despise, has made me realize there was never anything wrong with me to begin with. \n\nSending happiness to everyone here!! And you OP for this post",
          "created_utc": 1640760906.0
        }
      ]
    },
    {
      "id": "hqfvj8t",
      "author": "Sareeee48",
      "body": "This is an great perspective to have ❤️",
      "created_utc": 1640802905.0,
      "score": 2,
      "context": [
        {
          "id": "hqe6icq",
          "author": "reunitedthrowaway",
          "body": "I recovered to overweight. I had to revere myself like I did other overweight bodies. It wasn't difficult. I still have thoughts of going back at my worst points. But most of the time I can manage to think my body is fine and it's society that is wrong",
          "created_utc": 1640771849.0
        }
      ]
    },
    {
      "id": "hqg0ivt",
      "author": "Fuzzy_sleep",
      "body": "Thats so true: “ Choosing recovery while in a larger body is hard because folks don’t understand why you’re deliberately eating and getting larger”. That’s the problem a lot of us have to face, but it’s just society being narrow minded and part of recovery is rising above that stupid society mindset and accepting us for who we are",
      "created_utc": 1640804820.0,
      "score": 11,
      "context": [
        {
          "id": "hqfkf3k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640798647.0
        }
      ]
    },
    {
      "id": "hqcqut4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640741467.0,
      "score": 2,
      "context": [
        {
          "id": "hqci55z",
          "author": "standsure",
          "body": "Checking in. \n\nFat and happy.",
          "created_utc": 1640737572.0
        }
      ]
    },
    {
      "id": "hqg11f1",
      "author": "Fuzzy_sleep",
      "body": "That’s so true! I used to think, “people will only like me if I’m thin. If I was bigger, these people wouldn’t be friends with me”. I even thought I only got a job at one point because I was thin. Turns out I’m way more happier and bubblier now and have more friends, and they like me for who I am. So I was completely wrong",
      "created_utc": 1640805020.0,
      "score": 3,
      "context": [
        {
          "id": "hqeeugg",
          "author": "Catcatcitybitty",
          "body": "Hi! I'm here too! Borderline overweight/obese and it was super hard for a while but ultimately (solidly in recovery now) i actually like myself and my body now more than I ever did when I was underweight. I tried to distract myself from my body by throwing myself into new things like friends and new hobbies. As a result, I reached body neutrality, amazing new friendships/stronger old friendships, found a new hobby, got a puppy to keep me busy, and ended up quitting my soul sucking desk job to be a dog trainer apprentice. So many things I was always waiting to do until I was thin enough and it turns out I could do all those things and more in a larger body. It gave me a sense of confidence with friends and dating to know that I never needed to be thin in the first place - people like me for me. If i hadn't gotten to a larger body, I'd probably always wonder if it was thin privilege or me that got me to where I am.",
          "created_utc": 1640778369.0
        }
      ]
    },
    {
      "id": "hqc8n1f",
      "author": "Sareeee48",
      "body": "Hi, i just want to point out that eating a lot when in recovery is very normal. Most people with restrictive EDs say they have developed binge eating when they are actually experiencing extreme hunger and end up at a higher BMI than they are psychologically comfortable with. I’m not saying you don’t have BED, but I think it’s worth reflecting on if you binge to self soothe/ distract from emotional triggers or due to restriction (oftentimes it’s due to restriction, whether that’s mental, physical, or both). OP is talking about people who wound up overweight *after* recovery from a restrictive ED, not those who are in an overweight body because of binging.",
      "created_utc": 1640733418.0,
      "score": 4,
      "context": [
        {
          "id": "hqbtsdh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727216.0
        }
      ]
    },
    {
      "id": "hqbv82i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640727804.0,
      "score": 7,
      "context": [
        {
          "id": "hqbtsdh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727216.0
        }
      ]
    },
    {
      "id": "hqbwmur",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640728391.0,
      "score": 16,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        }
      ]
    },
    {
      "id": "hqc9cpw",
      "author": "Sareeee48",
      "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
      "created_utc": 1640733728.0,
      "score": 10,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        }
      ]
    },
    {
      "id": "hqccmls",
      "author": "PMKG",
      "body": "Proud of u too!! Sending u lots of love and I wish u the best ❤️❤️❤️❤️",
      "created_utc": 1640735150.0,
      "score": 7,
      "context": [
        {
          "id": "hqbmrr5",
          "author": "PMKG",
          "body": "Gained a fuck ton of weight. Its been rlly hard cuz I see those “in recovery” girls on TikTok with bodies still considered skinny. Yet i no longer fit that standard. It’s disheartening, but I’m here.",
          "created_utc": 1640724336.0
        },
        {
          "id": "hqbvis5",
          "author": "ThR0wnAway_x52495",
          "body": "Same! I’m here whether I like it or not lol no but for real I’m so proud of all of you <3",
          "created_utc": 1640727927.0
        }
      ]
    },
    {
      "id": "hqg4jss",
      "author": "Sareeee48",
      "body": "Lmao this made laugh 😂",
      "created_utc": 1640806384.0,
      "score": 4,
      "context": [
        {
          "id": "hqcbydl",
          "author": "Sareeee48",
          "body": "Tbh thank you for this post, it is exactly what I needed. I was *just* crying about how much weight I’ve gained. Idk what my weight is precisely, but I went from relatively underweight to overweight in the span of less than a year (according to my physical back in January 2021, didn’t read the weight but it said BMI: high), and I continued to gain for at least another 3 months beyond that. I feel super embarrassed because preED I was within the “nOrMaL” BMI range and now I’ve overshot (for lack of a better term), and it is something I’m really struggling with despite how hard I advocate for fat acceptance, etc. but I am trying so hard to work on that. I wish it was talked about more.",
          "created_utc": 1640734859.0
        },
        {
          "id": "hqed0yo",
          "author": "Fuzzy_sleep",
          "body": "When a mod says thank you for a post…. I feel like I’ve been blessed by a god haha",
          "created_utc": 1640776999.0
        }
      ]
    },
    {
      "id": "hqd8go9",
      "author": "standsure",
      "body": "Look, I was thrilled to be able to eat and not be suicidal. Anything on top of that was a huge bonus. \n\nIt's easy for me to forget how far I've come. Thanks for your question.",
      "created_utc": 1640749627.0,
      "score": 5,
      "context": [
        {
          "id": "hqci55z",
          "author": "standsure",
          "body": "Checking in. \n\nFat and happy.",
          "created_utc": 1640737572.0
        },
        {
          "id": "hqcqut4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640741467.0
        }
      ]
    },
    {
      "id": "hqc4rps",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640731771.0,
      "score": 1,
      "context": [
        {
          "id": "hqbtsdh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727216.0
        },
        {
          "id": "hqbv82i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727804.0
        }
      ]
    },
    {
      "id": "hqc89q4",
      "author": "Goth_Lizard",
      "body": "Agreed. This sounds more like a “long term recovery in the future ideal” than a good idea for someone jumping into all in. \n\nAlso, just pointing out, loads of plus sized people DO eat extremely balanced, nutritious meals and limit calorie dense foods (not in a restrictive way) and many thin people (who struggle with EDs or not) eat many high density foods. You can’t TELL what someone in recovery is eating, or outside of recovery is eating by their size. I suggest you research set point weight theory.",
      "created_utc": 1640733260.0,
      "score": 8,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqbwmur",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640728391.0
        }
      ]
    },
    {
      "id": "hqcyw59",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1640745144.0,
      "score": 0,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqc9cpw",
          "author": "Sareeee48",
          "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
          "created_utc": 1640733728.0
        }
      ]
    },
    {
      "id": "hqc8uwh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640733515.0,
      "score": 2,
      "context": [
        {
          "id": "hqbtsdh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727216.0
        },
        {
          "id": "hqbv82i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640727804.0
        },
        {
          "id": "hqc4rps",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640731771.0
        }
      ]
    },
    {
      "id": "hqd675y",
      "author": "Sareeee48",
      "body": "I understand set point well, and out of all of the extensive research I have done and throughout the conversations I had with my previous therapist who was also specialized in EDs, I have never once heard of what you’re talking about. Set point is a range of 5-20 lbs, yes, but it doesn’t simply change because you are more active and decide to “eat in moderation” (another word for restriction imo), if that were true 94% of diets wouldn’t fail, nor would individuals gain back all their weight and then some, because they’d be able to manipulate their set point. Whether or not you intended it as such, you are implying that making physical changes is a “lifestyle” that directly influences your set point and that’s literally why most of us are in recovery—because we put too much emphasis on our physical bodies and the food we put into it. Set point is affected by many things, from our environment to our physical and psychological well being, but the range is just a safety net, you can’t just decide you wanna weigh 20 lbs less. And as someone who is extremely active and eats according to my hunger, I don’t weight less because I go to the gym or work an active job.\n\nI’m not saying your treatment team is full of shit but treatment centers have a long history of being fatphobic, even in subtle ways, and many do not understand or even accept set point, and if they so accept it they believe it is something that can be manipulated to achieve thinness. So I’m sorry if I’m not really impressed with your therapist’s opinion. Maybe I *did* misinterpret your comment, but I’m still left feeling like you and your team are excusing restriction and manipulating your body based on set point being within a range and I just think that’s… really weird for ED specialists to encourage. Also, saying individuals weigh more because their less active and eat “bad” food *is* fatphobia. Don’t really know how it’s not.",
      "created_utc": 1640748544.0,
      "score": 5,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqc9cpw",
          "author": "Sareeee48",
          "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
          "created_utc": 1640733728.0
        },
        {
          "id": "hqcyw59",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640745144.0
        }
      ]
    },
    {
      "id": "hqdmkrf",
      "author": "None",
      "body": "(1/2 because I wrote too much sorry): \n\nYeah I think you definitely did misinterpret a bit of my original comment! I don’t mean to sound rude I’m sorry I’m just trying to get my point across :) \n\nI agree with you about set point that it’s biological and doesn’t change just because someone’s more active and you are right that 94% of diets fail, because the body is very resilient and tries it’s best to hold on to the weight it feels and functions best at; so if someone loses a lot of weight by extreme restriction on a harsh diet, then when they go off the diet their hunger cues will likely ramp up substantially and they will likely as a result eat a lot more in order to listen to that hunger, that’s the body’s way of restoring that energy deficit. So then they often will regain some or all of the weight they lost (and then some sometimes). The body also tries to conserve energy and maintain its set point when faced with extreme calorie restriction by slowing down the metabolism, making you cold all the time, making you tired and brain foggy so you don’t spend precious energy on thinking when it needs those calories to keep the organs running and maintain homeostasis. Etc.—so I totally get what you are saying about set point and I agree with it :)\n\nWhat I meant was, when I was talking with my therapist about the set point theory and how I was so scared it would make me gain weight, we worked through those fears. Because she doesn’t want me to continue restricting so extremely and living in fear controlled by an ed, when there is no way that I even know what would happen when I eat/in recovery if I do not actually even do it. She wasn’t coming at it from a diet culture lens or fat phobia (she operates on the Health At Every Size/HAES model and has brought up dismantling and working on my fear of getting fat, so she is very much not fatphobic). What we talked about was, set point isn’t an end all be all for weight. It’s a range (like you said, of 5-20 lb) where your body naturally gravitates to and settles at when you’re not actively restricting foods you want or crave or need, or forcing yourself to do excessive exercise you don’t enjoy. At the end of the day, the law of thermodynamics still applies and works with set point theory, where an individual’s lifestyle absolutely influences one’s weight *to a degree* (I used the room influences very intentionally here, *not* defines—I think maybe that’s where my point my have been misunderstood, for I simply meant that set point is a *function* of a complex array of factors: genetics and biology, yes, but also taking into account the natural lifestyle and food intake of the individual. I’ll give an example of what I meant: if two identical twins are born and separated at birth adopted to different families, and one grows up being raised really active, maybe running is a hobby they enjoy and they generally eat lots of whole foods and fruits and vegetables and whole grains, maybe they don’t have much of a sweet tooth but they love eating a slice of cake or two when they feel like it, and stop when they no longer crave it, even if that means not finishing what’s on their plate or leaving the piece of cake to finish at a later time when they’re in the mood again. Let’s say the second twin grows up in a different family, one that is naturally less sporty and doesn’t ingrain the love of running/camping/skiing/etc in that person (my family is like this for example, I always would ask my parents if we could do something fun like go on a walk or hike when I was a kid and they’d be like nah that’s boring. I was so jealous of my friends who went out and did things with their families and who got to go on exciting ski trips and run 5Ks together. It seemed so fun to me and whenever I got a small taste of it, like when I was able to convince my parents to doing a partial little 5K walk with me when I was like 12, I had so much fun but they didn’t find it as fun and didn’t want to do it again). Maybe that family is stretched on a tighter income and has to rely on cheaper fast foods to feed their family, maybe fresh fruits are too expensive so the individual instead snacks on what is available in the household, cheaper snacks like chips for example. Maybe they simply have more of a sweet tooth and to them, unrestricted eating means eating a slice of cake everyday which the first individual would have not craved because they simply weren’t much of a sweets person, so *their* unrestricted eating means eating that slice of cake on a less frequent basis. The key point I was trying to make here, is that *both* of these individuals are experiencing their own *versions* of unrestricted and intuitive eating, and engaging in whatever activity and lifestyles feels most comfortable to them (ie if hiking and running 5Ks is something you enjoy, yay! But if it’s not, that’s so totally completely okay too and more joyful movement is what’s natural and healthy for that person). In this scenario, both of the twins are genetically identical in terms of *biological* set point, in which case their natural metabolic function and the amount of calories their body requires as energy to maintain homeostasis are roughly the same range. But because of the fact that set point is not *purely* biological but *also* FURTHER a function of lifestyle and diet factors, the first twin will likely weigh less than the second one; or perhaps more, seeing as muscle weighs more than fat...what I meant is that the first one might appear more conventionally “healthy” and socially acceptable in terms of body weight in today’s diet culture obsessed society, whereas the second one might be in a comparatively larger body that society judges as less “healthy” and “overweight” by arbitrary bmi standards. Both of these individuals have the same biological set point but because they also have vastly different lifestyles (one very active naturally, not out of the intention to control their weight but simply out of pure joy and love for being active, one much more sedentary, not because they are “lazy” or “unhealthy” but simply because, like my parents I discussed earlier, they don’t enjoy vigorous activity as much, and prefer to live less active lifestyles that align with what they find joy in). On the diet end, both twins are eating what they feel best eating/listening to their body and cravings and/or within the social and financial constraints they exist within. The first twin is simply consuming what they prefer, and the family generally eats whole foods and fruits and vegetables often, because they are fortunate enough to afford it and they find that that is what they crave and feel the best eating. The second twin is also simply consuming what they prefer, but because they have a natural sweet tooth they eat more foods that are objectively higher in calories and fat and sugar (NOT saying that any of that is bad. Calories are necessary, fat is necessary, sugar is a carbohydrate and that is the main macronutrient your body and brain runs off of. What I mean here is that it is in a larger quantity due to that individual’s dietary preferences than the first twin, comparatively speaking). (I also want to interject this scientific article here: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5781054/#s1title which studies how “people with lower income are more vulnerable to obesity, the framework of social determinants of health indicates that material conditions confine one’s access to healthy food and healthcare, while also influencing health-related behaviours (ie, dietary behaviours and physical activity).” —I don’t mean obesity in terms of diet culture judgment and fatphobia, but am simply restating a quote from a scientific article in order to add depth to my point about how lifestyle and social factors can absolutely influence one’s weight, such as if one is constrained by their budget to rely only on processed and packaged and fast foods).",
      "created_utc": 1640757121.0,
      "score": -3,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqc9cpw",
          "author": "Sareeee48",
          "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
          "created_utc": 1640733728.0
        },
        {
          "id": "hqcyw59",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640745144.0
        },
        {
          "id": "hqd675y",
          "author": "Sareeee48",
          "body": "I understand set point well, and out of all of the extensive research I have done and throughout the conversations I had with my previous therapist who was also specialized in EDs, I have never once heard of what you’re talking about. Set point is a range of 5-20 lbs, yes, but it doesn’t simply change because you are more active and decide to “eat in moderation” (another word for restriction imo), if that were true 94% of diets wouldn’t fail, nor would individuals gain back all their weight and then some, because they’d be able to manipulate their set point. Whether or not you intended it as such, you are implying that making physical changes is a “lifestyle” that directly influences your set point and that’s literally why most of us are in recovery—because we put too much emphasis on our physical bodies and the food we put into it. Set point is affected by many things, from our environment to our physical and psychological well being, but the range is just a safety net, you can’t just decide you wanna weigh 20 lbs less. And as someone who is extremely active and eats according to my hunger, I don’t weight less because I go to the gym or work an active job.\n\nI’m not saying your treatment team is full of shit but treatment centers have a long history of being fatphobic, even in subtle ways, and many do not understand or even accept set point, and if they so accept it they believe it is something that can be manipulated to achieve thinness. So I’m sorry if I’m not really impressed with your therapist’s opinion. Maybe I *did* misinterpret your comment, but I’m still left feeling like you and your team are excusing restriction and manipulating your body based on set point being within a range and I just think that’s… really weird for ED specialists to encourage. Also, saying individuals weigh more because their less active and eat “bad” food *is* fatphobia. Don’t really know how it’s not.",
          "created_utc": 1640748544.0
        }
      ]
    },
    {
      "id": "hqdmn4t",
      "author": "None",
      "body": "(2/2):\n\n\nSo in my scenario example, the law of thermodynamics holds true where the second twin will likely be in a larger body than than that of the first twin simply because that second twin is taking in more calories than the first twin in terms what they naturally require, seeing that both twins have the same biological and genetic set point in terms of what their bodies require to function), as well as burning less calories in terms of the everyday lifestyles and activity levels they prefer and feel happiest doing. \n\nIs either twin “better”? Is the former living in a restricted, malnourished body? Is the latter living in an “overweight”, unhealthy, lazy body? *No*. \n\nBoth twins are living lives of balance in which their weight is, yes, influenced by genetic biological set point, but *also* simultaneously influenced by their lifestyle and dietary factors. \n\nThis is what I meant by your body *balances out* to its weight *not only* out of biology and genetics, but *also* out of lifestyle and activity factors. Both twins are *at* their set point, if you consider that they are living their normal lives and not actively restricting or controlling or suppressing their weight/bodies. BUT despite the identical nature of their genetics, their weights are different because of the fact that set point weight and one’s body is not ONLY influenced solely by genetics but also by lifestyle and dietary preferences and social environments and a complex array of factors. \n\nNeither twin is “healthier” or better than the other. They are simply existing in different lives and their respective bodies have balanced out to a weight that aligns with their energy intake/consumption and activity levels/lifestyles. \n\n\nSo that’s what I meant, I’m sorry this scenario is so long but I really wanted to try to explain my thoughts in a way that would make sense from an outside perspective. I definitely never intended to be fatphobic by any means, and I’m sorry if my original comment came off in that way. I simply was trying to explain my point that a post like OP’s ignites a lot of fear in people with restrictive eds like me, and it’s the idea of being “doomed” by set point and biology to inevitably gain weight that petrifies me to the point that I have refused recovery for so long, out of fear. So when I spoke to my therapist and doctor and dietitian about my fears of set point, *this* is the scenario that alleviated my fear and helped me understand set point to a more nuanced degree and the idea that your body *knows what it’s doing* when it eats food, and your *individual* habits and lifestyle *still* affects your weight and your individual set point, in CONJUCTION with biology and genetics. \n\nI really hope that made more sense. I definitely wanted to clear up the misconceptions I feel you made towards my original comment, which I wrote out of my own perspective as someone with an ed terrified of weight gain beyond my control and the idea that set point = doom. I wrote it with the basis of science, and the perspective of HAES where every individual’s recovery is valid and looks different because every individual has different tastes/preferences for food and activity, and social influences like environment (food deserts, income levels, etc), which all combine into the plethora of factors that influence one’s weight. That’s what I meant. I hope this makes more sense. Thanks for reading this far if you did haha.",
      "created_utc": 1640757160.0,
      "score": -3,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqc9cpw",
          "author": "Sareeee48",
          "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
          "created_utc": 1640733728.0
        },
        {
          "id": "hqcyw59",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640745144.0
        },
        {
          "id": "hqd675y",
          "author": "Sareeee48",
          "body": "I understand set point well, and out of all of the extensive research I have done and throughout the conversations I had with my previous therapist who was also specialized in EDs, I have never once heard of what you’re talking about. Set point is a range of 5-20 lbs, yes, but it doesn’t simply change because you are more active and decide to “eat in moderation” (another word for restriction imo), if that were true 94% of diets wouldn’t fail, nor would individuals gain back all their weight and then some, because they’d be able to manipulate their set point. Whether or not you intended it as such, you are implying that making physical changes is a “lifestyle” that directly influences your set point and that’s literally why most of us are in recovery—because we put too much emphasis on our physical bodies and the food we put into it. Set point is affected by many things, from our environment to our physical and psychological well being, but the range is just a safety net, you can’t just decide you wanna weigh 20 lbs less. And as someone who is extremely active and eats according to my hunger, I don’t weight less because I go to the gym or work an active job.\n\nI’m not saying your treatment team is full of shit but treatment centers have a long history of being fatphobic, even in subtle ways, and many do not understand or even accept set point, and if they so accept it they believe it is something that can be manipulated to achieve thinness. So I’m sorry if I’m not really impressed with your therapist’s opinion. Maybe I *did* misinterpret your comment, but I’m still left feeling like you and your team are excusing restriction and manipulating your body based on set point being within a range and I just think that’s… really weird for ED specialists to encourage. Also, saying individuals weigh more because their less active and eat “bad” food *is* fatphobia. Don’t really know how it’s not.",
          "created_utc": 1640748544.0
        }
      ]
    },
    {
      "id": "hqeid0m",
      "author": "Sareeee48",
      "body": "I definitely misinterpreted to an extent, but I still don’t agree. Your treatment team is *still* insinuating that eating “bad” foods lead to less muscle mass and an overall higher weight—even if it’s within some range—and that eating “Whole Foods” (which isn’t actually a real term or way of eating and extremely vague at best, *most* foods are processed, doesn’t make the nutritionally inferior) means you will be leaner and weigh less. That is still giving some type of moral value to food, even if you say that’s not what you’re doing, because it still feeds into diet culture myths that food is a huge factor in our weight when it isn’t even on the top of the list, *if* at all. Your scenario feels flawed in that 1) you don’t know if twin 1 or 2 has a healthy relationship with food based on their body mass or even lifestyle; if eating “Whole Foods” is only sustainable with money, why are eating disorders, including orthorexic behaviors, so prevalent among young women of all demographics? What makes eating this way healthy and intuitive, when it raises the risk of disordered eating at best and a full blown eating disorder at worse? Because at the end of the day, you don’t know what each twin’s relationship with food is. For all you know twin 2 can feel restricted and out of control around the foods twin 1 is comfortable with. This is still an exceptionally idealized version of recovery and ignores all biological drives that cause us to crave sweet foods and the mechanisms that cause us to feel out of control around foods we limit despite really wanting them (it’s one thing to say you don’t like sweets, it’s another to avoid all “junk,” I know that’s not what you said but that’s how I view the scenario). \n\nAlso, I’ve got a lotta gripes with the obesity thing. “Obesity” isn’t caused by poverty forcing poor people to eat fast food/processed food—if that were true, all poor people would be obese. It’s *a lot* more complex than that. To start, poverty leads to excessive stress that can cause many chronic health conditions that not only affect fat people (heart disease, for example) but poor people in general, and tend to go untreated specifically for fat folk by a negligent medical industry. The weight stigma that permeates the medical industry prevents fat people from receiving life saving medical procedures and medication in favor of unsustainable weight loss that, again, leads to more weight gain long term; and then there’s the fact that there are many health conditions that *causes* weight gain as a symptom (think PCOS, diabetes, hypothyroidism, Hashimoto’s). Fat people die because of the medical industry’s fatphobic beliefs and unwillingness to treat them accordingly. Studies show that medical professionals actually view fat people as less than and show them far less compassion in their treatment approach. Then there’s the fact that dieting causes a lot of damage and contributes to the “obesity epidemic” and, yeah, in turn can lead to other health consequences down the road… but *only* if you don’t let your body level out and continue to yo-yo diet and weight cycle like this. And we haven’t even begun to discuss the case of “obese” individuals who are perfectly metabolically healthy, and it’s more common than people will choose to believe.\n\nI definitely agree that certain things improve our overall health, such as regular exercise (whether that’s just running errands, cleaning your home, walking or going to the gym) and eating a variety of foods that a lot of people don’t have access to due to poverty. But I do *not* agree that obesity is a product of poverty and processed food consumption because it entirely shifts the damages of fat phobia away from its source. It’s not a poverty problem, it’s a wide spread, *systemic* problem.",
      "created_utc": 1640780885.0,
      "score": 2,
      "context": [
        {
          "id": "hqbro73",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640726347.0
        },
        {
          "id": "hqc9cpw",
          "author": "Sareeee48",
          "body": "I removed your comment because it breaks rule 6 (no fatphobia). I think it’s really unfair and misguided to assume that people in larger bodies ended up that way by eating “icecream and cake and not working out” and others are thin because they do the opposite. That’s not how it works whatsoever. These types of comments are harmful to not only larger bodied folks, but anyone struggling with a restrictive ED. These people are already terrified of gaining weight and stuck in a vicious cycle of rigid control and fear to suppress and manipulate their weight despite the science proving that doing so is extremely damaging both physically and psychologically, and this viewpoint isn’t what they need to read on a recovery sub.",
          "created_utc": 1640733728.0
        },
        {
          "id": "hqcyw59",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1640745144.0
        },
        {
          "id": "hqd675y",
          "author": "Sareeee48",
          "body": "I understand set point well, and out of all of the extensive research I have done and throughout the conversations I had with my previous therapist who was also specialized in EDs, I have never once heard of what you’re talking about. Set point is a range of 5-20 lbs, yes, but it doesn’t simply change because you are more active and decide to “eat in moderation” (another word for restriction imo), if that were true 94% of diets wouldn’t fail, nor would individuals gain back all their weight and then some, because they’d be able to manipulate their set point. Whether or not you intended it as such, you are implying that making physical changes is a “lifestyle” that directly influences your set point and that’s literally why most of us are in recovery—because we put too much emphasis on our physical bodies and the food we put into it. Set point is affected by many things, from our environment to our physical and psychological well being, but the range is just a safety net, you can’t just decide you wanna weigh 20 lbs less. And as someone who is extremely active and eats according to my hunger, I don’t weight less because I go to the gym or work an active job.\n\nI’m not saying your treatment team is full of shit but treatment centers have a long history of being fatphobic, even in subtle ways, and many do not understand or even accept set point, and if they so accept it they believe it is something that can be manipulated to achieve thinness. So I’m sorry if I’m not really impressed with your therapist’s opinion. Maybe I *did* misinterpret your comment, but I’m still left feeling like you and your team are excusing restriction and manipulating your body based on set point being within a range and I just think that’s… really weird for ED specialists to encourage. Also, saying individuals weigh more because their less active and eat “bad” food *is* fatphobia. Don’t really know how it’s not.",
          "created_utc": 1640748544.0
        },
        {
          "id": "hqdmkrf",
          "author": "None",
          "body": "(1/2 because I wrote too much sorry): \n\nYeah I think you definitely did misinterpret a bit of my original comment! I don’t mean to sound rude I’m sorry I’m just trying to get my point across :) \n\nI agree with you about set point that it’s biological and doesn’t change just because someone’s more active and you are right that 94% of diets fail, because the body is very resilient and tries it’s best to hold on to the weight it feels and functions best at; so if someone loses a lot of weight by extreme restriction on a harsh diet, then when they go off the diet their hunger cues will likely ramp up substantially and they will likely as a result eat a lot more in order to listen to that hunger, that’s the body’s way of restoring that energy deficit. So then they often will regain some or all of the weight they lost (and then some sometimes). The body also tries to conserve energy and maintain its set point when faced with extreme calorie restriction by slowing down the metabolism, making you cold all the time, making you tired and brain foggy so you don’t spend precious energy on thinking when it needs those calories to keep the organs running and maintain homeostasis. Etc.—so I totally get what you are saying about set point and I agree with it :)\n\nWhat I meant was, when I was talking with my therapist about the set point theory and how I was so scared it would make me gain weight, we worked through those fears. Because she doesn’t want me to continue restricting so extremely and living in fear controlled by an ed, when there is no way that I even know what would happen when I eat/in recovery if I do not actually even do it. She wasn’t coming at it from a diet culture lens or fat phobia (she operates on the Health At Every Size/HAES model and has brought up dismantling and working on my fear of getting fat, so she is very much not fatphobic). What we talked about was, set point isn’t an end all be all for weight. It’s a range (like you said, of 5-20 lb) where your body naturally gravitates to and settles at when you’re not actively restricting foods you want or crave or need, or forcing yourself to do excessive exercise you don’t enjoy. At the end of the day, the law of thermodynamics still applies and works with set point theory, where an individual’s lifestyle absolutely influences one’s weight *to a degree* (I used the room influences very intentionally here, *not* defines—I think maybe that’s where my point my have been misunderstood, for I simply meant that set point is a *function* of a complex array of factors: genetics and biology, yes, but also taking into account the natural lifestyle and food intake of the individual. I’ll give an example of what I meant: if two identical twins are born and separated at birth adopted to different families, and one grows up being raised really active, maybe running is a hobby they enjoy and they generally eat lots of whole foods and fruits and vegetables and whole grains, maybe they don’t have much of a sweet tooth but they love eating a slice of cake or two when they feel like it, and stop when they no longer crave it, even if that means not finishing what’s on their plate or leaving the piece of cake to finish at a later time when they’re in the mood again. Let’s say the second twin grows up in a different family, one that is naturally less sporty and doesn’t ingrain the love of running/camping/skiing/etc in that person (my family is like this for example, I always would ask my parents if we could do something fun like go on a walk or hike when I was a kid and they’d be like nah that’s boring. I was so jealous of my friends who went out and did things with their families and who got to go on exciting ski trips and run 5Ks together. It seemed so fun to me and whenever I got a small taste of it, like when I was able to convince my parents to doing a partial little 5K walk with me when I was like 12, I had so much fun but they didn’t find it as fun and didn’t want to do it again). Maybe that family is stretched on a tighter income and has to rely on cheaper fast foods to feed their family, maybe fresh fruits are too expensive so the individual instead snacks on what is available in the household, cheaper snacks like chips for example. Maybe they simply have more of a sweet tooth and to them, unrestricted eating means eating a slice of cake everyday which the first individual would have not craved because they simply weren’t much of a sweets person, so *their* unrestricted eating means eating that slice of cake on a less frequent basis. The key point I was trying to make here, is that *both* of these individuals are experiencing their own *versions* of unrestricted and intuitive eating, and engaging in whatever activity and lifestyles feels most comfortable to them (ie if hiking and running 5Ks is something you enjoy, yay! But if it’s not, that’s so totally completely okay too and more joyful movement is what’s natural and healthy for that person). In this scenario, both of the twins are genetically identical in terms of *biological* set point, in which case their natural metabolic function and the amount of calories their body requires as energy to maintain homeostasis are roughly the same range. But because of the fact that set point is not *purely* biological but *also* FURTHER a function of lifestyle and diet factors, the first twin will likely weigh less than the second one; or perhaps more, seeing as muscle weighs more than fat...what I meant is that the first one might appear more conventionally “healthy” and socially acceptable in terms of body weight in today’s diet culture obsessed society, whereas the second one might be in a comparatively larger body that society judges as less “healthy” and “overweight” by arbitrary bmi standards. Both of these individuals have the same biological set point but because they also have vastly different lifestyles (one very active naturally, not out of the intention to control their weight but simply out of pure joy and love for being active, one much more sedentary, not because they are “lazy” or “unhealthy” but simply because, like my parents I discussed earlier, they don’t enjoy vigorous activity as much, and prefer to live less active lifestyles that align with what they find joy in). On the diet end, both twins are eating what they feel best eating/listening to their body and cravings and/or within the social and financial constraints they exist within. The first twin is simply consuming what they prefer, and the family generally eats whole foods and fruits and vegetables often, because they are fortunate enough to afford it and they find that that is what they crave and feel the best eating. The second twin is also simply consuming what they prefer, but because they have a natural sweet tooth they eat more foods that are objectively higher in calories and fat and sugar (NOT saying that any of that is bad. Calories are necessary, fat is necessary, sugar is a carbohydrate and that is the main macronutrient your body and brain runs off of. What I mean here is that it is in a larger quantity due to that individual’s dietary preferences than the first twin, comparatively speaking). (I also want to interject this scientific article here: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5781054/#s1title which studies how “people with lower income are more vulnerable to obesity, the framework of social determinants of health indicates that material conditions confine one’s access to healthy food and healthcare, while also influencing health-related behaviours (ie, dietary behaviours and physical activity).” —I don’t mean obesity in terms of diet culture judgment and fatphobia, but am simply restating a quote from a scientific article in order to add depth to my point about how lifestyle and social factors can absolutely influence one’s weight, such as if one is constrained by their budget to rely only on processed and packaged and fast foods).",
          "created_utc": 1640757121.0
        }
      ]
    }
  ]
}