{
  "id": "rtxz31",
  "subreddit": "fuckeatingdisorders",
  "author": "HealthIsDifficult",
  "created_utc": 1641086668.0,
  "title": "What is the worst thing your ED made you do?",
  "selftext": "Like genuine gross or horrible things, I'll start:\n\nMy ED made me steal money from my parents to buy monster ultra.\n\nMy ED made me try to convince my parents that my sister had an ED so they'd focus on making sure she'd eat and wouldn't pay attention to me.\n\nMy ED made me try to poison myself so i'd be sick for a few days and wouldn't be able to eat.\n\nI tried to buy a tapeworm.\n\nAlmost pushed my friend to the ground just because they tried to get me to eat something.\n\nI gaslit/fought my parents whenever they mention I eat too little into believing I eat a lot, wether that meant logical reasoning, screaming or insulting them, I didn't care, as long as they left me alone\n\nEDs make us do disgusting things but remember that you're more than those behaviours! This is just another one of the many horrible things about EDs. What I did to help my ED will never be okay but I can make it up to everyone I hurt",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rtxz31/what_is_the_worst_thing_your_ed_made_you_do/",
  "score": 105,
  "num_comments": 35,
  "comments": [
    {
      "id": "hqwm6ot",
      "author": "organsforoceans",
      "body": "neglecting ALL of my relationships (family, friends, classmates, whatever) in favor of daydreaming about food, eating out of the trash, crying before, after, and probably DURING at some point, going out to eat because i felt out of control. you know, having a total snot-faced meltdown because of french fries instead of being grateful my grandparents were visiting. -\\_\\_- it makes me want to smack myself. and also give a hug at the same time",
      "created_utc": 1641104246.0,
      "score": 38,
      "context": []
    },
    {
      "id": "hqvozbc",
      "author": "Sareeee48",
      "body": "My boyfriend’s brother sent him two Amazon gift cards  for Christmas a few years back and I spent them on safe food and then acted like he misplaced them when he wanted to use them.\n\nI stole safe foods from my job at the time.\n\nI skipped out on boyfriend’s birthday to work out and prep my safe foods because I just couldn’t let go of the perceived notion of control for one single day.\n\nBoyfriend would buy me foods he knew I liked and I’d tell him about how much I enjoyed them when in reality I shamefully ate the entire contents because TW MENTIONS BEHAVIORS >!I was obviously starving, and then purged them!<.\n\nI basically made boyfriend work full time and long hours because I was physically and psychologically incapable of working anything more than part time (and even that was barely manageable). So while he was basically paying all the bills, he was also paying for my wildly expensive safe foods and I’d have full blown meltdowns if I couldn’t get ahold of them.\n\nLmao didn’t realize all but one of these involved my poor partner 😭",
      "created_utc": 1641087854.0,
      "score": 45,
      "context": []
    },
    {
      "id": "hqvo0yn",
      "author": "lemej",
      "body": "This was more dangerous than anything, but I ate broken glass. \n\nI used a hammer to break open a glass of sauerkraut because I couldn’t get the lid open. Shards of glass ended up in the food and I ate it anyway. Crunchy. My mouth bled a little. Who knows what happened on the way down and out. \n\nI think I was just very adamant on eating my sauerkraut that day!",
      "created_utc": 1641087437.0,
      "score": 46,
      "context": []
    },
    {
      "id": "hqxh8gt",
      "author": "AnArticulateCrab",
      "body": "My cat was badly injured and ended up needing to have an eye removed. When I found her (she was still just going about her way like normal) I rang my mum and told her I couldn’t catch her to bring her to the vet until I’d done my exercise routine for that morning. I was pissed about having to stop to make the phone call. I’m completely cat obsessed and she was my life since I got her so the fact I didn’t drop everything to take care of her was completely out of character for me.",
      "created_utc": 1641128215.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hqxazc5",
      "author": "hungrychai",
      "body": "I also stealed a lot of money to buy food. I also ate what my mum was going to eat at work for the next day several times, I literally couldn't control it. \nWhen I was at my worst with AN, I always lied that I was eating their food while actually I always threw it in the trash. Lots of money of food to waste. \nAlso I internally judged a lot of people just because they looked fat or if they had a good relationship with food I judged them as well, as they were not healthy and blabla. I also judged the shopping cart of people based on if they were going to buy processed foods.",
      "created_utc": 1641123476.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hqvsttf",
      "author": "Kind_Term6662",
      "body": "I think the worst my ED has caused me to do is lash out/destroy my relationships, become far more self absorbed than is acceptable, and somewhat support proana. \n\nI genuinely cant even have a conversation with my family on emotions without feeling like im having a panic attack. I lashed out on others who I felt inferior to, and ended up harboring  hatred and envy at people who I thought would belittle me, or have. Not to mention, I had a sick obsession with torturing myself with proana. It was essentially self sabotage-- Just to feel somewhat a sense of comfort, of \"maybe ill be happy if i look at this.\" \n\nIt still hurts to think about. Its so infuriating, knowing that you're stuck in a bubble and cant get out because you cant even admit that you have a problem. Thank you for asking us to share, It's allowed me to reflect on my own behaviors, and how to continue fighting them. I'm just hoping, praying my habits weren't that visible or weren't noticeable for my siblings to realize.",
      "created_utc": 1641089562.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hqxiq6s",
      "author": "Purple_lotuss15",
      "body": "Crying after eating literally anything, even on dates. Making my college boyfriend take me to the gym before every single party and getting in screaming matches if I couldn’t go. Cancelled tons of plans. Lost lots of friends. Sneaking out at 3am to go to the gym on holidays instead of spending time with my family. Trying to drive to the gym in an ice storm and almost flipping my car. Trying to drive to the gym when black ice was on the roads the next year and back sliding down a hill. A neighbor helped me stop the car, I got out, and walked up the hill to my 24 hour key card access gym. \nChewed and spit thanksgiving dinner. \n\nCut every single vacation (even my honeymoon and going to visit my father in law who is dying from cancer) short because I didn’t have access to a gym and I was having meltdowns about not being able to go do my routine or have my safe foods. \nRefused to go out and hit my legs/stomach to the point where I had bruises because I thought I looked fat. \n\nNot eating at all over vacation because there was nothing available that my ortho brain thought was ok to eat and fainting in the airport \n\nCovered up all my mirrors with sheets and towels during the pandemic since I wasn’t exercising as much and couldn’t stand to look at myself or my body changing. \n\nLying. Being selfish and vain. Only thinking about myself, which has damaged my relationship with my husband. WILD mood swings due to low blood sugar and lack of sleep from exercising \nNever being able to sleep from anxiety and waking my husband up in a panic in the early morning talking about how much I loathe my body. \nNot letting my husband touch me when I’ve eaten too much.",
      "created_utc": 1641129226.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hqvtvr3",
      "author": "tamidle",
      "body": "Made me throw away food because I was afraid to binge eat. Made me try to make my brother and parents gain weight by giving them the food I didn't want to eat.",
      "created_utc": 1641090041.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hqy07xc",
      "author": "scorpiothecat",
      "body": "The grossest thing is definitely eating food from the bin, like throwing away nice chocolate and being so hungry I'd be eating from the bin and picking off bits at like 2am\n\nThe thing I feel worst about is throwing away food as a teen so I didn't have to eat it, feel bad cause we were poor and couldn't afford to waste food :'(",
      "created_utc": 1641138426.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hqxwmji",
      "author": "awaythr0w444",
      "body": "I stole food from the grocery stores because I was too ashamed to buy it. For some reason if I didn’t spend money on it, then it was okay to binge on it?? I would wear a huge coat with pockets and go to the protein bar section and absolutely stuff them full of all the bars I wanted. Waking out of the store, I would legit crinkle because of all the wrappers.",
      "created_utc": 1641136807.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hqvopuh",
      "author": "None",
      "body": "I wore a weighted vest to the doctors to hide my weight (I paid a lot of money for one). I lied to my mom and showed her that my old clothes fit when I had really just got them altered. I would throw food out and lie about when I ate. I constantly gas lighted my mom. I weighed myself at Walmart and opened the scales Cus we don’t have one at home. The night of my birthday I went and exercised for over an hour while my boyfriend was sleeping because I had anxiety. I wanted to do awful things to my parents for making me wanna gain. I’m so glad I’m pursuing recovery Cus the guilt was eating me alive and I’m tired of starving myself and of being mentally tormented",
      "created_utc": 1641087740.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hqyx38k",
      "author": "ab18822",
      "body": "I lashed out at my family and friends for taking photos of me. I still do, if I’m honest. I feel like I have a tantrum I can’t control, although it’s better now. The idea of seeing my body put me into such a panic I remember yelling at wellmeaning loved ones with cameras for years of my life.\n\n\nBut most of all… I have a sister who is 7 years younger than me and I’m so regretful about the things I said off-hand all my life that probably got stored somewhere in her brain (ex: no, I can’t eat that - too much fat; and it’s one of her favourite foods). Or, commenting about my appearance in front of her. If I could go back, I’d work hard to keep these thoughts to myself\n\n\nOh, and of course spending a SHIT ton of money on binges. Then a shit ton of money on random health products / expensive health food to make up for it. But that’s my own debt to carry. The worst is the emotional impacts I made on others",
      "created_utc": 1641151043.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hqw3rpm",
      "author": "sandopsio",
      "body": "A lot of terrible things and I’m sure other things I did for my ED were worse in many ways, but one that stands out early on was throwing an entire platter of fancy Italian cookies my mom was excited to buy at a special bakery she went out of her way to go to when we traveled, in the garbage that night when we got back.",
      "created_utc": 1641094566.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hqvwiwi",
      "author": "AnnaAdderall",
      "body": "Throw away food, lie to family and friends, destroy relationships, be scared of everything, stay up nights crying because of anxiety and fear and never feeling like enough, worry family by being taken away by ambulance for fainting/low blood sugar",
      "created_utc": 1641091241.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hqx0po5",
      "author": "None",
      "body": "I had untreated health problems from my ED (brain and heart related) that turned me into an inconsolable wreck years ago. My ED was out of control and I was having a nervous break down over career/relationship issues. I cut off and screamed at a lot of people. My parents were understanding, they tried to help me. We got a dog. It was the saddest thing how I was suicidal, crying, screaming etc and couldn't connect with it. I wrecked my relationship with my parents and ended up in a psych ward (I was dragged off the road by Police). I'm still grief stricken about it to this day",
      "created_utc": 1641114936.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqyv621",
      "author": "hhm320",
      "body": "I ruined my vacation with my best friend because I was irritable on account of not eating, planned our entire itinerary around food/exercise, and constantly asked for body validation when she really needed to relax.",
      "created_utc": 1641150347.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqyzggo",
      "author": "YourFrogMom",
      "body": "I did a lot of bad things but the worst by far is how I affected my family. \n\nTW: suicide attempt/ideation\nAt my worst I had near daily violent psychotic episodes where I’d try to kill myself while my family desperately tried to keep me from slamming my head into things or getting hold of sharps. that sort of thing. I’d scream at them, tell them I hate them (I don’t, I love them) how I hoped I’d die of heart failure (I was very, very UW). There were no hospital beds anywhere as this was the height of COVID and it was bad in my\narea :( As a result, I have brain trauma/memory loss from the head slamming and dangerous state of my body at the time. We all have ptsd from the experience. It happened almost daily. It was a very dark time for all of us. \nI feel horrible guilt over how I treated everyone and it’s terrifying how close I was to dying before my 15th birthday. I’ve never told anyone irl about this because everyone would (rightfully?) think I’m insane. But yeah that’s probably the worst thing I’ve done because of my ed:(",
      "created_utc": 1641151911.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqz3pp5",
      "author": "Spectrachic311311",
      "body": "Grossest that it’s made me do is take so many laxatives that I’d have to shit in trash cans in the basement since I couldn’t make it to the bathroom.  I forced my husband to work a super stressful job for years because I couldn’t handle a full time job so I worked only part time.  I focus only on myself and this disease has made me so, so selfish.   Thank you all for sharing your stories too—it makes me feel less alone.",
      "created_utc": 1641153474.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hqx35nu",
      "author": "lvl0rg4n",
      "body": "I permanently rearranged my stomach before I was old enough to drink.",
      "created_utc": 1641116970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqxpxmm",
      "author": "Narwhal_Songs",
      "body": "Oh I made a list of these the other Day\nCant remember now\nBut stealing foods from roomates to binge on is up there",
      "created_utc": 1641133485.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqzqdo3",
      "author": "Goth_Lizard",
      "body": "Constantly tried to over feed my (now ex) bf, trying to manipulate him into admitting to me  he thought I was too fat (he didn’t ) \n\nWas mean and awful to my parents + friends who tried to help me \n\nUsed random sex as a coping mechanism",
      "created_utc": 1641162132.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hqwoo9w",
      "author": "Boring_Process",
      "body": "Lashing out at family, lying, and canceling plans with friends.",
      "created_utc": 1641105835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqx218c",
      "author": "clullen",
      "body": "My ED made me steal food from my colleagues and flatmates.\nMy ED fucking sucks.",
      "created_utc": 1641116039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqy9n9l",
      "author": "Brennir10",
      "body": "have all my teeth replaced with surgical implants.",
      "created_utc": 1641142317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqycule",
      "author": "BedroomImpossible124",
      "body": "Lying to my husband, backing up into a brick wall b/c of brain fog, among other things",
      "created_utc": 1641143563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hr19vao",
      "author": "Comfortable_Life_437",
      "body": "I threw out my grandmothers cupcakes that she made for the whool family because I was scared I would binge on them",
      "created_utc": 1641185501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrmpwo9",
      "author": "RaccoonReact",
      "body": "\\- stolen food to binge then purge\n\n\\- been actively jealous of when friends / family have been ill and lost their appetite\n\n\\- told my bf that i could never go out for food or drinks with him again bc i wouldn't eat or drink anything that was made by someone else",
      "created_utc": 1641560382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqx9v7d",
      "author": "None",
      "body": "Blame all my problems on other people and wallow in self pity because they didn't help me",
      "created_utc": 1641122554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5lc5yo",
      "author": "Mean-Signature2414",
      "body": "How did you heal. I’m going through all these things atm 💔💔",
      "created_utc": 1716629971.0,
      "score": 1,
      "context": [
        {
          "id": "hqvozbc",
          "author": "Sareeee48",
          "body": "My boyfriend’s brother sent him two Amazon gift cards  for Christmas a few years back and I spent them on safe food and then acted like he misplaced them when he wanted to use them.\n\nI stole safe foods from my job at the time.\n\nI skipped out on boyfriend’s birthday to work out and prep my safe foods because I just couldn’t let go of the perceived notion of control for one single day.\n\nBoyfriend would buy me foods he knew I liked and I’d tell him about how much I enjoyed them when in reality I shamefully ate the entire contents because TW MENTIONS BEHAVIORS >!I was obviously starving, and then purged them!<.\n\nI basically made boyfriend work full time and long hours because I was physically and psychologically incapable of working anything more than part time (and even that was barely manageable). So while he was basically paying all the bills, he was also paying for my wildly expensive safe foods and I’d have full blown meltdowns if I couldn’t get ahold of them.\n\nLmao didn’t realize all but one of these involved my poor partner 😭",
          "created_utc": 1641087854.0
        }
      ]
    },
    {
      "id": "hqxb1pr",
      "author": "hungrychai",
      "body": "Omg... I am so sorry for this. Eating impulses are the worst",
      "created_utc": 1641123530.0,
      "score": 13,
      "context": [
        {
          "id": "hqvo0yn",
          "author": "lemej",
          "body": "This was more dangerous than anything, but I ate broken glass. \n\nI used a hammer to break open a glass of sauerkraut because I couldn’t get the lid open. Shards of glass ended up in the food and I ate it anyway. Crunchy. My mouth bled a little. Who knows what happened on the way down and out. \n\nI think I was just very adamant on eating my sauerkraut that day!",
          "created_utc": 1641087437.0
        }
      ]
    },
    {
      "id": "hqyxqdv",
      "author": "ab18822",
      "body": "This is heartbreaking and just shows what a hold on you your ED had ❤️",
      "created_utc": 1641151276.0,
      "score": 7,
      "context": [
        {
          "id": "hqxh8gt",
          "author": "AnArticulateCrab",
          "body": "My cat was badly injured and ended up needing to have an eye removed. When I found her (she was still just going about her way like normal) I rang my mum and told her I couldn’t catch her to bring her to the vet until I’d done my exercise routine for that morning. I was pissed about having to stop to make the phone call. I’m completely cat obsessed and she was my life since I got her so the fact I didn’t drop everything to take care of her was completely out of character for me.",
          "created_utc": 1641128215.0
        }
      ]
    },
    {
      "id": "hqxqyvq",
      "author": "Sareeee48",
      "body": "I also harshly judged people. I never openly said anything bad about them but I did think “I will never ever look like that/weigh than much/eat like that.”",
      "created_utc": 1641134029.0,
      "score": 6,
      "context": [
        {
          "id": "hqxazc5",
          "author": "hungrychai",
          "body": "I also stealed a lot of money to buy food. I also ate what my mum was going to eat at work for the next day several times, I literally couldn't control it. \nWhen I was at my worst with AN, I always lied that I was eating their food while actually I always threw it in the trash. Lots of money of food to waste. \nAlso I internally judged a lot of people just because they looked fat or if they had a good relationship with food I judged them as well, as they were not healthy and blabla. I also judged the shopping cart of people based on if they were going to buy processed foods.",
          "created_utc": 1641123476.0
        }
      ]
    },
    {
      "id": "hru0rzl",
      "author": "None",
      "body": "definitely stealing food.",
      "created_utc": 1641680429.0,
      "score": 1,
      "context": [
        {
          "id": "hqxwmji",
          "author": "awaythr0w444",
          "body": "I stole food from the grocery stores because I was too ashamed to buy it. For some reason if I didn’t spend money on it, then it was okay to binge on it?? I would wear a huge coat with pockets and go to the protein bar section and absolutely stuff them full of all the bars I wanted. Waking out of the store, I would legit crinkle because of all the wrappers.",
          "created_utc": 1641136807.0
        }
      ]
    },
    {
      "id": "hqyyccj",
      "author": "ab18822",
      "body": "❤️ I felt this. I spent an entire trip with my mom at a gym I found there. Or planning meals. Or buying clothes to feel better and then crying about them / taking up her emotional energy to console me. Travelling was always the worst. There is no vacation from an ED, even while everyone else around you is vacationing.",
      "created_utc": 1641151500.0,
      "score": 4,
      "context": [
        {
          "id": "hqyv621",
          "author": "hhm320",
          "body": "I ruined my vacation with my best friend because I was irritable on account of not eating, planned our entire itinerary around food/exercise, and constantly asked for body validation when she really needed to relax.",
          "created_utc": 1641150347.0
        }
      ]
    },
    {
      "id": "hqzcqtf",
      "author": "hhm320",
      "body": "Yeah it really sucks. Luckily I allowed myself to have a fun NYE!",
      "created_utc": 1641156726.0,
      "score": 2,
      "context": [
        {
          "id": "hqyv621",
          "author": "hhm320",
          "body": "I ruined my vacation with my best friend because I was irritable on account of not eating, planned our entire itinerary around food/exercise, and constantly asked for body validation when she really needed to relax.",
          "created_utc": 1641150347.0
        },
        {
          "id": "hqyyccj",
          "author": "ab18822",
          "body": "❤️ I felt this. I spent an entire trip with my mom at a gym I found there. Or planning meals. Or buying clothes to feel better and then crying about them / taking up her emotional energy to console me. Travelling was always the worst. There is no vacation from an ED, even while everyone else around you is vacationing.",
          "created_utc": 1641151500.0
        }
      ]
    }
  ]
}