{
  "id": "rxm7r3",
  "subreddit": "fuckeatingdisorders",
  "author": "ultramarine-jade",
  "created_utc": 1641495974.0,
  "title": "Want to fully recover from a restrictive eating disorder? Here are some truths.",
  "selftext": "TW; some ED realness may be kind of blunt so please don’t read if you think mentions of weight gain or anything in that realm may be harmful to you in this moment! \n\nBeen lurking around the sub for awhile now, and just have to get this off my chest. \n\nIf you want to FULLY recover from a restricting eating disorder (and this probably applies to other eating disorders as well to some degree I can only speak as someone who has suffered from a restrictive ED), YOU ARE GOING TO HAVE TO GAIN WEIGHT. Period, end of story. Regardless of your weight now or body shape, if you’re restricting and ignoring your body’s needs you’re going to have to eat more (and probably A LOT more at that) than what you’re eating now or stop doing the things that you do to control your weight. How or what you eat to gain that weight isn’t going to be the same as what you will be doing once you reach a body weight that is right for you and you alone. But you have to reach that place first. \n\nI know it’s probably the last thing you want to hear, and weight gain is probably almost the biggest fear currently and obstacle to recovery for everyone with a restricting eating disorder. But you’re not going to and you cannot “I’m a special unicorn weight gain will be especially difficult and catastrophic and unacceptable for me so I can’t eat” your way out of this reality in the pursuit of true recovery. \n\nNo one, and I of all people certainly cannot or anyone on this sub as well, can predict for you how much weight you will gain with absolute certainty and if that will be higher or lower than your pre-ED weight or if you will be categorized as “overweight” or “obese” by the BMI scale or if you will lose the “overshoot weight” or not or if you’re going to gain 1, 5, 20, 50, or whatever pounds. In fact, it doesn’t fucking matter and anyone who is trying to predict how much weight you will gain shouldn’t really be someone you listen to without question because they aren’t you! The only one in control of your weight is your body on the way to full recovery, and it is going to decide regardless of what you want where it should be in terms of weight if you want to fully recover. The weight may redistribute it may not maybe your stomach is just meant to look like that and what’s wrong with that it doesn’t fucking matter none of this is permission or justification or fodder for your ED to decide it’s time to throw in the towel and quit. \n\nFurthermore, your body isn’t fucked or wrong for gaining weight or looking the way it is. Your body is innocent! It has continued to keep you alive and has remained loyal to keeping your existence on this plane of earth despite the fact that day in and day out you under the control of your ED harm it and have demonstrated at every turn that you will take the opportunity to consistently deprive it of its needs. I honestly don’t think any living thing would have stuck with me the way my body kept me alive after all the abuse I put it through. This fight is between you and your ED, and your body is in your side. It’s not you against an out of control body. Your body is not trying to kill your or make things worse for you by gaining weight or looking a certain way in recovery, I promise. \n\nAnd as someone who has done the half or quasi-recovery deal and has been underweight, at a “normal” weight, and overweight in all orders and cycles for years, I can and will say that it fucking sucks it’s like having the ED but also gaining weight. Sure, I may not have been gaining all the weight that my body needed in my attempt to control my weight in this “recovery” but my ED certainly wasn’t happy about any weight gain at all and I was just if not even more, with the weight gain on top of it all, miserable than I was in the depths of my ED. Fucking around the weight gain thing while wanting full recovery is impossible. Doing anything “tolerable” to your ED is still letting it live in some capacity. If you’re not fully recovered your ED is going to keep on living in some way within you and doing the toxic shit it does it’s going to continue to make your life horrible within that corner of your world. And, from my experience, the ED voice doesn’t get kinder or the rituals any less suffocating just because you put on a few pounds you think is enough or acceptable to your standards but your body disagrees with.\n\nBut honestly, who cares what my experience in recovery is like? Sure, if someone said that they lost the overshoot weight it may be reassuring to you in the moment, but the fact is that it may not be true for you. And if that belief that’s been “justifying” or “cushioning” your weight gain is proven to be false once you wake up one day and realize all the weight you’ve gained or the process isn’t what you were “promised” by someone then what happens now? You just give up on recovery? And if someone else gets to recover into a conventionally thin body but you can’t because that’s not how your body and your genetics work are you going to go back to restricting? I sure as hell let these things get to me during my many attempts at recovery. The experiences of others are not markers or indicators that if you miss them it must mean you are doing something wrong in recovery. Recovery is such a personal process, and, honestly honestly, the only way you can fuck it up is by restricting and not resting or taking care of yourself to your best capacity.\n\nI’m not at all against harm reduction or seeking reassurance, but it is important to also recognize that the experience of someone else in a totally different body than yours and in a completely different circumstance may or may not happen to you. During my one of my earlier attempts at recovery, I felt that everything that was said to be surrounding the weight gain and the amount of it and whether or not I would lose any of it was misconstrued by my fucked ED brain as a promise and an excuse of “oh see it didn’t happen in this way for you so now we have to go back to the old ways because weight gain doesn’t work for you and you’re going to endlessly gain” which was fucking bullshit and caused me to relapse several times since honestly only once I let it all go and gained whatever I needed to and accepted that no matter how painful it was I did stop gaining the weight. Maybe it wasn’t the weight I wanted to be at in the moment, but it was a weight my physical body worked optimally at. Only when I forced myself to have 0 expectations for my weight against all fucking odds and pain and ludicrous fears was I able to recover. And bodies are meant to change and adapt to different life stages and circumstances anyways. What you will be at the end of recovery isn’t set in stone either and almost, with guarantee, will change at some point for some reason during your lifetime. This stage of my life was “I have to get out of this fucking nightmare before it slowly kills me mentally and physically” so that was the weight I needed to be at.\n\nI know this all may sound really harsh, but you are going to gain weight and it will be out of your control how much you gain on the way to full recovery. There is no bargaining or questioning in that. Realizing this fact early on may save you a lot of grief and suffering down the line. Still, none of this makes it any less scary or easier to digest at all. But you will do the hardest thing you think you will ever do the thing that scares the living shit out of you and you may have to do it screaming, crying, and kicking but YOU WILL SURVIVE. Ain’t that amazing? You’re going to do what you perceive and is very real to you as the most difficult thing in the world and make it through in one piece. \n\nI’m rooting for you all. I cannot and will not promise happiness or bliss at the end of recovery. There’s still endless shit to unpack and life troubles for me as a “recovered” person, but the magical thing is that these problems will no longer be caused by your ED and, probably, will be there regardless of if you’re stick thin or not. And you will be both more physically and emotionally capable of handling whatever comes your way. \n\nYou’re tough as all hell, and you deserve better.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rxm7r3/want_to_fully_recover_from_a_restrictive_eating/",
  "score": 213,
  "num_comments": 45,
  "comments": [
    {
      "id": "hrjccqv",
      "author": "Sareeee48",
      "body": "This is a great post ❤️",
      "created_utc": 1641499988.0,
      "score": 24,
      "context": []
    },
    {
      "id": "hrjrwhb",
      "author": "Dutchess_of_Dimples",
      "body": "I hate this, but I know it's the truth.",
      "created_utc": 1641505721.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hrkleg4",
      "author": "__mirrorimage__",
      "body": "tysm for this post <3 i've been in recovery for a few months and body dysmorphia is hitting me like a train",
      "created_utc": 1641517103.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hrlwik6",
      "author": "missamethyst1",
      "body": "This is amazing, seriously thank you. The part about \"your body is innocent \" really resonated with me, especially. I have an autoimmune disorder that causes major physical issues including heart problems, I had 2 miscarriages and then cancer and then several major injuries that resulted in life threatening infections, and then several years of spiraling into worse and worse restriction, so I feel like I should be pretty amazed and grateful that my body has somehow decided to keep on going after all that.",
      "created_utc": 1641539555.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hrjhtb0",
      "author": "kayethx",
      "body": "Needed this so, so, so much. Thank you. <3",
      "created_utc": 1641501997.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hrkas0p",
      "author": "NaCheezIt",
      "body": "Y'all don't stop going to therapy!\n\n\nI haven't thought about my ED for years. I am so much happier now and i have absolutely no regrets about recovery and the effort I put into getting it done!\n\n\nOne point that is left for me personally, is that I stopped taking care of my mind after ED's hold came off of me. Whatever the cause of it was is still there. Finally getting back into therapy after years and things are so much better now.\n\n\nI wish all of you beautiful, intelligent, unique people the best of luck and hope you'll be free from that burden soon! It takes time to forget all the little ways it affects you but it DOES get better and it is very possible!\n\n💜💜💜",
      "created_utc": 1641512825.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hrmsb4g",
      "author": "Journalist-Certain",
      "body": "Thank you so much, I’ve been in recovery for a little over 6 months now and the weight gain + body dysmorphia has been bothering me throughout the process. The best thing I ever did was to stop weighing myself❤️",
      "created_utc": 1641561649.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hrlbrxp",
      "author": "sourcehunter9",
      "body": "Thank you so much for thus post.",
      "created_utc": 1641528280.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hrk9wvh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641512484.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrlbw15",
      "author": "None",
      "body": "i love this so much thank you :) i’m so much happier now after i overshot but i want to lose just a few pounds but i feel like i literally can’t",
      "created_utc": 1641528331.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hrn0kch",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641565444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrkxl2a",
      "author": "BedroomImpossible124",
      "body": "Thank you for the brutal honesty.  Idk if I can do it. I hate everything about my physical appearance.  It is only tolerable when restricting.  I also know I can't live long this way. And also I'm old so I don't have youthful resilience on my side. Heavy sigh, I'll continue in these nascent stages of recovery one meal at a time. All I can do at this moment.",
      "created_utc": 1641522167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpbfbl8",
      "author": "Agitated-Key-6836",
      "body": "Damn this really smacked some sense into me. Bro said “you’re body has done all this hard work to keep you alive!!” I was like dang good point, I guess it really does need he exercise and food !",
      "created_utc": 1727515982.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu9rs95",
      "author": "UnderstandsYourPain",
      "body": "Many people who are on this journey are not aware of what a beast recovery can be, and it can be helpful to know we are not alone in our struggles. Thank you for disseminating this knowledge <3\n\nFor others: not giving into the ED is not giving into a society plagued with diet culture that tells you lies such as that your value comes from the way you look. It’s not giving into the capitalism and the objectification of women. We are so much more than our bodies. Do it for every girl who has looked in the mirror and told herself she is not enough because her body doesn’t look a certain way. Do it for the life you could’ve lived and still could live without this disorder.",
      "created_utc": 1730162019.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrlzc61",
      "author": "hellhellhellhell",
      "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
      "created_utc": 1641541461.0,
      "score": -2,
      "context": []
    },
    {
      "id": "koyibn7",
      "author": "Hungry_Nectarine3326",
      "body": "How long does it take for the fat to start coming back in? I'm scared I won't be able to gain the fat back...I'm 10 days in to refeeding...it took a lot for me to even realize I needed to gain weight ..so now it's become a reverse thing in my mind...now afraid I won't be able to restore my fat..I have loose skin on my face legs and arms..from the rapid fat loss and super restricting /over exercising..skin just deflated ..\n\nHave been worried the fat on my face won't come back...just nervous over all ..I've been hyper aware of any \"change\" in my face and body and have major dysmorphia...been discouraged as I've seen no real fat on my body come back...I know it's only been 10 days..I do feel heavier...will the fat on my face be able to be restored from refeeding..and how long does it take for the fat to start expanding again ? (I know I kinda talked in a circle but that's how my brain has been feeling )",
      "created_utc": 1707094074.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hrjt73c",
      "author": "ultramarine-jade",
      "body": "Hope it helped to someone in some way! I’ve read a lot of your posts, and they’re all great posts 100% agree haha thanks for the straightforward truth you give.",
      "created_utc": 1641506189.0,
      "score": 14,
      "context": [
        {
          "id": "hrjccqv",
          "author": "Sareeee48",
          "body": "This is a great post ❤️",
          "created_utc": 1641499988.0
        }
      ]
    },
    {
      "id": "hrjug46",
      "author": "ultramarine-jade",
      "body": "I know this feeling I hated it and resisted it and tried everything I could or thought I could to “recover” without gaining the weight I needed and from that experience it doesn’t work there’s other way or truth. You’re going to hate it more than anything else in the world, but you have to just bite the bullet and do it if you want full recovery there’s no other choice but to let your body do what it needs to do. Fear of weight gain and body acceptance can be worked on but suffering from your ED and torturing yourself cannot be stopped without pursuing recovery. You can fucking do this I know you can and you know you can deep down as well ❤️",
      "created_utc": 1641506637.0,
      "score": 14,
      "context": [
        {
          "id": "hrjrwhb",
          "author": "Dutchess_of_Dimples",
          "body": "I hate this, but I know it's the truth.",
          "created_utc": 1641505721.0
        }
      ]
    },
    {
      "id": "hrkp8r3",
      "author": "ultramarine-jade",
      "body": "Congrats on sticking to recovery! It’s hard as fuck there’s no sugarcoating that, but, honestly, the body dysmorphia is a sign that you’re doing something your ED fucking hates its taking every chance and reason it can to convince you to relapse and hating your appearance is the easiest way to do it. It’s so unbelievable difficult to stomach that hatred, but it’s a big fuck you to the systems and people in place in addition to your ED who all want you to continue to hate yourself. YOU GOT THIS !! You’re doing the right thing without a doubt no matter how wrong it feels ❤️",
      "created_utc": 1641518698.0,
      "score": 10,
      "context": [
        {
          "id": "hrkleg4",
          "author": "__mirrorimage__",
          "body": "tysm for this post <3 i've been in recovery for a few months and body dysmorphia is hitting me like a train",
          "created_utc": 1641517103.0
        }
      ]
    },
    {
      "id": "hroev5p",
      "author": "ultramarine-jade",
      "body": "Damn your body is an absolute badass, and I for one, and probably so many of your loved ones and people who care about you, are endlessly grateful that it has continued to carry you forward. I hope this post was of some help, and whenever you are in the process of recovery I am sure every little thing you do no matter how small is making your body happy and stronger. Cheering you on ❤️",
      "created_utc": 1641583967.0,
      "score": 3,
      "context": [
        {
          "id": "hrlwik6",
          "author": "missamethyst1",
          "body": "This is amazing, seriously thank you. The part about \"your body is innocent \" really resonated with me, especially. I have an autoimmune disorder that causes major physical issues including heart problems, I had 2 miscarriages and then cancer and then several major injuries that resulted in life threatening infections, and then several years of spiraling into worse and worse restriction, so I feel like I should be pretty amazed and grateful that my body has somehow decided to keep on going after all that.",
          "created_utc": 1641539555.0
        }
      ]
    },
    {
      "id": "hrjtf0b",
      "author": "ultramarine-jade",
      "body": "Hey, you’ve got this! Whatever you’re doing towards your own recovery is good, true, and right fuck your ED ❤️",
      "created_utc": 1641506268.0,
      "score": 7,
      "context": [
        {
          "id": "hrjhtb0",
          "author": "kayethx",
          "body": "Needed this so, so, so much. Thank you. <3",
          "created_utc": 1641501997.0
        }
      ]
    },
    {
      "id": "hrkov7e",
      "author": "ultramarine-jade",
      "body": "YES GO TO THERAPY IF YOU CAN AFFORD IT !! But also eat eat eat eat honor mental and physical hunger gain weight but also go to therapy if you can take care of your brain as well as your body but the body stuff mostly should go first.",
      "created_utc": 1641518543.0,
      "score": 10,
      "context": [
        {
          "id": "hrkas0p",
          "author": "NaCheezIt",
          "body": "Y'all don't stop going to therapy!\n\n\nI haven't thought about my ED for years. I am so much happier now and i have absolutely no regrets about recovery and the effort I put into getting it done!\n\n\nOne point that is left for me personally, is that I stopped taking care of my mind after ED's hold came off of me. Whatever the cause of it was is still there. Finally getting back into therapy after years and things are so much better now.\n\n\nI wish all of you beautiful, intelligent, unique people the best of luck and hope you'll be free from that burden soon! It takes time to forget all the little ways it affects you but it DOES get better and it is very possible!\n\n💜💜💜",
          "created_utc": 1641512825.0
        }
      ]
    },
    {
      "id": "hrocsg1",
      "author": "ultramarine-jade",
      "body": "Yes! I tossed that stupid scale and haven’t looked back since. It did wonders honestly for my body dysmorphia. And hell yes 6 months let’s go baby that’s absolutely incredible gaining weight and healing your body to put you back on track to reach the happiness and fulfillment you deserve. Keep on going!",
      "created_utc": 1641583204.0,
      "score": 3,
      "context": [
        {
          "id": "hrmsb4g",
          "author": "Journalist-Certain",
          "body": "Thank you so much, I’ve been in recovery for a little over 6 months now and the weight gain + body dysmorphia has been bothering me throughout the process. The best thing I ever did was to stop weighing myself❤️",
          "created_utc": 1641561649.0
        }
      ]
    },
    {
      "id": "koyikq4",
      "author": "Hungry_Nectarine3326",
      "body": "How long did it take for the fat to start coming in again? I'm 10 days in to refeeding and am afraid the fat on my face especially and body won't return...crazy fear...but I am afraid",
      "created_utc": 1707094175.0,
      "score": 1,
      "context": [
        {
          "id": "hrmsb4g",
          "author": "Journalist-Certain",
          "body": "Thank you so much, I’ve been in recovery for a little over 6 months now and the weight gain + body dysmorphia has been bothering me throughout the process. The best thing I ever did was to stop weighing myself❤️",
          "created_utc": 1641561649.0
        }
      ]
    },
    {
      "id": "hroei53",
      "author": "ultramarine-jade",
      "body": "Glad it was of some use!",
      "created_utc": 1641583833.0,
      "score": 1,
      "context": [
        {
          "id": "hrlbrxp",
          "author": "sourcehunter9",
          "body": "Thank you so much for thus post.",
          "created_utc": 1641528280.0
        }
      ]
    },
    {
      "id": "hrkortz",
      "author": "ultramarine-jade",
      "body": "I’m glad it was of some help! I hope this truth offers something to you and the realization that you’re a fucking badass for saying fuck you to something that is hurting you. I’m cheering you on get the hell out and get in with your life that is of so much more value ❤️",
      "created_utc": 1641518504.0,
      "score": 4,
      "context": [
        {
          "id": "hrk9wvh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641512484.0
        }
      ]
    },
    {
      "id": "hroehfx",
      "author": "ultramarine-jade",
      "body": "Ahh it’s so great to hear that you are happier now that’s incredible ❤️ And you don’t have to lose that weight! Your body needs those extra pounds to function and holds onto them to know for sure that you won’t be entering another damaging period of restriction I thought of it as my body doing some safe and reasonable. If someone kept on fucking me over time and time again and suddenly became better I too would want some form of reassurance that they wouldn’t do it again. These extra pounds do not have to hinder you or get in the way of or diminish the happiness you found in recovery ❤️",
      "created_utc": 1641583825.0,
      "score": 2,
      "context": [
        {
          "id": "hrlbw15",
          "author": "None",
          "body": "i love this so much thank you :) i’m so much happier now after i overshot but i want to lose just a few pounds but i feel like i literally can’t",
          "created_utc": 1641528331.0
        }
      ]
    },
    {
      "id": "hrocj0k",
      "author": "ultramarine-jade",
      "body": "Glad it was of some use! Quasi-recovery honestly kicked my ass, and, for me at least, I really wished I had the wisdom to just do the damn thing and go all in the first time. Half assing recovery just made the process so excruciatingly long and left so much room for my brain to convince me to relapse. \n\nBut wherever you are in the process whatever you are doing I believe in you wholeheartedly ❤️",
      "created_utc": 1641583107.0,
      "score": 2,
      "context": [
        {
          "id": "hrn0kch",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565444.0
        }
      ]
    },
    {
      "id": "hrodsot",
      "author": "ultramarine-jade",
      "body": "I’m sending you a big hug ❤️ I know it’s so hard to do the exact thing your brain and entire being tell you time and time again is the worst thing ever, and there were certainly moments during my attempts at recovery and recovering in which I thought to myself I would rather die than gain weight. \n\nBut you’re never too old to recover, and the ED is just telling you to give up and resign yourself to a life of this type of suffering. Every single person deserves to be free of their ED regardless of anything and live long, meaningful lives. Whatever you are doing one bite at a time doing it consistently no matter how small becomes a more bearable action towards recovery. You can do this.",
      "created_utc": 1641583573.0,
      "score": 2,
      "context": [
        {
          "id": "hrkxl2a",
          "author": "BedroomImpossible124",
          "body": "Thank you for the brutal honesty.  Idk if I can do it. I hate everything about my physical appearance.  It is only tolerable when restricting.  I also know I can't live long this way. And also I'm old so I don't have youthful resilience on my side. Heavy sigh, I'll continue in these nascent stages of recovery one meal at a time. All I can do at this moment.",
          "created_utc": 1641522167.0
        }
      ]
    },
    {
      "id": "hrmn96q",
      "author": "Sareeee48",
      "body": "If you’re restricting, and binging in response to that restriction, you need to gain weight. You aren’t an exception, you just aren’t eating enough.",
      "created_utc": 1641558870.0,
      "score": 5,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        }
      ]
    },
    {
      "id": "hrn0h2y",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641565406.0,
      "score": 3,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        }
      ]
    },
    {
      "id": "hrksrmx",
      "author": "__mirrorimage__",
      "body": "thank you. seeing the body dysmorphia as a fuck you to the disease is a pretty great way to put things !",
      "created_utc": 1641520154.0,
      "score": 7,
      "context": [
        {
          "id": "hrkleg4",
          "author": "__mirrorimage__",
          "body": "tysm for this post <3 i've been in recovery for a few months and body dysmorphia is hitting me like a train",
          "created_utc": 1641517103.0
        },
        {
          "id": "hrkp8r3",
          "author": "ultramarine-jade",
          "body": "Congrats on sticking to recovery! It’s hard as fuck there’s no sugarcoating that, but, honestly, the body dysmorphia is a sign that you’re doing something your ED fucking hates its taking every chance and reason it can to convince you to relapse and hating your appearance is the easiest way to do it. It’s so unbelievable difficult to stomach that hatred, but it’s a big fuck you to the systems and people in place in addition to your ED who all want you to continue to hate yourself. YOU GOT THIS !! You’re doing the right thing without a doubt no matter how wrong it feels ❤️",
          "created_utc": 1641518698.0
        }
      ]
    },
    {
      "id": "hrqj08l",
      "author": "missamethyst1",
      "body": "Thank you so much for your kind words!! And yeah I am pretty amazingly grateful that in the midst of all that, my body has somehow kept on going,  and also allowed me to (insanely surprisingly, frankly) have a healthy baby. 😀",
      "created_utc": 1641615128.0,
      "score": 1,
      "context": [
        {
          "id": "hrlwik6",
          "author": "missamethyst1",
          "body": "This is amazing, seriously thank you. The part about \"your body is innocent \" really resonated with me, especially. I have an autoimmune disorder that causes major physical issues including heart problems, I had 2 miscarriages and then cancer and then several major injuries that resulted in life threatening infections, and then several years of spiraling into worse and worse restriction, so I feel like I should be pretty amazed and grateful that my body has somehow decided to keep on going after all that.",
          "created_utc": 1641539555.0
        },
        {
          "id": "hroev5p",
          "author": "ultramarine-jade",
          "body": "Damn your body is an absolute badass, and I for one, and probably so many of your loved ones and people who care about you, are endlessly grateful that it has continued to carry you forward. I hope this post was of some help, and whenever you are in the process of recovery I am sure every little thing you do no matter how small is making your body happy and stronger. Cheering you on ❤️",
          "created_utc": 1641583967.0
        }
      ]
    },
    {
      "id": "hrjvbuq",
      "author": "kayethx",
      "body": "Aw thank you so so so so much!!! Same to you!! <3 <3",
      "created_utc": 1641506959.0,
      "score": 5,
      "context": [
        {
          "id": "hrjhtb0",
          "author": "kayethx",
          "body": "Needed this so, so, so much. Thank you. <3",
          "created_utc": 1641501997.0
        },
        {
          "id": "hrjtf0b",
          "author": "ultramarine-jade",
          "body": "Hey, you’ve got this! Whatever you’re doing towards your own recovery is good, true, and right fuck your ED ❤️",
          "created_utc": 1641506268.0
        }
      ]
    },
    {
      "id": "hrkqken",
      "author": "NaCheezIt",
      "body": "Yes definitely I agree.",
      "created_utc": 1641519244.0,
      "score": 4,
      "context": [
        {
          "id": "hrkas0p",
          "author": "NaCheezIt",
          "body": "Y'all don't stop going to therapy!\n\n\nI haven't thought about my ED for years. I am so much happier now and i have absolutely no regrets about recovery and the effort I put into getting it done!\n\n\nOne point that is left for me personally, is that I stopped taking care of my mind after ED's hold came off of me. Whatever the cause of it was is still there. Finally getting back into therapy after years and things are so much better now.\n\n\nI wish all of you beautiful, intelligent, unique people the best of luck and hope you'll be free from that burden soon! It takes time to forget all the little ways it affects you but it DOES get better and it is very possible!\n\n💜💜💜",
          "created_utc": 1641512825.0
        },
        {
          "id": "hrkov7e",
          "author": "ultramarine-jade",
          "body": "YES GO TO THERAPY IF YOU CAN AFFORD IT !! But also eat eat eat eat honor mental and physical hunger gain weight but also go to therapy if you can take care of your brain as well as your body but the body stuff mostly should go first.",
          "created_utc": 1641518543.0
        }
      ]
    },
    {
      "id": "hroeet4",
      "author": "BedroomImpossible124",
      "body": "Thank you!! Carrying the strength from everyone here. Pushing through this week, and you know what? My body is hungry!",
      "created_utc": 1641583799.0,
      "score": 1,
      "context": [
        {
          "id": "hrkxl2a",
          "author": "BedroomImpossible124",
          "body": "Thank you for the brutal honesty.  Idk if I can do it. I hate everything about my physical appearance.  It is only tolerable when restricting.  I also know I can't live long this way. And also I'm old so I don't have youthful resilience on my side. Heavy sigh, I'll continue in these nascent stages of recovery one meal at a time. All I can do at this moment.",
          "created_utc": 1641522167.0
        },
        {
          "id": "hrodsot",
          "author": "ultramarine-jade",
          "body": "I’m sending you a big hug ❤️ I know it’s so hard to do the exact thing your brain and entire being tell you time and time again is the worst thing ever, and there were certainly moments during my attempts at recovery and recovering in which I thought to myself I would rather die than gain weight. \n\nBut you’re never too old to recover, and the ED is just telling you to give up and resign yourself to a life of this type of suffering. Every single person deserves to be free of their ED regardless of anything and live long, meaningful lives. Whatever you are doing one bite at a time doing it consistently no matter how small becomes a more bearable action towards recovery. You can do this.",
          "created_utc": 1641583573.0
        }
      ]
    },
    {
      "id": "hrnu9g5",
      "author": "hellhellhellhell",
      "body": "No, it's more like I see a binge trigger and then I try to compensate for the binging by restricting or purging. When I don't binge I don't feel the need to restrict and my weight remains stable.",
      "created_utc": 1641576562.0,
      "score": -1,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrmn96q",
          "author": "Sareeee48",
          "body": "If you’re restricting, and binging in response to that restriction, you need to gain weight. You aren’t an exception, you just aren’t eating enough.",
          "created_utc": 1641558870.0
        }
      ]
    },
    {
      "id": "hrnu1q1",
      "author": "hellhellhellhell",
      "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
      "created_utc": 1641576484.0,
      "score": -2,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        }
      ]
    },
    {
      "id": "hroi9rk",
      "author": "ultramarine-jade",
      "body": "And also a big fuck you to any corporations or societal system and diet culture to. You won’t let them convince you that healing your body and mind is a thing to hate about yourself. In fact, god damn there is nothing more beautiful inside and out than someone doing the work to better their own lives and going against a fucked up system. Keep on doing the hard work and leaving them in the dust ❤️",
      "created_utc": 1641585221.0,
      "score": 2,
      "context": [
        {
          "id": "hrkleg4",
          "author": "__mirrorimage__",
          "body": "tysm for this post <3 i've been in recovery for a few months and body dysmorphia is hitting me like a train",
          "created_utc": 1641517103.0
        },
        {
          "id": "hrkp8r3",
          "author": "ultramarine-jade",
          "body": "Congrats on sticking to recovery! It’s hard as fuck there’s no sugarcoating that, but, honestly, the body dysmorphia is a sign that you’re doing something your ED fucking hates its taking every chance and reason it can to convince you to relapse and hating your appearance is the easiest way to do it. It’s so unbelievable difficult to stomach that hatred, but it’s a big fuck you to the systems and people in place in addition to your ED who all want you to continue to hate yourself. YOU GOT THIS !! You’re doing the right thing without a doubt no matter how wrong it feels ❤️",
          "created_utc": 1641518698.0
        },
        {
          "id": "hrksrmx",
          "author": "__mirrorimage__",
          "body": "thank you. seeing the body dysmorphia as a fuck you to the disease is a pretty great way to put things !",
          "created_utc": 1641520154.0
        }
      ]
    },
    {
      "id": "hrohuh0",
      "author": "ultramarine-jade",
      "body": "YES !! This literally made my heart sing and made my day better. Even just one extra bite is enough on some days, and you say you don’t have youthful resilience but you are resilient and strong as all hell I can even tell from your response to this post alone wading through my wall of text and doing something in your life to just make it a little bit better. The fact that you want things to change is a testament to your tenacity. Period. You don’t have to be screaming from the top of your lungs or beating down walls to prove to yourself you have the strength to recover. You have everything within you to want to and move towards getting better. \n\nAnd, honestly, anyone with an ED is so fucking stubborn and smart and has an almost immortal sense of determination. Sure, it may be misplaced as fuck but know you have all of those qualities that can be channeled towards recovering whether you’re 10 or 39193992 years old. \n\nYour body is hungry! Get at it and fuel it to the best of your capabilities.",
      "created_utc": 1641585065.0,
      "score": 1,
      "context": [
        {
          "id": "hrkxl2a",
          "author": "BedroomImpossible124",
          "body": "Thank you for the brutal honesty.  Idk if I can do it. I hate everything about my physical appearance.  It is only tolerable when restricting.  I also know I can't live long this way. And also I'm old so I don't have youthful resilience on my side. Heavy sigh, I'll continue in these nascent stages of recovery one meal at a time. All I can do at this moment.",
          "created_utc": 1641522167.0
        },
        {
          "id": "hrodsot",
          "author": "ultramarine-jade",
          "body": "I’m sending you a big hug ❤️ I know it’s so hard to do the exact thing your brain and entire being tell you time and time again is the worst thing ever, and there were certainly moments during my attempts at recovery and recovering in which I thought to myself I would rather die than gain weight. \n\nBut you’re never too old to recover, and the ED is just telling you to give up and resign yourself to a life of this type of suffering. Every single person deserves to be free of their ED regardless of anything and live long, meaningful lives. Whatever you are doing one bite at a time doing it consistently no matter how small becomes a more bearable action towards recovery. You can do this.",
          "created_utc": 1641583573.0
        },
        {
          "id": "hroeet4",
          "author": "BedroomImpossible124",
          "body": "Thank you!! Carrying the strength from everyone here. Pushing through this week, and you know what? My body is hungry!",
          "created_utc": 1641583799.0
        }
      ]
    },
    {
      "id": "hrogcxp",
      "author": "ultramarine-jade",
      "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
      "created_utc": 1641584518.0,
      "score": 5,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        }
      ]
    },
    {
      "id": "hrps7vw",
      "author": "__mirrorimage__",
      "body": "i `love` that mindset. will definitely try to do that. good luck to you too leaving ed culture in the dust !!",
      "created_utc": 1641603169.0,
      "score": 1,
      "context": [
        {
          "id": "hrkleg4",
          "author": "__mirrorimage__",
          "body": "tysm for this post <3 i've been in recovery for a few months and body dysmorphia is hitting me like a train",
          "created_utc": 1641517103.0
        },
        {
          "id": "hrkp8r3",
          "author": "ultramarine-jade",
          "body": "Congrats on sticking to recovery! It’s hard as fuck there’s no sugarcoating that, but, honestly, the body dysmorphia is a sign that you’re doing something your ED fucking hates its taking every chance and reason it can to convince you to relapse and hating your appearance is the easiest way to do it. It’s so unbelievable difficult to stomach that hatred, but it’s a big fuck you to the systems and people in place in addition to your ED who all want you to continue to hate yourself. YOU GOT THIS !! You’re doing the right thing without a doubt no matter how wrong it feels ❤️",
          "created_utc": 1641518698.0
        },
        {
          "id": "hrksrmx",
          "author": "__mirrorimage__",
          "body": "thank you. seeing the body dysmorphia as a fuck you to the disease is a pretty great way to put things !",
          "created_utc": 1641520154.0
        },
        {
          "id": "hroi9rk",
          "author": "ultramarine-jade",
          "body": "And also a big fuck you to any corporations or societal system and diet culture to. You won’t let them convince you that healing your body and mind is a thing to hate about yourself. In fact, god damn there is nothing more beautiful inside and out than someone doing the work to better their own lives and going against a fucked up system. Keep on doing the hard work and leaving them in the dust ❤️",
          "created_utc": 1641585221.0
        }
      ]
    },
    {
      "id": "hrokptk",
      "author": "BedroomImpossible124",
      "body": "You are truly a special person 💗",
      "created_utc": 1641586133.0,
      "score": 1,
      "context": [
        {
          "id": "hrkxl2a",
          "author": "BedroomImpossible124",
          "body": "Thank you for the brutal honesty.  Idk if I can do it. I hate everything about my physical appearance.  It is only tolerable when restricting.  I also know I can't live long this way. And also I'm old so I don't have youthful resilience on my side. Heavy sigh, I'll continue in these nascent stages of recovery one meal at a time. All I can do at this moment.",
          "created_utc": 1641522167.0
        },
        {
          "id": "hrodsot",
          "author": "ultramarine-jade",
          "body": "I’m sending you a big hug ❤️ I know it’s so hard to do the exact thing your brain and entire being tell you time and time again is the worst thing ever, and there were certainly moments during my attempts at recovery and recovering in which I thought to myself I would rather die than gain weight. \n\nBut you’re never too old to recover, and the ED is just telling you to give up and resign yourself to a life of this type of suffering. Every single person deserves to be free of their ED regardless of anything and live long, meaningful lives. Whatever you are doing one bite at a time doing it consistently no matter how small becomes a more bearable action towards recovery. You can do this.",
          "created_utc": 1641583573.0
        },
        {
          "id": "hroeet4",
          "author": "BedroomImpossible124",
          "body": "Thank you!! Carrying the strength from everyone here. Pushing through this week, and you know what? My body is hungry!",
          "created_utc": 1641583799.0
        },
        {
          "id": "hrohuh0",
          "author": "ultramarine-jade",
          "body": "YES !! This literally made my heart sing and made my day better. Even just one extra bite is enough on some days, and you say you don’t have youthful resilience but you are resilient and strong as all hell I can even tell from your response to this post alone wading through my wall of text and doing something in your life to just make it a little bit better. The fact that you want things to change is a testament to your tenacity. Period. You don’t have to be screaming from the top of your lungs or beating down walls to prove to yourself you have the strength to recover. You have everything within you to want to and move towards getting better. \n\nAnd, honestly, anyone with an ED is so fucking stubborn and smart and has an almost immortal sense of determination. Sure, it may be misplaced as fuck but know you have all of those qualities that can be channeled towards recovering whether you’re 10 or 39193992 years old. \n\nYour body is hungry! Get at it and fuel it to the best of your capabilities.",
          "created_utc": 1641585065.0
        }
      ]
    },
    {
      "id": "hrpgeeg",
      "author": "hellhellhellhell",
      "body": "TW: fatphobia and trauma\n\nThank you so much for saying this. It's a complex problem. My ED stems from experiencing every imaginable form of child abuse my entire childhood. It goes hand in hand with trauma that will likely never be completely resolved. There isn't anyone in my life who cares if I have an ED. My ED is only giving me social benefits right now and recovery would incur a social penalty. I've never been loved unconditionally and know that the little value I have to other people is inversely correlated with my weight. \n\nIt's one of those problems that might not have been irremediable at some point in my life but in my current circumstances fixing the problem would be more costly than leaving it be. I compulsively spend because I need something to look forward to in a world without love or social engagements to look forward to (I can look forward to opening boxes.) The alternative to compulsive spending is death or being irresponsible about COVID (which would harm other people too). The alternative to having a \"high functioning\" ED for me right now is derailing my career to get treatment (and who will pay for it?) and incurring the social costs that would come with possibly gaining weight. \n\nMy low weight is the only physical feature I've ever been complimented on--it's the thing women tell me they're jealous of and women/men have explicitly told me they find \"cute\" or \"hot\" about me. \n\nBecause of the particular childhood trauma I experienced, I am hyperaware of physical sensations in my body--the discomfort of digestion or my waistband digging into my belly--and having control over my body is very important to me. \n\nI am constantly being reminded by the people in my life how important it is that I don't eat too much and get fat. Every day I hear \"you shouldn't be eating that right now or you're going to get fat.\" If I gained weight in recovery I would never hear the end of it and I'd most likely end up prediabetic again. For me, recovery would come at a high cost for unclear benefits.",
      "created_utc": 1641598260.0,
      "score": 2,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        },
        {
          "id": "hrogcxp",
          "author": "ultramarine-jade",
          "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
          "created_utc": 1641584518.0
        }
      ]
    },
    {
      "id": "hrpok3j",
      "author": "ultramarine-jade",
      "body": "I’m so sorry all of this happened to you, and please know that none of this is your fault at all. I know an ED can feel like or be a very safe coping mechanism, and I don’t want to say anything specific for fear of exacerbating anything right now given how complex your situation is. So please don’t read further if you’re looking for harm reduction or not looking for “tough love” or some attempt to promote recovery because at the end of the day no one on this sub or anyone for that matter can convince you to choose recovery other than yourself. \n\nSo, for this place as of now, I’ll just leave it at I wish the best for you and peace for you no matter what ❤️\n\n——— \n\nThe reality is almost every person with an ED goes through this bargaining process of being convinced that their ED is worth it and that losing it would be the end of the world. Whether it be for one reason or another, you’re not alone in the feeling that recovery may not be worth it and in fact may make life worse for you. The costs are insurmountably unjustifiable because the outcome of recovery is uncertain. It’s not certain you will be happier after it or you will be emotionally better. You’re not special in the sense that you think “recovery would come at a high cost with unclear benefits” it sounds really like your ED is convincing you that for you specifically this is true when in fact basically everyone who has to gain weight has to face this fear in an extremely fatphobic society entrenched in diet culture in which people are constantly commenting on what we eat and what we wear. I can guarantee you almost that everyone on this sub has felt this way one way or another, but, yet still, a lot of people still manage to recover from situations “better” than or “worse” than yours. A lot of anorexics get complimented on their “figure” and are criticized whether it be from toxic family members or concern trolls about what they eat in recovery or changes in body size as they recover there are endless amounts of posts on this sub expressing fear of weight gain and trauma and criticisms of their body weight but yet they persist also. We all want control of our bodies and want to seem attractive to people post after post express this sort of sentiment and users constantly share about x family member calling them slovenly or y random stranger commenting on their body shape but as much as that hurts no one has to live with the consequences of an eating disorder other than you of course it’s easy for someone else to say whatever the fuck they want because they don’t have to deal with the self-hatred, isolation, body dysmorphia, and mental agony you will have to endure with an eating disorder. \n\nNow, none of this at all invalidates or disrespects the personal experiences and trauma you’ve gone through my intention is not to talk you down or diminish your trials and tribulations whatever I say doesn’t impact your lived truth at all. But it really sounds like there is a part of you that wants to recover but it’s buried underneath all of this grasping for justification that for only you recovery won’t be worth it and that only you will suffer heavy judgment and criticisms about your appearance when, in truth, everyone who has chosen to recover will go through the same questions and thoughts. Even if no one on the face of this planet cares about you having an ED you have to care about yourself you have to hold yourself accountable for your own life just like every single one of us has to push onwards regardless of whether or not we have teams of loved ones or no one. And the fact that there are random internet strangers alongside you in this struggle hopefully shows that someone somewhere does care that you are suffering. Furthermore, if you say you’ve never been loved unconditionally despite being at a lower weight, then doesn’t that somehow prove to you in some way that being in this body won’t necessarily bring you that true love or attention you seem to desire?\n\nThere’s also no such thing as a “high-functioning” eating disorder it’s just tricking you into thinking that you can live like this forever when it’s almost 100% certain that such a lifestyle is unsustainable. Whether it be emotionally or physically at some point it will break and do much more than simply derail your career or incur social costs. I know it may feel as if you’re invincible or if this isn’t true or honestly maybe a comfort or benefit even that eating disorders have a very high mortality rate, but the fact that you express a care about your career and social engagements and love indicates that you want to do things that you objectively cannot do if you are dead. Living with an eating disorder is just a ticking clock. And, again, if people knew your low weight as the result of an eating disorder I highly doubt they would continue to compliment you or be “jealous” of your figure if they knew because having an eating disorder is objectively horrific and undesirable in the eyes of others maybe the physical consequences at a surface level may seem nice but no one and I mean no one would call you hot or adorable if they knew the truth of exactly what you do to get to that figure. \n\nEverything here you’re still going to have to work through and heal in one way or another. Recovery doesn’t erase these issues. But what recovery does give you back is the physical health of repairing the non-permanent damage a long term eating disorder has.\n\nApologies if I have caused any harm or seem on my soap box, but I too have been in this place of using my personal and very real traumas and sufferings to justify not recovering. Recovering doesn’t erase that suffering or make it any better, but lingering with your ED as a coping mechanism keeps it tolerable but never ever will fix or address the issue. It is much much easier to stay in this certain level of suffering when recovery essentially entails uncertainty and discomfort, but this isn’t the way you have to live forever I promise promise you that things can change.\n\n—- \n\nBut whatever it is I don’t want to say anything to hurt your or harm you in any way there’s so much on your plate already I sincerely do not mean to patronize or insult or diminish all that you’ve been through I wish I could say anything or something to be more helpful but a lot of people on this sub do see you and care about you in the capacity we have and are rooting for you.",
      "created_utc": 1641601610.0,
      "score": 4,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        },
        {
          "id": "hrogcxp",
          "author": "ultramarine-jade",
          "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
          "created_utc": 1641584518.0
        },
        {
          "id": "hrpgeeg",
          "author": "hellhellhellhell",
          "body": "TW: fatphobia and trauma\n\nThank you so much for saying this. It's a complex problem. My ED stems from experiencing every imaginable form of child abuse my entire childhood. It goes hand in hand with trauma that will likely never be completely resolved. There isn't anyone in my life who cares if I have an ED. My ED is only giving me social benefits right now and recovery would incur a social penalty. I've never been loved unconditionally and know that the little value I have to other people is inversely correlated with my weight. \n\nIt's one of those problems that might not have been irremediable at some point in my life but in my current circumstances fixing the problem would be more costly than leaving it be. I compulsively spend because I need something to look forward to in a world without love or social engagements to look forward to (I can look forward to opening boxes.) The alternative to compulsive spending is death or being irresponsible about COVID (which would harm other people too). The alternative to having a \"high functioning\" ED for me right now is derailing my career to get treatment (and who will pay for it?) and incurring the social costs that would come with possibly gaining weight. \n\nMy low weight is the only physical feature I've ever been complimented on--it's the thing women tell me they're jealous of and women/men have explicitly told me they find \"cute\" or \"hot\" about me. \n\nBecause of the particular childhood trauma I experienced, I am hyperaware of physical sensations in my body--the discomfort of digestion or my waistband digging into my belly--and having control over my body is very important to me. \n\nI am constantly being reminded by the people in my life how important it is that I don't eat too much and get fat. Every day I hear \"you shouldn't be eating that right now or you're going to get fat.\" If I gained weight in recovery I would never hear the end of it and I'd most likely end up prediabetic again. For me, recovery would come at a high cost for unclear benefits.",
          "created_utc": 1641598260.0
        }
      ]
    },
    {
      "id": "hrq080t",
      "author": "hellhellhellhell",
      "body": "Thank you so much for this thoughtful response. You've given me so much to think about.",
      "created_utc": 1641606609.0,
      "score": 1,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        },
        {
          "id": "hrogcxp",
          "author": "ultramarine-jade",
          "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
          "created_utc": 1641584518.0
        },
        {
          "id": "hrpgeeg",
          "author": "hellhellhellhell",
          "body": "TW: fatphobia and trauma\n\nThank you so much for saying this. It's a complex problem. My ED stems from experiencing every imaginable form of child abuse my entire childhood. It goes hand in hand with trauma that will likely never be completely resolved. There isn't anyone in my life who cares if I have an ED. My ED is only giving me social benefits right now and recovery would incur a social penalty. I've never been loved unconditionally and know that the little value I have to other people is inversely correlated with my weight. \n\nIt's one of those problems that might not have been irremediable at some point in my life but in my current circumstances fixing the problem would be more costly than leaving it be. I compulsively spend because I need something to look forward to in a world without love or social engagements to look forward to (I can look forward to opening boxes.) The alternative to compulsive spending is death or being irresponsible about COVID (which would harm other people too). The alternative to having a \"high functioning\" ED for me right now is derailing my career to get treatment (and who will pay for it?) and incurring the social costs that would come with possibly gaining weight. \n\nMy low weight is the only physical feature I've ever been complimented on--it's the thing women tell me they're jealous of and women/men have explicitly told me they find \"cute\" or \"hot\" about me. \n\nBecause of the particular childhood trauma I experienced, I am hyperaware of physical sensations in my body--the discomfort of digestion or my waistband digging into my belly--and having control over my body is very important to me. \n\nI am constantly being reminded by the people in my life how important it is that I don't eat too much and get fat. Every day I hear \"you shouldn't be eating that right now or you're going to get fat.\" If I gained weight in recovery I would never hear the end of it and I'd most likely end up prediabetic again. For me, recovery would come at a high cost for unclear benefits.",
          "created_utc": 1641598260.0
        },
        {
          "id": "hrpok3j",
          "author": "ultramarine-jade",
          "body": "I’m so sorry all of this happened to you, and please know that none of this is your fault at all. I know an ED can feel like or be a very safe coping mechanism, and I don’t want to say anything specific for fear of exacerbating anything right now given how complex your situation is. So please don’t read further if you’re looking for harm reduction or not looking for “tough love” or some attempt to promote recovery because at the end of the day no one on this sub or anyone for that matter can convince you to choose recovery other than yourself. \n\nSo, for this place as of now, I’ll just leave it at I wish the best for you and peace for you no matter what ❤️\n\n——— \n\nThe reality is almost every person with an ED goes through this bargaining process of being convinced that their ED is worth it and that losing it would be the end of the world. Whether it be for one reason or another, you’re not alone in the feeling that recovery may not be worth it and in fact may make life worse for you. The costs are insurmountably unjustifiable because the outcome of recovery is uncertain. It’s not certain you will be happier after it or you will be emotionally better. You’re not special in the sense that you think “recovery would come at a high cost with unclear benefits” it sounds really like your ED is convincing you that for you specifically this is true when in fact basically everyone who has to gain weight has to face this fear in an extremely fatphobic society entrenched in diet culture in which people are constantly commenting on what we eat and what we wear. I can guarantee you almost that everyone on this sub has felt this way one way or another, but, yet still, a lot of people still manage to recover from situations “better” than or “worse” than yours. A lot of anorexics get complimented on their “figure” and are criticized whether it be from toxic family members or concern trolls about what they eat in recovery or changes in body size as they recover there are endless amounts of posts on this sub expressing fear of weight gain and trauma and criticisms of their body weight but yet they persist also. We all want control of our bodies and want to seem attractive to people post after post express this sort of sentiment and users constantly share about x family member calling them slovenly or y random stranger commenting on their body shape but as much as that hurts no one has to live with the consequences of an eating disorder other than you of course it’s easy for someone else to say whatever the fuck they want because they don’t have to deal with the self-hatred, isolation, body dysmorphia, and mental agony you will have to endure with an eating disorder. \n\nNow, none of this at all invalidates or disrespects the personal experiences and trauma you’ve gone through my intention is not to talk you down or diminish your trials and tribulations whatever I say doesn’t impact your lived truth at all. But it really sounds like there is a part of you that wants to recover but it’s buried underneath all of this grasping for justification that for only you recovery won’t be worth it and that only you will suffer heavy judgment and criticisms about your appearance when, in truth, everyone who has chosen to recover will go through the same questions and thoughts. Even if no one on the face of this planet cares about you having an ED you have to care about yourself you have to hold yourself accountable for your own life just like every single one of us has to push onwards regardless of whether or not we have teams of loved ones or no one. And the fact that there are random internet strangers alongside you in this struggle hopefully shows that someone somewhere does care that you are suffering. Furthermore, if you say you’ve never been loved unconditionally despite being at a lower weight, then doesn’t that somehow prove to you in some way that being in this body won’t necessarily bring you that true love or attention you seem to desire?\n\nThere’s also no such thing as a “high-functioning” eating disorder it’s just tricking you into thinking that you can live like this forever when it’s almost 100% certain that such a lifestyle is unsustainable. Whether it be emotionally or physically at some point it will break and do much more than simply derail your career or incur social costs. I know it may feel as if you’re invincible or if this isn’t true or honestly maybe a comfort or benefit even that eating disorders have a very high mortality rate, but the fact that you express a care about your career and social engagements and love indicates that you want to do things that you objectively cannot do if you are dead. Living with an eating disorder is just a ticking clock. And, again, if people knew your low weight as the result of an eating disorder I highly doubt they would continue to compliment you or be “jealous” of your figure if they knew because having an eating disorder is objectively horrific and undesirable in the eyes of others maybe the physical consequences at a surface level may seem nice but no one and I mean no one would call you hot or adorable if they knew the truth of exactly what you do to get to that figure. \n\nEverything here you’re still going to have to work through and heal in one way or another. Recovery doesn’t erase these issues. But what recovery does give you back is the physical health of repairing the non-permanent damage a long term eating disorder has.\n\nApologies if I have caused any harm or seem on my soap box, but I too have been in this place of using my personal and very real traumas and sufferings to justify not recovering. Recovering doesn’t erase that suffering or make it any better, but lingering with your ED as a coping mechanism keeps it tolerable but never ever will fix or address the issue. It is much much easier to stay in this certain level of suffering when recovery essentially entails uncertainty and discomfort, but this isn’t the way you have to live forever I promise promise you that things can change.\n\n—- \n\nBut whatever it is I don’t want to say anything to hurt your or harm you in any way there’s so much on your plate already I sincerely do not mean to patronize or insult or diminish all that you’ve been through I wish I could say anything or something to be more helpful but a lot of people on this sub do see you and care about you in the capacity we have and are rooting for you.",
          "created_utc": 1641601610.0
        }
      ]
    },
    {
      "id": "hrr4qlx",
      "author": "ultramarine-jade",
      "body": "Nothing that happened to you was your fault. No matter what you’re not resigned to any “fate” of any kind. You do want more than and different from what you have now. You’re certainly not alone, and just know a bunch of random internet strangers are alongside you hoping for the best for you xx",
      "created_utc": 1641628146.0,
      "score": 3,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        },
        {
          "id": "hrogcxp",
          "author": "ultramarine-jade",
          "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
          "created_utc": 1641584518.0
        },
        {
          "id": "hrpgeeg",
          "author": "hellhellhellhell",
          "body": "TW: fatphobia and trauma\n\nThank you so much for saying this. It's a complex problem. My ED stems from experiencing every imaginable form of child abuse my entire childhood. It goes hand in hand with trauma that will likely never be completely resolved. There isn't anyone in my life who cares if I have an ED. My ED is only giving me social benefits right now and recovery would incur a social penalty. I've never been loved unconditionally and know that the little value I have to other people is inversely correlated with my weight. \n\nIt's one of those problems that might not have been irremediable at some point in my life but in my current circumstances fixing the problem would be more costly than leaving it be. I compulsively spend because I need something to look forward to in a world without love or social engagements to look forward to (I can look forward to opening boxes.) The alternative to compulsive spending is death or being irresponsible about COVID (which would harm other people too). The alternative to having a \"high functioning\" ED for me right now is derailing my career to get treatment (and who will pay for it?) and incurring the social costs that would come with possibly gaining weight. \n\nMy low weight is the only physical feature I've ever been complimented on--it's the thing women tell me they're jealous of and women/men have explicitly told me they find \"cute\" or \"hot\" about me. \n\nBecause of the particular childhood trauma I experienced, I am hyperaware of physical sensations in my body--the discomfort of digestion or my waistband digging into my belly--and having control over my body is very important to me. \n\nI am constantly being reminded by the people in my life how important it is that I don't eat too much and get fat. Every day I hear \"you shouldn't be eating that right now or you're going to get fat.\" If I gained weight in recovery I would never hear the end of it and I'd most likely end up prediabetic again. For me, recovery would come at a high cost for unclear benefits.",
          "created_utc": 1641598260.0
        },
        {
          "id": "hrpok3j",
          "author": "ultramarine-jade",
          "body": "I’m so sorry all of this happened to you, and please know that none of this is your fault at all. I know an ED can feel like or be a very safe coping mechanism, and I don’t want to say anything specific for fear of exacerbating anything right now given how complex your situation is. So please don’t read further if you’re looking for harm reduction or not looking for “tough love” or some attempt to promote recovery because at the end of the day no one on this sub or anyone for that matter can convince you to choose recovery other than yourself. \n\nSo, for this place as of now, I’ll just leave it at I wish the best for you and peace for you no matter what ❤️\n\n——— \n\nThe reality is almost every person with an ED goes through this bargaining process of being convinced that their ED is worth it and that losing it would be the end of the world. Whether it be for one reason or another, you’re not alone in the feeling that recovery may not be worth it and in fact may make life worse for you. The costs are insurmountably unjustifiable because the outcome of recovery is uncertain. It’s not certain you will be happier after it or you will be emotionally better. You’re not special in the sense that you think “recovery would come at a high cost with unclear benefits” it sounds really like your ED is convincing you that for you specifically this is true when in fact basically everyone who has to gain weight has to face this fear in an extremely fatphobic society entrenched in diet culture in which people are constantly commenting on what we eat and what we wear. I can guarantee you almost that everyone on this sub has felt this way one way or another, but, yet still, a lot of people still manage to recover from situations “better” than or “worse” than yours. A lot of anorexics get complimented on their “figure” and are criticized whether it be from toxic family members or concern trolls about what they eat in recovery or changes in body size as they recover there are endless amounts of posts on this sub expressing fear of weight gain and trauma and criticisms of their body weight but yet they persist also. We all want control of our bodies and want to seem attractive to people post after post express this sort of sentiment and users constantly share about x family member calling them slovenly or y random stranger commenting on their body shape but as much as that hurts no one has to live with the consequences of an eating disorder other than you of course it’s easy for someone else to say whatever the fuck they want because they don’t have to deal with the self-hatred, isolation, body dysmorphia, and mental agony you will have to endure with an eating disorder. \n\nNow, none of this at all invalidates or disrespects the personal experiences and trauma you’ve gone through my intention is not to talk you down or diminish your trials and tribulations whatever I say doesn’t impact your lived truth at all. But it really sounds like there is a part of you that wants to recover but it’s buried underneath all of this grasping for justification that for only you recovery won’t be worth it and that only you will suffer heavy judgment and criticisms about your appearance when, in truth, everyone who has chosen to recover will go through the same questions and thoughts. Even if no one on the face of this planet cares about you having an ED you have to care about yourself you have to hold yourself accountable for your own life just like every single one of us has to push onwards regardless of whether or not we have teams of loved ones or no one. And the fact that there are random internet strangers alongside you in this struggle hopefully shows that someone somewhere does care that you are suffering. Furthermore, if you say you’ve never been loved unconditionally despite being at a lower weight, then doesn’t that somehow prove to you in some way that being in this body won’t necessarily bring you that true love or attention you seem to desire?\n\nThere’s also no such thing as a “high-functioning” eating disorder it’s just tricking you into thinking that you can live like this forever when it’s almost 100% certain that such a lifestyle is unsustainable. Whether it be emotionally or physically at some point it will break and do much more than simply derail your career or incur social costs. I know it may feel as if you’re invincible or if this isn’t true or honestly maybe a comfort or benefit even that eating disorders have a very high mortality rate, but the fact that you express a care about your career and social engagements and love indicates that you want to do things that you objectively cannot do if you are dead. Living with an eating disorder is just a ticking clock. And, again, if people knew your low weight as the result of an eating disorder I highly doubt they would continue to compliment you or be “jealous” of your figure if they knew because having an eating disorder is objectively horrific and undesirable in the eyes of others maybe the physical consequences at a surface level may seem nice but no one and I mean no one would call you hot or adorable if they knew the truth of exactly what you do to get to that figure. \n\nEverything here you’re still going to have to work through and heal in one way or another. Recovery doesn’t erase these issues. But what recovery does give you back is the physical health of repairing the non-permanent damage a long term eating disorder has.\n\nApologies if I have caused any harm or seem on my soap box, but I too have been in this place of using my personal and very real traumas and sufferings to justify not recovering. Recovering doesn’t erase that suffering or make it any better, but lingering with your ED as a coping mechanism keeps it tolerable but never ever will fix or address the issue. It is much much easier to stay in this certain level of suffering when recovery essentially entails uncertainty and discomfort, but this isn’t the way you have to live forever I promise promise you that things can change.\n\n—- \n\nBut whatever it is I don’t want to say anything to hurt your or harm you in any way there’s so much on your plate already I sincerely do not mean to patronize or insult or diminish all that you’ve been through I wish I could say anything or something to be more helpful but a lot of people on this sub do see you and care about you in the capacity we have and are rooting for you.",
          "created_utc": 1641601610.0
        },
        {
          "id": "hrq080t",
          "author": "hellhellhellhell",
          "body": "Thank you so much for this thoughtful response. You've given me so much to think about.",
          "created_utc": 1641606609.0
        }
      ]
    },
    {
      "id": "hs8zk9a",
      "author": "hellhellhellhell",
      "body": "Thank you. <3 I'm wishing all of you the best too.",
      "created_utc": 1641930482.0,
      "score": 1,
      "context": [
        {
          "id": "hrlzc61",
          "author": "hellhellhellhell",
          "body": "In my case, I binge and restrict and when I was last in remission my weight didn't change at all because I was neither binging nor restricting. But, I'm probably a rare exception.",
          "created_utc": 1641541461.0
        },
        {
          "id": "hrn0h2y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641565406.0
        },
        {
          "id": "hrnu1q1",
          "author": "hellhellhellhell",
          "body": "I'd rather just die. I don't think recovery is realistic for me at this point. It's been more than half of my life.",
          "created_utc": 1641576484.0
        },
        {
          "id": "hrogcxp",
          "author": "ultramarine-jade",
          "body": "I wish I could do something anything to undo this fucked up situation for you and stop it from happening in the first place, but you’re not alone and I’m sending you a big hug. Please, don’t give up on recovering or the desire for it no matter how small an action every single day to challenge your ED is enough even if it’s just one extra bite a day. \n\nI know it’s so fucking hard and there were so many moments I thought I would rather die than gain weight. But, what helped for me and if you do not think this is helpful please ignore me, I would say all the thoughts my ED would tell me to keep me suffering out loud over and over again until I realized how fucking absolute stupid they were. That I would somehow be willing to throw away my life that so many people I love have an influence on and who put their belief, time, energy, and resources into making as positive as possible and my dreams, privilege, and ability to use that privilege to one day help others for a couple of pounds or an extra snack was fucking ridiculous when I looked at it out of context of my ED. It made me so angry that diet culture and all of the capitalist corporations and what not had convinced me that the judgments and opinions of strangers the fear of looking in a way that may or may not conform to their toxic beliefs could lead me to not only abuse myself but want to end my own life. It’s not fucking worth it. The reality is that if I died to preserve my own perceived thinness no one would give a flying fuck certainly not me because I would be dead. I wouldn’t have earned any good person moral points I wouldn’t have been called hot or skinny or thin or attractive because I would have literally just been a corpse if I had let my ED convince myself this is the only way out. And I sure as fucking hell wouldn’t let my ED convince me to die with it. \n\nRecovery will never ever seem “realistic” to anyone with an ED. You will never feel sick enough or ready enough to do it. But know for certain that if you do not do it and heal your body you will not only live in this way forever but most likely get worse and worse. And then diet culture and people profiting off of your self-hatred would have won and your loved ones and the world would have lost a wonderful person capable of so much more than keeping off some weight who could have made the planet a better place for someone else.\n\nIt doesn’t matter how much of your life you’ve spent with your ED you can get out. In fact, as ass backwards as this may sound, some people believe that people who have spent more time with their ED recover quicker if they take their years of suffering as fiery motivation to recover. You do not have to be stuck in this place with these thoughts. You can fucking do this as much as you have stuck to your ED you can channel that attachments towards recovery. You can always try recovery and see how it is to just do one day.",
          "created_utc": 1641584518.0
        },
        {
          "id": "hrpgeeg",
          "author": "hellhellhellhell",
          "body": "TW: fatphobia and trauma\n\nThank you so much for saying this. It's a complex problem. My ED stems from experiencing every imaginable form of child abuse my entire childhood. It goes hand in hand with trauma that will likely never be completely resolved. There isn't anyone in my life who cares if I have an ED. My ED is only giving me social benefits right now and recovery would incur a social penalty. I've never been loved unconditionally and know that the little value I have to other people is inversely correlated with my weight. \n\nIt's one of those problems that might not have been irremediable at some point in my life but in my current circumstances fixing the problem would be more costly than leaving it be. I compulsively spend because I need something to look forward to in a world without love or social engagements to look forward to (I can look forward to opening boxes.) The alternative to compulsive spending is death or being irresponsible about COVID (which would harm other people too). The alternative to having a \"high functioning\" ED for me right now is derailing my career to get treatment (and who will pay for it?) and incurring the social costs that would come with possibly gaining weight. \n\nMy low weight is the only physical feature I've ever been complimented on--it's the thing women tell me they're jealous of and women/men have explicitly told me they find \"cute\" or \"hot\" about me. \n\nBecause of the particular childhood trauma I experienced, I am hyperaware of physical sensations in my body--the discomfort of digestion or my waistband digging into my belly--and having control over my body is very important to me. \n\nI am constantly being reminded by the people in my life how important it is that I don't eat too much and get fat. Every day I hear \"you shouldn't be eating that right now or you're going to get fat.\" If I gained weight in recovery I would never hear the end of it and I'd most likely end up prediabetic again. For me, recovery would come at a high cost for unclear benefits.",
          "created_utc": 1641598260.0
        },
        {
          "id": "hrpok3j",
          "author": "ultramarine-jade",
          "body": "I’m so sorry all of this happened to you, and please know that none of this is your fault at all. I know an ED can feel like or be a very safe coping mechanism, and I don’t want to say anything specific for fear of exacerbating anything right now given how complex your situation is. So please don’t read further if you’re looking for harm reduction or not looking for “tough love” or some attempt to promote recovery because at the end of the day no one on this sub or anyone for that matter can convince you to choose recovery other than yourself. \n\nSo, for this place as of now, I’ll just leave it at I wish the best for you and peace for you no matter what ❤️\n\n——— \n\nThe reality is almost every person with an ED goes through this bargaining process of being convinced that their ED is worth it and that losing it would be the end of the world. Whether it be for one reason or another, you’re not alone in the feeling that recovery may not be worth it and in fact may make life worse for you. The costs are insurmountably unjustifiable because the outcome of recovery is uncertain. It’s not certain you will be happier after it or you will be emotionally better. You’re not special in the sense that you think “recovery would come at a high cost with unclear benefits” it sounds really like your ED is convincing you that for you specifically this is true when in fact basically everyone who has to gain weight has to face this fear in an extremely fatphobic society entrenched in diet culture in which people are constantly commenting on what we eat and what we wear. I can guarantee you almost that everyone on this sub has felt this way one way or another, but, yet still, a lot of people still manage to recover from situations “better” than or “worse” than yours. A lot of anorexics get complimented on their “figure” and are criticized whether it be from toxic family members or concern trolls about what they eat in recovery or changes in body size as they recover there are endless amounts of posts on this sub expressing fear of weight gain and trauma and criticisms of their body weight but yet they persist also. We all want control of our bodies and want to seem attractive to people post after post express this sort of sentiment and users constantly share about x family member calling them slovenly or y random stranger commenting on their body shape but as much as that hurts no one has to live with the consequences of an eating disorder other than you of course it’s easy for someone else to say whatever the fuck they want because they don’t have to deal with the self-hatred, isolation, body dysmorphia, and mental agony you will have to endure with an eating disorder. \n\nNow, none of this at all invalidates or disrespects the personal experiences and trauma you’ve gone through my intention is not to talk you down or diminish your trials and tribulations whatever I say doesn’t impact your lived truth at all. But it really sounds like there is a part of you that wants to recover but it’s buried underneath all of this grasping for justification that for only you recovery won’t be worth it and that only you will suffer heavy judgment and criticisms about your appearance when, in truth, everyone who has chosen to recover will go through the same questions and thoughts. Even if no one on the face of this planet cares about you having an ED you have to care about yourself you have to hold yourself accountable for your own life just like every single one of us has to push onwards regardless of whether or not we have teams of loved ones or no one. And the fact that there are random internet strangers alongside you in this struggle hopefully shows that someone somewhere does care that you are suffering. Furthermore, if you say you’ve never been loved unconditionally despite being at a lower weight, then doesn’t that somehow prove to you in some way that being in this body won’t necessarily bring you that true love or attention you seem to desire?\n\nThere’s also no such thing as a “high-functioning” eating disorder it’s just tricking you into thinking that you can live like this forever when it’s almost 100% certain that such a lifestyle is unsustainable. Whether it be emotionally or physically at some point it will break and do much more than simply derail your career or incur social costs. I know it may feel as if you’re invincible or if this isn’t true or honestly maybe a comfort or benefit even that eating disorders have a very high mortality rate, but the fact that you express a care about your career and social engagements and love indicates that you want to do things that you objectively cannot do if you are dead. Living with an eating disorder is just a ticking clock. And, again, if people knew your low weight as the result of an eating disorder I highly doubt they would continue to compliment you or be “jealous” of your figure if they knew because having an eating disorder is objectively horrific and undesirable in the eyes of others maybe the physical consequences at a surface level may seem nice but no one and I mean no one would call you hot or adorable if they knew the truth of exactly what you do to get to that figure. \n\nEverything here you’re still going to have to work through and heal in one way or another. Recovery doesn’t erase these issues. But what recovery does give you back is the physical health of repairing the non-permanent damage a long term eating disorder has.\n\nApologies if I have caused any harm or seem on my soap box, but I too have been in this place of using my personal and very real traumas and sufferings to justify not recovering. Recovering doesn’t erase that suffering or make it any better, but lingering with your ED as a coping mechanism keeps it tolerable but never ever will fix or address the issue. It is much much easier to stay in this certain level of suffering when recovery essentially entails uncertainty and discomfort, but this isn’t the way you have to live forever I promise promise you that things can change.\n\n—- \n\nBut whatever it is I don’t want to say anything to hurt your or harm you in any way there’s so much on your plate already I sincerely do not mean to patronize or insult or diminish all that you’ve been through I wish I could say anything or something to be more helpful but a lot of people on this sub do see you and care about you in the capacity we have and are rooting for you.",
          "created_utc": 1641601610.0
        },
        {
          "id": "hrq080t",
          "author": "hellhellhellhell",
          "body": "Thank you so much for this thoughtful response. You've given me so much to think about.",
          "created_utc": 1641606609.0
        },
        {
          "id": "hrr4qlx",
          "author": "ultramarine-jade",
          "body": "Nothing that happened to you was your fault. No matter what you’re not resigned to any “fate” of any kind. You do want more than and different from what you have now. You’re certainly not alone, and just know a bunch of random internet strangers are alongside you hoping for the best for you xx",
          "created_utc": 1641628146.0
        }
      ]
    }
  ]
}