{
  "id": "rzvu5f",
  "subreddit": "fuckeatingdisorders",
  "author": "Funky_Lesbian",
  "created_utc": 1641747159.0,
  "title": "“if you ate today”",
  "selftext": "anyone else find it incredibly triggering when “positive” posts are like “if you ate today, i’m proud of you”, “if you haven’t eaten today, here’s a reminder”, “you deserve to eat today” and such? like, even at the worst of my eating disorder, i still ate at least three times a day. eating does not mean eating enough, and people with restrictive eds do in fact eat! otherwise we’d all be dead! i think i find it very triggering because my ed brain sees those posts and assumes, “well, i ate today, so i must be in recovery! i’m not sick!” unpopular opinion perhaps, but i think we need to clarify that eating in and of itself is not at all indicative of recovery progress. we should praise people for eating ENOUGH, rather than reinforcing their eating disorders by framing eating anything at all as a major success.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/rzvu5f/if_you_ate_today/",
  "score": 174,
  "num_comments": 13,
  "comments": [
    {
      "id": "hrxn0oa",
      "author": "emotional1frog",
      "body": "I mean the random posts don't really trigger me but when someone in my life says stuff along those lines it does bother me. Like I had someone ask me once if I was starving myself and I'm like \"yeah...technically I am always starving, I constantly eat at a calorie deficient below my means.\" like I had just gotten done complaining about my anorexia to them too which is why I  was even more confused by their question. Then they said \"No, I mean like are you actually eating any food? I already know you're not eating enough most days. I was more worried about you not eating at all.\" Like jeez...both are still very harmful for you lol.",
      "created_utc": 1641747599.0,
      "score": 47,
      "context": []
    },
    {
      "id": "hrxnwn0",
      "author": "musingsofamdc",
      "body": "Yes, I find it incredibly invalidating!! A sent a friend a photo of my brunch yesterday, that was incredibly low cal / high volume and she said “wow that’s a lot of food!” And I immediately felt like shit. I constantly get upset when people say “you eat a lot though.” Sure Karen, but I’m still starving. Ask my therapist and dietitian. People just don’t get it. And I’m tired of explaining it.",
      "created_utc": 1641747936.0,
      "score": 39,
      "context": []
    },
    {
      "id": "hs0stcg",
      "author": "Rosenhansthud",
      "body": "Oh my god. My mom’ll call me at night and say, “So, did you eat today?” Like yeah, I am human. You have to eat in order to have an eating disorder.     It’s in the name",
      "created_utc": 1641790608.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hs1njdl",
      "author": "OhCrumbs96",
      "body": "Yep, I find the entire sentiment ignorant at best and incredibly triggering at worst. It just adds to the bullshit idea that people with eating disorders somehow exist on water and oxygen alone. I know that even during the height of my anorexia, I still ate multiple meals every single day. If anything, the more malnourished I became, the more I *had* to consume something at regular intervals in order to prevent dangerously low blood sugar levels. \n\nI've known people who passed away due to anorexia and they were consuming regular 'meals' right up until the end.",
      "created_utc": 1641809598.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hs0g08x",
      "author": "sharpfeng",
      "body": "Wow, yes, this so much. I can't tell you how much I've thought this exact same thing word for word. I feel like I've almost just gotten used to it over the years unfortunately. Like at this point I just expect recovery instagrams/tumblrs/blogs are going to constantly post things like, \"You deserve to eat today!\"  etc. Umm but people with ED's **do** eat?",
      "created_utc": 1641785122.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hs0gq1q",
      "author": "None",
      "body": "I think one of the biggest misconceptions about EDs is that no one ever eats anything at all…",
      "created_utc": 1641785422.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hrzx6e0",
      "author": "saintmary23",
      "body": "theyre well meaning but yeah it always bothered me too. i think its just because eds are so competitive that it latched onto any little thing that could possibly mean i was eating \"too much\" and would push me to restrict even more. a person who is not sick w a restrictive ed literally wouldnt care about that and might find those posts helpful if they forget to eat lunch or smth. but for the most part it kinda shows a lack of awareness on how eds function on the posters part, because of the fact that eds are competitive in that way. but yeah i was technically eating so in my brain that was as good as normal hahahah",
      "created_utc": 1641777497.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hs1zesw",
      "author": "Notreallysurebutidc",
      "body": "There’s also people with non restrictive eating disorders. When I was in the beginning of my recovery from bul*mi* and I heard that line it was awful. Eating doesn’t equal healthy. \n\nThey probably have the right intention but eating disorders are incredibly individual. So not everything will work for everyone.",
      "created_utc": 1641817767.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hs4uhtk",
      "author": "None",
      "body": "one of my biggest social media triggers rn. so. bad.\n\nALSO \"YOU DESERVE TO EAT TODAY EVEN IF YOU OVERATE YESTERDAY\" like thanks!!! that's what I did at my worst too. I ate. in a huge fucking deficit lol",
      "created_utc": 1641858350.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hs17omp",
      "author": "sadstomach_sadbrain",
      "body": "Agreed! Just really doesn’t get the whole picture and very much centers ED issues and recovery around purely restrictive anorexia, especially those who are severely underweight even though it doesn’t explicitly say so.",
      "created_utc": 1641798306.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hrzrifq",
      "author": "tkdaw",
      "body": "my mom insists on calling all my food that I eat or that I make for her \"sooooooo filling, omg I don't even need to eat my next meal bc I'm sooooooo full after *ALL THAT FOOD*\" like bitch you outweigh me by 50 lbs so clearly you're just being toxic AF and my food intake is not at all \"more\" than yours...",
      "created_utc": 1641775249.0,
      "score": 14,
      "context": [
        {
          "id": "hrxnwn0",
          "author": "musingsofamdc",
          "body": "Yes, I find it incredibly invalidating!! A sent a friend a photo of my brunch yesterday, that was incredibly low cal / high volume and she said “wow that’s a lot of food!” And I immediately felt like shit. I constantly get upset when people say “you eat a lot though.” Sure Karen, but I’m still starving. Ask my therapist and dietitian. People just don’t get it. And I’m tired of explaining it.",
          "created_utc": 1641747936.0
        }
      ]
    },
    {
      "id": "hs17hnh",
      "author": "sadstomach_sadbrain",
      "body": "Ooh yeah my mom always makes a big deal of how much food I serve, like a very normal or even smallish portion she’ll say “wow that’s so much food!” She grew up in a different era and doesn’t get it but is trying.",
      "created_utc": 1641798188.0,
      "score": 3,
      "context": [
        {
          "id": "hrxnwn0",
          "author": "musingsofamdc",
          "body": "Yes, I find it incredibly invalidating!! A sent a friend a photo of my brunch yesterday, that was incredibly low cal / high volume and she said “wow that’s a lot of food!” And I immediately felt like shit. I constantly get upset when people say “you eat a lot though.” Sure Karen, but I’m still starving. Ask my therapist and dietitian. People just don’t get it. And I’m tired of explaining it.",
          "created_utc": 1641747936.0
        },
        {
          "id": "hrzrifq",
          "author": "tkdaw",
          "body": "my mom insists on calling all my food that I eat or that I make for her \"sooooooo filling, omg I don't even need to eat my next meal bc I'm sooooooo full after *ALL THAT FOOD*\" like bitch you outweigh me by 50 lbs so clearly you're just being toxic AF and my food intake is not at all \"more\" than yours...",
          "created_utc": 1641775249.0
        }
      ]
    },
    {
      "id": "hs4e7iq",
      "author": "tkdaw",
      "body": "I think some people really do think they \"dont eat\" until someone ELSE gives them food and they don't have a preconceived notion of how much they're \"not eating\"",
      "created_utc": 1641851838.0,
      "score": 1,
      "context": [
        {
          "id": "hrxnwn0",
          "author": "musingsofamdc",
          "body": "Yes, I find it incredibly invalidating!! A sent a friend a photo of my brunch yesterday, that was incredibly low cal / high volume and she said “wow that’s a lot of food!” And I immediately felt like shit. I constantly get upset when people say “you eat a lot though.” Sure Karen, but I’m still starving. Ask my therapist and dietitian. People just don’t get it. And I’m tired of explaining it.",
          "created_utc": 1641747936.0
        },
        {
          "id": "hrzrifq",
          "author": "tkdaw",
          "body": "my mom insists on calling all my food that I eat or that I make for her \"sooooooo filling, omg I don't even need to eat my next meal bc I'm sooooooo full after *ALL THAT FOOD*\" like bitch you outweigh me by 50 lbs so clearly you're just being toxic AF and my food intake is not at all \"more\" than yours...",
          "created_utc": 1641775249.0
        },
        {
          "id": "hs17hnh",
          "author": "sadstomach_sadbrain",
          "body": "Ooh yeah my mom always makes a big deal of how much food I serve, like a very normal or even smallish portion she’ll say “wow that’s so much food!” She grew up in a different era and doesn’t get it but is trying.",
          "created_utc": 1641798188.0
        }
      ]
    }
  ]
}