{
  "id": "sbv7i8",
  "subreddit": "fuckeatingdisorders",
  "author": "satelieri",
  "created_utc": 1643054991.0,
  "title": "I ordered pizza",
  "selftext": "After like a week of avoiding the kitchen in my dorm and letting my questionable eating habits run wild, I decided to bite the bullet and make some mac n cheese. \n\nI was already patting myself on the back for pulling such a boss move on my ED and social anxiety at the same time, however when I went to the fridge, I discovered that somebody drank my fucking unopened carton of milk. They even covered they tracks and trew the empty carton away. Rip milk 2022-2022\n\nYes, it was partially my fault cause this one time I didn't write my name on it, but I was crushed none the less. I was really looking forward to my mac n cheese. I hyped myself up and now I was back at my room and crying over some stupid milk. My brain was instantly in \"it's free restriction!\" mode and I felt so dissapointed in myself. I wanted to do better and because somebody can't keep their hands off something that isn't theirs, my plans where ruined.\n\nAfter some time I calmed down a bit and decided that I shouldn't let my ED and social anxiety win. I was going to order pizza. And I did. It was delicious, I survived talking on the phone to a stranger and I even managed to stop eating when I was full.\n\nI hope you also had at least one small win today <3",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/sbv7i8/i_ordered_pizza/",
  "score": 91,
  "num_comments": 10,
  "comments": [
    {
      "id": "hu2d3u3",
      "author": "emptyhellebore",
      "body": "Good job, friend.  I'm proud of you foe working through that.",
      "created_utc": 1643056193.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hu2erwp",
      "author": "Prestigious-Bug-7641",
      "body": "Good for you.. I love posts like this.. makes me feel hopeful😊",
      "created_utc": 1643056834.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hu2fcxn",
      "author": "IamNotABaldEagle",
      "body": "Good for you! I'm glad the pizza was delicious! Screw you ED! Also screw the cheeky bastard who drank your milk!",
      "created_utc": 1643057053.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hu2forg",
      "author": "othersideofsad",
      "body": "This would be a big feat for me- no need to be so modest in calling it a small win! It’s awesome how you were able to ground yourself, reassess, and find such a nice way to care for and nourish yourself. Happy and proud for you!",
      "created_utc": 1643057176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hu2zmch",
      "author": "InfamousDifficulty16",
      "body": "so very proud of you!!! i deffo big relate to the \"free restriction\" mentality whenever a sudden setback in eating plans occurs, and it is SO HARD to overcome those thoughts without guilt. but you DID IT and it's no small feat!",
      "created_utc": 1643064786.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hu34ffq",
      "author": "petitelinotte212",
      "body": "Ugh common kitchens are a nightmare for my ED, I find it so hard to use them without freaking the fuck out. I really applaud you for conquering this, you rock!",
      "created_utc": 1643066728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hu3bjmr",
      "author": "AnaDion94",
      "body": "I’m proud of you and hoped you enjoyed your pizza! \n\nToday I had bananas foster with ice cream. And neither binged nor worried that I shouldn’t be eating it. It was delicious.",
      "created_utc": 1643072696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hu64rly",
      "author": "None",
      "body": "so proud of you, i need to do this soon",
      "created_utc": 1643128170.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hu7y7v0",
      "author": "satelieri",
      "body": "It sound awesome, especially the no binging and worrying part",
      "created_utc": 1643152965.0,
      "score": 2,
      "context": [
        {
          "id": "hu3bjmr",
          "author": "AnaDion94",
          "body": "I’m proud of you and hoped you enjoyed your pizza! \n\nToday I had bananas foster with ice cream. And neither binged nor worried that I shouldn’t be eating it. It was delicious.",
          "created_utc": 1643072696.0
        }
      ]
    },
    {
      "id": "hu7xpnm",
      "author": "satelieri",
      "body": "Would definetly recommend it without a side of unneccessary meltdown, you got this!",
      "created_utc": 1643152764.0,
      "score": 2,
      "context": [
        {
          "id": "hu64rly",
          "author": "None",
          "body": "so proud of you, i need to do this soon",
          "created_utc": 1643128170.0
        }
      ]
    }
  ]
}