{
  "id": "sf0qhl",
  "subreddit": "fuckeatingdisorders",
  "author": "yell0wbirddd",
  "created_utc": 1643403979.0,
  "title": "I am so fucking tired of the general public not understanding eating disorders and/or the normalization of disordered eating",
  "selftext": "I don't know what's what half the time. \n\nI've seen several threads on Reddit where someone will mention having an eating disorder but they're going to reddit for advice for some kind of issue that could possibly be fixed by or caused by food. Ok, fine, it's america and we can't all afford a dietitian. A well meaning person will reply with advice that on the surface is normal but to anyone familiar with ED rhetoric it's disordered. Telling a person how to eat, what to eat, that food is the cause of all their problems. I've gotten into heated discussions with people in an attempt to educate them, but they're so brainwashed by diet culture (or are struggling themselves with some disordered behaviors they haven't addressed) that it's useless. I've steered people away from certain subreddits to try to get them better advice. But it seems futile. \n\nI don't know if this makes any sense but I'm riled up about it.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/sf0qhl/i_am_so_fucking_tired_of_the_general_public_not/",
  "score": 89,
  "num_comments": 8,
  "comments": [
    {
      "id": "humyo2g",
      "author": "None",
      "body": "it’s unbelievably frustrating. it’s all over the world too, not just one country or culture. sometimes you just have to step back for your own mental health, bc sometimes it feels like it’s everyone all the time.",
      "created_utc": 1643405587.0,
      "score": 18,
      "context": []
    },
    {
      "id": "huoasq8",
      "author": "gcitt",
      "body": "I literally just responded to someone on another sub who insisted that it's okay to emphasize the appearance of an anorexic person's body because the root of their ED is being unhappy with their body. People really don't know anything.",
      "created_utc": 1643426470.0,
      "score": 12,
      "context": []
    },
    {
      "id": "huojqfh",
      "author": "Worldly-Reading2963",
      "body": "*cough cough* You mean all the intermittent fasting subs? I swear to God there are some subreddits for that shit which are literally just ED memes.",
      "created_utc": 1643430883.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hup5yru",
      "author": "Protagoras95",
      "body": "Fatphobia is to blame. If you think being fat is the worst thing that could happen to you, disordered eating seems okay. I know that’s how it was for me. “Of course I hate myself, I’m supposed to hate myself, I’m fat!”.",
      "created_utc": 1643445394.0,
      "score": 4,
      "context": []
    },
    {
      "id": "huomwld",
      "author": "saintmary23",
      "body": "wish i could upvote this 1000 times ohmygd. it made it so hard to even know i had an ed because its like, well everyone else is eating like this so why is it so bad. and choosing to recover its just made me hyperaware of how it is fucking everryyyywheree. like disordered eating doesnt turn into a full blown ed for everyone but the amount of people getting eds from taking advice from ppl with disordered habits is insane to me. like these people fully think that what they are doing is ok and our culture supports that too. honestly the further into recovery i get the more im just like...thank g0d that isn't me anymore lmfao. constantly micromanaging eveything we put into our bodies was not how we were meant to live in my opinion lmfao",
      "created_utc": 1643432596.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hupjbqb",
      "author": "IamNotABaldEagle",
      "body": "I'm on a few other UK based forums like that too. I see things all the time like 'well it's better to be underweight than overweight' (Errr no it's not.). You shouldn't eat carbs every day, shouldn't ever eat desert. I had definitely internalised alot of these things too.",
      "created_utc": 1643455955.0,
      "score": 3,
      "context": []
    },
    {
      "id": "humz7ez",
      "author": "yell0wbirddd",
      "body": "I was kinda being facetious that if someone isn't seeing a doctor they're probably American and can't afford it lol.",
      "created_utc": 1643405797.0,
      "score": 5,
      "context": [
        {
          "id": "humyo2g",
          "author": "None",
          "body": "it’s unbelievably frustrating. it’s all over the world too, not just one country or culture. sometimes you just have to step back for your own mental health, bc sometimes it feels like it’s everyone all the time.",
          "created_utc": 1643405587.0
        }
      ]
    },
    {
      "id": "hupct8a",
      "author": "clullen",
      "body": "It's also so damn hard to recover when the people around you display (and encourage!!) ED behaviours. \n\nP.s. congrats on your recovery journey, it sounds like you're doing an amazing job.",
      "created_utc": 1643450838.0,
      "score": 4,
      "context": [
        {
          "id": "huomwld",
          "author": "saintmary23",
          "body": "wish i could upvote this 1000 times ohmygd. it made it so hard to even know i had an ed because its like, well everyone else is eating like this so why is it so bad. and choosing to recover its just made me hyperaware of how it is fucking everryyyywheree. like disordered eating doesnt turn into a full blown ed for everyone but the amount of people getting eds from taking advice from ppl with disordered habits is insane to me. like these people fully think that what they are doing is ok and our culture supports that too. honestly the further into recovery i get the more im just like...thank g0d that isn't me anymore lmfao. constantly micromanaging eveything we put into our bodies was not how we were meant to live in my opinion lmfao",
          "created_utc": 1643432596.0
        }
      ]
    }
  ]
}