{
  "id": "snklqq",
  "subreddit": "fuckeatingdisorders",
  "author": "Fuzzy_sleep",
  "created_utc": 1644327914.0,
  "title": "Here’s proof that thinner doesn’t equal beautiful/hot/whatever",
  "selftext": "A thought I’m pretty sure we all share is that when we are ‘thinner’, that makes us more ‘beautiful’. Or worthy, or confident, etc. I definitely thought this, and I thought that when I’d gain weight in recovery that I would become unattractive, ugly, undesirable etc.\n\nWell, bitch, I was wrong. In many ways. Here’s a list of whats happened since I’ve gained weight:\n\n* I’ve had 3 people ask me out. During my ED, I had no one ask me out. One called me beautiful, and apparently one described me as the “perfect woman” behind my back to his friends. I’m overweight. I didn’t think “perfect woman” and “overweight” would go hand in hand, but fuck yeah, here we are. \n* All my family and family friends have told me how much better I look and how much happier I am. When I was thin, I was miserable. I’m happy now. That makes a massive difference obviously.\n* I’m so much more confident now. Confidence is a big thing, and when I was in my ED, I was always so worried about my appearance and what I looked like that it defeated the whole point of “thinner equals confidence“, so there’s more proof it’s bullshit.\n* Speaking of confidence, my boobs have come back, which to me is a huge win. I can now show a bit of cheeky cleavage, which for me makes me feel more confident and better about myself. That’s me personally, I like big boobs. Now I have them.\n* One of my friends said to me after not seeing me since I’ve started recovering, “wow, you’re hot now”\n\nIdk the full point of this post tbh, it’s just proof that thinner doesn’t mean beautiful. I feel more beautiful now than I did before, and I’ve had more attention in that way I guess? Hopefully it helps u guys feel a bit better about recovery. If you think that gaining weight will make you unattractive, you’re wrong. Trust me :)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/snklqq/heres_proof_that_thinner_doesnt_equal/",
  "score": 102,
  "num_comments": 11,
  "comments": [
    {
      "id": "hw2zrei",
      "author": "Sareeee48",
      "body": "I’m glad you have reached this point! Its great when people find peace with their bodies.\n\nI had the opposite experience, personally. I got a lot more attention when I was underweight compared to now; it’s almost like it was fetishized to a weird extent. Everyone close to me says they like me better now… but I don’t get hit on anymore lmao. I don’t weigh myself, but I am most definitely overweight and I don’t feel beautiful at all. I do struggle with body dysmorphic disorder so I’m sure that contributes on top of my own internalized fatphobia, and I know overall confidence is a factor. But people who fit the “beauty” standard, whether you’re overweight in the “right places” or straight up thin do tend to get treated better on a systemic level. It’s not an excuse to not work on your own fatphobia but I understand why so many people struggle with ending up at a higher weight.",
      "created_utc": 1644329270.0,
      "score": 36,
      "context": []
    },
    {
      "id": "hw3zftw",
      "author": "chasingravioli",
      "body": "If people with eating disorders could read, they'd be mad at this post lol",
      "created_utc": 1644343099.0,
      "score": 37,
      "context": []
    },
    {
      "id": "hw3ktai",
      "author": "None",
      "body": "Love this!! Personally I'm excited to wear cute t shirts and show off my arm tattoos without being cold and having to wear a big jacket all the time.",
      "created_utc": 1644337795.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hw53nt6",
      "author": "EnvironmentalSinger1",
      "body": "This is great. Unfortunately for me, my ed isn't about having a great body.",
      "created_utc": 1644357788.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hw5d8ul",
      "author": "None",
      "body": "I LOVE THIS GO OFFFF",
      "created_utc": 1644361526.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hw30h0v",
      "author": "OutlandishnessScared",
      "body": "This helped so much since I'm struggling to accept weight gain \nAnd I'm so glad that you finally realized how beautiful you are!",
      "created_utc": 1644329594.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hw685pr",
      "author": "Spectrachic311311",
      "body": "I know that my looks are worse at a lower weight than when I’m about 20 lbs up—better color, fuller cheeks, and more boobs/butt.  It’s honestly my motivation to recover.",
      "created_utc": 1644374585.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hw5luzi",
      "author": "B0urn3D3ad",
      "body": "I wish I could get this from a flipped perspective because as a male I feel I have the same thoughts currently as I’m in my ED and working on recovery as you had",
      "created_utc": 1644365111.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hw770ye",
      "author": "None",
      "body": "From a man's perspective I can say seeing a girl with softer, fuller cheeks is more attractive. But enough about booty. \n\nJust jokes.\n\nCongrats on the confidence!",
      "created_utc": 1644393274.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hw7b2cr",
      "author": "Trip_the_light3020",
      "body": "Yeah, Im glad OP has found being healthy and being \"more attractive\" helpful. It looks like it resonates with others, too. EDs always suck and I definitely see victory in OP's win.\n\nBut like you, it's not about being beautiful for me either. Im not sure the specifics of what your comment is referencing, but I'm glad I'm not alone. What purpose does your ED serve? I mightily struggle with the majority held belief that EDs are all driven by societal pressure to be beautiful. Each of those bullet points make me feel terrified.\n\nI've never wanted unsolicited men coming up to me and being so body focused.\n\nAnd I most definitely would find people telling me Iook great and happy triggering. My ED isnt about looking better in that way.\n\nUnfortunately I only feel \"real\" when I am emaciated and my confidence grows the more I can feel each stupid vertebrae",
      "created_utc": 1644396348.0,
      "score": 6,
      "context": [
        {
          "id": "hw53nt6",
          "author": "EnvironmentalSinger1",
          "body": "This is great. Unfortunately for me, my ed isn't about having a great body.",
          "created_utc": 1644357788.0
        }
      ]
    },
    {
      "id": "hw7yfm3",
      "author": "EnvironmentalSinger1",
      "body": "The thinner i am, the safer I feel in my body, my head, the world..leave me alone. You cant hurt me. Etc. \n\n❤️❤️❤️",
      "created_utc": 1644412587.0,
      "score": 4,
      "context": [
        {
          "id": "hw53nt6",
          "author": "EnvironmentalSinger1",
          "body": "This is great. Unfortunately for me, my ed isn't about having a great body.",
          "created_utc": 1644357788.0
        },
        {
          "id": "hw7b2cr",
          "author": "Trip_the_light3020",
          "body": "Yeah, Im glad OP has found being healthy and being \"more attractive\" helpful. It looks like it resonates with others, too. EDs always suck and I definitely see victory in OP's win.\n\nBut like you, it's not about being beautiful for me either. Im not sure the specifics of what your comment is referencing, but I'm glad I'm not alone. What purpose does your ED serve? I mightily struggle with the majority held belief that EDs are all driven by societal pressure to be beautiful. Each of those bullet points make me feel terrified.\n\nI've never wanted unsolicited men coming up to me and being so body focused.\n\nAnd I most definitely would find people telling me Iook great and happy triggering. My ED isnt about looking better in that way.\n\nUnfortunately I only feel \"real\" when I am emaciated and my confidence grows the more I can feel each stupid vertebrae",
          "created_utc": 1644396348.0
        }
      ]
    }
  ]
}