{
  "id": "sx4fzw",
  "subreddit": "fuckeatingdisorders",
  "author": "__mirrorimage__",
  "created_utc": 1645373033.0,
  "title": "are there any other mental illnesses where people are so proud of their disease ?",
  "selftext": "i was at an ED support group yesterday and it made me realize (again) how much people with an eating disorder want to be \"the most disordered person in the room\". like, i feel we always cling to our EDs. even now that i'm in recovery, i'm \"proud\" of the weight loss, the disorder, the restriction, everything. it's fucked. why is that ? it just makes the whole recovery process harder and the mutual support more complicated. are there any other mental illnesses where people act like this ?",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/sx4fzw/are_there_any_other_mental_illnesses_where_people/",
  "score": 143,
  "num_comments": 34,
  "comments": [
    {
      "id": "hxptt80",
      "author": "Sareeee48",
      "body": "Not sure if there are other mental illnesses specifically, but I’ve got no shortage of mental illnesses/disorders from OCD to ADHD, on top of trauma after trauma. I wouldn’t necessarily say I’m “proud” to have any of them (save for the ED but only while I was actively restricting), but for the longest time I did make it an active goal to be this helpless little girl who deserved all the love and attention and to just be coddled; and yeah, it did feel good when people treated me as such. But I don’t think I’d attribute that to any specific mental illness. \n\nI think one reason why we feel so “proud” to have an ED is because we are taught that weight loss = good, healthy, morally superior. Many people with EDs deal with dichotomous thinking (also called black and white thinking); if this thing is good, anything outside of it must be bad and vice versa. So it makes sense that restricting, losing weight, and all of the other behaviors and symptoms that accompany EDs will seem “right” to us. We’ve literally wired our brains to make those connections, and this societal obsession with thinness really doesn’t help either.",
      "created_utc": 1645373661.0,
      "score": 63,
      "context": []
    },
    {
      "id": "hxpzkks",
      "author": "haleighhuman",
      "body": "god, there’s so many awful reasons why eating disorders have such a competitive, prideful edge to them.\n\nfor one thing, social cues, advertising, diet and weight loss culture, the market that drives weight loss products, etc, all seem to ingrain the same message into our heads: weight loss= good. skinny=good. restriction/self denial= good. as humans, we even get messages that self denial equates “holiness”, “purity”, or other “good” things from lifestyle influences like culture and religion (think fasting days, etc) not to mention the actors, actresses, models, singers, whatever that are skinny and VERY OBVIOUSLY preferred in their respective roles because they’re underweight!!\n\nit’s this entire social web that humans, driven by greed and this desire to have success over everyone else, have weaved, and nearly every thread in it has something to say about food and our bodies and what we should be doing to them. it’s no wonder, then, that this mental illness is something many sufferers feel proud of. we’ve been told a billion times by society that we were doing the right thing when we engaged in the activities that worsened our eating disorders. we were praised positively for hurting ourselves. and now that all that is taken away- the weight loss, maybe, or the praise or glamor, what else do we have to cling to? this is all we’ve been trained to do. it’s all we’ve been told to do.\n\nanother thing too is just how competitive and strict everything “ED” is. we are notorious for keeping and tracking numbers (calories, weight) to an extremely precise and obsessive degree. a lot of this illness is built and catalyzed from competition, from the weight loss, the varying types of platforms we use to cope with and talk about eating disorders (like pro ana sites where folks routinely engage in competitions to loose weight faster), to the way that most media about EDs glamorizes the illness and tries to make it some beautiful, tragic, noble thing that it isn’t.\n\nyou’re so right. it’s sooo fucked, and it really does make recovery extra difficult. I wish you so much luck and happiness on your journey, though, and I hope you can find lots of healing and strength as you continue recovery!!! ❤️",
      "created_utc": 1645375996.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hxq6541",
      "author": "geebabybee",
      "body": "with bpd and suicidality/self harm i think sometimes theres comparable \"competition\" but nowhere near as bad . i think ppl r right saying that no other mental illness has such glorified symptoms",
      "created_utc": 1645378651.0,
      "score": 21,
      "context": []
    },
    {
      "id": "hxpt428",
      "author": "Zimsgirlfriend",
      "body": "To be honest it probably just depends on the person",
      "created_utc": 1645373377.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hxqcnp3",
      "author": "None",
      "body": "I am a recovering alcoholic who goes to AA. LOTS of war stories and one up-manship. Lots of comparisons between alcoholism and drug addiction with one being \"better\" than the other etc.",
      "created_utc": 1645381293.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hxq8oog",
      "author": "flowerscatsandqs",
      "body": "Like another commenter said I think it depends on the person. Some people get a lot of validation from being the sickest/most needy in the room. Sometimes it’s a learned behavior; like they grew up not getting much attention unless they made it abundantly clear they were suffering, so they feel a need to be the sickest to deserve love/affection (think of munchausen’s, if you’ve heard of that). I knew a couple people in treatment who would brag about their “laundry list” of mental health diagnoses… it’s interesting and sad to watch.",
      "created_utc": 1645379685.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hxq2i4m",
      "author": "r4v3_g1rl",
      "body": "It‘s so awful with ed‘s….\nIt‘s one of the things that‘s always holding me back, everytime that I want to commit to recovery I remember that there are people actively engaging in ed behaviors and I get jealous and can‘t commit. Tbh I think if there weren’t any other sufferers I wouldn‘t feel the need to continue engaging in some behaviors \n\nI honestly think it‘s in most mental disorders (and even in addicts) everyone wants to be the most damaged one and the one most deserving of help, the one taking the most risks and doing the most damage to themselves. That‘s what I at least think when I see people „bragging“ about the stuff they do when they have episodes or how much drugs they take (even in recovered people talking about their past)",
      "created_utc": 1645377175.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hxqr3iq",
      "author": "Spectrachic311311",
      "body": "My husband is bipolar 1 and when he is manic (happens rarely now that he’s on decent medication), he is extremely proud of how little he sleeps and how “creative” he feels.  Even though he is clearly in a very bad state to anyone looking in from the outside.  When we are in the ED we have a skewed view of what’s happening…we think we are doing it all “right” yet we are going against what our body’s limits are.  Doesn’t help that society reinforces how great it is to be thin and disciplined.",
      "created_utc": 1645387282.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hxq5aet",
      "author": "stopquaking",
      "body": "There is a similar sort of thing that can occur with self harm addiction, wanting to have the deepest scars and the most scars etc.",
      "created_utc": 1645378306.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hxqcg1c",
      "author": "Flesh-And-Bone",
      "body": "It's because maintaining an eating disorder is hard. It requires sacrifice, discipline, suffering. It's like bodybuilders being proud of their physiques (a whole group of ED-adjacent fellows).",
      "created_utc": 1645381206.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hxqllls",
      "author": "wingedwrists",
      "body": "it is a valid question. i feel really shit rn (non-ED, dw) so can’t do an in depth comment, but i just wanted to say i think peer support can do wonders for ED. It is possible to develop solidarity, vulnerability, encourage openness  and cultivate a lead by example attitude to recovery, while also encouraging people to share about the less kosher parts of the ED such as the sense of superiority-inferiority that we struggle with. I was part of a peer support group (two trained facilitators in recovery, 5-10 members patients at the hospital, mostly AN but some BN and BED) for a year and it saved my life. It was not held within hospital walls or run by clinicians. The format was always the same: 1. go round the room with a check in (short statements about how your week has been or how u feel rn), 2. facilitators pull out a couple common themes, react w their own experiences and observations, then come back to the room w an open question 3. discussions opens up. people allowed to speak directly in response to someone else, share and free associate, express solidarity, concern, gently offer advice. facilitators freely participate and help manage time and support anyone when more challenging things come up, or remind people of the rules (no numbers, don’t name specific staff, be mindful when describing behaviours and try to do so minimally, only what is necessary). 4. facilitators sum up meeting 5 quick check out. here we would do something called the ‘fuck it bucket’ which is basically passing around an imaginary bucket into which you’d put a behaviour or tendency that you will try to let go of the week ahead. some real examples were stop weighing cereal, say no to a stressful request from a family member, or conversely say fuck it and have the carrot cake you didn’t manage last week. All I can say is the group was incredible and people just didn’t seem to want to compete etc. That doesn’t mean i’m other contents competition and toxicity didn’t thrive. Some of the patients were on the inpatient ward and just came for the hour; they described all the usual things that happen in these settings. but somehow in group people got a chance to take break from it. i think we felt i certainly did more in control, like this is our healing space and everyone is sick and suffering and everyone deserves to be integrated. we actively worked to engage the new and quieter people and support the old timers. it really was amazing.\n\n\nironically though, once i was discharged and later weight restored but struggling in lockdown the hospital didn’t let me come back to the group. not sick enough apparently 😂🙃",
      "created_utc": 1645384972.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hxq4apo",
      "author": "absolute_boy",
      "body": "I think a major contributor is that the most outwardly perceptible side effects of other mental illnesses are obviously negative and derided by society. But with a restrictive ED, the most visible side effect is weight loss, which is pretty much universally praised and encouraged. When the whole world is telling us we should be pursuing weight loss all the time, it only makes sense that we'd feel a sense of pride in accomplishing that, no matter the cost.",
      "created_utc": 1645377903.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hxqq0p0",
      "author": "specialllkkay",
      "body": "The romanticization and pride in certain eating disorders are unique imo… that said 1 uppers in na and aa are pretty common. Usually the ppl that have crazy war stories and stuff in aa are firm in their recovery so it’s kinda different. Eating disorders and addiction are very similar though.",
      "created_utc": 1645386827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hxr9soy",
      "author": "Prestigious-Bug-7641",
      "body": "Yh I'm just embarrassed and ashamed..there are circumstantial reasons for that though.. I'm definitely very clingy to my ED - that one I can relate to😊",
      "created_utc": 1645395213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hxr3l30",
      "author": "Emergency-Parsley-51",
      "body": "Kind of. As I've seen, there are people proud of their depression, anxiety or OCD etc., because they think they make them special and interesting.",
      "created_utc": 1645392578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hxrfcpi",
      "author": "Shanilg",
      "body": "I’ve heard of similar stuff with addiction - people one-upping each other with horror stories from substances. So not exactly the same thing but some similar elements",
      "created_utc": 1645397577.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzd6cf6",
      "author": "bunni_bear_boom",
      "body": "I think a lot of times people make depression and anxiety into a competition but I think that's more of a product of those illnesses not being taken seriously unless you \"prove yourself \" not actually wanting to be sick",
      "created_utc": 1646427690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i09sv8q",
      "author": "MHCubes",
      "body": "I think that there are certain people/personality types that end up being proud of/competitive with other mental illnesses, however I agree that Ed's are by far the most competitive.\nI've seen people be competitive with mainly self harming, being the most suicidal/the most attempts, ADHD, tics, and also surprisingly some people are competitive with chronic illness which is shocking to me. \nI think this stems from 2 reasons,\n1. Wanting attention: Not saying everybody with a personality disorder does this, but many do. Also, many people without a PD want others to give them attention, say they are proud, be concerned about them, feel special, etc. I would say that doing things for attention is often stigmatized, people inherently do things that benefit them and I tend to feel sympathetic for these people, they are clearly filling a need that should be filled but isn't.\n2. Wanting validation: I think this tends to be perpetuated by people who are attention seeking, if people are telling their worst horror stories that can instill a mindset that if you haven't x, you are not valid/sick enough. I think that if we stopped debating who is valid as a society, AND people stopped attention seeking behavior that might encourage debate on what/who is valid, we could dissipate this reason a bit.\n\nI also think that our society unfortunately associates weight loss/thinness with successfulness and bring disciplined, which can cause competitiveness among ED's.",
      "created_utc": 1647023551.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hxsp04s",
      "author": "planetmermaidisblue",
      "body": "I’d say there’s a similar personality in the SI recovery community",
      "created_utc": 1645419561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxpztsu",
      "author": "IamNotABaldEagle",
      "body": "I was going to write a comment but you've said exactly what I wanted to say better than I was going to say it. I think my ED was the only mental health issue where I was actively proud of indulging in. That said  other issues did make me want to be coddled and looked after which fuelled the pathological coping mechanisms.",
      "created_utc": 1645376100.0,
      "score": 10,
      "context": [
        {
          "id": "hxptt80",
          "author": "Sareeee48",
          "body": "Not sure if there are other mental illnesses specifically, but I’ve got no shortage of mental illnesses/disorders from OCD to ADHD, on top of trauma after trauma. I wouldn’t necessarily say I’m “proud” to have any of them (save for the ED but only while I was actively restricting), but for the longest time I did make it an active goal to be this helpless little girl who deserved all the love and attention and to just be coddled; and yeah, it did feel good when people treated me as such. But I don’t think I’d attribute that to any specific mental illness. \n\nI think one reason why we feel so “proud” to have an ED is because we are taught that weight loss = good, healthy, morally superior. Many people with EDs deal with dichotomous thinking (also called black and white thinking); if this thing is good, anything outside of it must be bad and vice versa. So it makes sense that restricting, losing weight, and all of the other behaviors and symptoms that accompany EDs will seem “right” to us. We’ve literally wired our brains to make those connections, and this societal obsession with thinness really doesn’t help either.",
          "created_utc": 1645373661.0
        }
      ]
    },
    {
      "id": "hxr7hnq",
      "author": "notreallyanangel",
      "body": "i have bpd and im the same way",
      "created_utc": 1645394228.0,
      "score": 3,
      "context": [
        {
          "id": "hxptt80",
          "author": "Sareeee48",
          "body": "Not sure if there are other mental illnesses specifically, but I’ve got no shortage of mental illnesses/disorders from OCD to ADHD, on top of trauma after trauma. I wouldn’t necessarily say I’m “proud” to have any of them (save for the ED but only while I was actively restricting), but for the longest time I did make it an active goal to be this helpless little girl who deserved all the love and attention and to just be coddled; and yeah, it did feel good when people treated me as such. But I don’t think I’d attribute that to any specific mental illness. \n\nI think one reason why we feel so “proud” to have an ED is because we are taught that weight loss = good, healthy, morally superior. Many people with EDs deal with dichotomous thinking (also called black and white thinking); if this thing is good, anything outside of it must be bad and vice versa. So it makes sense that restricting, losing weight, and all of the other behaviors and symptoms that accompany EDs will seem “right” to us. We’ve literally wired our brains to make those connections, and this societal obsession with thinness really doesn’t help either.",
          "created_utc": 1645373661.0
        }
      ]
    },
    {
      "id": "hxuv2uv",
      "author": "BeastieBeck",
      "body": ">I think one reason why we feel so “proud” to have an ED is because we are taught that weight loss = good, healthy, morally superior. \n\nThis.\n\nAnd lets be honest: in the beginning the results of restrictive eating disordered behavior often gets much praise because it usually means \"weight loss\". This is even exacerbated when the person is overweight in the beginning.",
      "created_utc": 1645465776.0,
      "score": 3,
      "context": [
        {
          "id": "hxptt80",
          "author": "Sareeee48",
          "body": "Not sure if there are other mental illnesses specifically, but I’ve got no shortage of mental illnesses/disorders from OCD to ADHD, on top of trauma after trauma. I wouldn’t necessarily say I’m “proud” to have any of them (save for the ED but only while I was actively restricting), but for the longest time I did make it an active goal to be this helpless little girl who deserved all the love and attention and to just be coddled; and yeah, it did feel good when people treated me as such. But I don’t think I’d attribute that to any specific mental illness. \n\nI think one reason why we feel so “proud” to have an ED is because we are taught that weight loss = good, healthy, morally superior. Many people with EDs deal with dichotomous thinking (also called black and white thinking); if this thing is good, anything outside of it must be bad and vice versa. So it makes sense that restricting, losing weight, and all of the other behaviors and symptoms that accompany EDs will seem “right” to us. We’ve literally wired our brains to make those connections, and this societal obsession with thinness really doesn’t help either.",
          "created_utc": 1645373661.0
        }
      ]
    },
    {
      "id": "hxqvmvc",
      "author": "__mirrorimage__",
      "body": "this is such a great comment. i guess i made this post because i couldn't pin down \"why\" i was proud of my disorder. it's hard to find a single reason, especially when you're conscious of how much you've lost to this disease. but your comment does give a lot of reasons for why we can be proud of our EDs",
      "created_utc": 1645389208.0,
      "score": 3,
      "context": [
        {
          "id": "hxpzkks",
          "author": "haleighhuman",
          "body": "god, there’s so many awful reasons why eating disorders have such a competitive, prideful edge to them.\n\nfor one thing, social cues, advertising, diet and weight loss culture, the market that drives weight loss products, etc, all seem to ingrain the same message into our heads: weight loss= good. skinny=good. restriction/self denial= good. as humans, we even get messages that self denial equates “holiness”, “purity”, or other “good” things from lifestyle influences like culture and religion (think fasting days, etc) not to mention the actors, actresses, models, singers, whatever that are skinny and VERY OBVIOUSLY preferred in their respective roles because they’re underweight!!\n\nit’s this entire social web that humans, driven by greed and this desire to have success over everyone else, have weaved, and nearly every thread in it has something to say about food and our bodies and what we should be doing to them. it’s no wonder, then, that this mental illness is something many sufferers feel proud of. we’ve been told a billion times by society that we were doing the right thing when we engaged in the activities that worsened our eating disorders. we were praised positively for hurting ourselves. and now that all that is taken away- the weight loss, maybe, or the praise or glamor, what else do we have to cling to? this is all we’ve been trained to do. it’s all we’ve been told to do.\n\nanother thing too is just how competitive and strict everything “ED” is. we are notorious for keeping and tracking numbers (calories, weight) to an extremely precise and obsessive degree. a lot of this illness is built and catalyzed from competition, from the weight loss, the varying types of platforms we use to cope with and talk about eating disorders (like pro ana sites where folks routinely engage in competitions to loose weight faster), to the way that most media about EDs glamorizes the illness and tries to make it some beautiful, tragic, noble thing that it isn’t.\n\nyou’re so right. it’s sooo fucked, and it really does make recovery extra difficult. I wish you so much luck and happiness on your journey, though, and I hope you can find lots of healing and strength as you continue recovery!!! ❤️",
          "created_utc": 1645375996.0
        }
      ]
    },
    {
      "id": "hxptymy",
      "author": "BeastieBeck",
      "body": "And on the ED.",
      "created_utc": 1645373722.0,
      "score": 10,
      "context": [
        {
          "id": "hxpt428",
          "author": "Zimsgirlfriend",
          "body": "To be honest it probably just depends on the person",
          "created_utc": 1645373377.0
        }
      ]
    },
    {
      "id": "hxr7tvh",
      "author": "stopquaking",
      "body": "That's really interesting. I'd imagine the people with drug addiction think they're superior sufferers to alcoholics because it's more highly sanctioned, considered more 'addictive' etc?",
      "created_utc": 1645394372.0,
      "score": 3,
      "context": [
        {
          "id": "hxqcnp3",
          "author": "None",
          "body": "I am a recovering alcoholic who goes to AA. LOTS of war stories and one up-manship. Lots of comparisons between alcoholism and drug addiction with one being \"better\" than the other etc.",
          "created_utc": 1645381293.0
        }
      ]
    },
    {
      "id": "hxqd5w6",
      "author": "waifskin",
      "body": "Adjacent? Truly many of them are dealing with their own disordered eating/ exercise and body images, and I cannot think of anything that unifies us more.  So many body builders are competing against others and themselves as much as anorexics, etc. are.",
      "created_utc": 1645381498.0,
      "score": 12,
      "context": [
        {
          "id": "hxqcg1c",
          "author": "Flesh-And-Bone",
          "body": "It's because maintaining an eating disorder is hard. It requires sacrifice, discipline, suffering. It's like bodybuilders being proud of their physiques (a whole group of ED-adjacent fellows).",
          "created_utc": 1645381206.0
        }
      ]
    },
    {
      "id": "hxquc18",
      "author": "__mirrorimage__",
      "body": "that sounds like such a nice and healing setting / group <3 i'm so sorry you weren't able to go back in that group :'(. maybe there are some ED associations running groups in a more open setting somewhere in your area ? i would love to help in something like that once i'm actually recovered. \n\ni've only been to two support groups, which are run by my psychologist. they are great, but both times i felt the competitiveness come up one way or another. both times, i was also the \"most recovered\", which felt... weird i guess ? also yesterday's group kinda triggered me, hence this post.",
      "created_utc": 1645388650.0,
      "score": 3,
      "context": [
        {
          "id": "hxqllls",
          "author": "wingedwrists",
          "body": "it is a valid question. i feel really shit rn (non-ED, dw) so can’t do an in depth comment, but i just wanted to say i think peer support can do wonders for ED. It is possible to develop solidarity, vulnerability, encourage openness  and cultivate a lead by example attitude to recovery, while also encouraging people to share about the less kosher parts of the ED such as the sense of superiority-inferiority that we struggle with. I was part of a peer support group (two trained facilitators in recovery, 5-10 members patients at the hospital, mostly AN but some BN and BED) for a year and it saved my life. It was not held within hospital walls or run by clinicians. The format was always the same: 1. go round the room with a check in (short statements about how your week has been or how u feel rn), 2. facilitators pull out a couple common themes, react w their own experiences and observations, then come back to the room w an open question 3. discussions opens up. people allowed to speak directly in response to someone else, share and free associate, express solidarity, concern, gently offer advice. facilitators freely participate and help manage time and support anyone when more challenging things come up, or remind people of the rules (no numbers, don’t name specific staff, be mindful when describing behaviours and try to do so minimally, only what is necessary). 4. facilitators sum up meeting 5 quick check out. here we would do something called the ‘fuck it bucket’ which is basically passing around an imaginary bucket into which you’d put a behaviour or tendency that you will try to let go of the week ahead. some real examples were stop weighing cereal, say no to a stressful request from a family member, or conversely say fuck it and have the carrot cake you didn’t manage last week. All I can say is the group was incredible and people just didn’t seem to want to compete etc. That doesn’t mean i’m other contents competition and toxicity didn’t thrive. Some of the patients were on the inpatient ward and just came for the hour; they described all the usual things that happen in these settings. but somehow in group people got a chance to take break from it. i think we felt i certainly did more in control, like this is our healing space and everyone is sick and suffering and everyone deserves to be integrated. we actively worked to engage the new and quieter people and support the old timers. it really was amazing.\n\n\nironically though, once i was discharged and later weight restored but struggling in lockdown the hospital didn’t let me come back to the group. not sick enough apparently 😂🙃",
          "created_utc": 1645384972.0
        }
      ]
    },
    {
      "id": "hxquuft",
      "author": "__mirrorimage__",
      "body": "spot on. i guess i'm still clinging to the satisfaction i felt when people were shocked about how much weight i'd lost (several years ago, before they became outwardly scared).",
      "created_utc": 1645388871.0,
      "score": 2,
      "context": [
        {
          "id": "hxq4apo",
          "author": "absolute_boy",
          "body": "I think a major contributor is that the most outwardly perceptible side effects of other mental illnesses are obviously negative and derided by society. But with a restrictive ED, the most visible side effect is weight loss, which is pretty much universally praised and encouraged. When the whole world is telling us we should be pursuing weight loss all the time, it only makes sense that we'd feel a sense of pride in accomplishing that, no matter the cost.",
          "created_utc": 1645377903.0
        }
      ]
    },
    {
      "id": "hzgaqqz",
      "author": "__mirrorimage__",
      "body": "very true !!",
      "created_utc": 1646489161.0,
      "score": 1,
      "context": [
        {
          "id": "hzd6cf6",
          "author": "bunni_bear_boom",
          "body": "I think a lot of times people make depression and anxiety into a competition but I think that's more of a product of those illnesses not being taken seriously unless you \"prove yourself \" not actually wanting to be sick",
          "created_utc": 1646427690.0
        }
      ]
    },
    {
      "id": "hxrnxx9",
      "author": "None",
      "body": "There is a camp of old school AAers who look down on drug addicts. In their mind, drugs being illegal adds a patina of moral degeneracy that they would never stoop to. Drunk driving, beating their kids, drinking through a pregnancy, sure, but not drugs. :o\n\nSome drug addicts can get defensive, too, since it's easier to lose everything very quickly with drug addiction while alcoholism can be more insidious in its creep. Which ties into a high bottom vs low bottom recovery, war stories as a form of bragging etc.",
      "created_utc": 1645401415.0,
      "score": 8,
      "context": [
        {
          "id": "hxqcnp3",
          "author": "None",
          "body": "I am a recovering alcoholic who goes to AA. LOTS of war stories and one up-manship. Lots of comparisons between alcoholism and drug addiction with one being \"better\" than the other etc.",
          "created_utc": 1645381293.0
        },
        {
          "id": "hxr7tvh",
          "author": "stopquaking",
          "body": "That's really interesting. I'd imagine the people with drug addiction think they're superior sufferers to alcoholics because it's more highly sanctioned, considered more 'addictive' etc?",
          "created_utc": 1645394372.0
        }
      ]
    },
    {
      "id": "hxqsz1g",
      "author": "__mirrorimage__",
      "body": "yeah but a lot of body builders are self-righteous dorks being proud of eating nothing other than chicken breast and salad while we're just sad ppl hiding the weird shit we do with food",
      "created_utc": 1645388075.0,
      "score": 4,
      "context": [
        {
          "id": "hxqcg1c",
          "author": "Flesh-And-Bone",
          "body": "It's because maintaining an eating disorder is hard. It requires sacrifice, discipline, suffering. It's like bodybuilders being proud of their physiques (a whole group of ED-adjacent fellows).",
          "created_utc": 1645381206.0
        },
        {
          "id": "hxqd5w6",
          "author": "waifskin",
          "body": "Adjacent? Truly many of them are dealing with their own disordered eating/ exercise and body images, and I cannot think of anything that unifies us more.  So many body builders are competing against others and themselves as much as anorexics, etc. are.",
          "created_utc": 1645381498.0
        }
      ]
    },
    {
      "id": "hxrrwzg",
      "author": "stopquaking",
      "body": "Oh okay. That's the opposite of what I was thinking, I was thinking of it from the 'I'm sicker than you' one upmanship' side of things, but that also makes sense.\n\nPeople with EDs do the same thing for sure. Anorexics usually feel superior in their disorder relative to people with bulimia and binge eating disorder, who are viewed as weak-willed for not restricting entirely. It's all the same illness, much like its all the same addiction with alcohol and drugs.",
      "created_utc": 1645403261.0,
      "score": 4,
      "context": [
        {
          "id": "hxqcnp3",
          "author": "None",
          "body": "I am a recovering alcoholic who goes to AA. LOTS of war stories and one up-manship. Lots of comparisons between alcoholism and drug addiction with one being \"better\" than the other etc.",
          "created_utc": 1645381293.0
        },
        {
          "id": "hxr7tvh",
          "author": "stopquaking",
          "body": "That's really interesting. I'd imagine the people with drug addiction think they're superior sufferers to alcoholics because it's more highly sanctioned, considered more 'addictive' etc?",
          "created_utc": 1645394372.0
        },
        {
          "id": "hxrnxx9",
          "author": "None",
          "body": "There is a camp of old school AAers who look down on drug addicts. In their mind, drugs being illegal adds a patina of moral degeneracy that they would never stoop to. Drunk driving, beating their kids, drinking through a pregnancy, sure, but not drugs. :o\n\nSome drug addicts can get defensive, too, since it's easier to lose everything very quickly with drug addiction while alcoholism can be more insidious in its creep. Which ties into a high bottom vs low bottom recovery, war stories as a form of bragging etc.",
          "created_utc": 1645401415.0
        }
      ]
    },
    {
      "id": "hxs0cqm",
      "author": "None",
      "body": "You will sometimes hear a recovering alcoholic code \"I was sicker than you\" by saying that they were a low bottom alcoholic. So, like, someone whose drinking caused a lot of family, legal, health issues before they got sober. It's all the same sort of talk that you hear in ED circles although you usually get fewer anorexics bragging about prison time.",
      "created_utc": 1645407241.0,
      "score": 5,
      "context": [
        {
          "id": "hxqcnp3",
          "author": "None",
          "body": "I am a recovering alcoholic who goes to AA. LOTS of war stories and one up-manship. Lots of comparisons between alcoholism and drug addiction with one being \"better\" than the other etc.",
          "created_utc": 1645381293.0
        },
        {
          "id": "hxr7tvh",
          "author": "stopquaking",
          "body": "That's really interesting. I'd imagine the people with drug addiction think they're superior sufferers to alcoholics because it's more highly sanctioned, considered more 'addictive' etc?",
          "created_utc": 1645394372.0
        },
        {
          "id": "hxrnxx9",
          "author": "None",
          "body": "There is a camp of old school AAers who look down on drug addicts. In their mind, drugs being illegal adds a patina of moral degeneracy that they would never stoop to. Drunk driving, beating their kids, drinking through a pregnancy, sure, but not drugs. :o\n\nSome drug addicts can get defensive, too, since it's easier to lose everything very quickly with drug addiction while alcoholism can be more insidious in its creep. Which ties into a high bottom vs low bottom recovery, war stories as a form of bragging etc.",
          "created_utc": 1645401415.0
        },
        {
          "id": "hxrrwzg",
          "author": "stopquaking",
          "body": "Oh okay. That's the opposite of what I was thinking, I was thinking of it from the 'I'm sicker than you' one upmanship' side of things, but that also makes sense.\n\nPeople with EDs do the same thing for sure. Anorexics usually feel superior in their disorder relative to people with bulimia and binge eating disorder, who are viewed as weak-willed for not restricting entirely. It's all the same illness, much like its all the same addiction with alcohol and drugs.",
          "created_utc": 1645403261.0
        }
      ]
    }
  ]
}