{
  "id": "sxrm0p",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1645443895.0,
  "title": "Repost: On Caloric Intake Before and After Recovery",
  "selftext": "**Repost because for some reason the original was not letting me reply anymore or even edit the post.**\n\nSo I initially posted this as a comment, but I feel it’d make a pretty relevant topic due to the influx of posts to this sub regarding intake. Many people are asking how much they need to eat and often eat too *little*. \n\nRecovery minimums are going to range anywhere from 2500-3500 based in age, sex and height.\n\n•AFAB individuals younger than 25 between 5’0” and 5’8” (152.4 to 173 cm) will need a minimum 3000 kcal/day; 25+ individuals will need a minimum of 2500kcal daily. If you are taller, you’ll need a bit more; shorter a bit less.\n\n•For AMAB individuals under 25 between 5’4” and 6’0” (162.5 and 183 cm), you will need minimum 3500 kcal daily. 25+ individuals will need 3000; once again, if you fall outside of the given heights, accommodate by adding or removing an average of 200kcal.\n\nKeep in mind that these are minimums you will likely naturally fall into after recovery as well according to age, sex and height. I understand that some people claim counting calories in recovery holds them accountable to hit their minimums so I’m not going to argue that, however don’t rely too heavily on calorie counting as you progress into recovery. Regardless of whether you choose to go all in or take a slower, “more structured” approach, the end goal should be to eat without shame, guilt or anxiety.\n\n**These guidelines apply regardless of your weight.** The intake values are confirmed averages for “average height and weight.” Most people fall within this range—almost everyone will reside within a BMI of 21-30, with the absolute peak being around 27.\n\nHere is an article regarding recovery minimums and why they are the same post recovery as well: https://www.edinstitute.org/orientation-basics/phases-of-recovery-part-four?rq=Phases\n\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nNow, we will get into the doubly labeled water method that has documented the above calorie needs in many peer reviewed studies and even influenced the FDA’s initial 2350-2400 calorie guideline.\n\nDLW is the gold standard method for assessing daily metabolic rate of a living things over a period of time. So, what is the doubly labeled water method, exactly? The DLW technique measures total carbon dioxide production by observing the differential rates of elimination of a bolus dose of the stable isotope tracers, 2H (deuterium) and 18O… in simpler terms, regular sampling of heavy isotope concentrations in body water, by sampling saliva, urine, or blood,  measure elimination rates of deuterium and oxygen-18 in subject over time. \n\nThe caloric intakes reported are always higher than the “2000 caloric guideline” among those who don’t restrict. And, interesting enough, non restricted groups were reported to have less body mass as well. Let me be clear, though restriction will always lead to*more* weight gain long term, you don’t need to lose weight if you happen to be in a larger body; you aren’t a failed thin person and you are fine just the way you are. \n\nHere are the studies: https://p302.zlibcdn.com/dtoken/6be0e20b2ca1347ea71e94271858156a (pg 84)\n\nhttps://academic.oup.com/jn/article/129/10/1765/4721939\n\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nMany of you have been being up the fact that many people claim to eat much less than the intakes mentioned above, or that they “loosely track” their loved ones’ intakes (please stop doing that, by the way, it’s still disordered) and noticed they eat fat less. Many studies have concluded that individuals, *especially* women, tend to underreport because they believe their peers will judge them. Women who are more concerned about their social status, if you will, were reported to underreport their intake by **507 kcal/day**, compared to those who cared less about their “social desirability.”\n\nRegarding underreporting of caloric intake: https://pubmed.ncbi.nlm.nih.gov/12495831/\n\nhttps://pubmed.ncbi.nlm.nih.gov/12372163/\n\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nLastly, I can’t find the original document anymore (I had posted the link to a comment in this sub last year, though it seems to have been swallowed by the void), but I still feel it’s very relevant to this discussion. The FDA has been pretty open about the fact that 2000 calories isn’t enough for both men and women; intially 2350 was the baseline as reported by USDA survey data and doubly labeled water fast experiments, but received a lot of fucking backlash both from the public and medical professionals, mostly rooted in fatphobia, so the reduced the guideline to appease the masses who are more concerned with weight gain over and individuals properly feeding themselves.\n\n&gt;The FDA proposed using a single standard of daily calorie intake--2,350 calories per day, based on USDA survey data. The agency requested public comments on this proposal and on alternative figures: 2,000, 2,300, and 2,400 calories per day.\n\n&gt;Despite the observable fact that 2,350 calories per day is below the average requirements for either men or women obtained from doubly labeled water experiments, most of the people who responded to the comments judged the proposed benchmark too high. Nutrition educators worried that it would encourage overconsumption, be irrelevant to women who consume fewer calories, and permit overstatement of acceptable levels of \"eat less\" nutrients such as saturated fat and sodium.\n\nhttps://www.theatlantic.com/health/archive/2011/08/why-does-the-fda-recommend-2-000-calories-per-day/243092/#:~:text=The%20FDA%20proposed%20using%20a,and%202%2C400%20calories%20per%20day.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~\n\nRemember that you are not going to fall into some clean cut intake, and you’re going to eat more on some days and less on others. These are not hard numbers you absolutely have to follow, but it’s important to understand that you still need a lot of food both during recovery and afterwards.\n\nIf you have any questions, I’d love to try and answer them to the best of my ability. If need be, I can always add in more sources. I am also open to having a civil discussion but we are in no way making fatphobic remarks or encouraging restriction. Thanks. ❤️\n\n**Edit:** I always hear the same complaint regarding Olwyn that she isn’t an ED specialist and thus her advice is moot (even though she is a researcher and patient advocate with thirteen years' experience in general practice, chronic gastrointestinal illnesses, allergies and intolerances). But… neither is Tabitha Farrar, and I’ve yet to see the same argument had about her despite their recovery methods being virtually identical. Both back their claims up with peer reviewed studies and confirmed scientific data—ya absolutely don’t have to like them or their methods, but you can’t just deny the science.\n\nAnother thing worth addressing: someone pointed out that you should always try to see a professional. Olwyn has never advocated against seeing a professional and neither have I. If you have the luxury of seeing someone, do it. **But not everybody has that**; some aren’t financially well off, insurance doesn’t cover treatment, or experiencing weight bias has turned individuals away from professional help. Many of us are forced to recover on our own. Just something to be mindful of.\n\n**Edit 2:** I said I wasn’t going to tolerate fatphobia, but I’m still going to loosely address the concern. If you say you can’t eat these minimums because you will gain weight, well… y’all aren’t gonna wanna hear this, but you need to gain weight. If you were at a higher BMI prior to your ED, you’re very likely gonna be at a higher weight post recovery. Not going to argue set point with y’all, but if you’re constantly having to monitor what and how much you eat to maintain some arbitrary weight, you’re not recovered. I said what I said. You can’t continue the same behaviors that kept you sick and call it healthy this time around—that’s not how restriction works, your body gives fuck all about what weight you *want* to be at and it’s going to act accordingly. Hense why I’m always telling you guys that [intentional] weight loss is not compatible with recovery.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/sxrm0p/repost_on_caloric_intake_before_and_after_recovery/",
  "score": 135,
  "num_comments": 23,
  "comments": [
    {
      "id": "hxw7f7o",
      "author": "ReinkesSpace",
      "body": "Also: the Minnesota starvation experiment had the subjects on 1600 cals",
      "created_utc": 1645485153.0,
      "score": 37,
      "context": []
    },
    {
      "id": "hxv9g6d",
      "author": "None",
      "body": "one thing i’ve always been confused on is that i’ve heard many times that the average adult needs 2000 calories a day. i’m not sure where that number comes from but i’ve seen it on many nutrition labels and it’s just confusing because i know realistically that’s not a huge number and many people will need a lot more than that but why do nutrition labels specifically say an average of 2000 then? if anyone knows i’d love to find out, i’ve wondered this for a while and i know my perception of how many calories i need, despite being so short, isn’t realistic",
      "created_utc": 1645471416.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hxtr4jg",
      "author": "Sareeee48",
      "body": "If you commented on the original I tried to address your comments in this repost, but feel free to comment again if you would like to further discuss.",
      "created_utc": 1645447641.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hxuxwj2",
      "author": "None",
      "body": "bless you for always having the sources 🙌",
      "created_utc": 1645466865.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ki4o5ng",
      "author": "EndOwl_",
      "body": "Old post but thank you so much for this! I'm struggling to begin recovery and I'm going to re-read this post over and over again to help me continue to consume calories and push onwards.",
      "created_utc": 1705416678.0,
      "score": 7,
      "context": []
    },
    {
      "id": "izqjdvf",
      "author": "goldenvodka",
      "body": "What if you’re shorter than 5”0 and over 25?",
      "created_utc": 1670725994.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ku5rzk7",
      "author": "Witty-Persimmon9073",
      "body": "Thank you so much for this !! I’ve completely lost sense of what is normal and this is just so helpful to get a grasp of what my intake should be. This just made me realize I am still unintentionally restricting… thank you 🙏🙏🙏",
      "created_utc": 1710035080.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kx41m5u",
      "author": "Zealousideal_Read902",
      "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
      "created_utc": 1711721802.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzy2eb1",
      "author": "deffonotmisty",
      "body": "hey they is a pretty old post but would that mean that calorie calculators and fitness watched are bs? i hate to say it but ive entered in my info into them so many times and meticulously tracked the amount ive supposedly burned in a day and even with overexercising an hour + a day with an unreasonable amount of walking i rarely ever exceeded 2100. im trying to let go of those numbers to recover but im still so confused abt it",
      "created_utc": 1733093329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt1pbye",
      "author": "SelectStarFromNames",
      "body": "Hey mods, I really appreciate your work!\n\n\nI do think it's important to note that most people have BMI between 21-30 is not accurate, about 30% of adults in the United States have a BMI over 30 depending on the state https://www.kff.org/other/state-indicator/distribution-of-body-mass-index-among-adults/?currentTimeframe=0&sortModel=%7B%22colId%22:%22Location%22,%22sort%22:%22asc%22%7D",
      "created_utc": 1729535781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hxw885o",
      "author": "Sareeee48",
      "body": "I thought about adding the Minnesota starvation experiment to this list but chose not to because it focused more on the effects of starvation, extreme hunger and overshoot. Nevertheless, it’s still a valuable source!",
      "created_utc": 1645485495.0,
      "score": 21,
      "context": [
        {
          "id": "hxw7f7o",
          "author": "ReinkesSpace",
          "body": "Also: the Minnesota starvation experiment had the subjects on 1600 cals",
          "created_utc": 1645485153.0
        }
      ]
    },
    {
      "id": "hxv9pym",
      "author": "Sareeee48",
      "body": "I addressed this in the post via the FDA section! This is precisely why it’s on nutrition labels. They do make it clear in saying this is a rough guideline and people will have varying calorie needs but it’s still a pretty low intake guideline and one people either follow religiously or go far under.",
      "created_utc": 1645471526.0,
      "score": 33,
      "context": [
        {
          "id": "hxv9g6d",
          "author": "None",
          "body": "one thing i’ve always been confused on is that i’ve heard many times that the average adult needs 2000 calories a day. i’m not sure where that number comes from but i’ve seen it on many nutrition labels and it’s just confusing because i know realistically that’s not a huge number and many people will need a lot more than that but why do nutrition labels specifically say an average of 2000 then? if anyone knows i’d love to find out, i’ve wondered this for a while and i know my perception of how many calories i need, despite being so short, isn’t realistic",
          "created_utc": 1645471416.0
        }
      ]
    },
    {
      "id": "j2g0rxh",
      "author": "Sareeee48",
      "body": "If you fall under or above the given heights mentioned in the post, you will adjust up (if taller) or down (if shorter) by 200 calories. Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.",
      "created_utc": 1672532604.0,
      "score": 5,
      "context": [
        {
          "id": "izqjdvf",
          "author": "goldenvodka",
          "body": "What if you’re shorter than 5”0 and over 25?",
          "created_utc": 1670725994.0
        }
      ]
    },
    {
      "id": "l3ec7tn",
      "author": "freakingidontknow",
      "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
      "created_utc": 1715323468.0,
      "score": 4,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        }
      ]
    },
    {
      "id": "m22bxfz",
      "author": "Sareeee48",
      "body": "Yes, they are bullshit and cannot accurately determine how much you would need or how much you burn.",
      "created_utc": 1734207202.0,
      "score": 1,
      "context": [
        {
          "id": "lzy2eb1",
          "author": "deffonotmisty",
          "body": "hey they is a pretty old post but would that mean that calorie calculators and fitness watched are bs? i hate to say it but ive entered in my info into them so many times and meticulously tracked the amount ive supposedly burned in a day and even with overexercising an hour + a day with an unreasonable amount of walking i rarely ever exceeded 2100. im trying to let go of those numbers to recover but im still so confused abt it",
          "created_utc": 1733093329.0
        }
      ]
    },
    {
      "id": "m22bqj6",
      "author": "Sareeee48",
      "body": "That would still make those with a BMI of 21-30 the majority though?",
      "created_utc": 1734207135.0,
      "score": 1,
      "context": [
        {
          "id": "lt1pbye",
          "author": "SelectStarFromNames",
          "body": "Hey mods, I really appreciate your work!\n\n\nI do think it's important to note that most people have BMI between 21-30 is not accurate, about 30% of adults in the United States have a BMI over 30 depending on the state https://www.kff.org/other/state-indicator/distribution-of-body-mass-index-among-adults/?currentTimeframe=0&sortModel=%7B%22colId%22:%22Location%22,%22sort%22:%22asc%22%7D",
          "created_utc": 1729535781.0
        }
      ]
    },
    {
      "id": "hxw92zo",
      "author": "ReinkesSpace",
      "body": "Oh yes I think your post is totally comprehensive without it! Just another point for why the FDA guideline isn’t enough",
      "created_utc": 1645485862.0,
      "score": 12,
      "context": [
        {
          "id": "hxw7f7o",
          "author": "ReinkesSpace",
          "body": "Also: the Minnesota starvation experiment had the subjects on 1600 cals",
          "created_utc": 1645485153.0
        },
        {
          "id": "hxw885o",
          "author": "Sareeee48",
          "body": "I thought about adding the Minnesota starvation experiment to this list but chose not to because it focused more on the effects of starvation, extreme hunger and overshoot. Nevertheless, it’s still a valuable source!",
          "created_utc": 1645485495.0
        }
      ]
    },
    {
      "id": "hxv9v93",
      "author": "None",
      "body": "oh sorry i must’ve missed it! thanks for the explanation, your posts/comments always put me at ease :)",
      "created_utc": 1645471584.0,
      "score": 7,
      "context": [
        {
          "id": "hxv9g6d",
          "author": "None",
          "body": "one thing i’ve always been confused on is that i’ve heard many times that the average adult needs 2000 calories a day. i’m not sure where that number comes from but i’ve seen it on many nutrition labels and it’s just confusing because i know realistically that’s not a huge number and many people will need a lot more than that but why do nutrition labels specifically say an average of 2000 then? if anyone knows i’d love to find out, i’ve wondered this for a while and i know my perception of how many calories i need, despite being so short, isn’t realistic",
          "created_utc": 1645471416.0
        },
        {
          "id": "hxv9pym",
          "author": "Sareeee48",
          "body": "I addressed this in the post via the FDA section! This is precisely why it’s on nutrition labels. They do make it clear in saying this is a rough guideline and people will have varying calorie needs but it’s still a pretty low intake guideline and one people either follow religiously or go far under.",
          "created_utc": 1645471526.0
        }
      ]
    },
    {
      "id": "l3elpji",
      "author": "Zealousideal_Read902",
      "body": "This is so helpful thank you so much you have no idea. Can I ask what you mean by ‘this one has done well for me’? Like what are you doing that you see working? Proud of you",
      "created_utc": 1715330648.0,
      "score": 1,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        },
        {
          "id": "l3ec7tn",
          "author": "freakingidontknow",
          "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
          "created_utc": 1715323468.0
        }
      ]
    },
    {
      "id": "lgh409k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1722790136.0,
      "score": 1,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        },
        {
          "id": "l3ec7tn",
          "author": "freakingidontknow",
          "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
          "created_utc": 1715323468.0
        }
      ]
    },
    {
      "id": "hxw989d",
      "author": "Sareeee48",
      "body": "Ahhh that’s a good point, thanks for bringing it up! I might as it as a separate comment here, Reddit still isn’t letting me edit the post for some reason.",
      "created_utc": 1645485925.0,
      "score": 7,
      "context": [
        {
          "id": "hxw7f7o",
          "author": "ReinkesSpace",
          "body": "Also: the Minnesota starvation experiment had the subjects on 1600 cals",
          "created_utc": 1645485153.0
        },
        {
          "id": "hxw885o",
          "author": "Sareeee48",
          "body": "I thought about adding the Minnesota starvation experiment to this list but chose not to because it focused more on the effects of starvation, extreme hunger and overshoot. Nevertheless, it’s still a valuable source!",
          "created_utc": 1645485495.0
        },
        {
          "id": "hxw92zo",
          "author": "ReinkesSpace",
          "body": "Oh yes I think your post is totally comprehensive without it! Just another point for why the FDA guideline isn’t enough",
          "created_utc": 1645485862.0
        }
      ]
    },
    {
      "id": "hxvb43b",
      "author": "Sareeee48",
      "body": "No worries, it can be kind of confusing. The section doesn’t specifically address nutrition labels but they are regulated under the FDA and based on that 2000 calorie guideline.",
      "created_utc": 1645472083.0,
      "score": 4,
      "context": [
        {
          "id": "hxv9g6d",
          "author": "None",
          "body": "one thing i’ve always been confused on is that i’ve heard many times that the average adult needs 2000 calories a day. i’m not sure where that number comes from but i’ve seen it on many nutrition labels and it’s just confusing because i know realistically that’s not a huge number and many people will need a lot more than that but why do nutrition labels specifically say an average of 2000 then? if anyone knows i’d love to find out, i’ve wondered this for a while and i know my perception of how many calories i need, despite being so short, isn’t realistic",
          "created_utc": 1645471416.0
        },
        {
          "id": "hxv9pym",
          "author": "Sareeee48",
          "body": "I addressed this in the post via the FDA section! This is precisely why it’s on nutrition labels. They do make it clear in saying this is a rough guideline and people will have varying calorie needs but it’s still a pretty low intake guideline and one people either follow religiously or go far under.",
          "created_utc": 1645471526.0
        },
        {
          "id": "hxv9v93",
          "author": "None",
          "body": "oh sorry i must’ve missed it! thanks for the explanation, your posts/comments always put me at ease :)",
          "created_utc": 1645471584.0
        }
      ]
    },
    {
      "id": "l3gl2v7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1715362231.0,
      "score": 1,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        },
        {
          "id": "l3ec7tn",
          "author": "freakingidontknow",
          "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
          "created_utc": 1715323468.0
        },
        {
          "id": "l3elpji",
          "author": "Zealousideal_Read902",
          "body": "This is so helpful thank you so much you have no idea. Can I ask what you mean by ‘this one has done well for me’? Like what are you doing that you see working? Proud of you",
          "created_utc": 1715330648.0
        }
      ]
    },
    {
      "id": "lgh7k9z",
      "author": "freakingidontknow",
      "body": "i don’t think you’ll like to hear this specifically, but in order to get better that may require gaining weight. you won’t grow and grow and grow and never stop. your body will get to a point where it doesn’t need so much food and you won’t end up eating as much. however, even once you gain weight, who knows how the inside is doing in terms of repair, do you need to honor that hunger and eat. on the other hand, you have to fix the mental pathways, you have to be okay with the fact of gaining weight and that things will be different and that you want to get better. otherwise you may still have the eating disorder, just in a different body",
      "created_utc": 1722791336.0,
      "score": 2,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        },
        {
          "id": "l3ec7tn",
          "author": "freakingidontknow",
          "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
          "created_utc": 1715323468.0
        },
        {
          "id": "lgh409k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1722790136.0
        }
      ]
    },
    {
      "id": "lj8fi79",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 10 (No asking/offering DMs). Please contact the mods if you have any doubts.",
      "created_utc": 1724258140.0,
      "score": 1,
      "context": [
        {
          "id": "kx41m5u",
          "author": "Zealousideal_Read902",
          "body": "Does this take into account exercise? Like even walking? Should it be 2500 for example with no exercise?",
          "created_utc": 1711721802.0
        },
        {
          "id": "l3ec7tn",
          "author": "freakingidontknow",
          "body": "not sure if you still needed or wanted a response, but no it does not. OP mentions in a reply to another that you have to \"Keep in mind these minimums *do not* factor in movement—they are the bottom-of-the-barrel minimums your body will need even when sedentary. If you are active, you *will* need more.\" trust me, i know this is terrifying, and i know its daunting, and im starting different forms of recovery to see if a different approach will work just this week, after many not sticking. this one has done well for me, but i've still had real bad moments, and nothing is linear. all that matters is we make the push, and we dont give up. we deserve to be happy, healthy, and to live, at any weight, size, activity level, anywhere. i promise that calorie number and activity concept will become less jarring",
          "created_utc": 1715323468.0
        },
        {
          "id": "l3elpji",
          "author": "Zealousideal_Read902",
          "body": "This is so helpful thank you so much you have no idea. Can I ask what you mean by ‘this one has done well for me’? Like what are you doing that you see working? Proud of you",
          "created_utc": 1715330648.0
        },
        {
          "id": "l3gl2v7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1715362231.0
        }
      ]
    }
  ]
}