{
  "id": "sy5dhx",
  "subreddit": "fuckeatingdisorders",
  "author": "aiyana0119",
  "created_utc": 1645479818.0,
  "title": "i know we are all disordered/where but cmon",
  "selftext": "it makes me mad to see obviously underweight people posting their tiny “recovery” meals or filming themselves crying while eating a fucking apple like i get we are all sick but that’s just bullshit to me. \n\nwe are sick not dumb🙄 \n\n(ik people genuinely may struggle eating an apple, just an example)",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/sy5dhx/i_know_we_are_all_disorderedwhere_but_cmon/",
  "score": 245,
  "num_comments": 21,
  "comments": [
    {
      "id": "hxw1j6n",
      "author": "None",
      "body": "Recovery vids are what made me relapse a while back, tbh at least the popular ones seem to be more stigmatising than anything. When I was recovering my friends would think I'd cry after eating even the tiniest thing and when I didn't they thought I was already past my ED or \"not disordered enough\". Also everything online seems so dramatised it actually makes it worse if you're recovering but don't act/look like them because... well, EDs love competition.",
      "created_utc": 1645482714.0,
      "score": 89,
      "context": []
    },
    {
      "id": "hxw1cx8",
      "author": "pabstpumpkinbeer",
      "body": "Yo, that shit is toxic as fuck. Time for a social media cleanse.",
      "created_utc": 1645482644.0,
      "score": 55,
      "context": []
    },
    {
      "id": "hxxagjo",
      "author": "Queenofwands1212",
      "body": "Oh there’s definitely some dumb as fuck “anorexia recovery influencers”. Who are basically emaciated and preaching that they’re in recovery. But they’ve maintained their emaciated body for months and months and months. Makes no sense. They’re doing it for validation. They are still in their Ed.",
      "created_utc": 1645503260.0,
      "score": 48,
      "context": []
    },
    {
      "id": "hxxqars",
      "author": "fmdkdnxksk",
      "body": "“what i eat in a day in recovery” the tiniest fucking meals… like why film it when you’re lying to yourself! i’m lying to myself but i’m not so evil as to broadcast it and trigger other ppl",
      "created_utc": 1645512769.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hxwfp3w",
      "author": "messythelioma",
      "body": "This is just my opinion... but it really pisses me off.\n\nThe way I see it, they're doing it for the attention. Like, they're still able to restrict and have their ED but they're also getting praised for \"recovering\" and \"challenging\" themselves. So, they're basically getting love for being a recovery account despite not actually recovering (they get to stay skinny). \n\nOf course this isn't the case for everyone, there definitely are some people who are recovering and do genuinely struggle with eating an apple or something. I'm not trying to discredit you if that is you or if that applies to anyone else. My issue is with the accounts where they don't seem to be making much progress (and getting defensive when people show concern) and they seem to be body checking a lot.",
      "created_utc": 1645488746.0,
      "score": 57,
      "context": []
    },
    {
      "id": "hxwsrkh",
      "author": "Protagoras95",
      "body": "I literally purged today because I felt like obviously I’m faking my ED if I don’t cry over eating anything… fuck those people",
      "created_utc": 1645494772.0,
      "score": 25,
      "context": []
    },
    {
      "id": "hxvy63r",
      "author": "on_a_downward_spiral",
      "body": "that’s why i stopped watching those videos.",
      "created_utc": 1645481359.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hxxr4fh",
      "author": "Fairyslade1989",
      "body": "You mentioned an apple so I feel like mentioning the first time I let myself digest any food after 4 years was an apple. I was 16 and I was too tired to throw up so I fell asleep. When I woke up I didn’t have the full feeling in my stomach. I was so thrilled, but it’s tragic I forgot my body could digest things and become flat again. I’m so glad I started to learn to eat again after that apple.",
      "created_utc": 1645513366.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hxwf1zv",
      "author": "emmareddit",
      "body": "the crying while eating ones make me sick lmao soooo cringe",
      "created_utc": 1645488458.0,
      "score": 26,
      "context": []
    },
    {
      "id": "hxvycyw",
      "author": "StringUnlucky8767",
      "body": "literally",
      "created_utc": 1645481436.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hxy6miw",
      "author": "Notreallysurebutidc",
      "body": "That’s when I stopped caring about eating disorder “influencers”. Used to follow a bunch of them but last year I said F it and if I need help/advice, I go to reddit or other places but them.",
      "created_utc": 1645526004.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hxyj1c8",
      "author": "None",
      "body": "So true! This is so triggering and infuriating. Especially the ones who say they’re “basically recovered” or “recovered”. They’re clearly not. At all.",
      "created_utc": 1645534816.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hxzbi3u",
      "author": "pistachiocals",
      "body": "there is a lot of competitive bs in 'the recovery community' among ppl on various socials. I can really only speak to ig, I'm not that active in using tt. imo, most of those ppl aren't fostering positivity, most of the content I see either strikes me as performative or ppl in (at best) quasi recovery and posting triggering bs. \nthere are 2 ppl (the grand total) in recovery from an/restrictive eds who I follow and actually find helpful/comforting as I try to recover myself. \nfrankly, wieiads feel entirely unhelpful. even if someone posts one that is a comprehensive/'normal' amount for recovery or with a goal of gaining - not to imply all of us in an recovery necessarily will be uw/need to gain - those posts still feel unnecessary. and if someone touting 'recovery' is maintaining what can be obviously determined as an uw body without change for, as you said, months on end, that's pretty damn triggering too. \npersonally I find it difficult to navigate my own early recovery completely on my own (in terms of peers/social support, etc.) but the line between supportive Internet personalities in recovery and ppl claiming recovery but doing damage is very fine. \nI can understand what you're saying about things like posting incredibly minimal wieiads or crying/struggling to eat x food, but I don't feel its my place to speak on that. if I were a 'recovery account' on ig, I would likely be doing similar - part of why I won't start a 'recovery account'. I know I'm in the minority of 'ppl who adhere to an/restrictive ed stereotypes' and I know most ppl are not benefited from that, or content around that specific experience. \nit feels like so much of these recovery communities retain much of the competitive and comparative aspects of active eds. and obv, there is more nuance than I can describe, but that's not news to anyone. \nI hear what you're saying and you're not wrong. there are very few truly positive influences in recovery communities, and a lot of bs that invalidates or triggers us in various ways.\nsorry ro ramble - just my thoughts on this.",
      "created_utc": 1645547623.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hy1b48l",
      "author": "Emergency-Parsley-51",
      "body": "I never cried eating anything and never knew it was an \"ED thing\" untill this year, while in recovery. And it made me really doubt if I had an ED, in the first place. I also remember seeing a girl posting the difference between \"mental health\" and \"mental illness\", mental health being usual things we do to relax and feel better and mental illness, was a video of her in the hospital with IVs. And she had a lot of posts kind of saying that if you are not diagnosed with one, you don't have an ED, you're just exaggerating. It also made me doubt my ED. There are a lot of people suffering from mental disorders and a small percetage of them is hospitalized. I've been diagnosed with several disorders, but I treated all of them without hospitalization (thankfully). This message, that only very concerning forms are real disorders (and even so, not everyone with such forms will be hospitalized), is extremely harmful and will stop people from accepting that they have a problem and from reaching for help. It's invalidating and mental disorders should not be a contest. Most non-professional people should not do education on social meadia, I swear. But I also know professionals that don't do a good job, either.",
      "created_utc": 1645575430.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hxyw3xf",
      "author": "__mirrorimage__",
      "body": "jfc all these posts about ED recovery influencers make them sound so cringe. i both want to check out what the fuss is about and afraid of falling into a black hole of disordered videos.",
      "created_utc": 1645541335.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hxyzyb7",
      "author": "JoJoCubs",
      "body": "I've watched a few of them and they can fuck all the way off..\n\n\nI recently realized just how badly and how long I've been lying to myself. I'm semi trying but I'm also still lying to myself. Thanks to getting caught up in watching and reading stupid stuff, now I've started paying attention to calories. I literally haven't done this since I was morbidly obese and trying to lose enough to get gastric bypass. \n\n\nBut since I'm supposed to be recovering, now I can lie to my family because they are just happy to see me drink my protein drink, eat my bananas and other \"safe foods\" I'm going in for outpatient iv treatments, while I count my bites of normal foods and spit stuff out. And last night I even purged my safe food because I had eaten most of a 3x3 square of pizza earlier with my family.\nSo yeah, I definitely don't need to be watching them.",
      "created_utc": 1645542987.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hxxyzzm",
      "author": "r4v3_g1rl",
      "body": "So true\nSame with the ones saying „have xou eaten today? Please eat something today…“ etc\nI know they mean well but it always makes me feel so invalid since I never fasted in my ed not even at it‘s worst :/\n\nAlso seeing them cry and shake while eating the smallest things made me feel invalid too, I never had such intense reactions when I was challenging myself…",
      "created_utc": 1645519548.0,
      "score": 34,
      "context": [
        {
          "id": "hxw1j6n",
          "author": "None",
          "body": "Recovery vids are what made me relapse a while back, tbh at least the popular ones seem to be more stigmatising than anything. When I was recovering my friends would think I'd cry after eating even the tiniest thing and when I didn't they thought I was already past my ED or \"not disordered enough\". Also everything online seems so dramatised it actually makes it worse if you're recovering but don't act/look like them because... well, EDs love competition.",
          "created_utc": 1645482714.0
        }
      ]
    },
    {
      "id": "hxxtbl9",
      "author": "aiyana0119",
      "body": "no i definitely agree especially with the fact that they claim to be recovering while just maintaining their skinny image for views, very veryyyyy annoying",
      "created_utc": 1645514987.0,
      "score": 16,
      "context": [
        {
          "id": "hxwfp3w",
          "author": "messythelioma",
          "body": "This is just my opinion... but it really pisses me off.\n\nThe way I see it, they're doing it for the attention. Like, they're still able to restrict and have their ED but they're also getting praised for \"recovering\" and \"challenging\" themselves. So, they're basically getting love for being a recovery account despite not actually recovering (they get to stay skinny). \n\nOf course this isn't the case for everyone, there definitely are some people who are recovering and do genuinely struggle with eating an apple or something. I'm not trying to discredit you if that is you or if that applies to anyone else. My issue is with the accounts where they don't seem to be making much progress (and getting defensive when people show concern) and they seem to be body checking a lot.",
          "created_utc": 1645488746.0
        }
      ]
    },
    {
      "id": "hxxter0",
      "author": "aiyana0119",
      "body": "fuck them 100%. i am so sorry & i hope u know ur valid & deserve/need to recover!!!",
      "created_utc": 1645515052.0,
      "score": 10,
      "context": [
        {
          "id": "hxwsrkh",
          "author": "Protagoras95",
          "body": "I literally purged today because I felt like obviously I’m faking my ED if I don’t cry over eating anything… fuck those people",
          "created_utc": 1645494772.0
        }
      ]
    },
    {
      "id": "hxymbnt",
      "author": "on_a_downward_spiral",
      "body": "https://www.instagram.com/reel/CaN27AtAwri/?utm_medium=copy_link\n\nthis is helpful",
      "created_utc": 1645536622.0,
      "score": 7,
      "context": [
        {
          "id": "hxvy63r",
          "author": "on_a_downward_spiral",
          "body": "that’s why i stopped watching those videos.",
          "created_utc": 1645481359.0
        }
      ]
    },
    {
      "id": "hxzbvws",
      "author": "pistachiocals",
      "body": "yes omg. the \"have you eaten today? please eat something/go get yourself x\" is mindblowingly insensitive. like, these are ppl supposedly in recovery, one would think they would understand that saying those things is unhelpful at best.",
      "created_utc": 1645547769.0,
      "score": 10,
      "context": [
        {
          "id": "hxw1j6n",
          "author": "None",
          "body": "Recovery vids are what made me relapse a while back, tbh at least the popular ones seem to be more stigmatising than anything. When I was recovering my friends would think I'd cry after eating even the tiniest thing and when I didn't they thought I was already past my ED or \"not disordered enough\". Also everything online seems so dramatised it actually makes it worse if you're recovering but don't act/look like them because... well, EDs love competition.",
          "created_utc": 1645482714.0
        },
        {
          "id": "hxxyzzm",
          "author": "r4v3_g1rl",
          "body": "So true\nSame with the ones saying „have xou eaten today? Please eat something today…“ etc\nI know they mean well but it always makes me feel so invalid since I never fasted in my ed not even at it‘s worst :/\n\nAlso seeing them cry and shake while eating the smallest things made me feel invalid too, I never had such intense reactions when I was challenging myself…",
          "created_utc": 1645519548.0
        }
      ]
    }
  ]
}