{
  "id": "szjd5s",
  "subreddit": "fuckeatingdisorders",
  "author": "nothingbutreverie",
  "created_utc": 1645628140.0,
  "title": "i'm so angry at society for pushing weight loss onto teenage girls",
  "selftext": "i'm so angry at society for pushing weight loss onto teenage girls!! teenage! girls! literal children!! the diet products, the waistline jokes, the endless fatshaming, the entire internet screaming that thinner = healthier and indulging = guilt!! i'm so angry! we're smart and curious about the world, and we could be spending our time growing and exploring the things that fulfill us, but instead we're crying over bread!!!! stressing at the supermarket for hours LITERAL HOURS over the snacks we don't allow ourselves to have!!!! our bodies are supposed to be growing but instead they're breaking down! it makes me furious that i wasted so much of my time obsessing over my body and beating it into submission when i was supposed to be enjoying my youth!! \n\ni know a lot of people here aren't teenage girls and that these body norms affect everyone. your suffering is so valid - wishing you the best of luck if you decide to recover. but i just need to,, rant about this particular aspect of humankind because it's driving me insane like besties i am so Mad and i want my childhood back! but i'll never have it because of this constant stream of lies that society has ben pumping into its children from the moment they pop out of the womb!!!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/szjd5s/im_so_angry_at_society_for_pushing_weight_loss/",
  "score": 112,
  "num_comments": 9,
  "comments": [
    {
      "id": "hy404x8",
      "author": "Sareeee48",
      "body": "HONESTLYYY I can’t imagine how much I’d have enjoyed my teenage years better if I wasn’t bullied for my body (I wasn’t even *fat*, so I can’t imagine how terrible it must have been for my fat friends).",
      "created_utc": 1645630873.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hy4i0fb",
      "author": "pabstpumpkinbeer",
      "body": "Millennial here (I'm 29). I thought my generation had it bad growing up in the 2000s. Soo much toxic diet culture shit from magazines, media, etc. I was deeply affected by it and developed an eating disorder by 14. But we didn't have social media back then (well, we had Facebook I guess). I cannot imagine being a young girl with TikTok and Instagram and YouTube shoving \"what I eat in a day\" fitspo thinspo bullshit in your face all the time. I'm almost 30 and I compare myself to these girls in their early 20s and even teenagers. I know soooo much better by now but I still do it. And it's so much harder for younger folks. This stuff just preys on y'all. It is so fucking toxic. I'm sorry.",
      "created_utc": 1645637767.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hy3wf1f",
      "author": "stopquaking",
      "body": "Yeah imagine if we'd have been allowed to just exist.",
      "created_utc": 1645629348.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hy47mdd",
      "author": "Puzzleheaded_Spare34",
      "body": "turned 18 last year, have been struggling recently, completely agree with this.",
      "created_utc": 1645633813.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hy5bkbz",
      "author": "rileyyj001",
      "body": "Last year Weight Watchers came out with an *entire* kids program called Kurbo…for ages 8-17 🥴",
      "created_utc": 1645649025.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hy4qxpj",
      "author": "Jonatgan_Official",
      "body": "the hardest part in my brain is that i know even if i escape this shitty way of thinking others my age might not. i have this overwhelming fear of rejection and being disliked, which my ed has been preying on for years. it fucking sucks.",
      "created_utc": 1645641229.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hygnmam",
      "author": "Much_Aspect7923",
      "body": "i’m 14 and have genuinely stunted my growth a ton and now i have an irregular period. i’m so lost",
      "created_utc": 1645840881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hyp3v14",
      "author": "None",
      "body": "Try to help and protect who you can I guess, you are right though\nOf anger, by seneca\nhttps://youtu.be/fibQjH8HZPA",
      "created_utc": 1645998295.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hy9zog1",
      "author": "stopquaking",
      "body": "WTF!!!!",
      "created_utc": 1645729271.0,
      "score": 2,
      "context": [
        {
          "id": "hy5bkbz",
          "author": "rileyyj001",
          "body": "Last year Weight Watchers came out with an *entire* kids program called Kurbo…for ages 8-17 🥴",
          "created_utc": 1645649025.0
        }
      ]
    }
  ]
}