{
  "id": "t49l5u",
  "subreddit": "fuckeatingdisorders",
  "author": "Protagoras95",
  "created_utc": 1646146172.0,
  "title": "What to do when your family agrees with your ED?",
  "selftext": "Two days ago I weighed myself after feast eating, honouring my hunger, however you want to call it, and freaked the fuck out (it was just water weight, btw, but I’m dumb). I made the mistake of ranting to my mom, who had noticed I was eating sweets the day before. So, she replied “just lay off the sugar, you’re eating too much”. I can’t get those words off my mind, yesterday I restricted and today my mom told me she’s not going to keep junk food in the house anymore. I feel guilty as shit",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/t49l5u/what_to_do_when_your_family_agrees_with_your_ed/",
  "score": 112,
  "num_comments": 16,
  "comments": [
    {
      "id": "hyx17kw",
      "author": "None",
      "body": "maybe it’s not that your family is agreeing with the ed per se, just parroting diet culture stuff that they themselves were taught and struggle with. \n\nor idk your mom’s just a jerk, it’s hard to tell bc we obviously don’t know her and what she means. \n\neither way, restricting won’t make it any better.",
      "created_utc": 1646146417.0,
      "score": 86,
      "context": []
    },
    {
      "id": "hyx2fdn",
      "author": "Avelinegrace123",
      "body": "Something I’ve had to come to understand is that those without eating disorders will literally always say the wrong thing,  that was insanely insensitive thing for your mom to say and I’m so sorry, non disordered people have no idea how much food a person in recovery needs to heal their body’s, even straight sugar is good for your body and you deserve to eat it guilt free",
      "created_utc": 1646146946.0,
      "score": 24,
      "context": []
    },
    {
      "id": "hyxl4jm",
      "author": "petitelinotte212",
      "body": "ugh, what a gut check - I'm so sorry. Of course you wanted to confide in your mom. I'm sure she thinks she's helping, but she doesn't understand ED and carries a lot of the misconceptions most people do around what makes us sick. Unfortunately bringing those misconceptions into your home can really undermine your recovery, and you're going to need to draw some boundaries with her. I would slide some materials her way, maybe just send her some links to websites you think have good and helpful explanations so she can begin to understand why, if she wants to help, demonizing foods and telling you to \"eat less\" is the opposite of helping. The problem isn't the food. The problem is the compulsive need to control and restrict in order to feel ok - and the overwhelming fear of what will happen to our bodies if we're not controlling and restricting that is terrorizing our lives. \n\nMaybe start by saying, \"you know Mom, I've been thinking about what you said about keeping junk food out of the house and I think what might actually be more helpful than removing the food from the house, is removing the SCALE from the house.\" I found it really helpful to stress to my family that my recovery goals were not about my weight in any way, but about healing my relationship to food so I can eat when I'm hungry and not be stressed around meals. Fixating on my weight as it fluctuated in recovery was not only not helpful, but was a huge obstacle to making the right choices for my health.",
      "created_utc": 1646154506.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hyxeny3",
      "author": "Cherry__Poison",
      "body": "Same problem here, my mother definitely has disordered eating habits, very restrictive, and she’s always trying to pull me down with her. I’m currently recovering and whenever she slithers in with nasty comments I always tell myself that 1. she doesn’t understand it the way we do. 2. I’m putting my health and well being above everybody’s opinions because this body is mine, not theirs. \nI know It’s hard to just get up and ignore those kinds of people, but I’ve found a healthy support system within my friend group or even communities like this, so always focus on people who see you as a person, not just a body to be marketed. Honour your hunger and your cravings, it is your body that does so much for you to keep you going on the daily basis and you only get it once",
      "created_utc": 1646151992.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hyxr24z",
      "author": "curiogirlx",
      "body": "This just speaks to a fundamental misunderstanding of what eating disorders are. If I had one penny for every time someone told me “diet & exercise will cure your ED, just eat healthy and work out all the time!!” I’d own a goddamn planet by now. Our relationships with food are not in line with diet culture’s calls for restriction of any kind, nor its food guilt or shaming. Even if your mom means well, she doesn’t have the background knowledge to advise in a way that’s helpful, and that’s a best case scenario. I say just totally ignore her and focus on what your body actually wants and needs. She has no way of knowing what will help right now because she doesn’t understand what you’re sick with, even if she raised you and fed you before you were sick. The circumstances are different!",
      "created_utc": 1646156788.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hyx7s5g",
      "author": "ccespgut",
      "body": "My mom always fed my ED without realizing it. I naturally have a pear shape body and she used to say it meant that I was prone to obesity, she was constantly mentioning that I shouldn't eat carbs or sugary foods in general. She would also grab my thigts to show me what she meant. Everytime that I have medical issues she blames it on sugar or my lifestyle choices.\nIt also doesn't help that she has an extremely petit/thin body type",
      "created_utc": 1646149196.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hyx3kwb",
      "author": "ificouldbeonething",
      "body": "People make the worse comments and will continue to… since I can’t do anything about it I think of it as a way to challenge my ed thoughts in a more concrete way. Everything they say is something I have said in my mind and I can justify challenging them because someone else is saying them and it’s not my own thoughts, if that makes sense.",
      "created_utc": 1646147437.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hyxf75a",
      "author": "None",
      "body": "It sounds like your mom, like many others, is a victim to diet culture. Diet culture vilifies honoring our hunger and cravings because our society profits off of self-hate. It is very difficult to continue in recovery while others around you are buying into this, but try to remember the freedom and fulfilling life you will gain by going against your ED. You deserve to be able to eat without guilt.",
      "created_utc": 1646152205.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hyyk4w6",
      "author": "Emergency-Parsley-51",
      "body": "I'm sorry you go through this! I understand you, my mom knows about my ED, she knows how it affected me, but whenever I get triggered and tell her about it, her solution is always weight loss, even though my weight gain was due to Cushing's Syndrome as well (elevated cortisol), so it is not even physiologically possible for me to lose weight. And I don't even want to, because I'm in recovery and because weight loss is against all my values. If I tell her about how people talking about calories make me want to restrict and hyperfocus on calories, she tells me that I don't have to do it, I just have to eat less. Like it is not the same fucking thing. Why don't people understand that you can't solve a problem with the cause of the problem?",
      "created_utc": 1646167951.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hyx6814",
      "author": "qu33r0saurus",
      "body": "My mom encourages/encouraged my ED (she also has disordered eating habits, if not an outright restrictive ed). \n\nIt sucks when you’re trying to get better and your family keeps pulling you back in. I hope you can find some peace.",
      "created_utc": 1646148552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hyyqs1h",
      "author": "kathrynannemarie",
      "body": "My family 1000000% encourages my disorder. It’s really toxic",
      "created_utc": 1646170483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hyzdmuy",
      "author": "hollowcherry",
      "body": "it sounds like she doesn't get what its like to have an ED or how hard it is to manage it, or what is involved in recovering from it, which are all reasons why you have done nothing wrong in your actions. but i don't think it sounds like the following things (which i say because this is what my ED would try to tell me):\n\n\\- that she thinks it's good that you have an ED (maybe she hates your ED and thinks she is being helpful)\n\n\\- that she thinks you should snap out of it (maybe she thought she was giving a helpful tip to help you in the long-run)\n\n\\- that she thinks anything about your weight (maybe she thinks you're fine how you are, but knows you are afraid of gaining, so she thinks she's helping you by her comment)\n\nparents can mean well but often say/do the wrong thing. repeatedly. with good intentions! this doesn't make it okay, but i do not think it means she agrees with your ED... your ED is something that has harmed you. your ED is definitely saying something sinister. whereas your mom probably was not trying to cause harm. but ED will try to twist her words no matter what they were. maybe this was her (crappy) way of trying to encourage \"moderation\" which... let's be frank. sometimes when recovering from an ED, there are times where moderation is not possible. this may be a reality/experience she just does not yet understand. she might even understand aspects of it but not how to approach it supportively.she could benefit from some education around how to be supportive, or maybe even being asked to not interfere (if that would be helpful). she might have her own ideas about sweets and what the \"right\" amount is to eat. does she know how you feel?",
      "created_utc": 1646179818.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hyzhwcp",
      "author": "standsure",
      "body": "My family totally enabled my addiction because, *finally* I was skinny.",
      "created_utc": 1646181699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hyx2h6b",
      "author": "Protagoras95",
      "body": "I think the issue is she wants me to magically just go back to eating like a normal person, and wants me to recover without gaining weight. I told her I was worried about gaining weight in recovery, and she told me to just tell my dietitian I want to stay at my current weight (lower end of healthy BMI). I’m having such a hard time trying to accept the idea my body isn’t meant to be at this weight, and mom’s not making it any easier ☠️",
      "created_utc": 1646146967.0,
      "score": 36,
      "context": [
        {
          "id": "hyx17kw",
          "author": "None",
          "body": "maybe it’s not that your family is agreeing with the ed per se, just parroting diet culture stuff that they themselves were taught and struggle with. \n\nor idk your mom’s just a jerk, it’s hard to tell bc we obviously don’t know her and what she means. \n\neither way, restricting won’t make it any better.",
          "created_utc": 1646146417.0
        }
      ]
    },
    {
      "id": "hyyn6ol",
      "author": "anniekeepsontrying",
      "body": "When I was in treatment there was the option to have a session with my therapist where my mum could join (even though I was over 21) if I felt the need that that could be helpful. Maybe you could ask your mum to come along to one of your sessions (therapy or dietitian) and maybe they could relay to her that you need to gain weight to recover, that it isn‘t unhealthy and how she can support you in this time? Obviously that only work if your therapist or dietitian aren‘t rooted in diet mentality themselves..\njust an idea I had, since sometimes people belive the „professionals“ more than the sufferers …",
      "created_utc": 1646169115.0,
      "score": 9,
      "context": [
        {
          "id": "hyx17kw",
          "author": "None",
          "body": "maybe it’s not that your family is agreeing with the ed per se, just parroting diet culture stuff that they themselves were taught and struggle with. \n\nor idk your mom’s just a jerk, it’s hard to tell bc we obviously don’t know her and what she means. \n\neither way, restricting won’t make it any better.",
          "created_utc": 1646146417.0
        },
        {
          "id": "hyx2h6b",
          "author": "Protagoras95",
          "body": "I think the issue is she wants me to magically just go back to eating like a normal person, and wants me to recover without gaining weight. I told her I was worried about gaining weight in recovery, and she told me to just tell my dietitian I want to stay at my current weight (lower end of healthy BMI). I’m having such a hard time trying to accept the idea my body isn’t meant to be at this weight, and mom’s not making it any easier ☠️",
          "created_utc": 1646146967.0
        }
      ]
    },
    {
      "id": "hyx86u4",
      "author": "chihuahuaorrat",
      "body": "My husband is the same—he doesn’t understand EDs at all and he says a lot of dumb shit but he doesn’t mean it. Maybe your mom is the same—she was just saying things to try to find a solution for your distress about gaining weight in the future without really understanding how it would impact you. It’s really hard but you need to rely on your team who are trained to help you and yourself in recovery. EDs are very difficult for other people to get especially when they are daily being brainwashed by diet culture to think any sort of weight gain is bad and also especially when that person cares about you and just doesn’t want to see you upset and will say anything to soothe you. It’s been hard for me to get my head around with my husband but I’ve had to accept he’s going to say dumb shit but that doesn’t mean he’s doing it with bad intent.",
      "created_utc": 1646149363.0,
      "score": 14,
      "context": [
        {
          "id": "hyx17kw",
          "author": "None",
          "body": "maybe it’s not that your family is agreeing with the ed per se, just parroting diet culture stuff that they themselves were taught and struggle with. \n\nor idk your mom’s just a jerk, it’s hard to tell bc we obviously don’t know her and what she means. \n\neither way, restricting won’t make it any better.",
          "created_utc": 1646146417.0
        },
        {
          "id": "hyx2h6b",
          "author": "Protagoras95",
          "body": "I think the issue is she wants me to magically just go back to eating like a normal person, and wants me to recover without gaining weight. I told her I was worried about gaining weight in recovery, and she told me to just tell my dietitian I want to stay at my current weight (lower end of healthy BMI). I’m having such a hard time trying to accept the idea my body isn’t meant to be at this weight, and mom’s not making it any easier ☠️",
          "created_utc": 1646146967.0
        }
      ]
    }
  ]
}