{
  "id": "t8ltox",
  "subreddit": "fuckeatingdisorders",
  "author": "PaperAeroplane_321",
  "created_utc": 1646646894.0,
  "title": "I see you",
  "selftext": "I’m 7 years post-recovery this year. \nAnd this year is the year I become a doctor. \n\nI have helped care for those of you who are struggling and all I ever want to say is ... “I see you”, “I have been where you are”, “you can do this”. But I never do as I worry it would be inappropriate to share. \n\nBut.... I do see you. \nI see your successes no matter how small others might view them to be. \nI know your struggles.\nI acknowledge your triggers.\nI’m on your side, quietly celebrating how far you’ve come 🥳\n\nYou got this.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/t8ltox/i_see_you/",
  "score": 85,
  "num_comments": 7,
  "comments": [
    {
      "id": "hzpcjse",
      "author": "geebabybee",
      "body": "im not sure if there are like guidelines regarding this in your regulating body or anything, but personally hearing that healthcare providers have lived experience is nothing but helpful to me",
      "created_utc": 1646661698.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hzoxp7g",
      "author": "Thiccsmartie",
      "body": "I have a question: how do you interact with people that have restrive EDS and are at higher weight?\nThere is a lot of fatphobia in the medical field regarding BMI etc",
      "created_utc": 1646652806.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hzpusff",
      "author": "caona",
      "body": "Congratulations, that's an amazing accomplishment! We need more people like you who understand and care in the medical field! Also totally agree with u/geebabybee, of course there's a time and a place for self-disclosure and everyone's experience is different, but I think for the most part it can be incredibly helpful and comforting to know that the person who is there to care for you has been where you are and made it through.",
      "created_utc": 1646669703.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hzpkf4e",
      "author": "Emergency-Parsley-51",
      "body": "This is so nice! Congratulations for everything you've done untill now! It's obvious that you are a highly empathic person, deeply care about what people are going through and you like to actively listen to them. These are essential qualities when you are a doctor. I'm happy to see that people like you are taking this road. Wish you all the best!",
      "created_utc": 1646665357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzqeflk",
      "author": "Prestigious-Bug-7641",
      "body": "You are awesome! Thankyou🤗",
      "created_utc": 1646677320.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hzp27ma",
      "author": "mustardlyy",
      "body": "Goodness this hits me so hard bc even at my lowest point of my ed I was considered overweight, I started restricting when I was morbidly obese. It took me so long to find a therapist who didn’t try to tell me how to lose weight ~the healthy way~ as if I wasn’t losing all my fucking hair, nearly fainting in every lab class I had, and participating in marching band while giving my body exactly zero fuel😅 I was just like yall gotta fuck all the way off bc I’m actually dying and want to STOP losing weight lol",
      "created_utc": 1646655910.0,
      "score": 10,
      "context": [
        {
          "id": "hzoxp7g",
          "author": "Thiccsmartie",
          "body": "I have a question: how do you interact with people that have restrive EDS and are at higher weight?\nThere is a lot of fatphobia in the medical field regarding BMI etc",
          "created_utc": 1646652806.0
        }
      ]
    },
    {
      "id": "hzr0rui",
      "author": "PaperAeroplane_321",
      "body": "The way I personally interact is no different than anyone else. Eating disorders are horrible things to experience. It’s not something thats diagnosed based on appearance. \n\nBut I acknowledge that isn’t always the case. If I ever hear a colleague say something that reflects a poor understanding I usually at that point will try my best to challenge their views. It hits home because I remember being the patient and overhearing comments from the nursing staff. I never want that to happen to those I meet.",
      "created_utc": 1646685945.0,
      "score": 6,
      "context": [
        {
          "id": "hzoxp7g",
          "author": "Thiccsmartie",
          "body": "I have a question: how do you interact with people that have restrive EDS and are at higher weight?\nThere is a lot of fatphobia in the medical field regarding BMI etc",
          "created_utc": 1646652806.0
        }
      ]
    }
  ]
}