{
  "id": "tbdwaq",
  "subreddit": "fuckeatingdisorders",
  "author": "Protagoras95",
  "created_utc": 1646960074.0,
  "title": "Nobody cares about your weight as much as you do",
  "selftext": "Eating more today made me realize something obvious: despite what my ED tells me, my weight isn’t really that interesting to other people. It’s disordered, self centered and quite silly to think otherwise. I caught myself thinking “what would happen if I gained weight in recovery and went back to uni?”. Well, the answer is: nothing. People have more interesting stuff to do than thinking about my weight: socializing, having fun, studying. All the things I’ve been neglecting trying to lose weight to impress exactly no one.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/tbdwaq/nobody_cares_about_your_weight_as_much_as_you_do/",
  "score": 135,
  "num_comments": 16,
  "comments": [
    {
      "id": "i06k4lk",
      "author": "rileyyj001",
      "body": "It’s SO hard to remember this when the ED becomes your sole identity, but damn, it really is true. Thanks for the reminder, I need this rn.",
      "created_utc": 1646960504.0,
      "score": 36,
      "context": []
    },
    {
      "id": "i07gr8t",
      "author": "IamNotABaldEagle",
      "body": "Not only do they not care most of the time, it makes no sense for me to care about what 99% of people think. Even if they did think something negative about my body, does the 2 seconds I spend as a thought in some random person's mind justify ruining my life for?",
      "created_utc": 1646976774.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i06zh6y",
      "author": "DisabledMuse",
      "body": "This is truly most of the time for sure.\n\nUnless you have a rude friend or family member who comments on your weight all the time (like I did), if they don't mention it, they don't think about it. Most people are in their own little world's.\n\nThat asshole voice in your head that tells you you're not good enough is lying to you. You are good enough. It's more than okay to have some extra pounds. Being healthy is what matters.\n\nI wish you all the best in your struggles. You're worth getting better.",
      "created_utc": 1646967510.0,
      "score": 18,
      "context": []
    },
    {
      "id": "i06sa44",
      "author": "Sareeee48",
      "body": "While this tends to be true for people who end up at a “normal” BMI or straight size, it’s important to remember weight stigma is real and it does affect people in larger bodies on a systemic level, including access to treatment. ❤️",
      "created_utc": 1646964193.0,
      "score": 36,
      "context": []
    },
    {
      "id": "i07xggb",
      "author": "Thiccsmartie",
      "body": "I would disagree with this unfortunately. Our culture is OBSESSED with weight. Weight of actors, singers, our neighbors, our neighbors daughter, our own children. Thinking people do not care about other peoples weight is an illusion. However it’s true that everyone cares more about their own weight.",
      "created_utc": 1646988802.0,
      "score": 19,
      "context": []
    },
    {
      "id": "i08npqj",
      "author": "Protagoras95",
      "body": "I’m sorry to everyone who felt their struggles were invalidated by this post. I myself have a history of being fat shamed, and that has been a driving force behind my eating disorder. I also acknowledge that, as a cis male, the pressure from society about my body and my weight isn’t the same as the one experienced by trans people and women. I just wanted to remind myself that my fears and my concerns about my body being constantly judged are blown out of proportion.\nMaybe I could’ve worded this post better.",
      "created_utc": 1647006982.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i08xcv9",
      "author": "notnezu",
      "body": "To be fair, although I do agree, it's unfortunately a bit of a cultural thing in some cases. In my country people can be very \"invasive\" when it comes to others' weight, especially people from older generations. The good thing is this is starting to change, but it's still kind of difficult to avoid.",
      "created_utc": 1647011277.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i07y0yr",
      "author": "YukiHase",
      "body": "I tend to struggle with the fact that if my weight fluctuates a few pounds, NOBODY notices. Only I notice and I let it affect me more than it matters. Like I'd think any random person on the street has in their mind, \"Oh she's 3 pounds heavier today\"... It's a normal, inevitable thing that everyone else goes through. And I don't notice it on them, so why would they notice it on me?",
      "created_utc": 1646989284.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i08nifm",
      "author": "TheScrufLord",
      "body": "Also people who do set like, specific numbers of what they deem as “perfect” for a partner, I don’t think they actually care about the number, they just say anyone who fits their standard is their ideal number size",
      "created_utc": 1647006885.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i089f6h",
      "author": "Nuitella",
      "body": "I wish. My boss is commenting on my weight or my eating all the time.",
      "created_utc": 1646998661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i08cqax",
      "author": "Zimsgirlfriend",
      "body": "I wish my situation was the same cuz my parents only treat me as a number all they care about is my weight getting better and have nothing else to really do with me. I need to get a haircut and they won't take me and I miss hanging out with my friends but they make me just sit around and eat all day.",
      "created_utc": 1647000944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0bve0i",
      "author": "Forward-Woodpecker-4",
      "body": "Thank you so much i really needed to hear this today",
      "created_utc": 1647057053.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i087nso",
      "author": "BeastieBeck",
      "body": "This.\n\nPeople care *a lot* about your weight when you're fat - and not in a good way.\n\n>!Also even if people don't care about my weight at all. I do and that is enough.!<",
      "created_utc": 1646997362.0,
      "score": 7,
      "context": [
        {
          "id": "i06sa44",
          "author": "Sareeee48",
          "body": "While this tends to be true for people who end up at a “normal” BMI or straight size, it’s important to remember weight stigma is real and it does affect people in larger bodies on a systemic level, including access to treatment. ❤️",
          "created_utc": 1646964193.0
        }
      ]
    },
    {
      "id": "i087wp4",
      "author": "BeastieBeck",
      "body": ">Thinking people do not care about other peoples weight is an illusion.\n\nIndeed. It doesn't make sense pretending that they won't. \n\nOne is better off learning to cope with the fact that weight obsession runs rampant in our culture. We don't have to play the diet game - but we shouldn't expect other people to opt out as well.",
      "created_utc": 1646997551.0,
      "score": 7,
      "context": [
        {
          "id": "i07xggb",
          "author": "Thiccsmartie",
          "body": "I would disagree with this unfortunately. Our culture is OBSESSED with weight. Weight of actors, singers, our neighbors, our neighbors daughter, our own children. Thinking people do not care about other peoples weight is an illusion. However it’s true that everyone cares more about their own weight.",
          "created_utc": 1646988802.0
        }
      ]
    },
    {
      "id": "i087vko",
      "author": "Sareeee48",
      "body": "Right. I understand the sentiment of these types of posts, but the reality is not so black and white, and I feel like ignoring this fact is actually quite harmful to fat people who deserve access to everything people in smaller bodies do.",
      "created_utc": 1646997528.0,
      "score": 5,
      "context": [
        {
          "id": "i06sa44",
          "author": "Sareeee48",
          "body": "While this tends to be true for people who end up at a “normal” BMI or straight size, it’s important to remember weight stigma is real and it does affect people in larger bodies on a systemic level, including access to treatment. ❤️",
          "created_utc": 1646964193.0
        },
        {
          "id": "i087nso",
          "author": "BeastieBeck",
          "body": "This.\n\nPeople care *a lot* about your weight when you're fat - and not in a good way.\n\n>!Also even if people don't care about my weight at all. I do and that is enough.!<",
          "created_utc": 1646997362.0
        }
      ]
    },
    {
      "id": "i08874f",
      "author": "BeastieBeck",
      "body": "Preach!",
      "created_utc": 1646997766.0,
      "score": 1,
      "context": [
        {
          "id": "i06sa44",
          "author": "Sareeee48",
          "body": "While this tends to be true for people who end up at a “normal” BMI or straight size, it’s important to remember weight stigma is real and it does affect people in larger bodies on a systemic level, including access to treatment. ❤️",
          "created_utc": 1646964193.0
        },
        {
          "id": "i087nso",
          "author": "BeastieBeck",
          "body": "This.\n\nPeople care *a lot* about your weight when you're fat - and not in a good way.\n\n>!Also even if people don't care about my weight at all. I do and that is enough.!<",
          "created_utc": 1646997362.0
        },
        {
          "id": "i087vko",
          "author": "Sareeee48",
          "body": "Right. I understand the sentiment of these types of posts, but the reality is not so black and white, and I feel like ignoring this fact is actually quite harmful to fat people who deserve access to everything people in smaller bodies do.",
          "created_utc": 1646997528.0
        }
      ]
    }
  ]
}