{
  "id": "tgbtmh",
  "subreddit": "fuckeatingdisorders",
  "author": "messythelioma",
  "created_utc": 1647528234.0,
  "title": "We Were All Failed",
  "selftext": "By our parents (probably moms). Family. Friends. Classmates. Significant others. Society most of all. \n\nI'm sorry for all of us. None of this shit is our fault and I want to say that because part of the ED tells us we're to blame. That there's something wrong with US, but I'm here to say that's a fucking lie and FUCK anyone who has told us otherwise that's led in part to our EDs (or to the people that STILL say shit even now when we're in recovery).",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/tgbtmh/we_were_all_failed/",
  "score": 97,
  "num_comments": 10,
  "comments": [
    {
      "id": "i124u5g",
      "author": "merwookiee",
      "body": "My father and brothers all called me fat when I was a rail thin tomboy. My mother didn’t stop it because it meant they weren’t doing it to her.",
      "created_utc": 1647545824.0,
      "score": 17,
      "context": []
    },
    {
      "id": "i12w7nx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1647556462.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i129bp8",
      "author": "AccordingPie8939",
      "body": "honestly this made me a lil emotional 🥲",
      "created_utc": 1647547515.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i125m50",
      "author": "ginajadesmith",
      "body": "Thanks society, for ruining a part of my life.",
      "created_utc": 1647546116.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i118fz7",
      "author": "Zimsgirlfriend",
      "body": "So true!!!",
      "created_utc": 1647533426.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i13y107",
      "author": "Anfie22",
      "body": "The insults though they were appearance-themed were not about our appearance at all, they did the equivalent of visit a random insult generator online and said whatever it showed. They're assholes for the sake of being assholes, and more often than not it's not even over personal beef but they felt like being an asshole to anyone in their path, that just so happened to be us, and their insults are generic bullshit they pulled from the shallow archives of their shallow minds of hostile things to say. Treat it like fake news, because it is. We took the bait because we didn't know any better at the time, but now we do, especially if you are/have been skinny and their rhetoric never changed, that's hard evidence right there. Don't let yourself get sick and wither away in attempt to halt their crusade because from firsthand experience it does not change, they don't stop, because it was never about your appearance let alone anything rational or based in reality in the first place. Losing weight to gain respect is like studying astronomy in order to learn how to ride a bicycle. It's not even relevant so of course it's not going to work, I learnt the hard way that compensating this way does jack shit. It's gotta be approached directly or by cutting them off completely if they are completely unreasonable and won't stop being a dick.",
      "created_utc": 1647573704.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i189x5c",
      "author": "frompadgwithH8",
      "body": "There’s no user’s manual when you pop out of your mom as a little baby\n\nUnfortunately there are always countless things which would’ve made monumental improvements to our lives if we’d known\n\nBut I think even if we were to have magically known about the most important things that would’ve made beneficial differences in our lives, then other problematic things would become the biggest sore-spots; what I’m saying is, while it’s true that all the people in our lives have the opportunities to help guide us, so we too receive opportunities to guide others. Nobody’s perfect, and everyone has blind spots.\n\nI could’ve been born to an unfathomably rich oil tycoon in the Middle East and had the most luxurious of silver spoons growing up. I’m sure I still would’ve had problems. Robin Williams killed himself. Rich kids at wealthy schools commit crime and need antidepressants too. Life’s always gonna have tough aspects. What’s important is our mental fortitude and resilience",
      "created_utc": 1647653163.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i137h37",
      "author": "messythelioma",
      "body": "This just made me so incredibly sad. I'm so sorry for you (and your mom). It always hurts the most from people that are close to you and are supposed to really love/care for you.",
      "created_utc": 1647561315.0,
      "score": 5,
      "context": [
        {
          "id": "i124u5g",
          "author": "merwookiee",
          "body": "My father and brothers all called me fat when I was a rail thin tomboy. My mother didn’t stop it because it meant they weren’t doing it to her.",
          "created_utc": 1647545824.0
        }
      ]
    },
    {
      "id": "i12xjoy",
      "author": "nevermorethanbefore",
      "body": "This! 🙌🏻❤️",
      "created_utc": 1647557017.0,
      "score": 2,
      "context": [
        {
          "id": "i12w7nx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1647556462.0
        }
      ]
    },
    {
      "id": "i18qjnr",
      "author": "merwookiee",
      "body": "Thank you, that’s very kind of you. I really appreciate your post.",
      "created_utc": 1647661742.0,
      "score": 2,
      "context": [
        {
          "id": "i124u5g",
          "author": "merwookiee",
          "body": "My father and brothers all called me fat when I was a rail thin tomboy. My mother didn’t stop it because it meant they weren’t doing it to her.",
          "created_utc": 1647545824.0
        },
        {
          "id": "i137h37",
          "author": "messythelioma",
          "body": "This just made me so incredibly sad. I'm so sorry for you (and your mom). It always hurts the most from people that are close to you and are supposed to really love/care for you.",
          "created_utc": 1647561315.0
        }
      ]
    }
  ]
}