{
  "id": "txhnnl",
  "subreddit": "fuckeatingdisorders",
  "author": "idkhow2_dothis",
  "created_utc": 1649234987.0,
  "title": "NOTHING IS GOING TO HAPPEN",
  "selftext": "sorry I just need to scream this all out into the void. i just really need motivation to actually recover rn :(\n\nnothing bad will happen if I eat enough and stop exercising. in fact, I need to eat and rest WAY more. I need to actually eat properly and stop compulsively exercising. nothing bad will happen if I sleep all day and not move at all. nothing bad will happen if I just eat and sleep and rest all day. nothing bad will happen even if i eat 1000 more cals than usual or 2000 or 3000 and don't exercise it off. nothing bad will happen if I actually satisfy my extreme hunger and STOP COMPENSATING.\n\nin fact, good things will happen. i will gain happiness. i will gain my life back. i will gain my energy back. i will be able to accomplish my actual goals. i will have friends again. i won't be miserable every single night because i'm so exhausted from overexercising and restricting. i will go to bed full and satisfied. i will not be constantly thinking of food.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/txhnnl/nothing_is_going_to_happen/",
  "score": 84,
  "num_comments": 7,
  "comments": [
    {
      "id": "i3lr48s",
      "author": "ConfidentSugar16",
      "body": "My god it’s so good to read this I’m in the exact same position!! I’m over living such an “empty” life but boy oh boy have I had enough of eating. But best of luck to you do your best!!",
      "created_utc": 1649236172.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i3m30wu",
      "author": "zizisplant",
      "body": "THIS IS THE ENERGY WE NEED TO BE MANIFESTING BABES✨",
      "created_utc": 1649245064.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i3mo9px",
      "author": "filmfanatic24",
      "body": "Thank you, I needed this.  To know someone out there has almost literally the same thoughts as me doesn’t make me feel so alone.  \n\nToday I have 40 mph winds outside and was going to force myself to battle them just to get my walking in (desk job).  It’s ok if I don’t, the world is not going to end.  And, if I don’t, I still can eat the same amount I normally do (and need to eat way more).  \n\nI think of gaining weight often as a failure, but looking at that things you outlined the GAIN is so much more than that.  \n\nStay strong!  Good vibes only!  💪🏻 👊🏻",
      "created_utc": 1649255166.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i3mi399",
      "author": "dudadantas",
      "body": "I really needed this today! Thank you and keep on being strong.",
      "created_utc": 1649252606.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i3m84vj",
      "author": "mandanic",
      "body": "FACTS!",
      "created_utc": 1649247945.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3o183j",
      "author": "doing-things-and",
      "body": "this is seriously a post coming from a place i empathize with. \n\nto more energy and more rest, we can do it, i believe in us-even as strangers-this post means a lot to me.\n\nnothing bad will happen!!",
      "created_utc": 1649273669.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i3pl68a",
      "author": "doctorslacker",
      "body": "Nothing bad will happen :)",
      "created_utc": 1649297072.0,
      "score": 2,
      "context": []
    }
  ]
}