{
  "id": "u1cp9m",
  "subreddit": "fuckeatingdisorders",
  "author": "alenamalina",
  "created_utc": 1649697310.0,
  "title": "This shit actually works??",
  "selftext": "Going into recovery about 3 months ago I was hella skeptical.. I didn’t believe in extreme hunger even though I experienced it three years ago first recovering, I just thought I was binging. But I kept going and while the EH isn’t gone by any means, just decreased, I think about food and exercise and movement a LOT less and holy shit is it freeing (and a bit boring sometimes… brain too empty). And this is really really early in recovery I think. Not sure if I’m weight restored yet and I’m definitely not done, but i’ve improved by a lot. Anyway here’s a few good things that I’ve noticed, in case anyone thinks it’s not worth it:\n\n1. My chest doesn’t hurt anymore, no more heart palpitations and I no longer feel like my heart is skipping a beat (and apparently it was!!!)\n\n2. I can walk with a heavy ass backpack on a steep hill (big hilly campus) without being dizzy and feeling like i’m gonna pass out and panting a bit… so much for being “fit”\n\n3. Less anxiety and panic attacks. Who would’ve known that malnourishment is stressful lol\n\n4. I feel like the colors are literally brighter\n\n5. My nails break less often and my hair looks a lot healthier\n\n6. I can focus on peoples conversations without thinking about my next snack, workout, or afraid that i’m gonna pass out from low blood sugar or have a panic attack\n\n7. Improved memory. I study Chinese and I find it MUCH easier to memorize my characters and I get better grades on my quizzes \n\n8. I take less time to order food bc i’m not analyzing the calorie amount\n\n9. There’s a lot less math in my head lol. I actually never used a tracker and instead just rounded up how much I ate and didn’t let myself eat more than xx amount. Sometimes I do this still unfortunately but the urge has definitely decreased. \n\nSure recovery isn’t all sunshine and rainbows. It’s hard work physically and mentally, with fatigue and overcoming food anxiety body image issues etc., and yeah it’s hard to actually deal with my issues now that my brain can think but i think it’s SO worth it. Just wanted to share some positives with y’all",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/u1cp9m/this_shit_actually_works/",
  "score": 97,
  "num_comments": 11,
  "comments": [
    {
      "id": "i4bgehr",
      "author": "anniekeepsontrying",
      "body": "Always such a joy to read these kinds of posts so thank you and congratulations! You raised some great points! ☺️",
      "created_utc": 1649697554.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i4c66fq",
      "author": "Easy-Opposite-5431",
      "body": "I am so happy for you ☺️ I definitely relate to the free brain space. I knew that I thought about food a lot but I didn’t realize just how much time and space it took up in my brain. I think with recovering some and thinking about food significantly less I was like wow I really just thought about food 24/7 lol. What a sad life that was",
      "created_utc": 1649708859.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i4c500b",
      "author": "stopquaking",
      "body": "Number four is so beautiful wow",
      "created_utc": 1649708411.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i4bginp",
      "author": "Prestigious-Bug-7641",
      "body": "Ooh this is so awesome! Well done to you.. onwards and upwards etc.. you inspire me- I love seeing this kinda post- gives me hope and helps me mentally prepare myself for what's to come... This is brilliant though and I'm so happy for you❤️",
      "created_utc": 1649697597.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4dtix2",
      "author": "icewater-nolemon",
      "body": "YESSS!! God I forget how much the mental math used to RUIN my brain, and just turn it to mush. It only goes up from here friend. There will be good days and bad days but the worst day in recovery will always be better than your “best” day with an eating disorder. Be well",
      "created_utc": 1649734341.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4dw57o",
      "author": "fuffybabie",
      "body": "I really needed to see this. Did you recover individually or with the help of a professional?",
      "created_utc": 1649735706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i4dw5g2",
      "author": "alenamalina",
      "body": "> The worst day in recovery will always be better than your “best” day with an eating disorder.\n\nTHIS!! This is what I have to remember anytime there’s an urge to relapse or I catch any ED behaviors creeping in. Thank you 🥺🥺",
      "created_utc": 1649735709.0,
      "score": 5,
      "context": [
        {
          "id": "i4bgehr",
          "author": "anniekeepsontrying",
          "body": "Always such a joy to read these kinds of posts so thank you and congratulations! You raised some great points! ☺️",
          "created_utc": 1649697554.0
        }
      ]
    },
    {
      "id": "i4cld1z",
      "author": "alenamalina",
      "body": "NO FR and like now i’m like ??? i’m bored u feel me",
      "created_utc": 1649714778.0,
      "score": 4,
      "context": [
        {
          "id": "i4c66fq",
          "author": "Easy-Opposite-5431",
          "body": "I am so happy for you ☺️ I definitely relate to the free brain space. I knew that I thought about food a lot but I didn’t realize just how much time and space it took up in my brain. I think with recovering some and thinking about food significantly less I was like wow I really just thought about food 24/7 lol. What a sad life that was",
          "created_utc": 1649708859.0
        }
      ]
    },
    {
      "id": "i4h6w8g",
      "author": "alenamalina",
      "body": "I’m glad you found this helpful! Im actually pretty early in recovery but I just wanted to share some positives of even a few months, and not everyday was perfect. I do have the help of a doctor and a therapist, and I’m looking to get a dietician soon. Took me forever to find a doctor that took me seriously because i wasn’t “underweight enough” (whatever that means??). I also told my friends around the second month, and they’ve been super supportive. I think telling those who I trust and having a good doctor was most helpful and has made this recovery (I’ve relapsed like 10 ish times) the best and most sustainable one. Best of luck to you!!",
      "created_utc": 1649795797.0,
      "score": 1,
      "context": [
        {
          "id": "i4dw57o",
          "author": "fuffybabie",
          "body": "I really needed to see this. Did you recover individually or with the help of a professional?",
          "created_utc": 1649735706.0
        }
      ]
    },
    {
      "id": "i4cmfpg",
      "author": "Easy-Opposite-5431",
      "body": "Hahah yes!! We need hobbies. I realized I have no hobbies because the ED filled that for so many years",
      "created_utc": 1649715221.0,
      "score": 5,
      "context": [
        {
          "id": "i4c66fq",
          "author": "Easy-Opposite-5431",
          "body": "I am so happy for you ☺️ I definitely relate to the free brain space. I knew that I thought about food a lot but I didn’t realize just how much time and space it took up in my brain. I think with recovering some and thinking about food significantly less I was like wow I really just thought about food 24/7 lol. What a sad life that was",
          "created_utc": 1649708859.0
        },
        {
          "id": "i4cld1z",
          "author": "alenamalina",
          "body": "NO FR and like now i’m like ??? i’m bored u feel me",
          "created_utc": 1649714778.0
        }
      ]
    },
    {
      "id": "i4dtg30",
      "author": "alenamalina",
      "body": "I’m rlly into creative makeup and while I never stopped and actually got into it when I was in quasi recovery for a few months, I think I’ve definitely gotten better and my hands are steadier lol",
      "created_utc": 1649734302.0,
      "score": 2,
      "context": [
        {
          "id": "i4c66fq",
          "author": "Easy-Opposite-5431",
          "body": "I am so happy for you ☺️ I definitely relate to the free brain space. I knew that I thought about food a lot but I didn’t realize just how much time and space it took up in my brain. I think with recovering some and thinking about food significantly less I was like wow I really just thought about food 24/7 lol. What a sad life that was",
          "created_utc": 1649708859.0
        },
        {
          "id": "i4cld1z",
          "author": "alenamalina",
          "body": "NO FR and like now i’m like ??? i’m bored u feel me",
          "created_utc": 1649714778.0
        },
        {
          "id": "i4cmfpg",
          "author": "Easy-Opposite-5431",
          "body": "Hahah yes!! We need hobbies. I realized I have no hobbies because the ED filled that for so many years",
          "created_utc": 1649715221.0
        }
      ]
    }
  ]
}