{
  "id": "u269a8",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1649789063.0,
  "title": "Just reminder that if you end up “overweight”/in a larger body post recovery, you aren’t a failure",
  "selftext": "I spent years of my life convinced that ending up in a larger body would be unbearable, intolerable, unsustainable. That it would symbolize my life as a massive failure.\n\nI gained a lot of weight in recovery… and while I don’t really fit into fat spaces, I am the heaviest I have ever been and I’m certain I’ve surpassed the “healthy” BMI range. And honestly? I didn’t develop diabetes, I didn’t die, and the universe didn’t explode. While I don’t necessarily *like* my body, I accept that this is the body I need to be in to be healthy, whether it’s permanent or not.\n\nSo this is just your reminder that if you ended up “overweight” or in a larger body post recovery, you are not a failure. The societal chatter regarding diet culture can be very loud at times, but I am here to tell you that you are not alone; your body isn’t broken, you aren’t a failed thin person, and you don’t need to change.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/u269a8/just_reminder_that_if_you_end_up_overweightin_a/",
  "score": 96,
  "num_comments": 6,
  "comments": [
    {
      "id": "i4gum9y",
      "author": "musingsofamdc",
      "body": "What a great reminder! I think it’s important once we start to heal to recognize how our thoughts on being overweight have been shaped and how ingrained fat phobia is in our society. There is so much out there about anti fatness, anti blackness, and weight stigma and misogyny - enough to make your head spin and make you so angry!",
      "created_utc": 1649791210.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i4hweol",
      "author": "Anxious_Aardwolf",
      "body": ">I accept that this is the body I need to be in to be healthy. \n\nPreach it. You cannot stress enough that thin doesn't equal healthy. Likewise large doesn't equal unhealthy. Even at my lowest weight I still had a \"normal\" BMI. Yet my endocrine system is totally effed up due to restricting, overexercising and the binge-purge cycle.",
      "created_utc": 1649806857.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i4jemvu",
      "author": "absolute_boy",
      "body": "Furthermore, these reassurances you often see that anorexics will inevitably recover into naturally skinny bodies is I think indicative of lingering disordered thoughts. There's every chance you won't be thin post-recovery, and that's OK. I understand these reassurances come from a place of kindnes, as telling someone deep in their ED that they might gain more than they consider acceptable will probably just scare them - but they aren't true. What is true, though, is that if you decide to power through and recover regardless, the reality of ending up bigger than you thought doesn't matter to you all that much any more.",
      "created_utc": 1649835624.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i4h6060",
      "author": "kjacmuse",
      "body": "Thank you.",
      "created_utc": 1649795470.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i4k0i9i",
      "author": "throwawayaccc9876",
      "body": "I needed this so much. Biggest I’ve ever been and still have extreme hunger. This is so hard, but I’m 20 and trying to bear in mind I’m still growing. I feel like a fraud because I feel like I didn’t restrict enough to justify so much overshoot",
      "created_utc": 1649852020.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4hv39n",
      "author": "Sareeee48",
      "body": "Everything you said is spot on. It’s shitty that our society is centered around shitting on other people, women in particular.",
      "created_utc": 1649806291.0,
      "score": 9,
      "context": [
        {
          "id": "i4gum9y",
          "author": "musingsofamdc",
          "body": "What a great reminder! I think it’s important once we start to heal to recognize how our thoughts on being overweight have been shaped and how ingrained fat phobia is in our society. There is so much out there about anti fatness, anti blackness, and weight stigma and misogyny - enough to make your head spin and make you so angry!",
          "created_utc": 1649791210.0
        }
      ]
    }
  ]
}