{
  "id": "u41cvx",
  "subreddit": "fuckeatingdisorders",
  "author": "simbalucky21",
  "created_utc": 1650002473.0,
  "title": "scare me into recovery please",
  "selftext": "anorexia/bulimia horror stories, nothing else is working lmfao",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/u41cvx/scare_me_into_recovery_please/",
  "score": 120,
  "num_comments": 96,
  "comments": [
    {
      "id": "i4suvr4",
      "author": "6odh1",
      "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
      "created_utc": 1650003006.0,
      "score": 186,
      "context": []
    },
    {
      "id": "i4t8cy0",
      "author": "sunglasses619",
      "body": "I was a peer counselor for a girl with anorexia when I was in college. She had been forced to abandon her own degree and craft business at the same college years earlier due to her ED. She was 26 and her reproductive system had shut down. She had lost all her friends and never been in a relationship. Her only relationships were with her family, which was strained due to the toll the ED took on everyone, her doctor, her dietician, her therapist, and me. All she did was go to the gym, go to appointments, go grocery shopping, and spend time alone in the apartment she shared with family - constantly fighting with them when they were together.\n\nI tried to be supportive but she said 'You're young and you don't realize how hard it is to pull yourself out once you've let it get this far.'\n\nShe wrote beautiful poems and journal entries about a recovery she had no idea how to actually access. She was extremely talented and caring but no one saw it.\n\nI looked her up recently and she had passed away of a heart attack before turning 30. She had spent the last years of her life in and out of treatment, seen only by medical staff and her distraught family. And that was it.\n\nI can't explain how I felt after seeing that. It's such a lonely, painful life with such a sad end.",
      "created_utc": 1650014090.0,
      "score": 133,
      "context": []
    },
    {
      "id": "i4sv5ez",
      "author": "TerrifyinglyAlive",
      "body": "Last year I was at the dentist 8 times.  That’s once every 6 weeks.  Most of my teeth are fake already and the rest of them are in rough shape. I’m at serious risk of my lower jaw bone deteriorating now.",
      "created_utc": 1650003213.0,
      "score": 78,
      "context": []
    },
    {
      "id": "i4t7u0o",
      "author": "Notreallysurebutidc",
      "body": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.",
      "created_utc": 1650013632.0,
      "score": 61,
      "context": []
    },
    {
      "id": "i4tf2s9",
      "author": "BluePurslane",
      "body": "Not sure how old you are.  But recall a number of years back there was the \"It Gets Better\" movement for LGBT youth?  There should be a parallel movement for people with EDs.  The \"It Gets Worse\" project.\n\nLiterally everything gets worse, the longer you go.  I was on the road to alienating my husband, children, parents, and friends with my bizarre behavior and extreme paranoia.  I wasn't emotionally present for my children, and it's only by the grace of God that I recovered while they were young enough, because if they remembered me like that in their older years I'm sure I'd never have an adult relationship with them.\n\nPhysically it gets worse too.  Teeth, bladders, constant earaches, weak bones, nerve pain, hair sucks, no sex drive.  You'll waste your youth on this stuff and if you survive you'll wake up middle aged and if you recover you'll know you spent your youth feeling like death for literally nothing, NOTHING at all.  And I wasted all that time, only to recover to the same weight that I was right before I started.  There was nothing to show for it but physical agony, a terrible personality, and damaged relationships. \n\nIf you want to have children (or do have children) you will either 1) not be able to or 2) alienate them with your horrible behavior and anger.  If you want (or have) a romantic relationship, you will eventually alienate that person too.  You will end up alone and isolated as friendships as all your thoughts and actions serve your ED.  You will be so, so selfish.\n\nEverything will feel hard, all of the time.  You will always be exhausted.\n\nNow that I recovered literally all of that is gone, all of it.  I still have a few chipped teeth but that's it.  It took a while, but I feel physically 100% better.  My relationships with my children are normal and I even had more.  My marriage is great.  I do wonder if the damage I've done to my relationship with my parents can ever be fully healed though, and I really regret that.\n\nDon't let it take another day from your life.",
      "created_utc": 1650019622.0,
      "score": 62,
      "context": []
    },
    {
      "id": "i4sydnc",
      "author": "uhhhhhhhbro",
      "body": "my teeth got so fucked up after purging for so long. like they are fucked. can’t even afford to go to a dentist so just living w them the way they are. absolutely wish I would’ve stopped sooner, I never thought the teeth thing would affect me, they were perfect before. Personally never thought those effects you hear about would happen to me bc I went a LONG time without any but trust, they will sneak up on you and it will absolutely suck. I lost so much hair.",
      "created_utc": 1650005712.0,
      "score": 42,
      "context": []
    },
    {
      "id": "i4t6jnk",
      "author": "ZtoA_Limited",
      "body": "Well in addition to my teeth being shit (there’s a giant hole behind one of my front teeth, it’s turning grey and it sucks), and my hair thinning rapidly, I have started to have seizures and cannot drive. I pissed the bed twice during nightly seizures. So I have no autonomy; no freedom. Last week I passed out twice in a day and my blood pressure and electrolyte levels were so low I could have died; spent 4 days in a regular hospital just for them to stabilize me - no visitors except one at a time so I couldn’t see my family. I fucked up our septic tank and had to get it pumped twice in a year’s time; the guys asking why there was so much “grease” was so embarrassing. \n\nPlease don’t waste your life/youth/health/whatever you have going for you to be obsessed with food, feeling constantly embarrassed, cold, and wanting to stop so badly but the behaviors have become so ingrained that you can’t.",
      "created_utc": 1650012516.0,
      "score": 41,
      "context": []
    },
    {
      "id": "i4u0798",
      "author": "Skybluewaves",
      "body": "You are going to waste your potential if you continue like this.\n\nYou are going to spend your life obsessing over food 24/7 while everyone else around you is not going to give food a second thought.\n\nYou can never reclaim this lost time, and the more time you spend disordered, the more time you lose. No matter what you do from this point forward, you can’t go back. \n\nYou are going to be hung up on an image of yourself that isn’t real. To body standards and arbitrary rules that ultimately mean nothing, because no one else gives a shit. You are going to hold yourself prisoner to a cycle of thoughts that you don’t have to act on at all. \n\nYou are going be too tired or weak, both mentally and physically, to have meaningful relationships, a fulfilling career, pursue your passions and hobbies, have a social life, successful marriage, house, kids, travel, etc. (if this is all something you want, that is). If you have kids, you’re likely going to pass your disorder onto them, too, whether knowingly or unknowingly. You are going to be sad or angry or irritated all of the time. You are going to struggle to think. You will be a shell, a ghost, of the person you once were. When you look in the mirror, you may see someone smaller, but there will be no light in your eyes. \n\nYou are going to turn down experiences and fun activities and bonding moments all because they involve food. \n\nPlease take a moment to try to step outside of yourself and your perceptions and try to understand how that sounds.\n\nYou are going to watch the world move on without you, because this life waits for no one. You will sit on the sidelines and you will see everyone else around you achieving their dreams and being happy.\n\nAnd you’re going to be counting calories.\n\nYou are going to be trapped in this cycle, a prison of your own making. Never changing. Never moving on. \n\nAnd anyone who’s trying to help you will likely eventually just get tired of it — possibly resentful, bitter, or short-tempered — because they can’t help you if you don’t want to help yourself. When you’re unable to do anything for yourself, you will be dependent on others in every way — physically, financially, mentally, emotionally. But they can’t all light themselves on fire just to keep you warm. And it’s so painful to watch a loved one injure and slowly kill themselves for seemingly no reason at all.\n\nNo one else cares. Why are you destroying your life for this? Why are you spending your limited time on this earth in suffering? Why do you think you deserve so little? \n\nBy not recovering, you are sending a message to yourself and to everyone around you that you don’t care, you don’t want to get better, and you are allowing yourself to get worse and eventually succumb to this disorder. \n\nThere comes a point where you need to value your own life and happiness over this disorder. You need to give more of a shit about yourself than this disorder. (And if you don’t, you need to ask yourself why the hell that is.) You need to say, “Fuck this disorder” because you’re tired of this shit, and you are worth more than this. You are not this. This is not who you are. Life is so much more than this. You are not your disorder and your disorder is not your life.\n\nAt the end of your life you want to look back with minimal regrets. You will regret everything you didn’t do, not what you did. When someone asks you what you’re most proud of, your greatest accomplishments, what you did in life — I sincerely hope each one of us are able to answer with whatever means the most to us individually.  And everything we were able to accomplish because we recovered from our disorders. Not “I counted calories and starved myself.” \n\nNone of this is even accounting for the very real physical effects you will feel and experience throughout your ED. A lot can be healed through recovery, but some can’t. \n\nDo something about all this. Stop throwing your life away.",
      "created_utc": 1650031572.0,
      "score": 40,
      "context": []
    },
    {
      "id": "i4ues5i",
      "author": "Lopsided-Shallot-124",
      "body": "I just watched my best friend die of anorexia.  We went out for coffee and she couldn't even lift her leg up to get on the side walk from the parking lot without help.  She got stuck in the public bathroom because she was too weak to open the door.  At her funeral everyone talked about how hard it was to love her... Except me.  Her funeral was the absolute worst I have ever been to because everyone acted like she was just some huge burden and the only thing worth talking about was her Ed habits and how they effected their life.  I know it's shallow but hearing how people talked about her at her funeral would be my absolute worst nightmare.",
      "created_utc": 1650037735.0,
      "score": 35,
      "context": []
    },
    {
      "id": "i4sxywy",
      "author": "attic-dweller-",
      "body": "Hair falling out is devastating. I wouldn't wish it on anyone. I don't know if I'll ever get it back. it makes me cry all the time. will i have to get a buzzcut? go bald? my head is such a weird shape!! can't do any fun hairstyles because it shows off my baldness. I wouldn't wish this on anyone.",
      "created_utc": 1650005389.0,
      "score": 58,
      "context": []
    },
    {
      "id": "i4tbrkj",
      "author": "Damaya-Syenite-Essun",
      "body": "I’m 39 and might have to get a pacemaker.",
      "created_utc": 1650016997.0,
      "score": 25,
      "context": []
    },
    {
      "id": "i4uqzz4",
      "author": "alenamalina",
      "body": "Bare with me, this is gonna be a long one. Sorry, just have a lot to say...\n\nTo be honest what scared me wasn’t “if ur not recovering ur dying” it was basically “if ur not recovering u have to live like this for the rest of ur life” because i literally did this as a form of passive suicide and i was PISSED that it was taking so slow and turning me into a living corpse, the worst of both worlds. If I didn’t start recovery…\n\n&#x200B;\n\nI’d have to get a pacemaker at age 21 or deal with the heart palpitations, or slowly die. Ironically what scared me about this was inherently disordered, that I'd have to take six weeks off the gym. I have to take off the gym right now regardless, but the marks of the  “titty stickers” from the heart monitor stay four months later and remind me of what happened. I joked about it with my friends and worked out in a sports bra and shorts with the stupid heart monitor tucked into my bra for two weeks and dear god was i terrified of how i looked, like a skeleton with abs, but i still wasn’t “sick enough” or “thin enough” to recover. And yea i joked about being a “robot” with my friends… they didn’t find it funny.\n\nI was actually studying for finals when I got the call to go to the hospital at 10 pm bc my EKG showed my heart rate was 39. I had to drive MYSELF to the hospital… and they make u pay for parking. My friends were busy going out that day because it was a Friday and didn’t answer my texts, my dad did but just thought my heart was just “fit.” I was there all alone, but the hospital let me go bc the anxiety increased my heart rate to 43 and that meant to them that I wasn’t sick enough, so I carried on for the weekend until my cardiologist appointment. What was most scary to me was the IV, that shit HURTS.\n\n&#x200B;\n\nA week later, Christmas Eve, I was smoking weed with my friends and they asked me why I never drank.\n\n“Do you wanna know the truth? I’m afraid of the calories, i don’t like to drink my calories”\n\nMy friend hugged me and started crying, saying “you’re so tiny, oh my god you’re gonna die.”\n\n“no i’m not, i’m fine, i’m recovered i promise”\n\ni sincerely believe this because i stopped weighing my food and only loosely counted calories, despite losing 10 lbs from the start of “recovery.”\n\nI ended that night sleeping in my friends bed. I believe drugs open up what you're hiding from yourself, so of course I had raging anxiety. I measured my heart rate STANDING, 41. I was starving, but too afraid to eat in front of people. I ended up eating a small meal, and no one judged but I was sobbing. I was too scared to sleep alone in the guest bedroom because I thought I would die in my sleep, and no matter how suicidal I was I just thought “i’m not fucking done yet, i’m only 20. i’m not done”\n\nFast forward to my birthday less than two months later. I was almost all in, just learning about what it means and basically binge watching Tabitha Ferrar. I was finally ready to drink alcohol but i was STILL afraid to eat in front of people. So I skipped lunch and a few snacks because I didn’t wanna \"inconvenience\" others by eating. So, I had super low blood sugar and almost passed out in the middle of the street in an unfamiliar city in the dark. My friend left me while waiting for me to get back from the liquor store (for unrelated reasons she had boy troubles and school stuff and wanted to go home) and when she came back, she was just annoyed that yet again I was on the floor hyperventilating and instead walked a block ahead of me. Maybe she was embarrassed or maybe she didn’t care or maybe she was just dealing with her own issues, i don’t know. My arm was numb and I thought I was having a heart attack. I drove her home and it took 40 minutes but in the end my arm was still numb and my face started to become numb too. I went to get food bc I was ravenous, read that if your left arm is numb it's a sign of a stroke or heart attack, and I was too scared drive myself to the hospital again so I fell out of my drivers seat onto the pavement and started begging someone to drive me to the hospital. Of course everyone thought i was drugged because it was a Saturday night on a college campus, but all I could yell in response was “no!! it’s my 21st birthday and i’m completely sober and i think i’m dying!!” Thankfully a group of girls calmed me down and I got home safe.\n\nThen the following weeks i kept having panic attacks. Yes, obviously I have anxiety, but what was the main culprit? For whatever reason, being afraid to eat in front of others or not having access to safe foods. Basically, I was hungry and had low blood sugar. For an entire month before recovery, I was having panic attacks once or twice a day, the longest one lasting twelve hours. I couldn't focus on school and I almost flunked. If I didn't have understanding teachers and the excuse of \"coming back to in person classes during a pandemic,\" I almost certainly would have. Ever since eating consistently, my panic attacks have gone down, and I haven't gotten one in a month since I started eating more often.\n\nWhat really got to me was the fact that the list of safe foods kept getting smaller and smaller and I was too afraid to eat in public. How can you when all you can eat is egg whites, protein power, quest bars, and applesauce?\n\nNow, onto bones. I've been asking for a DXA scan since I lost my period four years ago, but I was never \"underweight enough\" or \"too young\" or \"I was an athlete.\" Anyway, I have osteoporosis in my lumbar spine and osteopenia in my left hip. Okay, creaky bones, who cares right? If you have weak bones, your spine will contract and you're gonna get shorter. If you fall, you're at risk for a stress fracture in your hip and you may become immobile. The thing that got to me most was getting shorter. I'm 5 foot 6, so I'm not that tall nor am I short. But combined with the fact that EDs make you a bitch, and you're gonna get shorter?? You're gonna be a chihuahua?? That's what made me take a break from exercise, deadass. I'd rather scream and cry from the mental anguish lack of exercise gives me than become short and potentially break my spine from squatting 225.\n\nThe break from exercise actually made me realize I have basically no interests outside of food and exercise. I mean, I do, but they've become numb. I'm super interested in history, philosophy, sociology, learning languages, creative makeup, etc. but I find it hard to focus. My memory's improved since recovery and I hope to god I get my photographic memory back, but who knows? I also can't watch TV or youtube videos anymore. My youtube feed was full of food and workout videos, especially the stupid anabolic diet and volume eating and how to become \"shredded.\" Since I've cleaned that out, all I have left is Tabitha Ferrar, and that breaks my heart.\n\nI looked at my schedule I created for the semester, to be super busy all the time to not have time to eat food (the most annoying part of recovery is working around this... but I've figured it out) and how I've filled my time with pointless activities, and accidentally finished a major I despise and kept up a pointless internship and gone through ten pointless jobs just because it keeps me busy. And how I fit in 1-2 hours a day specifically for exercise, skipping club meetings or homework to make a workout. I have one year left of college, and damn do I hope to make the most of it.\n\nNow onto the other side of EDs, the outsider's perspective. One of my friends of ten has an ED, and she's become a total bitch because of it. We had a huge fight at the beginning of the school year, and while some of it wasn't about ED behavior, a lot of it was. And I can't blame her because she's obviously malnourished just like I was, but damn did it turn her into a total fucking bitch. It was over stupid shit that happened four years ago, she even broke up with her girlfriend over a granola bar once. She said my simple presence triggered her, since she knew I had an ED, so I told her to fuck off.\n\nThis is a lot and I apologize but if you read all of this, thank you. Truly, no one gives a shit about your ED, or how \"good\" you are at it, or even your workouts. When I talk about food for too long, my friends always go \"okay can we talk about something else we've been talking about this for way too long.\" There's more to life than this shit. I'm not afraid to die from this illness, I'm afraid to be a living corpse who's obsessed about food and refuses to admit she has a problem.",
      "created_utc": 1650042666.0,
      "score": 27,
      "context": []
    },
    {
      "id": "i4t8feo",
      "author": "burnerphonepost",
      "body": "I used to think getting a bloody nose during purging was  ok but I broke something in my sinuses. My tonsils are easily inflamed because of purging. I get sick alot. My teeth cost 6000 to fix and there is still damage. My bowels are messed up from laxatives. It was not worth it. I am so much happier in recovery.  Recovery is like a new life.",
      "created_utc": 1650014153.0,
      "score": 23,
      "context": []
    },
    {
      "id": "i4topd5",
      "author": "OrderofOddfellows",
      "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
      "created_utc": 1650025859.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i4udgg4",
      "author": "dumdum_gutterslut",
      "body": "My personal horror story that hasn’t happened yet would be watching my daughters do the same shit that I do with food. I just.. can’t imagine. They’re only 2 years old, but I don’t want them to suffer with addiction and restriction the way I do. It’s not a life. It’s not a REAL life. It’s just.. going day to day.\n\nMy personal horror story that HAS happened is being diagnosed with premature ovarian failure / perimenopause at 29 years old and having repeat miscarriages that almost killed me to have my daughters. That was super traumatic and fucked up.\n\nMy other horror story is meeting women in treatment (like 40-50 years old) who had had ED’s for the majority of their lives, and you would look into their eyes and just see.. blankness. Nothing there. You could tell they used to be intelligent and bright, but years of abusing their bodies just did irreparable damage. Even in recovery, they still had this weird blankness about them, like something has been starved out of them forever.\n\nLosing my intelligence frightens me the most, right behind losing one of my children to addiction.",
      "created_utc": 1650037198.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i4thwsp",
      "author": "unsaintedheretic",
      "body": "kidney stones. seriously. the worst thing that I ever had to go through was passing two kidney stones.\n\nI was chronically dehydrated for probably around two decades. I rarely drank water (because I thought it'd make me bloat), I abused alcohol, I worked out a lot at times and I was bulimic. All things that contribute to chronic dehydration. and if you think you'll notice being dehydrated... guess what, your body won't necessarily let you know before it's too late.\n\nanyways; I woke up one morning, went for a run and had, what I thought, light spotting. it was weird because I had my menstruation a week prior but it was irregular af (because of my ED) so I didn't think too much of it.\n\nfast forward to the evening... I was in excruciating pain. nothing in my life ever hurt as bad as when the kidney pain began - or so I thought. I was rushed into the hospital with an ambulance, I couldn't even walk straight. in the hospital they needed a urine sample and it was pretty much all blood by then. I thought I'd either pass out or vomit when I went to the toilet both from pain and shock.\n\nand then the real pain started. I can't even describe the pain that encompasses your body when a kidney stone or two pass into your urinary tract... I honestly screamed out loud and cried because it was unbearable. I felt like dying and actually wanted to die because the pain was too much. my body was shaking, I was so damn dizzy I thought I'd really pass out then. no matter how I tried to sit (standing was impossible at that point) the pain would only intensify.\n\nthat pain lasted for about an hour or so but it felt eternal.\n\nI recovered and the kidney stones passed by themselves (that actually didn't hurt) a week later, but the doctors wanted to operate on me (which I declined fortunately) because they weren't sure they'd make it out by themselves.\n\nI will never forget that pain, ever again. I talked to other people who had kidney stones and some women told me that they'd rather have a complicated childbirth again than a kidney stone.\n\nI really turned my life around after that and went into recovery. it was the best decision of my life. I may not look like I did back then but I feel so so so much better. my depression lessened, my skin is glowing again, my joints don't ache anymore, I have so much more energy and can think more clearly.\n\ndon't wait until it's too late. there's so many worse things (including death) that can and eventually will happen.",
      "created_utc": 1650021648.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i4vqubj",
      "author": "fuffybabie",
      "body": "All of these comments have succeeded in scaring me into making better choices today",
      "created_utc": 1650057838.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i4vse84",
      "author": "Funky_Lesbian",
      "body": "if you want something brutally scary and mean, staying in your eating disorder might negatively affect how people around you see their own food/bodies. i developed an eating disorder after dating a girl with anorexia. we’ve been broken up for years now, but i’m still dealing with the illness i “caught” from her.",
      "created_utc": 1650058548.0,
      "score": 15,
      "context": []
    },
    {
      "id": "i4ts8lv",
      "author": "thenemesissss",
      "body": "nearly lost my sister to her eating disorder. she got sick enough to where she was hospitalized for nearly a whole year. her body was going against her during that  time and could barely take in liquid foods. she lost her personality. wanted to unalive all the time bevause of the damage she caused to herself. at one point she had surgery for an ulcer that would cause her to faint from so much pain. all of this hurt me and loved ones the most (something that shattered her since she knew we wanted her here). now that she is recovered for the most part she’s free from most of this. she still has her issues but she’s a lot better now. she struggled with anorexia majority of her life. \n\nme on the other hand, went through something very similar last year. had some strong tummy issues that landed me in the ER. i remember that day like it was yesterday because it was the one time i saw my partner truly look scared. she held it together for the most part, but her body language said otherwise. i remember the feeling of death. my body just didn’t want to work anymore. it took awhile for my stomach and digestive track to work well. i also used to have endless injuries. i’m a dancer, so i’d hurt something and it took monthssss to heal. had a shoulder injury for 3 months. then shortly after that a hip injury for like 4 months. my body forgot how to heal itself because i wasn’t eating the way i’m supposed to. now that i’m recovering, it’s a little wacky but it’s better. i struggled with binging/restricting cycles for at least 5yrs.  technically had ARFID as a kid.",
      "created_utc": 1650027733.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i4u2tz9",
      "author": "pabstpumpkinbeer",
      "body": "One of my best friends died at the age of 26. Suicide due in part to her ED. She spent her entire life struggling with mental illness. I am passing milestones without her, seeing all of the life that she missed out on. The good and the bad. The beautiful and the ugly. The movies she'll never see. The places she'll never go. The concerts she'll never experience. \n\nIt breaks my heart every damn day. She didn't bet on herself. She didn't allow herself the possibility of getting better, she couldn't see the way out. But there was a way out, and there was so much beauty on the other side.",
      "created_utc": 1650032730.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i4ukq7c",
      "author": "StepdadLRAD",
      "body": "You used to love food. Read cooking magazines before bed, plan holiday menus, scout new restaurants. Cook, enjoy nourishing people more than anything. You had a hobby that brought you joy. \n\nMy eating disorder took all of this from me. Something I loved. And your ED will take something from you love.",
      "created_utc": 1650040150.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i4vaaex",
      "author": "Spectrachic311311",
      "body": "I’m 40 and have had this shitty illness for 20 years.  I have a permanently messed up digestive system and whenever I eat, I get horrible bloating because my system just doesn’t move.  I have awful scraggly hair that breaks like straw, I am constantly exhausted and I basically sacrificed my whole life for this stupid disease.  Please, you don’t want this. It’s a horrible existence.",
      "created_utc": 1650050571.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i51dybz",
      "author": "LoveThatForYouBebe",
      "body": "So many people have given excellent answers as to the longterm physical and relational effects, so to avoid echoing all of that, I’ll share an anecdote from my life recently.\n\nI’m mid-30s, been dealing with this BS for 2 decades, and am in the middle of a relapse I didn’t realize was happening in 2021 until it was too late to pull myself out. I’ve been trying like hell to follow my team’s plan, but the ED voice is so loud.\n\nAnd not just to me. It effects my husband more than anything, and  that pisses me off. My ED makes me a callous bitch, who has the ability to say extremely hurtful things I never would say in my right mind, and my poor husband always gets the brunt of it. And he is THE most supportive and patient person on the planet. Last night there was a blow up so bad that he broke down crying, saying he felt like he’s living with an abuser, because the ED is running the show. He wasn’t calling me an abuser, but he said when the ED has taken over to this extent, every day feels like he’s living through abuse and gaslighting. I can honestly say I never realize/intend for it to happen, but hearing him say that as he broke down in tears last night absolutely destroyed me and made me want to fight like hell to never make him feel that way again. I may be the worst wife ever, but I’m determined to get back to the version of me he fell in love with years ago. I had an ED, still, but I also had a personality…fun…laughter…hobbies…interests…the ability to care about others or anything in life…a functioning brain…all things my ED steals when it’s running our life. And I say our life, because it’s never only the person with the ED who’s suffering as a result of the ED. Whether it’s an SO, or any other family members or friends, EDs affect EVERYONE around you. It’s not freaking worth it.",
      "created_utc": 1650164784.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i4t9qb9",
      "author": "Puzzleheaded_Ad550",
      "body": "Lost almost all my teeth and I didn't purged or anything. It sucks",
      "created_utc": 1650015283.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i4ww54a",
      "author": "methman_",
      "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
      "created_utc": 1650077716.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i4tpn7s",
      "author": "PurpleNarwhal69",
      "body": "You may think your teeth may be replaceable but it does not come without a huge cost, sense of shame and lot of pain. \n\nI'm 23 years old and every single one of my teeth has a filling, I've had multiple root canals, my gums constantly bleed, I can't sing anymore or talk too loud because my throat is always so sore and I'll start coughing. \n\nThe more work you get done on your teeth actively contributes to the shape of your jaw and face changing and it may not be in a way you want it to, dental work is no fun and even worse when you can't pay for it so have to suffer everyday. Seriously if I could go back in time and warn my younger self what EDs have done to my teeth I genuinely think I would have stopped before it caused any damage.",
      "created_utc": 1650026374.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i4v6sx8",
      "author": "cleonardo96",
      "body": "My grandma has had an eating disorder since highschool at the latest, she truly believes that men need to be overweight and eat everything they could desire, and women decide what to eat depending on what the scale says.\n\nShe put this on her son's (my dad has had heart scares due to weight, and she tried to control his food at 40), resulting in my parents desparatley trying extreme diets constantly because my dad was never taught a healthy attitude about food.\n\n She also pushed it on her granddaughters. I grew up with the scale determining your worth in my grandma's eyes, someone who is supposed to love you. But she can't see past her own ED. Every time we entered the house she would weigh us and make it into a fun game, that would determine what was \"appropriate\" to eat for the closest time we ate. I've struggled with an ed since I was really young and wasn't able to get help because it was encouraged and normal. I'm now 25 and deal with constant relapses and feeling like I'm unworthy of love unless I'm constantly checking my weight and trying to be smaller. \n\nHer attitude at the root of her Ed that everything has to look perfect to outside people has literally lead her to almost kill me before (long story but trust me I'm not being dramatic). She has now been erased from my family tree and she has lost three grandkids, a son, and a daughter in law because of her actions. Eventually she may die alone.\n\nI've had relapses where I legitimately thought I was going to die, because I was shaking and cold and sweating on the floor, my body was so nauseas I was dry heaving but didn't have anything to come up. I couldn't move and my dog looked terrified. But I couldn't get off the floor, I'm glad I live in an area that I could order food for delivery because I couldn't get food myself.\n\nTldr: if you don't at least try to recover your Ed will run your entire life, and possibly fuck up multiple generations after you, lose people you think could never leave, and possibly die alone. \n\nThese are the things that help me to keep trying to recover, I hope it helps. It's hard but worth it",
      "created_utc": 1650049102.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i4wglcw",
      "author": "SammyJammers",
      "body": "there's a life out there for me full of love and joy and experiences. there's a version of me that's in line with my values, and going through the full human experience. every moment i spend in this illness is a moment lost from that life i could have.",
      "created_utc": 1650069999.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i4vx0b0",
      "author": "Errinaya12",
      "body": "I have the worst acid reflux from making myself throw up for so many years. That shit can be so painful sometimes that nothing helps. It feels like a hot iron in your throat. I also have gastrointestinal issues so I get nauseous a lot. I'm lucky as fuck that nothing has happened to my teeth.",
      "created_utc": 1650060671.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4wodwa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1650073803.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4xcz29",
      "author": "None",
      "body": "the scariest part is easily your impact on every. single. person around you. Even if you don't realise it and die before you do, and even if you think you're hiding it really well and being incredibly stealth it won't matter. I had no idea of my mother's disordered eating habits, and of my Aunt's bulimia (which she never received treatment for) and despite that, it impacted me. By continuing to indulge in your eating disorder you're continuing to harm the people around you, regardless of whether or not you live to see the damage. And tbh I think that's the scariest part, because EDs will turn you into the most selfish, vile, self-centred person possible if you don't attempt to fight back, and, in doing so, they will reach out to the ones you love and to the ones who love you and ensure they leave their mark.",
      "created_utc": 1650087572.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i4tvgyz",
      "author": "hellokittycrackpipe",
      "body": "I messed up my kidney something fierce and ended up with a kidney stone the size of a thumb.",
      "created_utc": 1650029355.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4ukb03",
      "author": "pastelxbones",
      "body": "i'm 21 and it's finally catching up to me. granted, my symptoms are also the result of chronic anxiety but i deal with chronic pain and fatigue. everyday i wake up nauseous and in pain and it's hard to function. it will catch up to you, it's only a matter of time. and the longer you do it the worse your outcome will be.",
      "created_utc": 1650039982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4w8oen",
      "author": "mokkkko",
      "body": "Fucked up my organs before i reached 20 and now i have to swallow heavy meds + see many docs per year so i can eat something…",
      "created_utc": 1650066156.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4x0qpl",
      "author": "alliebbb",
      "body": "Saving this post for hard days. Thank you OP <3",
      "created_utc": 1650080176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4xb9fk",
      "author": "loss-prevention",
      "body": "Please read that article about the 19 year old bulimic girl who’s stomach exploded and she died purging with her face in the toilet. TRIGGER WARNING the article includes very graphic pictures",
      "created_utc": 1650086408.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i4w571p",
      "author": "verystupidandsad",
      "body": "i just had to withdraw from school to go to residential. also, i haven’t shit in almost two weeks, besides the incredible amounts of liquid diarrhea in the past few days from a cocktail of laxatives (but i am still bloated). a few nights ago i was in so much pain from the gas/bloating that i thought i was gonna die and strongly considered going to the ER.",
      "created_utc": 1650064510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuyaa2a",
      "author": "yooniev",
      "body": "im 19. i’ve been dealing with a severe eating disorder since around 15. while living with my parents, they would monitor me and i lived in a quasi recovery state. when i got to university and started living on my own, i started spiraling really badly because no one was holding me accountable. i’ve always had a strong immune system. it helped that my dad is also a doctor so whenever i got sick he knew how to help me really quickly. but now in university, i am on my own. with my eating disorder, my immune system absolutely broke down and i got the flu. it was really awful from the get go. i was taking forever to get better. \n\nit takes 7 minutes tops to walk from my one of my lectures to my dorm. i remember feeling like i was going to die just trying to get back to my dormitory one day. i felt it so viscerally that i called a friend— just in case i passed out at least someone would know. \n\nall i remember thinking was, “if i die who’s going to take care of my dog?” \n\nthe fear of how i felt like i couldn’t even help myself in that moment. i felt very powerless. i felt like i was facing death in the face. the fear of dying alone on a stupid fucking university sidewalk. the fear of leaving my dog behind. my mom tells me that my dog still likes to curl up in my room at home and just wait for me to come home. how can i die here and leave him waiting? :(",
      "created_utc": 1710480542.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4sd1hx",
      "author": "160306",
      "body": "not the best advicer as i am in a relapse but i managed to get so bad in a few months that my heart took serious damage and any tiny relapse could get me to the surgeon",
      "created_utc": 1716152928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l76uj90",
      "author": "NoAdhesiveness9621",
      "body": "You don't want this. I'm so bad from anorexia I'm on liquid diet for 3 years. My hair is thin. I'm ways in bruises. I'm going through recovery and I'm a mess. I cry everyday.  My teeth are a mess",
      "created_utc": 1717575723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lx1lymx",
      "author": "ThinIceButterfly",
      "body": "The worst part for me are the countless times I’ve fainting or pissed myself. Can you imagine standing at a family gathering or in the middle of target and you just piss yourself. And you can’t stop it, and you can’t do anything about it. What about fainting at your boyfriend’s birthday party as the cut the cake and sing happy birthday? Fainting in front of family, friends, children. It’s humiliating. My breaking point was when I had my 3rd seizure. I had had one in the shower and one in my boyfriend’s bed, but my third one was at work in front of children. On top of that I hit and gashed my head open on the way down. By the time I was awake and awake the kids were gone but from what I was told they were pretty much completely traumatized. It’s not worth it for you, but also not worth it for everyone in your life.",
      "created_utc": 1731562036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4u733i",
      "author": "Historical-grey-cat",
      "body": "👻👻👻 (plz don't be too scared by this, just scared enough)",
      "created_utc": 1650034537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i4tup20",
      "author": "damnoceanyouscary",
      "body": "I watched this happen to my grandmother, a lifelong anorexic and alcoholic. My earliest memories of her (at mealtime) include my grandfather begging her to just eat a salad at the least while she tottered over to her liter jug of white wine, lit cig in hand - emaciated, of course. Her health went into a sharp spiral, but the doctors kept telling her, if she could just eat something and drink a little less, the decline might slow down, but she didn’t listen. She’s now in her late 80s, and after a decade-long bout with Alzheimer’s that traumatized everybody around her, had a stroke, but horribly, didn’t die. She’s been comatose for several years now, in this terrible limbo. \n\nUnsurprisingly, my mother has also been anorexic for most of her life. I was basically brought up to have an eating disorder, each pound gained was scrutinized. My cousin and I had an unspoken competition to be the thinnest, to eat the least. Interestingly, we both developed severe bulimia, which was, of course, disgusting to the “disciplined” anorexic mothers. Thankfully, my younger sister escaped with only moderately disordered eating habits. Can’t say the same for myself.\n\nAnyway, my point is - do all you can to break the cycle. I’ve promised myself I won’t have children until I’m recovered enough to raise them with a healthy relationship to food.",
      "created_utc": 1650028969.0,
      "score": 72,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        }
      ]
    },
    {
      "id": "i4tdk9k",
      "author": "Egg_Tomato",
      "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
      "created_utc": 1650018449.0,
      "score": 60,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        }
      ]
    },
    {
      "id": "i4t8gdu",
      "author": "simbalucky21",
      "body": "god this is awful",
      "created_utc": 1650014176.0,
      "score": 23,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        }
      ]
    },
    {
      "id": "i4tbqaa",
      "author": "simbalucky21",
      "body": "oh my god",
      "created_utc": 1650016970.0,
      "score": 29,
      "context": [
        {
          "id": "i4t8cy0",
          "author": "sunglasses619",
          "body": "I was a peer counselor for a girl with anorexia when I was in college. She had been forced to abandon her own degree and craft business at the same college years earlier due to her ED. She was 26 and her reproductive system had shut down. She had lost all her friends and never been in a relationship. Her only relationships were with her family, which was strained due to the toll the ED took on everyone, her doctor, her dietician, her therapist, and me. All she did was go to the gym, go to appointments, go grocery shopping, and spend time alone in the apartment she shared with family - constantly fighting with them when they were together.\n\nI tried to be supportive but she said 'You're young and you don't realize how hard it is to pull yourself out once you've let it get this far.'\n\nShe wrote beautiful poems and journal entries about a recovery she had no idea how to actually access. She was extremely talented and caring but no one saw it.\n\nI looked her up recently and she had passed away of a heart attack before turning 30. She had spent the last years of her life in and out of treatment, seen only by medical staff and her distraught family. And that was it.\n\nI can't explain how I felt after seeing that. It's such a lonely, painful life with such a sad end.",
          "created_utc": 1650014090.0
        }
      ]
    },
    {
      "id": "i4tk7f1",
      "author": "unsaintedheretic",
      "body": "Oh my god I hope you were able to deal with all of that in a productive way <3\n\nIt's unfortunate how ED's manage to warp your sense and robs you of basically everything.",
      "created_utc": 1650023174.0,
      "score": 17,
      "context": [
        {
          "id": "i4t8cy0",
          "author": "sunglasses619",
          "body": "I was a peer counselor for a girl with anorexia when I was in college. She had been forced to abandon her own degree and craft business at the same college years earlier due to her ED. She was 26 and her reproductive system had shut down. She had lost all her friends and never been in a relationship. Her only relationships were with her family, which was strained due to the toll the ED took on everyone, her doctor, her dietician, her therapist, and me. All she did was go to the gym, go to appointments, go grocery shopping, and spend time alone in the apartment she shared with family - constantly fighting with them when they were together.\n\nI tried to be supportive but she said 'You're young and you don't realize how hard it is to pull yourself out once you've let it get this far.'\n\nShe wrote beautiful poems and journal entries about a recovery she had no idea how to actually access. She was extremely talented and caring but no one saw it.\n\nI looked her up recently and she had passed away of a heart attack before turning 30. She had spent the last years of her life in and out of treatment, seen only by medical staff and her distraught family. And that was it.\n\nI can't explain how I felt after seeing that. It's such a lonely, painful life with such a sad end.",
          "created_utc": 1650014090.0
        }
      ]
    },
    {
      "id": "jy955md",
      "author": "Miserable_Thought933",
      "body": "That is so sad I've been diagnosed with anorexia 3 years now and I keep  thinking am never going to be able to have my favourite food again I hate what this disease has done to me I've made myself isolated from everyone every single minute of the day I dream of food but can't bring myself to eat it 😪",
      "created_utc": 1693328401.0,
      "score": 1,
      "context": [
        {
          "id": "i4t8cy0",
          "author": "sunglasses619",
          "body": "I was a peer counselor for a girl with anorexia when I was in college. She had been forced to abandon her own degree and craft business at the same college years earlier due to her ED. She was 26 and her reproductive system had shut down. She had lost all her friends and never been in a relationship. Her only relationships were with her family, which was strained due to the toll the ED took on everyone, her doctor, her dietician, her therapist, and me. All she did was go to the gym, go to appointments, go grocery shopping, and spend time alone in the apartment she shared with family - constantly fighting with them when they were together.\n\nI tried to be supportive but she said 'You're young and you don't realize how hard it is to pull yourself out once you've let it get this far.'\n\nShe wrote beautiful poems and journal entries about a recovery she had no idea how to actually access. She was extremely talented and caring but no one saw it.\n\nI looked her up recently and she had passed away of a heart attack before turning 30. She had spent the last years of her life in and out of treatment, seen only by medical staff and her distraught family. And that was it.\n\nI can't explain how I felt after seeing that. It's such a lonely, painful life with such a sad end.",
          "created_utc": 1650014090.0
        }
      ]
    },
    {
      "id": "i4uv4nw",
      "author": "smokeandmirrorsff",
      "body": "From what specifically ? I chew and spit up to 10 times a day and it’s taking a huge toll on my teeth too",
      "created_utc": 1650044310.0,
      "score": 11,
      "context": [
        {
          "id": "i4sv5ez",
          "author": "TerrifyinglyAlive",
          "body": "Last year I was at the dentist 8 times.  That’s once every 6 weeks.  Most of my teeth are fake already and the rest of them are in rough shape. I’m at serious risk of my lower jaw bone deteriorating now.",
          "created_utc": 1650003213.0
        }
      ]
    },
    {
      "id": "i4tbqpa",
      "author": "simbalucky21",
      "body": "crying",
      "created_utc": 1650016979.0,
      "score": 19,
      "context": [
        {
          "id": "i4t7u0o",
          "author": "Notreallysurebutidc",
          "body": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.",
          "created_utc": 1650013632.0
        }
      ]
    },
    {
      "id": "i4trw46",
      "author": "simbalucky21",
      "body": "thank you so much",
      "created_utc": 1650027556.0,
      "score": 6,
      "context": [
        {
          "id": "i4tf2s9",
          "author": "BluePurslane",
          "body": "Not sure how old you are.  But recall a number of years back there was the \"It Gets Better\" movement for LGBT youth?  There should be a parallel movement for people with EDs.  The \"It Gets Worse\" project.\n\nLiterally everything gets worse, the longer you go.  I was on the road to alienating my husband, children, parents, and friends with my bizarre behavior and extreme paranoia.  I wasn't emotionally present for my children, and it's only by the grace of God that I recovered while they were young enough, because if they remembered me like that in their older years I'm sure I'd never have an adult relationship with them.\n\nPhysically it gets worse too.  Teeth, bladders, constant earaches, weak bones, nerve pain, hair sucks, no sex drive.  You'll waste your youth on this stuff and if you survive you'll wake up middle aged and if you recover you'll know you spent your youth feeling like death for literally nothing, NOTHING at all.  And I wasted all that time, only to recover to the same weight that I was right before I started.  There was nothing to show for it but physical agony, a terrible personality, and damaged relationships. \n\nIf you want to have children (or do have children) you will either 1) not be able to or 2) alienate them with your horrible behavior and anger.  If you want (or have) a romantic relationship, you will eventually alienate that person too.  You will end up alone and isolated as friendships as all your thoughts and actions serve your ED.  You will be so, so selfish.\n\nEverything will feel hard, all of the time.  You will always be exhausted.\n\nNow that I recovered literally all of that is gone, all of it.  I still have a few chipped teeth but that's it.  It took a while, but I feel physically 100% better.  My relationships with my children are normal and I even had more.  My marriage is great.  I do wonder if the damage I've done to my relationship with my parents can ever be fully healed though, and I really regret that.\n\nDon't let it take another day from your life.",
          "created_utc": 1650019622.0
        }
      ]
    },
    {
      "id": "i4to1z1",
      "author": "mandanic",
      "body": "This hit me, thank you 🙏 I’m so happy you escaped the cycle.",
      "created_utc": 1650025493.0,
      "score": 4,
      "context": [
        {
          "id": "i4tf2s9",
          "author": "BluePurslane",
          "body": "Not sure how old you are.  But recall a number of years back there was the \"It Gets Better\" movement for LGBT youth?  There should be a parallel movement for people with EDs.  The \"It Gets Worse\" project.\n\nLiterally everything gets worse, the longer you go.  I was on the road to alienating my husband, children, parents, and friends with my bizarre behavior and extreme paranoia.  I wasn't emotionally present for my children, and it's only by the grace of God that I recovered while they were young enough, because if they remembered me like that in their older years I'm sure I'd never have an adult relationship with them.\n\nPhysically it gets worse too.  Teeth, bladders, constant earaches, weak bones, nerve pain, hair sucks, no sex drive.  You'll waste your youth on this stuff and if you survive you'll wake up middle aged and if you recover you'll know you spent your youth feeling like death for literally nothing, NOTHING at all.  And I wasted all that time, only to recover to the same weight that I was right before I started.  There was nothing to show for it but physical agony, a terrible personality, and damaged relationships. \n\nIf you want to have children (or do have children) you will either 1) not be able to or 2) alienate them with your horrible behavior and anger.  If you want (or have) a romantic relationship, you will eventually alienate that person too.  You will end up alone and isolated as friendships as all your thoughts and actions serve your ED.  You will be so, so selfish.\n\nEverything will feel hard, all of the time.  You will always be exhausted.\n\nNow that I recovered literally all of that is gone, all of it.  I still have a few chipped teeth but that's it.  It took a while, but I feel physically 100% better.  My relationships with my children are normal and I even had more.  My marriage is great.  I do wonder if the damage I've done to my relationship with my parents can ever be fully healed though, and I really regret that.\n\nDon't let it take another day from your life.",
          "created_utc": 1650019622.0
        }
      ]
    },
    {
      "id": "lpdtqy9",
      "author": "Extreme-Sentence-543",
      "body": "I'm 20 y/o and suffering. Idk how to escape this illness.",
      "created_utc": 1727551495.0,
      "score": 1,
      "context": [
        {
          "id": "i4tf2s9",
          "author": "BluePurslane",
          "body": "Not sure how old you are.  But recall a number of years back there was the \"It Gets Better\" movement for LGBT youth?  There should be a parallel movement for people with EDs.  The \"It Gets Worse\" project.\n\nLiterally everything gets worse, the longer you go.  I was on the road to alienating my husband, children, parents, and friends with my bizarre behavior and extreme paranoia.  I wasn't emotionally present for my children, and it's only by the grace of God that I recovered while they were young enough, because if they remembered me like that in their older years I'm sure I'd never have an adult relationship with them.\n\nPhysically it gets worse too.  Teeth, bladders, constant earaches, weak bones, nerve pain, hair sucks, no sex drive.  You'll waste your youth on this stuff and if you survive you'll wake up middle aged and if you recover you'll know you spent your youth feeling like death for literally nothing, NOTHING at all.  And I wasted all that time, only to recover to the same weight that I was right before I started.  There was nothing to show for it but physical agony, a terrible personality, and damaged relationships. \n\nIf you want to have children (or do have children) you will either 1) not be able to or 2) alienate them with your horrible behavior and anger.  If you want (or have) a romantic relationship, you will eventually alienate that person too.  You will end up alone and isolated as friendships as all your thoughts and actions serve your ED.  You will be so, so selfish.\n\nEverything will feel hard, all of the time.  You will always be exhausted.\n\nNow that I recovered literally all of that is gone, all of it.  I still have a few chipped teeth but that's it.  It took a while, but I feel physically 100% better.  My relationships with my children are normal and I even had more.  My marriage is great.  I do wonder if the damage I've done to my relationship with my parents can ever be fully healed though, and I really regret that.\n\nDon't let it take another day from your life.",
          "created_utc": 1650019622.0
        }
      ]
    },
    {
      "id": "m0b7m1c",
      "author": "Oboing",
      "body": "Just reading through some ED support threads and this hit me very hard as I am in a similar situation but can’t get myself to recover.",
      "created_utc": 1733281779.0,
      "score": 1,
      "context": [
        {
          "id": "i4tf2s9",
          "author": "BluePurslane",
          "body": "Not sure how old you are.  But recall a number of years back there was the \"It Gets Better\" movement for LGBT youth?  There should be a parallel movement for people with EDs.  The \"It Gets Worse\" project.\n\nLiterally everything gets worse, the longer you go.  I was on the road to alienating my husband, children, parents, and friends with my bizarre behavior and extreme paranoia.  I wasn't emotionally present for my children, and it's only by the grace of God that I recovered while they were young enough, because if they remembered me like that in their older years I'm sure I'd never have an adult relationship with them.\n\nPhysically it gets worse too.  Teeth, bladders, constant earaches, weak bones, nerve pain, hair sucks, no sex drive.  You'll waste your youth on this stuff and if you survive you'll wake up middle aged and if you recover you'll know you spent your youth feeling like death for literally nothing, NOTHING at all.  And I wasted all that time, only to recover to the same weight that I was right before I started.  There was nothing to show for it but physical agony, a terrible personality, and damaged relationships. \n\nIf you want to have children (or do have children) you will either 1) not be able to or 2) alienate them with your horrible behavior and anger.  If you want (or have) a romantic relationship, you will eventually alienate that person too.  You will end up alone and isolated as friendships as all your thoughts and actions serve your ED.  You will be so, so selfish.\n\nEverything will feel hard, all of the time.  You will always be exhausted.\n\nNow that I recovered literally all of that is gone, all of it.  I still have a few chipped teeth but that's it.  It took a while, but I feel physically 100% better.  My relationships with my children are normal and I even had more.  My marriage is great.  I do wonder if the damage I've done to my relationship with my parents can ever be fully healed though, and I really regret that.\n\nDon't let it take another day from your life.",
          "created_utc": 1650019622.0
        }
      ]
    },
    {
      "id": "i4uyizk",
      "author": "flyingcat_hysteria",
      "body": "I never thought my teeth would be fucked either. I had perfect teeth, never needed braces. It took years before I even got a cavity from purging and then it rapidly went down hill. Now I'm missing multiple teeth and my front teeth look horrible. I'm embarrassed to smile or even talk honestly. I can't afford to fix them.",
      "created_utc": 1650045685.0,
      "score": 13,
      "context": [
        {
          "id": "i4sydnc",
          "author": "uhhhhhhhbro",
          "body": "my teeth got so fucked up after purging for so long. like they are fucked. can’t even afford to go to a dentist so just living w them the way they are. absolutely wish I would’ve stopped sooner, I never thought the teeth thing would affect me, they were perfect before. Personally never thought those effects you hear about would happen to me bc I went a LONG time without any but trust, they will sneak up on you and it will absolutely suck. I lost so much hair.",
          "created_utc": 1650005712.0
        }
      ]
    },
    {
      "id": "i4t6rs1",
      "author": "simbalucky21",
      "body": "i am so so sorry love. i’m assuming this is bulimia? i apologies is this is triggering but how far into your ed were you when this happened?",
      "created_utc": 1650012708.0,
      "score": 14,
      "context": [
        {
          "id": "i4t6jnk",
          "author": "ZtoA_Limited",
          "body": "Well in addition to my teeth being shit (there’s a giant hole behind one of my front teeth, it’s turning grey and it sucks), and my hair thinning rapidly, I have started to have seizures and cannot drive. I pissed the bed twice during nightly seizures. So I have no autonomy; no freedom. Last week I passed out twice in a day and my blood pressure and electrolyte levels were so low I could have died; spent 4 days in a regular hospital just for them to stabilize me - no visitors except one at a time so I couldn’t see my family. I fucked up our septic tank and had to get it pumped twice in a year’s time; the guys asking why there was so much “grease” was so embarrassing. \n\nPlease don’t waste your life/youth/health/whatever you have going for you to be obsessed with food, feeling constantly embarrassed, cold, and wanting to stop so badly but the behaviors have become so ingrained that you can’t.",
          "created_utc": 1650012516.0
        }
      ]
    },
    {
      "id": "i4wonzh",
      "author": "simbalucky21",
      "body": "this is the one, thank you so much",
      "created_utc": 1650073942.0,
      "score": 7,
      "context": [
        {
          "id": "i4u0798",
          "author": "Skybluewaves",
          "body": "You are going to waste your potential if you continue like this.\n\nYou are going to spend your life obsessing over food 24/7 while everyone else around you is not going to give food a second thought.\n\nYou can never reclaim this lost time, and the more time you spend disordered, the more time you lose. No matter what you do from this point forward, you can’t go back. \n\nYou are going to be hung up on an image of yourself that isn’t real. To body standards and arbitrary rules that ultimately mean nothing, because no one else gives a shit. You are going to hold yourself prisoner to a cycle of thoughts that you don’t have to act on at all. \n\nYou are going be too tired or weak, both mentally and physically, to have meaningful relationships, a fulfilling career, pursue your passions and hobbies, have a social life, successful marriage, house, kids, travel, etc. (if this is all something you want, that is). If you have kids, you’re likely going to pass your disorder onto them, too, whether knowingly or unknowingly. You are going to be sad or angry or irritated all of the time. You are going to struggle to think. You will be a shell, a ghost, of the person you once were. When you look in the mirror, you may see someone smaller, but there will be no light in your eyes. \n\nYou are going to turn down experiences and fun activities and bonding moments all because they involve food. \n\nPlease take a moment to try to step outside of yourself and your perceptions and try to understand how that sounds.\n\nYou are going to watch the world move on without you, because this life waits for no one. You will sit on the sidelines and you will see everyone else around you achieving their dreams and being happy.\n\nAnd you’re going to be counting calories.\n\nYou are going to be trapped in this cycle, a prison of your own making. Never changing. Never moving on. \n\nAnd anyone who’s trying to help you will likely eventually just get tired of it — possibly resentful, bitter, or short-tempered — because they can’t help you if you don’t want to help yourself. When you’re unable to do anything for yourself, you will be dependent on others in every way — physically, financially, mentally, emotionally. But they can’t all light themselves on fire just to keep you warm. And it’s so painful to watch a loved one injure and slowly kill themselves for seemingly no reason at all.\n\nNo one else cares. Why are you destroying your life for this? Why are you spending your limited time on this earth in suffering? Why do you think you deserve so little? \n\nBy not recovering, you are sending a message to yourself and to everyone around you that you don’t care, you don’t want to get better, and you are allowing yourself to get worse and eventually succumb to this disorder. \n\nThere comes a point where you need to value your own life and happiness over this disorder. You need to give more of a shit about yourself than this disorder. (And if you don’t, you need to ask yourself why the hell that is.) You need to say, “Fuck this disorder” because you’re tired of this shit, and you are worth more than this. You are not this. This is not who you are. Life is so much more than this. You are not your disorder and your disorder is not your life.\n\nAt the end of your life you want to look back with minimal regrets. You will regret everything you didn’t do, not what you did. When someone asks you what you’re most proud of, your greatest accomplishments, what you did in life — I sincerely hope each one of us are able to answer with whatever means the most to us individually.  And everything we were able to accomplish because we recovered from our disorders. Not “I counted calories and starved myself.” \n\nNone of this is even accounting for the very real physical effects you will feel and experience throughout your ED. A lot can be healed through recovery, but some can’t. \n\nDo something about all this. Stop throwing your life away.",
          "created_utc": 1650031572.0
        }
      ]
    },
    {
      "id": "i4vonm3",
      "author": "OWENISAGANGSTER",
      "body": "I don't have much to add, but I just want to say that I thoroughly enjoyed reading your comment. I relate a lot, especially the part related to low blood sugar and frequent panic attacks.",
      "created_utc": 1650056862.0,
      "score": 6,
      "context": [
        {
          "id": "i4uqzz4",
          "author": "alenamalina",
          "body": "Bare with me, this is gonna be a long one. Sorry, just have a lot to say...\n\nTo be honest what scared me wasn’t “if ur not recovering ur dying” it was basically “if ur not recovering u have to live like this for the rest of ur life” because i literally did this as a form of passive suicide and i was PISSED that it was taking so slow and turning me into a living corpse, the worst of both worlds. If I didn’t start recovery…\n\n&#x200B;\n\nI’d have to get a pacemaker at age 21 or deal with the heart palpitations, or slowly die. Ironically what scared me about this was inherently disordered, that I'd have to take six weeks off the gym. I have to take off the gym right now regardless, but the marks of the  “titty stickers” from the heart monitor stay four months later and remind me of what happened. I joked about it with my friends and worked out in a sports bra and shorts with the stupid heart monitor tucked into my bra for two weeks and dear god was i terrified of how i looked, like a skeleton with abs, but i still wasn’t “sick enough” or “thin enough” to recover. And yea i joked about being a “robot” with my friends… they didn’t find it funny.\n\nI was actually studying for finals when I got the call to go to the hospital at 10 pm bc my EKG showed my heart rate was 39. I had to drive MYSELF to the hospital… and they make u pay for parking. My friends were busy going out that day because it was a Friday and didn’t answer my texts, my dad did but just thought my heart was just “fit.” I was there all alone, but the hospital let me go bc the anxiety increased my heart rate to 43 and that meant to them that I wasn’t sick enough, so I carried on for the weekend until my cardiologist appointment. What was most scary to me was the IV, that shit HURTS.\n\n&#x200B;\n\nA week later, Christmas Eve, I was smoking weed with my friends and they asked me why I never drank.\n\n“Do you wanna know the truth? I’m afraid of the calories, i don’t like to drink my calories”\n\nMy friend hugged me and started crying, saying “you’re so tiny, oh my god you’re gonna die.”\n\n“no i’m not, i’m fine, i’m recovered i promise”\n\ni sincerely believe this because i stopped weighing my food and only loosely counted calories, despite losing 10 lbs from the start of “recovery.”\n\nI ended that night sleeping in my friends bed. I believe drugs open up what you're hiding from yourself, so of course I had raging anxiety. I measured my heart rate STANDING, 41. I was starving, but too afraid to eat in front of people. I ended up eating a small meal, and no one judged but I was sobbing. I was too scared to sleep alone in the guest bedroom because I thought I would die in my sleep, and no matter how suicidal I was I just thought “i’m not fucking done yet, i’m only 20. i’m not done”\n\nFast forward to my birthday less than two months later. I was almost all in, just learning about what it means and basically binge watching Tabitha Ferrar. I was finally ready to drink alcohol but i was STILL afraid to eat in front of people. So I skipped lunch and a few snacks because I didn’t wanna \"inconvenience\" others by eating. So, I had super low blood sugar and almost passed out in the middle of the street in an unfamiliar city in the dark. My friend left me while waiting for me to get back from the liquor store (for unrelated reasons she had boy troubles and school stuff and wanted to go home) and when she came back, she was just annoyed that yet again I was on the floor hyperventilating and instead walked a block ahead of me. Maybe she was embarrassed or maybe she didn’t care or maybe she was just dealing with her own issues, i don’t know. My arm was numb and I thought I was having a heart attack. I drove her home and it took 40 minutes but in the end my arm was still numb and my face started to become numb too. I went to get food bc I was ravenous, read that if your left arm is numb it's a sign of a stroke or heart attack, and I was too scared drive myself to the hospital again so I fell out of my drivers seat onto the pavement and started begging someone to drive me to the hospital. Of course everyone thought i was drugged because it was a Saturday night on a college campus, but all I could yell in response was “no!! it’s my 21st birthday and i’m completely sober and i think i’m dying!!” Thankfully a group of girls calmed me down and I got home safe.\n\nThen the following weeks i kept having panic attacks. Yes, obviously I have anxiety, but what was the main culprit? For whatever reason, being afraid to eat in front of others or not having access to safe foods. Basically, I was hungry and had low blood sugar. For an entire month before recovery, I was having panic attacks once or twice a day, the longest one lasting twelve hours. I couldn't focus on school and I almost flunked. If I didn't have understanding teachers and the excuse of \"coming back to in person classes during a pandemic,\" I almost certainly would have. Ever since eating consistently, my panic attacks have gone down, and I haven't gotten one in a month since I started eating more often.\n\nWhat really got to me was the fact that the list of safe foods kept getting smaller and smaller and I was too afraid to eat in public. How can you when all you can eat is egg whites, protein power, quest bars, and applesauce?\n\nNow, onto bones. I've been asking for a DXA scan since I lost my period four years ago, but I was never \"underweight enough\" or \"too young\" or \"I was an athlete.\" Anyway, I have osteoporosis in my lumbar spine and osteopenia in my left hip. Okay, creaky bones, who cares right? If you have weak bones, your spine will contract and you're gonna get shorter. If you fall, you're at risk for a stress fracture in your hip and you may become immobile. The thing that got to me most was getting shorter. I'm 5 foot 6, so I'm not that tall nor am I short. But combined with the fact that EDs make you a bitch, and you're gonna get shorter?? You're gonna be a chihuahua?? That's what made me take a break from exercise, deadass. I'd rather scream and cry from the mental anguish lack of exercise gives me than become short and potentially break my spine from squatting 225.\n\nThe break from exercise actually made me realize I have basically no interests outside of food and exercise. I mean, I do, but they've become numb. I'm super interested in history, philosophy, sociology, learning languages, creative makeup, etc. but I find it hard to focus. My memory's improved since recovery and I hope to god I get my photographic memory back, but who knows? I also can't watch TV or youtube videos anymore. My youtube feed was full of food and workout videos, especially the stupid anabolic diet and volume eating and how to become \"shredded.\" Since I've cleaned that out, all I have left is Tabitha Ferrar, and that breaks my heart.\n\nI looked at my schedule I created for the semester, to be super busy all the time to not have time to eat food (the most annoying part of recovery is working around this... but I've figured it out) and how I've filled my time with pointless activities, and accidentally finished a major I despise and kept up a pointless internship and gone through ten pointless jobs just because it keeps me busy. And how I fit in 1-2 hours a day specifically for exercise, skipping club meetings or homework to make a workout. I have one year left of college, and damn do I hope to make the most of it.\n\nNow onto the other side of EDs, the outsider's perspective. One of my friends of ten has an ED, and she's become a total bitch because of it. We had a huge fight at the beginning of the school year, and while some of it wasn't about ED behavior, a lot of it was. And I can't blame her because she's obviously malnourished just like I was, but damn did it turn her into a total fucking bitch. It was over stupid shit that happened four years ago, she even broke up with her girlfriend over a granola bar once. She said my simple presence triggered her, since she knew I had an ED, so I told her to fuck off.\n\nThis is a lot and I apologize but if you read all of this, thank you. Truly, no one gives a shit about your ED, or how \"good\" you are at it, or even your workouts. When I talk about food for too long, my friends always go \"okay can we talk about something else we've been talking about this for way too long.\" There's more to life than this shit. I'm not afraid to die from this illness, I'm afraid to be a living corpse who's obsessed about food and refuses to admit she has a problem.",
          "created_utc": 1650042666.0
        }
      ]
    },
    {
      "id": "i4twgpt",
      "author": "mandanic",
      "body": "I just want a body that works. Fuck. That’s the reality of it isn’t it. What good is a small body if you can’t even live in it? 😫🙏…wishing you all the best.",
      "created_utc": 1650029835.0,
      "score": 16,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        }
      ]
    },
    {
      "id": "k828jlu",
      "author": "None",
      "body": ">Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.\n\nthis got me. thank you so much. im committed now",
      "created_utc": 1699274554.0,
      "score": 5,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        }
      ]
    },
    {
      "id": "i4vrawr",
      "author": "simbalucky21",
      "body": "me too lmao. also the idea of being able to eat baked oats, On my way to them now",
      "created_utc": 1650058045.0,
      "score": 9,
      "context": [
        {
          "id": "i4vqubj",
          "author": "fuffybabie",
          "body": "All of these comments have succeeded in scaring me into making better choices today",
          "created_utc": 1650057838.0
        }
      ]
    },
    {
      "id": "i4wwj10",
      "author": "simbalucky21",
      "body": "stopppp",
      "created_utc": 1650077916.0,
      "score": 3,
      "context": [
        {
          "id": "i4ww54a",
          "author": "methman_",
          "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
          "created_utc": 1650077716.0
        }
      ]
    },
    {
      "id": "i4wbe1o",
      "author": "simbalucky21",
      "body": "god i have that to. it’s so awful and i have like a life time supply of gaviscon in my cupboard lmfao",
      "created_utc": 1650067466.0,
      "score": 3,
      "context": [
        {
          "id": "i4vx0b0",
          "author": "Errinaya12",
          "body": "I have the worst acid reflux from making myself throw up for so many years. That shit can be so painful sometimes that nothing helps. It feels like a hot iron in your throat. I also have gastrointestinal issues so I get nauseous a lot. I'm lucky as fuck that nothing has happened to my teeth.",
          "created_utc": 1650060671.0
        }
      ]
    },
    {
      "id": "i4wwjp2",
      "author": "simbalucky21",
      "body": "yup",
      "created_utc": 1650077925.0,
      "score": 2,
      "context": [
        {
          "id": "i4wodwa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1650073803.0
        }
      ]
    },
    {
      "id": "i4xkwrl",
      "author": "simbalucky21",
      "body": "no problem, wish you well :)",
      "created_utc": 1650093632.0,
      "score": 3,
      "context": [
        {
          "id": "i4x0qpl",
          "author": "alliebbb",
          "body": "Saving this post for hard days. Thank you OP <3",
          "created_utc": 1650080176.0
        }
      ]
    },
    {
      "id": "i4xdhwj",
      "author": "simbalucky21",
      "body": "oh my god that is awful",
      "created_utc": 1650087935.0,
      "score": 1,
      "context": [
        {
          "id": "i4xb9fk",
          "author": "loss-prevention",
          "body": "Please read that article about the 19 year old bulimic girl who’s stomach exploded and she died purging with her face in the toilet. TRIGGER WARNING the article includes very graphic pictures",
          "created_utc": 1650086408.0
        }
      ]
    },
    {
      "id": "l4sd2cm",
      "author": "160306",
      "body": "im so scared of dying rn",
      "created_utc": 1716152937.0,
      "score": 2,
      "context": [
        {
          "id": "l4sd1hx",
          "author": "160306",
          "body": "not the best advicer as i am in a relapse but i managed to get so bad in a few months that my heart took serious damage and any tiny relapse could get me to the surgeon",
          "created_utc": 1716152928.0
        }
      ]
    },
    {
      "id": "i4ww7oz",
      "author": "simbalucky21",
      "body": "i’m so confused 😅",
      "created_utc": 1650077754.0,
      "score": 2,
      "context": [
        {
          "id": "i4u733i",
          "author": "Historical-grey-cat",
          "body": "👻👻👻 (plz don't be too scared by this, just scared enough)",
          "created_utc": 1650034537.0
        }
      ]
    },
    {
      "id": "i4u7zfo",
      "author": "WideAtmosphere",
      "body": "I'm infertile from long term restriction. I'm now in my 40s and aging out of being able to have kids. I don't have any children and I wanted children. It breaks my heart. My one life, and I'll never be someone's mom, someone's grandma. Ever. And it's my own fault. I did this. I can't fix it.",
      "created_utc": 1650034915.0,
      "score": 39,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        }
      ]
    },
    {
      "id": "i4tored",
      "author": "OrderofOddfellows",
      "body": "Truth, I can’t have kids.",
      "created_utc": 1650025890.0,
      "score": 8,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        }
      ]
    },
    {
      "id": "i4u1kxk",
      "author": "sunglasses619",
      "body": "Thanks <3 \n\nI did recover and started a family and a career and was hoping to see that she was in recovery as well. \n\nYou never think - I don't know, she's not the only person I've known who has died from ED complications at a young age, but somehow it seems so overdramatic to think you could die from it, until it happens.\n\nShe was so beautiful, but in the last pictures she was so sick, in a wheelchair with thin hair and bruises and hollow cheeks. We were living in one of the world's biggest and most exciting cities, but anorexia's world is so small. \n\nI wish her story could have gone differently, but sometimes it just goes too far and the support isn't enough and it's tragic.",
      "created_utc": 1650032189.0,
      "score": 25,
      "context": [
        {
          "id": "i4t8cy0",
          "author": "sunglasses619",
          "body": "I was a peer counselor for a girl with anorexia when I was in college. She had been forced to abandon her own degree and craft business at the same college years earlier due to her ED. She was 26 and her reproductive system had shut down. She had lost all her friends and never been in a relationship. Her only relationships were with her family, which was strained due to the toll the ED took on everyone, her doctor, her dietician, her therapist, and me. All she did was go to the gym, go to appointments, go grocery shopping, and spend time alone in the apartment she shared with family - constantly fighting with them when they were together.\n\nI tried to be supportive but she said 'You're young and you don't realize how hard it is to pull yourself out once you've let it get this far.'\n\nShe wrote beautiful poems and journal entries about a recovery she had no idea how to actually access. She was extremely talented and caring but no one saw it.\n\nI looked her up recently and she had passed away of a heart attack before turning 30. She had spent the last years of her life in and out of treatment, seen only by medical staff and her distraught family. And that was it.\n\nI can't explain how I felt after seeing that. It's such a lonely, painful life with such a sad end.",
          "created_utc": 1650014090.0
        },
        {
          "id": "i4tk7f1",
          "author": "unsaintedheretic",
          "body": "Oh my god I hope you were able to deal with all of that in a productive way <3\n\nIt's unfortunate how ED's manage to warp your sense and robs you of basically everything.",
          "created_utc": 1650023174.0
        }
      ]
    },
    {
      "id": "i4uz5qq",
      "author": "TerrifyinglyAlive",
      "body": "Restriction, purging, chew/spit, I've got a history of all of it.  I'm old enough and have been sick long enough that I remember buying ipecac at the pharmacy back when they still sold it.  The dental issues started when I was only purging, and have compounded over the years.",
      "created_utc": 1650045939.0,
      "score": 14,
      "context": [
        {
          "id": "i4sv5ez",
          "author": "TerrifyinglyAlive",
          "body": "Last year I was at the dentist 8 times.  That’s once every 6 weeks.  Most of my teeth are fake already and the rest of them are in rough shape. I’m at serious risk of my lower jaw bone deteriorating now.",
          "created_utc": 1650003213.0
        },
        {
          "id": "i4uv4nw",
          "author": "smokeandmirrorsff",
          "body": "From what specifically ? I chew and spit up to 10 times a day and it’s taking a huge toll on my teeth too",
          "created_utc": 1650044310.0
        }
      ]
    },
    {
      "id": "i4v0zq4",
      "author": "None",
      "body": "The thing about death is no matter how much you think you’re okay with it right now, if/when you’re staring it down, all of that changes. The body is designed to fight. You don’t go peacefully.",
      "created_utc": 1650046699.0,
      "score": 21,
      "context": [
        {
          "id": "i4t7u0o",
          "author": "Notreallysurebutidc",
          "body": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.",
          "created_utc": 1650013632.0
        },
        {
          "id": "i4tbqpa",
          "author": "simbalucky21",
          "body": "crying",
          "created_utc": 1650016979.0
        }
      ]
    },
    {
      "id": "i4uzr8v",
      "author": "uhhhhhhhbro",
      "body": "I had just gotten my braces off after being insecure of my top middle 2 teeth my entire life, they were literally so perfect afterwards. \n\nNow my top 2 middle teeth are fucked again, I feel you, I’m also embarrassed to talk or smile, I’ve never been more thankful for masks lol. I’m sorry you feel the same way though, this disorder really fucks us over",
      "created_utc": 1650046189.0,
      "score": 5,
      "context": [
        {
          "id": "i4sydnc",
          "author": "uhhhhhhhbro",
          "body": "my teeth got so fucked up after purging for so long. like they are fucked. can’t even afford to go to a dentist so just living w them the way they are. absolutely wish I would’ve stopped sooner, I never thought the teeth thing would affect me, they were perfect before. Personally never thought those effects you hear about would happen to me bc I went a LONG time without any but trust, they will sneak up on you and it will absolutely suck. I lost so much hair.",
          "created_utc": 1650005712.0
        },
        {
          "id": "i4uyizk",
          "author": "flyingcat_hysteria",
          "body": "I never thought my teeth would be fucked either. I had perfect teeth, never needed braces. It took years before I even got a cavity from purging and then it rapidly went down hill. Now I'm missing multiple teeth and my front teeth look horrible. I'm embarrassed to smile or even talk honestly. I can't afford to fix them.",
          "created_utc": 1650045685.0
        }
      ]
    },
    {
      "id": "i4tap44",
      "author": "ZtoA_Limited",
      "body": "Thank you so much. I have anorexia b/p subtype, so pretty much bulimia but underweight. I’d had it in my teens but recovered. This time, I’d been pretty much “ok” until about two years in & losing a total of around >!100 pounds, more than half my body weight!< . Then the REALLY serious shit started happening. It started with just feeling weak and tired last spring and just progressed from there to where I could (and still can’t) barely leave the bed. I don’t want to be Zelda from Pet Semetary.",
      "created_utc": 1650016112.0,
      "score": 14,
      "context": [
        {
          "id": "i4t6jnk",
          "author": "ZtoA_Limited",
          "body": "Well in addition to my teeth being shit (there’s a giant hole behind one of my front teeth, it’s turning grey and it sucks), and my hair thinning rapidly, I have started to have seizures and cannot drive. I pissed the bed twice during nightly seizures. So I have no autonomy; no freedom. Last week I passed out twice in a day and my blood pressure and electrolyte levels were so low I could have died; spent 4 days in a regular hospital just for them to stabilize me - no visitors except one at a time so I couldn’t see my family. I fucked up our septic tank and had to get it pumped twice in a year’s time; the guys asking why there was so much “grease” was so embarrassing. \n\nPlease don’t waste your life/youth/health/whatever you have going for you to be obsessed with food, feeling constantly embarrassed, cold, and wanting to stop so badly but the behaviors have become so ingrained that you can’t.",
          "created_utc": 1650012516.0
        },
        {
          "id": "i4t6rs1",
          "author": "simbalucky21",
          "body": "i am so so sorry love. i’m assuming this is bulimia? i apologies is this is triggering but how far into your ed were you when this happened?",
          "created_utc": 1650012708.0
        }
      ]
    },
    {
      "id": "i4u050r",
      "author": "OrderofOddfellows",
      "body": "Thank you so much. We only get one life, so I just try to keep going and to be grateful for everything I do have, even if there are definitely some darker moments now and then. I just hope my story can help make a difference to someone out there. \n\n\nAlso, in addition to years and years of therapy helping to get me into recovery, I also got a puppy. This was maybe the biggest turning point when I was entering into recovery, because I finally cared about something else more than my ED and wanted to stay home more with him rather than spending SO much time at the gym. He’s now 10 and adopting him was one of the best decisions I ever made. 🐶",
      "created_utc": 1650031544.0,
      "score": 7,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        },
        {
          "id": "i4twgpt",
          "author": "mandanic",
          "body": "I just want a body that works. Fuck. That’s the reality of it isn’t it. What good is a small body if you can’t even live in it? 😫🙏…wishing you all the best.",
          "created_utc": 1650029835.0
        }
      ]
    },
    {
      "id": "k83xmca",
      "author": "OrderofOddfellows",
      "body": "I’m glad my story could help ❤️❤️❤️ wishing you the absolute best!",
      "created_utc": 1699298611.0,
      "score": 1,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        },
        {
          "id": "k828jlu",
          "author": "None",
          "body": ">Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.\n\nthis got me. thank you so much. im committed now",
          "created_utc": 1699274554.0
        }
      ]
    },
    {
      "id": "i4wwowq",
      "author": "methman_",
      "body": "recovery is always worth it just imagine enjoying all your favorite foods and never thinking twice about it and being able to live the life you genuinely want",
      "created_utc": 1650078002.0,
      "score": 4,
      "context": [
        {
          "id": "i4ww54a",
          "author": "methman_",
          "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
          "created_utc": 1650077716.0
        },
        {
          "id": "i4wwj10",
          "author": "simbalucky21",
          "body": "stopppp",
          "created_utc": 1650077916.0
        }
      ]
    },
    {
      "id": "i4wwkyr",
      "author": "methman_",
      "body": "not kidding 😁",
      "created_utc": 1650077944.0,
      "score": 1,
      "context": [
        {
          "id": "i4ww54a",
          "author": "methman_",
          "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
          "created_utc": 1650077716.0
        },
        {
          "id": "i4wwj10",
          "author": "simbalucky21",
          "body": "stopppp",
          "created_utc": 1650077916.0
        }
      ]
    },
    {
      "id": "i4we8fe",
      "author": "Errinaya12",
      "body": "I have to take omeprazole every night and avoid red sauce and fries pork skins or I wreck myself. I totally feel you haha",
      "created_utc": 1650068851.0,
      "score": 3,
      "context": [
        {
          "id": "i4vx0b0",
          "author": "Errinaya12",
          "body": "I have the worst acid reflux from making myself throw up for so many years. That shit can be so painful sometimes that nothing helps. It feels like a hot iron in your throat. I also have gastrointestinal issues so I get nauseous a lot. I'm lucky as fuck that nothing has happened to my teeth.",
          "created_utc": 1650060671.0
        },
        {
          "id": "i4wbe1o",
          "author": "simbalucky21",
          "body": "god i have that to. it’s so awful and i have like a life time supply of gaviscon in my cupboard lmfao",
          "created_utc": 1650067466.0
        }
      ]
    },
    {
      "id": "i4x9q6o",
      "author": "Historical-grey-cat",
      "body": "Haha you said scare  you into recovery so I put some ghosts, idk I was high 😅",
      "created_utc": 1650085415.0,
      "score": 6,
      "context": [
        {
          "id": "i4u733i",
          "author": "Historical-grey-cat",
          "body": "👻👻👻 (plz don't be too scared by this, just scared enough)",
          "created_utc": 1650034537.0
        },
        {
          "id": "i4ww7oz",
          "author": "simbalucky21",
          "body": "i’m so confused 😅",
          "created_utc": 1650077754.0
        }
      ]
    },
    {
      "id": "i4v0kse",
      "author": "None",
      "body": "Fuck fuck fuck. I’m 23 and my biggest dream is to have kids.",
      "created_utc": 1650046530.0,
      "score": 13,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        },
        {
          "id": "i4u7zfo",
          "author": "WideAtmosphere",
          "body": "I'm infertile from long term restriction. I'm now in my 40s and aging out of being able to have kids. I don't have any children and I wanted children. It breaks my heart. My one life, and I'll never be someone's mom, someone's grandma. Ever. And it's my own fault. I did this. I can't fix it.",
          "created_utc": 1650034915.0
        }
      ]
    },
    {
      "id": "i4v5qc7",
      "author": "That1weirdperson",
      "body": "You can still adopt",
      "created_utc": 1650048651.0,
      "score": 2,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        },
        {
          "id": "i4u7zfo",
          "author": "WideAtmosphere",
          "body": "I'm infertile from long term restriction. I'm now in my 40s and aging out of being able to have kids. I don't have any children and I wanted children. It breaks my heart. My one life, and I'll never be someone's mom, someone's grandma. Ever. And it's my own fault. I did this. I can't fix it.",
          "created_utc": 1650034915.0
        }
      ]
    },
    {
      "id": "i4v08jn",
      "author": "smokeandmirrorsff",
      "body": "I feel you. I’ve been c/sing for 15 years now, but it’s gotten worse in the last 6 years.",
      "created_utc": 1650046387.0,
      "score": 5,
      "context": [
        {
          "id": "i4sv5ez",
          "author": "TerrifyinglyAlive",
          "body": "Last year I was at the dentist 8 times.  That’s once every 6 weeks.  Most of my teeth are fake already and the rest of them are in rough shape. I’m at serious risk of my lower jaw bone deteriorating now.",
          "created_utc": 1650003213.0
        },
        {
          "id": "i4uv4nw",
          "author": "smokeandmirrorsff",
          "body": "From what specifically ? I chew and spit up to 10 times a day and it’s taking a huge toll on my teeth too",
          "created_utc": 1650044310.0
        },
        {
          "id": "i4uz5qq",
          "author": "TerrifyinglyAlive",
          "body": "Restriction, purging, chew/spit, I've got a history of all of it.  I'm old enough and have been sick long enough that I remember buying ipecac at the pharmacy back when they still sold it.  The dental issues started when I was only purging, and have compounded over the years.",
          "created_utc": 1650045939.0
        }
      ]
    },
    {
      "id": "i4xchlb",
      "author": "None",
      "body": "That is SO TRUE. I’ve been thinking about this a lot. I’ve wanted death deeply due to this disorder…and the moment it almost took me, I’ll never forget, I was thinking to myself “please, no, just let me see again (I had temporarily lost vision), let me live, I won’t do it again”",
      "created_utc": 1650087237.0,
      "score": 6,
      "context": [
        {
          "id": "i4t7u0o",
          "author": "Notreallysurebutidc",
          "body": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.",
          "created_utc": 1650013632.0
        },
        {
          "id": "i4tbqpa",
          "author": "simbalucky21",
          "body": "crying",
          "created_utc": 1650016979.0
        },
        {
          "id": "i4v0zq4",
          "author": "None",
          "body": "The thing about death is no matter how much you think you’re okay with it right now, if/when you’re staring it down, all of that changes. The body is designed to fight. You don’t go peacefully.",
          "created_utc": 1650046699.0
        }
      ]
    },
    {
      "id": "i4tbobp",
      "author": "simbalucky21",
      "body": "i am so proud of you for still going, i can’t even imagine what your going through. thank you for sharing with me :)",
      "created_utc": 1650016926.0,
      "score": 7,
      "context": [
        {
          "id": "i4t6jnk",
          "author": "ZtoA_Limited",
          "body": "Well in addition to my teeth being shit (there’s a giant hole behind one of my front teeth, it’s turning grey and it sucks), and my hair thinning rapidly, I have started to have seizures and cannot drive. I pissed the bed twice during nightly seizures. So I have no autonomy; no freedom. Last week I passed out twice in a day and my blood pressure and electrolyte levels were so low I could have died; spent 4 days in a regular hospital just for them to stabilize me - no visitors except one at a time so I couldn’t see my family. I fucked up our septic tank and had to get it pumped twice in a year’s time; the guys asking why there was so much “grease” was so embarrassing. \n\nPlease don’t waste your life/youth/health/whatever you have going for you to be obsessed with food, feeling constantly embarrassed, cold, and wanting to stop so badly but the behaviors have become so ingrained that you can’t.",
          "created_utc": 1650012516.0
        },
        {
          "id": "i4t6rs1",
          "author": "simbalucky21",
          "body": "i am so so sorry love. i’m assuming this is bulimia? i apologies is this is triggering but how far into your ed were you when this happened?",
          "created_utc": 1650012708.0
        },
        {
          "id": "i4tap44",
          "author": "ZtoA_Limited",
          "body": "Thank you so much. I have anorexia b/p subtype, so pretty much bulimia but underweight. I’d had it in my teens but recovered. This time, I’d been pretty much “ok” until about two years in & losing a total of around >!100 pounds, more than half my body weight!< . Then the REALLY serious shit started happening. It started with just feeling weak and tired last spring and just progressed from there to where I could (and still can’t) barely leave the bed. I don’t want to be Zelda from Pet Semetary.",
          "created_utc": 1650016112.0
        }
      ]
    },
    {
      "id": "i4w1veu",
      "author": "BedroomImpossible124",
      "body": "Adopting  a cat saved me. Marvin likes my husband better than me, but he saved me. Then I got a kitten. Thinking about getting another. Seriously, I didn't care if I died young before I found Marvin. Love and support to all💕",
      "created_utc": 1650062945.0,
      "score": 6,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        },
        {
          "id": "i4twgpt",
          "author": "mandanic",
          "body": "I just want a body that works. Fuck. That’s the reality of it isn’t it. What good is a small body if you can’t even live in it? 😫🙏…wishing you all the best.",
          "created_utc": 1650029835.0
        },
        {
          "id": "i4u050r",
          "author": "OrderofOddfellows",
          "body": "Thank you so much. We only get one life, so I just try to keep going and to be grateful for everything I do have, even if there are definitely some darker moments now and then. I just hope my story can help make a difference to someone out there. \n\n\nAlso, in addition to years and years of therapy helping to get me into recovery, I also got a puppy. This was maybe the biggest turning point when I was entering into recovery, because I finally cared about something else more than my ED and wanted to stay home more with him rather than spending SO much time at the gym. He’s now 10 and adopting him was one of the best decisions I ever made. 🐶",
          "created_utc": 1650031544.0
        }
      ]
    },
    {
      "id": "kbr0v12",
      "author": "None",
      "body": "BTW, update - I am doing v well!!",
      "created_utc": 1701562943.0,
      "score": 3,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        },
        {
          "id": "k828jlu",
          "author": "None",
          "body": ">Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.\n\nthis got me. thank you so much. im committed now",
          "created_utc": 1699274554.0
        },
        {
          "id": "k83xmca",
          "author": "OrderofOddfellows",
          "body": "I’m glad my story could help ❤️❤️❤️ wishing you the absolute best!",
          "created_utc": 1699298611.0
        }
      ]
    },
    {
      "id": "i4wy6y0",
      "author": "simbalucky21",
      "body": "i just started trying today, have reached out to some therapists and have begun saving up for an appointment :)",
      "created_utc": 1650078801.0,
      "score": 4,
      "context": [
        {
          "id": "i4ww54a",
          "author": "methman_",
          "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
          "created_utc": 1650077716.0
        },
        {
          "id": "i4wwj10",
          "author": "simbalucky21",
          "body": "stopppp",
          "created_utc": 1650077916.0
        },
        {
          "id": "i4wwowq",
          "author": "methman_",
          "body": "recovery is always worth it just imagine enjoying all your favorite foods and never thinking twice about it and being able to live the life you genuinely want",
          "created_utc": 1650078002.0
        }
      ]
    },
    {
      "id": "i4xbary",
      "author": "simbalucky21",
      "body": "HAHAHHAHA - SORRY EVERYONE DOWNVOTED U LMAO",
      "created_utc": 1650086432.0,
      "score": 1,
      "context": [
        {
          "id": "i4u733i",
          "author": "Historical-grey-cat",
          "body": "👻👻👻 (plz don't be too scared by this, just scared enough)",
          "created_utc": 1650034537.0
        },
        {
          "id": "i4ww7oz",
          "author": "simbalucky21",
          "body": "i’m so confused 😅",
          "created_utc": 1650077754.0
        },
        {
          "id": "i4x9q6o",
          "author": "Historical-grey-cat",
          "body": "Haha you said scare  you into recovery so I put some ghosts, idk I was high 😅",
          "created_utc": 1650085415.0
        }
      ]
    },
    {
      "id": "i4v2xov",
      "author": "WideAtmosphere",
      "body": "You really can destroy your fertility. Take heed.",
      "created_utc": 1650047492.0,
      "score": 10,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        },
        {
          "id": "i4u7zfo",
          "author": "WideAtmosphere",
          "body": "I'm infertile from long term restriction. I'm now in my 40s and aging out of being able to have kids. I don't have any children and I wanted children. It breaks my heart. My one life, and I'll never be someone's mom, someone's grandma. Ever. And it's my own fault. I did this. I can't fix it.",
          "created_utc": 1650034915.0
        },
        {
          "id": "i4v0kse",
          "author": "None",
          "body": "Fuck fuck fuck. I’m 23 and my biggest dream is to have kids.",
          "created_utc": 1650046530.0
        }
      ]
    },
    {
      "id": "i4y754v",
      "author": "Elizabitch4848",
      "body": "I really hate it when people say this. It takes years and tens of thousands of dollars to adopt. It’s not like going to the SPCA.",
      "created_utc": 1650111690.0,
      "score": 11,
      "context": [
        {
          "id": "i4suvr4",
          "author": "6odh1",
          "body": "It’s the birthday of your grandchild and you’re scraping the icing off a small slice of cake. The chattering of family around you, your partner, children and grandchildren, is nothing but irritating noise to your starved brain. You stare at them, not with a full heart, but with an empty stomach as you analyse the food on their plates. Nothing changes if you don’t change.",
          "created_utc": 1650003006.0
        },
        {
          "id": "i4tdk9k",
          "author": "Egg_Tomato",
          "body": "That is, if you are even able to have grandkids… what eds do to your reproductive system can sometimes be irreversible 😭 so it’d be like: it’s the birthday of your IMAGINARY grandchild (assuming you live that long)",
          "created_utc": 1650018449.0
        },
        {
          "id": "i4u7zfo",
          "author": "WideAtmosphere",
          "body": "I'm infertile from long term restriction. I'm now in my 40s and aging out of being able to have kids. I don't have any children and I wanted children. It breaks my heart. My one life, and I'll never be someone's mom, someone's grandma. Ever. And it's my own fault. I did this. I can't fix it.",
          "created_utc": 1650034915.0
        },
        {
          "id": "i4v5qc7",
          "author": "That1weirdperson",
          "body": "You can still adopt",
          "created_utc": 1650048651.0
        }
      ]
    },
    {
      "id": "i4xop5d",
      "author": "None",
      "body": "We’re not meant to want to die. We’re meant to fight tooth and nail to live. That programming doesn’t shut off. I hope so much you’re in a better place now.",
      "created_utc": 1650096816.0,
      "score": 3,
      "context": [
        {
          "id": "i4t7u0o",
          "author": "Notreallysurebutidc",
          "body": "You’ll die if you don’t recover. Not the peaceful dying in your sleep type of death. Type of death that would make you wish you recovered before this moment.",
          "created_utc": 1650013632.0
        },
        {
          "id": "i4tbqpa",
          "author": "simbalucky21",
          "body": "crying",
          "created_utc": 1650016979.0
        },
        {
          "id": "i4v0zq4",
          "author": "None",
          "body": "The thing about death is no matter how much you think you’re okay with it right now, if/when you’re staring it down, all of that changes. The body is designed to fight. You don’t go peacefully.",
          "created_utc": 1650046699.0
        },
        {
          "id": "i4xchlb",
          "author": "None",
          "body": "That is SO TRUE. I’ve been thinking about this a lot. I’ve wanted death deeply due to this disorder…and the moment it almost took me, I’ll never forget, I was thinking to myself “please, no, just let me see again (I had temporarily lost vision), let me live, I won’t do it again”",
          "created_utc": 1650087237.0
        }
      ]
    },
    {
      "id": "kbr4j1p",
      "author": "OrderofOddfellows",
      "body": "I’m so happy for you! You deserve it!!",
      "created_utc": 1701564514.0,
      "score": 2,
      "context": [
        {
          "id": "i4topd5",
          "author": "OrderofOddfellows",
          "body": "I was anorexic and bulimic in my 20s and worked hard with a therapist to get into recovery before I hit 30. I had also abused laxatives and diet pills. I’m now 35 in stage 3/4 kidney disease and will need a transplant/dialysis someday. My kidneys function at about 32% right now and that makes me TIRED like I’ve never been. I never have enough energy to do more than the bare minimum. Every so often I need iron infusions for anemia and they make me horribly sick afterwards. My kidneys also aren’t strong enough to support a pregnancy, so I can’t carry a child and my husband and I’s only real choice for starting a family is adoption. I also have severe GERD and Barrett’s esophagus (higher chance of esophageal cancer) and I had precancerous polyps removed from my stomach last year. Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.",
          "created_utc": 1650025859.0
        },
        {
          "id": "k828jlu",
          "author": "None",
          "body": ">Instead of a super tiny body, I’d give anything for one that works. It wasn’t worth it.\n\nthis got me. thank you so much. im committed now",
          "created_utc": 1699274554.0
        },
        {
          "id": "k83xmca",
          "author": "OrderofOddfellows",
          "body": "I’m glad my story could help ❤️❤️❤️ wishing you the absolute best!",
          "created_utc": 1699298611.0
        },
        {
          "id": "kbr0v12",
          "author": "None",
          "body": "BTW, update - I am doing v well!!",
          "created_utc": 1701562943.0
        }
      ]
    },
    {
      "id": "i50rdkh",
      "author": "methman_",
      "body": "thats amazing do you have insurance at all?",
      "created_utc": 1650153651.0,
      "score": 1,
      "context": [
        {
          "id": "i4ww54a",
          "author": "methman_",
          "body": "idk if you have pets but cats and dogs, if they see you not eating they will stop too and eventually also starve",
          "created_utc": 1650077716.0
        },
        {
          "id": "i4wwj10",
          "author": "simbalucky21",
          "body": "stopppp",
          "created_utc": 1650077916.0
        },
        {
          "id": "i4wwowq",
          "author": "methman_",
          "body": "recovery is always worth it just imagine enjoying all your favorite foods and never thinking twice about it and being able to live the life you genuinely want",
          "created_utc": 1650078002.0
        },
        {
          "id": "i4wy6y0",
          "author": "simbalucky21",
          "body": "i just started trying today, have reached out to some therapists and have begun saving up for an appointment :)",
          "created_utc": 1650078801.0
        }
      ]
    }
  ]
}