{
  "id": "ua4yvp",
  "subreddit": "fuckeatingdisorders",
  "author": "Sareeee48",
  "created_utc": 1650718937.0,
  "title": "Does anyone else find the Intuitive Eating sub kind of… toxic?",
  "selftext": "I don’t go on there often, but when a post pops up on my timeline, it’s always a post filled with comments saying “you’ll naturally want the things that will make you feel better/you will naturally crave more vegetables/I don’t even crave sugar anymore, yay!,” and I feel like that’s just a roundabout way of giving moral value to food and thus perpetuating the concept that some foods are better than others, that if you want to be healthy, you should always choose the “healthier” option.\n\nI understand the concept of gentle nutrition. But what annoys me is that the sub kinda makes it “mandatory,” and it gives me major restriction vibes. Gentle nutrition should be about what you can *add*. Unless you have allergies, intolerances, GI issues exacerbated by certain foods, or food you just plain do not like the taste of, there is no reason to replace or remove them. And it should be centered around foods you enjoy. Like, if you want a greasy burger but you also want to get some vegetables in, why can’t you order the burger *and* a salad together?\n\nIdk, maybe this is just me, but I just feel like that community forgets that intuitive eating is multifaceted, or they just choose to ignore it. Like a lot of it is rooted in diet culture and that’s why a lot of ED sufferers frequent that sub, imo.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ua4yvp/does_anyone_else_find_the_intuitive_eating_sub/",
  "score": 145,
  "num_comments": 51,
  "comments": [
    {
      "id": "i5vlo7k",
      "author": "BeastieBeck",
      "body": "I think of that sub as kind of triggering/annoying, yes. There is more than one reason but I can relate to the \"Yeah, I'm so glad I almost never crave XYZ anymore!!\"",
      "created_utc": 1650721807.0,
      "score": 52,
      "context": []
    },
    {
      "id": "i5w3v4e",
      "author": "None",
      "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
      "created_utc": 1650730089.0,
      "score": 29,
      "context": []
    },
    {
      "id": "i5vrdc2",
      "author": "None",
      "body": "Agree! The intuitive eating thing is kinda sus in my opinion anyway. If you're eating by intuition and not obsessing over food then why are you so excited to be craving salad and not sugar? Aren't you supposed to not care or think about it? And isn't food supposed to NOT have a moral value? Then how come nobody is going \"YAYY, my body craved two bags of Blue Heat Takis and I'm sooo glad I honored my body!\" Idk it still seems like a diet plan to me.",
      "created_utc": 1650724527.0,
      "score": 26,
      "context": []
    },
    {
      "id": "i5vqzyv",
      "author": "momunist",
      "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
      "created_utc": 1650724355.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i5w2d8v",
      "author": "salvbitch",
      "body": "Idk they usually talk about how to add vegetables in by roasting them with olive oil and cheese or stuff like that rather than talking about removing things from what I’ve seen. Most of what annoys me there is people saying you shouldn’t eat things that give you GI trouble, which in my case is everything",
      "created_utc": 1650729443.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i5w4iqx",
      "author": "messythelioma",
      "body": "It's when they encourage you to think about whatever it is you want to eat. To me, if you want to eat it, you should eat it. You shouldn't have to sit for 5, 10, 15 seconds thinking about whether or not \"you can\" eat it only to ultimately feel guilt/shame so you end up not having it regardless of how much you actually crave it.",
      "created_utc": 1650730383.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i5we587",
      "author": "thingsivegottenridof",
      "body": "I think it just goes to show how desperate everyone is to be normal, straight-sized, hot, attractive, idk it’s endless. I listened to an interview with one of the women who wrote the IE book and she said something along the lines of, “You can give people the best nutritional advice in the world and they’ll find a way to turn it into a diet.” I don’t think IE is bad, but I think our cultural fears of fatness are _so intense_ that a more anarchistic _fuck it_ approach is necessary to get better for us with EDs, even for us as a society.\n\nMy own interpretation of gentle nutrition is meal prep/having snacks so I have enough food in the house for when I don’t feel like cooking a solo meal (which is pretty often). That, and being additive to my food choices when possible, like you’ve said. I think a lot of people overthink it.",
      "created_utc": 1650734600.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i5wf6ib",
      "author": "Merlyn67420",
      "body": "I also think a lot of people there are still in recovery or early stages. They’re figuring it out and so they’re seeking that positive feedback to their fears of, say, “I’m going to eat cookies forever.” Early for me it was a helpful place, and regardless of the sub, the fundamentals of IE - especially when led by an RD qualified and experienced in that field - was essential to my recovery.\n\nI do agree that we shouldn’t as a whole be celebrating “I don’t crave sugar anymore” because I do think that’s just disguised restriction. But I also think there’s nuance. I came from a serious binge eating background and developed restrictive ED habits way later. So in recovery the binging (as a natural step in the process) was pretty serious, especially for sweets. Because my binge eating disorder was just as problematic to my life as the restrictive aspect, I was happy when the cravings subsided, because to me it signaled the “natural balance” that most people would probably end up with.\n\nAnyway, rant over. I agree with you 100% - the best choices are the ones where you can make decisions based on what you really want. Greasy burger with a side salad all day.",
      "created_utc": 1650735066.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i60umrk",
      "author": "myceliumfriend",
      "body": "YES also they are not flexible at all. Many of them are flexing how their friends wanted to go out for pizza but ~deep down~ their bodies craved steamed vegetables so they said no. Then they left half a floret of steamed broccoli because their ~intuition~ said they were perfectly satisfied. \n\nI also saw a woman brag about her husband leaving FIVE pasta noodles because he's such an ~intuitive eater~. They always make such a big deal about not finishing their food when there's just scraps left. I'm sure they wouldn't open another can of chili to eat one single spoonful if they were still hungry for one, so why bother leaving a spoonful of it? As if perfection exists. They love to say that your body is not a computer, so why do some of them treat their bodies like one? I'm all for listening to your body but sitting around all day waiting for the most subtle hunger and fullness cues is not intuitive. It's a disordered control trip.",
      "created_utc": 1650820956.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i5vw38n",
      "author": "None",
      "body": "you never miss",
      "created_utc": 1650726672.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5xmcq9",
      "author": "Queenofwands1212",
      "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
      "created_utc": 1650754735.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5xmeey",
      "author": "smallanimals123",
      "body": "ugh yes ! I think the intention of the subreddit is good, but so many of the members are still disordered without being aware of it. \n\nI remember reading someone mentioning how they were grateful that a food they were craving >! had less calories than they thought !< \n\nI think it’s such a shame, because so many people go to that sub before they’ve even attempted genuine ED recovery, when intuitive eating isn’t even meant for people right at the start of recovery.",
      "created_utc": 1650754757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5vw5jl",
      "author": "ssendavocadosplss",
      "body": "When I say I’m intuitively eating, its really just me saying all my calories for the day are liquid and normally in the form of a iced chai tea latte",
      "created_utc": 1650726700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5wjc7b",
      "author": "lovely_little_lilies",
      "body": "Yes!! That’s not what intuitive eating is supposed to be at all and it’s so annoying. It’s not about not wanting “unhealthy” food it’s about balance like you said. If you want a greasy burger but also vegetables then you get a burger AND vegetables, not just the veggies bc you want both!",
      "created_utc": 1650736878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lx1g2tr",
      "author": "coleisw4ck",
      "body": "YES 💯",
      "created_utc": 1731559241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5z1030",
      "author": "BeastieBeck",
      "body": ">but when a post pops up on my timeline, it’s always a post filled with comments saying “you’ll naturally want the things that will make you feel better/you will naturally crave more vegetables/I don’t even crave sugar anymore, yay!,\n\nFor me it always seems to be some version of \"struggling to eat *enough*\".\n\nUgh.",
      "created_utc": 1650782519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5w1gvo",
      "author": "Sareeee48",
      "body": "I also feel like a lot of them are lying too? Like yes my intense, *constant* cravings for highly palatable food did dissipate with eating enough, but I still have cravings sweets/carbs/etc. on a regular basis (among other foods as well). Sugar isn’t just something you don’t automatically need when you’re fed enough.",
      "created_utc": 1650729042.0,
      "score": 37,
      "context": [
        {
          "id": "i5vlo7k",
          "author": "BeastieBeck",
          "body": "I think of that sub as kind of triggering/annoying, yes. There is more than one reason but I can relate to the \"Yeah, I'm so glad I almost never crave XYZ anymore!!\"",
          "created_utc": 1650721807.0
        }
      ]
    },
    {
      "id": "i66pfhu",
      "author": "throwawayaccc9876",
      "body": "That’s the shit I used to try and convince myself of when I went through my whole ‘let’s restrict but not restrict phase’. I just don’t crave as many sweets! Lies. Also side note, strawberry Bon Bons are amazing",
      "created_utc": 1650923275.0,
      "score": 3,
      "context": [
        {
          "id": "i5vlo7k",
          "author": "BeastieBeck",
          "body": "I think of that sub as kind of triggering/annoying, yes. There is more than one reason but I can relate to the \"Yeah, I'm so glad I almost never crave XYZ anymore!!\"",
          "created_utc": 1650721807.0
        }
      ]
    },
    {
      "id": "i5w6t4n",
      "author": "Sareeee48",
      "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
      "created_utc": 1650731392.0,
      "score": 21,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        }
      ]
    },
    {
      "id": "i5w4vc6",
      "author": "messythelioma",
      "body": "I sometimes stalk people and I recently saw a post/replies where they talked about their ED in the sub, but people were actually giving good advice about not restricting and to eat when they experience any hunger (mental or physical). \n\nI was surprised to see helpful comments, like you said, it seems much better than when I last frequented the sub.",
      "created_utc": 1650730539.0,
      "score": 8,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        }
      ]
    },
    {
      "id": "i5wbmzg",
      "author": "Emergency-Parsley-51",
      "body": "Ironically, intuitive eating was originally a diet plan for weight loss, this is how it was presented in the first edition of the Intuitive Eating book.",
      "created_utc": 1650733506.0,
      "score": 14,
      "context": [
        {
          "id": "i5vrdc2",
          "author": "None",
          "body": "Agree! The intuitive eating thing is kinda sus in my opinion anyway. If you're eating by intuition and not obsessing over food then why are you so excited to be craving salad and not sugar? Aren't you supposed to not care or think about it? And isn't food supposed to NOT have a moral value? Then how come nobody is going \"YAYY, my body craved two bags of Blue Heat Takis and I'm sooo glad I honored my body!\" Idk it still seems like a diet plan to me.",
          "created_utc": 1650724527.0
        }
      ]
    },
    {
      "id": "i5vss6d",
      "author": "Sareeee48",
      "body": "This is exactly it! I eat *at least* one sweet thing everyday because I need the carbs and I have a sweet tooth. I do not like salads, and while I like veggies I am particular about them due to their previous role during my active restriction days and, yeah, some days I don’t fucking eat a vegetable. Going onto that sub and seeing that people choose >!veggies, chicken and rice!< over what you really want because “it’ll make you feel better” sounds like typical diet culture bullshit. A huge part of my recovery was learning to enjoy the food I eat rather than making it out to be a chore.",
      "created_utc": 1650725171.0,
      "score": 16,
      "context": [
        {
          "id": "i5vrdc2",
          "author": "None",
          "body": "Agree! The intuitive eating thing is kinda sus in my opinion anyway. If you're eating by intuition and not obsessing over food then why are you so excited to be craving salad and not sugar? Aren't you supposed to not care or think about it? And isn't food supposed to NOT have a moral value? Then how come nobody is going \"YAYY, my body craved two bags of Blue Heat Takis and I'm sooo glad I honored my body!\" Idk it still seems like a diet plan to me.",
          "created_utc": 1650724527.0
        }
      ]
    },
    {
      "id": "i5vtanb",
      "author": "Sareeee48",
      "body": "Every single time I go on there its what I see. It’s always the “I don’t even crave sugar anymore/I love eating veggies!” Comments that I see the most. And while these aren’t inherently *wrong*, the end goal should be food *freedom*. Hyper fixating on what goes into your body still seems disordered to me.",
      "created_utc": 1650725406.0,
      "score": 9,
      "context": [
        {
          "id": "i5vqzyv",
          "author": "momunist",
          "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
          "created_utc": 1650724355.0
        }
      ]
    },
    {
      "id": "i5z2ddj",
      "author": "BeastieBeck",
      "body": ">Treating intuitive eating like justified restriction IS really toxic.\n\nToo many people also treat it as the \"hunger fullness diet\". I was definitely guilty of that as well in the past.",
      "created_utc": 1650783571.0,
      "score": 3,
      "context": [
        {
          "id": "i5vqzyv",
          "author": "momunist",
          "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
          "created_utc": 1650724355.0
        }
      ]
    },
    {
      "id": "i5w75hv",
      "author": "Sareeee48",
      "body": "I don’t frequent the sub often but when it pops up on my TL or if I’m looking through someone post/comment history there it’s usually along the lines of “I don’t even crave sugar anymore/I prefer vegetables over [insert perceived unhealthy food here].” I’m not saying *all* posts and comments are like this, but too many are.",
      "created_utc": 1650731545.0,
      "score": 2,
      "context": [
        {
          "id": "i5w2d8v",
          "author": "salvbitch",
          "body": "Idk they usually talk about how to add vegetables in by roasting them with olive oil and cheese or stuff like that rather than talking about removing things from what I’ve seen. Most of what annoys me there is people saying you shouldn’t eat things that give you GI trouble, which in my case is everything",
          "created_utc": 1650729443.0
        }
      ]
    },
    {
      "id": "i5w7g57",
      "author": "Sareeee48",
      "body": "Yeah that’s what kind of confuses me on that sub. The post that sparked me writing this post was someone asking if they should *always* eat what they want and not doing so would theoretically mean restriction (which is true, at least in terms of accessibility). And the comments were filled with “well i opt for foods that make me feel good over [uNhEaLtHy FoOd] most of the time,” and I’m like… so you’re restricting. That’s restricting.",
      "created_utc": 1650731675.0,
      "score": 6,
      "context": [
        {
          "id": "i5w4iqx",
          "author": "messythelioma",
          "body": "It's when they encourage you to think about whatever it is you want to eat. To me, if you want to eat it, you should eat it. You shouldn't have to sit for 5, 10, 15 seconds thinking about whether or not \"you can\" eat it only to ultimately feel guilt/shame so you end up not having it regardless of how much you actually crave it.",
          "created_utc": 1650730383.0
        }
      ]
    },
    {
      "id": "i5z2w3r",
      "author": "BeastieBeck",
      "body": ">Because my binge eating disorder was just as problematic to my life as the restrictive aspect, I was happy when the cravings subsided, because to me it signaled the “natural balance” that most people would probably end up with.\n\nI agree.\n\nThings are different when you're coming from a non-restrictive background (like myself).",
      "created_utc": 1650783966.0,
      "score": 4,
      "context": [
        {
          "id": "i5wf6ib",
          "author": "Merlyn67420",
          "body": "I also think a lot of people there are still in recovery or early stages. They’re figuring it out and so they’re seeking that positive feedback to their fears of, say, “I’m going to eat cookies forever.” Early for me it was a helpful place, and regardless of the sub, the fundamentals of IE - especially when led by an RD qualified and experienced in that field - was essential to my recovery.\n\nI do agree that we shouldn’t as a whole be celebrating “I don’t crave sugar anymore” because I do think that’s just disguised restriction. But I also think there’s nuance. I came from a serious binge eating background and developed restrictive ED habits way later. So in recovery the binging (as a natural step in the process) was pretty serious, especially for sweets. Because my binge eating disorder was just as problematic to my life as the restrictive aspect, I was happy when the cravings subsided, because to me it signaled the “natural balance” that most people would probably end up with.\n\nAnyway, rant over. I agree with you 100% - the best choices are the ones where you can make decisions based on what you really want. Greasy burger with a side salad all day.",
          "created_utc": 1650735066.0
        }
      ]
    },
    {
      "id": "i617xh3",
      "author": "Sareeee48",
      "body": "Honestlyyy, they flex it so hard and I think it’s so weird.\n\nOn one hand I get it—it was amazing when my extreme hunger disappeared, likewise it was crazy to me when I first experienced fullness, but it wasn’t something I was *hyperaware* of either. And I didn’t post ecstatically about it either.\n\nIt’s not even so much the individuals either—it’s that nobody seems to be correcting the behavior that really gets me.",
      "created_utc": 1650826401.0,
      "score": 3,
      "context": [
        {
          "id": "i60umrk",
          "author": "myceliumfriend",
          "body": "YES also they are not flexible at all. Many of them are flexing how their friends wanted to go out for pizza but ~deep down~ their bodies craved steamed vegetables so they said no. Then they left half a floret of steamed broccoli because their ~intuition~ said they were perfectly satisfied. \n\nI also saw a woman brag about her husband leaving FIVE pasta noodles because he's such an ~intuitive eater~. They always make such a big deal about not finishing their food when there's just scraps left. I'm sure they wouldn't open another can of chili to eat one single spoonful if they were still hungry for one, so why bother leaving a spoonful of it? As if perfection exists. They love to say that your body is not a computer, so why do some of them treat their bodies like one? I'm all for listening to your body but sitting around all day waiting for the most subtle hunger and fullness cues is not intuitive. It's a disordered control trip.",
          "created_utc": 1650820956.0
        }
      ]
    },
    {
      "id": "i5xp8ru",
      "author": "Sareeee48",
      "body": "While I agree it’s problematic in early recovery, it has been a huge part of my long term recovery, especially after I reached nutritional rehabilitation. I once read an article by Tabitha Farrar about how shitty intuitive eating was due to the “subtle” forms of restriction that tends to permeate the community and now I totally see that. People in [early] recovery should most definitely steer clear of intuitive eating practices.",
      "created_utc": 1650756073.0,
      "score": 6,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        }
      ]
    },
    {
      "id": "i60w1x4",
      "author": "myceliumfriend",
      "body": "Although loss of hunger cues can be a symptom, anorexia nervosa doesn't mean you don't experience hunger or cravings... Or maybe I'm just greedy and faking it🥲🥲🥲🥲🥲",
      "created_utc": 1650821523.0,
      "score": 2,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        }
      ]
    },
    {
      "id": "i5w30wd",
      "author": "BeastieBeck",
      "body": "Not sure if some people on this sub are lying. Maybe some trick themselves into thinking they're \"all intuitive now\" - I sometimes have the impression.\n\nRegarding sugar/carbs: why should the cravings for sugar/carbs ever dissipate? Sugar and often carbohydrates in general have been demonized for quite a while now so many people seem to think that wanting to eat sugar or pasta or bread or any other carbohydrate rich food is somehow pathological or unnatural when it's perfectly normal.",
      "created_utc": 1650729723.0,
      "score": 17,
      "context": [
        {
          "id": "i5vlo7k",
          "author": "BeastieBeck",
          "body": "I think of that sub as kind of triggering/annoying, yes. There is more than one reason but I can relate to the \"Yeah, I'm so glad I almost never crave XYZ anymore!!\"",
          "created_utc": 1650721807.0
        },
        {
          "id": "i5w1gvo",
          "author": "Sareeee48",
          "body": "I also feel like a lot of them are lying too? Like yes my intense, *constant* cravings for highly palatable food did dissipate with eating enough, but I still have cravings sweets/carbs/etc. on a regular basis (among other foods as well). Sugar isn’t just something you don’t automatically need when you’re fed enough.",
          "created_utc": 1650729042.0
        }
      ]
    },
    {
      "id": "i5x5ezw",
      "author": "stripystockings",
      "body": "Hey I have a question since it seems like you're further along in recovery than me, if that's okay! I'm at the point where extreme hunger has started dissipating but is still there some days. I *do* feel different when I eat some \"junk\" food compared to the kinds of meals my nutritionist advises - some protein, carbs and veg/fruit, and eating \"junk\" food without fruit or veg does feel worse. Is this not what it's meant to feel like, or maybe something that might settle as I get further in recovery, and I might get to a point where it feels no different?",
      "created_utc": 1650746843.0,
      "score": 9,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        }
      ]
    },
    {
      "id": "i5yirjm",
      "author": "mermaidmagick",
      "body": "I don’t know, I have pretty substantial GI problems. Eating a veggie burger does make me feel worse than a salad. I feel like a lot of non-disordered people feel different when eating different foods. I respect if you feel that way but it feels dismissive to think any physical reaction to food is imagined.",
      "created_utc": 1650770887.0,
      "score": 6,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        }
      ]
    },
    {
      "id": "i5z1m1c",
      "author": "BeastieBeck",
      "body": ">It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?\n\nThis.\n\nI'm willing to bet that some people really feel like this but for other reasons they think they do. The placebo/nocebo effect goes a long way. \n\nIMO it's an illusion to ditch *all* the diet culture stuff we grew up with, have been indoctrinated with from earliest childhood on and that's continuing to be all around us.\n\n\"Dieting\" is seen as useless, stupid and toxic by many people nowadays. So let's call what we're doing \"pursuing wellness\" instead.",
      "created_utc": 1650782981.0,
      "score": 3,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        }
      ]
    },
    {
      "id": "i60vfbh",
      "author": "myceliumfriend",
      "body": "When I spooned PB from the jar until I was truly satisfied for the first time (it was a lot) I felt amazing. When I ordered Indian takeaway (with sauce and starters, no dry curry) and ate until I was bursting at the seams, I had never felt so great in my life. When I ordered a huge salad at a ~healthy~ restaurant with the most mind-blowingly creative ingredients, I felt on top of the world. Maybe that makes me a binge eater. Idc lol if it just gets rid of my anorexia I'll take it cuz it's getting kinda boring.",
      "created_utc": 1650821271.0,
      "score": 1,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        }
      ]
    },
    {
      "id": "i5vzp09",
      "author": "spinesight",
      "body": "I mean, if they're still using a sub for support they probably don't have full food freedom yet",
      "created_utc": 1650728258.0,
      "score": 6,
      "context": [
        {
          "id": "i5vqzyv",
          "author": "momunist",
          "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
          "created_utc": 1650724355.0
        },
        {
          "id": "i5vtanb",
          "author": "Sareeee48",
          "body": "Every single time I go on there its what I see. It’s always the “I don’t even crave sugar anymore/I love eating veggies!” Comments that I see the most. And while these aren’t inherently *wrong*, the end goal should be food *freedom*. Hyper fixating on what goes into your body still seems disordered to me.",
          "created_utc": 1650725406.0
        }
      ]
    },
    {
      "id": "i5vtka0",
      "author": "momunist",
      "body": "Absolutely, that’s definitely really disordered thinking. Like I said, maybe I’ve just gotten lucky with what I’ve happened to see on there 😬",
      "created_utc": 1650725528.0,
      "score": 1,
      "context": [
        {
          "id": "i5vqzyv",
          "author": "momunist",
          "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
          "created_utc": 1650724355.0
        },
        {
          "id": "i5vtanb",
          "author": "Sareeee48",
          "body": "Every single time I go on there its what I see. It’s always the “I don’t even crave sugar anymore/I love eating veggies!” Comments that I see the most. And while these aren’t inherently *wrong*, the end goal should be food *freedom*. Hyper fixating on what goes into your body still seems disordered to me.",
          "created_utc": 1650725406.0
        }
      ]
    },
    {
      "id": "i5wbh9i",
      "author": "messythelioma",
      "body": "Exactly. And it's highly unlikely that the food will actually make them \"feel bad\" (GI/digestion issues). \n\nLike, those fries are not gonna make your stomach hurt lmfao. \n\nI'm sure in some cases, people aren't necessarily restricting, but do know certain foods end up causing issues for them. But, I think for a lot of them, the \"feeling good\" isn't tied to digestion, but rather a feeling of morality where not eating that piece of chocolate makes them feel good about their \"discipline\" or something.",
      "created_utc": 1650733438.0,
      "score": 2,
      "context": [
        {
          "id": "i5w4iqx",
          "author": "messythelioma",
          "body": "It's when they encourage you to think about whatever it is you want to eat. To me, if you want to eat it, you should eat it. You shouldn't have to sit for 5, 10, 15 seconds thinking about whether or not \"you can\" eat it only to ultimately feel guilt/shame so you end up not having it regardless of how much you actually crave it.",
          "created_utc": 1650730383.0
        },
        {
          "id": "i5w7g57",
          "author": "Sareeee48",
          "body": "Yeah that’s what kind of confuses me on that sub. The post that sparked me writing this post was someone asking if they should *always* eat what they want and not doing so would theoretically mean restriction (which is true, at least in terms of accessibility). And the comments were filled with “well i opt for foods that make me feel good over [uNhEaLtHy FoOd] most of the time,” and I’m like… so you’re restricting. That’s restricting.",
          "created_utc": 1650731675.0
        }
      ]
    },
    {
      "id": "i5xpq23",
      "author": "Queenofwands1212",
      "body": "I agree! But so many Ed professionals and experts praise IE like it’s a no brainer. It makes absolutely no sense. And then it injects shame into the folks who IE does not work for like binge eaters or bulimic. IE only works for folks who have a deep understanding of food/ body/ nourishment/ nutrients/ etc etc etc.",
      "created_utc": 1650756301.0,
      "score": 1,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        },
        {
          "id": "i5xp8ru",
          "author": "Sareeee48",
          "body": "While I agree it’s problematic in early recovery, it has been a huge part of my long term recovery, especially after I reached nutritional rehabilitation. I once read an article by Tabitha Farrar about how shitty intuitive eating was due to the “subtle” forms of restriction that tends to permeate the community and now I totally see that. People in [early] recovery should most definitely steer clear of intuitive eating practices.",
          "created_utc": 1650756073.0
        }
      ]
    },
    {
      "id": "i5xv2sh",
      "author": "Sareeee48",
      "body": "I use lying loosely. More that they either a) actually geniunely believe they don’t, or b) feel as if they shouldn’t and thus ignore the cravings.\n\nAnd exactly, carbs are so important, there is physically no way to remain healthy and not consume carbs imo. Obviously amount will vary per person but ya know.",
      "created_utc": 1650758925.0,
      "score": 10,
      "context": [
        {
          "id": "i5vlo7k",
          "author": "BeastieBeck",
          "body": "I think of that sub as kind of triggering/annoying, yes. There is more than one reason but I can relate to the \"Yeah, I'm so glad I almost never crave XYZ anymore!!\"",
          "created_utc": 1650721807.0
        },
        {
          "id": "i5w1gvo",
          "author": "Sareeee48",
          "body": "I also feel like a lot of them are lying too? Like yes my intense, *constant* cravings for highly palatable food did dissipate with eating enough, but I still have cravings sweets/carbs/etc. on a regular basis (among other foods as well). Sugar isn’t just something you don’t automatically need when you’re fed enough.",
          "created_utc": 1650729042.0
        },
        {
          "id": "i5w30wd",
          "author": "BeastieBeck",
          "body": "Not sure if some people on this sub are lying. Maybe some trick themselves into thinking they're \"all intuitive now\" - I sometimes have the impression.\n\nRegarding sugar/carbs: why should the cravings for sugar/carbs ever dissipate? Sugar and often carbohydrates in general have been demonized for quite a while now so many people seem to think that wanting to eat sugar or pasta or bread or any other carbohydrate rich food is somehow pathological or unnatural when it's perfectly normal.",
          "created_utc": 1650729723.0
        }
      ]
    },
    {
      "id": "i5y5ac4",
      "author": "None",
      "body": "I’m not the person you asked but personally I had the same experience and it went away with time. I think a lot of the time, it’s rooted in the fact that we spend so long being told by our EDs and diet culture that “junk” food makes you feel bad, we actually end up feeling that way. Of course for some people I’m sure it’s legitimate, but for me and a lot of folks I’ve talked to about it it seems like it’s because often, expecting you’ll feel bad (subconsciously or not) will make you actually feel bad.",
      "created_utc": 1650763994.0,
      "score": 5,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        },
        {
          "id": "i5x5ezw",
          "author": "stripystockings",
          "body": "Hey I have a question since it seems like you're further along in recovery than me, if that's okay! I'm at the point where extreme hunger has started dissipating but is still there some days. I *do* feel different when I eat some \"junk\" food compared to the kinds of meals my nutritionist advises - some protein, carbs and veg/fruit, and eating \"junk\" food without fruit or veg does feel worse. Is this not what it's meant to feel like, or maybe something that might settle as I get further in recovery, and I might get to a point where it feels no different?",
          "created_utc": 1650746843.0
        }
      ]
    },
    {
      "id": "i5ymr8p",
      "author": "Sareeee48",
      "body": "It really depends on the symptoms, and how far along you are in recovery. If we’re talking lethargy, bloating, gastrointestinal distress, water retention, body soreness, cravings, and hunger, that’s all par for the course in terms of recovery. I felt fucking awful for like 9 months into my recovery, but it definitely dissipated with time despite eating relatively the same. When the body is being fed adequately, it’s first response is to allocate all available energy to repairing damages, and that can result in extreme fatigue, tummy troubles, and overall uncomfortable symptoms.\n\nThat isn’t to say that you can’t dislike certain foods—you absolutely can. But assuming you’re still early into the process, I wouldn’t blame it on “junk food,” especially if you’re still struggling with assigning moral value to foods. Remember that anxiety and stress can cause uncomfortable physical symptoms as well; and it’s very common to feel guilt and shame—a by product of anxiety and stress—after eating these foods due to diet culture’s influence.",
      "created_utc": 1650773125.0,
      "score": 4,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        },
        {
          "id": "i5x5ezw",
          "author": "stripystockings",
          "body": "Hey I have a question since it seems like you're further along in recovery than me, if that's okay! I'm at the point where extreme hunger has started dissipating but is still there some days. I *do* feel different when I eat some \"junk\" food compared to the kinds of meals my nutritionist advises - some protein, carbs and veg/fruit, and eating \"junk\" food without fruit or veg does feel worse. Is this not what it's meant to feel like, or maybe something that might settle as I get further in recovery, and I might get to a point where it feels no different?",
          "created_utc": 1650746843.0
        }
      ]
    },
    {
      "id": "i5yktpr",
      "author": "Sareeee48",
      "body": "Hey, thanks for commenting. I did say under another comment that gi issues are a valid reason to avoid certain foods. I say all of the time here that if a food is actually harmful to you then by all means avoid them. But that’s not the same as giving moral value to food and saying “this makes me feel icky and this makes me feel good,” and celebrating that. Many people don’t have severe gastrointestinal issues, even those who recover, and that’s really what my comment was referring to.",
      "created_utc": 1650772032.0,
      "score": 3,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        },
        {
          "id": "i5yirjm",
          "author": "mermaidmagick",
          "body": "I don’t know, I have pretty substantial GI problems. Eating a veggie burger does make me feel worse than a salad. I feel like a lot of non-disordered people feel different when eating different foods. I respect if you feel that way but it feels dismissive to think any physical reaction to food is imagined.",
          "created_utc": 1650770887.0
        }
      ]
    },
    {
      "id": "i5w17ui",
      "author": "Sareeee48",
      "body": "Which is fine, but it isn’t discouraged or corrected. 🤷🏼‍♀️ if you’re looking for support, that’s one thing… to let people encourage disordered behavior and eating habits is exactly why it’s kinda toxic.",
      "created_utc": 1650728932.0,
      "score": 2,
      "context": [
        {
          "id": "i5vqzyv",
          "author": "momunist",
          "body": "When I do see comments like that on that sub, they tend to be downvoted or have replies explaining why that’s restrictive thinking, but maybe I’ve just gotten lucky with what I’ve seen. Treating intuitive eating like justified restriction IS really toxic.",
          "created_utc": 1650724355.0
        },
        {
          "id": "i5vtanb",
          "author": "Sareeee48",
          "body": "Every single time I go on there its what I see. It’s always the “I don’t even crave sugar anymore/I love eating veggies!” Comments that I see the most. And while these aren’t inherently *wrong*, the end goal should be food *freedom*. Hyper fixating on what goes into your body still seems disordered to me.",
          "created_utc": 1650725406.0
        },
        {
          "id": "i5vzp09",
          "author": "spinesight",
          "body": "I mean, if they're still using a sub for support they probably don't have full food freedom yet",
          "created_utc": 1650728258.0
        }
      ]
    },
    {
      "id": "i5wfn5x",
      "author": "Sareeee48",
      "body": "Totally agree with your last paragraph, if foods *are* causing a negative reaction it is perfectly acceptable to avoid them. But I don’t think the he *majority* struggle with that. Often people forget that eating foods that make you feel good isn’t just a physical experience—it’s also a psychological one. So cutting out foods or opting for the “healthier” ones are going to bite you in the ass sooner or later, imo.",
      "created_utc": 1650735260.0,
      "score": 2,
      "context": [
        {
          "id": "i5w4iqx",
          "author": "messythelioma",
          "body": "It's when they encourage you to think about whatever it is you want to eat. To me, if you want to eat it, you should eat it. You shouldn't have to sit for 5, 10, 15 seconds thinking about whether or not \"you can\" eat it only to ultimately feel guilt/shame so you end up not having it regardless of how much you actually crave it.",
          "created_utc": 1650730383.0
        },
        {
          "id": "i5w7g57",
          "author": "Sareeee48",
          "body": "Yeah that’s what kind of confuses me on that sub. The post that sparked me writing this post was someone asking if they should *always* eat what they want and not doing so would theoretically mean restriction (which is true, at least in terms of accessibility). And the comments were filled with “well i opt for foods that make me feel good over [uNhEaLtHy FoOd] most of the time,” and I’m like… so you’re restricting. That’s restricting.",
          "created_utc": 1650731675.0
        },
        {
          "id": "i5wbh9i",
          "author": "messythelioma",
          "body": "Exactly. And it's highly unlikely that the food will actually make them \"feel bad\" (GI/digestion issues). \n\nLike, those fries are not gonna make your stomach hurt lmfao. \n\nI'm sure in some cases, people aren't necessarily restricting, but do know certain foods end up causing issues for them. But, I think for a lot of them, the \"feeling good\" isn't tied to digestion, but rather a feeling of morality where not eating that piece of chocolate makes them feel good about their \"discipline\" or something.",
          "created_utc": 1650733438.0
        }
      ]
    },
    {
      "id": "i5xr3hp",
      "author": "Sareeee48",
      "body": "Tbf IE *does* work for BED and bulimia as well… but not not early recovery.",
      "created_utc": 1650756966.0,
      "score": 6,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        },
        {
          "id": "i5xp8ru",
          "author": "Sareeee48",
          "body": "While I agree it’s problematic in early recovery, it has been a huge part of my long term recovery, especially after I reached nutritional rehabilitation. I once read an article by Tabitha Farrar about how shitty intuitive eating was due to the “subtle” forms of restriction that tends to permeate the community and now I totally see that. People in [early] recovery should most definitely steer clear of intuitive eating practices.",
          "created_utc": 1650756073.0
        },
        {
          "id": "i5xpq23",
          "author": "Queenofwands1212",
          "body": "I agree! But so many Ed professionals and experts praise IE like it’s a no brainer. It makes absolutely no sense. And then it injects shame into the folks who IE does not work for like binge eaters or bulimic. IE only works for folks who have a deep understanding of food/ body/ nourishment/ nutrients/ etc etc etc.",
          "created_utc": 1650756301.0
        }
      ]
    },
    {
      "id": "i5zntcl",
      "author": "stripystockings",
      "body": "Thank you! I'm glad to hear it'll go away with time. I'll look into ways I can work on dealing with those subconscious feelings which will help I'm sure whether it's a physical or a psychological issue!",
      "created_utc": 1650800943.0,
      "score": 3,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        },
        {
          "id": "i5x5ezw",
          "author": "stripystockings",
          "body": "Hey I have a question since it seems like you're further along in recovery than me, if that's okay! I'm at the point where extreme hunger has started dissipating but is still there some days. I *do* feel different when I eat some \"junk\" food compared to the kinds of meals my nutritionist advises - some protein, carbs and veg/fruit, and eating \"junk\" food without fruit or veg does feel worse. Is this not what it's meant to feel like, or maybe something that might settle as I get further in recovery, and I might get to a point where it feels no different?",
          "created_utc": 1650746843.0
        },
        {
          "id": "i5y5ac4",
          "author": "None",
          "body": "I’m not the person you asked but personally I had the same experience and it went away with time. I think a lot of the time, it’s rooted in the fact that we spend so long being told by our EDs and diet culture that “junk” food makes you feel bad, we actually end up feeling that way. Of course for some people I’m sure it’s legitimate, but for me and a lot of folks I’ve talked to about it it seems like it’s because often, expecting you’ll feel bad (subconsciously or not) will make you actually feel bad.",
          "created_utc": 1650763994.0
        }
      ]
    },
    {
      "id": "i5znq4a",
      "author": "stripystockings",
      "body": "That makes sense, thank you for taking the time to explain! It's mostly things like lethargy. So I suppose that means the higher calorie \"junk food\" makes me more lethargic because that's energy my body needs to heal - reframing it helps! I'll keep in mind the anxiety and stress as well and reflect on how much that might be affecting things.",
      "created_utc": 1650800883.0,
      "score": 2,
      "context": [
        {
          "id": "i5w3v4e",
          "author": "None",
          "body": "listen i get so annoyed at it!!!!!!!! it’s def much better now with the current mods, before that it was straight up a diet sub, but it’s still so bad with the “wins” posts ALL being about eating less. no one posts a “win” saying they ate pizza, were really hungry all week and ate a whole lot because of it… it’s always sneaky diet stuff. \n\nand don’t get me started on the whole “power food” vs “play food”. i feel absolutely fine and no different if i eat a burger and fries or a quinoa salad, but reading that sub you’d only come away with one of those being labeled “power food”. and guess which one it’d be. \n\ni still frequent it because i foolishly have hope, and also to counter some weird, straight up harmful comments, but i more often than not leave a little frustrated lol.",
          "created_utc": 1650730089.0
        },
        {
          "id": "i5w6t4n",
          "author": "Sareeee48",
          "body": ">I feel absolutely fine and no different if i eat a burger and fries or a quinoa salad\n\nTHIS, I get so frustrated with the “fOoDs ThAt MaKe Me FeEl GoOd” posts like I’m sorry but I’ve never eaten a salad and thought “wow I feel amazing,” compared to eating a burger and thinking “wow, this made me feel awful,” I feel literally the fucking same. It’s the whole moral value aspect the gets me… which makes me think; do you actually feel “bad,” or are you just convincing yourself you do because society says these foods aren’t good for us?",
          "created_utc": 1650731392.0
        },
        {
          "id": "i5x5ezw",
          "author": "stripystockings",
          "body": "Hey I have a question since it seems like you're further along in recovery than me, if that's okay! I'm at the point where extreme hunger has started dissipating but is still there some days. I *do* feel different when I eat some \"junk\" food compared to the kinds of meals my nutritionist advises - some protein, carbs and veg/fruit, and eating \"junk\" food without fruit or veg does feel worse. Is this not what it's meant to feel like, or maybe something that might settle as I get further in recovery, and I might get to a point where it feels no different?",
          "created_utc": 1650746843.0
        },
        {
          "id": "i5ymr8p",
          "author": "Sareeee48",
          "body": "It really depends on the symptoms, and how far along you are in recovery. If we’re talking lethargy, bloating, gastrointestinal distress, water retention, body soreness, cravings, and hunger, that’s all par for the course in terms of recovery. I felt fucking awful for like 9 months into my recovery, but it definitely dissipated with time despite eating relatively the same. When the body is being fed adequately, it’s first response is to allocate all available energy to repairing damages, and that can result in extreme fatigue, tummy troubles, and overall uncomfortable symptoms.\n\nThat isn’t to say that you can’t dislike certain foods—you absolutely can. But assuming you’re still early into the process, I wouldn’t blame it on “junk food,” especially if you’re still struggling with assigning moral value to foods. Remember that anxiety and stress can cause uncomfortable physical symptoms as well; and it’s very common to feel guilt and shame—a by product of anxiety and stress—after eating these foods due to diet culture’s influence.",
          "created_utc": 1650773125.0
        }
      ]
    },
    {
      "id": "i5xu17i",
      "author": "Queenofwands1212",
      "body": "Nice. Well I’m glad it works for some people",
      "created_utc": 1650758406.0,
      "score": 1,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        },
        {
          "id": "i5xp8ru",
          "author": "Sareeee48",
          "body": "While I agree it’s problematic in early recovery, it has been a huge part of my long term recovery, especially after I reached nutritional rehabilitation. I once read an article by Tabitha Farrar about how shitty intuitive eating was due to the “subtle” forms of restriction that tends to permeate the community and now I totally see that. People in [early] recovery should most definitely steer clear of intuitive eating practices.",
          "created_utc": 1650756073.0
        },
        {
          "id": "i5xpq23",
          "author": "Queenofwands1212",
          "body": "I agree! But so many Ed professionals and experts praise IE like it’s a no brainer. It makes absolutely no sense. And then it injects shame into the folks who IE does not work for like binge eaters or bulimic. IE only works for folks who have a deep understanding of food/ body/ nourishment/ nutrients/ etc etc etc.",
          "created_utc": 1650756301.0
        },
        {
          "id": "i5xr3hp",
          "author": "Sareeee48",
          "body": "Tbf IE *does* work for BED and bulimia as well… but not not early recovery.",
          "created_utc": 1650756966.0
        }
      ]
    },
    {
      "id": "i5zkyvr",
      "author": "BeastieBeck",
      "body": "No approach will work for *all* people. Usually people seem to come to IF if nothing else worked so far. At least it seemed to be like that about a decade ago. Now with that hype around it going on it might as well be the opposite around and it's one of the first things people try to recover.",
      "created_utc": 1650798883.0,
      "score": 2,
      "context": [
        {
          "id": "i5xmcq9",
          "author": "Queenofwands1212",
          "body": "I find intuitive eating as a means to recover from an Ed extremely paradoxical and it’s an oxy moron. It’s like telling a drug addict or alcoholic to “just go to the bar for one drink” or “just do a little bit of drugs”. Also. For those of us with anorexia or atypical anorexia, “Intuitive  eating” looks like starving one self. IE is not an end all be all to eating disorders and recovery, it’s toxic as fuck in my opinion.",
          "created_utc": 1650754735.0
        },
        {
          "id": "i5xp8ru",
          "author": "Sareeee48",
          "body": "While I agree it’s problematic in early recovery, it has been a huge part of my long term recovery, especially after I reached nutritional rehabilitation. I once read an article by Tabitha Farrar about how shitty intuitive eating was due to the “subtle” forms of restriction that tends to permeate the community and now I totally see that. People in [early] recovery should most definitely steer clear of intuitive eating practices.",
          "created_utc": 1650756073.0
        },
        {
          "id": "i5xpq23",
          "author": "Queenofwands1212",
          "body": "I agree! But so many Ed professionals and experts praise IE like it’s a no brainer. It makes absolutely no sense. And then it injects shame into the folks who IE does not work for like binge eaters or bulimic. IE only works for folks who have a deep understanding of food/ body/ nourishment/ nutrients/ etc etc etc.",
          "created_utc": 1650756301.0
        },
        {
          "id": "i5xr3hp",
          "author": "Sareeee48",
          "body": "Tbf IE *does* work for BED and bulimia as well… but not not early recovery.",
          "created_utc": 1650756966.0
        },
        {
          "id": "i5xu17i",
          "author": "Queenofwands1212",
          "body": "Nice. Well I’m glad it works for some people",
          "created_utc": 1650758406.0
        }
      ]
    }
  ]
}