{
  "id": "ut6wrs",
  "subreddit": "fuckeatingdisorders",
  "author": "mspatchess",
  "created_utc": 1652976851.0,
  "title": "But you never gave that version of yourself a try",
  "selftext": "I finally went for my first psychologist session after waiting for 6 months. \n\nOne thing that really stuck with me, that I wanted to share, was when I mentioned to her at one point, what would happen if I listened to what she said and not restrict after eating, end the cycle then and there, what then would become of me? What worth would I have? \n\nI have been doing this for so long it has become something I’m familiar with, something that is a part of me. And she said that since I’ve never tried not restricting before and since I’d never know until I do, why not give it a try, because if I stick to this life I have right now, in this bubble, I’d never discover what lies beyond what I’m familiar with, what I think is “me”. What if that version of myself where I’m at a higher weight is better? What if I’m more sociable, more driven, more confident, more assured, more attractive? what if that would be the best version of myself? I already know what my ED self is like - the current state I’m at. \n\nEssentially, what makes me so sure that my ED self is the better version of me?\n I’d never know how my non-ED self is like until I give it a try, and who knows, it might be for the better. I’d truly be missing out if I don’t give it a try",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ut6wrs/but_you_never_gave_that_version_of_yourself_a_try/",
  "score": 150,
  "num_comments": 8,
  "comments": [
    {
      "id": "i984353",
      "author": "aledaml",
      "body": "Wow, it sounds like you have a really good therapist!!!",
      "created_utc": 1652980656.0,
      "score": 36,
      "context": []
    },
    {
      "id": "i98915t",
      "author": "thingsivegottenridof",
      "body": "Super solid advice. It’s what’s driven my recovery for sure. The me without an ED deserves a chance.",
      "created_utc": 1652982631.0,
      "score": 26,
      "context": []
    },
    {
      "id": "i99ii1d",
      "author": "BadInconsequence",
      "body": "Trust me, the you without will have many more opportunities. To feel, to care and to live. Also the capacity to learn and do more of what you love without the mind being both tired and on repetitive food thoughts & self punishment. \n\nYou may hit nostalgia from time to time but that doesn’t mean you will think it’s worth going back.",
      "created_utc": 1653003257.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i98gdve",
      "author": "selkieflying",
      "body": "Wow, that really resonated with me!",
      "created_utc": 1652985646.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i992qda",
      "author": "firstofthethree",
      "body": "Hugs. This can be a really overwhelming thing to start challenging and tackling, but you can do it. That kind of perspective is exactly what you need when working on things you never thought you could/should “fix”",
      "created_utc": 1652995705.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i9b0jgt",
      "author": "sicklywho",
      "body": "This is beautifully written and I hope you meet that version of yourself. I can speak for myself that I am by far my best self with more weight on me in recovery. I would 1000% choose it all over again. Sending you so much love",
      "created_utc": 1653036681.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9a7rlf",
      "author": "wanie444",
      "body": "Saving this. Best of luck to you💜",
      "created_utc": 1653015891.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i9bhcvi",
      "author": "hoe00",
      "body": "This is what my mums said to me before. What have you got to lose really ? When I went to the hospital as well the psych lady there said why don’t you just go for it and then if you hate it that much , you can always go back. But you have to try first and give it a good go. That’s the thing, if you don’t try you won’t know, don’t let the fear stop you! You have so much potential",
      "created_utc": 1653048353.0,
      "score": 1,
      "context": []
    }
  ]
}