{
  "id": "uufvol",
  "subreddit": "fuckeatingdisorders",
  "author": "Lady-of-the-Frogs",
  "created_utc": 1653108367.0,
  "title": "Anyone else have the \"Radar\" for other people who have/had EDs?",
  "selftext": "Just out of curiosity because I was just talking about it and have had like five people set it off in the last month, does anyone else seem to have The Radar for other people who have or had EDs? Its like the Gaydar, basically, except it just makes me anxious and sad instead of happy like the gaydar. Am I weird for it? I don't do it consciously and am never actively looking or anything it just,,,happens? I also feel bad because I don't want to ever assume anything about anyone, but im almost n e v e r wrong when I get a confirmation. And for anyone else with The Radar- how do you deal with it ? Ive been recovered for a year so its not triggering (necessarily, but nothing i'd ever act on fuck that shit) but it does make me worried and sad",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/uufvol/anyone_else_have_the_radar_for_other_people_who/",
  "score": 112,
  "num_comments": 23,
  "comments": [
    {
      "id": "i9f1626",
      "author": "Sareeee48",
      "body": "Mines not really specific *to* EDs but just a disordered relationship with food in general. And yeah, that shit goes off all the damn time. Lol",
      "created_utc": 1653108778.0,
      "score": 42,
      "context": []
    },
    {
      "id": "i9f9d66",
      "author": "EmilyVS",
      "body": "Yes! Both my ED radar and my gaydar have always been 100% accurate.\n\nI see it as a blessing. I’ll never hit on anyone who isn’t interested in women and I always know who to be more careful around when discussing anything related to body image or food.",
      "created_utc": 1653115021.0,
      "score": 28,
      "context": []
    },
    {
      "id": "i9fahfu",
      "author": "BeastieBeck",
      "body": "Not sure if I have that radar. \n\nI always take into consideration that projection might be what is really happening when I think of someone or some behavior as \"eating disordered\".",
      "created_utc": 1653115975.0,
      "score": 24,
      "context": []
    },
    {
      "id": "i9fev0q",
      "author": "None",
      "body": "100%. Funnily enough, I’m queer, but my gaydar absolutely does not work at all unless the gal is full butch. But with eds I’m like…. I see you, girl who works at my local Holland and Barrett. And I know you see me, staring at the food supplement shelf for a good 15 minutes. She’s lovely though, it makes me feel solidarity.",
      "created_utc": 1653119828.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i9fy3l8",
      "author": "attic-dweller-",
      "body": "omg yesss. I made a new friend in an outdoor class and during lunch last week she was eating for a couple minutes when I asked her a question. she was like, \"what? I was completely in a binge zone with my food.\" just completely unaware of the conversation. I was like ah, my people.\n\nfunny how she's the person I easily vibed with the most in class.",
      "created_utc": 1653135998.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i9gfx5s",
      "author": "honeycakies",
      "body": "I definitely have that! I actually noticed this w my professor in a certain class (tech-related subject entirely unrelated to food/nutrition/anything along those lines). She didn’t look super alarming — a bit UW but very put-together overall — or say anything disordered, but I just got A Vibe. Sure enough, when I reached out to her about struggling with deadlines due to my ED, she was a huge sweetheart and disclosed a bit of her own mental health struggles in college, including an ED too.\n\nA lot of girls I see at the gym also give me huge ED vibes which are essentially confirmed to me by, like, the way I hear them talk to people (ie: very thin in baggy clothes and turning down rides from friends to bike home past 11pm after a lot of intense cardio), but I think that’s pretty obviously an environment that attracts disordered people so eh",
      "created_utc": 1653145331.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i9gynm3",
      "author": "poshpea",
      "body": "I try not to “diagnose” people in my head because I know it’s probably projection, and people can have disordered/unhealthy eating patterns without HAVING an ED, but I guess I do have a radar for it. Like, me and my friends were getting ice cream, and one of the girls got the reduced sugar, dairy free, fruit sorbet. One of my friends was like “Why would you get that, you don’t have any allergies” and she said “Oh, I just like it better…” and I looked at her and she looked at me and I looked at her and raised my eye brow and looked away, lol.",
      "created_utc": 1653153910.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i9gd0rc",
      "author": "Kasmirque",
      "body": "Oh 100%. I feel like I’m also pretty good at distinguishing between people who are trying to lose weight vs chronic disordered eating vs people have more naturally low appetites or picky eating. But all of those trigger my ED spidey sense initially.",
      "created_utc": 1653143995.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i9gouhs",
      "author": "crycry_chemtrails",
      "body": "I’m pretty good at picking up on disordered language when talking to people. However, it’s really not ok to assume someone’s ED status based on appearance alone. A) EDs don’t have a look B) not all EDs lead to thinness or involve restriction. Do you really have an “ED radar” or do you have an “anorexia radar”?",
      "created_utc": 1653149438.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i9gveof",
      "author": "Funky_Lesbian",
      "body": "oh yeah. seeing people’s plates in the dining halls at my college always sets me off. i can’t help but look at what everyone is eating, it’s just second nature at this point. when i see stick thin girls using lettuce for buns, it’s hard not to be triggered lol",
      "created_utc": 1653152442.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i9gno5c",
      "author": "None",
      "body": "As a gay man I'm not a big fan of the term gaydar but get what you mean. I try not to look for signs of EDs in others because I know I'm still easily triggered by other people's behaviours. When I do \"clock\" them, so to speak, I try to remember they're still in the thick of it and that I, as someone who has been in recovery for a while, might be able to give them some pointers, but only if they'd be receptive to them.",
      "created_utc": 1653148900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i9hhakr",
      "author": "onlythisfar",
      "body": "Oh wow. Definitely... I'm not saying I'm always right by any means but I definitely know the experience. And \"it just makes me anxious and sad,\" definitely true for me as well, unless I'm in a pretty shitty less-recovered place in which case then it can also make me jealous (it shouldn't I know). But yeah, for sure have some kind of ED radar of the \"it takes one to know one\" type. Same for SH as well. It's the most subtle signs that are the most obvious sometimes.",
      "created_utc": 1653162815.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i9hwco6",
      "author": "Avelinegrace123",
      "body": "I swear to god I have spidey senses for when someone has lost weight unhealthily, when I see the life leave their face a little bit I immediately can guess",
      "created_utc": 1653170424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i9hhh1b",
      "author": "Yorurue",
      "body": "i think our brain is actively looking for patterns and signs for things and categorizing it.\n\n when you're going through something the symptoms of it are your daily life so when you see someone acting the same as you do, you might think they have the same problem because they showed the same symptom whether be it the way they talk about diets their bodies or their actions when around food, which sometimes may be true and sometimes it's not true at all. \n\nsomeone thought my bestfriend was anorexic because he is UW and he didn't eat anything unless he checked it like a thousand times but he just has celiac disease so he has anemia and couldn't eat anything with gluten so he was constantly checking if the snacks we were eating had any.\n\nkeep in mind that if you're thinking of something constantly the human brain always has a way to find it and sometimes we project things onto other people.",
      "created_utc": 1653162906.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i9gf2m7",
      "author": "Notreallysurebutidc",
      "body": "I don’t know if it’s a “radar” but I can easily spot people who have it or have it without knowing because their eating (or just in general) habits look like my old habits or my other disordered friends habits.",
      "created_utc": 1653144940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i9gg8yb",
      "author": "zedem124",
      "body": "YES same literally like i can see people do the exact same thing as i did during my ED",
      "created_utc": 1653145481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i9hbo0e",
      "author": "yourfavrocketship",
      "body": "Love this self-awareness!",
      "created_utc": 1653160053.0,
      "score": 3,
      "context": [
        {
          "id": "i9fahfu",
          "author": "BeastieBeck",
          "body": "Not sure if I have that radar. \n\nI always take into consideration that projection might be what is really happening when I think of someone or some behavior as \"eating disordered\".",
          "created_utc": 1653115975.0
        }
      ]
    },
    {
      "id": "i9fjghq",
      "author": "stopquaking",
      "body": "I have both.",
      "created_utc": 1653124063.0,
      "score": 3,
      "context": [
        {
          "id": "i9fev0q",
          "author": "None",
          "body": "100%. Funnily enough, I’m queer, but my gaydar absolutely does not work at all unless the gal is full butch. But with eds I’m like…. I see you, girl who works at my local Holland and Barrett. And I know you see me, staring at the food supplement shelf for a good 15 minutes. She’s lovely though, it makes me feel solidarity.",
          "created_utc": 1653119828.0
        }
      ]
    },
    {
      "id": "i9hgqh8",
      "author": "onlythisfar",
      "body": "Okay but literally...that answer would make my radar go off so much more than if she had actually said something like \"I'm trying to eAt HeaLtHiEr.\" Like it may or may not go off for that but definitely would for what you described.",
      "created_utc": 1653162542.0,
      "score": 4,
      "context": [
        {
          "id": "i9gynm3",
          "author": "poshpea",
          "body": "I try not to “diagnose” people in my head because I know it’s probably projection, and people can have disordered/unhealthy eating patterns without HAVING an ED, but I guess I do have a radar for it. Like, me and my friends were getting ice cream, and one of the girls got the reduced sugar, dairy free, fruit sorbet. One of my friends was like “Why would you get that, you don’t have any allergies” and she said “Oh, I just like it better…” and I looked at her and she looked at me and I looked at her and raised my eye brow and looked away, lol.",
          "created_utc": 1653153910.0
        }
      ]
    },
    {
      "id": "i9gz6aj",
      "author": "Lady-of-the-Frogs",
      "body": "nah, appearance is sometimes a factor, but people in all varieties of body types have given me The Vibe. And shit, I don't do it consciously and actively try to Not To Do It buts idk spidey senses like another commenter said, if that makes sense?",
      "created_utc": 1653154143.0,
      "score": 3,
      "context": [
        {
          "id": "i9gouhs",
          "author": "crycry_chemtrails",
          "body": "I’m pretty good at picking up on disordered language when talking to people. However, it’s really not ok to assume someone’s ED status based on appearance alone. A) EDs don’t have a look B) not all EDs lead to thinness or involve restriction. Do you really have an “ED radar” or do you have an “anorexia radar”?",
          "created_utc": 1653149438.0
        }
      ]
    },
    {
      "id": "i9hgzqf",
      "author": "onlythisfar",
      "body": "That's a very fair argument and a very fair question. I will admit personally my radar is more sensitive with \"skinny\" people... but it doesn't go off for all smaller people and it also goes off for some larger people so idk.",
      "created_utc": 1653162668.0,
      "score": 1,
      "context": [
        {
          "id": "i9gouhs",
          "author": "crycry_chemtrails",
          "body": "I’m pretty good at picking up on disordered language when talking to people. However, it’s really not ok to assume someone’s ED status based on appearance alone. A) EDs don’t have a look B) not all EDs lead to thinness or involve restriction. Do you really have an “ED radar” or do you have an “anorexia radar”?",
          "created_utc": 1653149438.0
        }
      ]
    },
    {
      "id": "i9gvn9p",
      "author": "Funky_Lesbian",
      "body": "also tbh if they’re queer, especially trans or nb, there’s like a 75% chance they have an eating disorder unfortunately (saying this as a non-binary lesbian lol)",
      "created_utc": 1653152549.0,
      "score": 3,
      "context": [
        {
          "id": "i9gveof",
          "author": "Funky_Lesbian",
          "body": "oh yeah. seeing people’s plates in the dining halls at my college always sets me off. i can’t help but look at what everyone is eating, it’s just second nature at this point. when i see stick thin girls using lettuce for buns, it’s hard not to be triggered lol",
          "created_utc": 1653152442.0
        }
      ]
    },
    {
      "id": "i9no2sb",
      "author": "None",
      "body": "Same here. I personally think my radar is best when it comes to \"skinny\" folks. I think I'm pretty spot on. It makes me sad, especially if the person if a public figure and people look up to them. I'm thinking of one influencer in particular who has made some weird comments in interviews. I don't really get spidey senses for \"overweight\" folks though I am worried one of my friends is really struggling with binging right now. I dont wish this crap on anyone.",
      "created_utc": 1653289208.0,
      "score": 1,
      "context": [
        {
          "id": "i9gouhs",
          "author": "crycry_chemtrails",
          "body": "I’m pretty good at picking up on disordered language when talking to people. However, it’s really not ok to assume someone’s ED status based on appearance alone. A) EDs don’t have a look B) not all EDs lead to thinness or involve restriction. Do you really have an “ED radar” or do you have an “anorexia radar”?",
          "created_utc": 1653149438.0
        },
        {
          "id": "i9hgzqf",
          "author": "onlythisfar",
          "body": "That's a very fair argument and a very fair question. I will admit personally my radar is more sensitive with \"skinny\" people... but it doesn't go off for all smaller people and it also goes off for some larger people so idk.",
          "created_utc": 1653162668.0
        }
      ]
    }
  ]
}