{
  "id": "uwmovl",
  "subreddit": "fuckeatingdisorders",
  "author": "CaePos",
  "created_utc": 1653383922.0,
  "title": "I am not a “special-snowflake” - who would have thought",
  "selftext": "I would have never believed that would happen. \n\nI just ate my “breakfast”, after having a reactive eating episode (due to restriction) late last Night where I emptied more than half a jar of biscoff Creme after a bunch of cornflakes and a chocolate bar. \nAnd I did not compensate for it today. I ate my breakfast and I was for the first time in forever satiated! I did not even thought about getting more food - despite being home alone. Who would have thought that. \n\nLike all of us I thought I am somehow broken and could never get back\nto a place where I would feel contempt with what I ate. \nJust wanted to share that. Maybe it can help some of you get some motivation to eat breakfast as well!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/uwmovl/i_am_not_a_specialsnowflake_who_would_have_thought/",
  "score": 90,
  "num_comments": 5,
  "comments": [
    {
      "id": "i9sgazg",
      "author": "hypermobilehannah",
      "body": "Definitely gives me motivation. Thankyou so much for sharing!",
      "created_utc": 1653386990.0,
      "score": 20,
      "context": []
    },
    {
      "id": "i9svk0k",
      "author": "hoe00",
      "body": "This is really comforting to hear. It’s one of my biggest fears and I think sometimes people make reactive eating/ extreme hunger seem so scary and it puts me off recovery so thank you !",
      "created_utc": 1653397087.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i9tksj4",
      "author": "croutonsinmycoffee",
      "body": "WAY TO GO!! that is progress!\n\nOn another note\n...Biscoff creme in a jar, oooh I didn't know they made this!! Yummy, Jadore the sandwich cookies.",
      "created_utc": 1653408328.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i9swggt",
      "author": "Placeboeff",
      "body": "Thank you so much for sharing! Even the knowledge that many of us believe to be special snowflakes makes it less believable. It wouldn't be such a heavily shared experience if we'd really be this ✨unique ✨.",
      "created_utc": 1653397553.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i9u89wf",
      "author": "CaePos",
      "body": "Can totally recommend. It’s 10/10.",
      "created_utc": 1653418011.0,
      "score": 3,
      "context": [
        {
          "id": "i9tksj4",
          "author": "croutonsinmycoffee",
          "body": "WAY TO GO!! that is progress!\n\nOn another note\n...Biscoff creme in a jar, oooh I didn't know they made this!! Yummy, Jadore the sandwich cookies.",
          "created_utc": 1653408328.0
        }
      ]
    }
  ]
}