{
  "id": "v12oku",
  "subreddit": "fuckeatingdisorders",
  "author": "newprofilewhodis1352",
  "created_utc": 1653924464.0,
  "title": "My dad is the most fucked up person for living with ED I’ve ever even heard of. (Very triggering)",
  "selftext": "About ten years ago he went on this mega diet kick. So he eats paleo or whatever it is. He will not touch a piece of bread, even once a year; he brings his own food to gatherings. He will not eat deserts that aren’t made of coconut flour and 97% dark chocolate. He WILL flip if you even bring a can of coke into the house. Especially if it’s ME, which I’ll elaborate on in a second.\n\nI live at home due to health and economic issues. Moving out is not an option whatsoever right now.\n\nHere’s the deal, my dad was off fucking prostitutes while I was a kid and my mom has had anorexia since forever and was too sick to buy us food. I was starving as a kid, and that developed into a true ED by the time I was 18 or so.\n\nFor five ish years I was so sick that in the end, I was covered in lanugo, my brain didn’t work and I couldn’t walk 1/4 of a mile without having extreme chest pain. I woke up every day to get out of bed and see black and hold onto the wall.\n\nAll I want is for a dad to not leer at and question every meal I eat (I’m serious—he works from home and has a comment for everything I eat, and he has to know what I’m eating, how much I’m eating, etc). I wish he didn’t comment on every single persons weight gain or loss—everytime he sees someone for the first time in a while, the first thing that comes out of his mouth is “they got huge, they blew up” etc. This includes family members and MINOR CHILDREN. He asked my brother how another guy we know looked at a wedding the other day and my brother immediately answered with things regarding his weight, because of course my dad must know if anyone “got fat”. My old friend got diagnosed with cancer and the first thing he asked was “is she still heavy? All she ate was shit when you were kids. Processed food causes cancer.” HOW THE FUCK IS THAT APPROPRIATE! My friend has cancer and you ask about her WEIGHT?!?!\n\nI wish he didn’t bring up my mental health meds and how they “destroy the gut micro biome” whenever he asks about my stomach (I’ve always had stomach issues). One day my mom told him to stop commenting on my meds; within twelve hours he was saying the same shit. I wish he wouldn’t have told me 13758x in the past that I would get diabetes if I ate “that much sugar” when I’d drizzle honey on oatmeal. \n\nI am almost 27 and I have a father who has to come over every time I make lunch to see what I’m making, and then comment on sugar/fat/calorie content. This is the most fucking backwards, idiotic, controlling thing you can do.\n\nI’m really just complaining. Nothing will happen. He is the use to ALWAYS think “I don’t understand why you’re offended by that, so therefore I don’t care and will carry on with my previous actions.”\n\nI can’t even fathom a family that’s even more dysfunctional with food than he is. I’m living in hell with my specific father and anorexia.\n\nBy the way I’ve never in my life been overweight. He is simply an obsessive, condescending narcissist who wants to control the amount and type of food I eat. It’s insanity. I live in the midst of insanity.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/v12oku/my_dad_is_the_most_fucked_up_person_for_living/",
  "score": 146,
  "num_comments": 25,
  "comments": [
    {
      "id": "iakezhf",
      "author": "IamNotABaldEagle",
      "body": "Jesus fucing Christ. I have nothing useful to say but your dad makes me so fucking angry. I'm assuming you can't access therapy or eat away from the house? That man sounds absolutely awful.",
      "created_utc": 1653931960.0,
      "score": 46,
      "context": []
    },
    {
      "id": "iakftb0",
      "author": "Spectrachic311311",
      "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
      "created_utc": 1653932327.0,
      "score": 27,
      "context": []
    },
    {
      "id": "iak1ukw",
      "author": "hornmosapien",
      "body": "Argh. That sounds AWFUL. I’m so sorry you’re in that situation. Your father clearly has serious issues and it must be so frustrating that he won’t even acknowledge the effect they have on others. \n\nI know moving out isn’t an option right now, but maybe you make that your long term goal while coping with the current environment. In the meantime, could you come up with a one-line response that you use every. single. time. he makes a comment? Maybe if you repeat yourself enough and put up an obvious “wall” against that type of behavior, he’ll start to realize he’s not having the effect he’s looking for.\n\nI’m not sure what’s motivating him other than his own deep insecurities, but in general it sounds like it would be best to focus on protecting yourself and distancing yourself from his worldview as much as possible.\n\nThis sounds incredibly hard, but you are posting here because you’re motivated to NOT let your father’s issues continue spilling over into your life, and you’re still pushing forward despite this difficult environment. You’re showing tremendous strength already, so be proud of yourself and keep going! ❤️",
      "created_utc": 1653926171.0,
      "score": 36,
      "context": []
    },
    {
      "id": "iajza5s",
      "author": "Sareeee48",
      "body": "Even if you were “overweight” there’s literally no need for these comments. Other people’s bodies are none of his concern—even if it’s his own children. I’m sorry you’re dealing with all this, it sounds like a shitty situation to be in. You deserve to eat what you want, when you want regardless of his shitty projections. I’m sure you know this, but still.",
      "created_utc": 1653925018.0,
      "score": 26,
      "context": []
    },
    {
      "id": "iakxwpe",
      "author": "OnTheTopDeck",
      "body": "Please, for your own sanity and recovery, get a fridge and microwave in your room. Spend as little time with him as possible. It sounds like a total nightmare, but even as someone without an ED I feel a knot in my stomach just reading your post which makes eating seem unappealing. \n\nI know you will move out as soon as you are able to, but until then you need to create as much physical and mental distance from him as possible. Especially in regards to your eating. \n\nThe beast within me wants to tell you to make a pact with yourself to eat a cake in front of him each time he slates your eating habits, just to piss him off. But, of course that will just cause more problems. \n\nBulk cook healthy tasty foods in the kitchen and reheat in your bedroom microwave. Or prepare fresh ingredients in your room. Take your dishes into the shower with you. Give your body and your mind the nutrition it is screaming out for. Try and associate eating with good things, like your favourite show. Or some sort of ritual that is telling yourself 'I love you'. \n\nAs someone who loves to pieces someone else who has an ED, I cannot imagine saying anything to make them worried or anxious about the food they might eat or their weight. Shame upon your father. You should want your children to be happier and healthier than yourself. \n\nStay away from his toxicity.",
      "created_utc": 1653940653.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iakn3zj",
      "author": "Throwwawayfds",
      "body": "What is wrong with our parents' generation?\nLiterally everyone I know has insane parents to say the least",
      "created_utc": 1653935614.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iakwl29",
      "author": "uxhelpneeded",
      "body": "I think you've got to get out of there to recover. Make a 2 year plan for financial independence and try to immerse yourself in HAES information, including time with a therapist.\n\nHe thinks he can live forever if he just eats the right things. He's wrong. \n\nPut him on an information diet. Don't talk about food with him. If he brings it up, leave the room. Try to watch his sad obsession with pity, from a distance. Imagine being his age and living like that, being obsessed like that. \n\nI bet your ED loves living at home. Because your mom has anorexia, you're at a much higher risk of dying of the disease than other people with anorexia. Take your recovery seriously and throw yourself into it.",
      "created_utc": 1653940034.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iakzoyk",
      "author": "None",
      "body": "Just... god\n\nHe is a narc with orthorexia, sorry you have to live  with him :(",
      "created_utc": 1653941504.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ialt0wd",
      "author": "vensie",
      "body": "I'm so incredibly sorry you're living like this right now and that you grew up in this environment.\n\nAlthough you know, I want to validate the fact that you're living in incredibly abusive environment and your dad is exactly what you said, a narcissist.\n\nYou're an incredible person for surviving all this, and please try to look after yourself the best you can. See a doctor privately, maintain your therapy appointments, plan privately a way/timeframe to move out even into a very cheap apartment (that's what I did, with the help of my partner and the process was way easier than I ever imagined, truly). Like another person here has said, a 2 year plan for financial independence is best if you can't lean on a partner or housemate or unemployment check.\n\nWhen I was in an abusive home up until a year ago, I would have completely resonated with your experience of never being able to relax or calm down or feel safe doing basic things for my health and well-being.\n\nHere's a video on narcissistic parents that helped me contextualise my experience: https://youtu.be/Vjz6rTG3wao",
      "created_utc": 1653956144.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iam31u9",
      "author": "GratuitousEdit",
      "body": "I literally could not get through your entire post. Just reading it. You live this every day of your life? Jesus christ. I don’t know what to say.",
      "created_utc": 1653961265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iam6rt1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1653963174.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iaku31l",
      "author": "ewoksaretinybears",
      "body": "i know this doesn’t help at all, but I am going to +1 for your dad is the crazy one, not you and I’m sorry you have to deal with that. you’re being so strong just by living in that insanity.\n\ndo you have a food plan from a dietician that could possibly tell him to shut up with his uninformed and uneducated opinions?",
      "created_utc": 1653938854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "idgsc2l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1656011192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iamwkvn",
      "author": "SlutForMarx",
      "body": "I would recommend calling Adult Protective Services if you're in the US",
      "created_utc": 1653979995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ianw9nk",
      "author": "libertybells125",
      "body": "I am so sorry. I wish i could say something to help but, god, that sounds awful. I am so sorry.",
      "created_utc": 1654005620.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iakiqa9",
      "author": "newprofilewhodis1352",
      "body": "That was work for a long time but two weeks ago, I was laid off :( so I’m seeing it all over again with me being home during the day. I just hope I find a new job soon because I’m already having trouble not relapsing. Actually, I may have relapsed. Well, probably. I’m eating almost nothing. I cannot get comfortable eating near him. It’s really hard.",
      "created_utc": 1653933640.0,
      "score": 18,
      "context": [
        {
          "id": "iakftb0",
          "author": "Spectrachic311311",
          "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
          "created_utc": 1653932327.0
        }
      ]
    },
    {
      "id": "iajzn1o",
      "author": "newprofilewhodis1352",
      "body": "I don’t know how I’m alive. That’s all I’ll say. It’s a constant barrage. He truly does not care if it hurts. I have told him so many times “it hurts when you mention xyz so please don’t”; he genuinely doesn’t care. It’s truly a case of “why are you so sensitive? I wouldn’t care. So I’ll just keep saying it!” He’s utterly clueless socially, but you can tell a 4 year old “don’t say this, it hurts people” and they can obey. My dad is a certified nut.\n\nAnd you’re right with the weight thing. I just can’t even fathom saying these things to your kid and focusing on peoples weight the way he does. It’s outright bizarre. I swear he gets off on comparing two random people’s body sizes. It’s a weird fixation for him.",
      "created_utc": 1653925181.0,
      "score": 13,
      "context": [
        {
          "id": "iajza5s",
          "author": "Sareeee48",
          "body": "Even if you were “overweight” there’s literally no need for these comments. Other people’s bodies are none of his concern—even if it’s his own children. I’m sorry you’re dealing with all this, it sounds like a shitty situation to be in. You deserve to eat what you want, when you want regardless of his shitty projections. I’m sure you know this, but still.",
          "created_utc": 1653925018.0
        }
      ]
    },
    {
      "id": "iakog66",
      "author": "newprofilewhodis1352",
      "body": "Yeah, I feel like there are more bad parents by far than good. Example: all my friends’ parents. All of them.",
      "created_utc": 1653936224.0,
      "score": 4,
      "context": [
        {
          "id": "iakn3zj",
          "author": "Throwwawayfds",
          "body": "What is wrong with our parents' generation?\nLiterally everyone I know has insane parents to say the least",
          "created_utc": 1653935614.0
        }
      ]
    },
    {
      "id": "iamwrbo",
      "author": "newprofilewhodis1352",
      "body": "Trust me… it’s a fucked situation. It’s so interesting how I’ve found that all my moms old friends HATE him. They called it when they first started dating.\n\nYep, he was out partying and using cocaine and gave my mom herpes during that time from a prostitute (although there were many prostitutes). He wouldn’t fess up for a long time. And I didn’t have food. And my mom was extremely ill to the point where at times she couldn’t get up. I was entirely alone… until now, when my dad breathes down my neck because of FOOD. \n\nI want to kill him with the cancer thing. My 27 year old friend has a very deadly form of cancer and you’re commenting on her weight?!?! It’s like he’s some sort of living parody, not even a real human being, he’s so nuts.\n\nReally, I wonder how I’m still here.",
      "created_utc": 1653980146.0,
      "score": 3,
      "context": [
        {
          "id": "iam6rt1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1653963174.0
        }
      ]
    },
    {
      "id": "ialqgu9",
      "author": "None",
      "body": "he sounds like a narc. it doesnt matter how right someone else ACTUALLY is, they always have to have the last say",
      "created_utc": 1653954808.0,
      "score": 3,
      "context": [
        {
          "id": "iaku31l",
          "author": "ewoksaretinybears",
          "body": "i know this doesn’t help at all, but I am going to +1 for your dad is the crazy one, not you and I’m sorry you have to deal with that. you’re being so strong just by living in that insanity.\n\ndo you have a food plan from a dietician that could possibly tell him to shut up with his uninformed and uneducated opinions?",
          "created_utc": 1653938854.0
        }
      ]
    },
    {
      "id": "idjcpg7",
      "author": "newprofilewhodis1352",
      "body": "I am. I’m ok. Sometimes I just get to the point where I want to blow up about all this. The day I posted this was one of those days. But I’m doing decent. Thank you.",
      "created_utc": 1656060589.0,
      "score": 1,
      "context": [
        {
          "id": "idgsc2l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1656011192.0
        }
      ]
    },
    {
      "id": "iakohag",
      "author": "None",
      "body": "maybe you could meal prep for days ahead and eat them secretly in ur room so he doesn't make unnecessary rude comments about your food? starving yourself is never the solution:( wish you find a better environment to live in soon💙",
      "created_utc": 1653936238.0,
      "score": 10,
      "context": [
        {
          "id": "iakftb0",
          "author": "Spectrachic311311",
          "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
          "created_utc": 1653932327.0
        },
        {
          "id": "iakiqa9",
          "author": "newprofilewhodis1352",
          "body": "That was work for a long time but two weeks ago, I was laid off :( so I’m seeing it all over again with me being home during the day. I just hope I find a new job soon because I’m already having trouble not relapsing. Actually, I may have relapsed. Well, probably. I’m eating almost nothing. I cannot get comfortable eating near him. It’s really hard.",
          "created_utc": 1653933640.0
        }
      ]
    },
    {
      "id": "iakiee1",
      "author": "TerrifyinglyAlive",
      "body": "The petty in me wants you to start telling him he's boring.  \"You're so boring, do you ever think or talk about anything else?  Why are you so boring?  You have like one dimension.  Seriously, get a hobby.\"",
      "created_utc": 1653933490.0,
      "score": 14,
      "context": [
        {
          "id": "iajza5s",
          "author": "Sareeee48",
          "body": "Even if you were “overweight” there’s literally no need for these comments. Other people’s bodies are none of his concern—even if it’s his own children. I’m sorry you’re dealing with all this, it sounds like a shitty situation to be in. You deserve to eat what you want, when you want regardless of his shitty projections. I’m sure you know this, but still.",
          "created_utc": 1653925018.0
        },
        {
          "id": "iajzn1o",
          "author": "newprofilewhodis1352",
          "body": "I don’t know how I’m alive. That’s all I’ll say. It’s a constant barrage. He truly does not care if it hurts. I have told him so many times “it hurts when you mention xyz so please don’t”; he genuinely doesn’t care. It’s truly a case of “why are you so sensitive? I wouldn’t care. So I’ll just keep saying it!” He’s utterly clueless socially, but you can tell a 4 year old “don’t say this, it hurts people” and they can obey. My dad is a certified nut.\n\nAnd you’re right with the weight thing. I just can’t even fathom saying these things to your kid and focusing on peoples weight the way he does. It’s outright bizarre. I swear he gets off on comparing two random people’s body sizes. It’s a weird fixation for him.",
          "created_utc": 1653925181.0
        }
      ]
    },
    {
      "id": "ial9fux",
      "author": "clumsycouture",
      "body": "I’m so sorry your dad is like that. My dad is kinda similar but not as extreme. He intuitively eats my whole life, but not big meals and he used to comment on how much I would eat ALL the time. He’d call me fat basically and compare me to my slim sister. I had to basically move back home last year for 5 months and by the end I had resorted to hiding food while he napped and brought it only bedroom (mind you I’m THIRTY!) everytime I would get something to eat he’d say something like “your eating again” and he always comments on other peoples weight. Mainly only women though, he was never controlling though and showered me with love he just fucked me up a little bit in thinking that only thin women are attractive. Honestly I could never live with him, 5 months was long enough. I love him but we are so much closer when we aren’t living in the same house. I definitely fought with him more than my sister, best advice is get out as soon as you can.",
      "created_utc": 1653946167.0,
      "score": 2,
      "context": [
        {
          "id": "iajza5s",
          "author": "Sareeee48",
          "body": "Even if you were “overweight” there’s literally no need for these comments. Other people’s bodies are none of his concern—even if it’s his own children. I’m sorry you’re dealing with all this, it sounds like a shitty situation to be in. You deserve to eat what you want, when you want regardless of his shitty projections. I’m sure you know this, but still.",
          "created_utc": 1653925018.0
        },
        {
          "id": "iajzn1o",
          "author": "newprofilewhodis1352",
          "body": "I don’t know how I’m alive. That’s all I’ll say. It’s a constant barrage. He truly does not care if it hurts. I have told him so many times “it hurts when you mention xyz so please don’t”; he genuinely doesn’t care. It’s truly a case of “why are you so sensitive? I wouldn’t care. So I’ll just keep saying it!” He’s utterly clueless socially, but you can tell a 4 year old “don’t say this, it hurts people” and they can obey. My dad is a certified nut.\n\nAnd you’re right with the weight thing. I just can’t even fathom saying these things to your kid and focusing on peoples weight the way he does. It’s outright bizarre. I swear he gets off on comparing two random people’s body sizes. It’s a weird fixation for him.",
          "created_utc": 1653925181.0
        }
      ]
    },
    {
      "id": "iakosoy",
      "author": "newprofilewhodis1352",
      "body": "I think part of it is so subconscious. I feel like if I’m at home, I cannot eat. It’s been years of this so it’s deeply engrained in me. And I know if he says one thing on one of my bad days, it could be a blow out, screaming match. \n\nI just don’t understand. I’ve communicated to him that it hurts, and why it hurts, and he does not care.",
      "created_utc": 1653936381.0,
      "score": 10,
      "context": [
        {
          "id": "iakftb0",
          "author": "Spectrachic311311",
          "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
          "created_utc": 1653932327.0
        },
        {
          "id": "iakiqa9",
          "author": "newprofilewhodis1352",
          "body": "That was work for a long time but two weeks ago, I was laid off :( so I’m seeing it all over again with me being home during the day. I just hope I find a new job soon because I’m already having trouble not relapsing. Actually, I may have relapsed. Well, probably. I’m eating almost nothing. I cannot get comfortable eating near him. It’s really hard.",
          "created_utc": 1653933640.0
        },
        {
          "id": "iakohag",
          "author": "None",
          "body": "maybe you could meal prep for days ahead and eat them secretly in ur room so he doesn't make unnecessary rude comments about your food? starving yourself is never the solution:( wish you find a better environment to live in soon💙",
          "created_utc": 1653936238.0
        }
      ]
    },
    {
      "id": "iakpkf2",
      "author": "None",
      "body": "i think it's already too late/impossible to change him now. his views and mindset is already so fucked it's only making your situation worse. (honestly CANNOT believe how he says all that💀) the best thing to do as of now is to move out ASAP, maybe find a new job (although it's easier said than done) or find a friend who you trust and live in their house until you can afford to move out on your own. if I were in ur shoes, I doubt I would be able to eat in that type of toxic environment either.",
      "created_utc": 1653936738.0,
      "score": 6,
      "context": [
        {
          "id": "iakftb0",
          "author": "Spectrachic311311",
          "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
          "created_utc": 1653932327.0
        },
        {
          "id": "iakiqa9",
          "author": "newprofilewhodis1352",
          "body": "That was work for a long time but two weeks ago, I was laid off :( so I’m seeing it all over again with me being home during the day. I just hope I find a new job soon because I’m already having trouble not relapsing. Actually, I may have relapsed. Well, probably. I’m eating almost nothing. I cannot get comfortable eating near him. It’s really hard.",
          "created_utc": 1653933640.0
        },
        {
          "id": "iakohag",
          "author": "None",
          "body": "maybe you could meal prep for days ahead and eat them secretly in ur room so he doesn't make unnecessary rude comments about your food? starving yourself is never the solution:( wish you find a better environment to live in soon💙",
          "created_utc": 1653936238.0
        },
        {
          "id": "iakosoy",
          "author": "newprofilewhodis1352",
          "body": "I think part of it is so subconscious. I feel like if I’m at home, I cannot eat. It’s been years of this so it’s deeply engrained in me. And I know if he says one thing on one of my bad days, it could be a blow out, screaming match. \n\nI just don’t understand. I’ve communicated to him that it hurts, and why it hurts, and he does not care.",
          "created_utc": 1653936381.0
        }
      ]
    },
    {
      "id": "iakpytn",
      "author": "newprofilewhodis1352",
      "body": "I appreciate you for saying that. My mom thinks he can “change” but she’s never been honest to herself about his character. Even every single one of my mom’s old friends hate him, and they’ve all told me that. He’s a narcissist, and I’ve had several therapists near-confirm it for me. My current therapist has been amazing and she had ED and two parents with ED too. But yeah, when I write it all down (writing is so therapeutic for me), I realize that he is really, really not right in the head. This isn’t a little weight shaming or misunderstanding (both of which are still awful), it’s a pervasive obsession regarding food and weight and anyone around him. It’s really off.",
      "created_utc": 1653936918.0,
      "score": 7,
      "context": [
        {
          "id": "iakftb0",
          "author": "Spectrachic311311",
          "body": "I know you can’t move out right now but holy shit, that is such a toxic environment. I would try to leave when you can. Are there any friends or relatives who are safe places to eat with? So at least you won’t be subjected to his shitty comments while you eat?",
          "created_utc": 1653932327.0
        },
        {
          "id": "iakiqa9",
          "author": "newprofilewhodis1352",
          "body": "That was work for a long time but two weeks ago, I was laid off :( so I’m seeing it all over again with me being home during the day. I just hope I find a new job soon because I’m already having trouble not relapsing. Actually, I may have relapsed. Well, probably. I’m eating almost nothing. I cannot get comfortable eating near him. It’s really hard.",
          "created_utc": 1653933640.0
        },
        {
          "id": "iakohag",
          "author": "None",
          "body": "maybe you could meal prep for days ahead and eat them secretly in ur room so he doesn't make unnecessary rude comments about your food? starving yourself is never the solution:( wish you find a better environment to live in soon💙",
          "created_utc": 1653936238.0
        },
        {
          "id": "iakosoy",
          "author": "newprofilewhodis1352",
          "body": "I think part of it is so subconscious. I feel like if I’m at home, I cannot eat. It’s been years of this so it’s deeply engrained in me. And I know if he says one thing on one of my bad days, it could be a blow out, screaming match. \n\nI just don’t understand. I’ve communicated to him that it hurts, and why it hurts, and he does not care.",
          "created_utc": 1653936381.0
        },
        {
          "id": "iakpkf2",
          "author": "None",
          "body": "i think it's already too late/impossible to change him now. his views and mindset is already so fucked it's only making your situation worse. (honestly CANNOT believe how he says all that💀) the best thing to do as of now is to move out ASAP, maybe find a new job (although it's easier said than done) or find a friend who you trust and live in their house until you can afford to move out on your own. if I were in ur shoes, I doubt I would be able to eat in that type of toxic environment either.",
          "created_utc": 1653936738.0
        }
      ]
    }
  ]
}