{
  "id": "v1mzly",
  "subreddit": "fuckeatingdisorders",
  "author": "Elena_778",
  "created_utc": 1653992163.0,
  "title": "Why was I so much more confident when restricting? Has anyone experienced this or has answers how to base self esteem on something else? 🥰",
  "selftext": "",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/v1mzly/why_was_i_so_much_more_confident_when_restricting/",
  "score": 94,
  "num_comments": 12,
  "comments": [
    {
      "id": "ianh42c",
      "author": "None",
      "body": "Playing roller derby helped me a lot with treating my body better than an evil flesh sack tethering me to this awful world. My thought process was literally just, \"oh wow, this is fun! I guess I need to take care of my body so I can keep playing and improve my skills\". And from there my self confidence improved a lot because I started putting my energy into something I was passionate about instead of restricting.",
      "created_utc": 1653997314.0,
      "score": 24,
      "context": []
    },
    {
      "id": "iaokbh7",
      "author": "Thegr4veofallhope",
      "body": "Because eating disorders are notorious for giving you not only a false sense of control, but also a false confidence. You were sick, you weren't confident or in control, You were ill + the disorder was just doing what it does. When you're fully recovered without a care in the world is when you'll feel that real confidence and it'll shine so bright, it won't be there straight off the bat and it may take a while to get comfy into your skin again, but after some time and healing, you'll get there.",
      "created_utc": 1654016100.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iaozugg",
      "author": "Coffeegreysky12",
      "body": "restricting doesn't really make you more confident though. it's an illusion. it's a false sense of confidence and a false sense of security that you feel when you are restricting. you may feel good at first, but that wears off very quickly, and then when you restrict, you feel pain and misery. and yet it's so hard to stop. that's why eating disorders have such high relapse rates and poor recovery rates",
      "created_utc": 1654022610.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iaps3f1",
      "author": "hcpenner",
      "body": "This isn't advice, but I think it's interesting that so many people can relate to this experience, because I've kind of had the opposite. I had moments of \"confidence\" in restriction (more like a false & disordered sense of accomplishment), but I mostly HATED my appearance and spent wayyy more time worrying about it than I do now. I still have bad days, yes, but once I got past the initial stages of weight restoration, the eating disorder thoughts really did get quieter for me. The bad body image is less all-consuming now—I experience it in passing storms instead of as a constant downpour, if that makes sense.\n\nI'm still not someone with a great self-esteem, but my self-esteem revolves around much more than my body now. I really benefited from treatment in a group setting—among many other things, it helps to hear about your strengths & good qualities from people who have similar experiences.\n\nYou have so many things that make you unique and wonderful, I promise. It will get easier to recognize these positive qualities over time!",
      "created_utc": 1654035603.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ianciqq",
      "author": "toolkitpsd",
      "body": "me too 🥰🥰🥰",
      "created_utc": 1653994057.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iao98dy",
      "author": "stopquaking",
      "body": "It can make you feel in control when you lack control in your external environment.",
      "created_utc": 1654011403.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iaohsn6",
      "author": "rxjen",
      "body": "Because absolutely nobody’s input matters than you. And I want to get back there so badly",
      "created_utc": 1654015042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iancsg2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1653994262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaov9dp",
      "author": "Queenofwands1212",
      "body": "Yeah I actually  have body confidence when I restrict.",
      "created_utc": 1654020672.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaq9byc",
      "author": "libertybells125",
      "body": "while logically i know my depression was getting worse with the more weight i lost, it still made me happier than i am now (not in recovery but not at my LW). i thrived off the euphoric feeling the ED provided and all i know is that everything felt so much worse once i put on a little weight. i felt more confident when i was at lower weights, even though i wore baggy clothes still. it’s mind boggling but i feel better and safer with my ed…",
      "created_utc": 1654043859.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaq8juu",
      "author": "Low_Big5544",
      "body": "This is what I don't get right, when it comes to confidence people say fake it til you make it, but when it it's disordered behaviour suddenly that confidence doesn't count? How is it any less real than 'faking it til you make it'? And how is the sudden lack of that behaviour any less of a real blow to confidence? \n\nIdk if that makes any sense, my brain is foggy beyond belief. Not meaning to be antagonistic at all just genuinely curious how you can simultaneously be told fake confidence is a stepping stone to real confidence *and* ED confidence doesn't count and you only get \"real\" confidence in recovery",
      "created_utc": 1654043479.0,
      "score": 2,
      "context": [
        {
          "id": "iaokbh7",
          "author": "Thegr4veofallhope",
          "body": "Because eating disorders are notorious for giving you not only a false sense of control, but also a false confidence. You were sick, you weren't confident or in control, You were ill + the disorder was just doing what it does. When you're fully recovered without a care in the world is when you'll feel that real confidence and it'll shine so bright, it won't be there straight off the bat and it may take a while to get comfy into your skin again, but after some time and healing, you'll get there.",
          "created_utc": 1654016100.0
        }
      ]
    },
    {
      "id": "ianf6nm",
      "author": "melkiaa",
      "body": "Sorry but I'm not sure this is the right advice to give in a recovery sub. The point is not to promote further restriction.",
      "created_utc": 1653996014.0,
      "score": 16,
      "context": [
        {
          "id": "iancsg2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1653994262.0
        }
      ]
    },
    {
      "id": "iarl98q",
      "author": "Thegr4veofallhope",
      "body": "Because you're using that disorder to conceal, you aren't faking it until you make it with a disorder, you're harming yourself and concealing something or avoiding something, confidence generally also involves an ability to face things on, you aren't doing that when you're starving yourself.\n\nEdit: Extra information;\n\nConfidence isn't just about liking how you look, and thats what your ed focuses that confidence on 99% of the time, and eventually as you get sicker you actually LOSE more of that confidence than you gained in the first place.",
      "created_utc": 1654074270.0,
      "score": 1,
      "context": [
        {
          "id": "iaokbh7",
          "author": "Thegr4veofallhope",
          "body": "Because eating disorders are notorious for giving you not only a false sense of control, but also a false confidence. You were sick, you weren't confident or in control, You were ill + the disorder was just doing what it does. When you're fully recovered without a care in the world is when you'll feel that real confidence and it'll shine so bright, it won't be there straight off the bat and it may take a while to get comfy into your skin again, but after some time and healing, you'll get there.",
          "created_utc": 1654016100.0
        },
        {
          "id": "iaq8juu",
          "author": "Low_Big5544",
          "body": "This is what I don't get right, when it comes to confidence people say fake it til you make it, but when it it's disordered behaviour suddenly that confidence doesn't count? How is it any less real than 'faking it til you make it'? And how is the sudden lack of that behaviour any less of a real blow to confidence? \n\nIdk if that makes any sense, my brain is foggy beyond belief. Not meaning to be antagonistic at all just genuinely curious how you can simultaneously be told fake confidence is a stepping stone to real confidence *and* ED confidence doesn't count and you only get \"real\" confidence in recovery",
          "created_utc": 1654043479.0
        }
      ]
    }
  ]
}