{
  "id": "v8xot4",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1654829312.0,
  "title": "have any of you almost died from anorexia? TW",
  "selftext": "if so, could you tell me about the health complications you had? I’m trying to scare myself into sticking with recovery",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/v8xot4/have_any_of_you_almost_died_from_anorexia_tw/",
  "score": 150,
  "num_comments": 51,
  "comments": [
    {
      "id": "ibtcnwj",
      "author": "wendy125",
      "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
      "created_utc": 1654832310.0,
      "score": 212,
      "context": []
    },
    {
      "id": "ibtp4d8",
      "author": "-_Hayley_-",
      "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
      "created_utc": 1654840441.0,
      "score": 143,
      "context": []
    },
    {
      "id": "ibtgbxm",
      "author": "Philocalist_Cat",
      "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
      "created_utc": 1654834520.0,
      "score": 103,
      "context": []
    },
    {
      "id": "ibtdi4m",
      "author": "kayethx",
      "body": "My blood pressure was dangerously low, and just standing up would bring my heart rate to 145. I got super weak and dizzy all the time; sometimes I would have to just immediately sit on the floor after getting out of bed because of it. My body temp would drop to around 96 degrees, and when it would, I would be totally zoned out and distant and slow mentally - it felt so bizarre. My period almost disappeared. And my hair started turning white from the ends up. Got hit with mild refeeding syndrome too - my body was so not used to eating that when I did, i would get really dizzy, my heart rate would go crazy high, and I literally would not be able to breathe (I could only get the most shallow breaths) for like 2-3 hours; I would have to lie on my side, sometimes on a cold floor, and not speak or move and concentrate solely on trying to breathe (thought it was panic attacks but it wasn't 😭). EMT friend confirmed I came very very close to dying. \n\nYou can get better. I've improved so so so much this year - I know you can too. We're all here for you.\n\nEDIT: Typo",
      "created_utc": 1654832794.0,
      "score": 55,
      "context": []
    },
    {
      "id": "ibtbv8w",
      "author": "None",
      "body": "My heart almost failed and has permanent damage now.",
      "created_utc": 1654831844.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ibti60t",
      "author": "sandopsio",
      "body": "Hmm, I want to offer something genuinely helpful and I know EDs can get really tricky and lie to us (my ED has told me at various times that I \"just needed to hit rock bottom and *then* I could recover\" or wished I was this girl who got \"more sympathy\" who, within the same year that my ED was jealous of her ED, passed away…and she was freaking sweet and talented and young and deserved a life, her family deserved for her to recover, it's tragic). I know my ED could read health complications and a part of me could want them to scare me into recovery but my ED could also use them as reasons it's \"not that bad\" and can continue, or it's \"different because \\[insert excuse here\\].\" Let me just say a few things that might help motivate you to fight as har as you can for recovery. One is that life goes by fast. It's easy to think we have time to recover and then one day, all of this time just went by that we miss. It's okay to not know what we want in life, but we deserve a chance to experience the things we end up knowing we love, that we don't know about yet, if that makes sense. I had the worst depression and couldn't experience joy from my number one passion let alone ever imagine I'd find a passion I didn't yet know at the time. It was hard to motivate myself in treatment, because I was scared and uncomfortable and didn't know what I wanted, felt lost and trapped and without a clear direction. A part of me wanted to \"keep my body alive incase I ever want it\" and I literally journaled that, but I didn't know what for.  \n\n\nThings I wish I did differently…I wish I took care of my teeth, my bones (both can seem fine and then suddenly it all catches up), didn't go through terrifying heart complications that can happen to any of us unexpectedly, etc. There's no rock bottom and there's no worst ED or \"sick enough\" that suddenly makes recovering easier. Every person my ED was jealous of is gone now and much too young. I feel sick even saying that word, but I admit that even if only for a moment, it was, it's part of the heinous disease. You have to recover for you. It's okay to do it for other people along the way, but in the end we're the person we have to do it for. And we have to believe ourselves, trust ourselves and remind ourselves how serious it is, because it will try to mess with our minds and tell us any lie to go back to it.",
      "created_utc": 1654835669.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ibu79yo",
      "author": "nitrogenbubbles",
      "body": "I joined this sub years ago for a very close friend who had an ED. I was so terrified for her and with no clue to help her, this was one of the things I tried to do, to understand her better.\nShe had seizures very often. We could never be sure if the ED caused that or it was something altogether.\nShe passed away in February. She had a seizure, hit her head and never woke up. Her body had nothing to fight with, because of the ED. \nYou might have a direct consequence of the ED, as shared by others here, or you may have an indirect one where your body is so weak that it could not survive any possible trauma. \n\nI wish you luck and love in your journey. You are loved and I am proud of you for trying. I wish you the best of health and I'm sure you'll make a full recovery soon.",
      "created_utc": 1654855994.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ibtoztq",
      "author": "None",
      "body": "Mind you I'm at a normal weight but lost over 25% of my body mass recently.\nBesides the hair loss, feeling weak all the time and because of that sleeping a lot and my lips / fingernails turning blue sometimes other things happened to me.\nMost of the time I get dizzy and can't see anymore when I stand up, but sometimes it gets to the point when I loose consciousness and even when I'm present I can't see, hear or do anything other than lie down anymore. In addition to that I feel super sick and the first time it happened I honestly felt like I was dying.\nI never went to the hospital, because my mom didn't think calling an ambulance was necessary and no hospital will take me as a non emergency, because my BMI is still in the normal range.\nI'm in recovery now and it doesn't happen as frequent anymore and I'm glad that it doesn't look like I'm gonna have permanent damage.\nMy story may be not as dramatic as some others but believe me even my experience was so shitty that I don't wish it on anyone.",
      "created_utc": 1654840348.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ibtztzh",
      "author": "BadInconsequence",
      "body": "I had a minor heart attack at work lol… it was kinda terrifying but at the same time I was so messed up mentally by the ED that I didn’t feel very much emotionally about that actual situation - except that I didn’t want to tell anyone at work because I wanted to protect the ED. I remember just knowing/feeling like around that time I was going to die but being like ok this is it for me. My heart rate was at 30bpm regularly. \n\nShortly after I was told I had bad osteoporosis and had become premenopausal so essentially all my hormones were freaking out & I felt like dick 99% of the time.\n\nTrust me - it’s worth it even though the thoughts are hard they just become less loud and life becomes more fun.\n\nI remember along the timeline of beginning to eat more I finally had a panic attack because I realised how much damage I had done to my health and I could finally emotional feel the weight of what had been going on. I don’t want to hurt myself and hurt others by losing all of my relationships like that again. It’s a sad decline.",
      "created_utc": 1654849281.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ibt9mft",
      "author": "PreparationStock3274",
      "body": "I was consistently hypoglycemic and had a heart murmur. I’d go to bed with palpitations and hope I’d wake up again. Weight gain saved my life.",
      "created_utc": 1654830592.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ibuofi2",
      "author": "mouseyfields",
      "body": "I made the mistake of reading everyone else's comments before I made my own - I stupidly wasn't prepared for the onslaught of emotions and dose of reality - so this isn't going to be as ~~long~~ (lol this still ended up long I'm sorry) or as meaningful as I was planning. I'm sorry. I wanted this to be much more succinct for you, but it's probably going to be a jumbled mess because my brain is also a jumbled mess. (to be clear, the other comments aren't bad - they're amazing! But they hit close to home and I hadn't prepared my emotions, something that I absolutely should have done. I want to thank EVERYBODY for your stories. I'm going to be holding them all, and you all along with them, for as long as I can.)\n\n\nTo put it bluntly: my heart is fucked. I have done irreparable damage. I'm on medication, but because I'm not even close to being in recovery, the medication dose has to be adjusted frequently. It just stops working every couple of months. My cardiologist wants me to change meds, but my extremely unwell brain won't let me do it because it *might* cause weight gain. Because weight gain is worse than my failing heart, apparently /s (**it's not worse. I *should* be choosing to change meds. I *should* be choosing a healthy heart. I *should* be choosing fucking weight gain. Don't be like me.**)\n\n\nSo my heart just keeps getting sicker, along with the rest of me. Any sort of movement, and my heart rate goes to the 140s. Standing up and/or walking, 150s. If I try to run or do anything more strenuous than walking, it decides that the 180s or higher is where it's at. Then it takes literally hours for it to come back down. Sometimes, if it gets too high or it takes too long to come down, it makes me vomit. \n\n\nHeart palpitations. Fainting. BP problems. Bradycardia at random times too, because apparently my heart can't only exist at one end of the extremes. \n\n\nAmbulance rides and hours in emergency because my heart is shitting itself and making me cold and sweaty and pale. Markers in my blood that indicate bad things are happening, but choosing to leave emergency and \"wait and see\" instead of getting the scans I realistically know I need, and then justifying it to myself because the D Dimer levels were only \"slightly\" high so it's fine. \n\n\nIf dying doesn't actively happen by my own hand, I'm sure it will be my heart that gets me. Even if I was in recovery, which I am very much not, my cardiologist has made it pretty clear that my heart cannot heal anymore. The best I can hope for is doing no more damage, but we both know that's probably not going to happen either. \n\n\nAs far as I'm concerned, my heart crapping out is not a matter of *if* - it's a matter of *when*.\n\n\nI haven't told the people in my life who know about my ED how bad my heart is. They know it has problems, but they don't know it's irreparable. They don't know how rapidly it's been getting worse. They don't know I'm refusing to try the medication that will probably help slow down the damage because I'm too fucking scared of gaining weight. They don't know, and I don't want them to know. I can't bring myself to make the choice to tell them because then all they'll have is the burden of knowing my body is failing without any hope of undoing the damage that has been done. \n\n\nI don't know how much longer my heart will last, but I do know it's not going to get me to any significant age. It may have somehow got me to 30, but, to be honest, I doubt it'll get me much further.\n\n\nI also want to say one more thing. You don't have to be severely underweight for an extended period of time to become this unwell. You can become this unwell and never even get to underweight. My lowest BMI was (no specifics, just ranges under spoilers) >!between 13 and 15!<, and I was there for less than a year. I've mow been underweight for quite some time (but aside from that one time, never below >!between 16.5 and 18!<), but I have spent far, far, *far* longer with a \"healthy\" BMI. My heart problems started being bad enough for medication and a regular cardiologist when I was a \"healthy\" weight and a while before the period where I was at my lowest - but healthy weights don't mean healthy behaviours or healthy bodies.\n\n\nTo reiterate: **bad stuff happening to your body, the stuff that is part of why EDs have such a high mortality rate, can happen no matter what weight you are. Even if you think you're fine because you're not severely severely underweight, even if you're trying to convince yourself your fine, if you are engaging in unhealthy behaviours *you are going to be doing damage to your body*. Don't assume you're not just based on your weight, because it's entirely likely you'd be wrong.**\n\n\nDon't be like me - do *better* than me. You don't have to let your eating disorder take the wheel.\n\n\nAs an aside - while not life threatening, lanugo fucking sucks. I don't particularly enjoy being fuzzy (although my fuzz looks less like fuzz and more just like really fine, but long, body hair now), especially not now it's bad enough for randoms to start noticing and commenting on, even if they're at a distance from me. But.. It's just another in a long line of shit I've forced, by way of my eating disorder, my body to do/become. Lanugo is not a joyful part of this disorder. You can also get lanugo at a \"healthy\" weight - just sayin'.\n\n\nDo better than I've done. You don't have to end up where I am. I know it's scary, but it's okay to recover - it'll be scarier to not recover and end up where I am.\n\n\nMake the decision to put the health of your body before your ED. It won't be easy, it won't even be linear, but it will be worth it. Your ED doesn't have to win. Choose the health of your body.",
      "created_utc": 1654866997.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ibumf1y",
      "author": "kryptoday",
      "body": "I know five girls that have died from anorexia who I met over various inpatient treatments.\n\nI think all but one died from a heart attack (or other heart issue). The other had diabetes and died from complications from that. \n\nBefore death, from what I could see on social media, they were not living happy lives.",
      "created_utc": 1654865959.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ibtc3i1",
      "author": "elagalaxy",
      "body": "My resting heart rate got down to 38 at my worst. I had no period so I was at high risk of osteoporosis (still have to do a scan). I got covid and I’m honestly surprised I survived. I’ve been in serious recovery for 2 months and my resting heart rate is up to 50 and my body is slowly mending. Weight gain is life saving and the only path to survive.",
      "created_utc": 1654831977.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ibvvoom",
      "author": "kittycatalysis",
      "body": "Meeeee. I had a panic attack eating a Danone 0% Greek yoghurt because it was “off plan” and went into what I believe was a cardiac arrest (I wasn’t told, but I was hooked up to a hell of a lot of wires and drips as soon as I was taken to hospital). I don’t know how the hospital let me get away with not eating anything for two days other than some melon. And the only things I asked my parents to bring to the hospital were my running shoes and leggings so I could run home from the hospital to my hometown as soon as I was allowed out (which I assumed would be a day max) 🤡🤡\n\nIt was not in fact one day. It was one year. And thankfully I did not run home from the inpatient I was transferred to once my bloods and heart were stable enough. And even when that happened, when my heart rate was in the high 20s overnight and I overheard the e staff questioning whether I would make it through the night, according to my clown brain I was STILL NOT SICK ENOUGH. Fuck me if I could go back and both bitch slap myself and give myself a massive cuddle I would. I was sick enough - and I was worthy of recovering, of a life and having a personality outside of food and exercise.",
      "created_utc": 1654885684.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ibu9t5o",
      "author": "MethodOfYeetus",
      "body": "it got to the point where I would go to sleep not knowing if I'd wake up the next day. I had frequent heart palpations, shortness of breath, and fainting spells. I was about to give my life to my ed at 16. the worst part is I didn't care. Everyday was centered around my eating disorder, so much so I didn't see the point to living. It was only when I told my best friend about the severity of my disorder did it make me realize people cared about me and would be crushed if I died.\n\nPlease, please, please stay committed to recovery. The first part starts with being committed to life, free of an eating disorder. If you can't promise yourself that, promise it to another person who deeply cares about you.",
      "created_utc": 1654858012.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ibuz8tj",
      "author": "TooExcitable",
      "body": "i've seen my heart rate as low as 40 BPM while awake. being hooked up to a machine while i slept inpatient was ironically comforting because i was always afraid my heart would just stop beating in the middle of the night.",
      "created_utc": 1654871976.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ibwdw6k",
      "author": "None",
      "body": "It's been commented in this thread before, but lack of energy and focus derived from anorexia can put you in very dangerous situations. I developed my ED while I was away at college. A couple times I blacked out just from waking up from my bed. I remember once feeling it coming and, barely conscious and losing my vision, munching an apple that was on my night table and hoping it would make the heavy sensation it go away. Didn't work, fainted on my way back from the bathroom because I didn't want to pee on myself. It was always scary, but another time I fell very near my iron bedframe. It dawned on me that the fall could have broken my neck and none would have noticed, since I was very much alone. ED voice was put to sleep for some time after that, but I relapsed with full force a couple of years ago. My resting heart rate was as low as 40, thought it was because \"sporty\"; my mind was fucked and I would cross streets without looking and, on one ocassion, almost run on by a car while I was busy body checking me on a crystal wall at the other side of the street. During lockdowns I worked out so much that my brother half joked that he was afraid he will find me on the floor one day; once I was doing exercises lying down and he frantically ran to me. My dad would wake up in the middle of the night, \"negotiate\" with me for \"just\" 30 minutes more of exercise and appear exactly at the end of that time frame, not a second more, to see I was getting in bed. On the rare ocassion I felt compelled to have a bit more of food my mom would gently encourage me while the whole family stared at my quietly, as if not wanting to \"scare\" me and \"spoil\" the moment. I was dying before their eyes.\nDon't do this. The ED just wants one thing of you, and it's no good. Don't hear that bitch. Being her slave is much much worse than gaining weight, and  despite their lies it will never grant you freedom or happiness, I promise.",
      "created_utc": 1654893772.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ibteug9",
      "author": "KookieBubbles",
      "body": "I did, my sister had to rush me to the hospital I couldn’t stop puking up acid I didn’t eat anything literally only drank water and was spitting up this yellow foaming acid that burned like heck. I get to the hospital and can no longer walk  turns out my potassium was extremely low. I get transferred to another hospital, and I have the EMT guy pick me up and put me in my bed which was so embarrassing as my butt was hanging out my gown. Was only there for a month and some change. Had a PICC line hooked up to me, think my blood sugar was low don’t know really as most of it was blur. My sister said I looked like death walking it scared the crap out of her. Once I got out didn’t have a period for some months. I gained weight but I can not eat like I use to I get terrible reflux and stomach pain.  Also forgot to add I was very short of breathe and the nurses had to force me to walk using these handle bars I felt terrible really dizzy nauseous the thing they had me hook to I had to drag it around the room, I couldn’t make it to the bathroom without my sisters help nurses were getting annoyed by me at that point. It was so embarrassing having strangers watch me pee being so helpless I felt so weak and lonely.  The nurses loved to remind me on repeat I was their youngest patient there, I felt like they were reminding me on repeat I did this to myself and I’m taking up space for someone who had no choice. I am getting wayyyyy off focus anyway please don’t end up like me or anyone else here throwing up acid is not pleasant!!!!!",
      "created_utc": 1654833607.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ibw2q9v",
      "author": "uxhelpneeded",
      "body": "Anorexia has a 40% fatality rate, and a much higher permanent damage rate",
      "created_utc": 1654888799.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ibwb94j",
      "author": "operaling",
      "body": "The first time I was hospitalized, it took 4 attempts between 2 nurses to get an IV in because they couldn’t find my veins. I had a giant bruise on my hand for 2 weeks after that because my body couldn’t heal properly. \n\nOne time during a big relapse, I fainted while getting out of the car; if my mom hadn’t been in a position to catch me, I probably would have cracked my head on the pavement. I was 14. This also happened not long after I had eaten, so it was just malnourishment showing its enduring effects. \n\nLater that year, I spent a day of my Thanksgiving vacation in the ER. Then, instead of getting to come home after said vacation, I was taken to the ER at the hospital on the way back. They gave me a glucose IV and when it went in, my entire body felt like it was on fire. I began convulsing in the hospital bed as if I were being electrocuted. Later that night, I watched as my heart rate dipped below 30.\n\nSince then, I’ve gone through periods of time where I could pull handfuls of hair out of my head; I’ve watched my fingers first turn blue and then lose circulation entirely despite being in warm weather; I’ve had to wear a heart monitor while trying to socialize like a normal person in college; I’ve nearly passed out while driving, exercising, teaching a class. By my early 20s, I had the bone density of an old woman. Even when the physiological effects weren’t immediately apparent, all other aspects of my life were under threat. The ED has torn apart my relationships with family, friends, and partners. Hell, even other people’s pets act weirdly around me when I’m relapsing.\n\nThe way I see it, recovery is a lot like quitting cigarettes. The longer you delay it, the more difficult it will get; the disorder will consume your entire life and wreak havoc on your body, ultimately sending you to an early grave. And for what, a feeling of control? That feeling is purely an illusion. If it does kill you, are you really the one in control in the end?",
      "created_utc": 1654892574.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ibuvqyw",
      "author": "glowingstar444",
      "body": "Idk if I was gonna die cause this was a little under a year into my ed but I got hospitalized cause I was at. abmi of 15 and i collapsed at school and home and had hella heart palpitations. I was only 14. The destruction it does to your mental health is also terrible. You'll lose all interest in life. My ed contributed to me being so fucking boring, I'm in a fonstant state of anhedonia and I dont even have energy to maintain friendships. Its due to other stuff too but my ed definitely contributes to this. Its just hell. If it doesnt ruin you physically it WILL ruin everything around you.\n\nI wish you all the best love. You deserve better. I promise recovery is so fucking worth it",
      "created_utc": 1654870452.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ibvu2op",
      "author": "applesandpebbles",
      "body": "i’ve had a whole range of fucked up symptoms at a whole range of weights and the bottom line for fear is realizing you’ve lost control of your body. being a slave to dizziness, weakness, pain everywhere, nausea, brain fog so thick it’s like thinking through sludge until you end up in the hospital. fear is realizing your means of control has lead you to be more out of control than ever",
      "created_utc": 1654884985.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ibw875c",
      "author": "4dtopology",
      "body": "bradycardia. when standing up, my heart was at 40 b.p.m. \nat 16 years old, i was worrying about the same issues my grandmother of 79 was—a heart attack.",
      "created_utc": 1654891206.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ibvh6er",
      "author": "jengamonsoon",
      "body": "At the time, when I was at my lowest, I didn’t think I was dying, or anywhere remotely CLOSE to dying. No one talked about my weight to me, no one suggested i get better, no one really said anything, so I figured i still looked on the upper side of average weight range. I didn’t think I \n\nBut the scariest thing is, looking back at myself, I was SO close to dying. In multiple ways.\n1. I didn’t see my weight. I didn’t see how bad it was. And i would read about people saying things like that, and i would think “oh there is no way that’s happening to me” but like.. it did. And if I kept going, I don’t think I EVER would’ve known. I would have died if I kept going, because I would always THINK i’d be satisfied when it happened, but looking back, I wouldn’t have even realized when to stop.\n2. There was this one occasion where I got heat stroke. And like, I was scared shitless. No one took me to the hospital when I said I needed to, but they told me that gatorade would help me. And I told them no, that I couldn’t drink the gatorade. That I wouldn’t. But my heart was WEAK. And the heat stroke could have actually killed me. And I knew that. But I still couldn’t drink the gatorade. The fact that my disorder had me choosing risking death over drinking gatorade because there were calories is terrifying.\n3. Sometimes I would wake up and my heart would be so weak that I couldn’t stand. I would have to crawl to the kitchen, and cook on the floor, and eat on the floor. It felt like if I stood up, I would die. I would be on the floor for about 2 hours before I felt safe enough to stand.\n4. I’ve gained weight in recovery. And I finally feel safe to walk outside again. Back when I was disordered, I would go on long walks compulsively, often through bad neighborhoods. And if somebody stabbed me, I would die. My body wouldn’t have been able to protect me. When skin is the only thing covering your vital organs, death feels way closer. If anyone stabbed me, it would be so easy to kill me. And if anyone grabbed me, I wouldn’t be able to fight back or get away. \n5. If not now, in 10 years. If not then, in 20. I would have killed myself with my disorder eventually, it was literally only a matter of time. If not recovery, you’re choosing death. I’m 23, I recovered at 22. I think if I stayed as sick as I was at 22, and stayed like that for years, age would have caught up to me. What I was doing at 22 could have VERY well killed me at 27, especially with the long term erosion of health that comes with having it for years.\n\nI would have killed myself in some way if I kept going. Not by being too skinny, but by psychologically being more obsessed with food/weight than with survival. It would have killed me eventually regardless of weight. And even if it WAS because of weight, there was no possible way I would have seen it coming.",
      "created_utc": 1654879496.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ibwjm05",
      "author": "crycry_chemtrails",
      "body": "Not that I’m aware of, but I’ve had an ED for 12 years so I’ve probably come closer than I know. I had an incident before I went to residential where I likely had a partial seizure. The scary thing is most ED deaths are unexpected. You can fully weight restore and die because the damage was already done. Furthermore, purging behaviors can kill you within a day. I think I got lucky, but the truth is it could all come back to bite me without warning. You can’t wait until you know something is seriously wrong.",
      "created_utc": 1654896416.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ibvh0sv",
      "author": "None",
      "body": "Yes. I ended up in the E.R. in late 2019, but they couldn’t help me/do anything, It wasn’t an immediate recovery step once I returned home, but after a month, I started eating a lot more, because I told myself I didn’t want to die. I didn’t even realize I was starving myself — I thought I went in for other health reasons that needed to be resolved. I didn’t realize I actually had an eating disorder until around a year later.",
      "created_utc": 1654879431.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ibwkfoi",
      "author": "JellyCharacter1653",
      "body": "My cousin almost did she had a heart attack in her sleep thx god we were sleeping in the same bed that night",
      "created_utc": 1654896808.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ibvywj8",
      "author": "Rms037",
      "body": "Not physical health (though I had some pretty bad side effects there to) but I kept thinking that once I lost enough weight, my mental health would get better. Turns out, I couldn't fix my self-esteem, anxiety, and depression while torturing myself to try and reach an impossible goal. No matter how much I lost, it was never enough for me to like myself. Instead, I had to go to a lot of therapy and learn to love myself as is without trying to change myself at all. If I hadn't, I wouldn't be here. I don't know if it would have been my ED or my mental health that just kept getting worse because of how much I hated my body+self, but it definately would have been one of them.\n\nEither way, I'm still here, recovered, loving myself as I am, and finally happy",
      "created_utc": 1654887098.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibuhctu",
      "author": "SammyJammers",
      "body": "at my lowest i started blacking out while driving",
      "created_utc": 1654863121.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ibu1upk",
      "author": "SquidneyClimbs",
      "body": "So well said. I'm 31 and it's horrifying to think that if I hadn't recovered I could be dead right now.",
      "created_utc": 1654851159.0,
      "score": 44,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        }
      ]
    },
    {
      "id": "ibv1mxm",
      "author": "cautionfreshpaint",
      "body": "I know exactly who you are talking about. I miss her every day. I’m guessing I may know your daughter too, although may not. I hope you and your daughter are doing well and sending love ❤️",
      "created_utc": 1654872997.0,
      "score": 16,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        }
      ]
    },
    {
      "id": "ibucrtg",
      "author": "bookworm352",
      "body": "I’m inpatient right now, it’s a rollercoaster, plus seeing so many others can be triggering sometimes. But I want to get better. I want to be able to enjoy eating as well, now I just do it cuz I have to and feel guilty if I like the food that is served.",
      "created_utc": 1654860157.0,
      "score": 8,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        }
      ]
    },
    {
      "id": "ibustsa",
      "author": "None",
      "body": "I needed to see this today.  Thank you.",
      "created_utc": 1654869121.0,
      "score": 5,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        }
      ]
    },
    {
      "id": "ibu6weq",
      "author": "Sareeee48",
      "body": "Hi! Asking/offering DMs breaks rule 8, please edit your comment.",
      "created_utc": 1654855679.0,
      "score": -17,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        }
      ]
    },
    {
      "id": "ibtsxow",
      "author": "eggyeoh",
      "body": "Your story makes me cry; your words are so powerful and make my heart ache. I truly wish you all the strength you can to recover and make it through. You deserve to live. You deserve to feel energy and happiness and peace for many, many years to come.",
      "created_utc": 1654843359.0,
      "score": 49,
      "context": [
        {
          "id": "ibtp4d8",
          "author": "-_Hayley_-",
          "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
          "created_utc": 1654840441.0
        }
      ]
    },
    {
      "id": "ibtvzx2",
      "author": "None",
      "body": "I want to give you a hug so so badly",
      "created_utc": 1654845876.0,
      "score": 18,
      "context": [
        {
          "id": "ibtp4d8",
          "author": "-_Hayley_-",
          "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
          "created_utc": 1654840441.0
        }
      ]
    },
    {
      "id": "ibuho4q",
      "author": "SammyJammers",
      "body": "i’m sorry you had to go through this, but thank you for sharing… sending hugs",
      "created_utc": 1654863313.0,
      "score": 7,
      "context": [
        {
          "id": "ibtp4d8",
          "author": "-_Hayley_-",
          "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
          "created_utc": 1654840441.0
        }
      ]
    },
    {
      "id": "ibtv8ck",
      "author": "unsaintedheretic",
      "body": "Goddamn this hits so close to home and I got goose bumps reading this. Thank you for putting it into such precise words.\n\nThe worst part for me was my decaying mental health. The way my ED almost killed me personally was almost purely psychological.",
      "created_utc": 1654845245.0,
      "score": 17,
      "context": [
        {
          "id": "ibtgbxm",
          "author": "Philocalist_Cat",
          "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
          "created_utc": 1654834520.0
        }
      ]
    },
    {
      "id": "ibtvaw2",
      "author": "None",
      "body": "Finding peace in the emptiness, without the commitment of a fast irreversible death. I’m basically the living dead. I don’t want live but I can’t choose death. So I choose the numbness of my ed",
      "created_utc": 1654845306.0,
      "score": 9,
      "context": [
        {
          "id": "ibtgbxm",
          "author": "Philocalist_Cat",
          "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
          "created_utc": 1654834520.0
        }
      ]
    },
    {
      "id": "ibtv9kk",
      "author": "BedroomImpossible124",
      "body": "Yes this was me. I'm slowly healing, becoming me a little more. It's hard but worth it. Show yourself compassion OP, you deserve it. You deserve happiness,  you deserve a life. Sending love and healing thoughts.💕",
      "created_utc": 1654845274.0,
      "score": 7,
      "context": [
        {
          "id": "ibtgbxm",
          "author": "Philocalist_Cat",
          "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
          "created_utc": 1654834520.0
        }
      ]
    },
    {
      "id": "ibvofxm",
      "author": "wendy125",
      "body": "This is incredibly moving.  Thank you for expressing it so eloquently.   All my best to you ❤️",
      "created_utc": 1654882548.0,
      "score": 5,
      "context": [
        {
          "id": "ibtgbxm",
          "author": "Philocalist_Cat",
          "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
          "created_utc": 1654834520.0
        }
      ]
    },
    {
      "id": "ibu0tqw",
      "author": "None",
      "body": "you wrote this beautifully",
      "created_utc": 1654850207.0,
      "score": 3,
      "context": [
        {
          "id": "ibtgbxm",
          "author": "Philocalist_Cat",
          "body": "There is death in its physical sense - the ceasing of the body to function - but in my experience, it is the death of the spirit, of the self, that has been most relevant and, I think, is often forgotten. And yet it is fatefully tragic. The way anorexia kills your personality, sucks the life from you until you are an empty shell of who you once were. You can't think, you can't laugh, you can't feel... just numbness, nothing. People around you are laughing at parties, with friends around bonfires, cookouts, going out for drinks... but anorexia won't let you go to those events - what about the food, the calories, will there be something there I can eat? And even if anorexia does let you go, you won't be present; how could you be, when your mind is filled with thoughts of food, numbers, anxiety, when your body and mind is so tired from malnourishment and the stress of it all. Everything becomes a blur.\n\nYour goals, your passions, your dreams? There will be little room left in your mind, in your heart, for those either. You will watch those around you pursue their dreams, their goals...fall in love, explore the world, meet people, learn new hobbies, start families, careers... and the dreams you once had for yourself, those will slowly slip between your fingers, until they become dead, now just shadowy memories of something you once held so dear, so important to you, to the true and authentic you, which has been buried beneath the eating disorder. The only important thing becomes the eating disorder itself. Anorexia will convince you that it's keeping you safe, that it's keeping you in control. But really all its doing is making your life smaller and smaller, until it feels like there is nothing left. Just you and the eating disorder. Life becomes void of color, of depth, of meaning and purpose... unless, of course, you truly find meaning in life in eating as little as possible and striving to be the smallest one in the room. \n\nI say all this not to paint a hopeless picture of an eating disorder... because there is ALWAYS HOPE. I want to remind you (and myself, too) of the more insidious ways anorexia kills. Every day you spend immersed in the eating disorder is a day of your one and precious life, succumbed to the anorexia. And every day you stick with recovery, you are living... you are alive, and you are planting the seeds for a brighter tomorrow. \n\nKeep fighting for your life, for the kind of life YOU want and you deserve, not the kind of emptiness your eating disorder will provide. You got this :)",
          "created_utc": 1654834520.0
        }
      ]
    },
    {
      "id": "iburwhg",
      "author": "busted3000",
      "body": "That’s so scary, thank you for sharing your story with us. Do you mind if I ask what they did to treat your refreshing syndrome?",
      "created_utc": 1654868688.0,
      "score": 4,
      "context": [
        {
          "id": "ibtdi4m",
          "author": "kayethx",
          "body": "My blood pressure was dangerously low, and just standing up would bring my heart rate to 145. I got super weak and dizzy all the time; sometimes I would have to just immediately sit on the floor after getting out of bed because of it. My body temp would drop to around 96 degrees, and when it would, I would be totally zoned out and distant and slow mentally - it felt so bizarre. My period almost disappeared. And my hair started turning white from the ends up. Got hit with mild refeeding syndrome too - my body was so not used to eating that when I did, i would get really dizzy, my heart rate would go crazy high, and I literally would not be able to breathe (I could only get the most shallow breaths) for like 2-3 hours; I would have to lie on my side, sometimes on a cold floor, and not speak or move and concentrate solely on trying to breathe (thought it was panic attacks but it wasn't 😭). EMT friend confirmed I came very very close to dying. \n\nYou can get better. I've improved so so so much this year - I know you can too. We're all here for you.\n\nEDIT: Typo",
          "created_utc": 1654832794.0
        }
      ]
    },
    {
      "id": "ibuvtkf",
      "author": "None",
      "body": "i am so sorry.",
      "created_utc": 1654870483.0,
      "score": 4,
      "context": [
        {
          "id": "ibtbv8w",
          "author": "None",
          "body": "My heart almost failed and has permanent damage now.",
          "created_utc": 1654831844.0
        }
      ]
    },
    {
      "id": "ibu7862",
      "author": "Sareeee48",
      "body": "People often forget that you can be hospitalized at *any* weight. It’s just a lot less common due to weight stigma. I’m happy to hear you’re doing better though! That whole experience must have been super scary.",
      "created_utc": 1654855951.0,
      "score": 11,
      "context": [
        {
          "id": "ibtoztq",
          "author": "None",
          "body": "Mind you I'm at a normal weight but lost over 25% of my body mass recently.\nBesides the hair loss, feeling weak all the time and because of that sleeping a lot and my lips / fingernails turning blue sometimes other things happened to me.\nMost of the time I get dizzy and can't see anymore when I stand up, but sometimes it gets to the point when I loose consciousness and even when I'm present I can't see, hear or do anything other than lie down anymore. In addition to that I feel super sick and the first time it happened I honestly felt like I was dying.\nI never went to the hospital, because my mom didn't think calling an ambulance was necessary and no hospital will take me as a non emergency, because my BMI is still in the normal range.\nI'm in recovery now and it doesn't happen as frequent anymore and I'm glad that it doesn't look like I'm gonna have permanent damage.\nMy story may be not as dramatic as some others but believe me even my experience was so shitty that I don't wish it on anyone.",
          "created_utc": 1654840348.0
        }
      ]
    },
    {
      "id": "ibvm5uz",
      "author": "wendy125",
      "body": "You made my heart smile!  My daughter  still struggled after ERC, and ultimately achieved recovery (reluctantly). She just graduated from college, which I wasn't sure would ever happen, and starts her first job next week in a new place.  She has her first apartment alone and has found a really good guy.  I am so proud.  I hope you and your family are doing well.  It's a marathon and my heart goes out to all the families running it with us!",
      "created_utc": 1654881587.0,
      "score": 19,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        },
        {
          "id": "ibv1mxm",
          "author": "cautionfreshpaint",
          "body": "I know exactly who you are talking about. I miss her every day. I’m guessing I may know your daughter too, although may not. I hope you and your daughter are doing well and sending love ❤️",
          "created_utc": 1654872997.0
        }
      ]
    },
    {
      "id": "ibvvq9t",
      "author": "RanniTheLewdWitch",
      "body": "ratio",
      "created_utc": 1654885704.0,
      "score": 11,
      "context": [
        {
          "id": "ibtcnwj",
          "author": "wendy125",
          "body": "My daughter was in ED treatment (ERC Denver) with a woman in her 30's.  This woman was absolutely beautiful, but so, so sick.  My daughter got better and left treatment.  The same was true for this woman.  About 8 months after they left treatment the beautiful lady died in her sleep.  She had truly been getting better, but the damage to her heart was done and her death came with no warning.  \n\nYou don't know the damage you are doing that isn't immediately obvious.  You are missing out on SO MUCH by  starving--physically, emotionally, socially, etc.  Life is pretty short, and you owe it to yourself to make the best of it and enjoy it, which you cannot do in the depths of ED.  If you don't have anyone else, please DM me when you need someone to talk you through it.  You DESERVE all the wonderful things life has to offer.  I'll be thinking about you.",
          "created_utc": 1654832310.0
        },
        {
          "id": "ibu6weq",
          "author": "Sareeee48",
          "body": "Hi! Asking/offering DMs breaks rule 8, please edit your comment.",
          "created_utc": 1654855679.0
        }
      ]
    },
    {
      "id": "ibuhb71",
      "author": "-_Hayley_-",
      "body": "I don’t know what to say. Thank you so much. I wish the same thing for everyone struggling with their illness right now. I do believe recovery is possible and worth fighting for, and I hope others still have the self-possession not to abandon themselves when it feels hopeless. I just don’t know that I’m capable of wanting to get better anymore, and I commiserate with anyone who feels similarly. No matter where you are, at least just know that you’re not alone.",
      "created_utc": 1654863093.0,
      "score": 14,
      "context": [
        {
          "id": "ibtp4d8",
          "author": "-_Hayley_-",
          "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
          "created_utc": 1654840441.0
        },
        {
          "id": "ibtsxow",
          "author": "eggyeoh",
          "body": "Your story makes me cry; your words are so powerful and make my heart ache. I truly wish you all the strength you can to recover and make it through. You deserve to live. You deserve to feel energy and happiness and peace for many, many years to come.",
          "created_utc": 1654843359.0
        }
      ]
    },
    {
      "id": "ibui83d",
      "author": "-_Hayley_-",
      "body": "Aw, thank you! A lot of the posts here hurt my heart to read and I hope everyone knows they deserve kindness and understanding and hugs (if they want one) <3",
      "created_utc": 1654863636.0,
      "score": 10,
      "context": [
        {
          "id": "ibtp4d8",
          "author": "-_Hayley_-",
          "body": "I’ve been involuntarily hospitalized at BMIs <13 three times. The first time, before I was hospitalized, I could barely stand for longer than ten minutes. The second time I was so consumed with burning calories even though I could no longer exert myself beyond walking I would spend nearly every waking moment attempting to pace or fidget. I could barely read. Every night my legs were so stiff I would collapse into bed and be unable to move until I woke up the next morning.\n\nThe last time was the single most terrifying experience of my life. I’ve never been so scared of my own brain. I lost every scrape of cognition outside of contemplating food. Nearly every day I would black out completely at some point, urinate myself on the way to the bathroom and struggle for minutes to heave myself up off the toilet, struggle each night to heave blankets over my body and push them off of myself in the morning, struggle each afternoon when I was briefly invigorated by a small meal to go for a compulsory walk, a walk that had dwindled from ten miles to one mile over a month of sharp decline, a walk that I eventually collapsed on, prompting a stranger to finally call an ambulance on me. My whole body was evidently falling apart, but what moved me from the emergency department to a bed in the ICU in short order this time around was, specifically, my failing liver. Rhabdomyolysis brought on by a one-mile walk.\n\nDespite my daily agony, the most horrifying moment of all came after I’d been committed for a couple of weeks, when the hospital psychiatrist gathered my care team around to show me three CT scans of a human brain: one belonging to a healthy 26 year old, one belonging to an 83 year old experiencing the onset of dementia, and one of a 20-year-old anorexic patient, mine.\n\nThe first was unremarkable: grey and white matter nearly filling out the cranium. The second was markedly worn, potholes of cerebral spinal fluid indicating deterioration accrued over a life of aging. The third had the worst degradation of all. My brain looked rotted. Black chasms of cerebral spinal fluid occupied the spaces where my body had cannibalized itself in a desperate bid for glucose, taking anything it could find.\n\nSuddenly all of my insanity made sense. I was shaken to sobs. I knew the dilapidation of my brain was just a snapshot of what the rest of my organs looked like. It was evident even on my skin, which was speckled all over with tiny red and purple bruises: capillaries that had burst from the exertion of simple movements. Years-old scars, long-healed, had turned a nightmarish black. I didn’t understand how a body could withstand it. The tendons in my knee felt for weeks like they’d been slashed with a knife. I am still rattled to the point of crying recalling this. I cannot comprehend the power of this disease. I could not, still cannot, comprehend what drove me to such a slow, agonizing suicide. I cannot comprehend the paradox of a body fighting to hard simultaneously to die and survive all at once.\nEven in the hospital, I hid food at nearly every meal. I lied constantly to everyone before, during, and after they’d committed me for being too incompetent to save my own life. My previous experiences with anorexia feel trivial compared to my last relapse. Before this last go around, I still felt like a human. I felt like a sick girl whose fatal flaw was vanity. This relapse turned me into a feral animal. All volition in my eating disorder dissipated. I didn’t want to be skinny. I didn’t want anything. The motive was gone, the plot was gone, all that was left was the death march.\n\nIn the hospital, I lost all mobility. The bedrest combined with the sudden ten pounds of edema turned my body from one that couldn’t go up stairs to one that couldn’t get off a bed. I couldn’t lift my neck or walk for three weeks. Once I laid flat, a nurse had to assist me back into a sitting position. And tuck me in every night. And lift me onto the bedside commode. It might’ve been humiliating if I hadn’t already lost every ounce of my dignity.\n\nAnyway. I’ve been out of hospital for a little over a year now. I gave recovery a good college try before becoming so horrified by the fat on my still-underweight body that I’ve now settled into what is apparently a permanent uncomfortable quasi-recovery limbo, not gaining weight, not actively dying quite as fast. I don’t know what my brain looks like now, but I know full, “normal” cognition apparently doesn’t resume in recovered anorexics until their menstruation has returned for a number of months, and I haven’t had a period in eight years. I expect it doesn’t look good, if my state of mind is any indication. I don’t know what’s going to happen to me. I hope I die soon, hopefully by accident. I wouldn’t wish this disease on anyone. I wish more than anything that I could beg my younger self to turn back while she still could. If you feel like you still can, do it. \nDo it now. Nothing is worth this.\n\nSorry for the ramble. I wasn’t expecting to wind up typing all this out when I saw this post! Ugh anyway, yeah. Wishing you lots of strength.\n\nedit: typo, formatting",
          "created_utc": 1654840441.0
        },
        {
          "id": "ibtvzx2",
          "author": "None",
          "body": "I want to give you a hug so so badly",
          "created_utc": 1654845876.0
        }
      ]
    },
    {
      "id": "ibvf6ti",
      "author": "kayethx",
      "body": "You're very welcome - really hope it helps other people <3 And sure thing - unfortunately, I never even went to a doctor for it. :( I didn't realize it was what was happening until I was already past it - I just got lucky and made it through. At the time, I was focusing on slowly eating whatever foods I was craving, and then intensely resting after (I was pretty much forced to by my body).\n\nI honestly think it came down to luck here :(\n\nEDIT: Everything I've seen though, and what my EMT friend said I should have done, is to go to the ER if you think it's happening. And then they can monitor you as they feed you and try to figure out what's the safest foods for you to digest, etc. It really varies person to person and you really should do it with a doctor; I just didn't know what was happening so kind of muddled through.",
      "created_utc": 1654878679.0,
      "score": 3,
      "context": [
        {
          "id": "ibtdi4m",
          "author": "kayethx",
          "body": "My blood pressure was dangerously low, and just standing up would bring my heart rate to 145. I got super weak and dizzy all the time; sometimes I would have to just immediately sit on the floor after getting out of bed because of it. My body temp would drop to around 96 degrees, and when it would, I would be totally zoned out and distant and slow mentally - it felt so bizarre. My period almost disappeared. And my hair started turning white from the ends up. Got hit with mild refeeding syndrome too - my body was so not used to eating that when I did, i would get really dizzy, my heart rate would go crazy high, and I literally would not be able to breathe (I could only get the most shallow breaths) for like 2-3 hours; I would have to lie on my side, sometimes on a cold floor, and not speak or move and concentrate solely on trying to breathe (thought it was panic attacks but it wasn't 😭). EMT friend confirmed I came very very close to dying. \n\nYou can get better. I've improved so so so much this year - I know you can too. We're all here for you.\n\nEDIT: Typo",
          "created_utc": 1654832794.0
        },
        {
          "id": "iburwhg",
          "author": "busted3000",
          "body": "That’s so scary, thank you for sharing your story with us. Do you mind if I ask what they did to treat your refreshing syndrome?",
          "created_utc": 1654868688.0
        }
      ]
    },
    {
      "id": "ibwk8vz",
      "author": "None",
      "body": "it’s okay but this is what happens when you restrict for too long. it’s better to get help before this happens.",
      "created_utc": 1654896719.0,
      "score": 3,
      "context": [
        {
          "id": "ibtbv8w",
          "author": "None",
          "body": "My heart almost failed and has permanent damage now.",
          "created_utc": 1654831844.0
        },
        {
          "id": "ibuvtkf",
          "author": "None",
          "body": "i am so sorry.",
          "created_utc": 1654870483.0
        }
      ]
    }
  ]
}