{
  "id": "vcbxlc",
  "subreddit": "fuckeatingdisorders",
  "author": "scaremeidareyou",
  "created_utc": 1655236285.0,
  "title": "It’s astonishing to me...",
  "selftext": "... that this is pretty much the only ED related subreddit that doesn’t openly encourage behaviors.\n\nI’m bulimic and I made the mistake to go to r/bulimia and oh my GOD.\n\nI understand not being ready to recover and venting about your experience or sharing harm reduction tactics which can promote recovery steps eventually but openly asking if bulimia helps with fat loss? Asking people if they lost or gained weight “with” bulimia? As if it’s like the new version of keto or something... \n\nI just unleashed my frustration in one of the posts and while I’m not proud of it, I very much thing it was justified.\n\nAm I being a self righteous jerk? Can someone weigh in on this?\n\nOh and by the way I’m so glad to have you guys and this community. I’d probably end up having a stroke hunched on top of my toilet or keep running half marathons five days a week and call myself a recovered “fitness guru” if it weren’t for you all.\n\nEDIT\nGuys OP just messaged me and told me that I’m a deranged person and I should seek medical attention asap because I got so riled up about a “random question”. What’s more, the mods are with OP. I just... I don’t even understand the world anymore.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vcbxlc/its_astonishing_to_me/",
  "score": 102,
  "num_comments": 38,
  "comments": [
    {
      "id": "icdj8vy",
      "author": "TerrifyinglyAlive",
      "body": "I think the righteous anger, and (if I'm being honest) irritation with other ED spaces is something that comes on when you're switching to a recovery oriented mindset.  It's not just that they're not ready to recover, a lot of them still actively don't want to and want to talk about getting sicker.  I think it helps to remind myself of how sad it truly is.",
      "created_utc": 1655239937.0,
      "score": 56,
      "context": []
    },
    {
      "id": "icdrrwf",
      "author": "GladPen",
      "body": "I left EAanonymous yesterday. I found that group first and then this one. I don't get tense here worried I'll get triggered or feel bad. This seems to be a safe space. Thank you mods. I don't think you are being a self-righteous jerk. I think you reached your limit and your recovery was at risk, maybe, so you vented. That doesn't make self-righteous, it means you prioritized your well-being over the status quo of the group. And who knows, maybe some of what you wrote will eventually stick in someone's mind and help them seek recovery.",
      "created_utc": 1655243754.0,
      "score": 31,
      "context": []
    },
    {
      "id": "icdeglc",
      "author": "IamNotABaldEagle",
      "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
      "created_utc": 1655237957.0,
      "score": 52,
      "context": []
    },
    {
      "id": "icdnlae",
      "author": "tdc8557",
      "body": "I agree! I’m so glad this sub was created because I looked at other ED related subs and was shocked by what was allowed. I totally get that it’s important to meet people where they’re at in recovery or not, but my experience with my treatment peers was so recovery focused, it blew my mind to see some content elsewhere. \n\nI don’t think you’re a self righteous jerk. We’re all on individual journeys with different milestones and struggles. I’ve had to limit contact with a really good friend because she hasn’t started processing her trauma and projects it into me and I now have boundaries and don’t want to be responsible for her mental health. We still talk, but I realized I’ve had the privilege of spending years on my trauma and developing the coping skills needed to live my life and she isn’t there yet (but hopefully will be someday!).",
      "created_utc": 1655241838.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ice7hsc",
      "author": "DantesInporno",
      "body": "I don’t think the anorexia sub encourages behaviors personally",
      "created_utc": 1655251414.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ice6ivm",
      "author": "punkhag",
      "body": "Yeah I kind of had a moment like this the other day when tumblr showed me a post that was “based on your likes!” That was just very blatantly awful thinspo, also very obviously photoshopped. I ended up going down a rabbit hole of ED accounts that all said things like “don’t report me if you report me you’re an abuser” “I’m not encouraging EDs this is just a vent account (where I encourage mine and others EDs” after reporting a bunch of them I had to just go look at some eye bleach bc I was about to snap. \n\nThe anger is justified, we shouldn’t be vitriolic to these people but at the same time some of them clearly need some tough love that they are NOT getting in those communities. I do agree this is one of the very few sane recovery spaces online.",
      "created_utc": 1655250943.0,
      "score": 5,
      "context": []
    },
    {
      "id": "icfpp1o",
      "author": "Notreallysurebutidc",
      "body": "Yup I literally wrote [this ](https://www.reddit.com/r/bulimia/comments/moyjzd/i_mean_this_in_the_kindest_way_but_this_group_can/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) when I noticed how toxic that space was. I personally felt like a lot of people of there were going backwards in their eating disorder which made me sad. I used to be on Tumblr too being a sick person but I was a bit shook. Tried to say it in a kind way as I understand a lot of people are sick and not mentally capable to see what they do wrong.",
      "created_utc": 1655285987.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iceeqn9",
      "author": "Forward-Woodpecker-4",
      "body": "Yeah this is the only ED sub i am in now. It was hard to leave the others, but i realized i was using them to trigger myself and they kept me subconsciously engaging in behaviors and comparing myself. I recommend leaving and cutting anything out that even remotely makes you question your recovery and compare yourself to others.",
      "created_utc": 1655255004.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iceswqf",
      "author": "Funky_Lesbian",
      "body": "this really is the only real recovery-oriented space. big thank you to the mods and the whole community for making this a safe place :)",
      "created_utc": 1655262139.0,
      "score": 4,
      "context": []
    },
    {
      "id": "icfcg01",
      "author": "smoothpigeon2",
      "body": "I just read that post.. what a question... \"*do you lose weight when your bulimic?*\" I mean really. \"*I know some people start bulimia thinking they will lose weight*\". It definitely sounds like they're talking about it as though it's a diet, just something they want to try to lose weight. (Like binging and purging makes you lose weight somehow?? I mean sure, if you're just throwing up meals you'll lose weight but does this person not know that bulimia involves binging too? Yeah, that's great for weight loss /s). And they sounded super bummed when people said no. \n\nMaybe I'm just being an asshole or whatever but it sounded like they were lowkey looking for tips. Asking this question, hoping people would say yes so that they can try it when the consensus turns out to be actually no, it doesn't make you lose weight (ah, what a bummer /s), doesn't seem to belong in a recovery sub. Someone made the argument that the responses saying no is exactly why it belongs there but I think that's a load of crap. That was not the intent of the post. \n\nI didn't see your initial comment that was removed, but totally agree with your other comments. That whole post/thread kinda has pissed me off a bit lol",
      "created_utc": 1655274566.0,
      "score": 4,
      "context": []
    },
    {
      "id": "icfl5am",
      "author": "AnaDion94",
      "body": "I like that sub, but it absolutely a mixed bag. I’m very liberal with the block function. There are also an irritating number of people who go in their thinking Bulimia is a neat new dieting trick they should try and I have no issues railing on them for it. Okay, they’re stupid and that’s one thing, but they’re triggering other people in a sensitive headspace and that is not. \n\nBut yeah, definitely leave spaces that do you more harm than good (edanonymous and the meme sub are both no-gos for me).",
      "created_utc": 1655281869.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icfs86b",
      "author": "boba-boba",
      "body": "This has been the only ED community I've ever been a part of that was strictly recovery oriented and not just a competition at who can do EDs best. I do wish we had more voices from people struggling with binge eating disorder, but that's not necessarily a fault of the community or the moderation.",
      "created_utc": 1655288186.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icg4x5a",
      "author": "Emergency-Parsley-51",
      "body": "I think you were more assertive than brutal, you just straightforward gave them a reality check, but they are so much into those behaviours that they feel attacked. And lol, that is a bulimia sub, they all kind of need medical attention.",
      "created_utc": 1655296616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icgqihy",
      "author": "busted3000",
      "body": "Yeah I get what you mean, the commenters/mods in this sub are honest about recover vs harm reduction, and call out ED behaviours people haven’t realised. It’s great, and the community here is always so friendly here even if you just need to vent about how hard recovery is. I’m sure it’s not easy to creat such a healthy space around this topic but the mods have done excellently. It’s certainly not like ✨that other sub✨ that tells people thinking of recovery to leave the sub yet claims not to be ProED.",
      "created_utc": 1655306487.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icguake",
      "author": "FideliaDelarosa",
      "body": "I feel like r/  diettea is also a nice place to be!",
      "created_utc": 1655308047.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icgvc41",
      "author": "clumsycouture",
      "body": "I literally developed Bulimia because my best friend told me she lost weight by doing it. I figured oh I’ll do this for a month and lose some weight and then be done. 5 years later I couldn’t eat without throwing up and if I wasn’t throwing up I wouldn’t eat. Haven’t purged in 10 years but the mental aspect is still there. Not as bad but I still have some disorder eating tendencies. I agree with your anger.",
      "created_utc": 1655308467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ich4x56",
      "author": "nesie97",
      "body": "I stay away from any eating disorder sub than this one. They all have bad energy to me it’s like people asking for tricks and tips which I don’t fuck with at all. I don’t wanna be triggered in that way. You aren’t self righteous it’s not okay to go online in those spaces and ask for tricks and tips. If they wanna tips go to ED Twitter",
      "created_utc": 1655312365.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ice69iq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1655250814.0,
      "score": -11,
      "context": []
    },
    {
      "id": "icdl9sa",
      "author": "scaremeidareyou",
      "body": "I’ve been there too. I didn’t want to get better, I wanted to get better at “it”. I was on pro-ed forums all day every day and let me tell you, every behavior I know today, I learned from there (don’t worry, they are cleverly hidden and the memberships are very heavily controlled today so not anyone is going to stumble upon them and start learning tips and tricks). \n\nIt’s sad yes but I also find it disrespectful to sufferers and their families. I know people who lost everything because of this. I was on the literal verge of being one of them. I know families who sell their homes just so their child can get treatment. I just.. ugh I don’t know.",
      "created_utc": 1655240799.0,
      "score": 20,
      "context": [
        {
          "id": "icdj8vy",
          "author": "TerrifyinglyAlive",
          "body": "I think the righteous anger, and (if I'm being honest) irritation with other ED spaces is something that comes on when you're switching to a recovery oriented mindset.  It's not just that they're not ready to recover, a lot of them still actively don't want to and want to talk about getting sicker.  I think it helps to remind myself of how sad it truly is.",
          "created_utc": 1655239937.0
        }
      ]
    },
    {
      "id": "icfk85d",
      "author": "IamNotABaldEagle",
      "body": "YES you totally nailed it. I was like that when I first joined ED subs on reddit. I was dipping my toes into the idea of recovery and told myself I needed a space to 'discuss behaviours' or vent. While there may have been some truth in that I did also really want tips on how to do my ED better. Now I'm just much more committed to recovery I do find it a bit irritating. I shouldn't because they're unwell just as I was. \n\n&#x200B;\n\nThis sub often made me uncomfortable telling me things I didn't want to hear (i.e. yes you're going to gain weight in recovery and it isn't up to you how much weight that'll be) but it was uncomfortable in a productive way.",
      "created_utc": 1655281067.0,
      "score": 7,
      "context": [
        {
          "id": "icdj8vy",
          "author": "TerrifyinglyAlive",
          "body": "I think the righteous anger, and (if I'm being honest) irritation with other ED spaces is something that comes on when you're switching to a recovery oriented mindset.  It's not just that they're not ready to recover, a lot of them still actively don't want to and want to talk about getting sicker.  I think it helps to remind myself of how sad it truly is.",
          "created_utc": 1655239937.0
        }
      ]
    },
    {
      "id": "icdrxnh",
      "author": "GladPen",
      "body": "Mine was yesterday, if that's true then it's a really good sign..",
      "created_utc": 1655243828.0,
      "score": 3,
      "context": [
        {
          "id": "icdj8vy",
          "author": "TerrifyinglyAlive",
          "body": "I think the righteous anger, and (if I'm being honest) irritation with other ED spaces is something that comes on when you're switching to a recovery oriented mindset.  It's not just that they're not ready to recover, a lot of them still actively don't want to and want to talk about getting sicker.  I think it helps to remind myself of how sad it truly is.",
          "created_utc": 1655239937.0
        }
      ]
    },
    {
      "id": "icdld88",
      "author": "scaremeidareyou",
      "body": "Yeah I’m gonna go ahead and do just that.",
      "created_utc": 1655240841.0,
      "score": 17,
      "context": [
        {
          "id": "icdeglc",
          "author": "IamNotABaldEagle",
          "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
          "created_utc": 1655237957.0
        }
      ]
    },
    {
      "id": "icfgcvu",
      "author": "Egg_Tomato",
      "body": "Me too !!!",
      "created_utc": 1655277752.0,
      "score": 3,
      "context": [
        {
          "id": "icdeglc",
          "author": "IamNotABaldEagle",
          "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
          "created_utc": 1655237957.0
        }
      ]
    },
    {
      "id": "icgtjlf",
      "author": "FideliaDelarosa",
      "body": "What is your take on the edanonymeme sub? I'm curious to hear perspectives!",
      "created_utc": 1655307740.0,
      "score": 2,
      "context": [
        {
          "id": "icdeglc",
          "author": "IamNotABaldEagle",
          "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
          "created_utc": 1655237957.0
        }
      ]
    },
    {
      "id": "icfl9bw",
      "author": "scaremeidareyou",
      "body": "I honestly never checked the anorexia sub since it doesn’t apply to me, you might be right. Maybe I shouldn’t have generalized.",
      "created_utc": 1655281970.0,
      "score": 6,
      "context": [
        {
          "id": "ice7hsc",
          "author": "DantesInporno",
          "body": "I don’t think the anorexia sub encourages behaviors personally",
          "created_utc": 1655251414.0
        }
      ]
    },
    {
      "id": "icgqq3w",
      "author": "busted3000",
      "body": "Yes I agree, that sub has the same energy as this one on the whole. However they certainly seem to be in the minority of ED subs sadly, at least in my experience.",
      "created_utc": 1655306573.0,
      "score": 4,
      "context": [
        {
          "id": "ice7hsc",
          "author": "DantesInporno",
          "body": "I don’t think the anorexia sub encourages behaviors personally",
          "created_utc": 1655251414.0
        }
      ]
    },
    {
      "id": "icg27ka",
      "author": "scaremeidareyou",
      "body": "Well I’m sorry to say that a year after your post, I personally feel like they regressed even further. \n\nThen again, recovery is a hard decision to make, to act on and stay committed to as it is. A lot of people are skeptical about recovery, most want to recover but lack the guidance, information or the means. When you gather a bunch of suffering people and tell them that this gathering is recovery oriented however monitor them loosely... they will eventually go back to their old habits- maybe take them even further collectively. There really is a fine between sharing experiences in order to feel less alone in your pain and triggering people further into their sickness.",
      "created_utc": 1655295077.0,
      "score": 5,
      "context": [
        {
          "id": "icfpp1o",
          "author": "Notreallysurebutidc",
          "body": "Yup I literally wrote [this ](https://www.reddit.com/r/bulimia/comments/moyjzd/i_mean_this_in_the_kindest_way_but_this_group_can/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) when I noticed how toxic that space was. I personally felt like a lot of people of there were going backwards in their eating disorder which made me sad. I used to be on Tumblr too being a sick person but I was a bit shook. Tried to say it in a kind way as I understand a lot of people are sick and not mentally capable to see what they do wrong.",
          "created_utc": 1655285987.0
        }
      ]
    },
    {
      "id": "icflrtd",
      "author": "scaremeidareyou",
      "body": "My initial comment was brutal but every word was true. I said that bulimia isn’t something you “do” to lose weight but it’s something that ruins lives. And I proceeded to draw a mental picture of its reality and suddenly I’m the asshole. Oh well 🤷🏻‍♀️",
      "created_utc": 1655282429.0,
      "score": 5,
      "context": [
        {
          "id": "icfcg01",
          "author": "smoothpigeon2",
          "body": "I just read that post.. what a question... \"*do you lose weight when your bulimic?*\" I mean really. \"*I know some people start bulimia thinking they will lose weight*\". It definitely sounds like they're talking about it as though it's a diet, just something they want to try to lose weight. (Like binging and purging makes you lose weight somehow?? I mean sure, if you're just throwing up meals you'll lose weight but does this person not know that bulimia involves binging too? Yeah, that's great for weight loss /s). And they sounded super bummed when people said no. \n\nMaybe I'm just being an asshole or whatever but it sounded like they were lowkey looking for tips. Asking this question, hoping people would say yes so that they can try it when the consensus turns out to be actually no, it doesn't make you lose weight (ah, what a bummer /s), doesn't seem to belong in a recovery sub. Someone made the argument that the responses saying no is exactly why it belongs there but I think that's a load of crap. That was not the intent of the post. \n\nI didn't see your initial comment that was removed, but totally agree with your other comments. That whole post/thread kinda has pissed me off a bit lol",
          "created_utc": 1655274566.0
        }
      ]
    },
    {
      "id": "icfm2hq",
      "author": "scaremeidareyou",
      "body": "They’re absolutely welcome to try the “diet trick which allows you to eat whatever you want” at this point to be honest. Let them see for themselves where it gets them in a few years. I think they’d appreciate the hairloss, the mani, the loss of fingernails because of the acid, the lying and the stealing and of course the messed up esophagus. \n\nI can’t believe I’m still mad a day after😂",
      "created_utc": 1655282698.0,
      "score": 2,
      "context": [
        {
          "id": "icfl5am",
          "author": "AnaDion94",
          "body": "I like that sub, but it absolutely a mixed bag. I’m very liberal with the block function. There are also an irritating number of people who go in their thinking Bulimia is a neat new dieting trick they should try and I have no issues railing on them for it. Okay, they’re stupid and that’s one thing, but they’re triggering other people in a sensitive headspace and that is not. \n\nBut yeah, definitely leave spaces that do you more harm than good (edanonymous and the meme sub are both no-gos for me).",
          "created_utc": 1655281869.0
        }
      ]
    },
    {
      "id": "icgu5lv",
      "author": "FideliaDelarosa",
      "body": "Just being curious .. Which other sub so you mean? I follow a few and dont clearly recognize the description",
      "created_utc": 1655307992.0,
      "score": 1,
      "context": [
        {
          "id": "icgqihy",
          "author": "busted3000",
          "body": "Yeah I get what you mean, the commenters/mods in this sub are honest about recover vs harm reduction, and call out ED behaviours people haven’t realised. It’s great, and the community here is always so friendly here even if you just need to vent about how hard recovery is. I’m sure it’s not easy to creat such a healthy space around this topic but the mods have done excellently. It’s certainly not like ✨that other sub✨ that tells people thinking of recovery to leave the sub yet claims not to be ProED.",
          "created_utc": 1655306487.0
        }
      ]
    },
    {
      "id": "icef0wt",
      "author": "messythelioma",
      "body": "That's what they're trying to do here...",
      "created_utc": 1655255147.0,
      "score": 8,
      "context": [
        {
          "id": "ice69iq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655250814.0
        }
      ]
    },
    {
      "id": "icgvlhn",
      "author": "clumsycouture",
      "body": "Oh man back in 2006 when I started my ED I got ALL the tips from Pro-Ana websites and that shit was not hidden. But nowadays teens have Instagram anyways. Very easy to find disordered eating accounts right in the open.",
      "created_utc": 1655308573.0,
      "score": 2,
      "context": [
        {
          "id": "icdj8vy",
          "author": "TerrifyinglyAlive",
          "body": "I think the righteous anger, and (if I'm being honest) irritation with other ED spaces is something that comes on when you're switching to a recovery oriented mindset.  It's not just that they're not ready to recover, a lot of them still actively don't want to and want to talk about getting sicker.  I think it helps to remind myself of how sad it truly is.",
          "created_utc": 1655239937.0
        },
        {
          "id": "icdl9sa",
          "author": "scaremeidareyou",
          "body": "I’ve been there too. I didn’t want to get better, I wanted to get better at “it”. I was on pro-ed forums all day every day and let me tell you, every behavior I know today, I learned from there (don’t worry, they are cleverly hidden and the memberships are very heavily controlled today so not anyone is going to stumble upon them and start learning tips and tricks). \n\nIt’s sad yes but I also find it disrespectful to sufferers and their families. I know people who lost everything because of this. I was on the literal verge of being one of them. I know families who sell their homes just so their child can get treatment. I just.. ugh I don’t know.",
          "created_utc": 1655240799.0
        }
      ]
    },
    {
      "id": "ich2jz4",
      "author": "IamNotABaldEagle",
      "body": "For me it was kind of useful in that it was almost like a gateway sub to on my way to recovery. It was nice to read about other people who were at a similar stage to me at the time. I didn't like alot of the stuff I read on this sub because essentially it was the truth I didn't want to hear (basically you need to gain weight to recover - you can't decide what your set point weight is). I did unsubscribe recently though as it just wasn't recovery focused and I felt like I'm kind of outrgrown it in my recovery. Also being older I began to feel more like a mom than someone who could relate to lots of the other posts. I'm also a big fan of IE/unrestricted eating and felt like this sub was a much better fit for that.",
      "created_utc": 1655311401.0,
      "score": 3,
      "context": [
        {
          "id": "icdeglc",
          "author": "IamNotABaldEagle",
          "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
          "created_utc": 1655237957.0
        },
        {
          "id": "icgtjlf",
          "author": "FideliaDelarosa",
          "body": "What is your take on the edanonymeme sub? I'm curious to hear perspectives!",
          "created_utc": 1655307740.0
        }
      ]
    },
    {
      "id": "icgwftn",
      "author": "clumsycouture",
      "body": "I just had 6 teeth removed and like 11 fillings because of years of bulimia. My stomach is fucked. Took me 5 years just to be able to poop normally. Like this shit literally ruins lives. I wouldn’t wish bulimia on my worst enemy and I also started purging thinking it was a “diet”. I mean back in 2006 nobody really talked about it unless it was tabloids about Mary Kate Olsen. I had 3 girlfriends who all were bulimic at the same time as me but we never talked about it to each other.",
      "created_utc": 1655308913.0,
      "score": 1,
      "context": [
        {
          "id": "icfcg01",
          "author": "smoothpigeon2",
          "body": "I just read that post.. what a question... \"*do you lose weight when your bulimic?*\" I mean really. \"*I know some people start bulimia thinking they will lose weight*\". It definitely sounds like they're talking about it as though it's a diet, just something they want to try to lose weight. (Like binging and purging makes you lose weight somehow?? I mean sure, if you're just throwing up meals you'll lose weight but does this person not know that bulimia involves binging too? Yeah, that's great for weight loss /s). And they sounded super bummed when people said no. \n\nMaybe I'm just being an asshole or whatever but it sounded like they were lowkey looking for tips. Asking this question, hoping people would say yes so that they can try it when the consensus turns out to be actually no, it doesn't make you lose weight (ah, what a bummer /s), doesn't seem to belong in a recovery sub. Someone made the argument that the responses saying no is exactly why it belongs there but I think that's a load of crap. That was not the intent of the post. \n\nI didn't see your initial comment that was removed, but totally agree with your other comments. That whole post/thread kinda has pissed me off a bit lol",
          "created_utc": 1655274566.0
        },
        {
          "id": "icflrtd",
          "author": "scaremeidareyou",
          "body": "My initial comment was brutal but every word was true. I said that bulimia isn’t something you “do” to lose weight but it’s something that ruins lives. And I proceeded to draw a mental picture of its reality and suddenly I’m the asshole. Oh well 🤷🏻‍♀️",
          "created_utc": 1655282429.0
        }
      ]
    },
    {
      "id": "ichkqzt",
      "author": "TerrifyinglyAlive",
      "body": "EDAnon has in their sidebar that people in recovery are discouraged from being on the sub",
      "created_utc": 1655318802.0,
      "score": 2,
      "context": [
        {
          "id": "icgqihy",
          "author": "busted3000",
          "body": "Yeah I get what you mean, the commenters/mods in this sub are honest about recover vs harm reduction, and call out ED behaviours people haven’t realised. It’s great, and the community here is always so friendly here even if you just need to vent about how hard recovery is. I’m sure it’s not easy to creat such a healthy space around this topic but the mods have done excellently. It’s certainly not like ✨that other sub✨ that tells people thinking of recovery to leave the sub yet claims not to be ProED.",
          "created_utc": 1655306487.0
        },
        {
          "id": "icgu5lv",
          "author": "FideliaDelarosa",
          "body": "Just being curious .. Which other sub so you mean? I follow a few and dont clearly recognize the description",
          "created_utc": 1655307992.0
        }
      ]
    },
    {
      "id": "icefhzq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1655255386.0,
      "score": -7,
      "context": [
        {
          "id": "ice69iq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655250814.0
        },
        {
          "id": "icef0wt",
          "author": "messythelioma",
          "body": "That's what they're trying to do here...",
          "created_utc": 1655255147.0
        }
      ]
    },
    {
      "id": "ich2yah",
      "author": "FideliaDelarosa",
      "body": "Thank you! I’m considering if I should say good buy to it also, but it is just SUCH a comfort community to my. But I’m unsure if it is really good for me …",
      "created_utc": 1655311563.0,
      "score": 1,
      "context": [
        {
          "id": "icdeglc",
          "author": "IamNotABaldEagle",
          "body": "I felt like it was a huge recovery milestone when I unsubscribed from my other ED sub and just stuck to this one.",
          "created_utc": 1655237957.0
        },
        {
          "id": "icgtjlf",
          "author": "FideliaDelarosa",
          "body": "What is your take on the edanonymeme sub? I'm curious to hear perspectives!",
          "created_utc": 1655307740.0
        },
        {
          "id": "ich2jz4",
          "author": "IamNotABaldEagle",
          "body": "For me it was kind of useful in that it was almost like a gateway sub to on my way to recovery. It was nice to read about other people who were at a similar stage to me at the time. I didn't like alot of the stuff I read on this sub because essentially it was the truth I didn't want to hear (basically you need to gain weight to recover - you can't decide what your set point weight is). I did unsubscribe recently though as it just wasn't recovery focused and I felt like I'm kind of outrgrown it in my recovery. Also being older I began to feel more like a mom than someone who could relate to lots of the other posts. I'm also a big fan of IE/unrestricted eating and felt like this sub was a much better fit for that.",
          "created_utc": 1655311401.0
        }
      ]
    },
    {
      "id": "icest3p",
      "author": "Sareeee48",
      "body": "> Ask yourself why would a mod delete a comment if it wasn't wrong?\n\nYeah you should probably be asking yourself that right now. 🥴",
      "created_utc": 1655262087.0,
      "score": 7,
      "context": [
        {
          "id": "ice69iq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655250814.0
        },
        {
          "id": "icef0wt",
          "author": "messythelioma",
          "body": "That's what they're trying to do here...",
          "created_utc": 1655255147.0
        },
        {
          "id": "icefhzq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655255386.0
        }
      ]
    }
  ]
}