{
  "id": "ve4fjt",
  "subreddit": "fuckeatingdisorders",
  "author": "efftheestablishment",
  "created_utc": 1655439491.0,
  "title": "r/edanonymous is becoming more and more pro ana (& fatphobic)",
  "selftext": "I've been a part of r/edanonmyous for a while, and I initially didn't mind the sub, you could talk about your struggles with your eating disorder, which is fine. I figured it would be fine to stay in while being early into recovery, because I might still relate. But lately, moreso in the past week, I have noticed a big increase in fatphobic posts reaching hot and showing up on my feed.\n\nIt's genuinely vile. I'm not talking about fear of personal weight gain, I mean consistent belittling of fat people.\n\nThere are some good discussions to be had around the subject of fatphobia, like how we need to stop insinutating EVERY eating disorder is based in fatphobia, or how body positive influencers often belittle people with restrictive eating disorders or even compare their struggles to racism and homophobia. But this isn't what's been happening.\n\nA lot of it is disgusting, elementary school type, bullying. People posting how they hate HAES, not because of any valid criticisms, but because they don't want to be fat and therefore we shouldn't normalize fatness and fat people shouldn't be proud of their bodies because it's unhealthy. \n\nThe one I just read was talking about how people need to stop saying \"well, what's wrong with being fat?\" not because it minimizes the struggle of eating disorders, but because they think being bad is fat, and then the replies continuing to list all this fatphobic crap about how we shouldn't accept fat bodies and it's only a US thing.\n\nWhich just... isn't it. The body positivity movement and fat activists do have valid criticism they could benefit from, but shaming fat people is not one of them. \n\nI personally believe that fatphobia and fat shaming is an inherently pro-ana, pro-mia, pro-ed, whatever you'd like to call it, behavior and will inherently worsen eating disorders in many people, as well as validating their toxic, disordered behavior, rather than realizing it's not a normal or acceptable thing to do. \n\nI also wonder about the people on the sub who don't have restrictive eating disorders. A lot of binge-eating disorders are motivated by fatphobia. Many times it's internalized fatphobia which perpetuates the binge cycle, as weird as it sounds, because feeling like shit can trigger stress, which triggers binge eating. Obviously, if someone with BED sees this, and is also overweight, that's not going to feel great, and can result in binge eating, or hell, trigger a switch of eating disorders. \n\nI don't get it. I've never been fat myself, and I still understand that being a shitty person and degrading fat people isn't a good thing to do, because suprise, fat people also have feelings and shaming them does absolutely nothing.\n\nYou can't have a safe space for eating disordered individuals, which posts this type of content. The longer I get into recovery, the more I'm realizing that \"safe spaces\" for actively eating disordered individuals reqlly aren't a thing.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ve4fjt/redanonymous_is_becoming_more_and_more_pro_ana/",
  "score": 211,
  "num_comments": 20,
  "comments": [
    {
      "id": "icopgrs",
      "author": "IamNotABaldEagle",
      "body": "I unsubbed recently too. I actually now feel secure enough in recovery (perhaps naively) that it didn't really trigger me but mainly just pissed me off. There was just a massive amount of denial about the reality that you might just need to gain weight. That it's OK to be at a higher weight and yes it'll feel shit at first because you have an eating disorder but it's not intrinsically a moral failing.",
      "created_utc": 1655453469.0,
      "score": 66,
      "context": []
    },
    {
      "id": "icpb3jr",
      "author": "ArcaneAcquaintance",
      "body": "I feel like this generation is normalizing pro-ed stuff again backing it with an \"im not responsible for your triggers\" and some uneducated arguments. Its disturbing. I redownloaded tik tok after over a year of being off it and it took me no time at all to stumble upon clearly disordered videos. Why is it suddenly acceptable to post body checks disguised as \"fit checks\" on public accounts? Do people not feel any responsibility for the things they post? And why do we let our views on health and bodies become trends? I swear we were making so much progress with body positivity/acceptance or atleast the voice was louder than those against it. We can bring back fashion trends without bringing back the toxic ideals of the time...",
      "created_utc": 1655469613.0,
      "score": 48,
      "context": []
    },
    {
      "id": "icofxnq",
      "author": "crycry_chemtrails",
      "body": "Unfortunately, restriction is an ego-syntonic behavior. Society rewards you for it and “fat=unhealthy and unworthy of respect” is the status quo. People don’t like to hear it, but the fatphobic sentiments we have towards ourselves do come out in our behavior, thus perpetuating fatphobia in the world. Then you add the anonymity of online spaces and things get really ugly. Tbh, it’s motivation for me to keep doing the recovery thing. I never want to be so wrapped up in my own illness that I take it out on other people to feel better about myself. Eating disorders are a disease and that sub is great evidence.",
      "created_utc": 1655445824.0,
      "score": 69,
      "context": []
    },
    {
      "id": "icom6vj",
      "author": "cryptic-coyote",
      "body": "Yeah for the sake of my mental health I laugh at the memes and scroll away before I'm tempted to read the comments. Most of the sub is okay, but man some people there are snide for no fucking reason",
      "created_utc": 1655450679.0,
      "score": 26,
      "context": []
    },
    {
      "id": "icoumhp",
      "author": "isleepifart",
      "body": "Oh my god yes. I left after those posts started popping up left and right. \n\nThey keep saying \"being overweight isn't healthy,\" as if being bulimic is? Is being anorexic hEaLtHy?\n\nI was struggling with brain fog, chronic fatigue, random bouts of fainting and amenorrhea tht I still have when I was at my lowest. It's also clear to me as soon as I start getting into a recovery mentality that sub feels horrible to browse. Glad I found this.",
      "created_utc": 1655458062.0,
      "score": 39,
      "context": []
    },
    {
      "id": "ico8s7n",
      "author": "ulieallthetime",
      "body": "That sub is horrible, i unsubscribed the second i left quasi-recovery. It’s literally ran / modded by a girl who posts bodychecks on ed twitter lol",
      "created_utc": 1655441117.0,
      "score": 77,
      "context": []
    },
    {
      "id": "icow699",
      "author": "rileyyj001",
      "body": "I’m honestly noticing similar things in all of the ED subs lately, and I keep trying to tell myself that I’m wrong, and I’m reading into posts far too much. But I’m definitely not! \n\nWhen I first joined them all, I felt good reading about others who are struggling with similar difficulties as I am, but the more I read, the more I am noticing that these subs are fueling me to stay and get sicker. The competitive ED brain is REAL, and I find myself subconsciously trying to out-do and one-up the people who are posting. It’s a sick cycle, and really hard to stop getting sucked into. \n\nI guess I have to remember that these subs are filled with *sick people,* no matter how much focus is put on recovery—wins, “losses,” challenges, fears, etc. \n\nWe can’t control who’s in there, but we can definitely control the content we consume, and sometimes making the break and unsubscribing is the best “medicine” we can take.",
      "created_utc": 1655459402.0,
      "score": 28,
      "context": []
    },
    {
      "id": "icoi6d5",
      "author": "anniekeepsontrying",
      "body": "Oh god yes I saw that recent thread I think you’re partly referring to and wow it ticked me off. The denial!! \nWhy does it always come back to “but being overweight isn’t healthy” as if that’s even the point of HAES. Just goes to show that people don’t get the concept of equal health care. \nAnd what I hate most of all about those “discussions” is the way they make me rethink my whole belief system in a split second like “maybe *I have* been brainwashed by neoliberalism” haha but then I snap out of it. \nHonestly listening to the maintenance phase podcast helped me deal with this a lot these past weeks.",
      "created_utc": 1655447482.0,
      "score": 43,
      "context": []
    },
    {
      "id": "icoy9l0",
      "author": "Sareeee48",
      "body": "I have never liked that sub. They also spread extremely harmful misinformation about extreme hunger that are literally keeping people sick.\n\nIt also frustrates me because fatphobia *is* a form of systemic oppression that is closely tied to racism, homophobia, and transphobia (just pointing this out because I saw it mentioned in your post) and to dismiss that is ignoring huge facets of the oppression of minorities. Fatphobia affects *everyone*, but especially minorities.",
      "created_utc": 1655461150.0,
      "score": 34,
      "context": []
    },
    {
      "id": "icomn3m",
      "author": "None",
      "body": "As someone who was the fat kid their entire lives and just got, well somewould say skinny, some would say normal, I experienced fat phobia quite a lot. I mean I got bullied for my body when I wasn't even overweight yet. I wasn't unhealthy. But I loves food so I turned to it and I started eating one extra meal a day. I didn't binge, and I only very slowly gained weight, but that was my initial response to the bullying. But my disorderd thoughts that I have to loose weight and that I wished I had cancer or anorexia started in that time period. Fast forward to the first lockdown I lost weight the first time. Than I had to gain it back in treatment. Then I had a b/p episode in 2021 where I gained like 25 pounds. And since last fall I lost 45 pounds aka 25% of my body weight and got diagnosed with anorexia (atypical bc I'm still at a normal weight). The illness I wished I had, because of the fat phobia I experienced.",
      "created_utc": 1655451063.0,
      "score": 11,
      "context": []
    },
    {
      "id": "icowe5l",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1655459587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "icpbyk6",
      "author": "busted3000",
      "body": "> Do people not feel any responsibility for the things they post?\n\nSadly I think that sums a lot of this up. You make a really good point in that we were making progress, a lot of things lately do feel like a step backwards. It’s a real shame.",
      "created_utc": 1655470076.0,
      "score": 19,
      "context": [
        {
          "id": "icpb3jr",
          "author": "ArcaneAcquaintance",
          "body": "I feel like this generation is normalizing pro-ed stuff again backing it with an \"im not responsible for your triggers\" and some uneducated arguments. Its disturbing. I redownloaded tik tok after over a year of being off it and it took me no time at all to stumble upon clearly disordered videos. Why is it suddenly acceptable to post body checks disguised as \"fit checks\" on public accounts? Do people not feel any responsibility for the things they post? And why do we let our views on health and bodies become trends? I swear we were making so much progress with body positivity/acceptance or atleast the voice was louder than those against it. We can bring back fashion trends without bringing back the toxic ideals of the time...",
          "created_utc": 1655469613.0
        }
      ]
    },
    {
      "id": "icoccr6",
      "author": "biancamaugeri",
      "body": "fun fact! she also mods the eugenia sub. i think that’s all the we need to know.",
      "created_utc": 1655443364.0,
      "score": 68,
      "context": [
        {
          "id": "ico8s7n",
          "author": "ulieallthetime",
          "body": "That sub is horrible, i unsubscribed the second i left quasi-recovery. It’s literally ran / modded by a girl who posts bodychecks on ed twitter lol",
          "created_utc": 1655441117.0
        }
      ]
    },
    {
      "id": "icoox42",
      "author": "poopystinky7",
      "body": "ohhh my fucking god no way. that’s the final straw lmao i am OUTTA there",
      "created_utc": 1655453003.0,
      "score": 30,
      "context": [
        {
          "id": "ico8s7n",
          "author": "ulieallthetime",
          "body": "That sub is horrible, i unsubscribed the second i left quasi-recovery. It’s literally ran / modded by a girl who posts bodychecks on ed twitter lol",
          "created_utc": 1655441117.0
        }
      ]
    },
    {
      "id": "icoj3aq",
      "author": "SmolBeanAmina",
      "body": "Saying \"being overweight isn't healthy\" as if being anorexic or bulimic is? I was the unhealthiest I'd ever been at my lowest weight and I wasn't even underweight, I felt much happier, healthier and focused better in my previous body, which people considered to be unhealthy for me as if they know what is better for me :/ the pro-ana content on edanonymous also bothered me a lot but I thought I was just being \"jealous\" to not be able to relate to them anymore",
      "created_utc": 1655448192.0,
      "score": 46,
      "context": [
        {
          "id": "icoi6d5",
          "author": "anniekeepsontrying",
          "body": "Oh god yes I saw that recent thread I think you’re partly referring to and wow it ticked me off. The denial!! \nWhy does it always come back to “but being overweight isn’t healthy” as if that’s even the point of HAES. Just goes to show that people don’t get the concept of equal health care. \nAnd what I hate most of all about those “discussions” is the way they make me rethink my whole belief system in a split second like “maybe *I have* been brainwashed by neoliberalism” haha but then I snap out of it. \nHonestly listening to the maintenance phase podcast helped me deal with this a lot these past weeks.",
          "created_utc": 1655447482.0
        }
      ]
    },
    {
      "id": "icomjnh",
      "author": "ulieallthetime",
      "body": "“bEinG oVerWeIgHt iS uNhEaLThY” - someone whose literal organs are shutting down from malnutrition",
      "created_utc": 1655450982.0,
      "score": 39,
      "context": [
        {
          "id": "icoi6d5",
          "author": "anniekeepsontrying",
          "body": "Oh god yes I saw that recent thread I think you’re partly referring to and wow it ticked me off. The denial!! \nWhy does it always come back to “but being overweight isn’t healthy” as if that’s even the point of HAES. Just goes to show that people don’t get the concept of equal health care. \nAnd what I hate most of all about those “discussions” is the way they make me rethink my whole belief system in a split second like “maybe *I have* been brainwashed by neoliberalism” haha but then I snap out of it. \nHonestly listening to the maintenance phase podcast helped me deal with this a lot these past weeks.",
          "created_utc": 1655447482.0
        }
      ]
    },
    {
      "id": "icoyg2q",
      "author": "Sareeee48",
      "body": "Actually, there aren’t many *unbiased* studies about being “overweight” and having a heightened risk of disease. Like… I just find it strange that people in larger bodies are apparently more at risk, but also live longer? I’ve done a lot of research on the topic and I’ve found that virtually all studies linking being fat to health risks are promoted by the dieting and weight loss industries as well as big drug companies that make weight loss medication and donate huge amounts of money on anti-fat rhetoric to make money. There’s a reason the dieting and weight loss industry are banking $7 billion dollars a year. Point being, correlation is not causation and people don’t understand that, especially over in that sub.",
      "created_utc": 1655461293.0,
      "score": 14,
      "context": [
        {
          "id": "icowe5l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655459587.0
        }
      ]
    },
    {
      "id": "icocth8",
      "author": "ulieallthetime",
      "body": "looool of course she does",
      "created_utc": 1655443672.0,
      "score": 28,
      "context": [
        {
          "id": "ico8s7n",
          "author": "ulieallthetime",
          "body": "That sub is horrible, i unsubscribed the second i left quasi-recovery. It’s literally ran / modded by a girl who posts bodychecks on ed twitter lol",
          "created_utc": 1655441117.0
        },
        {
          "id": "icoccr6",
          "author": "biancamaugeri",
          "body": "fun fact! she also mods the eugenia sub. i think that’s all the we need to know.",
          "created_utc": 1655443364.0
        }
      ]
    },
    {
      "id": "icomcop",
      "author": "cottonandvelvet",
      "body": "wait tf really",
      "created_utc": 1655450816.0,
      "score": 21,
      "context": [
        {
          "id": "ico8s7n",
          "author": "ulieallthetime",
          "body": "That sub is horrible, i unsubscribed the second i left quasi-recovery. It’s literally ran / modded by a girl who posts bodychecks on ed twitter lol",
          "created_utc": 1655441117.0
        },
        {
          "id": "icoccr6",
          "author": "biancamaugeri",
          "body": "fun fact! she also mods the eugenia sub. i think that’s all the we need to know.",
          "created_utc": 1655443364.0
        }
      ]
    },
    {
      "id": "icoj8sl",
      "author": "anniekeepsontrying",
      "body": "Exactly! It’s like that saying where you’re in a glass house throwing stones (is that a thing in englisch?). Also “health” is really just the scapegoat in these discussions",
      "created_utc": 1655448309.0,
      "score": 19,
      "context": [
        {
          "id": "icoi6d5",
          "author": "anniekeepsontrying",
          "body": "Oh god yes I saw that recent thread I think you’re partly referring to and wow it ticked me off. The denial!! \nWhy does it always come back to “but being overweight isn’t healthy” as if that’s even the point of HAES. Just goes to show that people don’t get the concept of equal health care. \nAnd what I hate most of all about those “discussions” is the way they make me rethink my whole belief system in a split second like “maybe *I have* been brainwashed by neoliberalism” haha but then I snap out of it. \nHonestly listening to the maintenance phase podcast helped me deal with this a lot these past weeks.",
          "created_utc": 1655447482.0
        },
        {
          "id": "icoj3aq",
          "author": "SmolBeanAmina",
          "body": "Saying \"being overweight isn't healthy\" as if being anorexic or bulimic is? I was the unhealthiest I'd ever been at my lowest weight and I wasn't even underweight, I felt much happier, healthier and focused better in my previous body, which people considered to be unhealthy for me as if they know what is better for me :/ the pro-ana content on edanonymous also bothered me a lot but I thought I was just being \"jealous\" to not be able to relate to them anymore",
          "created_utc": 1655448192.0
        }
      ]
    },
    {
      "id": "icp98sg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1655468589.0,
      "score": 1,
      "context": [
        {
          "id": "icowe5l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655459587.0
        },
        {
          "id": "icoyg2q",
          "author": "Sareeee48",
          "body": "Actually, there aren’t many *unbiased* studies about being “overweight” and having a heightened risk of disease. Like… I just find it strange that people in larger bodies are apparently more at risk, but also live longer? I’ve done a lot of research on the topic and I’ve found that virtually all studies linking being fat to health risks are promoted by the dieting and weight loss industries as well as big drug companies that make weight loss medication and donate huge amounts of money on anti-fat rhetoric to make money. There’s a reason the dieting and weight loss industry are banking $7 billion dollars a year. Point being, correlation is not causation and people don’t understand that, especially over in that sub.",
          "created_utc": 1655461293.0
        }
      ]
    },
    {
      "id": "icpb1en",
      "author": "Sareeee48",
      "body": "I never said they *falsified* statistics. I said that correlation is not causation. It may be misinterpreting them but that doesn’t necessarily make the narrative they spread true either, when biases play a huge role in weight loss studies and studies relating to fat bodies. To ignore the role that big drug companies play in biased studies is absolutely relevant, especially the majority of these studies don’t extend to long term documentation.\n\nI mentioned this to begin with because many people don’t factor in the systemic disadvantages of living in a larger body, from fewer employment opportunities to inadequate medical treatment that lead to hoverall poorer health outcomes that skew these statistics. Not because they are *fat*, but because they literally aren’t getting the same medical treatment or living wages as others in a smaller body. Again, correlation is not causation.",
      "created_utc": 1655469581.0,
      "score": 15,
      "context": [
        {
          "id": "icowe5l",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655459587.0
        },
        {
          "id": "icoyg2q",
          "author": "Sareeee48",
          "body": "Actually, there aren’t many *unbiased* studies about being “overweight” and having a heightened risk of disease. Like… I just find it strange that people in larger bodies are apparently more at risk, but also live longer? I’ve done a lot of research on the topic and I’ve found that virtually all studies linking being fat to health risks are promoted by the dieting and weight loss industries as well as big drug companies that make weight loss medication and donate huge amounts of money on anti-fat rhetoric to make money. There’s a reason the dieting and weight loss industry are banking $7 billion dollars a year. Point being, correlation is not causation and people don’t understand that, especially over in that sub.",
          "created_utc": 1655461293.0
        },
        {
          "id": "icp98sg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655468589.0
        }
      ]
    }
  ]
}