{
  "id": "vfu6lw",
  "subreddit": "fuckeatingdisorders",
  "author": "saladflambe",
  "created_utc": 1655641903.0,
  "title": "Recovery Exercise: Things That Matter More Than Your Body Size/Appearance",
  "selftext": "Thought I'd invite everyone to join me on a recovery exercise. See, I'm 35, and I'm finally getting into the ages where IDGAF anymore...at least a little bit. It's relieving. It's relieving to look at my squishy, saggy, had-2-kids body and be like \"meh.\" It's relieving to just...not...care. Because who am I even trying to impress anymore?\n\nAnyways, so I thought I'd suggest everyone who feels like participating list 5 things that matter MORE than your body size/appearance. I'll start in the comments.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vfu6lw/recovery_exercise_things_that_matter_more_than/",
  "score": 121,
  "num_comments": 34,
  "comments": [
    {
      "id": "icxs319",
      "author": "saladflambe",
      "body": "1. Being present for my kids\n2. Being patient and kind, trying to stop generational trauma with me\n3. I foster kitties - so...that work!\n4. Being authentic in my vulnerability - not just pretending to be genuine and vulnerable, but showing the hard, ugly, rawness of life\n5. Giving back, showing love, showing up",
      "created_utc": 1655642065.0,
      "score": 75,
      "context": []
    },
    {
      "id": "icy0cuk",
      "author": "IamNotABaldEagle",
      "body": "1) My husband and child\n\n2) Kindness/Usefulness (I'm probably not going to cure cancer but I'd like to make the world just a little bit better)\n\n3) Being interested and interesting. (I love learning new things!)\n\n4) New experiences. (Travel, music, food - just living life).\n\n5) Individuality. (just being a genuine version of me).",
      "created_utc": 1655646972.0,
      "score": 41,
      "context": []
    },
    {
      "id": "icy1unu",
      "author": "selkieflying",
      "body": "1. Actually having a personality\n\n2. developing interests and hobbies that lead to satisfaction and fulfillment and fun\n\n3.. Being able to be present and kind in my interactions with others\n\n4. Being a good rat owner \n\n5.. The fact that this world is ridiculous and beautiful and weird and the physical form I take is so, so insignificant compared to the magnitude of existence",
      "created_utc": 1655647765.0,
      "score": 40,
      "context": []
    },
    {
      "id": "icxtlof",
      "author": "None",
      "body": "god, i love this. sadly right now i’m in a phase of recovery when i’m really unsure about a lot of stuff, but i’ll get there. \n\nyou’re right though, there are **so** many things that matter more than our appearance, size or weight. we’re so much more than that.",
      "created_utc": 1655643042.0,
      "score": 32,
      "context": []
    },
    {
      "id": "icxxznc",
      "author": "ThrowAwayChick1997",
      "body": "1. I WORK in ED as a therapist, how my body looks literally does not matter, rather my skills are what help people \n2. My cats love me and make biscuits on me\n3. My boyfriend thinks I’m an amazing human\n4. My body can walk me around the gorgeous city I live in\n5. I’m able to show up in my friendships and family because I’m sober & happy",
      "created_utc": 1655645665.0,
      "score": 27,
      "context": []
    },
    {
      "id": "icxygtt",
      "author": "nevermorethanbefore",
      "body": "1. Having energy to play with my daughter\n2. Focusing on family and friends\n3. Making memories and enjoying life \n4. Having a personality rather than just being miserable all the time. \n5. Literally everything… being able to work and enjoy it. Think about things other than food. Thinking clearly and enjoying hobbies. Being able to truly listen to others and engage.",
      "created_utc": 1655645933.0,
      "score": 20,
      "context": []
    },
    {
      "id": "icy2ur2",
      "author": "ami-goinganywhere-",
      "body": "1. My amazing boyfriend, and having energy to spend time with him and be able to watch our relationship flourish.\n2. I can actually run now, MILES! And do yoga, without getting tired or feeling ill.\n3. I’m finally into cooking- slowly learning how to cook without counting/weighing things, scary but fun.\n4. I work for a homeless charity, the work is meaningful and helping people has nothing to do with my body.\n5. Sleep, looking after myself, general self care- I finally have energy to tick those boxes, so I’m feeling more mentally balanced than I ever did when I thought counting every calorie would help that.",
      "created_utc": 1655648289.0,
      "score": 21,
      "context": []
    },
    {
      "id": "icy4j4m",
      "author": "thenemesissss",
      "body": "1. my wife and daughter. will forever be top one. \n\n2.  being able to be present for my siblings and friends with their important milestones. my own too of course. \n\n3. get back into my superstar mode with my performing arts career. i miss being able to perform and even coach without feeling weak. this one is still a work in progress but very important to me.\n\n4. caring about myself. actually focusing on my overall health and not letting it slowly kill me. \n\n5. getting to see how beautiful life really is and wanting to be here longer. \n\ni’m not in the nicest place of recovery right now, but these are some things i try to remind myself.",
      "created_utc": 1655649131.0,
      "score": 16,
      "context": []
    },
    {
      "id": "icy36br",
      "author": "otter_potter_1",
      "body": "1. my ability to walk and play with my dog\n\n2. being able to push my brain to its best and focus on new ideas rather than food and exercise\n\n3. being kind to everyone around me rather than being cranky half the time\n\n4. spending time with family and focusing on the time with them and food adds to that experience\n\n5. flexibility! choosing to be spontaneous rather than stick to a rigid routine",
      "created_utc": 1655648450.0,
      "score": 14,
      "context": []
    },
    {
      "id": "icy5wky",
      "author": "Spectrachic311311",
      "body": "1) Being a great wife and a fun aunt to my nieces and nephews \n\n2) Being a kind and selfless person, which is the opposite of what ED makes me\n\n3) Being the best dog mom to my fur baby. She absolutely doesn’t care what my body looks like.\n\n4) Being a helping partner at home and a valuable contributor at work. ED makes those things difficult sometimes.\n\nYou’re right—there’s so so much more to life than how we look. I’m also at the “IDGAF” stage of my life where I’m not trying to impress anyone anymore. So why do I still let ED have its way?",
      "created_utc": 1655649825.0,
      "score": 13,
      "context": []
    },
    {
      "id": "icybnwf",
      "author": "insomniacla",
      "body": "1. Being present for my brothers and friends.\n2. My work.\n3. Finishing law school.\n4. All of my hobbies, including the ones I suck at. \n5. Saying 'fuck you' to my abuser by living a good life and being a better person than I was raised to be.",
      "created_utc": 1655652636.0,
      "score": 13,
      "context": []
    },
    {
      "id": "icydrzw",
      "author": "Specific-Environment",
      "body": "1. My relationship with my family and friends\n2. My career\n3. Peace and quiet in my mind\n4. Being able to actually DO stuff \n5. Engaging fully in conversation/ experience",
      "created_utc": 1655653633.0,
      "score": 10,
      "context": []
    },
    {
      "id": "icye2ep",
      "author": "None",
      "body": "i love this way of thinking! it really helps me not fall back into bad habits.\n\n1) my grades at uni\n2) working on my crochet and embroidery \n3) having the energy to go on walks in the woods \n4) being able to eat my mum's cooking\n5) working on new skills, piano and german \n\nreminder to everyone looking at comments rn: recovery is not linear and that's okay. sometimes a difficult period hits after you've been okay for a while but that doesn't mean you're failing! just keep going forward and remember what's important to you.",
      "created_utc": 1655653768.0,
      "score": 9,
      "context": []
    },
    {
      "id": "icyhonk",
      "author": "threadofhope",
      "body": "It's funny that work didn't make my list 😂\n\n1. Attending to my needs, feelings and wants (sometimes).\n2. Being relational w/ people who can reciprocate intimacy.\n3. Laughing and having fun\n4. Staying curious and discovering new things.\n5. Planning for the future (kinda think I have one).",
      "created_utc": 1655655461.0,
      "score": 8,
      "context": []
    },
    {
      "id": "icyisox",
      "author": "skoto_koto11",
      "body": "1. being able to hang out with my friends and actually have fun\n\n2. to be able to exercise for endurance goals (i’m pretty much fully recovered) and not as a means to burn calories (and to feel energized and happy whilst doing it !)\n\n3. to be present with my family and the experiences i’m having now (not overrun with food or body thoughts)\n\n4. caring about actual people and things, not just being hollow and  miserable \n\n5. to now be able to see that i could have a happy future and wanting to keep it that way :)",
      "created_utc": 1655655975.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iczaew0",
      "author": "ForestRagamuffin",
      "body": "1. chocolate\n2. cuddling my friends extravagantly and not worrying about how they perceive my body\n3. eating all the delicious cakes and cookies my 14 yo nephew bakes for me and feeling loved instead of worried about ED things\n4. all the caterpillars who keep falling into my yurt and needing my help to get back outside (they're a bunch of fluffy sillies)\n5. my friends. just everything about them is more important to me than my appearance. i love them so much",
      "created_utc": 1655668725.0,
      "score": 6,
      "context": []
    },
    {
      "id": "icyqgs2",
      "author": "juljarjar",
      "body": "Such a great exercise ! Here are mine:\n\n1. being present in life and actually experiencing the things /environment /people around me \n\n2. having a brain that works and is able to solve problems\n\n3. actually having fun with my son \n\n4. Being genuinely interested in other things than food such as my friends and family \n\n5. Chocolate",
      "created_utc": 1655659534.0,
      "score": 6,
      "context": []
    },
    {
      "id": "icyuagf",
      "author": "withonlygrace",
      "body": "Thanks for doing this :) my ED isn’t super appearance-centered anymore, it’s more like “well what else would I do with my time?” so it’s good to think about. Really what I care about most is just being a good person to others. That, and having a good time/going on adventures/enjoying myself. Living a life I won’t regret.",
      "created_utc": 1655661307.0,
      "score": 6,
      "context": []
    },
    {
      "id": "icyxjii",
      "author": "bloodyyuno",
      "body": "1. Enjoying the little things in my life, like the sun in my yard.\n2. Date nights with my fantastic partner.\n3. Having time to relax.\n4. Exploring my creative pursuits.\n5. Spending time with my friends.",
      "created_utc": 1655662817.0,
      "score": 6,
      "context": []
    },
    {
      "id": "icz7380",
      "author": "hannybin",
      "body": "1. My daughter and how she views me\n2. My job and my ability to do the work\n3. Music. All the music\n4. My best friends and being able to be present for them\n5. Sleep",
      "created_utc": 1655667216.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iczf17m",
      "author": "onlyheinzbakedbeans",
      "body": "1- Being able to think about something else than food I can or cannot eat\n2- Rediscovering my true self\n3- Making the most of each day and wanting to enjoy life to the fullest because I realised how many years been wasted \n4- Did you know you could eat what you bake ? Mind blowing I know. And freaking good too. \n5- Being present, enjoying social life, not stressing about meals out",
      "created_utc": 1655670856.0,
      "score": 5,
      "context": []
    },
    {
      "id": "icylxbm",
      "author": "sj0714",
      "body": "I wish you luck oo, this made me sad for myself and am glad you are getting better",
      "created_utc": 1655657417.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iczymfr",
      "author": "coachavocado",
      "body": "1. spending quality time with my parents. \n2. enjoying time with my friends. \n3. trying new foods and experiences. \n4. working hard and being able to enjoy what I do. \n5. laughing!!!\n\nthis made me realize and reflect on my priorities. thanks for the activity :)",
      "created_utc": 1655680474.0,
      "score": 3,
      "context": []
    },
    {
      "id": "id0gv3s",
      "author": "conceivablytheo",
      "body": "1. having energy and stability; for the people in my life, for my hobbies, for the version of myself that i know i want to be\n2. being present in a moment. getting to enjoy meals, nights out, nature, and life in general without a disordered motivation behind it\n3. my art, and not just the art that comes from darkness\n4. kindness. it is so difficult to be kind to others when you don’t afford yourself the same treatment\n5. love",
      "created_utc": 1655690397.0,
      "score": 3,
      "context": []
    },
    {
      "id": "id0idfj",
      "author": "YogurtclosetOk2793",
      "body": "1. Enjoying my life. Being present instead of fixating on how I look.\n\n2. Getting to move without being in pain!\n\n3. More time for things that bring me joy in life- hobbies, road trips…\n\n4. Getting to eat with people + not having to turn down foods made or bought with love \n\n5. I’ve always wanted to leave the world better than the way I came into it. That starts with myself! And, I can’t do that fully when deeply stuck in my ED",
      "created_utc": 1655691228.0,
      "score": 3,
      "context": []
    },
    {
      "id": "id1458w",
      "author": "applecinnamonnn",
      "body": "1- taking a bite of my daughter’s food when she offers something to me without spitting it;\n2- showing my husband that I’ve cherished all of his support and it really helped me wanting to find a reason to actually be here;\n3- because deep down I believe you can achieve a healthy body with good balanced nutrition and exercise (which I really miss since becoming a mom during a pandemic. Time is a luxury but we all struggle);\n4-stop thinking about eating or not eating from the moment I wake up to when I go to sleep\n5-be free",
      "created_utc": 1655705252.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id16ahr",
      "author": "samoshka123",
      "body": "Love the thread! Thanks for starting it!\n1. Financial independence\n2. My family & health\n3. Climate action. (No car no meat less heating/ac)\n4. Helping others\n5. Skincare ( sorry it's about the way to look but it's just so different than Ed)",
      "created_utc": 1655706973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id1h1z6",
      "author": "VariousResearcher439",
      "body": "1) being able to sit, study, and finally get on with college\n2) being present and able to actually hang out with others\n3) not being a slave to OCD-ED\n4) spending evenings indoors safe and warm, not outside running\n5) being strong and focused for surfing",
      "created_utc": 1655716589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id1m3hi",
      "author": "honeynutlatte13",
      "body": "1. My family — my parents sisters, grandparents, cousins, aunts and uncles who all love me \n2. My career — I’m at an amazing law school on my dream career path\n3. My art — I’ve always been artistic and loved to draw and paint, and I’ve improved a lot over the years \n4. Learning — I love to read and explore and travel and learn new things \n5. Kindness — the past year has been a living hell for me and I understand more than ever that kindness and showing love to others is the most important priority I have",
      "created_utc": 1655721105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id06eiq",
      "author": "moooooopg",
      "body": "I wish my Ed was about what I looked like..",
      "created_utc": 1655684634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "icyn3dj",
      "author": "salientmould",
      "body": "Yaasss another rat owner! Honestly, I was such a bad rat parent when I was in the depths of it. Those little guys deserve the best",
      "created_utc": 1655657960.0,
      "score": 8,
      "context": [
        {
          "id": "icy1unu",
          "author": "selkieflying",
          "body": "1. Actually having a personality\n\n2. developing interests and hobbies that lead to satisfaction and fulfillment and fun\n\n3.. Being able to be present and kind in my interactions with others\n\n4. Being a good rat owner \n\n5.. The fact that this world is ridiculous and beautiful and weird and the physical form I take is so, so insignificant compared to the magnitude of existence",
          "created_utc": 1655647765.0
        }
      ]
    },
    {
      "id": "icxtrlv",
      "author": "saladflambe",
      "body": "You can still practice :) go ahead - list some things!",
      "created_utc": 1655643148.0,
      "score": 23,
      "context": [
        {
          "id": "icxtlof",
          "author": "None",
          "body": "god, i love this. sadly right now i’m in a phase of recovery when i’m really unsure about a lot of stuff, but i’ll get there. \n\nyou’re right though, there are **so** many things that matter more than our appearance, size or weight. we’re so much more than that.",
          "created_utc": 1655643042.0
        }
      ]
    },
    {
      "id": "iczyp26",
      "author": "selkieflying",
      "body": "Number 5 is a HUGE one!",
      "created_utc": 1655680512.0,
      "score": 1,
      "context": [
        {
          "id": "icy2ur2",
          "author": "ami-goinganywhere-",
          "body": "1. My amazing boyfriend, and having energy to spend time with him and be able to watch our relationship flourish.\n2. I can actually run now, MILES! And do yoga, without getting tired or feeling ill.\n3. I’m finally into cooking- slowly learning how to cook without counting/weighing things, scary but fun.\n4. I work for a homeless charity, the work is meaningful and helping people has nothing to do with my body.\n5. Sleep, looking after myself, general self care- I finally have energy to tick those boxes, so I’m feeling more mentally balanced than I ever did when I thought counting every calorie would help that.",
          "created_utc": 1655648289.0
        }
      ]
    },
    {
      "id": "iczvni1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1655678948.0,
      "score": 2,
      "context": [
        {
          "id": "icy4j4m",
          "author": "thenemesissss",
          "body": "1. my wife and daughter. will forever be top one. \n\n2.  being able to be present for my siblings and friends with their important milestones. my own too of course. \n\n3. get back into my superstar mode with my performing arts career. i miss being able to perform and even coach without feeling weak. this one is still a work in progress but very important to me.\n\n4. caring about myself. actually focusing on my overall health and not letting it slowly kill me. \n\n5. getting to see how beautiful life really is and wanting to be here longer. \n\ni’m not in the nicest place of recovery right now, but these are some things i try to remind myself.",
          "created_utc": 1655649131.0
        }
      ]
    },
    {
      "id": "iczw5w2",
      "author": "thenemesissss",
      "body": "thank you💕💕",
      "created_utc": 1655679210.0,
      "score": 1,
      "context": [
        {
          "id": "icy4j4m",
          "author": "thenemesissss",
          "body": "1. my wife and daughter. will forever be top one. \n\n2.  being able to be present for my siblings and friends with their important milestones. my own too of course. \n\n3. get back into my superstar mode with my performing arts career. i miss being able to perform and even coach without feeling weak. this one is still a work in progress but very important to me.\n\n4. caring about myself. actually focusing on my overall health and not letting it slowly kill me. \n\n5. getting to see how beautiful life really is and wanting to be here longer. \n\ni’m not in the nicest place of recovery right now, but these are some things i try to remind myself.",
          "created_utc": 1655649131.0
        },
        {
          "id": "iczvni1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655678948.0
        }
      ]
    }
  ]
}