{
  "id": "vh8hky",
  "subreddit": "fuckeatingdisorders",
  "author": "tttthrrrowwwawwwayyy",
  "created_utc": 1655800307.0,
  "title": "Triggered for the first time in two years by my fiancé",
  "selftext": "First off. Fuck eating disorders. Fuck our society’s beauty standards. I am a human. Nothing more, nothing less. \n\nI struggled with an eating disorder from 2017-2020. I am very lucky that I was able to get past it, and I would have considered myself fully recovered. \n\nWhen I first was with my fiancé, I was at an underweight bmi. I’m now on the lower end of normal. Really not a big difference. \n\nHe mentions how we need to get in shape (I exercise for my mental health, I don’t need to exercise more). The only girls he comments on are waif thin. He has showed me girls on Instagram that he finds attractive, again extremely thin (too thin). He comments about how we eat if he deems it too “unhealthy,” he’s a big controlling about when we eat, and if we’re out and I want a snack, his attitude is one of “you’re fine, you can wait.”\n\nThe other day he pointed out a girl he found beautiful, extremely thin. I said, “you’re really attracted to thin girls it seems.” He responded, “yes, I like skinny girls.” \n\nHe’s lost attraction to me it seems. He doesn’t put much effort into out sex life. He expects sex 2-4 times a day, but I feel like a doll for him to use. \n\nFor the first time since recovering, I feel those thoughts creeping back and I am terrified. I feel like I’m losing control. I know this is extremely unhealthy, and honestly the problem is probably my brain distorting everything. I’m currently in his country where the beauty standard leans even more towards extremely thin girls. I have one more month here, but all I want to do is go home and do therapy.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vh8hky/triggered_for_the_first_time_in_two_years_by_my/",
  "score": 136,
  "num_comments": 48,
  "comments": [
    {
      "id": "id5tvwd",
      "author": "Spare_Competition941",
      "body": "Get out of that relationship",
      "created_utc": 1655801829.0,
      "score": 281,
      "context": []
    },
    {
      "id": "id60ffp",
      "author": "Sareeee48",
      "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
      "created_utc": 1655807572.0,
      "score": 174,
      "context": []
    },
    {
      "id": "id5tyzj",
      "author": "HackedTheGate",
      "body": "Ditch him. He doesn't sound like the type of person you'd want anything to do with.",
      "created_utc": 1655801909.0,
      "score": 84,
      "context": []
    },
    {
      "id": "id60jgl",
      "author": "mandanic",
      "body": "2-4 times a day?! Jesus. This does not sound like a healthy relationship for several reasons. Get out of the relationship and country. Choose you. There’s so much better out there.",
      "created_utc": 1655807663.0,
      "score": 68,
      "context": []
    },
    {
      "id": "id5z9k5",
      "author": "busted3000",
      "body": "Go home right away and get therapy, without him. Then don’t go back to him. He’s not a good partner, he’s controlling and mean.",
      "created_utc": 1655806607.0,
      "score": 53,
      "context": []
    },
    {
      "id": "id63lid",
      "author": "IamNotABaldEagle",
      "body": "Run as fast as you can from that man and never look back. That man is vile in many different ways.",
      "created_utc": 1655810011.0,
      "score": 46,
      "context": []
    },
    {
      "id": "id6opba",
      "author": "tdc8557",
      "body": "This is not the guy for you. I was in a similar situation when I relapsed and the guy I was dating was obsessed with food, image, exercise, etc. he didn’t want me to go to treatment because it was inconvenient for him. He refused to acknowledge that I was malnourished. and the final straw was when I was inpatient, he asked me if I weighed more than I did when we met. \n\nTrust me, you deserve someone who will love you no matter what. Who will support you in recovery. Someone who has your back and won’t comment on your food or body or control what or when you eat. \n\nPlease consider if this relationship is serving you. You are so worthy of a full and happy life.",
      "created_utc": 1655821642.0,
      "score": 30,
      "context": []
    },
    {
      "id": "id6a75k",
      "author": "None",
      "body": "your bf is a dick. dump him.",
      "created_utc": 1655814320.0,
      "score": 22,
      "context": []
    },
    {
      "id": "id6sez6",
      "author": "Shot_Revolution6614",
      "body": "I‘m sorry but this guy sounds like the biggest douche this is not healthy or right in any way!! Of course you feel triggered!! Dump the shit out of him. I‘ve been in toxic relationships before and I know how hard it is to get out but that is the best thing you can do for yourself! That idiot doesn‘t deserve you. Not at all. You are worth way more than that. Fuck him.",
      "created_utc": 1655823264.0,
      "score": 17,
      "context": []
    },
    {
      "id": "id6vupt",
      "author": "petitelinotte212",
      "body": "It is not normal for your fiancé to be showing you pictures of girls he finds attractive, or pointing out other women he's attracted to. Of course its natural to feel some degree of physical attraction to other people, but I think its really hurtful to bring those images or point out those people to *you*: there's an implied comparison between you and these other women, which is making you feel insecure - and I'm sure he's aware of that, unless he's incredibly stupid. That's not healthy, loving, or supportive, to feel like you're being scrutinized. \n\nAttraction to purely physical qualities is part of nearly every relationship in the beginning, but by the time you're thinking about things like marriage, your love should have deepened into a stronger bond beyond the physical: there should be admiration, respect, and loyalty that aren't about your appearance. You're going to spend the rest of your life with this person, surely he understands that you will both age, your bodies will change, and you should both expect to be loved regardless. Sex is also not something one party demands and the other submits to - sexual desire should be mutual and shared, as should sexual pleasure, its not an obligation. Its up to both partners to foster desire in their partner if they want to engage in intimacy: if you're not feeling it, and he really wants sex, then he needs to learn what does turn you on and do those things. He doesn't sound very concerned with your pleasure. Is that what you want the rest of your sex life to be?\n\nI don't know my friend, I think the problem here is your fiancé - you actually sound like you've handled your ED recovery beautifully and he's just dragging you back down. Maybe you *should* just go home and get back into therapy. He's clearly in your head, and as we all do in relationships that aren't the best that we really want to work, you're rationalizing and normalizing this treatment: but it isn't ok. Whether or not you're \"ok with it.\" Though I suspect once you're out of his grasp and back in therapy you'll probably realize that you aren't (nor should you be!)",
      "created_utc": 1655824746.0,
      "score": 13,
      "context": []
    },
    {
      "id": "id6dqqt",
      "author": "None",
      "body": "What a gross person he is. Do you really want this man by your side?",
      "created_utc": 1655816315.0,
      "score": 13,
      "context": []
    },
    {
      "id": "id6i91k",
      "author": "leahkathx",
      "body": "personally i would drop him",
      "created_utc": 1655818638.0,
      "score": 12,
      "context": []
    },
    {
      "id": "id6hlce",
      "author": "Funky_Lesbian",
      "body": "drop him. he’s not worth your time or your well-being. sounds like a real POS to me",
      "created_utc": 1655818312.0,
      "score": 8,
      "context": []
    },
    {
      "id": "id6hmqy",
      "author": "ewoksaretinybears",
      "body": "you don’t need to spend more time in that shit hole with that trash",
      "created_utc": 1655818331.0,
      "score": 8,
      "context": []
    },
    {
      "id": "id6w5dq",
      "author": "nancytwomills",
      "body": "girl, you don't need to be in this relationship. prioritizing your sanity also means moving away from people who don't do you good, who make you question something that shouldn't be an issue (especially a boyfriend)",
      "created_utc": 1655824870.0,
      "score": 7,
      "context": []
    },
    {
      "id": "id727pz",
      "author": "OWENISAGANGSTER",
      "body": "who the hell has sex four times a day? Jesus christ. I'd be thrilled with four times a year at this point",
      "created_utc": 1655827451.0,
      "score": 5,
      "context": []
    },
    {
      "id": "id730e6",
      "author": "None",
      "body": "That’s highly abusive and the fact that he wants sex 2-4 times per DAY is insane.",
      "created_utc": 1655827794.0,
      "score": 6,
      "context": []
    },
    {
      "id": "id8g37s",
      "author": "kalli889",
      "body": "“I feel like a doll for him to use.”\n\nPlease read and watch videos about covert narcissism.  Feeling used sexually is VERY common in relationships with covert narcissists.  Educate yourself without mentioning it to him — narcs can be dangerous when exposed.",
      "created_utc": 1655850091.0,
      "score": 5,
      "context": []
    },
    {
      "id": "id7qmzc",
      "author": "Abrookspug",
      "body": "This won't get better if you marry him. Think about if you want to have kids one day and/or focus on a career, but he's still expecting you to be skinny and sleep with him multiple times a day despite you not having the time or desire to do so. No man should \"expect\" any amount of sex per day. He can want it, but that doesn't mean he should get it every time unless you also want it. \n\nI've been with my husband for 18 years and he knows better than to point out other girls he finds hot (unless I ask, and usually then it's a celebrity who he likes \\*because\\* she's not model skinny). Sure, he's said stupid or triggering things before, especially when we were younger and first dating, but when I let him know, he profusely apologized and never did it again. He doesn't want me to relapse or ever be too skinny, and even though I've gained several pounds  since we met and haven't lost all the baby weight, he still makes me feel beautiful every day. If you don't feel like you could tell your fiance when he's triggered you, and if you don't think he'd be attracted to you at an average weight or higher, leave him. You deserve more than a life of feeling like you have to stay unhealthily skinny and hypersexual for a guy.",
      "created_utc": 1655838386.0,
      "score": 3,
      "context": []
    },
    {
      "id": "id7d32y",
      "author": "h4ppy247",
      "body": "He sounds like a dick. Its not up to him to decide how you treat your body , especially if he knows your past he should be far more careful of what he says. He overall sounds like a dick (why would he show u girls he likes?) But if you really want to be with him maybe have a conversation about how these things make you feel and tell him comments about your body are breaking a boundary",
      "created_utc": 1655832184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id808zq",
      "author": "shiroyagisan",
      "body": "A decent partner would participate in your recovery and try their best not to trigger you. If they do, they would apologise and try never to do it again. They wouldn't make comments like \"we need to get into shape\" or point to other women who appear very underweight.\n\nThis treatment is awful. Please get out of this relationship.",
      "created_utc": 1655842909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id8da1w",
      "author": "awesomeblosom",
      "body": "too many red flags in there to count...",
      "created_utc": 1655848804.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id8envj",
      "author": "Future_Coyote9201",
      "body": "this is terrible, op. you deserve better!!",
      "created_utc": 1655849434.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id8ktcz",
      "author": "Poison-_-Ivy",
      "body": "Please don’t marry him:( you’ll be stuck",
      "created_utc": 1655852311.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id8s1ya",
      "author": "Kind_Term6662",
      "body": "I dont know how to say it different than everyone else but if hes like this, there is absolutely no reason to be with him. I genuinely could not be with a person like this because they believe in everything I'm against. If he thinks this way and thinks you need to be thinner, leave. Please for the love of everything holy, leave if you think hes going to make you relapse or he doesnt change his behavior. If you think he may change, and you really want to be with him, it might be helpful to open up about your disorder, because it may help to prevent him from making insensitive comments. (But seriously, why is he constantly comparing you to other girls and why is he constantly showing you pictures of women he finds prettier??) But you dont owe him anything, as I'm sure you already know. It seems you're really confident in fighting your inner ED voice which is amazing!! I hope to someday be the same way. Please do the thing that's right for you!",
      "created_utc": 1655855790.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id8tx3y",
      "author": "shadysamonthelamb",
      "body": "Break up with this absolute chode. I was rail thin when my husband met me, now I'm 40 lbs overweight. He likes me this way and always compliments my body. There are better men out there.",
      "created_utc": 1655856705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id92j1t",
      "author": "AnybodyLow",
      "body": "What the fuck is up with men who tell their partners about others they find attractive? Lol. Unless it’s asked for, it shouldn’t be so common place. I understand that attraction happens regardless of if you’re in a relationship, but shouting it from the rooftop isn’t necessary.\n\nHe sounds terrible, I’m sorry he (as it seems PURPOSELY) triggers you. You deserve better. Don’t allow people to treat you in a way that you would never want to treat them.",
      "created_utc": 1655860990.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id92y9b",
      "author": "burnerphonepost",
      "body": "Run. Run!",
      "created_utc": 1655861203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id95hdh",
      "author": "sooomanykids",
      "body": "Why the hell are you with him, pointing out girls that he finds attractive is so disrespectful. Next time he does this tell him to go and be with them then and to leave you the F alone! Dump his arse he is not worth the relapse which he seems to be trying to trigger in you.",
      "created_utc": 1655862480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id9s1jv",
      "author": "princesstafarian",
      "body": "Dump him.",
      "created_utc": 1655875267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id9tmoq",
      "author": "Kaywin",
      "body": "His expectations of sex 2-4x a day sounds exhausting. The constant comparisons and showing you girls sound toxic and invalidating asf. *Controlling* what *a grown ass adult* eats is inappropriate at best. I'm so sorry he's doing all this to you. I know you used the word \"fiancé,\" but I hope you know you are worth more than this.\n\nIt shouldn't be your job to educate him about unrealistic beauty standards. OTOH, laying out practically, what it takes to look a certain way (has this adult man seriously never fucking heard of photoshop??) could be eye-opening, *if you think he would be receptive*. If you think he'd brush you off, then... perhaps it's worth considering the possibility he isn't a good match for you at this time. Is he aware of your history? \n\nWould you feel comfortable simply taking a boundary with him around some of these issues? Something like: Telling him you will not discuss Instagram models and if he continues to show you pictures, you'll leave the room for 10 minutes. Explaining to him that you feel degraded when he demands sex from you multiple times a day (!) and yet will turn around and instantly tell you you're worth less than some skinny stranger at the gym. Telling him you will need a break from going to the gym together for a while if he does it again. Reasonable stuff!",
      "created_utc": 1655876388.0,
      "score": 2,
      "context": []
    },
    {
      "id": "id72x78",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1655827755.0,
      "score": -9,
      "context": []
    },
    {
      "id": "id62qfw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1655809368.0,
      "score": -16,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        }
      ]
    },
    {
      "id": "id6vamh",
      "author": "demeter_devi",
      "body": "Agreed. While the amount of sex he wants to have every day is excessive (I've never been with a guy that wanted it more than once a day at most) what's really concerning is how he isn't supportive of OP's dietary issues and is constantly pressuring her to be thinner by showing her photos of other women, even though she's recovering from an ED. OP this man is not good for you!",
      "created_utc": 1655824510.0,
      "score": 29,
      "context": [
        {
          "id": "id5tyzj",
          "author": "HackedTheGate",
          "body": "Ditch him. He doesn't sound like the type of person you'd want anything to do with.",
          "created_utc": 1655801909.0
        }
      ]
    },
    {
      "id": "id7ev28",
      "author": "tttthrrrowwwawwwayyy",
      "body": "Yeah I’m realizing that’s really quite a lot :( I like having sex with him, but I’m starting to feel it’s too much for me. I want to have ownership over my body and mind again",
      "created_utc": 1655832983.0,
      "score": 32,
      "context": [
        {
          "id": "id60jgl",
          "author": "mandanic",
          "body": "2-4 times a day?! Jesus. This does not sound like a healthy relationship for several reasons. Get out of the relationship and country. Choose you. There’s so much better out there.",
          "created_utc": 1655807663.0
        }
      ]
    },
    {
      "id": "id7fl8s",
      "author": "tttthrrrowwwawwwayyy",
      "body": "I’m sorry to hear about your shitty ex. I’m so happy that you left him. \n\nYour words made me tear up. I have felt locked up at times and like I haven’t been able to tend to what my body/mind are telling me I need. It’s been hard because he’s subtle, and I kept thinking that I just needed to be stronger or I was imagining things, but I don’t think that’s the case",
      "created_utc": 1655833310.0,
      "score": 12,
      "context": [
        {
          "id": "id6opba",
          "author": "tdc8557",
          "body": "This is not the guy for you. I was in a similar situation when I relapsed and the guy I was dating was obsessed with food, image, exercise, etc. he didn’t want me to go to treatment because it was inconvenient for him. He refused to acknowledge that I was malnourished. and the final straw was when I was inpatient, he asked me if I weighed more than I did when we met. \n\nTrust me, you deserve someone who will love you no matter what. Who will support you in recovery. Someone who has your back and won’t comment on your food or body or control what or when you eat. \n\nPlease consider if this relationship is serving you. You are so worthy of a full and happy life.",
          "created_utc": 1655821642.0
        }
      ]
    },
    {
      "id": "id8iyya",
      "author": "Sareeee48",
      "body": "This whole comment is a big yikes. We’re not gonna victim blame OP for her partner’s shitty behavior.",
      "created_utc": 1655851434.0,
      "score": 1,
      "context": [
        {
          "id": "id72x78",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655827755.0
        }
      ]
    },
    {
      "id": "id6e6yy",
      "author": "smoothpigeon2",
      "body": "His behaviour is not okay",
      "created_utc": 1655816558.0,
      "score": 63,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        }
      ]
    },
    {
      "id": "id6fy6c",
      "author": "cattail31",
      "body": "Someone who is good for you, would never go out of their way to comment on others’ bodies or show you them on Instagram. I’m getting married this year, after 4 years of being together, my fiancé has never once showed me a woman he finds attractive. I know his celebrity crush, and that’s about it. \n\nYou deserve better. You deserve safety. What he’s doing is akin to someone encouraging someone with an anxiety disorder that everything will go wrong.",
      "created_utc": 1655817484.0,
      "score": 57,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        }
      ]
    },
    {
      "id": "id6qxhy",
      "author": "Elizabitch4848",
      "body": "It’s not your eating disorder thoughts.",
      "created_utc": 1655822623.0,
      "score": 29,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        }
      ]
    },
    {
      "id": "id6t0c3",
      "author": "Sareeee48",
      "body": "So I went through something very similar. I had a mental breakdown where I realized I no longer wanted to be with my partner, but that scared me because I spent years being abused and I had become hardwired to believe that I couldn’t do better. The things he did were normalized, so I didn’t see anything wrong with them. I blamed it entirely on my OCD diagnosis that eventually caused me a lot of long term hurt and a breakup that had me fearing for my life… needless to say, I now wish I would have trusted my gut and left right then and there.\n\nI’m not necessarily saying that this is anything like your situation. But I *am* saying that if you are unsure about this relationship and how your partner is treating this situation, it’s very unlikely to be your ED. It’s one thing to have a preference, it’s another to push it onto your partner. You need to sit him down and enforce clear boundaries because your recovery is in jeopardy here and there is absolutely no reason for you to put up with comments that make you feel uncomfortable and bad about yourself.",
      "created_utc": 1655823520.0,
      "score": 20,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        }
      ]
    },
    {
      "id": "id92xhg",
      "author": "Parabuthus",
      "body": "That amount of sex is painful to sustain. I can't imagine marathons like that on more than an occasional basis personally. Ouch. \n \nOP  you should never feel used or \"like a doll.\" You deserve to feel love and connection and not as an object. This may seem obvious, but sometimes you just have to hear it for it to click.",
      "created_utc": 1655861192.0,
      "score": 10,
      "context": [
        {
          "id": "id60jgl",
          "author": "mandanic",
          "body": "2-4 times a day?! Jesus. This does not sound like a healthy relationship for several reasons. Get out of the relationship and country. Choose you. There’s so much better out there.",
          "created_utc": 1655807663.0
        },
        {
          "id": "id7ev28",
          "author": "tttthrrrowwwawwwayyy",
          "body": "Yeah I’m realizing that’s really quite a lot :( I like having sex with him, but I’m starting to feel it’s too much for me. I want to have ownership over my body and mind again",
          "created_utc": 1655832983.0
        }
      ]
    },
    {
      "id": "id7gwop",
      "author": "tdc8557",
      "body": "Always happy to share my experiences. \n\nWhen I was in that relationship, I often found myself thinking, well he doesn’t hit me. He doesn’t outwardly say or do anything terrible. \n\nHowever he knew I was trying to weight restore before I could get into treatment and would eat/throw away my food, even after my dietitian called him and told him not too. He would make backhanded comments on how unhealthy the food I ate was, even after I explained that I need to get calories in, no matter if it’s “healthy” or not. \n\nYou ARE so strong already. You are not imagining things. I used to think it was normal to lose my identity in relationships and that sacrifices are normal. \n\nBut the truth is, a healthy relationship won’t hurt you or change you. I’ve been dating my current partner for over a year. He’s seen me have full blown panic attacks in restaurants. He’s held me when I’ve cried because recovery and life are hard. He doesn’t question my cravings. He buys my favorite snacks and brings them with him when we go hiking in case I forget. He’s stood up to wait staff commenting on my eating when I’ve been too overwhelmed to talk. \n\nMost importantly, he gives me the space I need to meet my needs. I’m introverted and need alone time to lie on my couch with my dog and recharge and he respects that boundary (and similarly needs his own time too). Relationships can be hard but they shouldn’t be hard all the time.",
      "created_utc": 1655833902.0,
      "score": 7,
      "context": [
        {
          "id": "id6opba",
          "author": "tdc8557",
          "body": "This is not the guy for you. I was in a similar situation when I relapsed and the guy I was dating was obsessed with food, image, exercise, etc. he didn’t want me to go to treatment because it was inconvenient for him. He refused to acknowledge that I was malnourished. and the final straw was when I was inpatient, he asked me if I weighed more than I did when we met. \n\nTrust me, you deserve someone who will love you no matter what. Who will support you in recovery. Someone who has your back and won’t comment on your food or body or control what or when you eat. \n\nPlease consider if this relationship is serving you. You are so worthy of a full and happy life.",
          "created_utc": 1655821642.0
        },
        {
          "id": "id7fl8s",
          "author": "tttthrrrowwwawwwayyy",
          "body": "I’m sorry to hear about your shitty ex. I’m so happy that you left him. \n\nYour words made me tear up. I have felt locked up at times and like I haven’t been able to tend to what my body/mind are telling me I need. It’s been hard because he’s subtle, and I kept thinking that I just needed to be stronger or I was imagining things, but I don’t think that’s the case",
          "created_utc": 1655833310.0
        }
      ]
    },
    {
      "id": "id8v4oy",
      "author": "vanillazuella",
      "body": "Could you explain how I have victim blamed? Happy to learn to be better :)",
      "created_utc": 1655857300.0,
      "score": -1,
      "context": [
        {
          "id": "id72x78",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655827755.0
        },
        {
          "id": "id8iyya",
          "author": "Sareeee48",
          "body": "This whole comment is a big yikes. We’re not gonna victim blame OP for her partner’s shitty behavior.",
          "created_utc": 1655851434.0
        }
      ]
    },
    {
      "id": "id7em0u",
      "author": "tttthrrrowwwawwwayyy",
      "body": "Wow, you put it so well. I just want to feel safe and like my partner understands me. I guess I kept brushing everything aside because I felt strong and like I was recovered, but I need to listen to my needs. I haven’t felt like myself in a while",
      "created_utc": 1655832870.0,
      "score": 17,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        },
        {
          "id": "id6fy6c",
          "author": "cattail31",
          "body": "Someone who is good for you, would never go out of their way to comment on others’ bodies or show you them on Instagram. I’m getting married this year, after 4 years of being together, my fiancé has never once showed me a woman he finds attractive. I know his celebrity crush, and that’s about it. \n\nYou deserve better. You deserve safety. What he’s doing is akin to someone encouraging someone with an anxiety disorder that everything will go wrong.",
          "created_utc": 1655817484.0
        }
      ]
    },
    {
      "id": "id7dtqv",
      "author": "tttthrrrowwwawwwayyy",
      "body": "Thank you for the support and your experience. You’re right, I really need to put my recovery first. I’m going to try to enforce my boundaries more firmly. Thank you again for the support and  reassurance.",
      "created_utc": 1655832518.0,
      "score": 7,
      "context": [
        {
          "id": "id60ffp",
          "author": "Sareeee48",
          "body": "Uhhhh this guy does *not* sound like a safe person. He checks other women out and shows you (I understand if you’re okay with this but you never mentioned that)? He *expects* sex 2-4 times a day? This guy is either 1) abusive as fuck, 2) hypersexual to the point it is interfering with your relationship, or 3) both. Tbh it already sounds like he’s influencing your recovery. Please go home and get therapy, away from this individual.",
          "created_utc": 1655807572.0
        },
        {
          "id": "id62qfw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1655809368.0
        },
        {
          "id": "id6t0c3",
          "author": "Sareeee48",
          "body": "So I went through something very similar. I had a mental breakdown where I realized I no longer wanted to be with my partner, but that scared me because I spent years being abused and I had become hardwired to believe that I couldn’t do better. The things he did were normalized, so I didn’t see anything wrong with them. I blamed it entirely on my OCD diagnosis that eventually caused me a lot of long term hurt and a breakup that had me fearing for my life… needless to say, I now wish I would have trusted my gut and left right then and there.\n\nI’m not necessarily saying that this is anything like your situation. But I *am* saying that if you are unsure about this relationship and how your partner is treating this situation, it’s very unlikely to be your ED. It’s one thing to have a preference, it’s another to push it onto your partner. You need to sit him down and enforce clear boundaries because your recovery is in jeopardy here and there is absolutely no reason for you to put up with comments that make you feel uncomfortable and bad about yourself.",
          "created_utc": 1655823520.0
        }
      ]
    },
    {
      "id": "id91djn",
      "author": "Sareeee48",
      "body": "The “if you understand his preference then you have nothing to complain about” mindset and brushing off his hypersexual tendencies as a benefit is super toxic and victim-blamey.",
      "created_utc": 1655860409.0,
      "score": 5,
      "context": [
        {
          "id": "id72x78",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655827755.0
        },
        {
          "id": "id8iyya",
          "author": "Sareeee48",
          "body": "This whole comment is a big yikes. We’re not gonna victim blame OP for her partner’s shitty behavior.",
          "created_utc": 1655851434.0
        },
        {
          "id": "id8v4oy",
          "author": "vanillazuella",
          "body": "Could you explain how I have victim blamed? Happy to learn to be better :)",
          "created_utc": 1655857300.0
        }
      ]
    },
    {
      "id": "idak7dy",
      "author": "vanillazuella",
      "body": "I appreciate the input",
      "created_utc": 1655897779.0,
      "score": 1,
      "context": [
        {
          "id": "id72x78",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1655827755.0
        },
        {
          "id": "id8iyya",
          "author": "Sareeee48",
          "body": "This whole comment is a big yikes. We’re not gonna victim blame OP for her partner’s shitty behavior.",
          "created_utc": 1655851434.0
        },
        {
          "id": "id8v4oy",
          "author": "vanillazuella",
          "body": "Could you explain how I have victim blamed? Happy to learn to be better :)",
          "created_utc": 1655857300.0
        },
        {
          "id": "id91djn",
          "author": "Sareeee48",
          "body": "The “if you understand his preference then you have nothing to complain about” mindset and brushing off his hypersexual tendencies as a benefit is super toxic and victim-blamey.",
          "created_utc": 1655860409.0
        }
      ]
    }
  ]
}