{
  "id": "vmib5t",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1656405405.0,
  "title": "Sometimes I hate my invasive diet obsessed parents",
  "selftext": "First of all I'd like to clarify I am a male. As I have an eating disorder, a lot of people refer to me as female. \n\nI'm also sorry if I've written a lot. I'm autistic and feel the need to over explain myself to avoid misunderstandings. \n\n\n\nLate 2020 my parents strip searched my room, read through my diary, and then constantly gave me shit for my disordered eating. They grounded me for 10 months, forced me to sleep on their floor for my \"safety\" and removed my door from my room as they thought I didn't deserve privacy. \n\nI was in therapy and even my therapist and case worker thought this was a bit much for me, as I wasn't really a threat to myself. \n\nMy parents were forcing me to improve, so I tried to so I could and get them off my back and regain privacy and choice, they would constantly go on about diets and weight loss around me. I told them to stop because it was triggering. And they got angry at me for expecting them to change, saying that was too difficult for them.\n\nThey stopped discussing for about a 8 months, keeping it on the down low. I'm not sure if that was because of me or if it was because they weren't dieting at the time. However then my step mother became pregnant, and she hasn't stopped about her weight since.\n\nI relapsed in my \"recovery attempt\" in late 2021, they don't know this. But I've still asked them to stop discussing it.\n\nShe's always on about her weight loss, eating in an extreme defecit, how \"fat\" she is, how she needs to lose weight. She will even hold my baby sister and complain to her that she made her fat. Her discussiom of calories makes me miserable. \n\nAfter discussing my disordered eating with my support worker, she suggested it was made worse by my autism. And told me that It's okay to just eat my safe foods until I can get further help. \n\nSo yesterday I had a doughnut, not low calorie I know but they have a extremely pleasant texture to me and they make me happy. And as I was eating it my step mother kept telling me how many calories were in it. How it's bad and fattening. How she would be \"bad\" to have one. My father joined in. \n\nI have been miserable. It makes me so unhappy to hear these things. My step mum is absolutely exhausting to be around because she's constantly discussing food. I'm so unhappy. \n\nI want to cry and leave. I've spent a lot of time with my boyfriend lately, and thankfully he takes care of me and sticks up for me when I can not. But I am still unhappy with my step mother. \n\n:(\n\n\nEDIT : I just wanted to say. Thank you all so much for the kind and helpful responses. You've given me some motivation to attempt recovery again, and to stick up to my step mother. Although not fully dedicated to either idea, it's pleasant to feel this way. You're all so sweet!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vmib5t/sometimes_i_hate_my_invasive_diet_obsessed_parents/",
  "score": 89,
  "num_comments": 16,
  "comments": [
    {
      "id": "ie1qlco",
      "author": "selkieflying",
      "body": "Good lord, I am so so sorry you have to deal with that. Holding your baby while saying she made you fat? That’s absolutely not ok or normal even for a seriel dieter…. That’s ED territory. That said that’s absolutely no excuse for her saying those things. There’s nothing wrong with a fucking donut. I would have said something like, “I’m really sorry your self worth is tied to the consumption a donut. However, mine is not and I’d rather you kept it to yourself” - if anything it might’ve surprised her! But I understand not being comfortable saying those things. I’m glad you have a supportive boyfriend at least. Hang on to that and places like this that will support you.",
      "created_utc": 1656420024.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ie18uel",
      "author": "kylemikahel",
      "body": "It can sounds rude but you can remind her that diets and those stuffs are her problem. If it makes her \"bad\", well that's on her, not to you. You're going pretty good dealing with your disorder at your on pace. So try to keep in mind, diets are bs and doesn't work, perhaps you can even use your stepmom behavior to reassure it.",
      "created_utc": 1656407542.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ie1jqdc",
      "author": "anniekeepsontrying",
      "body": "I’m so sorry this sounds like such a terrible environment! And so controlling! Especially taking away your door and making you sleep on their floor?! To make you recover? But then not talking about their diets is “too much change”?! What none of this makes sense! \nI like what the other person said about telling your stepmom that the calories and weight are her problem not yours, but from what you write your parents don’t seem to listen to what you want. \n\nI don’t know your age but have you disussed moving out with your case worker or therapist? That environment seems so toxic. \n\nHang in there OP, don’t let them ruin your recovery even if it’s hard!",
      "created_utc": 1656416000.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ie18e57",
      "author": "JellyCharacter1653",
      "body": "They don’t need to change they need to stop talking about diets and stuff and the door thing can you hang like a curtain or sum on your door frame",
      "created_utc": 1656407141.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ie21tws",
      "author": "petitelinotte212",
      "body": "This enraged me my friend - your parents/step parents are so out of line, not only is their approach to your ED incredibly traumatic, they don’t also seem to have a good handle your ASD, and their ableism is really troubling, just reading some of that made me sick to my stomach. I’m so so sorry you’re being subjected to this, it’s not ok, it’s not fair, it’s not caring or loving or supportive. I’m glad to hear you have a plan to leave when the time comes, but I’m trying to think how we can support you and your recovery until then.\n\nI’m not ASD, but I do have ADHD, so if you’re like me you’re probably really flooded and overwhelmed when it comes to conflict and direct confrontation so I won’t suggest you take on your relatives when they say disordered and ableist things - but can you just stand up and walk out of the room? Even if they’re talking directly to you. Just get up and leave. You’ve asked them to accommodate you, and they’ve refused - there’s really nothing else you can do about their choices and behavior, but you *can* control what you have to sit through. If this angers them or they find this rude, just calmly state “I am healing my relationship to food, how you choose to speak has consequences for me so I am removing myself from a harmful situation.” Don’t justify it any further than that - you do not need their understanding or validation.",
      "created_utc": 1656425426.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ie4pc3b",
      "author": "jennifers-body",
      "body": "my stepmom was awfullllll during my ed in high school as well. in different ways but nonetheless. all i can say, that i wish i could’ve told myself back then, is that her view of the world or at least of people, is meaningless, and to take no bullshit. literally, and i know this is not easy, took me years, just tell her “that’s fucked up” and walk away. or say “really?” and again, walk away. it will make her reflect, or, it will make her do the opposite. if she improves, then you know she is reflecting. if she only remains careless, you know she is a hypocrite. i wish you the best and if you are old enough hope you can get out of there and at least with your partner as soon as you’re able. ur doing great even at the slower pace of ur recovery and im glad u have a care team.  xx",
      "created_utc": 1656465424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ie40nry",
      "author": "brookleiaway",
      "body": "sometimes i hate my parents",
      "created_utc": 1656453910.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ie1w07z",
      "author": "None",
      "body": "Thank you. I really don't know what I'd do without him. He walked with me for 35 minutes as I checked 6 shops for a safe food. I've come to appreciate online communities as a good form of support too. Everyone on here is so kind, including you.\n\n:)",
      "created_utc": 1656422762.0,
      "score": 15,
      "context": [
        {
          "id": "ie1qlco",
          "author": "selkieflying",
          "body": "Good lord, I am so so sorry you have to deal with that. Holding your baby while saying she made you fat? That’s absolutely not ok or normal even for a seriel dieter…. That’s ED territory. That said that’s absolutely no excuse for her saying those things. There’s nothing wrong with a fucking donut. I would have said something like, “I’m really sorry your self worth is tied to the consumption a donut. However, mine is not and I’d rather you kept it to yourself” - if anything it might’ve surprised her! But I understand not being comfortable saying those things. I’m glad you have a supportive boyfriend at least. Hang on to that and places like this that will support you.",
          "created_utc": 1656420024.0
        }
      ]
    },
    {
      "id": "ie1b3jn",
      "author": "None",
      "body": "I'm afraid to remind her incase she suspects I've relapsed and they search my room again. But thank you for your kindness, I greatly appreciate it. I will try to keep that in mind. \n\n:)",
      "created_utc": 1656409512.0,
      "score": 13,
      "context": [
        {
          "id": "ie18uel",
          "author": "kylemikahel",
          "body": "It can sounds rude but you can remind her that diets and those stuffs are her problem. If it makes her \"bad\", well that's on her, not to you. You're going pretty good dealing with your disorder at your on pace. So try to keep in mind, diets are bs and doesn't work, perhaps you can even use your stepmom behavior to reassure it.",
          "created_utc": 1656407542.0
        }
      ]
    },
    {
      "id": "ie1o1at",
      "author": "None",
      "body": "I'm planning on moving out within the next year or so. I have discussed this with my case worker but not therapist. I am starting with a new therapist soon and plan to discuss it with then. \n\nThank you so much for your encouragement. It means a lot as I have been struggling so much in my relapse.",
      "created_utc": 1656418607.0,
      "score": 12,
      "context": [
        {
          "id": "ie1jqdc",
          "author": "anniekeepsontrying",
          "body": "I’m so sorry this sounds like such a terrible environment! And so controlling! Especially taking away your door and making you sleep on their floor?! To make you recover? But then not talking about their diets is “too much change”?! What none of this makes sense! \nI like what the other person said about telling your stepmom that the calories and weight are her problem not yours, but from what you write your parents don’t seem to listen to what you want. \n\nI don’t know your age but have you disussed moving out with your case worker or therapist? That environment seems so toxic. \n\nHang in there OP, don’t let them ruin your recovery even if it’s hard!",
          "created_utc": 1656416000.0
        }
      ]
    },
    {
      "id": "ie1b10k",
      "author": "None",
      "body": "Thank you for the advice. I did this the other time i had my door taken away, and got in trouble. Thankfully I have my door back now, I got it back after roughly 16 months without it. Although I cannot shut it for extended periods of time, it's improvement.",
      "created_utc": 1656409451.0,
      "score": 8,
      "context": [
        {
          "id": "ie18e57",
          "author": "JellyCharacter1653",
          "body": "They don’t need to change they need to stop talking about diets and stuff and the door thing can you hang like a curtain or sum on your door frame",
          "created_utc": 1656407141.0
        }
      ]
    },
    {
      "id": "ie26m8w",
      "author": "None",
      "body": "They don't believe I'm autistic as I'm not officially diagnosed, although I am in the process for it as almost every medical professional thats worked with me has told me I appear extremely likely to have it and have advised me to use some aids such as an AAC machine and sound cancelling headphones. \n\nThe only way my parents would believe I'm autistic is if I'm \"high functioning\" because I'm intelligent. Which I'm well aware is an outdated and wrong term. They are extremely abelist as they constantly tell me I need to learn how to cope better. But then are extremely judgemental of my stims, fidgets and sensory items. Telling me that I'm over reacting and I don't need them. I have even written them letters explaining autism and how each symptom related to me as I believed they were just uneducated, however this changed nothing. They told me I'm not autistic and I'm just \"special\" or \"quirky\" as I'm not like their friends 6 year old. \n\nIn triggering situations I often attempt to leave the room or exit the conversation however sometimes I cannot. For example, when she was talking about doughnuts she was holding the box and reading the packaging. I had asked for it back and she told me she wasn't done reading it.",
      "created_utc": 1656427467.0,
      "score": 2,
      "context": [
        {
          "id": "ie21tws",
          "author": "petitelinotte212",
          "body": "This enraged me my friend - your parents/step parents are so out of line, not only is their approach to your ED incredibly traumatic, they don’t also seem to have a good handle your ASD, and their ableism is really troubling, just reading some of that made me sick to my stomach. I’m so so sorry you’re being subjected to this, it’s not ok, it’s not fair, it’s not caring or loving or supportive. I’m glad to hear you have a plan to leave when the time comes, but I’m trying to think how we can support you and your recovery until then.\n\nI’m not ASD, but I do have ADHD, so if you’re like me you’re probably really flooded and overwhelmed when it comes to conflict and direct confrontation so I won’t suggest you take on your relatives when they say disordered and ableist things - but can you just stand up and walk out of the room? Even if they’re talking directly to you. Just get up and leave. You’ve asked them to accommodate you, and they’ve refused - there’s really nothing else you can do about their choices and behavior, but you *can* control what you have to sit through. If this angers them or they find this rude, just calmly state “I am healing my relationship to food, how you choose to speak has consequences for me so I am removing myself from a harmful situation.” Don’t justify it any further than that - you do not need their understanding or validation.",
          "created_utc": 1656425426.0
        }
      ]
    },
    {
      "id": "ie5o4k3",
      "author": "None",
      "body": "I'm afraid doing these things will hint at her I've relapsed, or she'll be mad as she never truly believed in my eating disorder as I wasn't \"thin enough\" in her eyes.\n\nHowever thank you very much, your kidness is greatly appreciated and in general the replies to this have given me the motivation to try recovery again and try sticking up for myself.",
      "created_utc": 1656485554.0,
      "score": 1,
      "context": [
        {
          "id": "ie4pc3b",
          "author": "jennifers-body",
          "body": "my stepmom was awfullllll during my ed in high school as well. in different ways but nonetheless. all i can say, that i wish i could’ve told myself back then, is that her view of the world or at least of people, is meaningless, and to take no bullshit. literally, and i know this is not easy, took me years, just tell her “that’s fucked up” and walk away. or say “really?” and again, walk away. it will make her reflect, or, it will make her do the opposite. if she improves, then you know she is reflecting. if she only remains careless, you know she is a hypocrite. i wish you the best and if you are old enough hope you can get out of there and at least with your partner as soon as you’re able. ur doing great even at the slower pace of ur recovery and im glad u have a care team.  xx",
          "created_utc": 1656465424.0
        }
      ]
    },
    {
      "id": "ie1qtrl",
      "author": "anniekeepsontrying",
      "body": "Glad to hear there is a little light at the end of the tunnel!",
      "created_utc": 1656420148.0,
      "score": 5,
      "context": [
        {
          "id": "ie1jqdc",
          "author": "anniekeepsontrying",
          "body": "I’m so sorry this sounds like such a terrible environment! And so controlling! Especially taking away your door and making you sleep on their floor?! To make you recover? But then not talking about their diets is “too much change”?! What none of this makes sense! \nI like what the other person said about telling your stepmom that the calories and weight are her problem not yours, but from what you write your parents don’t seem to listen to what you want. \n\nI don’t know your age but have you disussed moving out with your case worker or therapist? That environment seems so toxic. \n\nHang in there OP, don’t let them ruin your recovery even if it’s hard!",
          "created_utc": 1656416000.0
        },
        {
          "id": "ie1o1at",
          "author": "None",
          "body": "I'm planning on moving out within the next year or so. I have discussed this with my case worker but not therapist. I am starting with a new therapist soon and plan to discuss it with then. \n\nThank you so much for your encouragement. It means a lot as I have been struggling so much in my relapse.",
          "created_utc": 1656418607.0
        }
      ]
    },
    {
      "id": "ie2lfoy",
      "author": "petitelinotte212",
      "body": "Dude, I'm so sorry your family of origin is like this -  I won't get into too much detail but I can definitely relate. I'm 37 now and my family still won't acknowledge my eating disorder (my mom still refers to it as my \"body issues\") nor me not being neurotypical, they put me on stimulants as a teenager and when that didn't change me into a different person, they decided I just didn't have the \"willpower\" to \"do better\". Meanwhile I graduated from high school with honors, got myself a scholarship to college where I also worked to support myself, and at the first opportunity moved 3000 miles away from them so I could finally live the life I wanted to and started learning about myself for real. So you're not alone. But its not ok that you're going through this, and one day when you have some distance from the situation and you're living independently, you will be able to heal. Like you've already begun to with your current partner, you will find people who believe you, accept you, and love you unconditionally - and through their example you'll have the opportunity to re-parent yourself in this way. A happy and full life is out there for you, though it may not be accessible right now <3 It gets better. I promise. \n\nRemember, if your [boundaries](https://www.talkspace.com/blog/family-boundaries/) aren't being respected, you can always leave. Even if that means you leave that donut, and go get another donut ;-p You have a right to keep yourself safe and you do not have to withstand whatever harmful things your family does and says - your needs are important.",
      "created_utc": 1656433406.0,
      "score": 3,
      "context": [
        {
          "id": "ie21tws",
          "author": "petitelinotte212",
          "body": "This enraged me my friend - your parents/step parents are so out of line, not only is their approach to your ED incredibly traumatic, they don’t also seem to have a good handle your ASD, and their ableism is really troubling, just reading some of that made me sick to my stomach. I’m so so sorry you’re being subjected to this, it’s not ok, it’s not fair, it’s not caring or loving or supportive. I’m glad to hear you have a plan to leave when the time comes, but I’m trying to think how we can support you and your recovery until then.\n\nI’m not ASD, but I do have ADHD, so if you’re like me you’re probably really flooded and overwhelmed when it comes to conflict and direct confrontation so I won’t suggest you take on your relatives when they say disordered and ableist things - but can you just stand up and walk out of the room? Even if they’re talking directly to you. Just get up and leave. You’ve asked them to accommodate you, and they’ve refused - there’s really nothing else you can do about their choices and behavior, but you *can* control what you have to sit through. If this angers them or they find this rude, just calmly state “I am healing my relationship to food, how you choose to speak has consequences for me so I am removing myself from a harmful situation.” Don’t justify it any further than that - you do not need their understanding or validation.",
          "created_utc": 1656425426.0
        },
        {
          "id": "ie26m8w",
          "author": "None",
          "body": "They don't believe I'm autistic as I'm not officially diagnosed, although I am in the process for it as almost every medical professional thats worked with me has told me I appear extremely likely to have it and have advised me to use some aids such as an AAC machine and sound cancelling headphones. \n\nThe only way my parents would believe I'm autistic is if I'm \"high functioning\" because I'm intelligent. Which I'm well aware is an outdated and wrong term. They are extremely abelist as they constantly tell me I need to learn how to cope better. But then are extremely judgemental of my stims, fidgets and sensory items. Telling me that I'm over reacting and I don't need them. I have even written them letters explaining autism and how each symptom related to me as I believed they were just uneducated, however this changed nothing. They told me I'm not autistic and I'm just \"special\" or \"quirky\" as I'm not like their friends 6 year old. \n\nIn triggering situations I often attempt to leave the room or exit the conversation however sometimes I cannot. For example, when she was talking about doughnuts she was holding the box and reading the packaging. I had asked for it back and she told me she wasn't done reading it.",
          "created_utc": 1656427467.0
        }
      ]
    },
    {
      "id": "ie2t48i",
      "author": "None",
      "body": "Thank you very much, you're so kind. Thank you fr your advice and support. \n\nI have spent years believing nothing would improve and have wanted to give up. It's only been with dating my partner and managing to survive until 16 that I've begun to believe in myself. Your words bring me plenty of reassurance. Thank you again.",
      "created_utc": 1656436377.0,
      "score": 2,
      "context": [
        {
          "id": "ie21tws",
          "author": "petitelinotte212",
          "body": "This enraged me my friend - your parents/step parents are so out of line, not only is their approach to your ED incredibly traumatic, they don’t also seem to have a good handle your ASD, and their ableism is really troubling, just reading some of that made me sick to my stomach. I’m so so sorry you’re being subjected to this, it’s not ok, it’s not fair, it’s not caring or loving or supportive. I’m glad to hear you have a plan to leave when the time comes, but I’m trying to think how we can support you and your recovery until then.\n\nI’m not ASD, but I do have ADHD, so if you’re like me you’re probably really flooded and overwhelmed when it comes to conflict and direct confrontation so I won’t suggest you take on your relatives when they say disordered and ableist things - but can you just stand up and walk out of the room? Even if they’re talking directly to you. Just get up and leave. You’ve asked them to accommodate you, and they’ve refused - there’s really nothing else you can do about their choices and behavior, but you *can* control what you have to sit through. If this angers them or they find this rude, just calmly state “I am healing my relationship to food, how you choose to speak has consequences for me so I am removing myself from a harmful situation.” Don’t justify it any further than that - you do not need their understanding or validation.",
          "created_utc": 1656425426.0
        },
        {
          "id": "ie26m8w",
          "author": "None",
          "body": "They don't believe I'm autistic as I'm not officially diagnosed, although I am in the process for it as almost every medical professional thats worked with me has told me I appear extremely likely to have it and have advised me to use some aids such as an AAC machine and sound cancelling headphones. \n\nThe only way my parents would believe I'm autistic is if I'm \"high functioning\" because I'm intelligent. Which I'm well aware is an outdated and wrong term. They are extremely abelist as they constantly tell me I need to learn how to cope better. But then are extremely judgemental of my stims, fidgets and sensory items. Telling me that I'm over reacting and I don't need them. I have even written them letters explaining autism and how each symptom related to me as I believed they were just uneducated, however this changed nothing. They told me I'm not autistic and I'm just \"special\" or \"quirky\" as I'm not like their friends 6 year old. \n\nIn triggering situations I often attempt to leave the room or exit the conversation however sometimes I cannot. For example, when she was talking about doughnuts she was holding the box and reading the packaging. I had asked for it back and she told me she wasn't done reading it.",
          "created_utc": 1656427467.0
        },
        {
          "id": "ie2lfoy",
          "author": "petitelinotte212",
          "body": "Dude, I'm so sorry your family of origin is like this -  I won't get into too much detail but I can definitely relate. I'm 37 now and my family still won't acknowledge my eating disorder (my mom still refers to it as my \"body issues\") nor me not being neurotypical, they put me on stimulants as a teenager and when that didn't change me into a different person, they decided I just didn't have the \"willpower\" to \"do better\". Meanwhile I graduated from high school with honors, got myself a scholarship to college where I also worked to support myself, and at the first opportunity moved 3000 miles away from them so I could finally live the life I wanted to and started learning about myself for real. So you're not alone. But its not ok that you're going through this, and one day when you have some distance from the situation and you're living independently, you will be able to heal. Like you've already begun to with your current partner, you will find people who believe you, accept you, and love you unconditionally - and through their example you'll have the opportunity to re-parent yourself in this way. A happy and full life is out there for you, though it may not be accessible right now <3 It gets better. I promise. \n\nRemember, if your [boundaries](https://www.talkspace.com/blog/family-boundaries/) aren't being respected, you can always leave. Even if that means you leave that donut, and go get another donut ;-p You have a right to keep yourself safe and you do not have to withstand whatever harmful things your family does and says - your needs are important.",
          "created_utc": 1656433406.0
        }
      ]
    }
  ]
}