{
  "id": "vpt5t3",
  "subreddit": "fuckeatingdisorders",
  "author": "alenamalina",
  "created_utc": 1656772630.0,
  "title": "Serving size of oats",
  "selftext": "Does anyone actually eat a half cup of oats? I don’t have a measuring cup but I do have a measuring scale, which (unfortunately for my ED) is much more accurate. Do people actually eat 40 g of oats and feel full? I don’t use my food scale anymore but when I free poured sometimes I was curious as to how much and it was always 50-60 grams and sometimes more. \n\nSeriously, how do they feel full? Is it the toppings? I cant have PB in the house bc my brother is allergic and I refuse to buy protein powder because I literally… considered dry teaspoons of it meals and snacks. And they always put almond milk in it. Never like… soy or coconut or whole milk. Or fucking WATER. Growing up my mom made me put 2% milk (not a restriction thing I just thought American whole milk was gross) and a bit of butter and that filled me up. But almond milk or water???? \n\nAnd I don’t even think it’s recovery influencers, it’s like gym bros too?? Huh?? Y’all are big boys how is 150 calories enough for you??\n\nIf I eat that little I either gotta get another portion or eat a bit of cereal or some shit. Im sorry Im BAFFLED. I have had these thoughts since my first failed recovery attempt in 2019 when I actually measured out 60-80 g because I was like “fuck the wiead girlies” ONLY TO FIND OUT ITS NOT JUST THEM. IM REALLY FUCKING MAD ITS PEOPLE IRL TOO. \n\nIn the worst of my ED I went down to an oatmeal package worth of >!27 g!< that’s >!100 calories!< exactly. Measured out using loose oats because I didn’t trust the packets but also they were kinda more expensive for what you get. \n\nThe best thing in recovery that happened to me was a friend giving me TWO packets of plain oats and putting a HEAPING teaspoon of jam in it. She used water only because she preferred it and asked if I wanted to put oil in it and offered some almonds. I said no but snacked on two almonds while it cooked. AND THIS WAS THE FIRST TIME I FELT FULL AFTER EATING OATS IN MY LIFE. At the time I also got full early and put oats on my fear list BECAUSE OF THE STUPID 40 G SHIT. \n\nMy brother and dad also eat two packets of the sugar kind. So maybe I am wrong and not everyone follows the half cup thing. I also like to think that they’re tall men and need more food than me especially since my brothers active. BUT I ALSO NEED MORE FOOD IM TRYNNA GET MY PERIOD BACK AFTER FOUR YEARS. I do not care y’all can slap me if I continue to measure my oats after I get my period back. I will always eyeball it and it’ll probably be more than a half cup who CARES. \n\nI’m sorry I really love oats but these motherfuckers are ruining my brekkie and occasional lunch or dinner. Suck my dick 40 g gym bros an extra 10-20 g won’t kill you.\n\nEdit: I literally didn’t expect anyone to respond to this post. But from what I’m understanding we all have different preferences of oat, whether you’re in recovery or not. Sometimes 40 g fills you up depending on how you cook it, sometimes you need a bit more. I’m just glad I’m not the only one to overthink this shit. Eat your oats how you want, but remember that one packet alone cooked with water isn’t a meal, it’s a snack.\n\nEdit 2: I just had like over 80 g of oats with almond milk and a banana and an hour later i’m super hungry I feel like y’all lied to me. Maybe protein helps but egg whites and protein powder remind me too much of me at my worst so i’ll have to find another way",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vpt5t3/serving_size_of_oats/",
  "score": 91,
  "num_comments": 74,
  "comments": [
    {
      "id": "ielagg1",
      "author": "SquashBrave4473",
      "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
      "created_utc": 1656778244.0,
      "score": 80,
      "context": []
    },
    {
      "id": "iel04y6",
      "author": "Sareeee48",
      "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
      "created_utc": 1656773674.0,
      "score": 41,
      "context": []
    },
    {
      "id": "iel6sc1",
      "author": "ulieallthetime",
      "body": "i eat half a cup but i use milk, add protein powder, banana, pb etc, half a cup on its own would do nothing for me 😭",
      "created_utc": 1656776627.0,
      "score": 16,
      "context": []
    },
    {
      "id": "iel0c3l",
      "author": "TerrifyinglyAlive",
      "body": "I do usually have 40g of oats, since I know how much water to add to that for my preferred texture, but I also add like a whole apple that’s been sliced up and baked with sugar and cinnamon, or a cup of diced strawberries and some cream, or some chopped spinach, grape tomatoes and cream cheese.\n\nBut a serving size isn’t even meant to tell you how much to eat; they only exist to allow for comparison between foods.  They are not in any way a recommendation for how much to eat, and never have been.",
      "created_utc": 1656773765.0,
      "score": 18,
      "context": []
    },
    {
      "id": "iel8u7n",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1656777530.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iel1y4x",
      "author": "None",
      "body": "1 cup or bust",
      "created_utc": 1656774484.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iel9g04",
      "author": "Halaros",
      "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
      "created_utc": 1656777795.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ielbm7i",
      "author": "FideliaDelarosa",
      "body": "I learned 2dl from my dietitian, which is about 1 cup! 2dl is ny new servingsize. 1 dl does Nothing!!",
      "created_utc": 1656778757.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ieljo3u",
      "author": "Anti-Diet-Newbie",
      "body": "Hell no. I have 70g for my breakfast oats. I used to do 40g but I've slowly increased it over time as my overall calories have increased.",
      "created_utc": 1656782265.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ielgu8t",
      "author": "salientmould",
      "body": "Nope I do not feel full after it. Luckily my meal plan is exchanges, and the 1/2 C of oats is just 1 of 3 grains I eat at breakfast. So I usually have oats, 2 pieces of toast, and 3 proteins (peanut butter usually), soy milk for dairy and a banana as my fruit serving. \n\n1 bowl of oats is not a proper breakfast imo. It is literally just one serving of grains and we need more nutrients than that, regardless of feelings of fullness.",
      "created_utc": 1656781042.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iel5cwc",
      "author": "mandanic",
      "body": "I use min 45g, usually 50gish and I’m mixing with 35g protein powder (if not I would definitely use more oats!!), but the protein also helps you feel full! I also stir in 40g of egg whites when it’s almost ready to make them super fluffy. And always top with a nut butter or crushed nuts like walnuts and/or dark chocolate and mix in flaxseed meal sometimes. Personally I don’t like frozen berries in my oats but a sliced banana is a nice way to add volume too! Making sure There’s a fat source for me is key. I try to remember fat, fiber and protein when it comes to feeling full! Straight carbs are cool but I’ll just know that I’ll be hungry soon and need to think/plan for that and not be thrown off by hunger - that used to be a trigger for me, and I’d feel so guilty that I was hungry “too quick” after eating",
      "created_utc": 1656775993.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ielij5j",
      "author": "hopeless2002",
      "body": "Oats never fill me up idk why. But I like it as a snack with lots of toppings (Pb, cookies chocolate, apple etc..)",
      "created_utc": 1656781769.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ielzq22",
      "author": "coloraturing",
      "body": "Definitely not. If I have a bunch of toppings i do 3/4 cup, otherwise I do 1 cup. Anything less and i'm still hungry! Go for a full cup, it's great.",
      "created_utc": 1656789367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iembuhr",
      "author": "Late_Statistician582",
      "body": "i usually eat the serving size but i add things to my oatmeal. i like almond milk because i’m lactose intolerant, but i also like to add sugar, cinnamon, chia seeds & fruit. it’s best not to compare your meals to others because everyone has different needs <3 they could be eating more throughout the day that you don’t see. also since we were disordered our body needs more food rn :) i totally get it though, i compare my food to others a lot too",
      "created_utc": 1656795023.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iensl2n",
      "author": "4dtopology",
      "body": "oat fans in the comments: i’m about to level up your oatmeal game. cook your oatmeal however you want, add a lil pinch of salt, then brown some butter over the stove. pour that shit on your oatmeal and enjoyyy.",
      "created_utc": 1656821889.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iemr37q",
      "author": "None",
      "body": "I had a granola company for a product I created. I choose the serving size specifically to hit a target “sugar per serving” that looked good next to competitors. It’s all BS.",
      "created_utc": 1656802223.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ielwacw",
      "author": "thenewmeredith",
      "body": "So I know you said you don't trust the packets and it's also extra money for more waste but personally I've been ok with that in return for the ease of having pre-portioned food. Unfortunately it doesn't seem like that works the same for everyone else but I'd say to anyone who has problems with measuring food obsessively to at least try it. \n\n\nObviously you have to be at a point where you can trust the package enough and some people might actually be more accepting than they'd think. I think if you have a problem with nutrition labels, which is even more common for sure, any food, portioned or not, is going to seem \"wrong.\" But with the packets- again, for me personally -I find it so helpful. \n\n\nI'd like to say if you're more of a binger that might be something to try but everyone's at different points in recovery. \nHonestly I think a lot of it is that you can eat the whole package because it's just one portion, you don't have to stop yourself. Kind of the same appeal Halo Top always had for me - I could eat the whole container and it's fine but Ben and Jerry's not so much. \n\n\nI know this post was specifically about oats, OP, but I figured I'd add my experience with regards to pre-portioned food in case someone else here might find it helpful. While I'm at it some of my favorite foods that come like that are: Skinny Pop or a similar brand, Goldfish, cereal variety packs, salad dressing cups, Pringles snack packs, and Jif to go cups but unfortunately when I went to buy those last week there had apparently been a recall on all Jif products so I had to get the Skippy packets which are more inefficient and messy than little cups.\n\nTL;DR: Many of your favorite foods might come in packaging like that so if anyone thinks it might help them, I'd say to check around online if your store doesn't have that option for a certain product.",
      "created_utc": 1656787825.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ielwnt4",
      "author": "dollszn",
      "body": "yeah, but only because a half cup usually fills me up so if make more than that it’ll probably go to waste",
      "created_utc": 1656787989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iem1wgf",
      "author": "libertybells125",
      "body": "I tend to use the 27g 100 cal packs because i get so afraid. If it's made the right way, consistency wise, it does a pretty good job at filling me  up. Probably not completely but definitely some. \n\nI also tend to get other flavors like Better oats 100 cal and will mix half of that with half of the original packs to get some flavor. Not sure if it's in my mind but sometimes i feel like that fills me up a bit more. \n\nWith oatmeal (and many things), i can be so picky about the consistency of the oatmeal and if it's not right, i usually will toss it and start over.",
      "created_utc": 1656790384.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iem4fca",
      "author": "itssdarkinhere",
      "body": "i’m a one packet + cream of rice + extra spoonful of old fashioned oats gal. i just use the packet for the flavor otherwise i’d just use the plain oats.",
      "created_utc": 1656791559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iemcayl",
      "author": "Parabuthus",
      "body": "Hell yeah....IF I add peanut or almond butter (full or powdered), granola or cereal, pea milk, Greek yogurt, an entire cup of berries and whatever the hell else to bulk that baby up. All of these things. \n\nA quarter cup of oats alone is just so sad. They are part of a balanced breakfast not the whole damn thang.",
      "created_utc": 1656795238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iemfagg",
      "author": "None",
      "body": "I do half a cup because its easy, I don't use a food scale unless I'm baking. Half a cup and then a bunch of toppings - I like eggs, avocado & a flax/chia mix for savory and something like nut butter, protein powder, dried fruit or a banana for when I want sweet, that's usually enough for me plus a side of yogurt or fruit. In the summer I make overnight oats and then I do a bit more than half a cup because that's less satisfying for some reason. But that's what works for me, if you want more, have more, life's too damn short and there are many cats to pet to waste time on grams of oatmeal.",
      "created_utc": 1656796647.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iemzopi",
      "author": "frannypack01",
      "body": "I don't measure but pretty sure I eat >150g in a serving, so fts",
      "created_utc": 1656806344.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ien6sxh",
      "author": "Lavendericing",
      "body": "Oats don't make me feel full at all. Not even 2 cups lol I don't know why people, like my boyfriend, say it's so good and satisfying, I need like three million portions to feel it's enough, and this doesn't happen to me with other foods.",
      "created_utc": 1656810003.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ieo52pa",
      "author": "myceliumfriend",
      "body": "THANK YOUUUU you have no idea how many times I've thought this??? I love you for this 🥰 I'm gonna get outta bed and make myself a HUGE bowl of morning oats 🤤",
      "created_utc": 1656830532.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iem5qt8",
      "author": "Arsenalg0d",
      "body": "1/2 a cup is *plenty* for me....\n\n... when i put in a scoop of protein powder, use milk instead of water, a heaping spoonful of PB, chia seeds, brown sugar and chocolate chips :) it's plenty filling for breakfast but if I'm having lunch/dinner I always go for something more filling/higher calorie.",
      "created_utc": 1656792175.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ielabjv",
      "author": "WhichWayzUp",
      "body": "You are correct, a half a cup of oats is not enough to satisfy anyone except maybe a small child.\n\nA true serving size of anything is whatever it takes to satisfy any given person. So after consuming something, if you're concerned with nutrition info & calories,  take note of how much you ate then go back and calculate the calories based on the nutrition information on the package.",
      "created_utc": 1656778183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkeiw3r",
      "author": "kittonxmittons",
      "body": "Thank you for the post! I seriously don’t understand how this is the “serving size” and it stresses me out bc it’s rarely adequate (and this is WITH me using milk, peanut butter, banana). Glad I’m not alone",
      "created_utc": 1724881284.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6bm756",
      "author": "Trubba_Man",
      "body": "Sorry for the new answer. 45g is the recommended size for a man.",
      "created_utc": 1736469809.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iel69kj",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1656776397.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iel6c4e",
      "author": "goodbyeruby2sday",
      "body": "I have 50g now, used to have 40g but needed more calories. I also mix with yogurt, fruit, sometimes chocolate/nut butters/anything else I fancy or protein powder to make it more filling.",
      "created_utc": 1656776428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ielgmon",
      "author": "selkieflying",
      "body": "Oats never make me full no matter how much I eat lol\n\nBut I’d usually use 2 packs back when I’d eat them. With water bc that’s genuinely how I thought you were supposed to make them and I hate any and all milk. \n\nBut I loved the cinnamon maple Quaker Oats w blueberries and peanut butter!",
      "created_utc": 1656780951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ielukun",
      "author": "Abrookspug",
      "body": "I don't really look at the serving size or measure anymore, but when I did, I usually had about 1 cup of plain oats, or 2 packets of the flavored oatmeal. Depending on how I'm feeling, I add either water or 2% milk, however much looks good in the bowl. If it's not the kind that's flavored already, I usually add whatever fruits I have, like half a sliced banana or some sliced strawberries, and occasionally some sugar or brown sugar. Oats will fill me up for like 2 hours, but not much longer than that, so I def prefer eggs and sausage for breakfast! Sometimes oatmeal is my dessert, snack, or very light breakfast lol.",
      "created_utc": 1656787048.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ielxbu5",
      "author": "redtonks",
      "body": "Yes. But I use half water half milk, and add vanilla protein powder.",
      "created_utc": 1656788285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ielxdhg",
      "author": "c-tl-n",
      "body": "Can I piggy back into this and ask - does anyone actually find 45g or 1/2 cup granola enough either?? I have it with milk and it doesn’t feel adequate in the slightest!!\nBut idk if that’s my ED “I need to feel full” thing after a meal",
      "created_utc": 1656788306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iemmjnm",
      "author": "Individual_Resort_38",
      "body": "1/2 a cup with water, 2 teaspoons sugar and a dash of half and half with choice of fruit. \nWorks for me.",
      "created_utc": 1656800073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iemyjtr",
      "author": "bibibirdie99",
      "body": "I use 1/2 c of oats but I use soy milk and 2-3 tbsp of chia seeds, along with toppings like honey and fruit. The chia seeds add fiber and fat and make it a good filling breakfast!",
      "created_utc": 1656805774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iensj4f",
      "author": "4dtopology",
      "body": "oat fans in the comments: i’m about to level up your oatmeal game. cook your oatmeal however you want, add a lil pinch of salt, then brown some butter over the stove. pour that shit on your oatmeal and enjoyyy.",
      "created_utc": 1656821859.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ientyop",
      "author": "None",
      "body": "honestly… 40g of oats leaves me starving, even if i add all those fancy toppings",
      "created_utc": 1656822695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ieo5zac",
      "author": "macaronistrudel",
      "body": "No I always have to have two packs 😭 one is never enough",
      "created_utc": 1656831256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ieog6ty",
      "author": "None",
      "body": "40g oats is only going to fill me up when I put toppings and protein powder etc. Even then it’s not for long. But in all honestly it doesn’t matter what does and doesn’t fill other people up. Does it fill you up? No then change it :)",
      "created_utc": 1656840060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ieohc9r",
      "author": "busted3000",
      "body": "So on a milk note I actually find almond milk to be similarly filling to green-top cows milk.\n\nIf I’m having oats with whole milk and sugar I don’t measure but I think I have like probably double the recommended serving. If I have it with salt and water (just a taste thing, not a restriction thing) I still have about double but I usually need something else too like a banana.\n\nI did however try these packets of oatmeal mixed with protein powder that my boyfriend has, and the standard sachet of that made with milk was actually slightly too much for me to eat, I find protein very filling.",
      "created_utc": 1656841083.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iermzjo",
      "author": "WhereBagel",
      "body": "the pamphlet I got from my treatment team had us needing2 of the 1/3 cup packets to make a full breakfast, along with sides of fruit and protein, and including milk snd/ or some kind of nut butter (or other added fat). also when I'm out with friends camping or whatever they will always have at least one oatmeal packet, so I use that to give some direction as well. I like to add an egg to mine if I'm cooking it on the stove top, it gives it some extra texture and helps with satiety! When I was doing it in the microwave I liked to use powdered or condensed milk.",
      "created_utc": 1656898336.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ielh6un",
      "author": "salientmould",
      "body": "A serving is a serving, but who says it only takes 1 to feel full or be nourished? I find it helpful to know what a serving is but yeah, for most humans at most meals it's going to take more than 1 of a food",
      "created_utc": 1656781195.0,
      "score": 25,
      "context": [
        {
          "id": "ielagg1",
          "author": "SquashBrave4473",
          "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
          "created_utc": 1656778244.0
        }
      ]
    },
    {
      "id": "ielrmx1",
      "author": "alenamalina",
      "body": "I know I know, it’s just the oats that get me because I see a variety of portions for literally all other foods. But oats… its SO common to do 40 g",
      "created_utc": 1656785747.0,
      "score": 6,
      "context": [
        {
          "id": "ielagg1",
          "author": "SquashBrave4473",
          "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
          "created_utc": 1656778244.0
        }
      ]
    },
    {
      "id": "iel9oo7",
      "author": "Halaros",
      "body": "Absolutely NOTHING wrong with following directions as long as the end result is what you want. Consistency in oatmeal is so personal, I like mine more creamy and silky than dry; also if I had to choose between soup-like oatmeal versus completely dry oatmeal, I would choose the former.",
      "created_utc": 1656777900.0,
      "score": 12,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        }
      ]
    },
    {
      "id": "iel5hvu",
      "author": "mandanic",
      "body": "Butter with brown sugar and cinnamon on oats is SO underrated!!",
      "created_utc": 1656776054.0,
      "score": 6,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        }
      ]
    },
    {
      "id": "ielcs1h",
      "author": "Less_Home8530",
      "body": "I have never heard of using butter when making porridge. Is it a common thing?",
      "created_utc": 1656779268.0,
      "score": 3,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        }
      ]
    },
    {
      "id": "iemnbi5",
      "author": "SmolBeanAmina",
      "body": "Ok so I used to do this, then I realized that it is more about the oats to liquid ratio than how much of it, so for the texture I like I found it to be 1:1 volume (I make overnight oats 90% of the time, for stovetop 1:2 oat to liquid is better) so I just use a cup and pour the same volume of each! Mine is also close to half a cup aswell but same reason as you, I use whole milk and put chia seeds and condensed milk in mine and usually top it with fruits, peanut butter\n\nAnd when it's not enough I eat bread, pastry or a bun with it. Breakfast became one of my fav meals in recovery because it's pretty fun to prepare and eat :)",
      "created_utc": 1656800438.0,
      "score": 2,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        }
      ]
    },
    {
      "id": "ielbfsf",
      "author": "Sareeee48",
      "body": "I’ve never tried a more savory kind of oatmeal—I might try that with some cream cheese after reading this!",
      "created_utc": 1656778679.0,
      "score": 10,
      "context": [
        {
          "id": "iel0c3l",
          "author": "TerrifyinglyAlive",
          "body": "I do usually have 40g of oats, since I know how much water to add to that for my preferred texture, but I also add like a whole apple that’s been sliced up and baked with sugar and cinnamon, or a cup of diced strawberries and some cream, or some chopped spinach, grape tomatoes and cream cheese.\n\nBut a serving size isn’t even meant to tell you how much to eat; they only exist to allow for comparison between foods.  They are not in any way a recommendation for how much to eat, and never have been.",
          "created_utc": 1656773765.0
        }
      ]
    },
    {
      "id": "ielz4xw",
      "author": "alenamalina",
      "body": "SAME!! When I started calculating calories by not just looking at nutritional labels and measuring and googling… shit made me spiral.",
      "created_utc": 1656789097.0,
      "score": 5,
      "context": [
        {
          "id": "iel8u7n",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1656777530.0
        }
      ]
    },
    {
      "id": "ielbf9y",
      "author": "None",
      "body": "I don't know, made with water and a bit of salt just hits differently. Maybe it's just me.",
      "created_utc": 1656778673.0,
      "score": 7,
      "context": [
        {
          "id": "iel9g04",
          "author": "Halaros",
          "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
          "created_utc": 1656777795.0
        }
      ]
    },
    {
      "id": "ielyk66",
      "author": "alenamalina",
      "body": "Oh yea the packets thing was at my lowest where I had a very regimented breakfast of >!27 g oats, 5-7 g protein powder, and maybe like 5-10 g of low fat yogurt, maybe also 50 g of an apple!<. Very specific but it made me spiral. But I’ve eaten the prepackaged stuff and… if it’s plain and I don’t add anything but water or almond milk I can’t imagine it fills anyone up. It’s such a small portion… and 100 calories isn’t a meal\n\nBut actually prepackaged things did help me at one point. Especially when I was on the go and used that as an excuse to not eat. I’m at the point where I can eat prepackaged or family packs, but more family packs right now bc of inflation.",
      "created_utc": 1656788837.0,
      "score": 2,
      "context": [
        {
          "id": "ielwacw",
          "author": "thenewmeredith",
          "body": "So I know you said you don't trust the packets and it's also extra money for more waste but personally I've been ok with that in return for the ease of having pre-portioned food. Unfortunately it doesn't seem like that works the same for everyone else but I'd say to anyone who has problems with measuring food obsessively to at least try it. \n\n\nObviously you have to be at a point where you can trust the package enough and some people might actually be more accepting than they'd think. I think if you have a problem with nutrition labels, which is even more common for sure, any food, portioned or not, is going to seem \"wrong.\" But with the packets- again, for me personally -I find it so helpful. \n\n\nI'd like to say if you're more of a binger that might be something to try but everyone's at different points in recovery. \nHonestly I think a lot of it is that you can eat the whole package because it's just one portion, you don't have to stop yourself. Kind of the same appeal Halo Top always had for me - I could eat the whole container and it's fine but Ben and Jerry's not so much. \n\n\nI know this post was specifically about oats, OP, but I figured I'd add my experience with regards to pre-portioned food in case someone else here might find it helpful. While I'm at it some of my favorite foods that come like that are: Skinny Pop or a similar brand, Goldfish, cereal variety packs, salad dressing cups, Pringles snack packs, and Jif to go cups but unfortunately when I went to buy those last week there had apparently been a recall on all Jif products so I had to get the Skippy packets which are more inefficient and messy than little cups.\n\nTL;DR: Many of your favorite foods might come in packaging like that so if anyone thinks it might help them, I'd say to check around online if your store doesn't have that option for a certain product.",
          "created_utc": 1656787825.0
        }
      ]
    },
    {
      "id": "iem3ewe",
      "author": "alenamalina",
      "body": "Hey, I completely understand being afraid to eat more than one packet. And if somethings not perfect, I also used to toss it out and be mad. But remember that 100 calories is not a meal. I know it’s hard, but maybe try eating one and a half packets, or putting some toppings on it?",
      "created_utc": 1656791089.0,
      "score": 1,
      "context": [
        {
          "id": "iem1wgf",
          "author": "libertybells125",
          "body": "I tend to use the 27g 100 cal packs because i get so afraid. If it's made the right way, consistency wise, it does a pretty good job at filling me  up. Probably not completely but definitely some. \n\nI also tend to get other flavors like Better oats 100 cal and will mix half of that with half of the original packs to get some flavor. Not sure if it's in my mind but sometimes i feel like that fills me up a bit more. \n\nWith oatmeal (and many things), i can be so picky about the consistency of the oatmeal and if it's not right, i usually will toss it and start over.",
          "created_utc": 1656790384.0
        }
      ]
    },
    {
      "id": "iel9uki",
      "author": "Halaros",
      "body": "40 grams is enough! As an appetizer for a bigger bowl of oatmeal of course :)",
      "created_utc": 1656777973.0,
      "score": 5,
      "context": [
        {
          "id": "iel69kj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656776397.0
        }
      ]
    },
    {
      "id": "ielzvir",
      "author": "alenamalina",
      "body": "Needing to full feel or satiated is a normal human response. It depends on where I was in recovery but sometimes I need 60-80 g, sometimes I only wanted 45-50. Right now I eyeball it and I’d say it’s 45-60 grams, but if I eat less I’ll want another meal in an hour. \n\nAnd honestly idk how much a half cup of granola is because it was always a fear food for me, and when I faced my fear foods I refused to measure them out lmao so. But from what I’m imagining that would NEVER fill me up. It would be a good addition to yogurt and oats though, or a nice snack!",
      "created_utc": 1656789439.0,
      "score": 2,
      "context": [
        {
          "id": "ielxdhg",
          "author": "c-tl-n",
          "body": "Can I piggy back into this and ask - does anyone actually find 45g or 1/2 cup granola enough either?? I have it with milk and it doesn’t feel adequate in the slightest!!\nBut idk if that’s my ED “I need to feel full” thing after a meal",
          "created_utc": 1656788306.0
        }
      ]
    },
    {
      "id": "iem92cr",
      "author": "None",
      "body": "Suddenly I have no idea what a serving means",
      "created_utc": 1656793710.0,
      "score": 10,
      "context": [
        {
          "id": "ielagg1",
          "author": "SquashBrave4473",
          "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
          "created_utc": 1656778244.0
        },
        {
          "id": "ielh6un",
          "author": "salientmould",
          "body": "A serving is a serving, but who says it only takes 1 to feel full or be nourished? I find it helpful to know what a serving is but yeah, for most humans at most meals it's going to take more than 1 of a food",
          "created_utc": 1656781195.0
        }
      ]
    },
    {
      "id": "iemmvee",
      "author": "SmolBeanAmina",
      "body": "I remember pre-ed I only used to eat 2 plates of everything, and this was the only way I could feel full and/or satisfied, ED took that away from me so I'm trying to get the freedom of getting seconds back because 1 plate doesn't seem to be the serving size for my body. It makes me crave snacks all day, even right after eating. Small steps but I'll slowly get there, I know it because I increased the portion I eat by probably double in recovery!",
      "created_utc": 1656800227.0,
      "score": 10,
      "context": [
        {
          "id": "ielagg1",
          "author": "SquashBrave4473",
          "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
          "created_utc": 1656778244.0
        },
        {
          "id": "ielh6un",
          "author": "salientmould",
          "body": "A serving is a serving, but who says it only takes 1 to feel full or be nourished? I find it helpful to know what a serving is but yeah, for most humans at most meals it's going to take more than 1 of a food",
          "created_utc": 1656781195.0
        }
      ]
    },
    {
      "id": "iemz6f4",
      "author": "SquashBrave4473",
      "body": "For sure. It’s just crazy we all think a serving size means I eat only one serving of this otherwise I’m overeating.",
      "created_utc": 1656806087.0,
      "score": 3,
      "context": [
        {
          "id": "ielagg1",
          "author": "SquashBrave4473",
          "body": "My dietician told me that the “serving sizes” on the back on packages are not necessarily intended to be serving sizes for how much you’re supposed to eat. They’re just there to categorize and compare different products. Tbh if you think of it… it’s pretty ridiculous to think we all believe the serving size is accurate for our bodies when we all have completely different bodies with different needs. \n\nEat however much you need. Let go of the serving sizes and comparing with others.",
          "created_utc": 1656778244.0
        },
        {
          "id": "ielh6un",
          "author": "salientmould",
          "body": "A serving is a serving, but who says it only takes 1 to feel full or be nourished? I find it helpful to know what a serving is but yeah, for most humans at most meals it's going to take more than 1 of a food",
          "created_utc": 1656781195.0
        }
      ]
    },
    {
      "id": "ielb9fo",
      "author": "Sareeee48",
      "body": "Yeah I do like the more liquid-y oatmeal myself. I just want to make sure it cooks all the way through, so I’ll usually add more milk afterwards. The individual packs are easier to get that wetter consistency though!",
      "created_utc": 1656778601.0,
      "score": 6,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "iel9oo7",
          "author": "Halaros",
          "body": "Absolutely NOTHING wrong with following directions as long as the end result is what you want. Consistency in oatmeal is so personal, I like mine more creamy and silky than dry; also if I had to choose between soup-like oatmeal versus completely dry oatmeal, I would choose the former.",
          "created_utc": 1656777900.0
        }
      ]
    },
    {
      "id": "ieldqql",
      "author": "Sareeee48",
      "body": "It is in America, can’t speak of anywhere else though!",
      "created_utc": 1656779691.0,
      "score": 4,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        }
      ]
    },
    {
      "id": "ielrgdh",
      "author": "alenamalina",
      "body": "It is definitely a thing in Russia, also sometimes with buckwheat and rice, but especially with semolina porridge",
      "created_utc": 1656785663.0,
      "score": 2,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        }
      ]
    },
    {
      "id": "iele54w",
      "author": "TerrifyinglyAlive",
      "body": "I also have this shaker thing of freeze-dried roasted garlic bits that goes well with it — it’s basically like a pasta dish but with oats.",
      "created_utc": 1656779861.0,
      "score": 6,
      "context": [
        {
          "id": "iel0c3l",
          "author": "TerrifyinglyAlive",
          "body": "I do usually have 40g of oats, since I know how much water to add to that for my preferred texture, but I also add like a whole apple that’s been sliced up and baked with sugar and cinnamon, or a cup of diced strawberries and some cream, or some chopped spinach, grape tomatoes and cream cheese.\n\nBut a serving size isn’t even meant to tell you how much to eat; they only exist to allow for comparison between foods.  They are not in any way a recommendation for how much to eat, and never have been.",
          "created_utc": 1656773765.0
        },
        {
          "id": "ielbfsf",
          "author": "Sareeee48",
          "body": "I’ve never tried a more savory kind of oatmeal—I might try that with some cream cheese after reading this!",
          "created_utc": 1656778679.0
        }
      ]
    },
    {
      "id": "ielml2z",
      "author": "Mammoth-Corner",
      "body": "I like it with chili, smoked paprika, garlic and a fried egg or sausages!",
      "created_utc": 1656783534.0,
      "score": 2,
      "context": [
        {
          "id": "iel0c3l",
          "author": "TerrifyinglyAlive",
          "body": "I do usually have 40g of oats, since I know how much water to add to that for my preferred texture, but I also add like a whole apple that’s been sliced up and baked with sugar and cinnamon, or a cup of diced strawberries and some cream, or some chopped spinach, grape tomatoes and cream cheese.\n\nBut a serving size isn’t even meant to tell you how much to eat; they only exist to allow for comparison between foods.  They are not in any way a recommendation for how much to eat, and never have been.",
          "created_utc": 1656773765.0
        },
        {
          "id": "ielbfsf",
          "author": "Sareeee48",
          "body": "I’ve never tried a more savory kind of oatmeal—I might try that with some cream cheese after reading this!",
          "created_utc": 1656778679.0
        }
      ]
    },
    {
      "id": "ielcsdl",
      "author": "Halaros",
      "body": "Oatmeal is as subjective as each and every human being... For every human being, there's a perfect, unique oatmeal it seems",
      "created_utc": 1656779272.0,
      "score": 7,
      "context": [
        {
          "id": "iel9g04",
          "author": "Halaros",
          "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
          "created_utc": 1656777795.0
        },
        {
          "id": "ielbf9y",
          "author": "None",
          "body": "I don't know, made with water and a bit of salt just hits differently. Maybe it's just me.",
          "created_utc": 1656778673.0
        }
      ]
    },
    {
      "id": "ielhcsy",
      "author": "selkieflying",
      "body": "Same, I didn’t realize it was even a thing to make it w milk until I was in treatment lol. I just thought water was default and I can’t imagine it any other way lol",
      "created_utc": 1656781266.0,
      "score": 8,
      "context": [
        {
          "id": "iel9g04",
          "author": "Halaros",
          "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
          "created_utc": 1656777795.0
        },
        {
          "id": "ielbf9y",
          "author": "None",
          "body": "I don't know, made with water and a bit of salt just hits differently. Maybe it's just me.",
          "created_utc": 1656778673.0
        }
      ]
    },
    {
      "id": "iem67xy",
      "author": "libertybells125",
      "body": "I know i need to work on it and challenge that. Even if it's adding a bit of the flavored oats into one whole regular pack, but i get sofreaked and fixated on it... \n\nI know i need to work on it and challenge that. Even if it's adding a bit of the flavored oats into one whole regular pack, but i get so freaked and fixated on it... some textures do weird me out, especially with oatmeal, and that always has to be a \"perfect\" consistency. don't even get me started on soggy cereals lol",
      "created_utc": 1656792394.0,
      "score": 1,
      "context": [
        {
          "id": "iem1wgf",
          "author": "libertybells125",
          "body": "I tend to use the 27g 100 cal packs because i get so afraid. If it's made the right way, consistency wise, it does a pretty good job at filling me  up. Probably not completely but definitely some. \n\nI also tend to get other flavors like Better oats 100 cal and will mix half of that with half of the original packs to get some flavor. Not sure if it's in my mind but sometimes i feel like that fills me up a bit more. \n\nWith oatmeal (and many things), i can be so picky about the consistency of the oatmeal and if it's not right, i usually will toss it and start over.",
          "created_utc": 1656790384.0
        },
        {
          "id": "iem3ewe",
          "author": "alenamalina",
          "body": "Hey, I completely understand being afraid to eat more than one packet. And if somethings not perfect, I also used to toss it out and be mad. But remember that 100 calories is not a meal. I know it’s hard, but maybe try eating one and a half packets, or putting some toppings on it?",
          "created_utc": 1656791089.0
        }
      ]
    },
    {
      "id": "ielb43i",
      "author": "None",
      "body": "Lol right?",
      "created_utc": 1656778535.0,
      "score": 3,
      "context": [
        {
          "id": "iel69kj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1656776397.0
        },
        {
          "id": "iel9uki",
          "author": "Halaros",
          "body": "40 grams is enough! As an appetizer for a bigger bowl of oatmeal of course :)",
          "created_utc": 1656777973.0
        }
      ]
    },
    {
      "id": "ielf968",
      "author": "Less_Home8530",
      "body": "I see, thank you! I'm from England and butter in porridge is definitely not a common occurrence here 😅\n\nIt's interesting to see these kinds of different cultural tastes though",
      "created_utc": 1656780346.0,
      "score": 5,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        },
        {
          "id": "ieldqql",
          "author": "Sareeee48",
          "body": "It is in America, can’t speak of anywhere else though!",
          "created_utc": 1656779691.0
        }
      ]
    },
    {
      "id": "iels8f6",
      "author": "Less_Home8530",
      "body": "Oh wow, I've honestly never heard of it. How interesting (at least for me as someone who's only ever known the liquid used in porridge to be some kind of milk or water).",
      "created_utc": 1656786011.0,
      "score": 1,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        },
        {
          "id": "ielrgdh",
          "author": "alenamalina",
          "body": "It is definitely a thing in Russia, also sometimes with buckwheat and rice, but especially with semolina porridge",
          "created_utc": 1656785663.0
        }
      ]
    },
    {
      "id": "ieldsmw",
      "author": "None",
      "body": "At least we're all connected by the mighty oat 😀",
      "created_utc": 1656779713.0,
      "score": 5,
      "context": [
        {
          "id": "iel9g04",
          "author": "Halaros",
          "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
          "created_utc": 1656777795.0
        },
        {
          "id": "ielbf9y",
          "author": "None",
          "body": "I don't know, made with water and a bit of salt just hits differently. Maybe it's just me.",
          "created_utc": 1656778673.0
        },
        {
          "id": "ielcsdl",
          "author": "Halaros",
          "body": "Oatmeal is as subjective as each and every human being... For every human being, there's a perfect, unique oatmeal it seems",
          "created_utc": 1656779272.0
        }
      ]
    },
    {
      "id": "ieln0yy",
      "author": "None",
      "body": "Lol and i grew up with being made with water and you can add milk/butter/sugar if you want. It's nice to be able to actually taste the oats which you miss with milk.",
      "created_utc": 1656783726.0,
      "score": 4,
      "context": [
        {
          "id": "iel9g04",
          "author": "Halaros",
          "body": "I like using one and a half desiliters, which equals to around 60-70g oats. Then I use 3 desiliters of skimmed milk (I have a genetic disorder where I need to avoid saturated fats, otherwise I wouldn't have used skimmed), a large spoonful of peanutbutter, same size spoonful of jam, and plenty of raisins (with some cinnamon on top because yummy). I am a male, not particularly tall, around 170cm, but I certainly am not a \"gym bro\". My ED does have me doing a lot of walking and running though.\n\nI just have to admit; I do not believe ANYONE in their right mind would actually enjoy oatmeal made with water. Like honestly, it becomes less satiating, less nutritious, and the consistency is all weird; plus it tastes sooooo bland regardless of what toppings you use...",
          "created_utc": 1656777795.0
        },
        {
          "id": "ielbf9y",
          "author": "None",
          "body": "I don't know, made with water and a bit of salt just hits differently. Maybe it's just me.",
          "created_utc": 1656778673.0
        },
        {
          "id": "ielhcsy",
          "author": "selkieflying",
          "body": "Same, I didn’t realize it was even a thing to make it w milk until I was in treatment lol. I just thought water was default and I can’t imagine it any other way lol",
          "created_utc": 1656781266.0
        }
      ]
    },
    {
      "id": "ielmg6k",
      "author": "Mammoth-Corner",
      "body": "Am from England; butter in porridge is surprising but my grandpa puts *olive oil* in his.",
      "created_utc": 1656783476.0,
      "score": 5,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        },
        {
          "id": "ieldqql",
          "author": "Sareeee48",
          "body": "It is in America, can’t speak of anywhere else though!",
          "created_utc": 1656779691.0
        },
        {
          "id": "ielf968",
          "author": "Less_Home8530",
          "body": "I see, thank you! I'm from England and butter in porridge is definitely not a common occurrence here 😅\n\nIt's interesting to see these kinds of different cultural tastes though",
          "created_utc": 1656780346.0
        }
      ]
    },
    {
      "id": "ielmuea",
      "author": "Less_Home8530",
      "body": "Olive oil? Oh wow, that's definitely new for me. Is it drizzled over or actually cooked with it?",
      "created_utc": 1656783646.0,
      "score": 3,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        },
        {
          "id": "ieldqql",
          "author": "Sareeee48",
          "body": "It is in America, can’t speak of anywhere else though!",
          "created_utc": 1656779691.0
        },
        {
          "id": "ielf968",
          "author": "Less_Home8530",
          "body": "I see, thank you! I'm from England and butter in porridge is definitely not a common occurrence here 😅\n\nIt's interesting to see these kinds of different cultural tastes though",
          "created_utc": 1656780346.0
        },
        {
          "id": "ielmg6k",
          "author": "Mammoth-Corner",
          "body": "Am from England; butter in porridge is surprising but my grandpa puts *olive oil* in his.",
          "created_utc": 1656783476.0
        }
      ]
    },
    {
      "id": "ielriv9",
      "author": "alenamalina",
      "body": "MY FRIEND DOES THIS TOO but it’s to add calories after recovering from an ED and to make sure she gets enough fats",
      "created_utc": 1656785695.0,
      "score": 2,
      "context": [
        {
          "id": "iel04y6",
          "author": "Sareeee48",
          "body": "I follow the 1/2 cup directions because I am a perfectionist and need the directions to be accurate so the liquid (whole milk for me usually) absorbs the “right” way I guess… but I put a shit ton of butter in it, along with hemp seeds because they are calorie dense, and sugar because fuck bland oatmeal. And I will usually have something else with it like a smoothie or breakfast essential or something with it because it’s just not enough for me on its own. It’s funny because my breakfast is usually more than half of what my intake was when I was restricting and idk how I did it.",
          "created_utc": 1656773674.0
        },
        {
          "id": "ielcs1h",
          "author": "Less_Home8530",
          "body": "I have never heard of using butter when making porridge. Is it a common thing?",
          "created_utc": 1656779268.0
        },
        {
          "id": "ieldqql",
          "author": "Sareeee48",
          "body": "It is in America, can’t speak of anywhere else though!",
          "created_utc": 1656779691.0
        },
        {
          "id": "ielf968",
          "author": "Less_Home8530",
          "body": "I see, thank you! I'm from England and butter in porridge is definitely not a common occurrence here 😅\n\nIt's interesting to see these kinds of different cultural tastes though",
          "created_utc": 1656780346.0
        },
        {
          "id": "ielmg6k",
          "author": "Mammoth-Corner",
          "body": "Am from England; butter in porridge is surprising but my grandpa puts *olive oil* in his.",
          "created_utc": 1656783476.0
        }
      ]
    }
  ]
}