{
  "id": "vv5q8u",
  "subreddit": "fuckeatingdisorders",
  "author": "SLEG48",
  "created_utc": 1657385051.0,
  "title": "Nickelodeon… (TW: Calorie counting)",
  "selftext": "Since Netflix recently added Zoey 101, a Nickelodeon show, to their roster, I revisited it for my childhood nostalgia. Like other kids shows, although the humor was cheesy, there was a charm to it. But OMG. It’s like the writers on this show were TRYING to instill a fear of food and weight gain into young girls and boys at such an early age. \n\nFor example, the main character and her friends (all thin young teenagers)are all staring at ONE slice of chocolate cake. One of the friends says she feels “weak” because she got the chocolate cake and tries to pass it off to her friend, who then refuses it because “she’s trying to be good”, and then passes it to the other friend, who also refuses because “that slice of chocolate cake has like a billion calories in it! 😱 “. The friends then decide to “only” take one bite of the cake slice and that’s it. They savor it, and then take one more bite. The friends all exchange satisfied, but guilty looks and the scene ends -_-.\n\nIn another episode, the opening scene starts with the main character saying “Ugh, bagels have 300 calories in them”. Along with instances of characters (both girls and guys) saying that macaroni and cheese is “too carb-y”, calling Thousand island salad dressing “fattening, slapping candy out of each other’s hands, and feeling guilty for eating salad with a bag of chips, it’s no wonder I felt influenced to restrict certain foods even at a young age.\n\nAnother Nickelodeon show, iCarly, shows a teen girl and her guy friend being angry at another girl for DRIZZLING BUTTER on their popcorn, because now it has “tons of calories and is super unhealthy.” \n\nYet another show, Victorious, shows guys complimenting a petite character for weighing 90 pounds -_- (This was Ariana Grande’s character).\n\nThe common theme? They all demonized food and showed unhealthy food relationships to generations of impressionable kids. (They were all directed by Dan Schneider too, a recently revealed pedophilic show director).\n\nI just feel so creeped out and upset by all the diet culture in media that was aimed for CHILDREN -_-",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vv5q8u/nickelodeon_tw_calorie_counting/",
  "score": 220,
  "num_comments": 33,
  "comments": [
    {
      "id": "ifiph6m",
      "author": "Sareeee48",
      "body": "Yeah it’s really disturbing how much diet culture shit made it into kids shows. And if there is ever a fat character, it’s always for a cruel joke to mock larger bodies.",
      "created_utc": 1657401112.0,
      "score": 132,
      "context": []
    },
    {
      "id": "ifiih46",
      "author": "None",
      "body": "I was rewatching Suite Life on Deck and there’s an episode where Woody fully binges and it’s like a joke that he can’t control himself around food and that’s why he’s the “fat one”. It was so blatantly obvious I had to turn it off afterwards it didn’t feel right anymore",
      "created_utc": 1657397967.0,
      "score": 45,
      "context": []
    },
    {
      "id": "ifik992",
      "author": "None",
      "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
      "created_utc": 1657398769.0,
      "score": 36,
      "context": []
    },
    {
      "id": "ifik88h",
      "author": "None",
      "body": "And I grew up watching all these shows… makes so much sense. 😔",
      "created_utc": 1657398757.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ifj3laj",
      "author": "babysfirstreddit_yx",
      "body": "yeah early 2000s was an absolute wasteland of diet culture hell. It was inescapable. I try to remember that when I get down on myself for \"falling for it.\"",
      "created_utc": 1657407641.0,
      "score": 26,
      "context": []
    },
    {
      "id": "ifjawir",
      "author": "pterodactylleg",
      "body": "The complete lack of representation of varying body types is what gets me. As a kid all I saw were super petite girls in all the main roles of the shows I watched, and fat people were usually treated as “comedic relief” or their size was joked about in some way. And yeah, don’t even get me started on all the diet culture bs 🥲",
      "created_utc": 1657411182.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ifjpsnk",
      "author": "ulieallthetime",
      "body": "lol fuck dan schneider tbh he’s so gross",
      "created_utc": 1657418737.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ifjnjg3",
      "author": "DantesInporno",
      "body": "I still remember asking my mom what a carb was after I watched an episode of grim adventures of billy and mandy because a character freaked out about carbs being in her food.",
      "created_utc": 1657417575.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ifjwlet",
      "author": "None",
      "body": "I never forgot that thousand island dressing thing and I've never tried it because of that",
      "created_utc": 1657422264.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ifmqa5g",
      "author": "U_got_no_jams",
      "body": "Apparently Dan Schneider would purposefully trigger Jennet McCurdy despite knowing she had an eating disorder at the time. He would make scenes where she would eat a large so amount of food all the time, and that was supposed to be “funny”. One thing I remember vividly was Sam being the “foodie” so to speak… like that’s not even a personality trait?? I always found that a little weird. She was also very rash as a character which I’m sure was not easy on Jennet’s already weakened state. I also remember looking at Carly and Sam and seeing how thin they were when I was a kid. It’s crazy to me that I was thinking about that when I was a younger, those actors were kids too! I grew up with all these shows as well, it’s weird how integrated ed behaviors were in every day life, it explains a lot now. They still are, but at least there’s more awareness, the world could be doing so much better though. I can’t believe it but I remember that comment on Victorious about Ariana’s character being thin… when the characters themselves were thin too!!?? 90 pounds isn’t something to encourage! Kids are very impressionable.",
      "created_utc": 1657481115.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ifklltb",
      "author": "libertybells125",
      "body": "it's no wonder i, along with many others, developed EDs watching this show. Not only a proem with nick but something I've noticed watching old shows on disney+, too. So many shows i grew up loving are riddled with toxic diet culture. It fucking sucks, especially when you want to watch stuff for nostalgia and end up getting super triggered.\n\nalso, i love that 70s show but NGL, i hate the triggering comments made inthat show, too. Big Rhonda wasn't that big, logically. And i feel like Jackie also made remarks towards Donna, but maybe I'm not remembering correctly or misinterpreting. I love that show but i do remember it also being triggering.",
      "created_utc": 1657438806.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iflj0kv",
      "author": "Halaros",
      "body": "That reminds me of one of my favorite shows, BoJack Horseman! Diane experiences depression and goes on meds, and happens to gain weight. Nobody even mentions the weight gain, and everyone treats her just the same as before, except she becomes happy in the end.\n\nEven though there are bad shows that contribute to diet culture and fatphobia, there are also good shows that make you feel like there's more to the world than fearing calories!",
      "created_utc": 1657462353.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iflaukj",
      "author": "desperatepers0n",
      "body": "This is awful I never even realized. Also yes, why do the fat characters never get a storyline or have any depth?? They’re always just obsessed with food or the funny ones. Like wtf kind of message is that sending to every young person.",
      "created_utc": 1657458230.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ih9vjk7",
      "author": "Forward-Woodpecker-4",
      "body": "Dan Schneider is just a disgusting human being",
      "created_utc": 1658543429.0,
      "score": 7,
      "context": []
    },
    {
      "id": "imer74b",
      "author": "iamtheultimateshoe",
      "body": "i remember being so disturbed at that victorious scene. a high-schooler. 90 lbs. andré just nonchalantly going “that girl weighs ninety pounds so she can fit through the camper door” or whatever.",
      "created_utc": 1661879413.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ifipzb1",
      "author": "SLEG48",
      "body": "Definitely. The fat characters were always one-note slobs or obsessed with food, and they were always a joke.",
      "created_utc": 1657401343.0,
      "score": 51,
      "context": [
        {
          "id": "ifiph6m",
          "author": "Sareeee48",
          "body": "Yeah it’s really disturbing how much diet culture shit made it into kids shows. And if there is ever a fat character, it’s always for a cruel joke to mock larger bodies.",
          "created_utc": 1657401112.0
        }
      ]
    },
    {
      "id": "ifmqmb5",
      "author": "U_got_no_jams",
      "body": "Oh my god yes!!!! The purpose of the bigger characters were literally supposed to be comedic SOLEY because they were big. Like wtffff!!?? That’s so fucked up! Often times these characters weren’t even fat!?",
      "created_utc": 1657481267.0,
      "score": 5,
      "context": [
        {
          "id": "ifiph6m",
          "author": "Sareeee48",
          "body": "Yeah it’s really disturbing how much diet culture shit made it into kids shows. And if there is ever a fat character, it’s always for a cruel joke to mock larger bodies.",
          "created_utc": 1657401112.0
        }
      ]
    },
    {
      "id": "ifiq4e2",
      "author": "SLEG48",
      "body": "Ugh, I felt so bad for Woody and the other fat characters on Disney shows. Their weight and “hilarious” binge issues were always joked about.",
      "created_utc": 1657401407.0,
      "score": 29,
      "context": [
        {
          "id": "ifiih46",
          "author": "None",
          "body": "I was rewatching Suite Life on Deck and there’s an episode where Woody fully binges and it’s like a joke that he can’t control himself around food and that’s why he’s the “fat one”. It was so blatantly obvious I had to turn it off afterwards it didn’t feel right anymore",
          "created_utc": 1657397967.0
        }
      ]
    },
    {
      "id": "ifipu9u",
      "author": "SLEG48",
      "body": "Oof Disney Channel HEAVILY dabbled in diet culture rhetoric on their shows. I didn’t want to make a post about that because it would probably take a few centuries to finish. And you’re absolutely right about Kate’s disordered eating. A lot of Disney shows loved to play into the jokes about the mean girl character having an eating disorder and play it off for laughs 😬",
      "created_utc": 1657401279.0,
      "score": 31,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        }
      ]
    },
    {
      "id": "ifiqryg",
      "author": "SLEG48",
      "body": "And how they started casting their lead actresses as more and more petite and slim as time passed (from Hilary Duff and Raven-Symoné —> Miley Cyrus and Selena Gomez —> Dove Cameron and Olivia Rodrigo) which made a lot of the newer youth insecure of their bodies, thinking they HAD to be short and slim. And the mom characters always had to be slim too, while the dads could be on the heavier side. It wasn’t enough for the kids to have body image issues, the moms watching it with their children were struggling too 😞",
      "created_utc": 1657401700.0,
      "score": 37,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        }
      ]
    },
    {
      "id": "ifj7zxc",
      "author": "hazy_night",
      "body": "I have a strong memory of a Lizzie McGuire episode where Lizzy's best friend had an ED.  The foods the friend ate really stuck with me and influenced my first ED diet",
      "created_utc": 1657409760.0,
      "score": 19,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        }
      ]
    },
    {
      "id": "ifmqysw",
      "author": "U_got_no_jams",
      "body": "Wizards of Waverley place had its moments too",
      "created_utc": 1657481423.0,
      "score": 3,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        }
      ]
    },
    {
      "id": "kzxm47q",
      "author": "Mikey21555",
      "body": "I am a bit older, so mid to late 90’s was like a how to guide for anorexia and/bulimia. Sammy Brady (a character on Days of Our lives) suddenly started b/p and poof she had lots of attention. Kelly Taylor on 90210 was anorexic for a whole episode, but hey she quit like it was nothing: it can’t be that bad? Hell even DJ Tanner from Full House was subjected to the quick ED episode.",
      "created_utc": 1713323062.0,
      "score": 2,
      "context": [
        {
          "id": "ifj3laj",
          "author": "babysfirstreddit_yx",
          "body": "yeah early 2000s was an absolute wasteland of diet culture hell. It was inescapable. I try to remember that when I get down on myself for \"falling for it.\"",
          "created_utc": 1657407641.0
        }
      ]
    },
    {
      "id": "ifn0978",
      "author": "SLEG48",
      "body": "Ugh, yes! When I found out that she was suffering from an ED while on iCarly, that made Dan writing her as the “masculine, food-loving” tomboy who eats giant amounts of food so awful.",
      "created_utc": 1657485445.0,
      "score": 8,
      "context": [
        {
          "id": "ifmqa5g",
          "author": "U_got_no_jams",
          "body": "Apparently Dan Schneider would purposefully trigger Jennet McCurdy despite knowing she had an eating disorder at the time. He would make scenes where she would eat a large so amount of food all the time, and that was supposed to be “funny”. One thing I remember vividly was Sam being the “foodie” so to speak… like that’s not even a personality trait?? I always found that a little weird. She was also very rash as a character which I’m sure was not easy on Jennet’s already weakened state. I also remember looking at Carly and Sam and seeing how thin they were when I was a kid. It’s crazy to me that I was thinking about that when I was a younger, those actors were kids too! I grew up with all these shows as well, it’s weird how integrated ed behaviors were in every day life, it explains a lot now. They still are, but at least there’s more awareness, the world could be doing so much better though. I can’t believe it but I remember that comment on Victorious about Ariana’s character being thin… when the characters themselves were thin too!!?? 90 pounds isn’t something to encourage! Kids are very impressionable.",
          "created_utc": 1657481115.0
        }
      ]
    },
    {
      "id": "ifiq8jc",
      "author": "Sareeee48",
      "body": "I’ve been thinking about rewatching drake and Josh but ugh I cannot bring myself to do it after this 😩 I think the only shows geared toward younger kids with a lot more representation and less asshole-ery was Degrassi.",
      "created_utc": 1657401457.0,
      "score": 29,
      "context": [
        {
          "id": "ifiph6m",
          "author": "Sareeee48",
          "body": "Yeah it’s really disturbing how much diet culture shit made it into kids shows. And if there is ever a fat character, it’s always for a cruel joke to mock larger bodies.",
          "created_utc": 1657401112.0
        },
        {
          "id": "ifipzb1",
          "author": "SLEG48",
          "body": "Definitely. The fat characters were always one-note slobs or obsessed with food, and they were always a joke.",
          "created_utc": 1657401343.0
        }
      ]
    },
    {
      "id": "ifitd6p",
      "author": "None",
      "body": "That is just so sad, you’re so right! I loved That’s So Raven! that was one of my favorite shows because Raven was so funny. The body positivity episode with the fashion show was such a great one too!!",
      "created_utc": 1657402888.0,
      "score": 30,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        },
        {
          "id": "ifiqryg",
          "author": "SLEG48",
          "body": "And how they started casting their lead actresses as more and more petite and slim as time passed (from Hilary Duff and Raven-Symoné —> Miley Cyrus and Selena Gomez —> Dove Cameron and Olivia Rodrigo) which made a lot of the newer youth insecure of their bodies, thinking they HAD to be short and slim. And the mom characters always had to be slim too, while the dads could be on the heavier side. It wasn’t enough for the kids to have body image issues, the moms watching it with their children were struggling too 😞",
          "created_utc": 1657401700.0
        }
      ]
    },
    {
      "id": "ifmz9p3",
      "author": "SLEG48",
      "body": "When Alex’s parents praised Harper for drinking a smoothie for lunch, then looked disgusted at Alex eating a hotdog 😣",
      "created_utc": 1657485024.0,
      "score": 3,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        },
        {
          "id": "ifmqysw",
          "author": "U_got_no_jams",
          "body": "Wizards of Waverley place had its moments too",
          "created_utc": 1657481423.0
        }
      ]
    },
    {
      "id": "l0ophy7",
      "author": "babysfirstreddit_yx",
      "body": "Damn it sounds like the 90s walked so the 2000s could run!! Even more than WHAT we eat, I truly believe the attitudes that American culture has promoted in regard to HOW we eat has messed up more people than anyone would care to admit. None of this is healthy.",
      "created_utc": 1713752378.0,
      "score": 3,
      "context": [
        {
          "id": "ifj3laj",
          "author": "babysfirstreddit_yx",
          "body": "yeah early 2000s was an absolute wasteland of diet culture hell. It was inescapable. I try to remember that when I get down on myself for \"falling for it.\"",
          "created_utc": 1657407641.0
        },
        {
          "id": "kzxm47q",
          "author": "Mikey21555",
          "body": "I am a bit older, so mid to late 90’s was like a how to guide for anorexia and/bulimia. Sammy Brady (a character on Days of Our lives) suddenly started b/p and poof she had lots of attention. Kelly Taylor on 90210 was anorexic for a whole episode, but hey she quit like it was nothing: it can’t be that bad? Hell even DJ Tanner from Full House was subjected to the quick ED episode.",
          "created_utc": 1713323062.0
        }
      ]
    },
    {
      "id": "ifosdh9",
      "author": "U_got_no_jams",
      "body": "That really broke my soul honestly. She was so young, and her mom was giving her a hard time as well. I’m glad she’s more open about it now, but whenever I watch an episode of iCarly I always pay attention to sam, and looking back, the tropes were awful!",
      "created_utc": 1657516943.0,
      "score": 6,
      "context": [
        {
          "id": "ifmqa5g",
          "author": "U_got_no_jams",
          "body": "Apparently Dan Schneider would purposefully trigger Jennet McCurdy despite knowing she had an eating disorder at the time. He would make scenes where she would eat a large so amount of food all the time, and that was supposed to be “funny”. One thing I remember vividly was Sam being the “foodie” so to speak… like that’s not even a personality trait?? I always found that a little weird. She was also very rash as a character which I’m sure was not easy on Jennet’s already weakened state. I also remember looking at Carly and Sam and seeing how thin they were when I was a kid. It’s crazy to me that I was thinking about that when I was a younger, those actors were kids too! I grew up with all these shows as well, it’s weird how integrated ed behaviors were in every day life, it explains a lot now. They still are, but at least there’s more awareness, the world could be doing so much better though. I can’t believe it but I remember that comment on Victorious about Ariana’s character being thin… when the characters themselves were thin too!!?? 90 pounds isn’t something to encourage! Kids are very impressionable.",
          "created_utc": 1657481115.0
        },
        {
          "id": "ifn0978",
          "author": "SLEG48",
          "body": "Ugh, yes! When I found out that she was suffering from an ED while on iCarly, that made Dan writing her as the “masculine, food-loving” tomboy who eats giant amounts of food so awful.",
          "created_utc": 1657485445.0
        }
      ]
    },
    {
      "id": "ifirew8",
      "author": "SLEG48",
      "body": "Degrassi was really good with its representation of all body shapes and sizes, particularly because they were treated as an afterthought to the personalities and stories of the characters ❤️ And I forgot about Drake and Josh, another Schneider Nickelodeon sitcom that was laced with diet culture",
      "created_utc": 1657401990.0,
      "score": 23,
      "context": [
        {
          "id": "ifiph6m",
          "author": "Sareeee48",
          "body": "Yeah it’s really disturbing how much diet culture shit made it into kids shows. And if there is ever a fat character, it’s always for a cruel joke to mock larger bodies.",
          "created_utc": 1657401112.0
        },
        {
          "id": "ifipzb1",
          "author": "SLEG48",
          "body": "Definitely. The fat characters were always one-note slobs or obsessed with food, and they were always a joke.",
          "created_utc": 1657401343.0
        },
        {
          "id": "ifiq8jc",
          "author": "Sareeee48",
          "body": "I’ve been thinking about rewatching drake and Josh but ugh I cannot bring myself to do it after this 😩 I think the only shows geared toward younger kids with a lot more representation and less asshole-ery was Degrassi.",
          "created_utc": 1657401457.0
        }
      ]
    },
    {
      "id": "ifj60np",
      "author": "SLEG48",
      "body": "That fashion show episode was iconic 👏 Honestly, the early 2000s is a very confusing era for me in terms of children’s media, because you have timeless life lessons they taught you (like about body positivity, racism, divorce, diversity, etc.), but they also had casually homophobic and fatphobic jokes and diet culture rhetoric 😵‍💫",
      "created_utc": 1657408803.0,
      "score": 20,
      "context": [
        {
          "id": "ifik992",
          "author": "None",
          "body": "Disney channel probably did it too lol let’s talk toxic diet culture in Disney shows. Didn’t Kate have an eating disorder in The Lizzie McGuire movie?",
          "created_utc": 1657398769.0
        },
        {
          "id": "ifiqryg",
          "author": "SLEG48",
          "body": "And how they started casting their lead actresses as more and more petite and slim as time passed (from Hilary Duff and Raven-Symoné —> Miley Cyrus and Selena Gomez —> Dove Cameron and Olivia Rodrigo) which made a lot of the newer youth insecure of their bodies, thinking they HAD to be short and slim. And the mom characters always had to be slim too, while the dads could be on the heavier side. It wasn’t enough for the kids to have body image issues, the moms watching it with their children were struggling too 😞",
          "created_utc": 1657401700.0
        },
        {
          "id": "ifitd6p",
          "author": "None",
          "body": "That is just so sad, you’re so right! I loved That’s So Raven! that was one of my favorite shows because Raven was so funny. The body positivity episode with the fashion show was such a great one too!!",
          "created_utc": 1657402888.0
        }
      ]
    },
    {
      "id": "ifrmqsm",
      "author": "SLEG48",
      "body": "Right! Jeanette was suffering so much all throughout her adolescence, a time when you’re already self-conscious enough 😣 One of eating disorders’ main causes is control, because you don’t have any control in anything else in your life (her overbearing mother) other than food",
      "created_utc": 1657570857.0,
      "score": 3,
      "context": [
        {
          "id": "ifmqa5g",
          "author": "U_got_no_jams",
          "body": "Apparently Dan Schneider would purposefully trigger Jennet McCurdy despite knowing she had an eating disorder at the time. He would make scenes where she would eat a large so amount of food all the time, and that was supposed to be “funny”. One thing I remember vividly was Sam being the “foodie” so to speak… like that’s not even a personality trait?? I always found that a little weird. She was also very rash as a character which I’m sure was not easy on Jennet’s already weakened state. I also remember looking at Carly and Sam and seeing how thin they were when I was a kid. It’s crazy to me that I was thinking about that when I was a younger, those actors were kids too! I grew up with all these shows as well, it’s weird how integrated ed behaviors were in every day life, it explains a lot now. They still are, but at least there’s more awareness, the world could be doing so much better though. I can’t believe it but I remember that comment on Victorious about Ariana’s character being thin… when the characters themselves were thin too!!?? 90 pounds isn’t something to encourage! Kids are very impressionable.",
          "created_utc": 1657481115.0
        },
        {
          "id": "ifn0978",
          "author": "SLEG48",
          "body": "Ugh, yes! When I found out that she was suffering from an ED while on iCarly, that made Dan writing her as the “masculine, food-loving” tomboy who eats giant amounts of food so awful.",
          "created_utc": 1657485445.0
        },
        {
          "id": "ifosdh9",
          "author": "U_got_no_jams",
          "body": "That really broke my soul honestly. She was so young, and her mom was giving her a hard time as well. I’m glad she’s more open about it now, but whenever I watch an episode of iCarly I always pay attention to sam, and looking back, the tropes were awful!",
          "created_utc": 1657516943.0
        }
      ]
    },
    {
      "id": "ifrmuiy",
      "author": "U_got_no_jams",
      "body": "So sad, I hope she’s doing ok. :(",
      "created_utc": 1657570897.0,
      "score": 4,
      "context": [
        {
          "id": "ifmqa5g",
          "author": "U_got_no_jams",
          "body": "Apparently Dan Schneider would purposefully trigger Jennet McCurdy despite knowing she had an eating disorder at the time. He would make scenes where she would eat a large so amount of food all the time, and that was supposed to be “funny”. One thing I remember vividly was Sam being the “foodie” so to speak… like that’s not even a personality trait?? I always found that a little weird. She was also very rash as a character which I’m sure was not easy on Jennet’s already weakened state. I also remember looking at Carly and Sam and seeing how thin they were when I was a kid. It’s crazy to me that I was thinking about that when I was a younger, those actors were kids too! I grew up with all these shows as well, it’s weird how integrated ed behaviors were in every day life, it explains a lot now. They still are, but at least there’s more awareness, the world could be doing so much better though. I can’t believe it but I remember that comment on Victorious about Ariana’s character being thin… when the characters themselves were thin too!!?? 90 pounds isn’t something to encourage! Kids are very impressionable.",
          "created_utc": 1657481115.0
        },
        {
          "id": "ifn0978",
          "author": "SLEG48",
          "body": "Ugh, yes! When I found out that she was suffering from an ED while on iCarly, that made Dan writing her as the “masculine, food-loving” tomboy who eats giant amounts of food so awful.",
          "created_utc": 1657485445.0
        },
        {
          "id": "ifosdh9",
          "author": "U_got_no_jams",
          "body": "That really broke my soul honestly. She was so young, and her mom was giving her a hard time as well. I’m glad she’s more open about it now, but whenever I watch an episode of iCarly I always pay attention to sam, and looking back, the tropes were awful!",
          "created_utc": 1657516943.0
        },
        {
          "id": "ifrmqsm",
          "author": "SLEG48",
          "body": "Right! Jeanette was suffering so much all throughout her adolescence, a time when you’re already self-conscious enough 😣 One of eating disorders’ main causes is control, because you don’t have any control in anything else in your life (her overbearing mother) other than food",
          "created_utc": 1657570857.0
        }
      ]
    }
  ]
}